				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Husband&#39;s Grandmother&#39;s Shrimp Gumbo"
,"datePublished": "2008-11-23T15:09:11.000-05:00"
,"dateModified": "2008-11-23T15:09:11.000-05:00"
,"author": [
{"@type": "Person"
,"name": "ranch_maven"
,"url": "https://www.allrecipes.com/cook/1497875"
}
]
,"description": "Here&#39;s an old-school gumbo with shrimp, sausage, bacon, okra, the holy trinity, and a roux that is painstakingly stirred and cooked into a warm chocolate color, to deepen and enrich the flavor. Serve this over hot cooked rice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/--rDUnTDxV2vxkXGVfG1SqaAqe8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2432856-husbands-grandmothers-shrimp-gumbo-Allrecipes-Magazine-4x3-1-1a2bae36dd32489cb45870abf07a2ea6.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Husband&#39;s Grandmother&#39;s Shrimp Gumbo"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "102"
}
,"cookTime": "PT135M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "344 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "165 mg"
,"fiberContent": "2 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "922 mg"
,"sugarContent": "3 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 pound smoked sausage links, cut into 1/4-inch slices",
"0.25 pound bacon, chopped",
"2 cups chopped okra",
"1 (14.5 ounce) can diced tomatoes with green chile peppers",
"0.5 cup unsalted butter",
"0.66666668653488 cup all-purpose flour",
"2 cups chopped onion",
"0.5 cup chopped green onions",
"0.66666668653488 cup finely chopped green bell pepper",
"0.66666668653488 cup finely chopped celery",
"2 tablespoons chopped fresh parsley",
"2 tablespoons minced garlic",
"2 cups water",
"salt to taste",
"ground black pepper to taste",
"0.25 teaspoon cayenne pepper",
"1 teaspoon dried thyme",
"2 bay leaves",
"6 cups water",
"2 pounds uncooked medium shrimp, peeled and deveined" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Brown the sausage in a skillet over medium heat, discard the fat in the skillet, and drain the sausage slices on paper towels to absorb any excess grease. Set the sausage aside. Cook and stir the chopped bacon in the skillet until crisp, 6 to 8 minutes, remove the bacon, and set aside. Stir the okra into the hot bacon drippings, and cook and stir until the okra is tender, about 5 minutes. Drain the okra in a colander, and discard bacon drippings."
} ,{
"@type": "HowToStep"
,"text": "Place the okra and diced tomatoes in a saucepan over medium heat, and bring to a simmer. Reduce heat to medium-low, and simmer the okra mixture for about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "In a large soup pot, melt the butter over medium heat, and cook and stir the onion, green onions, green pepper, celery, parsley, and garlic until the onion begins to turn brown, about 10 minutes. Remove the vegetables but leave the butter in the pot. Stir in the flour, reduce heat to low, and cook the roux, stirring constantly, until it turns the color of milk chocolate, 30 to 45 minutes. Do not let the roux burn."
} ,{
"@type": "HowToStep"
,"text": "When the roux reaches its correct color, whisk in 2 cups of water. Raise the heat to medium; stir in salt, pepper, cayenne pepper, thyme, and bay leaves, bring the mixture to a boil, and stir in the sausage, bacon, okra-tomato mixture, and 6 more cups of water. Reduce heat to medium-low, and simmer the gumbo, stirring occasionally, until the soup has thickened and the flavors are blended, about 45 minutes. Stir in the shrimp, and simmer until they turn pink and opaque, 6 to 8 more minutes. Discard bay leaves and adjust the seasonings, if desired, before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT180M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura M"
},
"reviewBody": "Delicious as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bethbochnakgmailcom"
},
"reviewBody": "Loved it. Even better when we swapped out water for shrimp broth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am in the process of making this recipe and I can't wait to taste it; however, I'm wondering when/if I add the sauteed and removed vegetables back into the soup/gumbo? I've read over the recipe many times but maybe I'm just missing it. i plan to add it back into the soup after the roux is made; however, I don't see where it says to do that. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I’m no gumbo expert but this tastes like what I had in New Orleans, which was a lot different than any gumbo I’ve ever had living in California. I followed the recipe pretty faithfully except I added a tablespoon of better than bullion chicken flavor and about a teaspoon of old bay seasoning, and rather than cooking the green onions I put a big handful on top to serve. It was amazing! A bit of work but well worth it. This will be my gumbo recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NeeterWoman"
},
"reviewBody": "I made it, but used regular canned diced tomatoes instead and added Louisiana Hot Sauce (apprx 1t.) to taste. My hubby loved it; I had to assure him that I had the recipe \"saved\". LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dentex1956"
},
"reviewBody": "The pot of gumbo is still cooking and looks delicious. But I think Step 4 left out adding the vegetables that were sauteed in the butter. I did it anyway and hope to sample it in about 35 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Pitts"
},
"reviewBody": "I made this in the crockpot which was a mistake. I added everything in but the shrimp. Veggies turned to mush. Sausage &amp; bacon lost its flavor. Added the shrimp for the last hr. All around flavor was good but would change a lot if I were to do this in the crockpot again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tkroeplin"
},
"reviewBody": "time consuming, but very, very good. perfect to make on a lazy fall day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Venus-Fenrich"
},
"reviewBody": "This truly is the best gumbo I have ever had! Loved the \"dirty rue\" my husband said.\nWill be making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimbra Thomas"
},
"reviewBody": "Delicious!! I added some lump crab and used a roux starter but goodness gracious this is better than restaurants that serve it in KY/OH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amelia Drake Rivera"
},
"reviewBody": "This was probably the best gumbo I’ve ever had. I surprised my husband with it for his birthday, and while it was a little more work than other gumbos we’ve made, it was well worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "I have made this several times, but I never get it to be the milk chocolate color. I guess I get too warm standing over the stove to keep stirring the roux. But,anyhow I always think it comes out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Garth"
},
"reviewBody": "This was fantastic! The whole family loved it. It was just a little tedious to prepare, but totally worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron Douglas"
},
"reviewBody": "I made this. Didn't make any changes other than 1/4 teaspoon red-chili vs 1 teaspoon. (sorry, I'm a weakling when it comes to HOT). I also used someone elses idea here by taking the shrimp shells and simmering them in chicken broth, garlic, bay leaves (2), salt/pepper. Filtered off the fluids and used that in place of water. WOW, WOW, WOW. This was absolutely awesome! Everyone loved it! Oh and one more thing. That roux - IS A MUST. I stirred mine for 45 minutes - seriously. It wasn't until about 30-35 minutes before I could actually see it changing color. But I knew that the darker color gives it that true nutty taste. Once I added the fluids, the importance of the roux was obvious. Wow. Just wow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "isma"
},
"reviewBody": "Very good Creole gumbo. Cajun gumbo is made with a roux, no okra or tomatoes. Excellent New Orleans style gumbo. Thanks for the recipe. Four stars because misnomer in type of gumbo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMILIO'S GRANNYE"
},
"reviewBody": "OK this is the first time that I ever made this recipe. I was extremely worried about it being too spicy for the people in Oregon folks not Louisiana… So I used Johnsonville andouille… Because I knew it would not be too hot and then I did not add the cayenne pepper. I did not add the can of peppers… But I did use poblano peppers which provided some heat and allowed the holy Trinity to take affect. I added the Cayenne After everything had cooked and melted together to bring up to the heat that I felt my group could handle. I read so many recipes of people trying to make the recipe un-hot that I felt this was the safest way to progress. It was a hit and everybody was happy and every bit of it went !!\nThis was an awesome awesome recipe and I have become a fan of the browned butter and flour as a base and other dishes yummy!\nI am sure that people from the south are going to skewer me for this recipe modification or two… But it’s no good if they don’t eat it… No matter how good it is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Montgomery"
},
"reviewBody": "Turned out great! I didnt have okra and I used chicken and beef broth instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ksimic"
},
"reviewBody": "Made this Gumbo today for lunch to feed 6 family members. Everyone including myself through this was very good. I will make this Gumbo again. I did change the water to chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmccranie"
},
"reviewBody": "I added chicken to mine. I always put my onion mixture back in... flavor was really good. Great recipe didnt have to alter ike most gumbo recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Jew-Vay"
},
"reviewBody": "I didn't have any bacon so I used butter. I also substituted Creole seasoning instead of all the individual seasonings. I added cubed chicken breast also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sammy Davis"
},
"reviewBody": "I doubled the recipe and forgot to buy the green onions, so I subbed in more white onions. I omitted the cayenne since some in my house don't appreciate the heat. I added 4tsp of salt and 2 tsp of black pepper. That seemed pretty good, with the knowledge people could always add more spices. It really turned out well. Here's where I ran into difficulty, after the veggies were sauteed in the butter they didn't want to separate from it. I had to place them into a strainer and catch the butter run off into a different bowl. As it happens, there was not enough re-claimed butter for the roux to work, and so I had to add another 1/2 cup in order to get it going properly. \n\nThis was a time consuming dish but I had alot of fun making it. Next time I will tweak some things and if I manage to improve the flavors I will post an update."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sammy Davis"
},
"reviewBody": "I doubled the recipe and forgot to buy the green onions, so I subbed in more white onions. I omitted the cayenne since some in my house don't appreciate the heat. I added 4tsp of salt and 2 tsp of black pepper. That seemed pretty good, with the knowledge people could always add more spices. It really turned out well. Here's where I ran into difficulty, after the veggies were sauteed in the butter they didn't want to separate from it. I had to place them into a strainer and catch the butter run off into a different bowl. As it happens, there was not enough re-claimed butter for the roux to work, and so I had to add another 1/2 cup in order to get it going properly. \n\nThis was a time consuming dish but I had alot of fun making it. Next time I will tweak some things and if I manage to improve the flavors I will post an update."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evacuate"
},
"reviewBody": "The first time I made this I didn’t have okra, so I substituted asparagus. Both times, I used up leftover ham (chopped up) in lieu of andouille , because I wanted to get rid of it. It was delicious each time. It’s a very forgiving recipe as long as you cook the holy trinity and don’t “ ROUXin” the roux. Next time I hope to have all the proper ingredients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Tubinis"
},
"reviewBody": "While this recipe is simple it takes time to execute properly to get all the richness it promises. I have tried shortcuts but it never comes out as delicious as this one did. I tend to bump up the spicyness of my dishes so I upped the cayenne dose, added some red hot and always like to add Worcestershire Sauce to my stews for special bite. Have tried hot italian, chorizo and smoked sausage and favor the smoked sausage version. Will certainly be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "It was very good but I agree with several reviews that it took so long to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Nickelberry"
},
"reviewBody": "I boiled the shrimp shells for an hour used the liquid for stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles Farren"
},
"reviewBody": "This was great followed recipe exactly as written just cut it in half sine only wife and i were eating. Rated it a five because should have made 6 servings and there was nothing left after the two of us had dinner very rare with us . Was as good as i have ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "the bug"
},
"reviewBody": "First time making gumbo. Adjusted a bit based upon friends from New Orleans and our own taste. Used pepper bacon and andouille sausage, added 1 chicken breast as I used it to make broth instead of using water. Added japaleno peppers, creole seasoning, and doubled cayenne. Added gulf shrimp at end after simmering entire mixture on low in instant pot. Really good. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Red"
},
"reviewBody": "Fantastic flavor. I followed the recipe, but the roux didnt turn color, and I had to add more liquid in order to use all of the flour. (I added the remainder of the bacon grease, which I think was a good decision) it was not as thick as I thought it should be, but still very, very good. my family loved it. I will make again, when I have half of a day to spend cooking. (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aloysius"
},
"reviewBody": "I have been looking for a good gumbo recipe. This is it.\nI am not into high levels of heat, preferring to savor the flavors and textures that comprise a good gumbo, so there were no chile peppers in mine and rather less of the other forms of chemical heat. I substituted cilantro for the parsley just because (I generally have cilantro in the fridge and any parsley not used in the recipe would have been tossed) and used a large can of sliced stewed tomatoes that I had purchased by accident. I had to laugh at myself when I realized that one of my saucepans contained \"stewed tomatoes and okra\", a dish I despise! Not sure whether my roux ever achieved the proper chocolate color, but the end result was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duanebowman"
},
"reviewBody": "Good traditional recipe. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Pesicka"
},
"reviewBody": "I followed this to the letter with the exception of the okra. I used frozen, I added 2 cups to my bacon drippings and let warm in the oven. This meal has the perfect amount of spice and deep flavors. I got this recipe to make for an elderly friend of mine from New Orleans who has cancer. He still has a wonderful appetite and has been craving gumbo like his momma used to make. Thank you for this wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cissi Coonce"
},
"reviewBody": "This was wonderful! Have to be careful NOT to burn the roux but oh so worth it! 5 stars plus!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah"
},
"reviewBody": "I made this on Friday. I messed up a bit in that I made the roux and forgot to put the veggies in until after. I therefore left them in when I put it all together. As I don't like things hot (spicy) I added just a pinch of Cayenne and a pinch of Cajun seasoning. I also used a few tablespoons of green chili. All in All, it was terrific and one of the best meals I have had in quite awhile. Note, I don't cook much as I am usually just cooking for me. In the end I divided the finished recipe into five Rubbermaid \"take alongs\". I gave two away to a friend and will eat the last one for lunch today. I am really looking forward to lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WaywardSon"
},
"reviewBody": "In spite of the fact that I usually don't use a recipe for Gumbo, and generally make the roux first, I decided to make this according to the recipe. Glad I did. Came out just right and was the real deal. Thanks for an excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "southern grandma"
},
"reviewBody": "There were no instructions as to what is done with sautéed vegetables, but I assumed they were to be added back to the pot with the sausage, bacon, and okra-tomato mixture? This was my first time making shrimp gumbo and my husband and I loved it. I halved the recipe this time but will use the recipe, as is, next time, in order to freeze leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "It was very good. I omitted the okra and tomatoes due to everyone does not like okra. Next time I think I will do the okra and tomatoes on the side so those that like it can add it to their dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "marjohnal"
},
"reviewBody": "Lots of work and dishes this one. Not adverse to that but it's gotta be worth it and not sure this one was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sirving"
},
"reviewBody": "I gotta tell ya I loved this ! I did not really make any changes, I just used the bacon grease for flavor and did not discard it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tinlizzy73"
},
"reviewBody": "Well worth the time and effort. Came out so good that next time I will double recipe and freeze half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Curtis"
},
"reviewBody": "I didn't change anything about this recipe. Just as is it was wonderful. My whole family loved it so much, we will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAperson"
},
"reviewBody": "Excellent recipe - but you can take it up another notch by using homemade stock made from crab, shrimp or crawfish shells instead of the water. Lobster shells would work too. I save all the shells and heads and cook them for about an hour with the trinity and some peppercorns and then strain. I keep the shells in my freezer until I have a bunch. Then I store the stock in 1-2 cup portions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Borawski Derian"
},
"reviewBody": "Awesome! The only thing I would do differently is leave the lid off the pot while simmering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Robert F Anderson"
},
"reviewBody": "It's a pretty decent gumbo, but I'm going to keep searching for that recipe that I can internalize and \"make my own\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle"
},
"reviewBody": "Careful about the spice level. I added extra Rotelle, and overspiced it. But adding fresh chopped tomatoes tempered the heat, and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reginald Smith Jr."
},
"reviewBody": "Great recipe and easy to follow. I added crab legs but followed everything else precisely. It came out great, my friends says it taste like it came from a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pringle723"
},
"reviewBody": "My hubby and I made it, it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sven Alongtime"
},
"reviewBody": "I made this for my wife on a cold february northern michigan night. This recipe is to die for. Turns out perfect. I have since made this a staple recipe for when the in-laws visit from the south. They love it as do I."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdl"
},
"reviewBody": "I absolutely loved it!! It did take a long time to prepare and cook, but it was all worth it! My husband helped so we made it fun..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan O'Hashi"
},
"reviewBody": "I made a batch last night, but didn't have any sausage and substituted shrimp. It's mighty tasty and I committed the recipe to memory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amushrush"
},
"reviewBody": "This is super delicious. I do not like bland recipes and often tweak/add spices but not in this recipe! It's perfect!!! I replace the shrimp with chicken sometimes just bc I have a friend w shellfish allergy and also in Indiana finding good shrimp is challenging."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trysomethingnew30"
},
"reviewBody": "On a whim, I bought some andouille chicken sausage and had it in the freezer. Since I never cook with it, I didn't really know what I would do with it. This recipe was perfect for it! My husband and I both really enjoyed this gumbo and it tasted even better the next day (I saved some uncooked shrimp to warm up for leftovers the next day). Although the roux is time consuming, it's a step that is worth it. The sausage added its own heat to the gumbo so I skipped the cayenne pepper and added more garlic because we love it, but other than that, I followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Wilkes"
},
"reviewBody": "Delicious! And I used turkey sausage and turkey bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lbcobb"
},
"reviewBody": "I added bacon, grilled chicken, and one bottle of beer (substitute for same volumn of liquid). Very Yummy over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Norman Epstein"
},
"reviewBody": "20 mins. into stirring the roux, I was questioning if it was worth the effort....the answer is yes (it took 45 mins and only got a dark caramel color). The broth was outstanding. I skipped the okra and used smoked turkey sausage. I did not like it over rice b/c I felt the broth (best part) got lost. Just serve in a bowl with good bread on the side for soaking. Even my very picky family liked it and they'er like Mikey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Miller Hamrick"
},
"reviewBody": "I loved this recipe! I only used half the amount of water because I like it thicker and I didnt spend as long on my roux, about 15 minutes but still was great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "Wow! This was nothing short of amazing! I did have to tweak it slightly because I am allergic to beef/pork. I used smoked turkey and chopped it up in place of the bacon and I used Butterball Everyday turkey link sausage. This was my first real gumbo and I WILL be making this many times more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lea M."
},
"reviewBody": "I have made gumbo twice, both with a roux (browned flour) and I just don't like the taste of roux. This recipe calls for 2/3 cups of flour and 1/2 cup butter, and although the I achieved the great appearance of the gumbo dish, the base tasted like the browned flour. I would try this again, maybe in another month since this is an expensive and labor intensive dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felecia1331"
},
"reviewBody": "the best! amazing flavor, although I don't put okra in mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iszalai"
},
"reviewBody": "I made this for New Years Day and it was wonderful. This was my first time making Gumbo and Roux for that matter. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenda Holsten Hibbert"
},
"reviewBody": "Wow this is really good! I'm not much of a cook, but I followed the directions accordingly and it's delicious. I forgot to buy a green pepper, but I had fresh mushrooms, so I threw them in. Also added another can of spicey (Rotelle) tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grobiegirl1"
},
"reviewBody": "I wanted to make something nice and special on Fat Tuesday, so I decided to try this. I followed it exactly, and everyone in my family loved it! Had some leftover, and I enjoyed it just as much second time around! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "becsuehen"
},
"reviewBody": "Nothing special with this one. Had to add tons of salt and other seasoning to bring it up to speed. Will not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "Bacon in gumbo now??!! We loved it lol!! Served this over rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MHenry"
},
"reviewBody": "I made this for Father's Day. It was time consuming but well worth the effort. It wasn't hard just a lot steps. Everyone raved about it and asked for the recipe. I'll make it again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cculpepper"
},
"reviewBody": "This was fabulous! I made it last night exactly by the recipe, and it turned out great! We served it over rice with crusty french bread, and it made a hearty meal. Anyone planning to make it needs, to set aside several hours, but it's WELL worth it. My only advice is to wear comfortable shoes because you'll be stirring the roux for a looooong time. Stir it until you think nothing's going to happen, then stir it a while longer, and it will be ready. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gizzie0615"
},
"reviewBody": "I've never made gumbo before but had it at a friends house and I had to make it myself. This recipe is the best! Very time consuming but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2CookMommy"
},
"reviewBody": "Well rounded flavors. I love the texture varieties and colors. Having 3 types of meat gives me a biased opinion thought! I will hopefully be making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elva Baez"
},
"reviewBody": "It was a very delicious dish although it was very time consuming it all went well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grass is greener"
},
"reviewBody": "Use less liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alanasmom"
},
"reviewBody": "The gumbo was wonderful, I left out the sausage and used crabmeat in addition to the shrimp. Lots of ingredients but a smaller yield than I would have liked. I will say that this really does take a long time, but it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne"
},
"reviewBody": "I made gumbo for the first time using this recipe. From the raves I received from all those that ate it, I can honestly say it was a big success. Wonderful recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chlorchid"
},
"reviewBody": "I cut this in half and served it over rice with Artisan bread. Easy, delicious, and the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reese J."
},
"reviewBody": "This dish is absolutely delicious, I made it w/o the okra b/c I had none but those were majority of my alterations. Puts me back on Bourbon street and warms me to my toes, this recipe is going straight into my cookbook :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nurselady77"
},
"reviewBody": "I live in south Louisiana and have been making gumbo for 40 years. Thsi is absolutely the best gumbo recipe I have made and actually the only time that I have used a recipe for years. My husband loved it and he is a true cajun. Don't leave anything out. Since I don't like to stand a long time with the roux, I have started using Savoie's Real Cajun Roux, it is a dry browned flour and comes in a pint jar. You cannot tell the difference from the roux that you make yourself. I wish I would have had it years ago. Anyone that wants a real southern cajun gumbo, just has to make this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kthon80"
},
"reviewBody": "My husband LOVED it, as he loves anything spicy and Cajun. Personally, even though I'm not a finicky eater, didn't care much for it. Too many textures. But it's a good recipe and I\"ll make it again if only for him! LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JPhilip03"
},
"reviewBody": "I have tried about 5 different gumbo recipes over the past couple of years, played with them and tried to tweak them to get the taste I wanted. Didn't have to do a thing to this one...it is PERFECT and tastes just like the gumbo I had while visiting LA. Thanks for a GREAT recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dsb1147"
},
"reviewBody": "I have been looking for a cajun shrimp gumbo like my great grandmother used to make, and this really, really comes close. The secret is the canned tomatoes and peppers. She always used it in all her cooking."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213572/husbands-grandmothers-shrimp-gumbo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
"name": "Gumbo Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213572/husbands-grandmothers-shrimp-gumbo/",
"name": "Husband&#39;s Grandmother&#39;s Shrimp Gumbo"
}
}
]
}
}
, "about": [
]
}
]