				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ice Box Fruitcake"
,"datePublished": "1999-12-20T11:11:46.000-05:00"
,"dateModified": "2022-07-14T16:16:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Elaine Harper"
,"url": "https://www.allrecipes.com/cook/24323131"
}
]
,"description": "I don&#39;t know if this is a regional dish or what ... but NO ONE I talk to seems to have ever heard of it except the people in my family... and most people act like it&#39;s sooooo ODD ... but it&#39;s really yummy and it&#39;s really simple common ingredients ..."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/REGz0yrygybb1nc8z6vzdWxrcZ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/51178-d8495ab0ff494595ac6306bc563f7698.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ice Box Fruitcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "69"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "356 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "10 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "111 mg"
,"sugarContent": "23 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup chopped pecans",
"1 cup chopped walnuts",
"1 cup chopped raisins",
"1 (4 ounce) jar maraschino cherries, drained and chopped",
"1 (14 ounce) can sweetened condensed milk",
"1 (12 ounce) package vanilla wafers, crushed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, stir together the pecans, raisins, walnuts, cherries, condensed milk and vanilla wafers. Dough will be very thick, you will need to use your hands."
} ,{
"@type": "HowToStep"
,"text": "Form dough into a ring shape on top of a dinner plate. Wrap in many layers of plastic wrap and/or aluminum foil. Allow to age in the refrigerator for at least a week. The flavors will have a chance to blend and all of the milk will be absorbed into the cake."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mlhester74"
},
"reviewBody": "I love this recipe! I am from central Florida and this recipe was given to me by my grandmother. So delicious and nostalgic. \n\nIn addition to making the cake in a loaf pan, I have also rolled the mixture into bite-sized balls. Great for a dessert buffet or gift giving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lowerbamagal"
},
"reviewBody": "My family loves this icebox fruit cake. My grandmother used to make one every Christmas in the 60's and early 70's and now my mother carries on the tradition. It is easy to make, but we leave out the walnuts and we use vanilla wafers instead of gram crackers and keep it in the freezer and nibble on it as long as it last. Delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Grice"
},
"reviewBody": "Definitely mini marshmallows sound awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Wilson"
},
"reviewBody": "My grandma was from GA and made this for my birthday every year. Instead of vanilla wafers she used graham cracker crumbs. Everyone loved it. It’s just very dense and sweet!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dorothy Fleming Scott"
},
"reviewBody": "Made this in high school home economics class. I thought this was a clever idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arendora"
},
"reviewBody": "OMG! My mom used to make this every Christmas! This stuff is awesome. One year she couldn't find vanilla wafers and used Graham crackers and it was delicious, now my entire family makes both versions (Just another reason to gain 30 lbs during Christmas lol)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Bennett"
},
"reviewBody": "I added coconut to mine much better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Forester"
},
"reviewBody": "My aunt Patricia died without sharing this recipe with anyone!!! After I read the reviews, I am convinced it was how she did it.... She also used graham crackers candied fruit in the little clear plastic cartons with the green cherries and pinapple in it and added a little cinnamon and allspice because you could taste it. She would line loaf pans with wax paper and not use a bundt pan. It wasn't Christmas without one. I think this is a southern dish too... my inlaws and outlaws from up north never have seen or heard of it.\nWhen she died... her brother inlaw was upset because she didn't give out the recipe to any of us. I think that's why he cried the most.\nI will have to make one for uncle Buddy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lela Mac"
},
"reviewBody": "As many have said, Graham crackers are an option in place of the vanilla wafers. I also add coconut, and just pecans (no walnuts). It has gotten great reviews so far. I just finished a double-batch today, and have placed in in the \"ice box\" using the wax paper and graham cracker boxes. I'll bring it out on Christmas Day! On a side note, I didn't use the whole box of crackers for the recipe, but a bit more than 2/3 of it. I'm thinking this will add a bit more moistness. This second batch I also added a dash of cherry juice from the jar! My Dad said it was just like Mama's - a definite compliment!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakeNsing"
},
"reviewBody": "My family has been making this for years. It is Daddy's favorite. I just made two of them last night, only I used candied cherries. Mama sometimes adds dates instead of raisins. This is more like a candy than a cake, and it really is delicious!!Thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rehnada Grahn"
},
"reviewBody": "My mom and I have made this many times. To me Christmas is not Christmas without Ice Box Fruit Cake. We leave out the Walnuts and add 1 cup of coconut. I am sure that leaving the walnuts in would be good as well. It is AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cyndie"
},
"reviewBody": "We did not care for the texture. I won't be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Goens Parkerson"
},
"reviewBody": "My grandmother, also from northern Alabama made this when I was little. She would put hers in a wax paper lined box"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Reid"
},
"reviewBody": "My family makes a version of this we call Ice Box Cake, and it's the same, but without walnuts and cherries. It is a Christmas tradition passed on by my Grandma, who was from Arkansas. Our family loves this cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CeCe"
},
"reviewBody": "I lived in Alabama up until 3 months ago, and I made this as well as friends, neighbors and relatives. The funny thing is, I wouldn't try it until a friend from Indiana made it. I love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliette Lee Adams"
},
"reviewBody": "We make this with graham crackers. We've had it on our table at Christmas for as long as I can remember. I'm from an hour north of Mobile, Ala. I wonder if the original recipe came out in some sort of Alabama Living magazine. Maybe that's why so many Alabamians are chiming in about making it. For those who haven't tried it.... Mmm! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shirley Ponder"
},
"reviewBody": "Our family's recipe calls for\n1) melt 2 sticks of butter or oleo &amp; 11lb marshmallows\n2) add 1-lb crushed graham crackers, 1-lb chopped pecans or 1/2 lb each of pecans &amp; walnuts- more won't hurt\n3) add 1-lb golden raisins, 8-oz jar ?? ?? &amp; 3-tbs of the juice\n4) place in buttered ?? pan that's lined with wax paper\nChill thoroughly or make several &amp; freeze"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Thank u! Yes my mother made this in GA, and few people have the recipe. She put her cake in a wax paper lined vanilla wafer box with 1 of the large box sides cut out. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donnaproutytiger"
},
"reviewBody": "Yes love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy1950"
},
"reviewBody": "I have looked for this recipe for years. It was on the graham cracker\nbox and the vanilla wafer box in the late 1960's. The company's sold and I have never been able to find recipe again. Have seen others but not this one. Is great. Thank you for posting. - Cindy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Beck Voci"
},
"reviewBody": "I haven looking for this recipe for years! My mom made this every Christmas. She would pack it back in the wax bag the wafers were in and back in the box so it was easy to slice in thin slices"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandie Barnett"
},
"reviewBody": "I have wanted this recipe for years. A small store near home use to make it for sale. They used graham crackers crushed. And I think they added dates. Thanks for posting this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hilda"
},
"reviewBody": "Thank you for this recipe! I've been looking for it for many years. My mother made this at Christmastime and it was delicious. She pressed it into a 13x9\" Pyrex dish &amp; covered with foil. This brings back such fond memories growing up in North Alabama."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melna Phelps"
},
"reviewBody": "I make this cake every year I grew up in South Alabama . I agree it must be a Southern recipe. My family has made it for as long as anyone can remember. There are different versions of it in the family.My Mom used candied cherries,candied pineapple ,fresh coconut,raisins, vanilla wafers,&amp; condensed milk. Oh so very rich and tasty !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkdean"
},
"reviewBody": "I am from Georgia, and my granny used to make this and know body had the recipe. While visiting in Georgia my aunt gave me the ingredients that were wrote down many many years ago, but that's all. No directions....I am so happy to find this, it has every ingredient that's on that paper I have.....God Bless you and thank you for sharing...I love you and will fill my granny alittle bit closer now!Kay Dean"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "We didn’t like it and found the consistency way too mushy and mealy. The longer it sat to blend the flavors, the mushier and mealier it became. It didn’t slice nicely to present to guests. Not a keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody"
},
"reviewBody": "My family has made Ice Box Fruit Cake for years with graham crackers. The kids always enjoy crushing the gram crackers in a pillow case. People always say \" I don't like fruit cake\" This taste different than \"Fruitcake\" Everyone loves this one. I am trying it with vanilla wafers this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "I have been looking for this recipe for a few years now. My mom would always make this cake for Christmas and everyone loved it so much. A lot of people do not like fruit cake, but this one got them hooked. It may be a regional recipe, I'm from Mississippi and friends here in Louisiana have never heard of this cake. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lori Manuel"
},
"reviewBody": "My mother and grandmother made during Christmas Holidays (from Louisiana). I havent met anyone until now that's even heard of it. It's delicious though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynette Coleman"
},
"reviewBody": "My neighbor delivered some of this yesterday and I have to say I'm hooked. It is really good! I believe she does add coconut, but she pressed it into a cookie sheet and cut it into small squares. Significantly lowers the calories and one bite is all you need to satisfy a sweet tooth! This is a keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie du Mont"
},
"reviewBody": "Must be a regional dish as my southern grandmothers always make this for Christmas! I was so glad to find it online somewhere. Yup, you can substitute graham crackers for the vanilla wafers and you still get the same fabulous results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisa"
},
"reviewBody": "I'm also a North Carolina Girl presently living in South Carolina. My grandmother also made this recipe every year. I grew up eating \"Ice Box Fruitcake\". Utterly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rracket"
},
"reviewBody": "My Mother used to make this. I love it and this is the first time I've seen an actual recipe - we've had to wing it. Really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stick a fork in me, I'm done"
},
"reviewBody": "i'm convinced it's a southern thing. my mom has made a rendition of this for decades. she uses cherries, rains, graham cracker crumbs, pecans, and sweetened condensed milk. she makes it in a bundt cake pan and garnishes it with cherries on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amber cudworth"
},
"reviewBody": "thank you so much for this recipe i havnt had it in years and i loved it!ever since ive been married and had my son ive been dying to make it for them like my grandma used to do for me,but i could never find just the right recipe until now!thanks again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ckkimmey"
},
"reviewBody": "I really want to like this recipe as-is for all the great ingredients &amp; unique preparation (relative to my usual Christmas cookie baking), but it fell flat for me &amp; my family at Christmas. Waiting all that time for the cake to \"age\" and unwrapping all the layers of foil &amp; saran wrap was anticlimatic to see that beige blob in the dish. Family members had to be cajoled to give it try and the reviews were mixed from a \"mmm - better than I thought it would be\" to \"blah.\" Being a sweet-tooth, I thought the cake tasted pretty good, and would describe the taste &amp; texture as glorified cookie dough. If I were to use this recipe again, I would take it one more step by cutting the cake into bite-sized pieces and dipping them into chocolate in order to hide the beige coloring. I probably wouldn't keep the word \"fruitcake\" in the recipe title either... when I said the name of this recipe people wrinkled their noses before the first layer of foil was pulled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bRENDAADLER"
},
"reviewBody": "Thank you for posting the recipe. When I grew up my whole Family worked together sitting around the kitchen table to make this recipe. I tell my husband how we had fun laughing and joking. I want to do this with my Family but did not have the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clip1do"
},
"reviewBody": "I had never heard of this cake until I married my husband, this was a must for Christmas in his family. I have been making it for 34 years now. I do it a little different, I put a cup coconut , and melt mini marshmallows and add a can of evaporated milk to it. That takes the place of the condensed milk. It is so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamaof4boyz"
},
"reviewBody": "I am from Alabama, and my Mom made this for us every Christmas. She would add coconut and only pecans, sometimes she would use green cherries and red cherries. I love this thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyce"
},
"reviewBody": "I ate this as a small child. Know one I have asked has ever heard of it so, after finding your receipe I made it and everyone LOVES it. I now know what alot of my distant friends will be getting for christmas. Thanks to elaine Harper annd allrecipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peapod9398"
},
"reviewBody": "I am so glad you posted this...it is easy to make and so delicious! My Granny Carrie used to make this all the time and it was one of my favorite desserts she made at Christmas...except for choclolate balls! Thank you again Elaine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janette"
},
"reviewBody": "This will be at our Christmas meal again this year.\nI had a much more complicated recipe I used until I found this\none. Perfect amount! Thanks Elaine. \nI am a Florida native."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianeh6"
},
"reviewBody": "sounds good. i used to make a similar one using crumbled white cake and 7 minute frosting as the base. it called for nuts and light colored fruits including hite raisins. called it a white fruit cake. also refrigerate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcie Killian"
},
"reviewBody": "Super sweet and good but it's almost too rich. I'd make it again. I threw some currants in because I had them and it was a nice touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RaggieMom"
},
"reviewBody": "This must be a Southern thing. I am from Georgia and my mom made it and her mom made it. We have a few variations. One, we use a LOT of nuts (pecans are our preference) and not much fruit. We use the candied fruit. Also, we use graham crackers, but I may try the sugar free vanilla wafers. We have also used Marshmallow cream instead of sweetened condensed milk. Both work equally well. We always make them the week after Thanksgiving and keep in the fridge until Christmas time. It seems to be better when it has time for the flavors to mix. We usually wrap one large cake for Christmas and then the rest we wrap in individual rolls.about the size of a pound of sausage. This keeps a long time in the fridge. We always make at least double this recipe. This is the only fruitcake I will eat and I have converted many people that \"hated\" fruitcake to asking for this every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla"
},
"reviewBody": "My Grandmother always made this! (NC/SC) She used Graham crackers and all the mixed fruits you put in fruit cake with pecans and cherries. She said you had to make it on Thanksgiving and put it in a wax paper lined loaf pan, then and put it in the freezer until Christmas! My Aunt made it for our family Christmas party and it was sooo good! She said Grandma got it long long ago from a pet milk can. If my Grandma was still alive she'd be over 90. I have also seen a recipe with marshmallow, but she never put those in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra"
},
"reviewBody": "I am from SC, and this recipe was handed from my great, great grandmother. I just made it for my uncle for Thanksgiving, and he teared up as he thought the recipe had been lost. He had not had one since my grandmother stopped hosting Christmas. It does seem to be a deep South regional recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryrickimorris"
},
"reviewBody": "This is the recipe that my mother made for years when we were children and we loved it.I lost it,now we can all enjoy it again.This is a favorite of the folks around Baton Rouge and New Orleans..Thank You Mary Morris"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Awesome! I am from South Georgia and my Nana has made this as long as I can remember...now I make it every year! It just isn't Christmastime without it. YOu are right though, most people have never heard of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gay"
},
"reviewBody": "I have tried to find this recipe. and I keep losing it. My ex-sister-in-law made this for years for us. I do not count her as my ex I love her to death. I can't remeber which said their family had used the marshmellows, and the one that said but it in the box that the gramcrackers came out of lined with the wax paper or tin foil but you'll have brought back so many memories for me this beautiful God given morning. Merry Christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "This is just like my dad made every year at christmas when i was a child.he also added coconut and golden raisin instead of the black ones.very good, but very rich .a small piece will be enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loringa101"
},
"reviewBody": "I made this cake last night. I used 1 box of vanilla wafers put thru the food processor. Then added a bag of walnuts and a container of candied fruit used for fruit cakes. I placed the cherries on top for decoration. Now to wait a whole week. If the cake taste like the dough, it will be great. Can't wait!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CCARR48"
},
"reviewBody": "I grew up in Mobile, AL, and this was a yearly treat Mother prepared this time of year--over 40 years ago. She is no longer with us, but this recipe made me smile. The only difference (other than omitting the raisins) was that she rolled it into a log in foil and sliced it into small circles. Thanks so much for the memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SandraB"
},
"reviewBody": "My Mama used to make this every year for Christmas, she added marshmallow cream and dates to her fruitcake. I think she got her recipe from a UPC Church Cookbook from somewhere in Louisiana in the '50's but I don't have a copy of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "earl d martin"
},
"reviewBody": "this is a most wonderfully delicious cake. my mother made this cake every year at christmas. i am glad i finally found this recipe because when she died the recipe was lost. my mother used graham cracker crumbs instead of vanilla wafers then used the graham cracker box to form cake, she placed 2 layers of wax paper on bottom, top and sides of box. she formed the cake in the box and then refrigerated for 4 to 5 days. to serve she peeled away the box and cut into 2x2x1/2 inch squares."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy R."
},
"reviewBody": "I am from NC and this is very similar to my grandmother's recipe--she used graham cracker crumbs instead of vanilla wafers and added lots of spices: cinnamon, nutmeg, allspice, cloves. Now my mom makes it every year at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phillip"
},
"reviewBody": "This is simply delicious and quite versatile. Other substitutions and/or additions that you might want to consider are dried cranberries, candy orange slices, and red and green cherries to make it look festive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RHETTDIXIE"
},
"reviewBody": "My grandmother made one every year, only she did not add raisons or pecans- only walnuts. She did add sliced fruit flavored gum drops, candied pineapple and sweetened coconut. Her version of this cake converted many die-hard fruitcake haters. She accidentally bought the spiced gum drops one year and that was a little weird tasting. HaHa!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a staple every Christmas where I grew up on the coast of North and South Carolinas. Now living in Atlanta, GA, no one here has ever heard of it. The taste is devine and when I eat it I suddenly become five years old again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Little Caroe"
},
"reviewBody": "My family had this every year at Christmas. We made it with graham crackers, pecans, coconut and maraschino cherries. Wonderful!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATSKI"
},
"reviewBody": "My grandmother also makes this and we live in AL. Her recipe is slightly different, however, in that she uses a box of graham crackers instead of the vanilla wafers. She also uses a quart of pecans, and adds a bag of mini marshmallows. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla White Moody"
},
"reviewBody": "So simple and tastes wonderful! I didn't find one person who didn't like it - even the kids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "PHENIX CITY, ALABAMA. THIS CAKE WAS PREPARED BY MY MOTHER EVERY YEAR FOR CHIRSTMAS. IT'S VERY RICH AND A SMALL PIECE IS MORE THAN PLENTY. SHE GOT THE RECIPE FROM MY GRANDMOTHER. THE ONLY DIFFERENCE BEING THAT MAMA MADE IT WITH FRESH GRATED COCONUT. TRY IT WITH THE COCONUT, YOU WONT BE DISAPPOINTED.\r\nFRANKIE STRINGFELLOW"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought this was delicious. I am from North Carolina and my Grandmother has been making this for as long as I can remember. I have been looking for this recipe. My Grandmother always made it by memory, so we never actually had a recipe written down on paper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It may be a regional thing--I'm from Louisiana and a lot of people made it down there. Now I live in North Carolina and no one seems to know what it is. I'd been looking for this recipe for awhile, so thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been looking for this recipe for awhile.I had a friend who used to make this every year for holiday gifts and I loved it.I am from the south,depending on where you are from,this recipe made it down south.It is a great alternitive to the boring old fruit cakes we are used to.I am so glad I have it now,I'll pass this one on to my children.By the way my friend was like 70 when she made this,haven't seen her for almost10 years,I hope she's still here.Thanks , xxxSullyswytchxxx"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17562/ice-box-fruitcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
"name": "Cherry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17562/ice-box-fruitcake/",
"name": "Ice Box Fruitcake"
}
}
]
}
}
, "about": [
]
}
]