				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Instant Pot® Charro (Refried Beans)"
,"datePublished": "2016-05-26T17:11:24.000-04:00"
,"dateModified": "2016-05-26T17:11:24.000-04:00"
,"author": [
{"@type": "Person"
,"name": "droach3"
,"url": "https://www.allrecipes.com/cook/3931074"
}
]
,"description": "The Instant Pot® electric pressure cooker does all the work in this easy recipe for Mexican &#34;charro&#34; beans with onion, cumin, and cilantro."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0fJzusJP_ybIZb8Z-ii5Qi7MDfA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4283237-c53edf32e753418b8c5f7b2e6089f5e0.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Pot® Charro (Refried Beans)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "76"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "184 kcal"
,"carbohydrateContent": "34 g"
,"fiberContent": "8 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "114 mg"
,"sugarContent": "3 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"4 cups water",
"2 cups dry pinto beans, rinsed",
"1 large onion, chopped",
"0.5 cup salsa",
"0.5 cup roughly chopped cilantro, or to taste",
"1 jalapeno pepper, minced",
"4 cloves garlic, minced",
"2 teaspoons tomato-flavored bouillon",
"2 teaspoons vegetable bouillon",
"0.5 teaspoon chili powder",
"0.5 teaspoon ground paprika",
"0.5 teaspoon ground cumin",
"0.5 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine water, pinto beans, onion, salsa, cilantro, jalapeno pepper, garlic, tomato bouillon, vegetable bouillon, chili powder, paprika, cumin, and black pepper in an electric pressure cooker (such as Instant Pot®). Close and lock the lid. Select Bean/Chili function; set timer for 45 minutes. Cooker will reach high pressure in 10 to 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Release pressure using the natural-release method according to manufacturer&#39;s instructions, 10 to 40 minutes. Unlock and remove lid."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon H"
},
"reviewBody": "These turned out great. I used jarred jalapenos b/c that's what I had on hand and it added a kick for sure. I used 3 tsp of chicken bouillon and approx. 1 tsp of tomato paste. Did not add the salsa initially but was going to add it towards the end based on another review, however, when I tasted it I didn't think it needed the salsa. I decided not to add the cilantro during the cook time but had some to sprinkle on top for a fresher finish. The firmer texture was great for adding to a mexican rice bowl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Farmer pat"
},
"reviewBody": "Flavor was good but wayyyyy too salty. Next time I will use only half the boullion in the recipe and cook it longer. The beans were not as done as I prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brittani"
},
"reviewBody": "Wish I read about not adding salsa til the end, after 45 minutes my bean were still toothsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caylee"
},
"reviewBody": "As usual, the first time I will follow the posters recipe exactly. If I like it and/or think it's tweakable, I keep it.\n\nThis one's a keeper! In the future I will make a few adjustments for our personal taste. It's definitely worth it.\n\nThis is the first time I've made beans in my IP. It amazed me that they were done so quickly. In go ingreds, out comes dinner. Even after all this time of owning one, and using it frequently, I'm still quite jazzed about my IP."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Klassen"
},
"reviewBody": "It’s good but took 2 hours to cook. My instant pot does not have a “Bean” setting so I did the “Manual” and “Meat’ settings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabella"
},
"reviewBody": "This recipe is fantastic and reminds me of beans made by my family! I used chicken broth instead of the tomato bouillon. I also left out the salsa because I had homemade chile to add when eating. Delicious and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PBater"
},
"reviewBody": "The beans instant pot turned out soft and the right consistency. I didn’t particularly care for the flavors in this recipe. I thought it was a bit too garlicky. While I can still use the beans to make burritos or something, I will most likely not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige Gamet"
},
"reviewBody": "I've had a difficult time figuring how how to make vegetarian pinto beans that taste yummy. This hit the mark. I used chipotle chili powder, otherwise stuck with recipe as is. I have a stovetop pressure cooker. Worked perfectly to quick soak beans (boil, then let sit for a hour, then drain) and pressure cook for 45 minutes with slow release. A keeper! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lina Rose Hogan"
},
"reviewBody": "added 1/2 teaspoon salt, 1/2 teaspoon of chipotle powder, and 2 diced roma tomatoes. Omitted salsa and Jalepeno"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdolio"
},
"reviewBody": "Made a double batch - ate some as-is, added ham, molasses, tomatoes/tomato paste, and spices to a portion for a killer pan of baked beans, used a quarter in chicken tortilla soup and used the remainder for refried beans. Great recipe as-is and great flavor as a base for other bean dishes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Denton"
},
"reviewBody": "Great and easy. From dry beans to serving in less than two hours. I increased pressure time to one hour. Used vegetarian breakfast sausage, PicSweet frozen vegetables seasoning blend, and Vegetable Broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Flavor was awesome! I didn’t have cilantro and decided to omit the salsa but I didn’t miss either. The only thing was that a few of my beans were a little hard. I’m going to try cooking a little longer or possibly soaking them first next time. I’m new to using an instant pot so I still need to fine tune my methods. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Brenner Baldwin"
},
"reviewBody": "Great authentic flavor. I would probably cook them a little longer next time because beans were a little al dente and I like them really soft. I also love Mexican oregano and added some to amp up the authentic flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brett"
},
"reviewBody": "Great recipe! I had to use Serrano peppers due to the store being out of jalapenos. I used 3 and it was at the edge of perfect heat. I would only use 2 Serranos next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie Springer"
},
"reviewBody": "These are good beans. I started by sauteeing bacon in my Instant Pot. I did substitute chicken stock because that's what I had on hand. I didn't soak my beans beforehand. Unfortunately, when the time was up, I had to add water and cook for another 15 minutes. So, next time, I'll add more water and add extra time. They do have a great flavor though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B Pritchard"
},
"reviewBody": "This is my go to for instant pot pinto beans. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom2lande"
},
"reviewBody": "We love this!!! Added a can of Rotel instead of salsa. Placed a hambone and added a 1/4 tsp chipotle powder to the other spices. Had fabulous flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonH"
},
"reviewBody": "We have made this twice (the second time is as I type this, lol.). And so far and it was really really good. The beans weren’t as soft as I’d like, so this time I increased the cook time to 1:15. I made the recipe almost exactly with the exception of using 2 blocks of vegetable broth instead of the tomato broth since that is what I had on hand. These came out really really good. Nice texture, firm but soft still. The extra 1/2 hour cook time did make a difference. The spices are on point. Our attitude is 4700’."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "The were fantastic! I used half the beans but kept everything else as the recipe called for. I did sauté the onions, jalapeno and garlic beforehand. I also added extra chicken broth for juicer beans, and followed suggestions of not adding the salsa till later. Tasting the beans after cooking, I didn't add it. Will do again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trkeillor"
},
"reviewBody": "These beans were great but I had to add 2 extra cups of water and restart my cooker. Delish recipe though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grammy"
},
"reviewBody": "I made this twice in a week. First was made following directions as written. It was fabulous. My picky adult son dislikes beans but raved about hoping there were leftovers. Second time I made this I added a tablespoon of chili powder (our taste). Both times i made this is added pre-cooked potatoes at the end. They were great and stretched the dish a little. This is a great basic recipe that could be easily modified to your personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cemley"
},
"reviewBody": "I made this as written- delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "droach3"
},
"reviewBody": "I make these weekly and have changed the base recipe since my wife and I have found that we actually enjoy the charro beans as much as the refried beans and needed more liquid. So here is the update you can try.\n6 Cups of Water\n1lb dry pinto beans\n1tbsp low sodium vegtable base (in the jar)\n1tbsp low sodium chicken base (in the jar)\nincrease all seasonings to 1 tsp instead of 1/2.\nAdded 1 tsp salt since i stoped using boullon\nRest of ingrediants stayed the same. I do saute the onions in about a tbsp of oil for about 2 minutes in the instapot then add the garlic and jalapeno and saute them until fragrent then add the water to deglaze before adding rest of ingrediants.\n\nWe end up with more bean broth and have beans for dinner and then make refried beans in the morning for bean and cheese tacos :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Engle Stevenson"
},
"reviewBody": "Very good, good flavor. The grandkids even liked them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eating well"
},
"reviewBody": "I make these beans outside over a fire in a cast iron dutch oven\nI did add a few items, Chorizo with the bacon. hot sauce, fire-roasted tomatoes, and a variety of beans, Pinto, kidney, black beans. the perfect side for a 16lb smoked brisket!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this is my first time making beans in the instant pot and i'm beyond impressed. no need to soak saves SO much time. i set the beans for an hour as suggested by other reviewers. i live in los angeles so i don't think the elevation has anything to do with the time. i'm used to mushy beans from the crock pot but these had texture.. good texture. i didn't add the salsa and added the bouillon at the end bc i've read salt at the beginning of the cook will keep the beans hard. i prefer a little more seasoning but that can always be added on the finished product. ty for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kary Zywiec"
},
"reviewBody": "I followed the recipe exactly with the exception that I added 3 canned chipotle peppers in adobe sauce. The flavors were tasted but beans were not anywhere done after 45 minutes. I put them on another 15 minutes and were ok but really should have cooked even longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Bebout"
},
"reviewBody": "I did not pre-soak . With my pressure cooker, it took 75 minutes to get them tender but the taste was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naemax"
},
"reviewBody": "Awesome!! I soaked my beans and cooked them according to the instant pot instructions for soaked beans of 7-9 mins. So flavorful, these beans were great for a lot of dishes throughout the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SingFamMom"
},
"reviewBody": "I followed the recipe exactly and these are the best beans I've ever had. they are so good. a salad and beans with cornbreAd and you have a perfect meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janis"
},
"reviewBody": "They were great. I do not have a InstantPot so I cooked on my stove top &amp; they were perfect. Also I added some hatch chilies (medium heat). My guests enjoyed the beans. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Vega Boggs"
},
"reviewBody": "Excellent recipe. I made a few changes, only because I had some ingredients, and didnt have others. I used 2 C. of Chicken Broth, + 2 C. water. I also used 3/4 of a very large Mayan Onion which I chopped up and cooked with about 4 slices chopped bacon. I cooked it in cast iron skillet until crispy and onions were caramelized. Also, I omitted the salsa. I also did not use the tomato or vegetable bouillon cubes, instead I used 2 Chicken bouillon cubes. Everything else in recipe was used. Finally, my paprika is a smoked paprika. This was an excellent dish. Started in cast iron skillet (bacon and onions,) and finished in InstaPot for 1 hour. So so good. Thank you for recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ron"
},
"reviewBody": "I made no changes and these beans were excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jinglebells"
},
"reviewBody": "Made this tonight and I really liked it. I didn't have any fresh cilantro so I used dried, I did use the salsa and I sauteed the onions and garlic only because I had a pan with beef drippings sitting there. I actually doubled the chili powder and cumin. When serving I stirred in a dollop of sour cream, delicious! Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Westrope"
},
"reviewBody": "I followed the directions except for adding green chilies instead of jalapeno, because thats what I had on hand, and then I added the salsa after I cooked it because I forgot :) The 45 minutes was not nearly enough time for the beans, and they were still rather firm, so I added more water and cooked it longer. Not sure if it was due to high altitude or not (im at 7200 feet). After a science lesson from my husband, he explained that I should add about 20% to my time due to altitude, so next time I will cook it for an hour instead of 45 minutes and see what happens. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa sutton"
},
"reviewBody": "We are from Texas and always add more spice to every recipe but we really like these. Added more heat and they were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aliciac003"
},
"reviewBody": "Sautéed bacon and chopped onion in the instant pot before adding the beans and other ingredients. The seasoning was a little heavy for my taste. Also next time I’d use chicken broth instead of the bullion + water combo. Ok overall"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwen Wilder"
},
"reviewBody": "Really good flavor. Took a little longer to cook in my instapot... Approx 70 minutes on the timer, plus natural release. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beautycat"
},
"reviewBody": "Great recipe. I made these for my husband and a friend, and they loved them. I used chicken broth because that was all I had, and I added the salsa at the end. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Ligon Kernstein"
},
"reviewBody": "I love the flavors of this recipe! After making these beans a couple of times I've found that cooking them for an hour on high pressure gives a more creamy bean texture and higher pronounced flavor. I do not soak the beans first. Will be making this again for years to come. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hebrewprincess"
},
"reviewBody": "I make these beans so easy and fast now in my insta pot that I don't even need the recipe anymore. But I must give credit where credit is due! The will always be the recipe I make for beans in my family!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerry Rodgers"
},
"reviewBody": "This is amazing in my Instant Pot. Under an hour and no soaking and perfectly cooked beans. I did use salsa and I feel that this added a nice touch and lots of taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitch"
},
"reviewBody": "I always tweet a recipe a little but made this one pretty much the way it was printed. I did however cook it outstanding de in my solar oven and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tswahl"
},
"reviewBody": "Added an extra jalapeño and maybe 1/2# of homemade chorizo. Spicy and super flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added an extra jalapeño and maybe 1/2# of homemade chorizo. Spicy and super flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These turned out perfect as written in my Instant Pot. I was leery about adding the salsa in the beginning but the beans softened up and turned out perfect. Not sure where the (Refried Beans) comes from but nonetheless they are good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "What a nice easy recipe with my Instant Pot. I did not soak my beans and I enjoy this quicker option vs. the slow cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Simons"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duboo"
},
"reviewBody": "Fantastic refried beans. Better than any canned that we've had and as good, if not better, than what we get in authentic Mexican restaurants. I did not have vegetable or tomato bouillon, so I substituted three chicken bouillon cubes total for them. I did not use the optional salsa and it was perhaps just a bit spicy. When I make again, I will probably cut the jalapenos in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shadywood"
},
"reviewBody": "This was pretty good. My FIRST meal in the Instant pot. (I noted the person tried to make in crock pot- NOT the same thing).\n\nBecause I live in Texas and like things with a little more zing, I added a 1/4 cup of HOT salsa half of a chopped jalapeno (no seeds), along with a few other seasonings. I used chicken bouillon as I didn't have tomato, but did have some sun-dried tomato paste, so used that. Added some chopped carrots as well as some chopped up pork jowl for extra flavor.\n\nAs mentioned before, this was first meal in the Instant pot. I can't believe how much more intense the flavors and the HEAT was.. whoa doggies. It was too hot for me. \n\nNeed to learn how to adjust those seasonings!.. but happy with the result. Beans were just the right not quite firmness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyof3angels"
},
"reviewBody": "This made excellent beans! I have never been successful in the past making a pot of beans on stovetop or slowcooker. I did this in my instant pot. The only changes I made were to saute the onions and jalapeno in bacon grease (this is what my grandmother had always done) I also replaced the tomato bouillon with chicken bouillon because that is what I had on hand. This tasted so good and were soft, but not already mushy. I also soaked my beans the night before and into the next day (maybe for like 15 hours total). I have learned in the past that soaking the beans makes a big difference. However, I had never made them before in an instant pot. Next time I may just throw them in without soaking. There was a lot of liquid left, so if you do soak your beans you may not need so much water. This will be how I make a pot of mexican pinto beans from now on! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MWARD19"
},
"reviewBody": "I will definitely make it again. I didn't have a jalapeno, so I substituted pickled chopped jalapeno slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy B"
},
"reviewBody": "I love a bowl of pinto beans so I make them often. My number one suggestion for making beans is to clean and soak the beans overnight in salt water. The next day clean the beans again (rinse them in water), then put them in the crock pot to cook and follow the recipe. This recipe is a good flavored recipe. I don't use the salsa, but I will sometimes add a can of petite diced tomato with green chili's. Oh, and add in either a ham hock or cut up ham steak with the fat.\n\nI used my left over Thanksgiving ham and added it all to a slow cooker pot of beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaymie Moore"
},
"reviewBody": "Great recipe! I make it on a regular basis. Easy, quick and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "My pressure cooker doesn't have a \"Bean/Chili\" function as called for in the recipe so I cooked the beans on the \"Meat\" function for 55 minutes. This is a delicious meatless meal that I'll make again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Peggy Fugate"
},
"reviewBody": "I prepared as directed, but the beans were not totally done even after 8 hours in the crockpot. It really did not have a good flavor - needed more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Spradley Miller"
},
"reviewBody": "Yummy! I made this recipe by following the slow cooker method. Delicious! I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imarichtone"
},
"reviewBody": "I soaked my beans overnight because I like them soft. Wasn't sure how they would come out without soaking. I used 4 teaspoons of Better Than Bouillon Vegetable Based Bouillon instead of tomato flavored (couldn't find it). I also doubled the amount of spices. Did not use salsa (because I actually forgot). You may not need 4 cups of water in the IP if you don't soak the beans first. There is lots of liquid. These are delicious and I will make them again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "12.27.16 I used Goya® Cilantro &amp; Tomato Sazon for the the tomato-flavored bouillon, and it really kicked up the flavor. Didn‘t have any salsa on hand (it was optional), but even without it, these beans were delicious, the perfect side kick to just about any Mexican meal. Love this Instant Pot and loved these charro beans! *****UPDATE 7.13.17***** Mashed some of the beans today and layered into some beef enchiladas. I find I'm making this recipe often, it's just so darn good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tori"
},
"reviewBody": "I used rotel instead of the jalapenos and the tomato bullion. it came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Benat"
},
"reviewBody": "I cooked these in my 6 qt. Power Cooker. The only changes I made was to replace the tomato and vegetable bullion with chicken bullion. It came out great! Love the flavor! \nI am new to pressure cooking. Some things I have tried didn't come out ( my fault I'm sure) as well as I would have liked but these charro beans were perfect! I will definitely cook them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baking Nana"
},
"reviewBody": "This is a keeper! One important note though - I did not add the salsa at the beginning - tomato products added to dried bean can keep the beans from softening, once cooked and the beans are soft, it is fine to add the salsa or other tomatoes. \nThe kids loved this, served with corn tortillas, lime wedges and some grated cheese it was a meal."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/256347/instant-pot-charro-refried-beans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/256347/instant-pot-charro-refried-beans/",
"name": "Instant Pot® Charro (Refried Beans)"
}
}
]
}
}
, "about": [
]
}
]