				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Instant Pot Basic Cabbage Rolls"
,"datePublished": "2019-04-04T00:14:08.000-04:00"
,"dateModified": "2022-11-03T13:36:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Bren"
,"url": "https://www.allrecipes.com/cook/9292325"
}
]
,"description": "These Instant Pot cabbage rolls stuffed with pork, veal, beef, onion, and rice are cooked in tomato sauce for a comforting dinner on a cool night."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4vXA3C3VNHWBmX_ysGsy1RYe0lg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6837830-39c9a32a1b44421b93f33ec477d97413.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Pot Basic Cabbage Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "32"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "316 kcal"
,"carbohydrateContent": "42 g"
,"cholesterolContent": "50 mg"
,"fiberContent": "11 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "2253 mg"
,"sugarContent": "16 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 cups water, plus more for soaking",
"3 pounds head of savoy cabbage",
"0.5 cup uncooked long grain rice",
"2 (28 ounce) cans tomato sauce (such as Hunt's®), divided",
"0.33333334326744 pound ground beef",
"0.33333334326744 pound ground pork",
"0.33333334326744 pound ground veal",
"0.5 cup finely chopped onion",
"2 large cloves garlic, finely chopped",
"2 teaspoons salt, divided",
"1 teaspoon dried parsley",
"0.5 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pour 1 1/2 cups water into a multi-functional pressure cooker (such as Instant Pot). Insert the trivet. Remove tough outer leaves and core from cabbage. Place cabbage, core-side down, on the trivet."
} ,{
"@type": "HowToStep"
,"text": "Close and lock the lid; set the vent to Sealing. Select Manual function according to manufacturer&#39;s instructions; set the timer for 9 minutes. Allow 10 to 15 minutes for pressure to build."
} ,{
"@type": "HowToStep"
,"text": "While cabbage is cooking, place rice in a small bowl and cover with water; set aside to soak. Measure out 1/3 cup tomato sauce (from 1 can) and pour into a large bowl. Add beef, pork, veal, onion, garlic, 1 teaspoon salt, parsley, and pepper; set aside."
} ,{
"@type": "HowToStep"
,"text": "Release pressure carefully using the quick-release method according to manufacturer&#39;s instructions, about 5 minutes. Unlock and remove the lid. Transfer cabbage to a plate. Drain water from the pot insert. Add remaining tomato sauce from the open can and 1 teaspoon salt to the pot. Replace the trivet in the pot."
} ,{
"@type": "HowToStep"
,"text": "Drain rice and add to meat mixture; stir to combine."
} ,{
"@type": "HowToStep"
,"text": "Separate cooked cabbage leaves carefully and shave off tough veins. Place a cabbage leaf on a work surface; fill with 2 tablespoons meat mixture and roll up, tucking in the sides. Place rolled leaf on the trivet in the pot. Continue with remaining leaves and filling, placing the first layer facing the same way and the second layer facing the opposite way. Pour remaining 1 can tomato sauce over rolls."
} ,{
"@type": "HowToStep"
,"text": "Close and lock the lid. Select the Stew/Meat function according to manufacturer&#39;s instructions; set the timer for 22 minutes. Allow 10 to 15 minutes for pressure to build."
} ,{
"@type": "HowToStep"
,"text": "Release pressure using the natural-release method according to manufacturer&#39;s instructions, about 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer&#39;s instructions, about 5 minutes. Unlock and remove the lid."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Came out delicious! Accidentally used tomato soup instead and just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Callanan"
},
"reviewBody": "Excellent!! Notes to self for next time: use half pork/half beef. Get biggest head of cabbage you can find, double everything except the sauce. Add perhaps a can of tomato soup or a small can of sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "This recipe was delicious! My family loved it and it turned out perfectly. Instead of creating the meat mixture myself, I purchased a \"meatloaf\" mixture at our supermarket that contained the beef, veal, &amp; pork. I also have a crockpot express instead of an instant pot, but the directions were spot on and it turned out great! The only change I may make is using less sauce...perhaps 1 can that is 28 oz and one of the smaller 15 oz cans instead of 2 (28 oz) cans. This dish will be one I add to my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Troyer"
},
"reviewBody": "I loved it, so did the neighbors! I did use all beef and crushed tomatoes. I added 2t brown sugar with the salt to the tomatoes. I love white rice so used a whole cup. This recipe was really quick and very handy to use the IP. This will be a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacob Eisinger"
},
"reviewBody": "A good and quick process to soften the cabbage!\n\nAt 9 minutes, the other layers of my cabbage were overcooked. However, the innermost ones were slightly undercooked. When I do this in the future, I'll unwrap all layers and use more of the inner ones.\n\nThe recipe is titled \"basic\". If you want some suggestions, here are a couple:\n 1. For the sauce and meat combo, my grandma would throw in a handful of shredded carrots and raisins.\n 2. And, my personal preference is a slightly more robust sauce. So, I substituted one can of sauce for a small can of paste, crushed tomatoes, and whole tomatoes.\n\nOverall, great, simple process for Cabbage Rolls. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bill Moutz"
},
"reviewBody": "I would blanch off tge cabbage in a traditional manner as it was very well cooked and extremely delicate when I tried to separate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Black Flynn"
},
"reviewBody": "Super easy to make &amp; very delicious. I tripled the recipe and froze half of the uncooked meat mixture to use next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Linda Marie Robinson"
},
"reviewBody": "I typically love the recipes from All Recipes I have never had anything burned in my instant pot in the 3+ years that I've had it. Unfortunately if you follow the instructions exactly on this recipe in my instant pot it burned as soon as it hit pressure it never even got to cook for the 22 minutes. I had to quickly release the pressure scoop everything out into a saucepan and then similar along the stove to be able to eat anything we lossed all of the spaghetti sauce because it was burned on the bottom and left a burned taste. This recipe to me epic fail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheins1"
},
"reviewBody": "This turned out delicious! Easy to make. I did not have the second cans of Tomato Sauce. I used petite diced tomatoes and mashed them. It was a great substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RollieII"
},
"reviewBody": "My Mom use to make cabbage rolls in an old stove top pressure cooker. I know she would have loved this. I did use 1 pound each of ground beef and veal. and made the sauce a little larger by adding a can of diced tomatoes. I would not recommend putting the cabbage in the cooker to soften the cabbage, it didn't work out for me. I had to run to the store and buy another head.. well to be honest my wife did, but it was great and reminded me of my moms!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meg"
},
"reviewBody": "I made it but substituted beef for turkey (93%-7%) and ground pork. I also substituted long grain rice for basmati rice. I also used bread crumbs to help bind the meat and rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith French-Hook"
},
"reviewBody": "The first thing I remember my mom teaching me how to cook was cabbage rolls. I've always done them in the oven but I love doing them in the instant pot especially when it's hot out I can still make them without heating up the house with a hot oven. They were a big hit with my roommate as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tryingtocook"
},
"reviewBody": "so easy! I did not core the cabbage the whole way but it was still pre-cooked enough the remove the leaves. I sprinkled brown sugar on top before cooking because we always add it when baking Golabki. The 2 cans of sauce seemed like it would be a lot but it was not, as it soaked into the leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim"
},
"reviewBody": "This has moved to the favorites for sure. We’ve made this many times and love it each time. My only modification is I use a pound of chicken sausage or Turkey sausage instead of the meat mixture. Lower calories from beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "magpie"
},
"reviewBody": "I opted for a hair healthier options, and it worked really well, although took more dishes. I fried 1/2 lb. hamburger, 1/2 lb. mild pork sausage (didn't have veal), and rinsed well to drain fat, then chopped fine with food processor. I subbed brown rice for white rice, but since it takes twice as long to cook normally, I simmered it for 20 minutes, and it came out done nicely in the Instant Pot. I also used dried onions, and a bit more pepper, and it was wonderful. Chopped and added remaining cabbage on top, per previous reviewer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andrew"
},
"reviewBody": "Although the recipe is quite nice, the prep and cook times need to be updated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcia Foster"
},
"reviewBody": "Would probably add more seasonings next time and go back to using a pot of boiling water to separate my cabbage leaves, but the rolls were really good and loved by all of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Wheeler"
},
"reviewBody": "So easy and so good. I chopped up the extra cabbage and threw it in on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Troy Douglas"
},
"reviewBody": "Off the charts good. Quick and very easy. Used Foodi, but directions were roughly the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patte Nafius"
},
"reviewBody": "Got a instant pot for Christmas and have used it at least twice a week since then. My husband asked if we could make Cabbage Rolls, or as my mother called them \"Grumpkies\". We made them and couldn't have been more pleased! So easy with the easy pre-cooking of the cabbage that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Pollard"
},
"reviewBody": "Cooking cabbage for 9 min is not long enough... I put in for another 9 min.... the few leaves that were done were ok but maybe my cabbage was too big?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty Harrison"
},
"reviewBody": "Have 3 qt instant pot so cut recipe in half. Also - cabbage won't fit in 3 qt instant pot so need to steam/cook cabbage in some other fashion. Finished product had good flavor - will make it again with adaptations \"outside\" the instant pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Millington Tipton"
},
"reviewBody": "Had originally planned on making these my usual way on the stove but decided to give my InstaPot a try. Only thing different was the rice wasn’t cooked prior and it called for 2 cans of tomato sauce. I only had one so I used a jar of pasta sauce. Turned out delicious!! Best part was how easy it was to steam that cabbage and peel the leaves off!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Fore"
},
"reviewBody": "I made this as written. It was delicious! Thank you for sharing! Reminds me of being a kid and my grandmother making stuffed cabbage with it simmering on the stove for hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmarone"
},
"reviewBody": "This makes a LOT of cabbage rolls. Next time, though, I will soften cabbage on stove top, and use a little less tomato sauce. Otherwise: easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Marie Smith"
},
"reviewBody": "I loved the fact that the rice was uncooked but so tender when the product was finished. Very Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobby Johnson Forsyth"
},
"reviewBody": "The instructions are easy, and it tasted delicious! We will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gerrytierney"
},
"reviewBody": "No changes and, yes, will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "I've made this three times now and keep getting requests to make it again. I used to buy the ready-made frozen ones, but my family won't even consider those, now! This recipe is wonderful!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/268289/instant-pot-basic-cabbage-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/268289/instant-pot-basic-cabbage-rolls/",
"name": "Instant Pot Basic Cabbage Rolls"
}
}
]
}
}
, "about": [
]
}
]