				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Instant Pot Meatloaf"
,"datePublished": "2020-03-05T00:17:52.000-05:00"
,"dateModified": "2022-09-15T14:19:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Cybergy"
,"url": "https://www.allrecipes.com/cook/7868980"
}
]
,"description": "This instant pot meatloaf is topped with a sweet ketchup and mustard sauce and finished off under the broiler for a family-pleasing, comforting meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rMCl0HNDWvARLaE8wFx0sRk8CWc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5280211-7cb16dd53af6420d91eea2e38b4f5d69.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5846516773001",
"description": "The secret ingredient in this meatloaf are apples!",
"duration": "PT1M1S",
"name": "Instant Pot® Meatloaf",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/b6628312-fdbe-4f77-a382-cf7341c88f0a/01b548b8-b881-45f2-870d-afba022fe484/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:38:01.415-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Pot Meatloaf"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "65"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "295 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "71 mg"
,"fiberContent": "1 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "466 mg"
,"sugarContent": "8 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 pounds ground beef",
"1 cup dry bread crumbs",
"0.5 cup diced onion",
"0.5 apple - peeled, cored, and diced",
"1 egg",
"2 teaspoons garlic powder",
"0.5 teaspoon salt",
"0.5 teaspoon ground black pepper",
"0.33333334326744 cup ketchup",
"2 tablespoons prepared yellow mustard",
"2 tablespoons brown sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make the meatloaf: Mix beef, bread crumbs, onion, apple, egg, garlic powder, salt, and pepper in a large bowl until evenly blended."
} ,{
"@type": "HowToStep"
,"text": "Shape the beef mixture into a loaf and place on a large piece of aluminum foil. Fold the foil up and around the edges of the meatloaf, creating a makeshift loaf pan."
} ,{
"@type": "HowToStep"
,"text": "Pour 1/2 cup water into a multi-functional pressure cooker (such as Instant Pot) and place the steam rack inside with the handles up. Place the meatloaf on top of the rack. Close and lock the lid; seal the vent. Select high pressure according to manufacturer&#39;s instructions; set timer for 25 minutes. Allow 10 to 15 minutes for pressure to build."
} ,{
"@type": "HowToStep"
,"text": "Set an oven rack about 6 inches from the heat source and preheat the oven&#39;s broiler."
} ,{
"@type": "HowToStep"
,"text": "Release cooker pressure carefully using the quick-release method according to the manufacturer&#39;s instructions, about 5 minutes. Unlock and remove the lid. Transfer meatloaf, still on the rack, to a baking sheet. Broil meatloaf in the oven until browned, about 5 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rMCl0HNDWvARLaE8wFx0sRk8CWc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5280211-7cb16dd53af6420d91eea2e38b4f5d69.jpg"
}
]
,"text": "Meanwhile, make the topping: Combine ketchup, mustard, and brown sugar in a small bowl. Brush over meatloaf and broil again until caramelized, 1 to 2 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillibug"
},
"reviewBody": "I love allrecipes! I typically read through reviews and adjust the recipe hear and there. This recipe had very few recommendations so I stuck pretty close. I used panko because it's what I had and added about 1-2 TBS fresh chopped parsley because it needed to be used. Doubled the sauce. I used a bundt pan (with 1 C water in pot) instead of loaf shape in foil. Cooked for 25 minutes and NR. Drained the grease off and flipped it out of bundt pan onto foil lined pan and broiled as directed. I put half the sauce on top and half the sauce heated in a pan on the stove for anyone who wanted. Huge hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Flavor great! But not sure I like it cooked in insta pot rather then oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shyone53"
},
"reviewBody": "The only thing that I didn't like was the glaze, I will use a different one next time but otherwise it cooked great in the instapot and 4min on broil came out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "y9ngzp5vz8"
},
"reviewBody": "I used half ground beef and half Turkey. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Edwards Maclellan"
},
"reviewBody": "Yum. So delicious. My husband loved it. I love the sweet and sour taste combination so it’s a winner here. I did it according to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Nelson"
},
"reviewBody": "Very good! I had 3 pounds beef &amp; adjusted the ingredients according, with 28 minutes pressure cooked. Seemed dry going in but the apple &amp; onion added the wonderful moisture and flavor. My 2 Childcare toddlers loved it and they're usually picky with meats. Served the bbq sauce on the side but I know it would be fabulous broiled as described."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cliffardo"
},
"reviewBody": "Excellent. I thought that doing the \"pre-broil\" was brilliant! It allowed the surface of the loaf to brown and dry just out enough that the glaze (which I will double up on the next time) really adhered to the loaf well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leanne"
},
"reviewBody": "Liked the flavor a lot AFTER I had to finish baking it in the oven. Like another reviewer, my ends were done, but the middle was raw and I used less than 2 lbs of meat. NBD I'll just add more time next time, or make 2 small loaves. But it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "canukgirl"
},
"reviewBody": "Made the recipe exactly as written, and it's great except that the cooking time is not enough. Add another five to eight minutes and you should be good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "edeas_knight02"
},
"reviewBody": "The sauce makes this recipe. We were worried about its look when we opened the instant pot, but once you broil it for five minutes it looked so much better. I feel like there could be some extra flavor added to the meat (maybe extra garlic powder or just raw garlic finely chopped), but I have been told I have an executive palate. \n\nDefinitely making this again next week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond Lamb"
},
"reviewBody": "I made this and was pleasantly surprised, I was not sure about adding the apples to a meatloaf recipe, but !!!WOW!!! they really made a difference. It was so juicy and kind of sweet and tender. It was easily the best meat loaf that I ever made. Everyone loved it and asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Butters"
},
"reviewBody": "I used ground turkey. And I would not use as much mustard. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley8888"
},
"reviewBody": "I do not even like meatloaf and I loved it. I made it for my husband and he thinks it is one of the best meatloafs ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hmnbrd"
},
"reviewBody": "Family loved it. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carl Bankston"
},
"reviewBody": "I thought, \"Apple?\" But I did it and it's very good. One thing, I had to use a mushroom soup topping -- my wife can't eat tomato products. Oh, well, it's good with a mushroom topping, too. Sliced mushrooms and a can of cream of mushroom soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yana T"
},
"reviewBody": "love it. very simple but amazing. used crashed oyster crackers instead if bread crumbs. and definitely more salt (double) Apples make this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samuel London"
},
"reviewBody": "Absolutely, terrific and we all loved it. The apples in the loaf was perfect with a touch of sweetness and toned down the onion. I'll make this many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmandaG"
},
"reviewBody": "My family really liked it and will make again. 5 stars. My 5 year is a picky eater and I told him the Apple was the secret ingredient and he couldn't believe it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CoraGregory"
},
"reviewBody": "Horrible. Pressure cooker wouldn’t pressurize. I cooked in the oven. It was just plain ground beef , ketchup and mustard. I felt I was eating a hamburger"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cheryl Dopko"
},
"reviewBody": "This came out delicious! However, I found that 1/2 cup of water in the bottom was not enough and I got a Burn message. I had to stop and add a whole cup and start again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Farmakoulas"
},
"reviewBody": "Husband approved. \nI like the apple in it. I used a package of onion soup mix instead of chopped onion and added 1/4 cup of Steak sauce. \nI cooked the meatloaf for 30 minutes, then quick release. I didn’t put it under the broiler before I glazed it. I glazed it, then put it under the broiler for a couple of minutes. \nI put some baby white potatoes at the bottom of the pot, used 1 cup beef broth. The potatoes were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nov111805"
},
"reviewBody": "FINALLY! I halved this recipe since I live alone and followed it to the letter (as I do with any new recipe......I can always tweak it next time).\nThis was AMAZING.......I have a small, high side pan that came with my air fryer and I used that in my 3 qt. Instant Pot and set it for 40 minutes and put 2 red skin potato's in with and let it go.\nWhen it was done I released the pressure, took my potato's out for mashing and drained the \"liquid\" in my meatloaf pan. I mixed the sauce for the top but added a bit more sweet for me and put it in my oven and let the top \"dry out\" and put the sauce over it and let it set. Sliced, plated and ate and I loved it. I was shocked about the apples but I could not detect any apple flavor and I made my own breadcrumbs from crusty bread. Basically, this is the first \"GOOD\" meatloaf I have made in a long time and I am making this AGAIN! THANK YOU for posting this. \nOH! I put foil over the meatloaf in my IP and placed the taters on top if that helps anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine LaRue"
},
"reviewBody": "I used 2.25 lbs of 85/15 ground beef plus 1 lb of 96/4 ground beef (that's what I had on hand). I adjusted the quantities of everything up slightly. I made two meatloafs out of this -- one for now and one to freeze. I put the sauce on before cooking. I also added an egg to make it bind together better. I also add worcestshire sauce to the meat mixture. There were no leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scarlet"
},
"reviewBody": "This meat loaf blew me away. I thought it was weird at first putting apples in it, but it totally works. The only change I would make for next time is adding less mustard to the sauce, but that's a personal preference. Otherwise, SSOOOOOOO good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan Gibson"
},
"reviewBody": "Excellent recipe! Only change I made was to use 1 lb ground beef and 1 lb ground pork sausage. The sausage gives meatloaf much needed flavor. It held together nicely and tasted great. The topping sauce was a little too tangy for our taste. Will cut mustard quantity in half next time I make this. I cooked it with the halved potatoes and Parmesan under the meatloaf as another reviewer recommended. The mashed potatoes were amazing too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "skavka"
},
"reviewBody": "I added Garlic Salt and for the sauce I added honey mustard in addition to regular mustard.\n\nYes, I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meadowsweet Rider"
},
"reviewBody": "i used my Mealthy. Just placed the hot air fryer on after the pressure cook and done. All one one device. Meat was tender and flavorful. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice"
},
"reviewBody": "I've made this twice and loved it. I changed some of the ingredients a little and left out the apple. I browned it on the stove top in my cast iron skillet before I put it in the instant pot. I reduced the cook time 5 minutes because of the browning time. Carrots, small potatoes on the bottom, with seasonings and a can of chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kschultz22"
},
"reviewBody": "Tasted delicious but could not cut the loaf. It instantly fell apart into a pile of meat. Maybe 1/4 cup of water next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debi Blanco"
},
"reviewBody": "I used ground turkey and added red and yellow peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie F."
},
"reviewBody": "This was fantastic, and will definitely make again! I was a little worried about the meat being underdone based on a couple other reviews, so I cooked it for 30 minutes instead of 25. It came out right at 160º, and was delicious! I added an egg because the meat mixture was a little crumbly, and hot paprika because I put it in everything, and it was perfect. I loved the apples, they added a lot of moisture and nice texture, but not too much sweetness. The sauce on top was tasty, too. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "I added 1/2 teaspoon sage and some ground pork. We like Chili Sauce so I made your sauce and added some chili sauce as well. Turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RV Living"
},
"reviewBody": "Will make it again; halved it this time. Will make the full batch next time. 1 lb. beef made 2 mini-loaves and just fit in the Instant Pot. Cooked it on Hi Pressure for 15 minutes + 10 min natural release to hit 160 degrees. Will not broil it next time. Just top with glaze and pop in oven for a few minutes. Was just a bit over done with the broiling and didn't need it for color once the glaze was on. Apples were great and not too sweet. I chose the recipe because I had an extra apple that I needed to use. Glad I did. Thx Cybergy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Malena Orr"
},
"reviewBody": "I used onion soup mix instead of an onion and I used tomato paste instead of ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Bell"
},
"reviewBody": "I would definitely make it again. Next time I will add half the amount of onions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anne-Claire Schaad"
},
"reviewBody": "It was meatloaf. It tastes fine but not special, and the recipe was too big for our Instant Pot so the meatloaf was not even halfway cooked with the time in the recipe (because the meatloaf was thicker than it would have been in a bigger instant pot). Next time I'll double the time to see if that helps. I don't think this was any better than making a regular meatloaf, though it saves a little bit of time if you can get the minutes on the instant pot right for your meatloaf and your instant pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzannah Brennan Shadle"
},
"reviewBody": "Love it!!! I added a bit of Siracha to the topping because my husband likes it hot. And some melted cheese at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Salvati"
},
"reviewBody": "Excellent recipe! Was flavorful and perfectly done. Definitely will be a staple in this household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Pressley"
},
"reviewBody": "Added fresh garlic and green peppers. Amazing. 25 MIN. WOW."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Rhodes"
},
"reviewBody": "Pretty good taste. Would like to know which size pot the author used, wondering if it made a difference. My meat came out done on the ends and sides, middle was extremely rare. meat thermometer read 110 when we took it out of the broiler. Rather than wait for the pot to build up pressure, we put it in the oven at 350 until the internal temperature said 160, about 25 more minutes! \n\nUnlike another person who said there's wasn't done due to his/her total meat weight being 2.25 instead of the 2lbs called for, mine was exactly two pounds (I've noticed at Wally Mart the 1lb packages are marked exactly one pound, the two lb packages are marked 2.25...not sure about other stores). \n\nWould also like to know what fat ratio the author used, to see if that makes a difference. My beef was 97/3. \n\nI was surprised at how good it tasted after it was done. I've never put apples in my meatloaf before. Other than the apples and the topping, it was identical to what we usually make (we only use ketchup on the top...not a fan of BBQ sauce on meatloaf, which is what ketchup, mustard, and brown sugar give you). \n\nI'd give this five stars for taste, and three for not enough information, so four it is! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahtdavidson"
},
"reviewBody": "I used ground turkey and changed nothing else and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John EsQueue Dough"
},
"reviewBody": "I loved it. I didn't have any salt or black pepper in home so I used paprika and Noodles seasoning. Fortunately it came out great. It makes lots of extra sauce so I used the extra to put on the slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lance Boyle"
},
"reviewBody": "I used a slightly different recipe. Ok a lot different. 25 minutes didn't fully cook the 2.25 lb loaf. 8 minutes in the microwave to finish it up. I just used Lipton onion soup mix, 1 egg, 1/4 cup milk, 1/2 cup seasoned bread crumbs. Mix the wet with the soup mix, add the bread crumbs, mix well, add meat, mix well, cook. It's delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Hunter"
},
"reviewBody": "I think this was the best meatloaf I have ever made. It was very easy and I made mashed potatoes with it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Miedema"
},
"reviewBody": "Made recipe exactly as called for but used a springform pan on a trivet . AMAZING! Kids loved it! (I would make extra sauce to serve with it next time)\n***I also cooked it with a bunch of halved potatoes and 1 cup chicken broth + 1/2 stick butter + 1/4 cup Parmesan in the bottom, which I then blended. So we got yummy mashed potatoes and meatloaf out of one 25 minute Instapot meal! (If you do this, skip the water in the pot called for in the recipe)***"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Joseph"
},
"reviewBody": "Best meatloaf ever, from the Instant Pot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Ely-Miller"
},
"reviewBody": "BEST EVER!!! I added 1 raw egg in it also to help keep it moist... My hubs said it was the best he ever had, and that says it's a 5 star!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gary Barker"
},
"reviewBody": "Delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "woodpqrstu"
},
"reviewBody": "This was my first use of an Instant Pot. Meatloaf is a favorite of my. wife. I made recipe exactly as described and we both thought this was very good. Next time may make more sauce to serve at table side: 2 lb of ground beef make a large amount of meatloaf. Will be looking for more instant pot recipes, hopefully as good as this one. Thanks for sharing with the community."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie Ann Castle"
},
"reviewBody": "the only change I made was to use about 1/4 cup freshly chopped onion. The potatoes were way overdone, but the meatloaf was cooked properly. I did not put it under the broiler to finish; it was finished just fine. I think if I do this again, I will set the timer for only 18 minutes, and then finish the loaf under the broiler. I also was not a big fan of the balsamic in the glaze. I think it would have been better with about 1/2 of the vinegar and adding 2-3 Tbls. of brown sugar....which is what I will use next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/265169/instant-pot-meatloaf/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/256/main-dish/meatloaf/",
"name": "Meatloaf Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/998/main-dish/meatloaf/beef-meatloaf/",
"name": "Beef Meatloaf Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/265169/instant-pot-meatloaf/",
"name": "Instant Pot Meatloaf"
}
}
]
}
}
, "about": [
]
}
]