				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Instant Pot Corned Beef"
,"datePublished": "2019-04-04T00:13:59.000-04:00"
,"dateModified": "2023-02-20T18:25:46.580-05:00"
,"author": [
{"@type": "Person"
,"name": "Soup Loving Nicole"
,"url": "https://www.allrecipes.com/cook/souplovingnicole"
}
]
,"description": "Instant Pot corned beef with all the fixings is ready in just 2 hours with an electric pressure cooker. Guaranteed juicy, tender corned beef every time."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/O1q3zfaVLJaVQH6eGJBglJ_F5aA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/205547_InstantPotCornedBeef_mfs_step4_0135-1-5f55bee48ad74367833bf539861e9288.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6304048863001",
"description": "This Instant Pot corned beef recipe is easy to prep and ready in just two hours. The beef brisket is cooked with beer and garlic in an electric pressure cooker to guarantee juicy, tender corned beef every time.",
"duration": "PT1M25S",
"name": "How to Make Instant Pot Corned Beef",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/d4afefb1-5e1b-4c7e-a0a6-f82e41ade3f4/c7b1aab4-327e-4a87-8b7b-cd18ecd330ed/1280x720/match/image.jpg",
"uploadDate": "2022-05-17T15:14:51.761-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Pot Corned Beef"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "205"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "417 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "146 mg"
,"fiberContent": "0 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "1697 mg"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"2 cups water",
"1 (12 fluid ounce) can or bottle beer",
"4 cloves garlic, minced",
"1 (3 pound) corned beef brisket with spice packet" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4Vbrf2dnA9uxPmkMEjdT5kiLKY4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/205547_InstantPotCornedBeef_mfs_step1_0097-1-95cfd6f222964fb7958665e18eb55a3a.jpg"
}
]
,"text": "Gather all ingredients."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v_Uyz6azQ4hq2iTcTvOPdM4oe3Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/205547_InstantPotCornedBeef_mfs_step2_0100-1-26509c97c3574a62bae0a7acc0146829.jpg"
}
]
,"text": "Combine water, beer, and garlic in a multi-functional pressure cooker (such as Instant Pot)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9aWxbLiGj3Kd_vOi-iEYVPZNcLI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/205547_InstantPotCornedBeef_mfs_step3_0102-1-3972f5d1bc8646d499b7a6c786f6a7da.jpg"
}
]
,"text": "Place trivet inside. Place brisket on the trivet and sprinkle spice packet on top. Close and lock the lid. Select high pressure according to manufacturer&#39;s instructions; set timer for 90 minutes. Allow 10 minutes for pressure to build."
} ,{
"@type": "HowToStep"
,"text": "Release pressure carefully using the quick-release method according to manufacturer&#39;s instructions, about 5 minutes. Unlock and remove the lid."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/O1q3zfaVLJaVQH6eGJBglJ_F5aA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/205547_InstantPotCornedBeef_mfs_step4_0135-1-5f55bee48ad74367833bf539861e9288.jpg"
}
]
,"text": "Transfer brisket to a baking sheet, cover with aluminum foil, and let rest for 10 to 15 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Frane"
},
"reviewBody": "I made this recipe pretty much straight up. I didn't have potatoes in the house so those were left out. 90 minutes on my brisket, which was about 3.5 pounds, was perfect and I just finished off the leftovers by pan frying slices and adding some horseradish. Soooo good. The carrots were fine but 5 minutes on high pressure was hard on the cabbage. Maybe low pressure next time? and/or cutting time down. Over the years I have gotten a lot of sub-par packages of corned beef from super markets. This beauty caught my eye at Costco and turned out to be a really good brisket with an appropriate fat cap and lot of flavor. This might be something the recipe could address: sourcing the beef. I'd probably knock off a half star for the cabbage but I was there for the corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RESONNANT"
},
"reviewBody": "Made this exactly as stated but cooked an almost 4 lb corned beef for only 75 minutes. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Singman"
},
"reviewBody": "Quick, easy, simple and delicious. I used beef broth instead of beer. The veg in that broth needed no extra seasoning unless you prefer more punch (serve with hot mustard, maybe?) My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good base recipe. Needed this for my new 8qt IP. Couple things, most of the ingredients are bitter or salty so I add 1c each water and apple juice to the beer. Also a bay leaf. Stick to the 20 min/lb at HP then quick release. Cabbage and carrots take 8 min at HP not 5. They come out tender but not mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scelzas"
},
"reviewBody": "I followed the recipe exactly. Worked out great. Major time saver and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the corned beef recipe as written. The brisket I had was a tad bit smaller than called for, but I cooked it as directed and it turned out great. I opted to oven roast carrots and baby potatoes with a small onion. We enjoyed the beef and vegetables with brown bread and a wee bit o' coleslaw. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I cooked my 3.16lb. Corned beef just like the directions said. It turned out so tender. I used Guinness Beer and garlic for 90 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "perricwocom"
},
"reviewBody": "My husband and 2 guests RAVED about the corned beef. I also loved it - just delicious! My husband has gone back to the store to get another corned beef so we can make another one! I will be saving this recipe. (Oh, I didn’t not use the trivet, I submerged the corned beef into the liquid)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna Braun"
},
"reviewBody": "I shortened the cooking time to 45 minutes (I read the comments) and the corned beef was just right. Love the ease of making my corned beef this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the 20 minutes per pound rule. Cooked a 3.5 pounder. Came out perfect. Did not use beer but next time I will! Thank you so much. Loved it. Made great sandwiches later on. On rye bread. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yowza, what a delicious dinner! My butcher sells the brisket pre seasoned, so mine didn’t have any spice packet with it. I used a bottle of 5-year old gluten-free beer that I found in the back of the fridge (good use for it), and I added a tbsp of Better Than Bouillon to the water. Otherwise I followed the instructions in the recipe exactly. My brisket was smaller than 3 lbs, so I shortened the cooking time, and the meat is definitely “al dente”. But I kinda like to chew on my meat and enjoy the juices, so I don’t mind that. Next time though, I’ll make the cooking time longer. Otherwise, a successful recipe I think. It’s added to my collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aloysius"
},
"reviewBody": "I used this as the basis for cooking my corned beef tonight. I opted for 3/4 C of apple cider vinegar and 2 C water and I only cooked it for 75 minutes. I should have done the full 90 minutes, but, as you all know, it is hard to check on it partway through (I love instant pot recipes that include phrases like \"cook it until no longer pink in the center\"!). I cooked a bunch of potatoes and carrots in the juice while the meat was resting. My wife's verdict was \"go back to your method of cooking it in the crockpot next time.\" It was good, but not as good as simply tossing the frozen slab of corned beef into a crockpot on low (no, no water or anything else, just the corned beef) with a piece of aluminum foil under the lid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Flavor great, texture not. The reviews made it sound fool proof! Got a 2.5lb piece, followed the 20 min per lb suggestion for 50 mins. The meat was so seized, not fork tender in the least. Removing meat and adding veggies, went for 6 mins per another review and it came out like mushy baby food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kcf"
},
"reviewBody": "Easy and great--a family favorite! I used apple juice rather than beer and it turned out juicy, flavorful and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the BEST corned beef recipe ever! I only made two changes: light beer because we did not have dark, and, I happened to have clear chicken soup broth in the fridge so I threw it in instead of water. The smell absolutely drove me crazy it was so good and the taste was pure heaven. Oh, and also the kids don't like to see the seasonings from the package so I tossed them into a little muslin bag and infused...leaving the bag in till removing the meat was done. Thank you, soup loving nicole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thank you Soup Loving Nicole for this recipe! My wife and I made it your way tonight with our InstaPot and it was the absolute best corned beef we ever had! Try it everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making corned beef and cabbage for over 20 years and this year was the first I've used my InstantPot to cook it. I'll never cook it any other way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovemykids99"
},
"reviewBody": "Yum! Im not very instant pot skilled. I was worried about the time frame, but since I only had a 1.67 pound gray brisket, I ended up deciding on 60 mins and then quick release, let it set for 15 mins covered on a plate. I may have been able to do a little less like 50 mins, but it was tender. It didn't come with any spices, so threw on my own. I did just shy of a can of Guinness a couple garlic cloves, a beef bouillon and 1 cup of water. I was most surprised with the vege part of the deal. As the author mentioned, while the roast rested put in the red potatoes (had the larger ones that I quartered/halved) carrots and the cabbage back into the instant pot, set for 5 mins on high (took about 10 mins to get back to temp) in the juice and it was perfect! I really thought they would be mushy and they were perfect! I will make a bigger roast next time, but I will probably not quite do 90 mins. Thank you! UPDATE: I made a 3 pound brisket and cooked for 75 mins. It was totally tender, the only reason to cook a longer time my guess is, is to render the fat more? While the meat was perfectly cooked, it still had a lot of fat on/in it. It was yummy all together though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Que"
},
"reviewBody": "This is an excellent recipe. I cooked a 4 1/2 lb corned beef for 90 minutes at high pressure. It was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The DDO (Dir.of Dom. Op)"
},
"reviewBody": "The corned beef came out beautiful…this is my new go to recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Tiedt"
},
"reviewBody": "I did about 20 minutes per pound in the instapot. The addition of a bottle of Guinness Stout beer (it was pretty dark) made it the best corned beef and cabbage I've ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Schwarzman"
},
"reviewBody": "Loved it! It came out very tender and delicious. I am not much of a cabbage lover so I just added carrots and baby reds as suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for St. Patrick's Day and it was wonderful. I followed the recipe but only cooked beef for 75 minutes. After 75 minutes I added all of the veggies and cooked for another 15 minutes. Probably 10 minutes would have been fine but it was wonderful either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie M"
},
"reviewBody": "A great simple recipe that I made even more simple as I didn't have beer or garlic lol. I had a 3.3 lb corned beef, used 2-3/4 cups water in an 8 qt instant pot. I placed the corned beef with its spices on a trivet. I cooked it on high for 65 minutes, gave it a 20 minute natural release, and then released the remaining pressure. It was so tender you could cut it with a butter knife and full of flavor. I highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "delicious and easy doesn’t really matter but fat side up helps otherwise simple and straightforward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "I made this tonite and it was delicious! Even my picky eater liked it. I prefer recipe sites that include comments because I often pick up a hint or two from them. I added a little smear of dijon mustard on top before putting on the spice packet. I added a quartered onion. I did not use beer as I don't like it. I used 2 cups of water with a spoon full of beef bouillon concentrate. I also added a bit of Maggi Amore. I had a 3.3 pound point cut of corned beef. I cooked it just as directed in the recipe for 90 minutes. I let it do a natural release for 15 minutes and then quick release for the rest. I set it aside for 15 minutes before serving. It was incredibly tender and flavorful. I can't understand why some people had issues with it being dry? Instead of the customary potatoes I served it with cheese filled perogies. They were a nice combination. Thank you for posting such an EZ and flavorful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thebigreader"
},
"reviewBody": "I've used this recipe several times now. I also cook up some cabbage on the stove. In a skillet, I melt a stick of butter, add 2 Tbsp minced garlic, and a whole head of chopped cabbage. I season with Seasoned salt and black pepper. It's so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "easyguy"
},
"reviewBody": "I love corned beef sandwiches, especially Reubens, but my problem is that I always overcook the brisket and it comes out dry, stringy and impossible to slice. Likewise with this recipe. Total waste of a nice piece of meat. Then I tried this. : I put it in the instant pot and set it for 40 minutes at low pressure and shut off the keep warm feature. Then i left it to release naturally and let it cool in the pot without opening it for several hours. I figured I could cook it again longer if it were still tough, but It came out perfect. Tender yet sliceable. This is how I'll always do it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "giggletush"
},
"reviewBody": "This was fantastic!!! I followed one of the reviewers suggestions to cook it 20 mins per pound and my corned beef was not hard or chewy at all.. I could cut that with my fork. I also have a brewers yeast allergy so instead of beer I just used yeast free beef bone broth. I’ll use this recipe from now on! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "footballmomnva"
},
"reviewBody": "Made this today (since I have to work late tomorrow on St. Paddy's day) and it turned out perfect. I did only cook the corned beef for 60 minutes on high pressure. While it rested, I added carrots and redskin potatoes to the beer/water/garlic mixture in the pot and cooked for 5 minutes and they turned out great as well. Will definitely be making this again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "I followed the directions &amp; it came out delicious!!!! Super tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carebear1982"
},
"reviewBody": "Followed to a T. Bottle of beer, two cups water, couple tsps of minced garlic. Trivet with about a 4lb corned beef on top, sprinkled with the season packet. I did 95 min because mine was a little bigger then the recipe. Sliced against the grain. It was mouthwatering tender and delicious. I did colcannon potatoes on the side and cooked carrots separate, then stirrered into the meat juice left in the pot for a few minutes. All was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is perfect. Not dry. Not tough at all. I made a 5 lb flat cut brisket and added 3 cups of water, 1 14 oz can of Guinness, 6 garlic cloves smashed. My brisket did not have the pickling packet so I had to make up one. Found a recipe. I used coriander, bay leaves, peppercorns, mustard seeds, all-spice, cloves and recipe also called for fennel seeds but I did not have any. 90 minutes cook time, 15 NPR. THANK YOU FOR SHARING YOUR RECIPE, NICOLE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This came out just Perfect. 10/10 Will make again. (Just don't vent your beer broth like i did when the timer went, it made a huge mess lol)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is absolutely perfect. To the person who posted that it was overcooked and tough they probably didn't let it rest or cut it with the grain. They are a Marie Callender Sharon (Google it). This is definitely my go-to technique on this. If I could give it 10 stars I would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Gonzalez"
},
"reviewBody": "Was the best corned beef I ever made, as there was no dryness. A few reviews had me worried about the cook time of 90 minutes, so I went with the directions, and it was great! Only tweaks was beef broth instead of water, and an onion was added. Veggies at 5 min. were perfect. Sometimes I think it's the basics that we need to focus on, and this recipe does just that. Next time, I'll try hard cider instead of beer. Great flavor, thanks for sharing!! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JoeP"
},
"reviewBody": "Too much liquid and 90 minutes was too long for 3.1 lb brisket. After adding the 2 cups of water with a 12oz. IPA the brisket was nearly submerged. Next time will only use about 4 oz of water if any. I will also place it on a (egg) tray to keep it from boiling in the liquid. \n\nWhile the meat was resting I did add diced red potatoes and a half head of cabbage and set the instant pot for 4 minutes. That came out good, the taters were soft and the cabbage still had a little crunch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jb1"
},
"reviewBody": "Did 45 minutes and it worked better. Some instant pot recipes strongly recommend not using high heat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Scott Haney"
},
"reviewBody": "I had high hopes for this recipe. I had a 4 lb brisket and used 1 12 oz bottle of beer, 2 cups of water ( flavored with Better than bouillon Garlic) and the seasoning packet. \nI set it it for 80 minutes instead of 90 after reading a couple of the reviews about dry briskets.\nThis was dry and flavorless. The liquid smelled amazing , I wish the meat tasted as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet L"
},
"reviewBody": "I have made this recipe before and it turns out absolutely wonderful!! \nThank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Lee"
},
"reviewBody": "I used this recipe to cook my Corned Beef which I used to make Warm Corned Beef Sandwiches. It was marvelous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kevin"
},
"reviewBody": "Outstanding!!\nFollowed the directions to a tee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lathie McKinney"
},
"reviewBody": "Fantastic. Cabbage wasn't overcooked. It was a hit on St Patrick day. Will definitely do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Mark"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dayna Jensen-Rybarski"
},
"reviewBody": "I set it for 70 minutes on the meat setting. It was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "urbangiggles"
},
"reviewBody": "Made it according to recipe and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marla Paul Eschbacher"
},
"reviewBody": "This was easy &amp; delicious! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam R"
},
"reviewBody": "Made this today, loved it. Yesterday, I used my go-to, slow cooker recipe for corned beef, since we didn't have any leftovers to make Reubens, a must-have for us, I decided to try this insta-pot recipe because it was quick. Well, I loved how easy this was and I also noticed less shrinkage to the meat. This will be my new go-to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LVPhyl"
},
"reviewBody": "It was excellent! I made it as directed, except that I put the meat atop my silicone steamer basket. The meat was very tasty and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Timothy Dill"
},
"reviewBody": "Wonderfully easy! Turned out delicious though I used white wine instead of beer because I wanted to drink the beer I had. I did find that it was just a little over cooked, even though I reduced time to 60 minutes for a 3.25 pound brisket, then put it back in over the vegetables for 5 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry "
},
"reviewBody": "See first review to add cabbage, potatoes and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Zaring Browning"
},
"reviewBody": "Excellent recipe. I adjusted a bit as we did not use beer and I only had 2 lb brisket. I cooked for 45m and added the cabbage last. Perfect flavor &amp; temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Connors Smith"
},
"reviewBody": "The MOST delicious corned beef and cabbage we have ever had. I'm still getting compliments. I soaked the corned beef in water for several hours to remove some of the salt. I used the 20 min/pound of meet formula for cook time. I cooked the brisket on top of one roughly chopped onion and 5 cloves of garlic. Slathered the top with course stone mustard to help hold the seasoning. Used 1 bottle of Guiness stout and beef broth for liquid. Did the veggies while the brisket rested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valerie Peloso"
},
"reviewBody": "Quick and easy and delicious ! Will definitely make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Southern Chef"
},
"reviewBody": "I would strongly recommend leaving the fat cap on and placing the brisket on the trivet with the fat cap up. Fat = Flavor and it will help keep the meat moist. The liquid level should also cover almost to the top of the meat Enjoy - this is one of my favorite meals. Side it with some fresh rye bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "QuickCooking"
},
"reviewBody": "Not sure if it was me, the meat or the recipe, but end result was not as expected . Meat was thoroughly cooked, but was not \"fall apart\" that my family likes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rwelp"
},
"reviewBody": "This has worked out every time for me. I love that I can make a juicy corned beef in an hour and a half. They have never been dry yet though I do tend to go with a 4lb and follow your same direction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina"
},
"reviewBody": "I love how clearly this recipe was to follow, I appreciated how she also said to add 10-15 mins for pressure to build in the Instant Pot.\n\nSo many recipes I find online are not concise and clear to follow. This is THE EASIEST and most fool proof method of making Corned Beef. Perfectly cooked, juicy, and tender!\n\nTHANK YOU!!!\n\nBon Appetit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith David"
},
"reviewBody": "yes! It was delicious! I reduced the cook time to 60 minutes for the 3 lb roast which was tender and juicy. Used beef broth instead of water and added half an onion, chopped. Cooked veggies for 6 minutes while meat rested. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beverly19491d4s"
},
"reviewBody": "This is the first time I had a recipe for my instant that didn't work. Corned beef was 2.5 pounds, so I cooked it 50 minutes. It was tough. So I put it back in with the vegetables as suggested. The vegetables were great. But the beef was still tough. I'm going back to my slow cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JTO"
},
"reviewBody": "Super tender! I let it do a natural release for 20 minutes before opening up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Cavaletto"
},
"reviewBody": "This was great, fast and easy! I don't drink alcohol so I used 2 Cups apple juice and a cup of water. I used about 5 lbs of corned beef and cook for 90 minutes. I followed the directions exactly with the exception of no beer and using apple juice. This came out perfect and flavorful. I did use the suggestion of another reviewer that said he put the fat side up to keep the meat moist. That worked really well. Also there was very little shrinkage if any at all. This was perfect and I am definitely saving this recipe for future use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemary Stalhood"
},
"reviewBody": "They loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Swiderski"
},
"reviewBody": "this was very helpful as new to instant pot, was tender and delicious, will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Partaka"
},
"reviewBody": "This is the second time I have made this dish. I use a dark stout beer and it adds so much flavor. Comes out fork tender each time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camille"
},
"reviewBody": "I did the same as another review only for 60 minutes and slow release"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Turned out delicious, juicy, and very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karothom"
},
"reviewBody": "I used Guinness and chicken stock for the liquid and added onions as well as the garlic. It makes for a richer flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marciafwtx"
},
"reviewBody": "The meat came out very tender (I had a 3.4 lb corned beef that was pre-seasoned from Trader Joe's and it was the stringy type but I like it that way) and added a little more beer to make up for the extra weight and put the onions at the bottom first. I did add the potatoes and carrots at the end for another 5 minutes (after removing meat) but that didn't seem long enough - maybe another 5 mins would have been good. The family loved it. And it was fairly simple, unlike many other InstaPot meals. Will do again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TWynnB"
},
"reviewBody": "this was fantastic.\nI used a 4 lb flat cut, did the 90 minutes in a 8 qt IP as directed and no issues with being dry.\nLoved the flavor and this will definitely be my go to corned beef recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "it was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pegvg"
},
"reviewBody": "This was really good, and very easy to make. I always make my corned beef in the slow cooker, but I thought I would try it like this and I'm happy I did. I used a 4lb corned beef and Guinness beer. I used 2 bottles along with 2 cups of water to make sure the corned beef was mostly covered in liquid. Very good! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazal4"
},
"reviewBody": "Great as is - using a suggested (from a reviewer here) high pressure time of 20 min per pound. As suggested by Nicole I cooked the potatoes, carrots and cabbage as the meat rested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladavy"
},
"reviewBody": "Very tender!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josh Morris"
},
"reviewBody": "Added bacon and carrots and potatoes.... bacon was very tasty but very greasy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Rodenbeck Storm"
},
"reviewBody": "This was delicious - It made a working womans St.Patricks Day a breeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "It was amazingly GOOD. Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Banks"
},
"reviewBody": "Loved how easy it was. Did as the top comment said and put some potatoes, cabbage, and carrots in for five minutes after removing the beef and the trivet. The veggies were my husband's favorite part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stressedout_one"
},
"reviewBody": "I cooked it for 75 minutes after reading the reviews and it was perfect. I also cooked the vegetables in the liquid while the corned beef as suggested. The timing was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Spear"
},
"reviewBody": "Worked really well. I placed the packet in the water, didn't cover the meat halfway, no onions, and it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DANAROBB"
},
"reviewBody": "Couldn't of made it any better than the recipe. Company loved it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "notsuzyhomemaker"
},
"reviewBody": "This was awesome.. I did cook veggies separately while meat rested. I did 20 min per pound and it was perfect. Used brussel sprouts, little red potatoes and carrots at 5 min. Did quick release for both."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "This is a delicious and easy way to cook corned beef. It turned out wonderfully juicy and tender. I followed the recipe except, per another reviewers suggestion, I pressure cooked for 20 min. per pound (instead of the recipe direction for 90 min.). After removing it from the IP I laid the beef on a rimmed cookie sheet, sprinkled about 1/4 cup of brown sugar on the top and put it in the broiler for about 5 min. until the sugar was caramelized. I will never cook corned beef any other way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Paula Parker"
},
"reviewBody": "90 minutes was too long, meat was overcooked. I looked at other on-line recipes and was the recommended time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jay Smith"
},
"reviewBody": "The problem with instant pot corned beef is that it's too salty. When you buy corned beef at the store it's been brining in a salty curing solution for a long time. When you cook it the traditional method with a LOT of water, it draws out the salt which flavors the broth. In an instant pot, especially sitting on a trivet, there is nothing to draw out the salt and the end product is way too salty for most people. \n\nSo, if you want to use the instant pot, either soak the meat in cold water for several hours or overnight, changing the water a couple times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "I followed this recipe using a 3 1/2 lb. flat cut corned beef cooking for 90 minutes. I was very disappointed, it was tough, the flavor was lost. I will only cook corned beef via the slow cooker from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheriig"
},
"reviewBody": "Very tender and moist"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jrocks"
},
"reviewBody": "Excellent and easy. Only thing I did differently is I did not vent but let the pressure reduce naturally. Letting the pressure reduce naturally really makes a difference in the meats tenderness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cape Cod Annie"
},
"reviewBody": "So moist, tasty &amp; easy. I had a 2 pound flat thick corned beef so I cooked it for 20 minutes a pound/ 40 minutes. I used the full amounts of water, Guinness &amp; garlic &amp; couldn’t be happier with this recipe. I did cook the cabbage, baby carrots &amp; potatoes 5 minutes afterwards in that delicious broth (w/ quick release) while the corned beef was resting. It’s now my “go to” St Pat’s recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Brewster"
},
"reviewBody": "That was so easy! I followed the recipe exactly and it came out perfectly delicious, just what this St. Patrick'd Day needs!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vSKILLit"
},
"reviewBody": "I didn't have any beer on hand so I used a combination on homemade chicken stock &amp; Ginger ale. Sounds silly I know but it was amazing! I didn't let the beef rest after taking out of pot. I just shredded it immediately. I also added onion &amp; parsnips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Very easy and pretty darned good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jean"
},
"reviewBody": "This is fantastic! I didn’t have beer. Substituted a Cabernet olive brine. I did a Dijon mustard coating, as another reviewer suggested, so seasoning packet would stick. I had a 2.5lb point cut corned beef and cooked for 60mins...it was perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grimalkin"
},
"reviewBody": "The Instant Pot worked great for corned beef - it was tender but still held its shape and was easily sliceable. \n\nI used liquid as the recipe calls for - it was WAY too much. Either cut it to a cup total and/or use natural release for at least 20 minutes (not 5) - and definitely wait until your pressure valve is completely in the depressurized position. \n\nBy the time the brisket was done, and had released all its own liquid, even after waiting the recommended release time, cooking liquid shot out of the pressure valve when finishing with quick release (as the recipe suggests)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Will definitely make this again. I put seasoning packet in the water instead of on the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PollyPL"
},
"reviewBody": "This was the best, most tender, corned beef I’ve ever fixed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Fiedler"
},
"reviewBody": "I have made this 3 times now and it has been delicious each time. I do not use dark beers but use a cheap beer and it doesn't seem to matter. This is better than any other method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tucker"
},
"reviewBody": "It was delicious!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/268026/instant-pot-corned-beef/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/472/main-dish/beef/corned-beef/",
"name": "Corned Beef Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/268026/instant-pot-corned-beef/",
"name": "Instant Pot Corned Beef"
}
}
]
}
}
, "about": [
]
}
]