				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Instant Pot Ground Beef Stroganoff"
,"datePublished": "2019-12-17T02:04:57.000-05:00"
,"dateModified": "2023-02-15T09:27:36.000-05:00"
,"author": [
{"@type": "Person"
,"name": "peloquinswife"
,"url": "https://www.allrecipes.com/cook/9483205"
}
]
,"description": "This crowd-pleasing, family-friendly beef stroganoff is made quickly and easily in the Instant Pot. Use ground turkey for a healthier version."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/C2BhrFkEa0sV8rKT0EGMeW1k3bU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7642847-03b8478165b7447fa1f331aab5163bbc.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Pot Ground Beef Stroganoff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "35"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "494 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "95 mg"
,"fiberContent": "4 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "911 mg"
,"sugarContent": "6 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound ground beef",
"16 ounces chopped fresh mushrooms",
"2 onions, minced",
"4 cloves garlic, minced",
"4 cups water",
"2 (10.75 ounce) cans condensed cream of mushroom soup",
"1 (16 ounce) package egg noodles",
"2 tablespoons Worcestershire sauce",
"1 (1 ounce) package dry onion soup mix",
"1 cup sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Turn on a multi-functional pressure cooker (such as Instant Pot) and select Saute function. Add ground beef, mushrooms, onions, and garlic. Cook and stir until beef is browned and crumbly and onions are soft, 5 to 7 minutes. Add water, soup, noodles, Worcestershire, and dry soup mix. Close and lock the lid."
} ,{
"@type": "HowToStep"
,"text": "Select high pressure according to manufacturer&#39;s instructions; set timer for 3 minutes. Allow 10 to 15 minutes for pressure to build."
} ,{
"@type": "HowToStep"
,"text": "Release pressure using the natural-release method according to manufacturer&#39;s instructions, 10 to 40 minutes. Unlock and remove the lid. Stir in sour cream."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WayneSch"
},
"reviewBody": "This is the first thing I've made with my Instant Pot. It was fairly simple and turned out good. I did add some sweet peas to it at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I made it exactly as the recipe read. Except for the ground beef I bought almost all the ingredients at A discount supermarket. It cost me about $15 to make this whole meal which easily feeds 8 people. If you have bigger eater serve with a salad or bread. I‘be made this many times but never actually figured out how inexpensive it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristilhall"
},
"reviewBody": "Tasted great. Noodles were slightly over cooked. Next time I will release 3-4 min. \nI also subbed the meat for shaved beef. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gailf"
},
"reviewBody": "Quick, easy and delicious! I saw the recipe this morning and made it for dinner. I had all the ingredients on hand except the mushrooms. My husband isn’t fond of sour cream, so the next time I will omit that. This definitely serves a crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Pulley"
},
"reviewBody": "This was simple and pretty good, although I found it a bit bland even with all that flavoring added. I used a can of beef broth in place of 2 cups of water. I also used about 12 oz of pasta and it was plenty. Based on other reviews, I put it in for 6 minutes, let it sit 3 minutes and then did the quick steam release. Worked beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammie Swanson"
},
"reviewBody": "I loved the recipe however, the recipe does not tell you when to add the sour cream, I figured it was with all the remaining ingredients, and it turned out delicious thank you for this recipe, sincerely Tammie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sb"
},
"reviewBody": "This was very flavorful and delicious with a few changes! I added 1 Tablespoon of beef bouillon. Also added in a packet of onion n/chive dip mix that I got from a craft show. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond"
},
"reviewBody": "Awesome. Followed directions except do fast release after 2 minutes of natural release"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jewell"
},
"reviewBody": "Tasty. I followed the other reviews and did a quick release. Perfect noodles!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maxine G. Reyes"
},
"reviewBody": "I added a little more sour cream as well as ground meat. Some of my sons do not like mushrooms. I cut them in halves so I can easily spot them and remove from their plate - lol! I would suggest adding the seasoning mix packet to the ground meat already so the flavors are already in the meat and mushrooms which is what I'll be doing next time. Consider adding a little salt and pepper to you liking at the end. All in all - It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vernon Wolley"
},
"reviewBody": "Very Good! Tastes like the stroganoff that my mom made when I was a kid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "The noddles were very soggy but the flavor was really good! I will definitely make it again because it was very easy and good. But I will probably just make it all in a skillet and cook the noodles separate. Maybe add half a pound of beef to it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "I admit I was skeptical it would all fit into my instant pot and come out tasty. I had only made pasta in instant pot once before. However, this came together very quickly, and indeed did fit. I cooked it 4 minutes and then natural released 3 min and then quick release (after reading everyone's reviews). Was really creamy and delicious. Next time I will reduce Worcestershire sauce a little. Will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michellegott"
},
"reviewBody": "My son and I made this for the first time and it was the first time using a IP. We loved this recipe and we’ll make it again for sure 100%."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "edeas_knight02"
},
"reviewBody": "I follow the suggestions above and did not let it depressurize for 10 to 40 minutes. Instead, I released it via the quick release after three minutes of the natural depressurization. The noodles came out perfect. \n\nIf you add Parmesan cheese on the individual servings, it really makes the dish. We cooked it with half of the mushrooms and you cannot even taste the mushrooms in there (for people who don’t like mushrooms). We did a VERY FINE chop on the mushrooms and onions and it blended perfectly with everything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "No salt was in the recipe so salt enough for the meat and noodles. I used beef bullion, 1 cube per cup and use the broadest egg noodle you can. \n\nAnd of course, about a 1/4 cup of hot sauce....oh yeah!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Great recipe! I just used 1 onion and 6 ish oz of mushrooms (most of an 8 oz container) and I thought it was plenty. I followed other reviews and let it natural release for 3-4 min and quick released the rest and it turned out well. I also added salt, pepper, and garlic powder to the meat and onions when sautéing. Overall great recipe and would make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanad"
},
"reviewBody": "Oh this recipe is SO good!! I followed the steps to the letter. It was very good, but was lacking something. I decided to add broken tortilla chips to my bowl, and that sent it over the top in flavor. Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bunny12345"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "franmom"
},
"reviewBody": "Delicious! Everything came out perfect, even the noodles!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Libitha"
},
"reviewBody": "I followed the recipe using \"egg noodle pasta\" which did not get mushy. The stovetop boil time for this pasta is 20 minutes versus the usual 10 minutes for most pasta, which likely protected it from the mush problem. \nIt is more expensive, especially if you purchase frozen, but large bags of dry egg noodle pasta can be purchased at warehouse stores."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Geer"
},
"reviewBody": "Ah-mazing! Followed recipe exactly and turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I have this in the instant pot now. The first time I made this I left out all of the extra onion, just depended on the dry onion soup mix to be enough onion flavor. I also didn't use any mushrooms. I did add a can of green peas after the pressure was released, when I added the sour cream. I also added what we call a puck of Knorr beef base before pressuring. This was fabulous! I followed someone else's directions to pressure for 3 minutes and natural release for 3-4 minutes and then rapid release. My noodles were just right! Obviously this was a big hit, I'm making it again tonight. It's quick and easy and way better than hamburger helper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katie Hughes"
},
"reviewBody": "Absolutely will not fit in a 6 qt instant pot. Maybe you should specify that this requires a larger machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wdorange"
},
"reviewBody": "This recipe was very tasty. I had to make one small change since I didn't have 2 cans of mushroom soup, I used one mushroom and one asparagus. Will be repeating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "debbiechase"
},
"reviewBody": "This turned out ok. I am new to the instant pot, so still learning. 16 oz of mushrooms seemed like way too many, so I chopped and added about 3 cups. I got a burn warning and this scalded on the bottom so if I make this again I will make sure to deglaze. I did natural release for 5 min and then quick release, but the noodles were still too soft in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heinz57american"
},
"reviewBody": "It was delicious, I followed the basic recipe but doubled some of the items to have leftovers. The family all enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami Potirala"
},
"reviewBody": "2nd time making this. This time I replaced the water with beef broth and used 8 oz of sour cream when it called for 4 oz (I made 4 servings) . i was kinda concerned about adding so much sour cream because i can't stand the flavor but it wasnt over powering at all. I added salt and pepper when the hamburger was cooking up. Instead of using half a container of the lipton dry onion mix i used the whole thing. I think it tasted much better this time around. I also pressured cooked on high for 6 min and then quick released the pressure. Noodles weren't mushy. I used a 6 qt cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Redmond-Donaldson"
},
"reviewBody": "I am always leery of putting any kind of pasta in the instant pot because I follow the directions to a T and it always comes out mushy so what I did this time was follows the three minute stay but then I did a quick release and they were a little softer than I like but they weren’t a mushy mess"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rascalgirl"
},
"reviewBody": "Quick, easy and very tasty. I used 8 oz. of Baby Bella mushrooms as suggested. My package of noodles was only 12 oz, not 16. I thought about reducing the water as it seemed like it would be too much, but so glad I opted not to do so. Quick released for 10 or 12 minutes. I used a lower fat sour cream because that's what I had. We used salt and pepper on our individual servings, might add some prior to cooking next time. Definite Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "I made 1/2 of the recipe, could have been a little more moist. And I wouldn't use Italian dry season ings, just use the basics"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "This was delicious. Do not do natural release all the way.\n Natural release for 3-4 minutes then quick release. Noodles will be mushy if you natural release completely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thedailygourmet"
},
"reviewBody": "I am a home of one, so I reduced the recipe for four servings, I followed the recipe with the exception of the cooking time. I cooked it on high pressure for 12 minutes and did a quick release...I was hungry, borderline hangry!!! I loved how it turned out. Perfect! Tasty, delicious, easy and filling!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/278031/instant-pot-ground-beef-stroganoff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
"name": "Pasta and Noodles"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
"name": "Noodle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/278031/instant-pot-ground-beef-stroganoff/",
"name": "Instant Pot Ground Beef Stroganoff"
}
}
]
}
}
, "about": [
]
}
]