				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Instant Potato Pancakes"
,"datePublished": "2012-02-21T18:44:37.000-05:00"
,"dateModified": "2022-09-21T12:12:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "These potato pancakes with instant potato flakes are Chef John&#39;s easy recipe for crispy and flavorful mashed potato pancakes, perfect as a side dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dbxV-v62mrb61yibksYj6PfwZ98=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/846514-51df895faaaf4cb6819b03f82a9e4dc7.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1266794980001",
"description": "See a time-saving tip for making potato pancakes from instant mashed potatoes.",
"duration": "PT3M54S",
"name": "Instant Potato Pancakes",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/a8193353-ad32-452c-ba1b-93410b142a8e/25f9bf41-a0b9-4e6f-910c-9bd73e12efb4/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T12:43:45.649-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Instant Potato Pancakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "73"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "135 kcal"
,"carbohydrateContent": "8 g"
,"cholesterolContent": "55 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "346 mg"
,"sugarContent": "0 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup cold water",
"1 large egg, beaten",
"0.5 teaspoon salt",
"0.75 cup dry potato flakes",
"2 tablespoons chopped fresh chives, divided",
"1 pinch freshly ground black pepper",
"1 pinch cayenne pepper, or to taste",
"1 tablespoon vegetable oil",
"1 tablespoon butter",
"0.25 cup sour cream for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk together cold water, egg, and salt in a large bowl until salt has dissolved. Mix in dry potato flakes until incorporated. Stir in 1 tablespoon chives; season with black pepper and cayenne pepper."
} ,{
"@type": "HowToStep"
,"text": "Divide potato mixture into 4 equal portions and shape into pancakes."
} ,{
"@type": "HowToStep"
,"text": "Heat oil and butter in a large skillet over medium-high heat. Swirl the pan to combine."
} ,{
"@type": "HowToStep"
,"text": "Place pancakes in the pan, reduce heat to medium, and cook until the bottoms are browned, about 10 minutes. Flip and flatten slightly. Cook until other sides are browned, 7 to 8 more minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dbxV-v62mrb61yibksYj6PfwZ98=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/846514-51df895faaaf4cb6819b03f82a9e4dc7.jpg"
}
]
,"text": "Transfer pancakes to a serving plate. Top each with a dollop of sour cream and sprinkle with remaining chives."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made, added shredded cheese &amp; onion powder. Skipped the chives &amp; cayenne pepper. And I don't do sour cream so topping with French onion dip. Yummy in tummy for new years eve snack"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Zero_83"
},
"reviewBody": "I really like Chef John's recipes. He has some pretty amazing ones and I've never been let down when making any of them. They always taste so good! However, this one was a bit of a miss. In the video it stated he'd tell what type of potato flakes he used in the recipe. Unless I missed it, I don't see it. So I just used Hungry Jack. I followed the recipe to a T but it came out runny, had to add an 1/4 cup more potato flakes to the batch to even get it to stick together. After cooking it the best I could, they did not turn out tasty. They were okay overall if you don't have much money and need an idea for a meal to stretch food. But they became a bit bland and grainy-feel in the mouth. Don't skimp out on seasonings. I was scared I was going to over salt them with the 1 tsp salt. But I guess again, it comes down to what potato flakes were actually used. I should of went with my gut and added a bit more or a seasoned type of salt. But next time if I do need to make something just to eat, I might try a different way of making these, and I think next time I'll avoid using egg altogether as I think that's what gave it a weird texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "I sort of cheated with this. I used leftover prepared instant potatoes (hubs likes them). I just beat in the egg and seasonings and fried them in bacon grease and butter and served them with breakfast. He really liked the creamy inside and crispy outside! Will make these again to help use up leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shonda Stevens"
},
"reviewBody": "This was really good. I did some tweaks here and there, like garlic powder, Italian seasoning, and parley. I really enjoyed it. The process wasn't too bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DiamondLil"
},
"reviewBody": "Very good flavor, but I would cut the amount of water to 3/4 cup instead of 1 cup. Made as is, it was too moist and hard to flip over. I enjoyed the flavor and I will make again, but with less water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth M. Bowser Hale"
},
"reviewBody": "These were great! I used warm water so it would be absorbed quickly, and cooked these in the waffle maker which I sprayed with olive oil before each one. Nice and crispy and delicious! The whole family loved them. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Jackson"
},
"reviewBody": "These worked out great - I even doubled the recipe, no probs - have a little patience, or dont try cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WonkyGirl Glass"
},
"reviewBody": "My dogs love these with cheese mixed in, omit the chives and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PUPKINPIE2"
},
"reviewBody": "Fried mash potatoes. I added some cheese. I didn’t have green onion so I added sautéed yellow onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Gorsche"
},
"reviewBody": "I skipped the chives and added thinly sliced shallots to the batter. Fried them up in a butter soo good, adding to the recipe book for sure. Don’t make them too thick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DelAri7"
},
"reviewBody": "I followed the directions as stated. the recipe looks promising and tastes fine the way I seasoned it. I just have textural issues with these pancakes. I might stick to a more traditional potato pancake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tin Gayda"
},
"reviewBody": "Easy recipe! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Beachley"
},
"reviewBody": "I made these and they turned out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "I love this recipe. You are a genius. My mom use to make potato pancakes from left over mashed potatoes. They were always a hit except for me. I had to peel the potatoes. Which meant 7 - 8 lbs. I made them a few times for my family, but the haunting memories of peeling extra potatoes so we would have extra, stopped me from making them. So when I saw this recipe, I had to try. OMG really yummy. \nI did have to use a little more potato flakes then the recipe to get the consistency that was showed.. This is probably due to the different brand. . I also used a copper fry skillet that allowed the cakes to slide around easy. \nI have used potato flakes for potato soup but I never thought of use them for pancakes. \nDo you have a recipe to make potato bread from flakes? I would definitely make it. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmberShahin"
},
"reviewBody": "Sadly, mine fell apart so I'm sure I did something wrong but I'm giving five stars because they still tasted amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMBA"
},
"reviewBody": "Nice recipe and a great way to use up instant mashed potato packs! I added some frozen corn and chopped white onion and green onion. I kept about 2 cups of cold water on hand and used as needed to keep the dough damp. Family loved them and the plate was half-emptied in the kitchen before ever getting to the table~ Next time I think I will try a sweet version with some cinimon, sugar and applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariah Hair Charles"
},
"reviewBody": "Very good! Such a perfect way to use the last bit of potato flakes. I served it with some leftover taco meat with beans and corn sort of like a Navajo taco. so yummy! Both the hubby and my 2 year old loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FiddleDeeDee"
},
"reviewBody": "Although these were very good and I will make them again, I did make a few changes to the recipe as written. I used equal parts water and potato flakes, as suggested by other reviewers, and let the mixture sit for 10 minutes or so until it reached a more manageable consistency. I added a couple cloves of minced garlic and doubled the chives. Finally I made six smaller, thinner cakes that I believe got crispier than larger, thicker ones would have. All in all a great base recipe that is easily adaptable to suit one's personal tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "K M"
},
"reviewBody": "The water ratio is too high. I ended up with a potato soup type combination. Luckily I had more potato flakes to add in.\n\nIf I were to remake this again I'd try, 1 tsp water then blend it to see how it's working with the other ingredients both wet and dry. Adding more if I need it however the 1 egg in the orginal recipe should be enough wetness.\n\nI also love texture so I may chop one quarter of an yellow onion in there too; I'll ensure its cut into decent pieces not finely minced. Cooking it prior with some oil. Then adding it to the bowl with the potato flakes.\n\nLight use of plain bread crumbs used for cooking may also help with the texture, I really want to imitate the feel of graded Potatoes while enjoying the convenience of the potato flakes.\n\nTo end on a positive the flavor was all there.. very good taste-wise"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leonta Andrew Suggs"
},
"reviewBody": "Even add sharp chedder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherrie"
},
"reviewBody": "Made this according to recipe only I added some onion and garlic powder omitted the spices stuff , was amazing ! I did fry in 2 tablespoons of oil and 2 tablespoons of butter, big mistake! That was my own doing , will definitely make again ( only with 1 tablespoon !)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "edesia"
},
"reviewBody": "Exceptional!!! It is not 4 servings for us (2 people) ... So double it. Leftover potato mixture should be covered in the fridge not air tight as it sweats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MombieZombieOne"
},
"reviewBody": "Had instant in the pantry so I tried these. Hated them. I'll stick to using leftover real potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Samantha J. Galloway"
},
"reviewBody": "These were horrible, flavorless, crispy sacks of potato goo. They sucked up all the oil and butter mixture in the pan which made them taste even worse. Ratios are really off..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela Craig"
},
"reviewBody": "I made this as is, omitting only the cayenne, and found it to be terribly runny and impossible to cook properly. I made a second batch, using 1 &amp;1/4 cup flakes, and a solid 1/2 cup shredded parm, and it was a huge difference. I omitted the salt in the 2nd batch owing to the addition of parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WotanMitUns"
},
"reviewBody": "I haven't made THIS exact recipe but I have done darn close at work with stuff we had laying around. My recommendations for using instant potatoes is they should be thick starting off because you mix in the egg which will make them a bit soggy. Also, it does not hurt to throw in some frozen hash browns. Not too much but the hash browns lend some structure and strength to the integrity of the pancake. Don't add too much cheese (I always add cheese) though cheese will help with the browning and outer crispiness. Personally, I prefer to deep fry these but at home I pan fry them. Toss in some bacon and chives too for good measure. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terze"
},
"reviewBody": "Incredible for being instant potatoes in a house where instant isn’t even a choice. Added my own seasonings. Basic recipe ratio is perfect, you just have to let it sit a minute and it will thicken right up, in fact I doubled it and added an extra egg. Had to make six times for six people! Couldn’t keep any on the table, as my picky little brother downed them as fast as I could get them off the grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teanut"
},
"reviewBody": "Fantastic. I used about 1 cup of potato flakes for these. Let the mixture rest as I prepared other components of my meal. I like them a little smaller as I find them more manageable in the pan so I divided it in six formed balls before popping them in the pan. In the past, I had always dusted each with flour first but it worked well without. They came out light and crispy. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "daims1979"
},
"reviewBody": "I added a little more flakes to help with the consistency also garlic powder I added also onion powder and parsley and black pepper. I mixed up in a bowl and put all mix in a sandwich bag and cut end and squeezed into pan . I call them potato pancakes swirls ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "*Space kase*"
},
"reviewBody": "Too salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mina Garrett-Scott"
},
"reviewBody": "I agree that the potato flake to water ratio was off. I actually probably added about another 1/2 of a cup of potato flakes. I made them thicker- the consistency of a \"potato ball\" so that I could shape the cakes with my hands into balls and drop them into the hot oiled pan to form perfect little circles. I also love onion flavor so I added about 1 tablespoon of dried minced onion along with black pepper and sea salt (same amount recommended by the recipe. They were a hit! I used them for Christmas brunch but I can see them being a nice savory addition to a dinner. I think they would be a great vehicle for crab salad or seafood salad on top. They were amazing and the family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "My boys said they tasted a little salty, so I don't know if that's because I thought it was dissolved and it wasn't, but other than that they ate every crumb! So that's a success to me!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erica Singer"
},
"reviewBody": "These were pretty good! I made some changes though. I left out the chives, reduced the water to 3/4 cup, added onion powder and garlic powder, and added 1/3 cup of shredded cheddar cheese. I also divided into 6 instead of 4, they were easier to flip that way. If they were any bigger I think they'd probably fall apart. This recipe is a good base to customize to how you want it. I might make them again, I have a big box of instant potatoes I'm trying to use up haha."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Howard"
},
"reviewBody": "I mean it's a great bass recipes to start with and tweak it to make it your own. I had to change some things around because of food allergies like no cayenne pepper that sends me into anaphylactic shock and I used almond milk instead of water I also used real butter instead of margarine and I had it some finely chopped fresh spinach in the mix,I also added a 1/2 tsp of Ginger. I took away the salt and used a pinch of oregano, Mrs.Dash and I made my mixture a little stiff after reading about the recipe being too watery and I made them about 12 coin size potato cakes instead of four big potato cakes \n and I grill them on my non-stick griddle but I used a little olive oil spray 2 try to make it a healthy recipe Since I'm a heart patient, on a low fat, low sodium, lactose free diet. They turned out great. I forgot to take a picture. My son and his friends ate through them very fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra Lyoubi"
},
"reviewBody": "This was super yummy and everyone loved it!! I didn't have any chives so I skipped those. I also avoided the cayenne pepper and used garlic power instead. After reading other reviews I used less milk. Since I tripled the recipe I used 2 1/2 cups and it came out perfect. I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Leary"
},
"reviewBody": "I used a full cup of potato flakes and these turned out amazing! I was surprised actually. I didn't feel like running to the store and needed a side dish to serve with my fish. Very good, would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deme"
},
"reviewBody": "These things are great. I added a little more flakes and less water. Made some eggs and had for brunch. Just great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saddle Tramp"
},
"reviewBody": "After reading the reviews I made a few simple changes. Per suggestions, I used the entire small package of Idohoan instant (= one cup) with the cold water. I prefer this brand to others. Some instants are gluey, so the brand of potatoes used will result in a different texture. I added dried chives to the egg/water mix because I didn't have fresh on hand. After they were flipped I topped with shredded sharp cheddar. NOTE: You have to let these sit for a few minutes to firm up. They look super runny at first, so don't freak out. Will definately be making these again. I also made the cakes smaller. Like some of the other reviewers, our favorite part of the cakes are the crispy edges. These were very good and super easy. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMCGEOCH"
},
"reviewBody": "When I was making this, my family was very interested. They like potato pancakes. I dislike all the work. They saw the potato flakes and were like yuck why bother it won't taste good. But they said and helped and watched. Finally after they were completed. They loved it. One daughter asked for this for her birthday dinner. I loved it. It took half the work of regular potato pancakes. Does it taste exactly the same? No but good enough to get some yays and wows."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHORECOOK"
},
"reviewBody": "DELICIOUS! I was looking for something new to make for breakfast when I came across this recipe. Knowing that Hubby always enjoyed potato pancakes at \"Perkins\" when we traveled, I thought I would give it a try. I followed the directions with the exception of sprinkling minced onion as I didn't have any chives available. This recipe was so delicious. I used the spatula to squish the pancakes flat and get that crispiness that everyone loves. For a topping I mixed raspberry and strawberry jams with a little light karo to make a yummy sweet syrup that was similar to \"Perkins\" twin berry syrup. Although this did not taste exactly like Perkins potato pancakes, it was different and that is what I set out looking for. Nice find! I knew Chef John would not let me down! Thanks Chef!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Martin"
},
"reviewBody": "Easy recipe. My son loved it. I have grown up on true homemade potato pancakes and these are very easy compared to that. I bit different texture but they taste great. I have also grown up on using left over mashed potatoes and frying them up in the same way, but if you don't have left overs use this! My favorite use for is left over roast beef, heated in left over gravy, all poured over mashed potato cakes. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marty Engelman"
},
"reviewBody": "Potato to water/liquid ratio is wrong. As it is results are a somewhat thick wall paper paste with green flecks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann-Marie Bill Grant"
},
"reviewBody": "This is so much like the Potato Pancakes that my elderly Dad loves so much. He likes his with sour cream and applesauce. Makes his eyes light up every time I make this for him. Thanks so much for sharing.\nI also used A 1 to 1 ratio of potato flakes to water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "holly"
},
"reviewBody": "Did use this recipe, but not a fan of potato flakes,I use potato beads, HUGE can from Walmart, already has butter, don't even have to add salt. Added a little garlic and grated onion. They were yummy, so much better than potato flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta Conniff"
},
"reviewBody": "I have tried this recipe twice and it turned out great! The water to flake ratio was too great, but just add more flakes. We love this easy and quick recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Redbird"
},
"reviewBody": "Amazingly easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abellebaker"
},
"reviewBody": "I just made it as written, and they were great! I had to let the mix sit so the potatoes could absorb the egg mixture. Added extra chives, and pepper! YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Psychedelicgoth"
},
"reviewBody": "Amazing, I've tried many recipes. This one is definitely the house favorite, my boyfriend won't eat any other version. These are also amazing fried again the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Clyde"
},
"reviewBody": "Ended up with a greasy clump of starch with very little flavor. I'll go back to my tried and true frozen hash browns with grated onion, flour and egg. Its just as easy and turns out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "George Schmidt"
},
"reviewBody": "Take the reviews of Nana, cookie &amp; sandyflint to heart. Then it's OK for camping or a greasy hangover brekky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookie"
},
"reviewBody": "Simple recipe for potato cakes. You have to let the water absorb into the potatoes first. Divide the mixture up, roll into small balls, then shape the pancakes with your hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cheryl Tenney"
},
"reviewBody": "Not very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rubyyy"
},
"reviewBody": "It was pretty good. I didn't have any chives on hand so I used thyme but it was still delicious. I did add more potato flakes because I felt it was a bit runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRDYUKON"
},
"reviewBody": "I used 1 cup of left over mashed potatoes in place of the water and flakes and the recipe worked great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "obxnut"
},
"reviewBody": "I did start with left over instant mashed potatoes, justed added a bit of flour to firm them up a little. They were really good, def better than plain old instant potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "papou"
},
"reviewBody": "thanks, my children them love.I add crushed garlic and sliced bacon . best recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gracecc5249"
},
"reviewBody": "I just made these for breakfast with asparagus. Was delicious. I just added more potato flakes to already mixed portion. Not a big deal. Different brands make thicker potatoes. I used the little babies off my scallions for the chives - same difference. Will make this a whole lot more. It was very easy and quite effortless. Thanks John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baking Nana"
},
"reviewBody": "These are fine for what they are.... Instant Potatoes. I would suggest making 8 small pancakes instead of 4 medium sized one. The crispy edges are what make them good - small ones would leave you with more crispiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacey Borkowski"
},
"reviewBody": "Delicious. I was trying to duplicate the recipe we had at a German Restaurant. This is pretty close. The ratio of water to potatoes is off though. Add more potatoes until it's a thick consistency. I added shredded cheddar cheese on top at the end and melted it in addition to adding sour cream. Yum! Kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sandyflinthill"
},
"reviewBody": "I wish someone else had tried these to see what changes had to be made. The ratio of water to flakes is too great. These were runny. The pan doesn't need to be so hot, my butter/oil mix burned. I would omit the salt and add some grated cheese to help bind it and for flavor. Also I added some minced, leftover potatos for texture. Would not recommend this as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLY33"
},
"reviewBody": "very good and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenEsther43018"
},
"reviewBody": "This looks soooo good and I hope to try it very soon!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220323/instant-potato-pancakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
"name": "Potato"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1545/side-dish/potatoes/potato-pancakes/",
"name": "Pancakes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220323/instant-potato-pancakes/",
"name": "Instant Potato Pancakes"
}
}
]
}
}
, "about": [
]
}
]