				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Irish Brown Bread"
,"datePublished": "2020-06-18T23:47:51.000-04:00"
,"dateModified": "2021-09-28T16:35:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Julie Taylor"
,"url": "https://www.allrecipes.com/cook/1103029"
}
]
,"description": "Try a different style Irish bread this Saint Patrick&#39;s Day by making this brown bread rather than the more commonly found soda bread."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gMgmaY46Jbyk-2V7OmpBPMtNdzY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7751099-1bdcad76c4f94ca68433fddc5af640c0.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Irish Brown Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "62"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "150 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "3 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "267 mg"
,"sugarContent": "5 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"2 tablespoons white sugar",
"1 teaspoon baking powder",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"1.5 tablespoons butter",
"2 cups whole wheat flour",
"0.25 cup quick-cooking oatmeal",
"1.5 cups nonfat plain yogurt",
"1 teaspoon milk, or more as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Lightly grease a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Mix all-purpose flour, sugar, baking powder, baking soda, and salt in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Cut butter into flour mixture with a pastry blender or 2 knives until the mixture forms fine crumbs."
} ,{
"@type": "HowToStep"
,"text": "Stir whole-wheat flour and quick-cooking oatmeal into the butter mixture."
} ,{
"@type": "HowToStep"
,"text": "Gently stir yogurt into the oatmeal mixture. If mixture is too dry to hold together, add 1 teaspoon milk at a time, just until dough holds together; it should not be sticky."
} ,{
"@type": "HowToStep"
,"text": "Turn the dough out onto a lightly floured work surface; knead gently about 5 times to form a ball."
} ,{
"@type": "HowToStep"
,"text": "Place the dough in the center of the prepared baking sheet; cut a large &#39;X&#39; in the top of the loaf."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven until well browned, about 40 minutes; transfer to a rack to cool. Bread can be served warm or cold."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martin Marin"
},
"reviewBody": "Loved it !!! I added 3 ingredients to improve it to my taste... a dash of Cinnamon, 1 Tbsp of Molasses, 2 Tbsp unsweetened Applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie DeMuth"
},
"reviewBody": "My man was born and raised in Ireland, only in the States a few years. I have been on a mission to find \"the perfect brown bread like back home.\" Have tried numerous recipes and this is the one! The ONLY change - BUTTERMILK instead of yogurt. According to him, buttermilk is a must. And it subs out equal to yogurt. Very pleased with this recipe. One tip if you do not like super crunchy bread - place a bowl of water in the oven while preheating and heating. This adds moisture to the bread. Have made 4 loaves in the past week to use up this buttermilk. Freezes very well!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "I really love this recipe. The crusty exterior and dense center is delightful. I have made it on 3 separate occasions. I modify the recipe to include 2 tablespoons molasses instead of white sugar to make it more authentic. Molasses really makes a difference (hence the 4 stars). I also need to bake it for 50 minutes instead of 40 in order to avoid raw dough in the center (I use my convection oven setting). As others have said, the bread turns out to be the closest thing to true Irish brown bread that you can make at home. We've been to Dublin and enjoyed brown bread every morning. My husband says this is exactly as he remembers it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "My family loved this bread. The flavor is divine with good texture. I used buttermilk instead of yogurt because I did not have enough on hand. I also melted 1T butter with a drizzle of molasses to brush over the top before baking. We did not, however, think it tasted like the brown bread we had in Ireland. That being said it was delicious in its' own right! Next time I will try using the yogurt and swap the sugar for molasses, like others have suggested, to achieve that dark Irish brown bread color and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beautiful"
},
"reviewBody": "Tastes great with molasses and sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asabo"
},
"reviewBody": "This is a wonderful, easy to make bread that is so close to the bread I fell in love with in Ireland. Made a loaf for my daughter’s friend from Ireland who is currently studying here. She also gave it high praise!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "It's a pretty difficult mixing in the yogurt, but the recipe turned out very yummy. I did use brown sugar instead of white sugar and I added about a 1/2 cup of walnut pieces. The next time I make it I plan to use all whole wheat flour and maybe more nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin M"
},
"reviewBody": "Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Costello"
},
"reviewBody": "I have made this bread 3 times now and my family loves it! I always have to add at least 5 teaspoons of milk and even though it says the dough should not be sticky, my dough is always very sticky. It still tastes great though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Magster64"
},
"reviewBody": "Make this every year for St Patty’s Day, everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JustAGirlinMA"
},
"reviewBody": "Used Kosher salt, added 2 teaspoons of 2% milk, and baked for 40 minutes in a loaf pan. Next time I'll use 1 teaspoon of milk, add molasses, and will cut the X thicker, the middle was a bit too moist (hence the extra baking time). Still delicious, hoping it gets the seal of approval from the Irish boyfriend (born and bred in Dublin)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tina O'Rourke Wiegman"
},
"reviewBody": "I will never make this again what a waste of time and ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HDizzle"
},
"reviewBody": "Delicious--very similar to the brown bread that we ate throughout Ireland. We subbed molasses for the sugar and used regular oats. It's now a staple in our house! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I am by no means a baker, so bread normally intimidates the heck out of me. However, I was cleaning my pantry and realized I had 3 containers of quick cook oats and needed to find some recipes to use them. When I searched recipes by that ingredient, this popped up. At first because the word \"bread\" was in it, I almost didn't even read the recipe. BUT I AM SO GLAD I DID! I made it, it was so easy and absolutely delicious! It is now a staple in the house and we made it again last night. Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathleenW"
},
"reviewBody": "This was wonderful!! Tasted just like the brown bread I had in Ireland.\nI did have to add quite a bit more milk than what was called for. Other than that followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "This is an excellent soda bread :-). I was looking for an Irish brown bread recipe but this is a soda bread. I’m use to making this with buttermilk instead of yogurt but still this is easy and delicious. Thank you :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Had no idea what to expect. It smelled good when it came out of the oven. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Harper"
},
"reviewBody": "Love this bread! Soft inside with a good crisp crust...very satisfying and easy to make! Excellent flavor, not overly wheaty and not bland with a slight sweetness. A fabulous dinner bread, I paired it with Shepherd’s Pie for dinner on a Wednesday night! Also wonderful on its own toasted and buttered! I will definitely make this again...soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Shelton Evans"
},
"reviewBody": "Not exactly like I had in Ireland but very good. This is a dense wheat bread. Great withsalted butter. I will get this in rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathyD"
},
"reviewBody": "This was so easy to mix together in the kitchen-aid bowl. I used frozen butter which shatters nicely to mix into the flour, and I substituted molasses for sugar. Yielded a satisfying loaf of bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gopher4117"
},
"reviewBody": "It's not quite the same as a bed and breakfast in Ireland, but is anything ever the same after going home? This is an easy recipe to make and is very good. It's darn close to what I enjoyed in Ireland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "allisonmignon"
},
"reviewBody": "My husband and I spent no our mini-moon traveling all across Ireland, staying at many b&amp;bs along the way. Each b&amp;b served the most amazing brown bread and I couldn't get enough of it!! I've been craving it ever since we left, and this recipe looked the easiest to do out of the ones I could find. Overall, the bread is good, but I don't find it to be exactly what we had in Ireland. I did make the changes others made and used molasses instead of sugar, however I think the bread might need a little more than the 2 tbs called for. Next time I make this I might do 1.5-2x the amount or add some brown sugar as well. I made mine in a loaf pan and it took about 45-50 minutes to bake through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Pearce"
},
"reviewBody": "Loved it. \n\nSpent a bunch of time in Ireland once upon a time and miss their wonderful bread dearly. This recipe didn't send me reeling with nostalgia, but is a classic, easy, delicious brown bread.\n\nI stayed true to the recipe, accidentally ended up with sticky dough (slightly too much added milk with 2nd tsp.) and added a Tbsp of white flour back in, which fixed it back to being not sticky. \n\nCooked exactly 40 min, came out perfectly crunchy on the outside and moist but dense on the inside. \n\nThanks for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "Not for me. Strong baking soda taste as I would expect in \"Irish Soda Bread\" which is why I chose this instead of a soda bread recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "Not for me. Strong baking soda taste as I would expect in \"Irish Soda Bread\" which is why I chose this instead of a soda bread recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mysti"
},
"reviewBody": "My go to recipe for a quick, hearty and delicious bread. Love it with stews n chillies and just to snack on. If you're like me and use greek yogurt, you will need 1/4-1/2 cup of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristincsw"
},
"reviewBody": "I didn't have enough yogurt on hand, so I sort of improvised using buttermilk. The results were still delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Roberts"
},
"reviewBody": "We've just returned from the UK and Ireland and fell in love with this bread. Had to try it. This is good! I'll try 1T brown sugar and 1T molasses next time... Needs sweetness. 40 min was perfect. The bread there was different everywhere... Our fave was a bit more coarse... Good start!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "This tastes just like the bread from Ireland! It took me back. Following the instructions, my bread was not fully baked at 40 minutes. I had to break it up into four pieces and bake for another 15-20 minutes for it not to be doughy on the inside. My only alterations were that I used Greek yogurt, brown sugar, and almond milk (I needed at least 2 tbsp). Next time I'll break up the dough into separate loaves to bake like others suggested. I highly recommend this recipe. Eat it with honey! You will not be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Pfeiffer"
},
"reviewBody": "Love this recipe! Perfect every time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "We recently returned from a vacation in Ireland and LOVED the Irish brown bread there. This is the best of the recipes I have found so far in my quest for this delicious bread.\n \nI modified the recipe minimally, using nonfat plain Greek yogurt and old fashioned oatmeal instead of regular yogurt and quick oats. I also used about a tablespoon or two of low fat buttermilk instead of regular milk to add a bit of extra liquid to help the dough come together. \n\nIn our oven it took 45 minutes to bake. I used a thermometer to check for doneness.\n\nThe loaf rose nicely and had the lovely rustic texture that we found in Irish brown bread on our vacation. \n\nNext time I make it I will try using molasses instead of white sugar to see if the change is worthwhile. \n\nThis is DEFINITELY a make again recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This tastes just like the Irish Brown bread we had in Ireland. SO good! I live in Western Canada where is is quite dry, and I used Greek yogurt which tends to be thicker so I had to add a total of 1/2 cup of milk to get the right consistency but I have made it at least 5 times and each time was great. I added the milk to the yogurt before adding to the flour mixture. That way it was easier to mix together. Almond milk works just as well as regular milk too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heatherm"
},
"reviewBody": "Because this is so fast and easy to make - and I usually have all the ingredients - this is my go-to weeknight bread. Great with beef stew!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon"
},
"reviewBody": "Made it as the recipe said every time. Every time I make it my wife and daughter ask for it again. This is a family favorite on a cold night with stew or chili. Then everyone eats it the next morning with breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Scott Rudolph"
},
"reviewBody": "First time making this. The recipe was easy enough to follow, but was not thrilled with the result. The bread seems to dry out very quickly, and is a bit bland for taste. I followed the recipe as is, however after reading some of the reviews may try it again with molasses instead of sugar to see if that livens it up any. I'm tempted to cut back on the oats if I made it again as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gerlegerle"
},
"reviewBody": "Delish! Used non-fat Greek yogurt...OMG the loaf will be gone before it cools!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quillgara"
},
"reviewBody": "This is the BEST recipe! I use more yogurt than the recipe calls for and the bread turns out do moist and delicious. My whole family and extended family love this bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elena"
},
"reviewBody": "Very heavy loaf. Hubby said it was very tasty and great the next day for toast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Landa Butler"
},
"reviewBody": "Excellent especially with honey butter. Just like the brown bread I loved while visiting Ireland!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "irishlass115"
},
"reviewBody": "Me and my.mother enjoyed brown bread in Ireland so for st. Patrick's day I wanted to make it to bring back memories. This taste EXACTLY like the bread in Ireland!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmo1070"
},
"reviewBody": "My family loved it! We have a small top oven so I cooked it at 350 for 40 minutes and it had the perfect crust and the inside was completely done. I did round loaves but cut a deep X in the top as others had suggested. I didn't need to add any milk either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FloridaMo"
},
"reviewBody": "Closest to true Irish Brown Bread that I've found yet, the oatmeal really makes it perfect. I used greek yogurt, and treacle (or molasses) instead of the white sugar for a little added depth of flavor. It took quite a bit more milk than called for to make a workable dough.\r\n\r\nIf you slash the top deeply it will create four distinct squares of bread, very handy for serving and slicing. If you don't slash it deeply it will need to cook longer, at least 5 minutes, or the center will still be gooey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karend"
},
"reviewBody": "Great recipe, just like the brown bread we had in Ireland. I have to admit, I did change the sugar to molasses. It just seemed more appropriate, more like what they would have used long ago. Treacle (molasses) is popular sweetener over there. I usually have to use several teaspoons of milk too, like the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gingerjedi"
},
"reviewBody": "This bread is delicious! It's dense without being dry or gummy. I used plain Greek yogurt instead of regular and it turned out wonderful. My only problems were the salt (not enough) and the baking time. I had taken the bread out after about forty minutes and cut it open to find that the center was still doughy. I put it back in for about ten minutes, wrapped in foil to prevent the crust from scorching, and it came out beautifully. I'm making it again today!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Hempstead"
},
"reviewBody": "I too enjoyed this bread. I used regular oats, and it worked fine. What was surprising to me is how long the bread stayed fresh with so little fat in it. Very healthy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RENEE32"
},
"reviewBody": "Love this bread! It is so easy to make and has wonderful flavor. I only had Greek yogurt, so I increased the milk to about 2 Tbs to adjust for the thicker consistency. The recipe said to use a baking sheet, but the bottom burned a little so I flipped the loaf over halfway through and will try a glass pan or baking stone next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "I loved the rugged texture of this bread. It makes really good toast with butter and honey. Next time I will make it in a loaf pan for ease of cutting. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "netzel"
},
"reviewBody": "I made the recipe as stated and it was not cooked all the way through. I read one reviewer who modified the recipe by dividing it into 3 mini loaves, next time I will try that. The flavor of the bread is great and would definately try to make this recipe again with some modifications in the loaf size or baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Lee K-Lee Conklin"
},
"reviewBody": "So amazing! I just returned from Ireland and I promised my fiance I would find a recipe for the amazing brown bread we ate there. This was it! Made it and its gone already! Thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kittycondo"
},
"reviewBody": "Thanks, Julaine, for this great recipe. I was looking to recreate a great meal we had at an Irish pub in Savannah. I made this brown bread as the recipe is written except, instead of shaping the dough into one round loaf, I divided it into thirds and baked it in 3 mini loaf pans (3 1/4 \" x 6\"). I baked the mini-loaves for 30 minutes at 400 degrees. The crumb of this delicious bread is dense and even, making for beautiful slices. I served it with the \"Best Cream of Potato Soup\" from this site and got raves from my husband."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JessIsBest"
},
"reviewBody": "Easy, Healthy, and Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dndsmom"
},
"reviewBody": "This recipie is fabulous. The ingredient list is perfect, I didn't change a thing. My two older neighbors (one German the other Irish) as well as my entire family really liked this quick hearty bread."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220525/irish-brown-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
"name": "Irish Soda Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220525/irish-brown-bread/",
"name": "Irish Brown Bread"
}
}
]
}
}
, "about": [
]
}
]