				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Irish Soda Bread with Caraway Seeds"
,"datePublished": "2000-03-18T08:56:10.000-05:00"
,"dateModified": "2022-07-01T14:08:33.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Penguin Lady"
,"url": "https://www.allrecipes.com/cook/40864"
}
]
,"description": "A delicious and easy recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/flg5yc56hEkuw_kBeRdT0R-b3MM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4485080-f2de61170f1742a69851a0dc71134b50.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Irish Soda Bread with Caraway Seeds"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "825"
}
,"cookTime": "PT65M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "511 kcal"
,"carbohydrateContent": "100 g"
,"cholesterolContent": "67 mg"
,"fiberContent": "3 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "543 mg"
,"sugarContent": "15 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.5 cup white sugar",
"4 cups all-purpose flour",
"2 teaspoons baking powder",
"1 teaspoon baking soda",
"0.75 teaspoon salt",
"3 cups raisins",
"1 tablespoon caraway seeds",
"2 eggs, lightly beaten",
"1.25 cups buttermilk",
"1 cup sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch round cast iron skillet or a 9 inch round baking or cake pan."
} ,{
"@type": "HowToStep"
,"text": "In a mixing bowl, combine flour (reserving 1 tablespoon), sugar, baking powder, baking soda, salt, raisins and caraway seeds. In a small bowl, blend eggs, buttermilk and sour cream. Stir the liquid mixture into flour mixture just until flour is moistened. Knead dough in bowl about 10 to 12 strokes. Dough will be sticky. Place the dough in the prepared skillet or pan and pat down. Cut a 4x3/4 inch deep slit in the top of the bread. Dust with reserved flour"
} ,{
"@type": "HowToStep"
,"text": "Bake in a preheated 350 degrees F (175 degrees C) oven for 65 to 75 minutes. Let cool and turn bread onto a wire rack."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer N"
},
"reviewBody": "I make several loaves of this soda bread every year for St. Patrick's Day. It's great with Irish butter. I like to lightly toast it too. I do reduce the raisins to 2 cups vs the 3 cups that the recipe calls for. It's a matter of personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Galella"
},
"reviewBody": "I use this recipe every year. I do not put in caraway seeds and I am allergic to egg so I replace the 2 eggs with combined 2t baking soda 2T vinegar. So good..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karamia78"
},
"reviewBody": "My first time making Irish Soda Bread and this recipe was just amazing. The only thing I did different was half regular and half golden raisins. The recipe was just perfect otherwise! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara O"
},
"reviewBody": "Wonderful and easy. Was so NOT DRY that I was surprised as Soda Bread has that reputation of dryness. I topped it with a Guiness Glaze and people absolutely loved it. Will make this bread again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "I made a half recipe in a 6-inch cast iron skillet for my husband and I for St. Patrick's Day. We have been enjoying this bread. There are a few things to note however. (1) Skip flouring the top of the bread. It just sits there and adds nothing to the flavor. I ended up blowing it off the top. (2) Choose either the caraway seeds for a more savory version or the raisins for a sweeter version. The two flavors compete with each other if used at the same time. Additionally, I would cut back on the number of raisins. I used one cup for a half recipe and they were still plentiful. (3) The directions mention that the dough will be sticky but mine was also very wet. I sprinkled in a little extra flour with not much change in wetness, so I stopped and forged on with the recipe. It does bake up nicely, so don't be worried if the dough seems overly wet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "Made pretty much like the recipe. Only minor change was when I ran out of raisins and used 1/4 raisins and 3/4 dried cranberries. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Gleason"
},
"reviewBody": "Have always baked 75 mins and still had “sticky” underdone center. Flavor is great but we usually end up toasting slices to improve. Anyone have suggestions to moderate?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Maggio"
},
"reviewBody": "Made this last night for an early St. Patrick’s Day dinner and I am so amazed how easy and delicious this bread was. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackwillo"
},
"reviewBody": "Excellent Soda Bread!! Soaked my raisins in whisky and made whisky butter to spread on top. WOW!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myra"
},
"reviewBody": "It could use more butter and salt, maybe because I had to sub in yogurt for the sour cream. I added extra carroway seeds, don't be shy with it. I used raisins and cranberry and plumped them in vodka and orange juice. Still could not taste the orange, so adding orange zest a good idea, don't worry, it won't overpower it. The overall texture and crust was great, I egg washed it and it came out golden brown. 350 degrees for 65 minutes worked well, as I divided it into 2 loaves in cast iron pan. Next time I'll try one skillet for a thicker loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim K"
},
"reviewBody": "Very tasty and simple to make. The caraway adds to the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wjbeale"
},
"reviewBody": "This is my go to quick bread. This is by far the best recipe out there! I substitute currants for raisins. Friends ask me to make this regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra Jean Reilly Miklowcic"
},
"reviewBody": "This was a real crowd pleaser! It was best served the next day and when you toast it.... delish! Pay attention when the recipe says dough will be sticky, it sure is! Make sure you put flour on your hands while handling the dough. I also cut the amount of raisins in half. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marinone"
},
"reviewBody": "It turned out well though I added caraway seed as my Grandmother always insisted on. I wasn’t sure of the amount so I fell a bit short. Next year..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "I had never eaten soda bread before, so I wasn't sure what to expect. I definitely liked this recipe, but when they say \"sticky dough,\" they mean STICKY DOUGH. I enjoyed putting this together and watching it progress in the oven. I was surprised at how heavy it is on raisins, but I don't think I'd change it. I liked it more than anyone else in my household, so I'm not sure if I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "connie_r"
},
"reviewBody": "I brought this recipe to work for St. Patty's day and everyone loved it. I didn't use caraway seeds and I only used about two cups of raisins. Just personal preference. I also added a powdered sugar glaze with almond and vanilla extract because I wanted it to be a little sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Berta"
},
"reviewBody": "Easy &amp; delicious! I used 2 cups of raisins &amp; it was just the right amount. Next time I’ll just sprinkle some flour on top. 1 tbsp of flour was too much. I will definitely make it again &amp; I won’t be waiting for St Patrick’s Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lora Wright"
},
"reviewBody": "This was the best recipe I have tried!! Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Ann Radlein"
},
"reviewBody": "This was so tasty!! I've never had soda bread before but I have a feeling that it wouldn't taste this good! I used 1/2 as many raisins and fennel instead of caraway since I didn't have any, otherwise followed recipe as written. For kneading in the bowl, used a spatula pulling dough from edge &amp; pushing it into the center. Puffed up amazingly, was done after 60 minutes. Couldn't stop eating it, hubby also! Shared with neighbor, also liked it. Tasted great for breakfast the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Conley"
},
"reviewBody": "I followed the recipe, except used 2% milk and vinegar to make Buttermilk. It was a sticky mixture and I thought it would not be what I hoped for. But, it turned out beautifully and had great flavor. It will become my St. Patrick’s Day Irish Soda bread recipe for years to come!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was the easiest version I've ever made. I reduced the raisins to 1/2 cup and since I like raisins but the kids don't, I put the sugar, caraway seeds, and raisins in my food processor to chop them up. They made flecks but not big squishy lumps that the kids don't like. Everyone loved it! I also used a stick of butter, melted, instead of the sour cream since we were out. My batter was wet and made rough peaks on the surface. I liked that, they browned while cooking and were crunchy and nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TCapri"
},
"reviewBody": "I halved the recipe because there is only two of us and used my small 6.25 inch cast iron pan. I reduced the baking time to 50 min (I started smelling it and kept checking until the toothpick came out clean). I made it last month and it was really good- it cooked for even less time last time; the dough was a little wetter this time. I think this is my go to recipe for Irish soda bread. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "I really liked this recipe. I made half of it and it was very good. Also, it is very fast and easy to make. My only recommendation is to bake it for 45 minutes and add baking time at intervals of 15 minutes if not yet done. It might brown by the 45 minute mark, so cover it with aluminum foil. Also , roughly, after the first 25 minutes, rotate the skillet for even baking. Since I made half of the recipe, you can use a smaller skillet of about 6\" in diameter. I could not give the \"x\" cut at the top as it was very sticky. As others suggested I used less raisins. I used about 1/2 cup. I did not use the caraway as they are not exactly my cup of tea. Will absolutely make it again loved the tender crumb and slight sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Keller"
},
"reviewBody": "I’d give it 5 stars, but something is off on the flour ratio. When all the ingredients are added it is a very soupy dough. Doesn’t hold it’s form. I don’t know how someone could cut a cross into that mix. Slowly added more flour until it was a more bread like consistency. Taste was it’s dead on. Love it. We didn’t add the caraway seeds though. Not a flavor our house enjoys. I’m going to make this again using this as a baseline for other ingredients, like cranberries or making a cinnamon raisin mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa"
},
"reviewBody": "It was a very easy recipe. It turned out GREAT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "akeim1"
},
"reviewBody": "I’ve made Irish soda bread many times and thought I’d try this recipe. Dough was really soupy, and I measured exactly. We enough that there was no way I could cut a slice in the top, it just filled in. Still in the oven &amp; will post the outcome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sacajoleah"
},
"reviewBody": "I followed this recipe with only 2 changes; 1) I subbed Bobs Red Mill Gluten Free 1 to 1 Baking Flour for the all purpose flour and I left out the raisins because we don’t like raisins. Seriously the best soda bread I’ve ever had, gluten free or otherwise. Oh I also rolled them into little buns and baked them for 30 min-ish instead of a 65 loaf. So cute and tasty!thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cobalt123"
},
"reviewBody": "Made it just like the recipe and used a glass bowl casserole, buttered. Makes a giant loaf like an enormous muffin. Everyone loved it and was the first time any of my friends had it. Definitely let it cool 10 minutes and loosen it from the pan before cooling on a rack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MegP"
},
"reviewBody": "Wow! My first time both making and eating soda bread and this was delicious. I only had one and a half cups of raisins on hand, but next time will use two cups. I baked in a deep 9 inch pie dish for 65 minutes and it turned out perfectly. The only issue I had was that my cross in the center filled in while cooking, but it looked and tasted great . I will be making this a lot. Thanks for the recipe Penguin Lady."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brookside Bistro"
},
"reviewBody": "Amazing! Cooked in cast iron skillet &amp; served with apple butter and honey butter. Nice accent to bratwurst &amp; sauerkraut. Totally enjoyable with any meal!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDP4445"
},
"reviewBody": "This was the first time I have ever made Irish Soda Bread... It was a HUGE Success!!!! Super easy, super tasty!!!! My 4 year old gave it a thumbs up and asked for another slice!!!! The only change I made was 1 cup each: Regular Raisins, Golden Raisins &amp; Craisins. This will be my first and only Irish Soda Bread recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina"
},
"reviewBody": "Perfect as is. I used one cup black raisins, one cup golden raisins, and one cup craisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Angevine"
},
"reviewBody": "simply the best recipe I've found."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita L"
},
"reviewBody": "It's delicious! light and fluffy and full of raisins!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Kennedy"
},
"reviewBody": "Just as previous review I added apricots and currants. Bread is moist and delicious. I have made this in my cast iron skillet and lined with parchment paper. My bread only took 55mins to bake. Looking forward to a cup of tea and a slice smeared with butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TwinMomma"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MNWildRose"
},
"reviewBody": "Delicious and so easy to make. I used 1 cup of raisins -- that was plenty. Used skim milk plus white vinegar for the buttermilk. Didn't have any sour cream so I used an equal amount of plain Greek yogurt. This bread is delicious when sliced thin and toasted. It has a great texture. This will definitely be a bread that I make often. Next time, I'll probably add a little less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suz9091"
},
"reviewBody": "Delicious bread! I used yellow raisins and dried cherries which added even more to the flavor. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mona Hoban"
},
"reviewBody": "Love it! I think I'll adjust next time to cut the calories back though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "paula francoeur"
},
"reviewBody": "I like the bread it had good flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAKE"
},
"reviewBody": "Loved the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Heitmeyer"
},
"reviewBody": "Delicious. I thought 3 cups of raisins was to much so I used about 2/3 cup and was very happy with this bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shara Bailey"
},
"reviewBody": "DO NOT ADD Caraway seeds unless you LOVE Fennel!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ernesto"
},
"reviewBody": "Best soda bread recipe I've found; going forward, it will become my \"go to.\" Used raisins only because I couldn't find currants, but cut qty to two cups instead of three: did not include caraway seeds, but may try in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosema"
},
"reviewBody": "Used this recipe today and it was delicious and a big hit at my St Paddy's day dinner with my family and friends. Received a lot of compliments and some said it was the best Irish Soda Bread they had ever eaten. This was the second time I ever made this kind of bread and will definitely be making it a lot now that I found this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Rippe Moore"
},
"reviewBody": "Very yummy. The only thing I did differently was omit the raisins. My family isn’t keen on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonc"
},
"reviewBody": "Delicious! I did cut the raisins to 2cups, otherwise it is perfect!! So moist, the best Irish soda bread I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Nugent"
},
"reviewBody": "I'm so full and I can't stop eating it!! I made it exactly as the recipe said. Be careful, this is addicting. Toast in toaster oven and slather with Kerry Gold = giving me life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DKlicious"
},
"reviewBody": "Third loaf this week. Recipe is awesome. Family and friends love it. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dennis Murphy"
},
"reviewBody": "Honorable! I substituted flour for corn starch and instead of raisins I used can tomatoes. Try another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "john_r"
},
"reviewBody": "My wife didn’t like Irish soda bread, but told me this was the best bread that she’s ever had. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Marie Beyer"
},
"reviewBody": "I used 3/4 rice flor 1/4 whole wheat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy"
},
"reviewBody": "WOW! Didn't expect it to be soooo good! just now eating it warm with butter! Made it exactly according to recipe, minus a few raisins. For kneading, just kept folding it in the mixing bowl with the rubber spatula, then plopped it into my cast iron pan greased with crisco. keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "I enjoyed reading many of the wonderful reviews for this bread and decided to try it. The texture and flavor are very good. Another time, I'd try to go for a taller bread, not spreading it out so much in the 9\" pan. I used half regular and half golden raisins and skipped the caraway seeds as I don't care for them. I usually don't go by the time to bake listed in the recipe because ovens are different. That was a good hunch, as I checked it close to 55 min, and it was done and could have even been taken out sooner. Very good...had some with a little butter and will be good for breakfast with a cup of coffee. Happy St Patrick's Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chelsea s"
},
"reviewBody": "Loved it! I decreased raisins to 1 cup and cooked in conversation oven for 45min at 325."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3 C's"
},
"reviewBody": "Best I've ever had. My wife (Irish) agrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita McKinnon"
},
"reviewBody": "As the daughter of an Irish immigrant I’ve had plenty of DRY Irish Bread growing up. This is the very best I’ve had. I added a tsp. of nutmeg to the dry ingredients and 1 1/2 tsp. Vanilla to the wet ingredients. Maybe not authentic but who cares. It’s delicious. My friends call it Heavenly Bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sammie Preble"
},
"reviewBody": "Very good!!! I made it exactly like the recipe and baked in a iron cast skillet. I did add a tablespoon of orange peel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Debbie Sharpell Watson"
},
"reviewBody": "I followed the recipe exactly except used 2 C raisins, buttermilk substitute and no caraway seeds. Dough was very wet so had to add about 1/4 C more flour. It wasn't as dense as other soda breads I've had and not very flavorful. I'm not sure what happened but was disappointed. Will buy it from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cseib"
},
"reviewBody": "This bread is awesome! I did not use the caraway, used 2c of raisins and I brushed the top with buttermilk and sprinkled the top with turbinado sugar. Yummy! Makes great toast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunky"
},
"reviewBody": "Followed the recipe to a tee. Turned out excellent! ! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Vanslooten"
},
"reviewBody": "delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Acuwriter"
},
"reviewBody": "Made it for an international dining event. It came out perfectly and everyone raved about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kidrn911"
},
"reviewBody": "This recipe is delicious! I used golden raisins and also added slivered almonds and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geipa"
},
"reviewBody": "i thought this bread was excellent. Used only 2 cups raisins and left out caraway seeds. Also did not dust with flour and it browned nicely. Will make this again. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ymca13"
},
"reviewBody": "Amazingly moist scrumptious recipe. Great with chocolate chips instead of raisins and caraway seeds for something different!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beefyboy08"
},
"reviewBody": "Perfect and simple. I make it the way my mom did with golden raisins and 1/2 cup SLIVERED almonds. Great with butter any time of day. Easily made without a blender. I use a spoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick M. Doyle"
},
"reviewBody": "Very tender and did not fall apart when cutting or buttering each slice. Will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maxine"
},
"reviewBody": "Delicious, I substituted organic Einkorn flour for the white flour, as my family has wheat sensitivity and only used 1 cup of raisins. Was very easy recipe and a keeper. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne W"
},
"reviewBody": "Made for St. Patrick's Day Party - it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Battin"
},
"reviewBody": "I made this for a St Patrick’s Day dinner party with our neighbors and it turned out perfect! The only changes I made were scaling the raisins down to 1 cup and then soaking them in whiskey overnight before draining and adding to the dough the next morning. The whiskey helped plumped up the raisins and resulted in a nicely moist finished product! I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Gonzalez"
},
"reviewBody": "Absolutely a keeper. My family loved it. The only thing that I changed and was by accident was I used 2 cups of raisins instead of 3 because that was all I had. Family agreed that 3 cups might be a tad too much. The dough is super sticky and hard to make the X on top. Baked mine half way through and added the X. Hope this helps someone. Will be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefSonny"
},
"reviewBody": "Easy to make, and the whole family loved it. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Vergalla"
},
"reviewBody": "You asked, so yes, I did make a change. I didn't have buttermilk so I added extra sour cream and Greek Yogurt and 1/4 cup milk to make the exact amount of liquid the recipe required. It turned out delicious and I will make it over and over. Buttermilk is now on my shopping list! I will substitute one of my yeast Easter breads for this because it was so simple and simply delicious! Hubby loved it, and that's important! We love the taste of caraway seed, and it was just enough. Also, it made delicious toast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lionspaw32"
},
"reviewBody": "Had to add a little more flour but it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURELJ"
},
"reviewBody": "DELISH! So easy too! I cut the recipe in half &amp; subbed milk/vinegar for buttermilk. Actual baking time was 45 min. for the half batch. My 6\" cast iron skillet was a wee bit too small, so it poofed up like a soufflé but sliced easily &amp; tasted wonderful, especially with butter. Great addition to our St. Patrick's day dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianeF"
},
"reviewBody": "It was my first attempt making Irish Soda Bread and we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "audlyn"
},
"reviewBody": "I made two different recipies last night for a St Patrick’s day church brunch, this one and the “Amazingly Easy” one here on AR. I found them both easy to prepare with little difference in preparation and taste was similar (I added caraway seeds and raisins to the AE loaf). However, this one was more moist and won the competition in my opinion, because of the higher amount of buttermilk and the sour cream. I used half light sour cream and will do all light next time. The AE recipe had a better crust because of basting with buttermilk/butter and I would do that with this one next time. Caraway seeds add a disctinctively Irish taste to soda bread, and even though aren’t a favourite of mine, are necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Wiley"
},
"reviewBody": "I've never made irish soda bread before, so I don't know how it is \"supposed to\" turn out, but this recipe is SO GOOD!!! I'll definately be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane C"
},
"reviewBody": "I was looking for a new recipe for soda bread and came across this on my Alexa...it had many good ratings and so I gave it a try. It was so easy and delicious that this is my new go to recipe for soda bread!! In fact, I had requests for this recipe already! I did use the cast iron skillet and it came out great! I did not put caraway seeds in it because some people cannot tolerate seeds and I used half golden and half regular raisins. Don't skimp on the raisins! I even toasted some the next morning and it was soooo good!! Great recipe!! Give it a try! p.s....yes, it will be sticky...I made this in my Kitchen Aid mixer...only mixed to incorporate then used a spatula and did by hand.....do not overmix! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ES LINDEN"
},
"reviewBody": "I added currants and golden raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yeyette"
},
"reviewBody": "I used more caraway ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "baking_lady"
},
"reviewBody": "This was demolished even by the raisin haters. Used 1 cup raisins, skipped caraway, used vinegar/milk for buttermilk. It was done in 50 min. It is VERY sticky but does turn out so just trust it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMc"
},
"reviewBody": "Awesome !!!! , recipe , used raisins and dried cranberries, doubled the recipe and banked ina large square pan, baked about 50 min \nI am going to try with different dried fruits next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lesley"
},
"reviewBody": "I made this bread several years ago to take to a party hosted by a REAL cook and his (chef) son. They were so delighted with this bread that now, they insist I bring it every year. Since IANAC\n(I Am Not A Cook) I changed nothing. It is perfect every time. And yes. I'm taking it again this year. In fact, I bake two loaves for all the soda bread lovers who will be there and expect to have it again every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelsterkilter"
},
"reviewBody": "Ive made 8 different soda bread recipes from this page, and this is hands-down, the best. It has the perfect consistency and texture, its a teeeeeeny bit sweet and my family loves it. I’m sticking with this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowflake"
},
"reviewBody": "Amazing recipe. I made a few adjustments: 4 1/2 cups of flour. plus a little for dusting. Added an additional tablespoon sour cream. If using caraway seeds I used 2 tbs. It only took 60 minutes. Thank you for sharing this is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "Superb!!! Couldn't stomach the thought of the caraway seeds so I left them out. I also didn't have buttermilk so I used the milk with lemon juice alternative. Big hit with friends and family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taylor_1995"
},
"reviewBody": "I omitted the caraway seeds and mixed all ingredients in a bowl. I lined a 9 inch round pan with parchment on bottom and around the side. Instead of flour on top I brushed with egg. Still the best soda bread I’ve ever made. I make this recipe every year!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patdjohns79"
},
"reviewBody": "Great recipe, I get so many compliments when I make it. Always a hit on St. Paddy’s!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aunt Libby"
},
"reviewBody": "I had never made soda bread before, but I will continue to make it for years to come! delicious!\nThanks so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patoli"
},
"reviewBody": "Great loved it had all the ingredients my mother had in hers? Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heatherpuckett"
},
"reviewBody": "So savory, so enticing. We toasted the leftovers for breakfast the next morning. Didn’t change a thing, will absolutely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonofhaig"
},
"reviewBody": "I made this recipe twice! Both times they came out excellent! The only thing I changed was add a teaspoon of pure vanilla extract to the second batch. This bread is amazing, toasted with creamy Irish butter melted into it. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jankathryn"
},
"reviewBody": "That was the best Irish Soda bread I’ve ever had. Moist wit a sweeter taste. The only thing I did different was used golden raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "it came out great and yes I will be making again family loved it. I did have to use plain Greek yogurt thinned out with milk instead of buttermilk (didn't have any and to lazy to make some with milk and lemon juice)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Woods"
},
"reviewBody": "This was delicious! I took a suggestion from a previous reviewer and added apricot as well as raisins (since apricot is my fave). The caraway seeds were amazing for flavor paired with the sweetness of the fruit. This was a big hit with the family. The amount it makes is large, so I was able to eat it with my immediate family for a big Irish breakfast and still cut it into sections and give to my father and brother later in the day. To quote my father, “addictive...I can’t stop eating it.”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cherylR"
},
"reviewBody": "Delicious and easy. I doubled the recipe and cooked two cast iron skillets at the same time in the oven. Perfect. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Allen"
},
"reviewBody": "This was really good, would it be sacrilege if I put in cinnamon? I would absolutely make this again. Its fantastic toasted with lots of butter. It was more like batter than dough so I did have to add some more flour. update, made it in the kitchenaide, threw in some cinnamon, didn't have enough sour cream, still excellent, even the better the next toasted with butter and jam"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18456/irish-soda-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
"name": "Irish Soda Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18456/irish-soda-bread/",
"name": "Irish Soda Bread with Caraway Seeds"
}
}
]
}
}
, "about": [
]
}
]