				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Irish Soda Farls"
,"datePublished": "2018-06-08T09:29:09.000-04:00"
,"dateModified": "2023-01-24T08:07:59.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Ita"
,"url": "https://www.allrecipes.com/cook/1760109"
}
]
,"description": "Farl is the Gaelic name for 4 parts; these soda farls are made on a dry griddle for a quick and easy way to make fresh bread for unexpected guests."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/e2Np0YZ1H2hb5T9tGl-HZggc5nA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9776-b2b2ab428a58453cbc62be2a9ca82e36.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Irish Soda Farls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "107"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "252 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "3 mg"
,"fiberContent": "2 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "671 mg"
,"sugarContent": "3 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.5 teaspoon salt",
"1 teaspoon baking soda",
"1 cup buttermilk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat a heavy based flat griddle or skillet on medium to low heat."
} ,{
"@type": "HowToStep"
,"text": "Place flour and salt in a bowl and sift in baking soda; make a well in the center, and pour in the buttermilk."
} ,{
"@type": "HowToStep"
,"text": "Work quickly to mix into a wet dough; knead very lightly on a well floured surface. Form into a flattened circle, about 1/2 inch thick and cut into quarters with a floured knife."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle a little flour over the base of the hot pan and cook the farls for 6 to 8 minutes on each side or until golden brown."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlie Lynagh"
},
"reviewBody": "Such a simple recipe!! Really missing, Belfast, and made these this morning and they taste just like home. Thanks for sharing. So quick &amp; easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StevieP"
},
"reviewBody": "Just like home. Pre-heated the cast iron. Not too hot. I doubled the cooking time to get a nice hollow knock on the crust. Low (below simmer) and slow. Kneading it knocks the air out so a quick mix and 5 seconds to get it into shape. Into the dusted pan, and a soft pat with a dusted hand to get it to an inch thick. Don't cover, you want the moisture out. Authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veggiebrit"
},
"reviewBody": "Yes, it really is that easy. I used 2% milk with vinegar as a DIY buttermilk, and I needed to add a bit more AP flour to get a dough that wasn't too sticky, but that was the only change. I don't have a griddle/skillet so used a dutch oven. I was skeptical, but look, it worked! Only one burnt bottom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A T"
},
"reviewBody": "Brilliantly authentic, no changes needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura B"
},
"reviewBody": "These were great! Easy to make and they're delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Knapp"
},
"reviewBody": "Never been overly fond of Irish Soda Bread, but saw this and decided to give it a try, especially when I saw it could be made so quickly and easily and with so few ingredients. \n\nThey were fantastic! I will definitely be making these again and I'm so glad I tried them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "logans gram"
},
"reviewBody": "I didn't have buttermilk but used half sour cream, a teaspoon of vinegar and the rest milk because I just never like \"homemade\" buttermilk. It worked well. Very easy. I was a little leery of \"frying\" on flour but it worked! Definitely would make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Weir"
},
"reviewBody": "I’m from Canada and was visiting my friends from Ireland who now live in Houston, Texas. They were saying that the comfort food they miss the most was Soda farls. They had never made them. So I found this recipe and made it for them. Huge hit. It is a VERY wet dough. I ended up with them a little thicker so cooked them a little longer. But they were done in the middle. Medium low was too cool but that’s likely stove specific. I cooked on medium."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy D"
},
"reviewBody": "Very easy to make! Very authentic taste. Reminded me of being in Ireland! Even impressed my family with them (they are all Canadian). They all loved it and I loved sharing some Irish food with them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Casellas"
},
"reviewBody": "Didn't have much faith in my ability to pull this one off...but it worked! The bread turned out well and enjoyed it with Irish butter and red pepper jelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna Pielsticker"
},
"reviewBody": "I've been looking for a recipe for these for quite sometime and now have found the best one so far. This is a keeper! It was very light, well browned outside and very soft inside. I didn't change a thing except the cooking time. I just waited until it sounded hollow and the skewer came out clean. I also used the 'Harning' method, which is setting them up on edge on the pan leaning against each other so that the edges get finished off. I used buttermilk. These were exactly like my mum used to make. She was from Northern Ireland, most of the family is either Irish or Scottish so I grew with this stuff. They will go perfect with my Ulster Fry's. I will be passing this one onto my family for future generations to keep!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "April Morris"
},
"reviewBody": "This was super sticky and could not be kneaded without it sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msbork"
},
"reviewBody": "This is the easiest bread recipe I've ever tried, and it was so good--kind of like a cross between a biscuit and an English muffin. The only modification I made was substituting soured milk for the buttermilk. (Combine 1 cup milk with 1 T lemon juice, and allow to sit at least 5 minutes.) I cooked on an electric griddle set to 300 degrees. This will probably become a regular in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adjohnson12374"
},
"reviewBody": "Simple but very tasty... and filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renuka"
},
"reviewBody": "Always wanted to make soda bread. I am a decent enough bread maker but had none for tonight's soup. As I needed it quickly and had to satisfy a craving I luckily found this. This is absolutely wondrous. Only thing I would not do is the flour in the pan. Though when it turns brown (like chocolate) it does give a quaint touch and a slightly smoky edge to the bread making it particularly quaint (if i may say so) and rustic. What magic.\n\nAlso if I may add, I've been doing some research about the Irish famine so eating this and making it gave me a sense of connection to Irish food; and made me wonder how over time this bread would have been eaten through occupations and strife.\n\nNot sure how far back in time farls go. Any one know the history of this bread. One of these days I'll make it with potatoes. And what a beautiful word. Farls.\n\nThank you and bless you. And may the Irish never run out of food. \n\nRenuka"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Gallagher"
},
"reviewBody": "I made these exactly as written, and they were great. Served hot off the griddle with Irish butter and strawberry jam .... YUM. Yes, they're plain, but they're supposed to be - Irish farmhouse fare. The taste was like a buttermilk biscuit with a chewier \"crust.\" I cooked them on a cast iron griddle, which I heated slowly until it was nice and hot. Very, very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tickleyears"
},
"reviewBody": "I made these in my Andrew James halogen oven and they came out beautifully. Really light and fluffy inside with a good crust. I cooked them on the high rack on the grill setting (250C) for 10 minutes. Blooming delicious and easy breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RUBY2"
},
"reviewBody": "I've made these twice, the 2nd time cut in 2 TBSP of butter as suggested by another reviewer, which made these similar to other soda bread recipes I've tried. I liked them better w/ the butter although My family was just as happy with either version. Knead 6 or 7 turns and handle as little as possible (with floured hands) afterwards, adjust burner temp as needed while cooking. I will add a wee bit more salt from now on and would like to try a bit of wholegrain flour. Great with butter and marmalade1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pholkchick"
},
"reviewBody": "I love to make this for breakfast. I love to eat it best with violet syrup. and if there's no more of that, than I like honey &amp; butter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Super easy recipe! Just like my grandmother used to make!\nThank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rblueeyes"
},
"reviewBody": "These were a good, easy biscuit that was delicious with butter. My family asked for seconds, and they are so quick to make, it was easy to make more. I forgot to flour my hands the first time I made these. It is essential to do so, as these aware very sticky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "o1_diamond"
},
"reviewBody": "This was fantastic I even veganized it and used almond milk and a little vinegar worked perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "james"
},
"reviewBody": "tip for those that don't know. when they cooked wrap them in a damp cloth. this will keep it soft"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REALCOOKIE"
},
"reviewBody": "Yum! Served these tonight and my 12yo son gave me a high five! All four kids liked them, the Mama too. I followed one suggestion and added 2 T butter cut into the flour mixture. I did this in my food processor and used soured milk instead of buttermilk. Cooked on my electric non-stick griddle and they cooked through quite nicely. Interested to see how they are next day. Thanks for a tasty recipe! We'll have it year-round!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry M"
},
"reviewBody": "Same recipe as my mother's from Belfast who was also named Ita. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "auburn"
},
"reviewBody": "Having recently discovered I can't have wheat or yeast, I have been searching for a bread replacement... THIS IS IT. Perfect! I substitute the flour for gluten free self raising flour, and it is just the best! \nI've tweaked it by adding herbs, and spices, making indian style naans, and garlic bread, rosemary \"foccacia\" and cinnamon bagels too.... Thank you, this is a lifesaver of a recipe!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Booksie B"
},
"reviewBody": "these were delicious! great with jam and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Litegal1"
},
"reviewBody": "THIS WAS JUST SO COOL !!! Talk about easy - and with wonderful taste anbd texture to boot! My meatloaf was taking a little longer than usual and, as I didn't have a bread to go along with dinner, I though what the heck - I'll kill a couple of minutes and whip this up. Made exactly as directed (except having to use the milk/vinegar thing instead of buttermilk) cooking in a heavy cast iron skillet for 6\" on each side. Puffed up beautifully, completely cooked thru and thru. As suggested, we simply split and covered with butter and jam. Tastes like a cross between a biscuit, an engligh muffin, and a pancake. Will definately go on menu rotation. Thanks so much for recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyKay"
},
"reviewBody": "Awesome biscuit-like patties good with butter and jam or just plain. I added some whole wheat flour for added nutrition and to make the dough firmer. Add enough to make dough easy to form into biscuit patties and cook on dry griddle over low heat so they do not burn before cooking through. Cover pan after turning to help them cook evenly. Quick and simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEEKLET"
},
"reviewBody": "These are so hearty and wonderful and best of all easy to make. You can eat them with anything, or just by themselves. I subbed a half cup of whole wheat flour for regular flour when I made them just to add a little texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boobaby"
},
"reviewBody": "My hubby is from Belfast and he's been saying for years we should make our own soda farls. Well we finally decided to and we found this recipe and man o man were they good. We make them all the time and can't believe we didn't do it sooner. Ita's recipe is so easy and so delicious. Thank you. Now if only we could find a recipe for Christmas dumpling we'd be set lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meggan Futey Pasqualla"
},
"reviewBody": "Simple. Delicious! I made mine vegan by putting 1 TBSP of cider vinegar in a cup and filling it to the 1 cup mark with plain soy milk. My son has a dairy allergy AND I didn't have buttermilk in the house anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katelovesbaking"
},
"reviewBody": "This recipe is really, really, awesome! It is my go-to recipe when I don't want to bake something in the oven and yet I still want some nice soft, fluffy bread for breakfast or brunch. It is so quick to make this, so there's no waiting on yeast to rise! I don't really have many tips to add except that I have gotten in the habit of adding 1 cup all purpose white flour and 1 cup whole wheat flour instead of just 2 cups of white flour. That way the recipe is still good and has a nice texture, but is a bit healthier to eat. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sadiqah"
},
"reviewBody": "Very easy and very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paddy"
},
"reviewBody": "It's been 40 years since I moved to Canada and this is the closest I have come to the real things. Humadity is a big problem here so I find boiling a stew and adding a wee pinch of baking powder to the mix made them just like Mortons Bakery"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "As far as farls go, this was a good one. JK, I have never had or made Soda Bread and this was really good. Bread is a little overwhelming to me but this wasn't. I took the advise of another reviewer and I crumbled two tbls of butter into the dry mixture then added the milk/lemon juice (I didn't have any butter milk). The only issue that I had was it looked like it wasnt going to finish in the center so I put a lid over it for a few minutes. We ate it with butter and honey, it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wct38"
},
"reviewBody": "I tried this recipe this morning. It worked! I mean bread in a skillet? I was wary. But the bread/farls turned out well. I halved the recipe and made 2 batches. First, I made as per recipe. Tasted unexciting and plain. In the second batch, I added 1/2 cup of toasted mixed cereals (with fruits, nuts &amp; rolled oats) in place of 1/4 cup flour. I also added 2 tbp of butter and 1/4 tsp of soda. The farls still turned out soft and just like scones. I didn't bother to knead. Like a reviewer advised, I mixed it longer then hand shaped into flattened patty and placed on a clay pot. I didn't have a heavy skillet. It took about 4 mins a side. So quick and nutritious with the buttermilk and extra cereals. All in I had the farls on the table under 20 mins. A nice change from store bought bread or pancakes. I'm going to experiment with other ingredients like cheese, herbs and garlic powder! Maybe even choc chips. I'm so glad I found this recipe!! Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "edgyvegggie"
},
"reviewBody": "I'm pretty sure I just didn't do this right, but nothing about my farls was good. They were tough, bland, and felt globby in my mouth. I think I'll ask real Irish to make these in the future, as I just cannot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "totorothealmighty"
},
"reviewBody": "Wow!! This was so easy and delicious! Made these for my husband along with the Boxty recipe on this site and bacon and eggs for a St. Patty's day breakfast. I did add one tablespoon sugar because he has a sweet tooth. Cooked them in a cast iron skillet and left a lid on them after they were cooked to keep them warm. Perfect! A must try for anyone who wants a quick and perfect bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbeth"
},
"reviewBody": "Sooo Good and easy!!! I made this for breakfast on St. Patty's day, my husband loved them. I did add a pinch of salt. I am always nervous about cooking on anything ungreased, but these came out perfect! They almost tasted a bit like soda crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sara_meghan"
},
"reviewBody": "Made these for my kids for breakfast for St. Patrick's Day. Tasted just like the ones my grandma makes and she was born and raised in Ireland! Will be making these again!! I didn't have buttermilk on hand, so I substituted with 1 cup of whole milk with 1 tsp of vinegar in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KT"
},
"reviewBody": "A bit bland on its own, though to be fair I had to use a buttermilk substitute (milk+vinegar) rather than buttermilk itself. Maybe try adding some sugar into the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "midumont"
},
"reviewBody": "This is really good, really easy! I added a 1/4t salt and 2T oil. They turned out very soft and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HappyWarmCookie"
},
"reviewBody": "It needs salt, but you can always sprinkle that on after. It's taste is pretty decent, but I'm giving it 5 instead of 4 stars for convenience - it takes almost not time to make and is very easy! Wonderful to have a bread recipe for the stove top you can whip up last minute while your entree is in the oven! P.S. I kneaded the dough on a never-used rollable cutting board (this way you know it's clean, whereas my counter I never feel I can really get clean enough), and it makes cleanup after very easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChefScharny"
},
"reviewBody": "I had never had a Soda Farl before so I tried these. They tasted good but reminded me of a really heavy pancake. It was fun to try them though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Brianna Bell"
},
"reviewBody": "I tried making it once and it didn't come out right, so I tried again thinking I must have done something wrong. The batter was so thin, it was like pancake batter. How are you supposed to knead that?!?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bad robot"
},
"reviewBody": "Excellent !!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "These are really good. I have made english muffins before and they require a lot more time because of the yeast. This is an easier breakfast bread to make in the morning. I've seen other farl recipes that cook much longer. Maybe mine were too thick but it definitely needed longer than the 6 to 8 minutes per side. I was too impatient to wait the full 20 per side that I saw on another recipe but I did do 15. I do think next time I will plan for the full 20 because they were a tad doughy in spots. I used an electric skillet at 300 and it was the perfect temp... nice and brown but not burned. My whole family enjoyed them and now want me to add things like raisins so I will definitely be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "Just wonderful. I used skimmed milk with vinegar instead of buttermilk, 1 tsp salt &amp; 1 1/2 tsp sugar. They came out perfectly. I make scones at the drop of a hat and these were darned near as good and so much faster. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mopsical"
},
"reviewBody": "Great, simple recipe! If scones and Irish soda bread had a baby, this would be it. ;) I've made this a couple of times in the past week, and each time it gets better! It's really forgiving and easy to change up. I like to make them with about 2/3 C of raisins or chocolate chips. They're also good made with whole wheat flour. My only complaint is that the dough is VERY sticky. I find that adding a little whole wheat flour to the dough helps. On the whole, delicious; my family loves this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HHaWho"
},
"reviewBody": "Easy to make. My wife loves it! Great in place of biscuits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natesdad"
},
"reviewBody": "My family visited Ulster for a month when I was in high school. We would buy these from a bakery in the village where we stayed. Haven't had them since. This recipe is exactly how I remember them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leukocytic"
},
"reviewBody": "I love how I can just throw this together in the morning before class with so little ingredients and have a satisfying breakfast. The only problem I had was that when I sprinkled my pan with flour, it burned. Probably due to the thinness of the pan (I just used a regular one) or having the heat too high, but when the farls were cooking I had no problems. Didn't need a lid like other users found was necessary. Definitely will be making this again, an easy dish to make to pull me through college mornings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "martymarfood"
},
"reviewBody": "Absolutely wonderful recipe. I've made this quite a few times since discovering it on here &amp; it always goes over very well. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "higginm2"
},
"reviewBody": "I followed the recipe listed, although i made only a single serving (1/4 of original). Flattened the dough to about 1/2 inch and then cooked on heavy-bottomed skilled, with the lid. I did turn up the heat a little towards the end to a little past medium to brown the outside a bit more but the end result was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "I just returned from Ireland, and these are so close to the real thing! The recipe instructions say to mix the salt with the flour, but the ingredients do not list salt. I added only a tiny bit. Also, I covered the skillet because the center didn't seem to be cooking, and that fixed the problem. YUMMY recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tressa"
},
"reviewBody": "Absolutely loved these. Quickly made them right before dinner and served warm with honey and jam. They did take longer than I expected on the stove, so I put them in the oven for a few more minutes. (Used a cast iron skillet.) Sliced lengthwise to make 8 slices. I told my parents about my newest \"favorite\" recipe, and my 100% Irish Dad said, \"I'll have to stop over for breakfast sometime.\" My husband and kids loved them,too. One small problem was that a few of them got too browned on one side, but nothing that posed a problem. Still absolutely delicious. This is real authentic Irish to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhianna"
},
"reviewBody": "This was pretty good, but I prefer the moister Potato Farls. I served this as part of \"Ferg's Ulster Fry Up\", which I recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smalaska"
},
"reviewBody": "these were so good, and terribly easy, i worried that i kneaded them too much, but they turned out so soft! I also replaced 1/4 cup plain yogurt. My roommates ate them without asking even! try them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "My dough was really soft, even after I added some additional flour, so instead of rolling it out and cutting it, I just dropped blobs of it on the griddle. I found my heat needed to be medium high in order to get them to brown properly. Nevertheless, I enjoyed them with some butter and jam. I'm not sure I would make them regularly, but they were a nice St. Patrick's Day treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonnet"
},
"reviewBody": "Gorgeous!! They are somewhat similar to Aussie damper. They are a delightful flavor and texture and so, so easy to make. I don't keep buttermilk on hand so I use regular milk with a Tbsp of vinegar or lemon juice and it works just great. My kids and husband adore this recipe and we could eat it every night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bluemaster"
},
"reviewBody": "Very simple and fool proof. And works perfectly. I most often use plain yogurt and make the dough with a Kitchenaid mixer, adding extra flour or yogurt until the dough cleans the steel bowl (but don't make the dough stiff). Next, I spread the dough on a frying pan dusted with flour and cook/fry in the stove, turning once after a while. I make the cuts after the farl is ready. The basic recipe is great... you can also add herbs (e.g. fresh rosemary) or any other aromatic stuff for a twist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Spots"
},
"reviewBody": "Lovely simple bread in a hurry! I used plain yogurt instead of buttermilk, had to add a bit of additional milk, and it rose beautifully in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rioghnach McCloskey"
},
"reviewBody": "This tastes exactly like the soda farls we get back in Ireland which I was so desperatly craving!! So yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Lee Dahl"
},
"reviewBody": "Made this with rye flour and ate it with whiskey marmalade it was grand, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARFLOWER"
},
"reviewBody": "Rustic looking biscuits, and you don't have to turn the oven on! I had dried buttermilk so I used that. Added 1/2 tsp salt (recipe forgets to say how much). Cut 8 biscuits instead of 4, and used my cast-iron skillet. It got real smoky at first - I don't think you need any flour in the pan if the biscuits are already quite floured, and don't let the pan get too hot. The first batch came out good - dark brown color when done. Then tried cooking the rest covered with a lid on, at a low heat, 5 mins each side - they rose up a little higher that way. Maybe try one as a test until you get the hang of it. They come out looking dark and rustic when done, with a nice chewy crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Just a plain peice of bread. It reminded me of a tortilla, and tasted like wonton dough. i think though, if you cut it open and stuffed it with something like cheese, pepperonis, and pizza sauce,, it would make a perfect pizza taco (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate Heitstuman Dobson"
},
"reviewBody": "My family loves these! I do have to cut them in half to make them thinner so that they cook all the was through. Wonderful alternative to biscuits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "My mother made Irish soda farls all her life and she was a wonderful baker, but her recipe called for approx. 2 tbls. butter cut in (like a piecrust). It gives the bread a softer texture. Wonderful hot with fresh butter and jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charly"
},
"reviewBody": "These are great and soooo easy. My husband wants them every night. They are very similar to the churrasca he makes in Chile, but these are even healthier because they don't require butter or shortening (except for what you want to let melt over the top!). Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LANGSTON28"
},
"reviewBody": "decent but i would add a little more baking soda to them next time. as said they are great with butter and jelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "almondjoy2807"
},
"reviewBody": "I made these as part of an Ulster feast for my family, and I thought these were awesome! They taste like a biscuit, only better. And my kids and hubby really liked them too. Hubby went Danish-style (think Aebleskiver) with his and ate it with jam (raspberry) and powdered sugar. Not exactly Irish, but an extremely delicious way to eat them! I thought these were great and sooooo easy - I will definitely be making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "This was so simple and delicious - and I barely mussed up the kitchen! I did not knead the dough (kneading is a bit scary and I am not very good at it), so instead I just mixed a bit longer in the mixing bowl before transferring directly to my electric griddle pan (set at 300 F). I only used a pinch of salt - will add more next time. It is great served with salted butter and honey, or with blueberry preserves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMALLI1"
},
"reviewBody": "My Irish husband has been wanting to figure out how to make soda farls since he moved to the US 8 years ago. Had I known they were so easy, I would have done it ages ago! I added 1 teaspoon of salt into recipe. His smile said it all. He did add that they were EXACTLY like home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "At2"
},
"reviewBody": "Just as good as the former Ormo Bakery in Belfast.\n\nAn excellent recipe. Don't forget to add a generous pinch of salt to the flour, before adding the buttermilk. I baked my soda farls on a warm-hot cast-iron pan on top of the stove, 5-6 mins each side. It can be easily frozen in a ziplock bag and defrosted in the samebag in the microwave, (approx. 30-40 seconds) Once cut into 2 horizontally it can be toasted, or my favorite, fried with a little bit of bacon for extra flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moof86"
},
"reviewBody": "These come out awesome! They're a simple, no frills soda bread recipie and they're quick and easy to make. My boyfriend, from County Armagh, thinks they are dead on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lupin Pooter"
},
"reviewBody": "Made them(it?) this morning as part of a St Paddy's Day Ulster Fry (Mr P claims Irish descent, although frankly, I think Martian is probably more likely). Incredibly quick and simple and very, very delicious. Added a sprinkle of organic garlic salt, but otherwise made exactly as per recipe. Now I know how easy this is, I can see myself making it (them?) regularly. Many thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhys Harrison"
},
"reviewBody": "Five stars for simplicity! This recipe was incredibly simple and easy to do for a n amateur cook(like myself). Tasty and an easy replacement for morning toast or cereal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linsco"
},
"reviewBody": "This was a delicious part of our St. Paddy's breakfast! I took the advice of another reviewer and ended up cutting the farls in half once they were cooked a bit so they cooked all the way through. Then I did half normally and half in bacon grease. Mmmm!! Quick, easy and delicious - will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Edna"
},
"reviewBody": "Made these as part of a traditional Irish Breakfast. Everyone liked them. They were very quick and easy to do. Will try them with herbs and garlic for a great supper bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MEDFORD63"
},
"reviewBody": "I like that this is so easy, even for someone who is afraid to work with dough, and takes very little time to make. Also, you don't have to mess around with the oven. This recipe halves nicely. The first time, I used vanilla yogurt instead of buttermilk and added a few teaspoons of sugar to make sweet farls. I sliced the farl in half horizontally while it was hot and spread butter and raspberry jam inside. The second time, I followed the recipe exactly. (Since the recipe doesn't specify how much salt to use, I used 1/8 tsp salt for a half recipe - I think next time I will use more.) It made the kitchen smell good, and kind of like pancakes. I will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgia Pankey"
},
"reviewBody": "I used yogurt and the 2servings recipe. GREAT!!I took the advice and added a little salt and garlic when I made it for dinner. This is a keeper. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YOTOMKAT1"
},
"reviewBody": "We make this often and serve with homemade guava jelly. Wonderful! I put just a pinch of salt in the mixture, as the recipe doesn't specify. Also, go easy with sprinkling flour on the griddle. Warm and wonderful-- and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "havenhouse"
},
"reviewBody": "So easy and so yummy, too! These are one of my husband's favorites and he requests them all the time. Thank you Ita for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherC"
},
"reviewBody": "In the morning these are perfect with some butter and jam, but for dinner I add some garlic and pepper to the recipe. So easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Apple Jacks"
},
"reviewBody": "We've never tasted farls before, but these were just right for a late breakfast! They reminded me of baking soda biscuits, but were so much easier to make. The dough is sticky, but with enough flour its no problem at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rashel Fitchett"
},
"reviewBody": "Yum! This bread was so down to earth and hearty. I loved it...especially with rhubarb jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "floriemay"
},
"reviewBody": "Everyone loved these. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "It was so good!! I didn't have any buttermilk, so I used yogurt instead, and it worked perfectly!! Thanks so much!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karin Landers"
},
"reviewBody": "Yum! So quick and easy, I didn't expect it to be this good. But WOW! Forget buying soda bread again. This was like a really yummy, dense, soda-y pancake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M. Stoffel"
},
"reviewBody": "Mmmm! The dough couldn't be simpler, and they taste delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I want to serve farls at our StP's meal next week, so I thought I'd give these a shot. They really are excellent! Because mine were quite thick and didn't completely cook all the way through, I just split them, and returned them to the skillet cut-side down. Wonderful with butter and seedless raspberry jelly! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Griffin"
},
"reviewBody": "These were very nice- I was looking for a bread I could cook on the stovetop, and here it is. Simple, quick and tasty. I added sugar, cinnamon, and a bit of all spice to mine for a more breakfast feel, and ate them with pumpkin butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodelicious"
},
"reviewBody": "Farls. Who knew? Now I do. Fabulous!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/100502/irish-soda-farls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
"name": "Irish Soda Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/100502/irish-soda-farls/",
"name": "Irish Soda Farls"
}
}
]
}
}
, "about": [
]
}
]