				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Island-Style Fried Rice"
,"datePublished": "2020-04-28T19:12:14.000-04:00"
,"dateModified": "2020-04-28T19:12:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "chen"
,"url": "https://www.allrecipes.com/cook/3505774"
}
]
,"description": "Fried rice, Hawaiian-style, features such beloved island delicacies as pineapple, Chinese lup cheong sausage, and Spam®."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DdubGFIkSeITNin7yenEGttjkMY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/406386-dc23d08c419546f9966c98004f304a33.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6152399158001",
"description": "Fried rice with pineapple and Spam is a tasty island-style dish!",
"duration": "PT1M26S",
"name": "How to Make Island Style Fried Rice",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/37963109-b728-4f1f-887c-c5593e9eee56/c1d3b86b-4c58-414d-ba46-e5dfad499208/1280x720/match/image.jpg",
"uploadDate": "2022-06-07T12:58:50.934-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Island-Style Fried Rice"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "194"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "511 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "133 mg"
,"fiberContent": "1 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "988 mg"
,"sugarContent": "6 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.5 cups uncooked jasmine rice",
"3 cups water",
"2 teaspoons canola oil",
"1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), cubed",
"0.5 cup sliced Chinese sweet pork sausage (lup cheong)",
"3 eggs, beaten",
"2 tablespoons canola oil",
"1 (8 ounce) can pineapple chunks, drained",
"0.5 cup chopped green onion",
"3 tablespoons oyster sauce",
"0.5 teaspoon garlic powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Let the rice cool completely."
} ,{
"@type": "HowToStep"
,"text": "Heat 2 teaspoons of oil in a skillet over medium heat, and brown the luncheon meat and sausage. Set aside, and pour the beaten eggs into the hot skillet. Scramble the eggs, and set aside."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DdubGFIkSeITNin7yenEGttjkMY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/406386-dc23d08c419546f9966c98004f304a33.jpg"
}
]
,"text": "Heat 2 tablespoons of oil in a large nonstick skillet over medium heat, and stir in the rice. Toss the rice with the hot oil until heated through and beginning to brown, about 2 minutes. Add the garlic powder, toss the rice for 1 more minute to develop the garlic taste, and stir in the luncheon meat, sausage, scrambled eggs, pineapple, and oyster sauce. Cook and stir until the oyster sauce coats the rice and other ingredients, 2 to 3 minutes, stir in the green onions, and serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Azure"
},
"reviewBody": "I've read it's best to use day old rice for fried rice. Starch absorption is less than with fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Omgosh. If you're on the fence about making this, just do it, trust me. I normally don't like sweet mixed in with my savory but this dish is amazing. I made it to-recipe minus the Chinese sausage, I couldn't find any locally so I only used spam. I also made my rice in my rice cooker instead of the pot as suggested. This is going into my normal rotation for sure! Also, for anyone who had trouble with the rice becoming \"sticky\", make sure to cool the rice completely after cooking. Like stick that sucker in the fridge. Fried rice is usually made with day-old rice and it has to be cool to get the right texture. Happy cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark McClurken"
},
"reviewBody": "I hate when people substitute items and call it the same recipe but found myself doing just that....didn't have spam, used kielbasa, added a pepper and an onion and doubled the pineapple (used fresh)...easily restaurant quality, will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "franter518"
},
"reviewBody": "Made this for my 1st annual luau and it was a giant success!! I didn't change much, just added more oyster sauce and small junks of fresh jalapeños for a bit of spice. HIGHLY RECOMMEND this Dish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily"
},
"reviewBody": "I have made the original recipe, and variations of it, for years and thought I should finally put up my own 5 star review. I usually just make as is, but when I want a change in flavor, I put the base ingredients with the Golden Curry sauce packet instead of the soy sauce &amp; vegetarian oyster sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "The wife loves it. I can rarely find the Chinese sausage so I just use the spam which is fine. Everything else I cook exactly as the instructions say."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Krystina Begley Fielder"
},
"reviewBody": "This didn't turn out well for me. The rice was sticky and I did not like the SPAM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Pfenninger"
},
"reviewBody": "I made this tonight for the fam and it was a smasher. I used soy sauce instead. Also used diced ham and a mild sausage link from Kroger meat counter. Turned out great and now on the menu for the household"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I think you'd need to like spam to like this recipe. I made my kids and wife try spam and let's just say it was not a hit -- the flavor isn't bad, but the texture really is. That said, the combo of rice, pineapple (I used fresh), and oyster sauce was yummy. And it was ridiculously easy to make, especially since I made the rice in my rice cooker in the morning, then just threw everything together right before dinner. \n Would try this base again with a different protein."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "Tasty and different! The Chinese sweet sausage was a nice change from spicy or savory sausage, and a nice contrast to super-salty Spam. I used all the called-for ingredients, but wasn't too careful about the amounts: Put in the full package of sausage, and a full 23.5 oz container of pineapple chunks. But it all tasted great. I will say that the extreme saltiness of Spam isn't for me so much, and I would maybe either include less of it next time or cut it up into more tinier chunks to more evenly distribute the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "01749"
},
"reviewBody": "Not impressed at all. Had no flavor what so ever. Will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexander Tilton"
},
"reviewBody": "This has become a house regular. I just change around the ingredients sometimes. I swap in stuff like peas, bacon, or bamboo shoots from time to time. It always turns out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dori Baron Cron"
},
"reviewBody": "Great recipe! Thank you, Chen, you are a wonder! I did make a few changes just because that's what I do when I'm cooking. I added a little bit of olive oil to the pan and toasted the rice until golden brown before adding the water to cook it. Used Turkey Spam, and fried it well, no sausage. I also added a small packaged of good frozen vegetables (peas, carrots and corn.) I like pineapple, so I used a whole, large can of pineapple tidbits, just dumped the whole thing in, and opened a large can of sliced pineapple and used the juice instead of the pineapple juice called for. Otherwise I followed the instructions as shown. I made a pineapple upside down cake to go with the dinner out of the pineapple slices. I was asked many, many times for the rice recipe and was talking all night! (unusual for me!) Keep the recipes coming!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lolly"
},
"reviewBody": "This was a delicious and quick dish. I love fried rice, and this was a little different from my usual because of the oyster sauce and no soy! Only changes I made was to use half oyster and half soy, and threw in a hand full of peas. The sesame oil and oyster with the pineapple make this FAB!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ariella Scharrer"
},
"reviewBody": "I followed the recipe but put no sausage, pineapple and no oyster sauce (personal preference) and it was so amazing!! I added some minced garlic for more flavor, and topped it with hot sauce and white country gravy for anyone looking to make it their own"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DESIREE MARTIN"
},
"reviewBody": "It was delicious. Everyone cleaned their plate and some people asked for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Scales"
},
"reviewBody": "Not bad, I'll have to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahCabot"
},
"reviewBody": "Had no Chinese sausage or green onions. Also no oyster sauce on hand so I substituted gluten-free soy sauce, a couple drops of Worcestershire sauce and a tsp of sugar. I made sure to crisp up the spam chunks real good, glad I did. It came out great, even with the missing ingredients. Will be sure to have oyster sauce next time though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adele Rockett"
},
"reviewBody": "I used leftover steak and spam. Careful not to add the steak too soon so it doesn't over cook. Just enough to reheat it. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mlee"
},
"reviewBody": "We just got back from our first trip as a couple to beautiful Hawaii. Until then the idea of luncheon meat like Spam (Klik in Canada) was reserved for Monte Python sketches but we did very much enjoy the use of it in the Aloha state. This recipe is no exception - delicious! If like us you once turned your nose up at Spam you won't after this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fdmelcher"
},
"reviewBody": "It was really good. I accidentally bought crushed pineapple instead of chunks, I think it would’ve been better if I’d got the chunks as called for. Also, had to season to taste, but pretty much have to do that with everything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmy Cruzado"
},
"reviewBody": "I prepared it without the pineapple (the men in my life weren't too keen on fruit with their rice) and it was delicious. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brett Downes"
},
"reviewBody": "Fantastic! I couldn't find the Chinese sausage but made without, amazing leftovers too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "@Be"
},
"reviewBody": "Thanks for the great recipe! I made this with stuff from my cupboards so it was a bit different; used Teriyaki Spam and Coconut Jasmine Rice (Uncle Bens Ready Rice, one bag coconut, one bag brown...I know...lazy, but quick, clean, and what I had). Because I had those flavors, I didn’t add any of the extra sauces. They complimented each other well and it was great. Next time I’ll try it with my Portuguese Sausage Spam! Didn’t have any onions, sausage or pineapple either... maybe next time. And I did use minced garlic with the oil instead of powdered, as I liked the idea that the most liked reviewer had mentioned about their crushed g. These tweaks actually cut it down to 454 cal for 5 one cup servings...according to my Fitness Pal app, which is another plus! Thanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla"
},
"reviewBody": "made it 2 times now and it's amazing last time I didn't make enough to have leftovers so this time I doubled it so I can eat it tomorrow too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "praise"
},
"reviewBody": "i liked so much it was amazing a make it again and share the recipe with other around the would"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catsanj"
},
"reviewBody": "Awesome dish. The whole family really enjoyed will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gregory Tindle"
},
"reviewBody": "Much easier than I was expecting! Use this rice all the time in the summer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Miller Toney"
},
"reviewBody": "The settle taste was a compliment to our flavorful meal. used a tad extra oyster sauce, could have included more pineapple as well. I omitted the Chinese pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssalinas"
},
"reviewBody": "I like to follow recipes exactly as written my first time around. This was easier to make than I thought. I used all the ingredients as stated except for the Chinese sausage (unfortunately I don’t have any Asian markets close by) and I used 3 cloves of fresh minced garlic. It turned out great! It was very flavorful and delicious. Next time I will definitely use the Chinese sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Hansen Jensen"
},
"reviewBody": "I really liked it. Couldn't find the sausage so I added extra spam. I also think it would be better to use the tidbits pineapple instead of chunks. I would make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Mead"
},
"reviewBody": "We made it, with canned flakes of ham instead of SPAM, and with a Johnsonville small polish sausages, and the kids absolutely loved it! The pineapple sweetness and with tasty meat surprises, made for a great flavour in the rice, and everyone was raving about it! Thanks for sharing this recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "romans"
},
"reviewBody": "This was really good to me. I did not have oyster sauce, but I had clam juice so I used that. I also did not have the Chinese sausage, so I used what I had on hand which was sweet Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Marconi"
},
"reviewBody": "I used two cans of spam, 2 cups of rice (and more water), and added half a bag of frozen peas, carrots, corn and green beans. I've been doing a \"clear the pantry\" type week of meals and this by far was the best we had and I've been asked that we make it a new go-to meal by my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Channy"
},
"reviewBody": "Used a chorizo sausage for a little spice and it worked well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "novaonline"
},
"reviewBody": "yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June P"
},
"reviewBody": "This is one of my favorite recipes and I've probably made it a dozen times. My guys love it. I add a little reduced sodium soy sauce but otherwise make it exactly as written. I would like to find a green veg that could be added just so it's colorful and a bit healthier. For all the people who skipped the Chinese sausage, it's really what makes the dish so I trek to the Asian market and stock up, it keeps for a long time. Also aidells chicken sausage with bacon and pineapple is an okay substitute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pwolfra"
},
"reviewBody": "Pretty darn yummy! Not on any approved diet, but great comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelz Haven"
},
"reviewBody": "i used overnight rice with balogna, sausage, cheese, all purpose seasoning, red, green and yellow pepper, and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Reed"
},
"reviewBody": "I used ham. I also added frozen mixed veggies. To add a little bit more flavor I put 1/4 tsp of Chinese 5 spice and a spinkle of ground ginger. The 5 spice added just the right amount of flavor to the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kuulei"
},
"reviewBody": "Great basic recipe, that changes each time I make it! When I have leftover rice, the next meal is fried rice! Whatever meat is on-hand goes into this; Spam, ham, cut-up sausage links, portuguese sausage, bacon, chicken, steak and even shrimp!\nIts a great way to use up leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaNettie"
},
"reviewBody": "Delicious! Needed a dish to take to a potluck with an Asian/Hawaiian theme. So tested this out with my family today first. All agreed it was a thumbs-up and good to go for the potluck. The only thing I changed was to add more pineapple and to use the tidbits, since the can of Doke tidbits I bought was 20 oz. After draining the pineapple, I used 6 oz of the tidbits. I found the lap cheong at an Asian market and it really adds a good dimension."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack Sheffield"
},
"reviewBody": "Amazing recipe! I didn’t use pineapples or Chinese sausage but still come out good and the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaNyk"
},
"reviewBody": "Tried this for a Luau and it was a huge hit!!! Now its my #1 requested dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momo"
},
"reviewBody": "The best dish ever!!!! My son who is a very picky eater kept going for seconds! My mother who lives next door, snuck some and really loved it! Definitely keeping this for the recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KMANELIS"
},
"reviewBody": "Great recipe. Not a SPAM fan, but this was good. Took it to a work Island themed potluck and it was a real hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rbook"
},
"reviewBody": "My kids loved it. I added chopped zucchini in with the rice to lightly cook because we had extra from the garden and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lon Hause"
},
"reviewBody": "I added lemon juice, a few red pepper flakes. Also, Asian grocery was closed so instead of Chinese Sausage I used chicken apple sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristinaW"
},
"reviewBody": "I only used SPAM, and that was fine. I sauteed a minced clove of garlic (instead of powder) and half a chopped onion with the SPAM. I didn't have oyster sauce, so I added a little finadenne sauce (soy/vinegar mix) instead. I also sprinkled a little bit of grated unsweetened coconut over the top at the very end and mixed it in to taste. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlyn Liddell Minnick"
},
"reviewBody": "I love this rice. I made the rice with pineapple juice replacing the water. I only used spam and I didn't have oyster sauce so I used soy sauce. I also omitted the onion because my family doesn't like them. I also used coconut oil to fry everything up which have it a very light coconut taste and really made a more tropical rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A-Nice"
},
"reviewBody": "Great recipe. Everything that has been said below is spot on. Didn't use the pork or Spam (though I know that's what makes it Hawaiian style), but everything else was used. I like it better personally with fried vidalia onions over the green, but that's just personal preference. Great recipe and reminds me of Hawaii for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DDIAGNE"
},
"reviewBody": "This was excellent! I made this for a cookout! It left immediately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Kay"
},
"reviewBody": "Very delicious! I didn't use the Chinese pork and I replaced the oyster sauce with soy sauce. I also threw in ginger and chopped carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "This rice was a hit at my Hawaiian-themed surprise birthday party. I read every single review and made a few changes and it held up well in my crock pot for several hours. The recommendations I found helpful were to add garlic (real, not powder), use pineapple tidbits (or at least small pieces), add extra pineapple, cook rice ahead and cool on greased cookie sheet in fridge, and add green onions. I didn't use the sausage and went with some lite Spam and some regular cooked till crispy. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Badgeman"
},
"reviewBody": "I added 4 cloves minced garlic, fresh ginger, zuccini, minced carrots and bell peppers. Hot Italian sausage, turkey sausage and Spam Lite are the meats I used. It tasted just like the Hawaiian Rice I use to get in Waikiki."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy McBeth Horton"
},
"reviewBody": "Loved it! Changes I made- used soy sauce instead of oyster sauce. Used minute rice- 4 servings (was not able to properly brown it after it was prepared- so skip this step), added 1/2 cup green onions, used fresh pineapple, used diced garlic instead of garlic salt/powder, omitted the sausage. My husband absolutely loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwen W"
},
"reviewBody": "I forgot the pineapple chunks, so I cooked my pork sausage with a little bit of orange and mango juice. This dish was a big hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Pappas"
},
"reviewBody": "I enjoyed this recipe but did substitute the meat for Aidells Spicy Mango with Jalapeno chicken sausage, which was a fabulous complement to the pineapple. Only complaint was the instructions say to add garlic powder but this was not listed in the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Balkon"
},
"reviewBody": "Really good! Some good stuff to put in is 1 ounce of edamame beans and 1 tsp of teriyaki sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "begginerchef28"
},
"reviewBody": "absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbarasims"
},
"reviewBody": "WE ALL LOVED THIS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Copeland Taft"
},
"reviewBody": "I used cubed ham and link sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "August"
},
"reviewBody": "I made this recipe while visiting Maui to go with a local-inspired meal. I used Portuguese sausage (local) rather than Chinese and a fresh Maui Gold Pineapple. Fantastic!! Traded a bowl for drinks at the bar. Thanks Chen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MushroomRisotto"
},
"reviewBody": "I really liked this dish even though the rice - simply and delicious. Even though the rice was nowhere close to \"fried\" (it was more like a sticky rice bunch), I still enjoyed the flavor. Keep in mind that this is island style, so the flavor is supposed to be subtle, not like the Indian rice dishes. We used a type of Vietnamese sausage (because that's the closest I could find in our Asian market) and increased the amount, added slightly more pineapple and a little bit pineapple juice (maybe that's why it didn't fry). I found the amount of oyster sauce to be all right, but my husband added more because he's used to more spiced dishes (I think he abused his taste buds to the point that he needs more to stimulate normal senses lol)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angeline"
},
"reviewBody": "My husband and I have made this recipe twice now. We both like the recipe, but had to make the following revisions for this to be 4 star-worthy. Added fresh chopped garlic in addition to the garlic powder. Also added chopped yellow onions to give it some texture. Excluded the pineapple because we've never seen restaurants in Hawaii use pineapple in their fried rice, ever (yes, we ate at all the hidden gems/local spots, not the touristy places). Only used 1 tablespoon of oyster sauce. Anyone who has cooked with oyster sauce or is familiar with it knows how salty it is. 3 tablespoons sounded like way too much, so we used 2 tablespoons our first try; the leftovers next day were almost inedible. Cut down to 1 tablespoon this time around and it made all the difference. Used Spam Less Sodium instead of regular Spam to balance the saltiness of the oyster sauce. Added nori fumi (seaweed) furikake rice topping on the rice, just like they do with poke bowls. My husband and I both agree that this topping adds a whole new level of complexity to the fried rice. We insist that you try it! Overall, this is a good starting point with room to improvise. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vhui"
},
"reviewBody": "I made it with the leftover holiday ham instead of spam. I also had leftover pineapple and cherries which was used to drizzle the ham, so I just picked out the pineapples to us for the fried rice. The Chinese makes this dish delicious!!! :-) Thank you for the recipe, chen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Super Kat"
},
"reviewBody": "I love this dish. I didn't have pineapple but I followed the rest of the recipe to the letter. Definitely a keeper. Mahalo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Murrile"
},
"reviewBody": "I found this recipe here on Allrecipes a few years ago and made it for the first time. It was to die for. I remembered how great it was the other day and made it again last night.. It really brought me back. An explosion of great taste; the sweet pineapple and salted meat! \n\nI have never made mine with the Chinese sausage. I used a 20 oz can of pineapple chunks and cut each chunk into thirds. I cut the luncheon meat into pieces about as big as the cut pineapple pieces.\n\nI added about 1 tsp of garlic powder while frying the rice in the oil.\n\nI cooked everything together in the end for a minute which cooked the green onion perfectly.\n\nThis recipe is definitely a keeper for years to come. Restaurant quality!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I love fried rice so I decided to try this and it tastes so yummy. I didn't follow the directions though, I added the beaten eggs with the rice in the pan. I used sweet soy sauce instead of the oyster because I didn't have any and I used half of the amount of pineapples because I didn't want that much in my rice. Still yummy!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This was very good but I had to make a few changes based on what I had. I used white rice instead of jasmine. I used smoked sausage because it was all I had on hand. I also used half pineapple juice and half soy sauce in place of the oyster sauce. It was yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HMG"
},
"reviewBody": "Did not care for this at all. Followed recipe specifications to the letter with the exception of using turkey spam instead of regular and using a version of the sausage called for made with chicken instead of pork, simply because I don't eat beef or pork. The pineapple is very faint - if you want to be sure to detect it, I recommend using a large can &amp; even consider throwing some of the juice in with the rice as it cooks. The only bites that tasted kind of ok to me were those that contained at least a bit of the green onion - provided a nice little burst of freshness so if you're going to try this definitely don't skip the green onion, maybe even add more than called for. Looked interesting and the reviews were generally good so I decided to give it a try - glad I did but definitely won't be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robin-m"
},
"reviewBody": "Tried this tonight with very few modifications. Didn't have the Chinese sausage. Increased the eggs to 5, doubled the pineapple and used more green onions. Used the \"lite\" Spam, as that was what we had. FABULOUS. My son and I agreed that this recipe is a total keeper. It would have been nice if there were leftovers -- there were not. We were both hungry and we devoured the whole thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette W"
},
"reviewBody": "Very good! I ended up frying the SPAM until it was crispy, which added to the flavor. I also forgot the green onion, but it was still very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katika Roberts"
},
"reviewBody": "I live in the south so we will eat rice for any meal. I made for breakfast and it was delicious. I omitted the pineapples and added diced onions and it was still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alanna Brown"
},
"reviewBody": "Delicious!!! My husband went crazy over this!! I followed the recipe exactly- I just left out the pork sausage and stuck with spam ;) we'll be making this often!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gypsy Jay"
},
"reviewBody": "I think this recipe has potential. I think next time I may marinate the chicken in the curry sauce for a while before cooking it, also may add more curry as I thought it lacked a little in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is one of my favorite recipes to cook anytime I have left over rice. The key to great fried rice is to use two or three day old rice! Whenever I use fresh rice for fried rice dishes it always seems to turn out so mushy. I think using old rice is best because it has dried out a bit while sitting in the fridge so when you cook it the rice remains in individual grains rather than lumping together. \nAlso, I have never had SPAM before this dish and loved it! The saltiness from the SPAM and the sweetness from the pineapple really mesh well. Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alan weber"
},
"reviewBody": "Made this last night following the directions with only a few changes. I used a 20oz can of pineapple, swapped summer sausage for the Chinese sausage(quartered and sliced thin), and half of a sweet onion for green onions (what I had on hand). It turned out excellent! I cooked the sausage and spam together until they were almost done then added the onion and cooked until translucent. When I make it again I will only double the pineapple, it was just a bit too much for me but the kids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "coming from someone who isn't big into sweet this was wonderful and a great way to use up some leftovers! halved the recipe and used leftover roasted pork in lieu of the spam and chinese sausage.. added some leftover grilled green bell pepper.. used leftover rice.. one whole egg.. 4 oz of canned pineapple rings that i chopped up.. fried the green onion instead of using it as garnish as rasmasass suggested.. since there was no exact measurement i too just sprinkled some garlic powder over the rice as it was heating up along with a light sprinkle of cayenne.. ty so much for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dominica"
},
"reviewBody": "yum. delicious. if u like fried rice you're gonna like this. i made it as directed. turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Massey-Razvillas"
},
"reviewBody": "We made it for a family gathering and loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovebaking!"
},
"reviewBody": "This is recipe is amazing! It always leaves me hungry for more! I did not use oyster sauce or pork sausage but it still deserves 5 stars! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire79"
},
"reviewBody": "I just made this and am eating it as I type. and I HATE rice! SO Very good. I didn't have all the right ingredients but most or similar. I didn't have the sausage and no one in my house likes pineapples so I used about a 1/4 or less of a cup of sweet and sour sauce and canned ham. My boys will be home for lunch soon and I know they will love this too. Delicious, Thanks for the entry, I love AR!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saveur"
},
"reviewBody": "Loved this fried rice recipe, perfect with our Hawaiian grilled shrimp. I had some bacon to use up, so I subbed that for the Spam and sausage. I aslo added some peas. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joey Sweeting"
},
"reviewBody": "Im eating this island fried rice and giving the comment here too...this is a great and i added some black pepper before serve. Im sure I will make it again. Thanks for the recipies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DIZ&#9829;"
},
"reviewBody": "Mixed reviews here. I like that it is different from standard fried rice. My husband thought this was o.k., but I wasn’t real crazy about it. At first, the oyster sauce gave it an overwhelming fishy taste and smell. We had a ton left over and when reheated as a leftover, it had a much better flavor and kind of grew on me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "henthorm"
},
"reviewBody": "I tweaked this recipe quite a bit, but loved it! I cut out the spam and meat entirely, (as I was preparing it to be served with sweet pineapple chicken meatballs), I only used two eggs, and I took some one else's suggestion, and rather than oyster sauce, used half and half, pineapple juice and teryiaki sauce. I sauteed in diced red pepper while I cooked the eggs, and about a minute before I took the eggs out of the pan, tossed i the pineapple and green onion, so that they weren't added in completely raw. The base of this recipe is awesome!! I will most def be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chic2chef"
},
"reviewBody": "Really loved this recipe! I added diced red peppers &amp; baby peas because my husband &amp; I like a lot of vegetables. Also, used brown rice &amp; a thick slice of deli ham instead of SPAM (don't really care for SPAM). This recipe is definitely a keeper. Next time I'm going to try it with cruched pineapple instead of chunks. The chunks are a little too big with all the other ingredients being diced. I agree with one of the other reviews, I'm not quite sure why more people haven't tried this. It's great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaena39"
},
"reviewBody": "This meal was a big hit. I did not tell my husband that I made a variation on our regular pork/chicken fried rice. He started eating, stopped and said, \"Is there pineapple in here?\" and when I told him it was an island variation he said, \"This is delicious.\" Now, I did eyeball the ingredients and ended up adding way more pineapple than stated- loved it that way. Also, I used regular cubed ham since we are not a fan of the Spam variety. As for the rice, I always make it an hour or two before dinner and stick it in the freezer so it is nice and cold when I need it. That way, it doesn't get mushy. Hope this helps. Thank you for the recipe, chen! It will most definitely be made again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jedigramma"
},
"reviewBody": "I used Spam Lite, and left out the sausage. I sauteed two teaspoons of minced garlic in the oil before adding the Spam. I also sauteed the thicker pieces of green onion, and added the lighter green top pieces at the end. The pineapple juice &amp; teriyaki sauce substitution that others suggested was great (my husband is not a fish fan). Pearl rice tastes great in this! I'm not much of a cook, but this was easy and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tera"
},
"reviewBody": "Just took my first bite and heck yeah! I didnt have any oyster sauce so I used hoisin instead. It made perfect sence anyway since its like an asian bbq sauce and pork (Spam) and bbq sauce go hand to hand anyways. I finally found something new to bring to the table thankyou!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JESSICUP"
},
"reviewBody": "I also left off the sausage because I didn't have time to get it. Brought it for a luau potluck at work and everyone liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommyDenny"
},
"reviewBody": "This is so yummy! I made it for my husband's Luau party. I skipped the oyster sauce and added soy sauce instead. It was the hit of the party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hot Chilli"
},
"reviewBody": "So good! I used real ham cut into chunks as I don't like Spam. Great accompaniment to my beef stir fry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashleyann1982"
},
"reviewBody": "This was so good and super easy. I did not have spam or the other meat on the list. I did have some left over sausage. I cut it up into small pieces and it worked great in a pinch.I served with Hawaiian Chicken Kabobs from this site and black beans. Yummy will be using this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATSINS2"
},
"reviewBody": "My family loves this recipe. If I plan on making it I make A LOT and it still gets eaten up in a day or two. I use crushed pineapple bc I don't really like to bite into chunks of pineapple. I also like fry some garlic, ginger, and whole star anise with the luncheon meat and sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauraslo"
},
"reviewBody": "Loved this! Served it to the whole family on our Cayman Island vacation after one of the kids requested fried rice. It was a huge hit! Subbed soy for oyster sauce and used a smoked sausage. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cobrasgirl"
},
"reviewBody": "I made this for a luau dinner party kind of on a flook. I wanted to have something to incorporate spam into my theme. It was the hit of the party. I did leave out the chinese sausage because I couldn't find it. I wish I could say how good it was, but it was all gone before I got a chance to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bdm"
},
"reviewBody": "This was awesome. I didn't use either of the meats (just sliced ham) and I used pineapple juice and Shoyu Chicken sauce instead of the oyster sauce (I didn't have that). It was great, even with brown rice. Thanks!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/195042/island-style-fried-rice/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
"name": "Rice"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14363/main-dish/rice/fried-rice/",
"name": "Fried Rice Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/195042/island-style-fried-rice/",
"name": "Island-Style Fried Rice"
}
}
]
}
}
, "about": [
]
}
]