				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Italian Sausage Tortellini"
,"datePublished": "2019-09-13T00:15:29.000-04:00"
,"dateModified": "2022-01-14T01:18:57.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Garrett Heintz"
,"url": "https://www.allrecipes.com/cook/17611215"
}
]
,"description": "Italian sausage, basil pesto sauce, spinach, and mushrooms combine with tortellini for one quick weeknight meal that delivers flavor and ease."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/amwji9alwlPlrKHLahWreBEK8Ww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-174-9b1884ede2054b90bd71a432910f7efa.jpg",
"height": 720,
"width": 1280
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6085002436001",
"description": "Sausage, spinach, and tortellini make the best Italian dinner!",
"duration": "PT56S",
"name": "Italian Sausage Tortellini",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4ef4cc30-5a44-44c8-9b86-d80b0c683c75/1cc89072-7b98-4e2f-a4e8-5e175e152930/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T22:45:57.999-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Italian Sausage Tortellini"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "63"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "792 kcal"
,"carbohydrateContent": "45 g"
,"cholesterolContent": "85 mg"
,"fiberContent": "5 g"
,"proteinContent": "31 g"
,"saturatedFatContent": "18 g"
,"sodiumContent": "1248 mg"
,"sugarContent": "3 g"
,"fatContent": "53 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 tablespoons unsalted butter",
"1 (8 ounce) package baby portobello mushrooms, sliced",
"1 cup dry white wine (such as Pinot Grigio), divided",
"3 cloves garlic, minced, divided",
"10 ounces mild Italian sausage, casings removed",
"1 (16 ounce) package three-cheese tortellini",
"14.5 ounces Alfredo basil sauce",
"1 (5 ounce) package baby spinach leaves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat butter in a large, deep skillet over medium heat. Cook and stir mushrooms, 1/2 cup white wine, and 1 clove minced garlic until liquid has reduced and mushrooms have softened, about 5 minutes. Remove from heat and place in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Heat the same skillet over medium-high heat. Cook and stir Italian sausage in the hot skillet until browned and crumbly, 5 to 7 minutes, dividing it into bite-sized portions while stirring. Remove excess grease by placing paper towels onto a plate and dumping browned sausage onto it to drain. Return sausage to the skillet."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/amwji9alwlPlrKHLahWreBEK8Ww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-174-9b1884ede2054b90bd71a432910f7efa.jpg"
}
]
,"text": "Return cooked mushrooms back to the skillet with sausage and add tortellini, Alfredo basil sauce, remaining 1/2 cup white wine, and remaining garlic. Reduce heat to medium-low. Cover and cook, stirring occasionally, for about 10 minutes. Add spinach; cover and cook until spinach is wilted, 3 to 4 minutes more. Mix well to combine. Remove from heat and serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Fox Gonzales"
},
"reviewBody": "It was a hit! the flavors were so good. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Blum"
},
"reviewBody": "Loved It! Followed the recipe almost exactly, except I couldn't find Alfredo Basil sauce, so I used a jar of Alfredo sauce. Not sure where people are seeing pesto in the recipe. But, it came out delicious, my husband loved it, too! We'll definitely make this one again......and again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Westerham"
},
"reviewBody": "We made this as written tonight and really liked it! Always think you should follow the original recipe the first time. A meal in one pan is such a bonus for seniors. We avoid recipes with canned soup as a substitute for sauce, however we did use a prepared Alfredo sauce! Will try it next time with a more spicy sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Yoder"
},
"reviewBody": "This was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "Very tasty! Easy recipe! I think next time I'll use hot Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gerryshellington"
},
"reviewBody": "Simple, quick and delicious. I stuck to the recipe and it didn’t fail to impress."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tony Aultman"
},
"reviewBody": "This what is a disaster! The recipe calls for basil pesto sauce. The video clearly shows a white creamy sauce added to the mix. I think the sauce in the video is a Alfredo pesto sauce. Also the directions do not specify if the tortellini is suppose to be dry or cooked. I added \"dry\" tortellini to the mix and the result was dry tortellini and the cheese wasn't even melted. I used the exact amount of basil pesto sauce, and the end result was a very strong, oily flavor! This recipe has some serious errors! Lots of sad faces on \"sandwich night\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "This recipe was just ok; way too greasy. I would cut the pesto amount by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Weisz"
},
"reviewBody": "I did make quite a few adjustments just based on what was available - used pre-cooked sundried tomato sausage (YUM!) and alfredo sauce instead of pesto. The market was out of tortellini, so tried mini ravioli instead. And I didn't have white wine, so used cooking sherry. It was still delicious! Will definitely half the pasta next time, given it was wayyyy too much, but very solid dish. I may add an onion next time like another reviewer said. I think it would be a nice boost to the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda K"
},
"reviewBody": "I love pasta and this sounded good to me. My husband is a hunter and gone quite often during the winter months and I find myself eating fast food or just bingeing on snacks around the house. I made this pasta dish and divided it into disposable freezer pans so I would have something to eat while he was gone. It is very good served only with a salad and I can get a couple of meals out of each freezer pan. However, my husband came home hungry and I ended up warming up my leftovers for him. He loved it and now at least one of the freezer pans goes to the hunting lease with him. I stuck strictly to the recipe and it turned out great. Freezes well and great for a last minute meal when you don’t have a chance to thaw something else out or time to mess with a big meal. In other words this was a hit in our house. And for my husband it was the pasta, salad and garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Nicole"
},
"reviewBody": "I made this and it was great! I used a basil Alfredo sauce instead of pesto sauce. I couldn’t find it in the store and the amount in the jar for pesto didn’t make sense. I also use frozen tortellini and they cook in the Alfredo sauce with everything. Super easy. Slicing the mushrooms takes the longest, but you could always buy them already sliced!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cliff"
},
"reviewBody": "The words \"fresh tortellini\" need to be used in this recipe. Maybe I'm just too much of a \"newbie\" but there is not enough liquid in this recipe to use dry tortellini. I will probably try this one again to see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jake"
},
"reviewBody": "I made it as follows but it probably would have been better had I made my own sauce instead of canned sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rae Brand"
},
"reviewBody": "Is it expecting too much for a recipe to be written clearly? If pesto ALFREDO sauce was called for, that is what should have been written. Not 'pesto' which is what I used because that is what the recipe said. I guess that's my bad, I should have watched the video or read the other reviews first. Regardless, it wasn't the worst thing I've put in my mouth and I bet if I'd made it correctly it would have been amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Jenkins"
},
"reviewBody": "Loved the recipe! I added another clove of garlic and onion to the mushroom mixture and to the sausage so it had time to flavor the meat and mushrooms. . I used a spoonful of pesto because it is new to my family and two jars of Alfredo. Hardly any left. They told me to make it again so that’s a winner in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Chenelle"
},
"reviewBody": "We LOVED this, but the next day there were not too many tortellini left, so I added medium size shell macaroni, and it ws even better..... That is how I will do it next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennB"
},
"reviewBody": "my family and I really liked this recipe. I used Alfredo Sauce instead of Pesto. will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peggie"
},
"reviewBody": "We also could not find Prego basil pesto sauce so used a vodka pasta sauce. We added basil pesto sauce as we ate. Since it was a “red” sauce we used a red wine.\nMy husband loved it and I thought it was good. Thank you for posting the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Loved this recipe. It easy, it's hearty and very flavorful. Its the garlic, sausage and three cheese Tortellini that gives the bulk of the flavor - plus some flavor from the dry white wine. Made it as written - except for the \"Basil Pesto sauce\" - in the video its white (not green), so it's an Alfredo sauce. I used an Alfredo sauce. It was wonderful. \nNot low-cal, but a good, hearty meal. It's now in my go-to rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Very convenient for a one pot recipe.didn’t have a lid so just cooked on medium low added 1 cup wine and 1 cup water to make up for not having a lid. It is a dish to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rosa Romero"
},
"reviewBody": "I expected so much more from this dish but unfortunately it left our taste buds disappointed and completely dissatisfied. It definitely looks amazing but left a lot to be desired. Maybe a little tweaking might help a bit but something was just missing..the flavor was so unappealing. Maybe cutting down the wine would be a good idea.. I don’t know? Good attempt but really don’t think I’ll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al Stephanie Parra-Ferrer"
},
"reviewBody": "This was easy and quick! The kids loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunny"
},
"reviewBody": "I made this the other night. I did make a few tweaks to the recipe but nothing that changed it drastically. My husband whom is a pasta lover raved about this. I had some left over but when our son came for a visit he scarfed it up. I reprinted the recipe for him. I will be making this one ...one of our favorite pasta dishes from here on out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenna Rizzuto"
},
"reviewBody": "Love this easy delicious pasta dish! The recipe calls for pesto sauce, but in the video it looks like Alfredo sauce is used. I made it with Alfredo sauce, but I am sure it would taste great either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kittie"
},
"reviewBody": "Very flavorful and a complete meal in itself, however I will use half the amount of pesto and substitute broth or water next time. The pesto overpowered the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnne Yannello"
},
"reviewBody": "Very good, very easy, and everyone was more than satisfied. I'll make it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "The only change I did was leave the spinach to be added by those in the family who wanted it. We find that we do not enjoy the texture of the spinach when it cooks to much. Family loved this recipe. Next time I make this recipe I will add some chopped onion with the mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve Cheney"
},
"reviewBody": "Made this using a little more than half of the basil pesto shown in recipe after reading some of the reviews. It turned out wonderful and was an extremely tasty dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "I didn't make any changes and I am going to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SJRJA"
},
"reviewBody": "Taste's great, the two stars are because the recipe needs clarification. The video shows a white sauce (I'm with you texasgal in duri) so they intend for you to use an alfredo sauce with pesto, not straight up pesto (14 ounces of which would make it super oily and the flavor would be overpowering) The recipe needs to state that more clearly, and also should specify Fresh tortellini, because dry tortellini would not work as written. Not sure if frozen would work this way or not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patyoung"
},
"reviewBody": "I made it exactly like the recipe only had a larger bag of fresh tortellini. It is so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alisa marie"
},
"reviewBody": "Wow!! I added a 7oz jar of Rana basil pesto, then watched the video and realized it should have been an alfredo sauce. So i just added a 15 oz jar of bertolli alfredo. it was delicious even with my mistake. YUM YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Sawyer"
},
"reviewBody": "Made with Alfredo sauce and absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami Hoyt"
},
"reviewBody": "I love the recipe. I added asiago cheese because it's my favorite.\nI made a double batch and there was barely any left after the two boys were done. I did boil the tortellini ahead of time for two minutes.\n\nThis recipe is so versatile you can change it up each time. Next time I will make meatballs with ground beef and italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "texasgal in duri"
},
"reviewBody": "I'm wondering if the author of this recipe used basil Alfredo sauce rather than basil pesto sauce since it lists 14.5 ounces? Also, the video appears to show a white-colored sauce being added, whereas pesto sauce is green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "New Cook"
},
"reviewBody": "I followed the recipe exactly and it was delicious. The only thing I did differently was use ground Italian sausage instead of the casting type and top with parmesan cheese. The dish was flavorful and filling. I will definitely put this in rotation. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Kay Prout"
},
"reviewBody": "You need to clarify if the tri- cheese tortellini is fresh or dry. I followed recipe and I used the fresh but I think it should have been cooked prior to mixing in with sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smithcot1"
},
"reviewBody": "easy meal for my wife and I. Supper fast and it had great flavor. no issues hear. I will try and give it some of my own flair next time though..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eileen Fissinger"
},
"reviewBody": "It was okay, but really oily. I followed the recipe exactly, but there was too much pesto sauce. If I make again, I would cut back the amount of wine and pesto sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick King"
},
"reviewBody": "It was delicious... I love this app and all the recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ellen Thawley Bradshaw"
},
"reviewBody": "Easy good and fairly quick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "Really like this recipe. With some crusty bread it's a very hardy meal. Did substitute frozen spinach, thawed then squeezed in place of fresh. Added as instructed but didn't cover and cook as instructed. Awesome dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy Pettinger"
},
"reviewBody": "I would like to find a way to make this a bit less salty. It was delicious but salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cooking Daddy"
},
"reviewBody": "As is, the recipe has a little too much sauce and sausage for the amount of tortellini. I think the next time we make this, we'll increase the amount of tortellini. I really liked the pesto flavoring rather than going with the usual tomato sauce base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngieV"
},
"reviewBody": "TURNED OUT GREAT! i used a 6oz of pesto and i didn’t use wine. i also added grape tomatoes :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alli"
},
"reviewBody": "Excellent recipe!!! You KNOW it’s good when your kids keep coming back for more. Served with homemade hot French bread. Super easy and so much flavor!!!! If your wondering if you should make it,....yes yes and YES!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darknlovely"
},
"reviewBody": "It turned out great and I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I added a very large chopped red pepper and a full pound of Italian sausage since that was what came in the package."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Malone"
},
"reviewBody": "Excellent simple to prepare what a great dish you will enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "healthyeater"
},
"reviewBody": "What a great combination. I followed the recipe exactly but changed only the amount of pesto sauce. I used 3 tbsp of fresh pesto Genovese rather than the curious amount in the recipe. This will be added to our household recipe repertoire. Thanks for a tortellini, spinach and sausage recipe without tomatoes and cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denice Stephen"
},
"reviewBody": "Amazing"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/273255/italian-sausage-tortellini/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/672/meat-and-poultry/pork/sausage/",
"name": "Sausage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/273255/italian-sausage-tortellini/",
"name": "Italian Sausage Tortellini"
}
}
]
}
}
, "about": [
]
}
]