				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Italian Cream Cheese and Ricotta Cheesecake"
,"datePublished": "2020-06-18T23:33:18.000-04:00"
,"dateModified": "2022-05-31T12:28:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "April Caudle"
,"url": "https://www.allrecipes.com/cook/2619670"
}
]
,"description": "This creamy ricotta cheesecake is an authentic Italian recipe handed down through generations that your family — Italian or not — is sure to enjoy!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ia3BpB72Iupco6Xsq9bkOY2-G9A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/403548-31849bcc16f044a0a9cbaced9ec4cae9.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5379562671001",
"description": "Delectable, classic Italian creamy cheesecake.",
"duration": "PT50S",
"name": "Italian Cream Cheese and Ricotta Cheesecake",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ed706e14-918d-4f4d-90cf-9f79be503f4b/ab2b7418-f76c-4910-9a06-02af3970f5d0/960x540/match/image.jpg",
"uploadDate": "2021-07-05T11:54:47.692-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Italian Cream Cheese and Ricotta Cheesecake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "550"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "704 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "228 mg"
,"fiberContent": "0 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "31 g"
,"sodiumContent": "384 mg"
,"sugarContent": "38 g"
,"fatContent": "50 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 (8 ounce) packages cream cheese, softened",
"1 (16 ounce) container ricotta cheese",
"4 large eggs",
"1.5 cups white sugar",
"0.5 cup butter, melted and cooled",
"3 tablespoons flour",
"3 tablespoons cornstarch",
"1 tablespoon lemon juice",
"1 teaspoon vanilla extract",
"1 pint sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan."
} ,{
"@type": "HowToStep"
,"text": "Mix cream cheese and ricotta cheese together in a mixing bowl until well combined. Add eggs, sugar, butter, flour, cornstarch, lemon juice, and vanilla; mix to combine. Stir in sour cream and pour into the prepared pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ia3BpB72Iupco6Xsq9bkOY2-G9A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/403548-31849bcc16f044a0a9cbaced9ec4cae9.jpg"
}
]
,"text": "Bake in the preheated oven for 1 hour. Turn the oven off; allow cheesecake to cool in the oven with the door closed for 1 hour more to prevent cracking. Cool cheesecake completely in the refrigerator before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT375M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "This is the best cheesecake I have ever made. I substituted gluten free flour for the regular flour and I soften the cream cheese in the microwave to avoid it being lumpy. Everyone loved it and wanted the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this cheesecake. I have made this many times. Always get a ton of rave reviews from my guests. The texture makes it lighter and tastier than a New York cheesecake. I typically cook it in a water bath and have had no issue with cracks. I also make a fresh strawberry topping for it. Beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara J. Wilhelm"
},
"reviewBody": "This recipe is excellent. The only things that I do differently is creaming the cream cheese and adding the sugar together, so there are no lumps. I also added 1 tablespoon of vanilla along with the tablespoon of fresh lemon juice. I put water in a pan and put the wrapped cheesecake pan in it to help keep it from cracking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shubb"
},
"reviewBody": "I made this with a few modifications per the reviews I read. I added a third package of cream cheese and cut the sour cream down to 8 ounces. I increased the sugar to a little over 2 cups and it still wasn't overly sweet, just right. I tripled the vanilla. I squeezed the juice from a whole lemon. Zested it too and put that in the batter. I made a crust from cinnamon graham crackers, butter and sugar. I cooked it at 300 for 70 minutes in a water bath and then turned the oven off and left it in for 3 hours but it still cracked. Next time I'll put a pan of water on the lower shelf...much easier....and cook it less. The topping was fresh blueberries with wild blueberry preserves nuked until runny. Took it into work and more than 1 person said it was the best cheesecake they'd ever had in their life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracie"
},
"reviewBody": "This is a nice fluffy cheesecake! We have made it a few times &amp; each time it turns out perfect. The texture was excellent! This time we will use caramel topping with chocolate shavings! Thanks, Tracie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "Great cheese cake!! This cheese cake was better than the ones I purchase at Juniors in Brooklyn and D’aiuto on 8th Ave. in NYP. I used this recipe but baked it at 330 for one hour in a springform pan wrapped in foil then placed in a pan of 1\" hot water then I let it rest in oven for two hours, no cracks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliana Juju"
},
"reviewBody": "This recipe makes absolutely scrumptious cheesecake!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vingraffia"
},
"reviewBody": "I did no lemon. Wife says it’s the best Ricotta cheesecake she’s has ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made it several times it’s always a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "a very unique and odd cheesecake... this needed quite a bit of help, i tripled the vanilla and added another 3/4 cups of sugar (i don't like them super sweet but this was ridiculously unsweet) i also added lemon zest. the flour and cornstarch seem excessive but i didn't change them, next time i will halve their amount and just add an extra egg i think. it also makes a huge amount of filling, i baked mine in a large cake pan after all and it worked well. i also added a simple sour cream and lemon zest topping since it was rather plain without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VALLIGIRL"
},
"reviewBody": "Tasted okay, but has a weird, dry, almost grainy texture. Needs to be a bit sweeter for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "This is, hands down, best cheesecake I've ever had. I followed the suggestions to wrap bottom of springform in aluminum foil and put into boiling water bath in large roaster pan. Baked at 325 for 90 minutes, then left in oven for 3 more hours with oven off. Cooled on countertop for another 2 hours before putting into fridge overnight. When I ran short of sour cream I substituted the remainder with vanilla yogurt. Worked well. Upon serving, I topped with berry jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used the poster's tweeks, a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this recipe exactly as it should be. Got nothing but wonderful comments about it. I was even told by an Italian that this is the best cheesecake they have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Eliseo Pinou"
},
"reviewBody": "This is my go to cheesecake recipe, EVERYONE LOVES IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Churgai"
},
"reviewBody": "OMG! The best cheesecake I ever made. I didn’t have a springform pan so I baked it in a deep 9 x 13 inch pan and it came out perfect. I buttered the pan on the bottom, covered the bottom of the pan with parchment paper, and brushed the top of the parchment with butter. I cut the cheesecake up after it cooled and it keeps well in the freezer. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dandeelion26"
},
"reviewBody": "LOVED this recipe. I subbed the sour cream for 2% fage greek yogurt (as I usually do with any receipt calling for sour cream) and it was perfect. I added the water bath as most people suggested My first cheesecake ever and not a crack! I was very impressed with it and enjoyed it more then most restaurant or bakery cheesecakes. I did make my own crust with graham crackers, brown sugar and walnuts. Deff recommend. I am interested in substituting cream cheese with mascarpone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hstqzxc6bt"
},
"reviewBody": "I made this yesterday and following some of the other reviews, left it overnight. Just had my first slice and loved it. \n\nI made no changes other than I had no lemon juice. I put a water pan below but it still cracked. I left it in the oven for the hour after I turned off the oven.\n\nI’m planning on adding a fresh strawberry glaze topping. Tonight I just had a slice.\n\nThis is a keeper. For me it had the perfect consistency and the flavor was exactly what I expected.. \n\nThanks April!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "This is the best cheesecake I've ever had, hands down. And incredibly easy to make -- no electic mixers needed or water baths in oven. Only change I made was to add a teaspoon each of lemon and orange zest. Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loki Robles"
},
"reviewBody": "Thank you ! I’ve made for my family , we love it ! Office Cleaning Companies Denver"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "manoutoftime"
},
"reviewBody": "This is my first time using ricotta in a cheesecake recipe. I followed the recipe, save for 3 changes: 1) I dissolved the cornstarch in a few drops of water before incorporating it into the batter, 2) I cut the recipe by half and used a 7” springform and 3) I wrapped the bottom of the springform in foil and sat in a bain-marie, in about a half inch of water. It came out perfect- light and creamy and no cracks. I’m accustomed to my cheesecake having a crust but didn’t miss it here, except when serving - without a crust, the cake adhered to the bottom of the pan. My finicky boyfriend inhaled two big slices before I could stop him, so I’ll be making this again soon. This is a solid, no-fuss recipe for what can be a tricky dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "(R.H.P)"
},
"reviewBody": "your grandmother should be nominated for sainthood. in fact if the Pope tasted this she'd be a shoe-in! This recipe is what it means to be alive. Let me preempt what I'm about to say with, I hate it when people do this but... I changed a couple of things about the recipe because I used what I had on hand. I used lactose-free milk because that is what I drink, I used salted butter because that's what I had and I don't recall the recipe saying either or, and finally this is the kicker. I substituted amaretto flavor for the vanilla and oh Sweet Lord! I am in love with this recipe! It is so simple to put together. Not fussy or complicated. Simple ingredients. Minimal clean up. It's breathtaking when you take it out of the oven. The aroma is divine. The texture and taste are equally heavenly. Quite simply this has to be next to Godliness in my book. Bless your grandmother, you, and this cheesecake. Thank you for your contribution, I will cherish it for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Mark Schlendorf"
},
"reviewBody": "Didn’t have cornstarch. Used more flour 9 tablespoons. 2 tablespoons for each cornstarch plus 3 flour per directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ernest Richard Paran"
},
"reviewBody": "I really love this recipe. My grandmother did this the other day and it's very delicious. Thanks to you!! Tree Service Fort Collins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathryn Kelleher"
},
"reviewBody": "It did not completely set up was to soft I put all the ingredients in it Cooked for 1 hour and in oven for hour Very disappointing for Easter dessert"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMac"
},
"reviewBody": "Very good! We did not even miss the crust. Lighter and fluffier than a regular cheesecake probably due to the addition of the ricotta. I serve with strawberries. I cooked in a water bath and shut the oven off after 1 hour and left in the unopened oven for an additional 1 1/2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edju"
},
"reviewBody": "The ingredients in this recipe are a perfect combination to create this cheese cake. I and my wife completely enjoyed it. This was my first cheese cake, and I say it WAS easy enough. Worth the time and effort. Mmmmmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Higgins"
},
"reviewBody": "OMG Cheesecake I made tonight is one of the best, if not the best, cheesecake I've ever had. Found the recipe online and cut it in half. Just enough to bake in a graham cracker pie shell (with a little left over to put in a small custard dish)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Luciano"
},
"reviewBody": "I’ve made this cheesecake now three times. The first time I followed the recipe exactly. However after some comments from a pastry chef made a few edits. Only one 8 ounces of sour cream and added another 8 ounces of regatta. Double the lemon 2 tablespoons. You can either add gram cracker bottom or maybe Oreo cookies ?bottom choose your favorite bottom or no bottom?. Wrapped cheesecake spring board with foil completely around that no water could be entered. Place cake pan in a 2 inch baking pan with a half inch of water.??The oven set at 475 placed the cheesecake in for 15 minutes?. Turn iven down to 200 bake for an hour to an hour and 15 The cake should sway a little but not be watery... Close oven door turn off oven and leave for 3hours. ? refrigerate overnight and serve you best sauce or plain. ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich Kerr"
},
"reviewBody": "1st time making cheesecake, followed the recipe as directed, turned out better than expected.\nNext time may try rotating the pan half way through baking, 1 side got a bit dark.\nTasted great(IMHO), not too heavy textured or too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Wonderful texture &amp; easy to make. I halved the recipe for a regular pie size with a graham cracker crust. Baking instructions that worked for me: 40 minutes at 335 (convection mode), leave in oven after shutoff for an hour. (Any longer and the top cracks - I know from experience now :-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GalaxyX 4604"
},
"reviewBody": "The cheesecake was good but it said to mix the cream cheese and ricotta but the video beat them together so the recipe was kind of miss leading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "So easy and delicious, new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pcaruso"
},
"reviewBody": "It's a delicious recipe. My family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Calhoun"
},
"reviewBody": "Love it very good texture and the flavor was excellent I did use less sour cream and use a water bathi also use lemon zest for extra flavor the only problem I came into was taking it off the bottom cooking plate because I did use a crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joyce Poor"
},
"reviewBody": "Followed the recipe exactly was the worst cheesecake I have every tasted. No one in my household could eat it. A big waste of money and time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissie"
},
"reviewBody": "We’ve made this several times and love it! Definitely wrap your springform in TinFoil overhanging the top to keep it from getting too browned. We prefer to use a water bath to keep it from drying out and cracking. Simply put your springform on a baking sheet and put about a 1/2” of water in it. Keeps the temperature regulated and maintains moisture in your oven so you don’t dry out your cake. Works everytime!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktbakescakes"
},
"reviewBody": "This is also my grandmas recipe except for one slight change. I made it with a berry coulis. My boyfriend was so happy with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PSALTERY LADY"
},
"reviewBody": "Easy and quickly made. Wonderful hint of lemon flavor with a creamy texture. Would defiantly make again.\nRecipe did not call for baking in a waterbath and the top cracked. Next time I will bake as I normally bake my cheesecake Cover bottom and up sides of the pan with a sheet of foil and place in large pan of hot water in the center of preheated oven, continue with baking instructions. Should solve the problem. Or just cover crack with a pretty topping. Crack did not effect taste just presentation. \nUse cold ricotta for a smoother texture. Room temp ricotta tends to be a bit more curd like when cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael"
},
"reviewBody": "The best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nwhite949"
},
"reviewBody": "Husband was looking for a recipe to make that tasted just like the bakery he used to to go in Italy every day just for ricotta cheesecake. This was IT! Easy recipe, would not substitute anything and follow the directions and it comes out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerseygirl"
},
"reviewBody": "I’ve made this multiple times. Always a big hit. Always cracked on top, but not as much if I wrapped the springform pan in aluminum foil and sat it in a roasting pan with water half way up the sides. Top it with fruit and no one can see the splits!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Fozard"
},
"reviewBody": "Delicious! Creamy, fluffy, great flavor and texture! Like other reviews, mine did crack in the middle — even lowering the temperature to 325, leaving in the oven, then counter, and finally refrigerated overnight! Served with fresh strawberries, macerated! Yum! Didn’t last past 1 day. My grandson’s request for his birthday cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMM"
},
"reviewBody": "Great recipe! Ive made this recipe 2 times so far. The first time I followed it exactly. The second time I made adjustments. I did like it best when baking in a water bath wrapped in foil (Like someone else recommended) &amp; turned the heat down to 325 after about 20 mins, baked longer till set, then left it in the oven at least 1 hr after turning off. I reduced sugar to 1 cup &amp; added lemon zest. It was light, fluffy &amp; creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "I was thrilled it turned out so well for my first ever cheesecake. I loved the texture and friends said I should keep this for a favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crimsonflames"
},
"reviewBody": "One thing I should share is that I have found baking it for 80 mins works best.\nPeanut butter chocolate chip!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hettie Andrighetto"
},
"reviewBody": "I made it as the recipe says but halved it. I also used natural greek yoghurt instead of the sour cream, and as I didn't have cornflour, just used the extra as plain flour. I made a coulis to go with it, strawberry last time, and this time I will make a blueberry one. Delicious for our tastes, not too sweet and prefer without the biscuit crumb"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Avsec"
},
"reviewBody": "This turned out perfectly, although not lemony enough for my taste, so I topped it with lemon curd - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Anderson"
},
"reviewBody": "Made this (my first cheesecake ever!) for my son’s 21st birthday. It was awesome-light, fluffy and delicious. Love that it didn’t have a crust. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jujubee030"
},
"reviewBody": "This recipe was perfect even with a few tweaks I made, esp with the feature to halve the recipe. Only used just over 2/3 sugar it called for. For half the sour cream, I used 2% Greek yogurt. Used Neufchâtel cheese as well. Baked in giant muffin tins, and filled about 7 of them. Baked for about 20 min and left in oven for about 20-30 min. They turned out great as individual sized cheesecakes. Curious to try half the sugar using a sugar substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Salecich"
},
"reviewBody": "I followed Holly's tips. I used replaced 1 x light cream cheese and 500 mls light sour cream. Added grated lemon rind. Baked for 1 hour in bay maree style with 1 inch water at the side of dish. After 1 hour did not open oven door for 3 hours. My cake came out perfect. No cracks, light and fluffy not too sweet. Will make again for extended family after we are out of isolation. Thank you Chris"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dj1234"
},
"reviewBody": "I have made this about a dozen times. I always forget to add near boiling water so at 1 hr it’s undercooked so when I remember I either add boiling water to the pan or just take it out at an hr and cook for extra 45 min. Yes that can make cracks but I just cover it with whipped cream! I use 1/4 cup less of sugar as well. don’t over mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tabishop"
},
"reviewBody": "Pretty much followed the recipe except that I made a basic graham cracker crust for it. I also had a large crack and I will try Dan le Chef's suggestion of baking it on 475 for 10 min then 200 for 1 hour then 3 hourts cooling in the oven. This is a delicious cheesecake. I will probably add some Gran Marnier the next time I make it. to give it a bit of a citrus lift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DawnJalink"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Mazur Paghi"
},
"reviewBody": "light and flavorful..... very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale"
},
"reviewBody": "I've made this a few times and it always comes out great. As others have said, I wrap the pan in tinfoil and bake it in a bath to prevent cracking. I cooked it at 325 for 2 hours and left it in the oven for 3 hours, then on the countertop for a few more, then the fridge - always tastes perfect the next day! Love it, thanks for sharing :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl Sadlowski"
},
"reviewBody": "I AM NOT A BAKER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwen W"
},
"reviewBody": "For Valentine's day I decided to make this for my family for dessert. I love cheese cake, this was the best I ever had. The recipe was easy to follow. The cake itself was smooth and silky. I will definitely make this again.\n\nNOTE: The directions say to bake for one hour, turn off the oven and leave the cheese cake in the oven for one more hour. I have a gas stove. After I baked my cake for one hour at 350°, I turned my oven to 150° (it's as low as it would go) for one hour and let my cheese cake finish baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "homestead mom of 7"
},
"reviewBody": "It overflowed my springform pan during baking. Should have used my taller 3-1/2\" springform instead of my shorter 2-3/4\" springform. It's in the refrigerator now. Will taste tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NYCAVA58"
},
"reviewBody": "Amazing - and my son loved it too! I used Greek yogurt cream cheese and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nora Victorino"
},
"reviewBody": "I didn't change nothing, but it took more time in the oven than a hour. But it came soo delicious that I will do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nico Vescovi"
},
"reviewBody": "Very tasty! I used a shortbread cookie crust that complimented the cake perfectly. Water bath method recommended to avoid cracks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Cook"
},
"reviewBody": "Made it twice because I made a few errors on the first one! Second one came out GREAT! I topped it with blueberry pie filling and everyone went nuts over it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "backinVa"
},
"reviewBody": "Love this cheese cake. It's light, it's easy to make, it doesn't take a ton of ingredients, and it taste wonderful. I usually make a fruit topping, but next I'm going to try a lemon custard type topping. I'm still working on getting the bake time down right since the one hour called for doesn't fully bake it in my oven. First time I baked it just as the recipe calls for, one hr bake time, then turn off oven and leave in oven for another oven without opening the oven door. Problem with that is, if it's under cooked, you don't know until after that second hour. So, start early in the day in case you have to reheat the oven, bake an additional 20 to 30 mins, leave again for another hour, then wait for it to cool before putting it in the fridge. That is unless someone can say, with confidence, that you don't need that extra hour in the oven the second time around. Putting in some extra effort to prefect the timing on this one is well worth it. The taste and texture is to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babsnotbarb"
},
"reviewBody": "This is the best cheesecake! So simple to make and with a topping of fruit, sensational! I used golden kiwis and everyone loved it. Made it twice now, second time with peaches. I used a 10x 3 spring-orm pan. It rose well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Haliczer"
},
"reviewBody": "I will make this again! Made a substitution. I used Philly cream cheese SPREAD instead of the \"bricks.\" It worked but made more batter than I expected - we ate every bit of it! Don't over bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lvanderzee"
},
"reviewBody": "Yes will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ctctt"
},
"reviewBody": "Super creamy &amp; light in texture! I added 3 packages of cream cheese along with the ricotta and sour cream plus a bit of lemon zest. I also added a graham cracker crust. I'm giving it 4 stars because of the bake time/temperature. Cracks all over the place, but excellent in the creamy texture and light lemon flavor. No.topping needed. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curtis Diamond"
},
"reviewBody": "Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Fontaine"
},
"reviewBody": "I made this exactly as the recipe stated and it was the most delicious cheesecake I have ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant Hansen"
},
"reviewBody": "Super easy, and delicious! Going to make it again and dust Oreo chunks on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Reed"
},
"reviewBody": "Simply amazing! I make it a few times a year and everyone loves it:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josh Brown"
},
"reviewBody": "This is the BEST cheesecake I have ever had! It was lighter &amp; fluffier than all cream cheese. And no crust needed. It is my new go to recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Pozzuoli"
},
"reviewBody": "I can’t believe I found this recipe on all recipes! My grandmothers been making this cheesecake since she cut it out of the New York Times in the 1920s. This is by far the best cheesecake. The only thing she did differently was that she added the ingredients one at a time in a specific order and beat it way longer than you think you would need to this turned into a really light cheesecake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Paul You"
},
"reviewBody": "I am OK with texture, but the taste is very bland...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeez65"
},
"reviewBody": "I made this amazing cheesecake for my family. It was a hit! I changed one thing, and one thing only- I substituted the sugar for Monk fruit sweetener that I got at Costco. Easy and yummy :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Cifone DeVuono"
},
"reviewBody": "My family has made this for years. Just a few different things we do.... All ingredients are at room temp! We add the eggs last and don't over mix. Over mixing can cause cracks. We then place it on a baking sheet filled with water. After baking for one hour, we turn the oven off and crack the oven open laying a towel over the open oven door. We leave in for minimum of 1 hr. Then place on cooling rack for hr, then in the fridge for 4 hrs. Though, who really cares about cracks...its just an excuse to add strawberries, blueberries, cherries etc. Lol! This has always been a hit wherever we take it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Barnes"
},
"reviewBody": "This was fantastic! I read the other reviews and did use the water-bath under the cake pan. Did the lower temp too as suggested by many to 325 and found after the 1st hour was up the cake had not even tanned one bit so I turned heat to 350 and gave it 10 more min. then shut off and let stay in another hour. No cracks in my cake either, do not open the oven to check on it at anytime. That may solve folks with their cake cracking. FOLLOW the recipe don't substitute for cheaper, less fat etc. ingredients , make sure cheeses and eggs are a room temp before you start. \nI will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aunt wobin"
},
"reviewBody": "This is the only cheesecake recipe I use now and it is good exactly as written. I wrap and freeze individual slices for later when I make it for just the two of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alynn1976"
},
"reviewBody": "1st time followed exactly. I make different cheesecakes about once a month but had never tried ricotta.\nI could taste the flour &amp; cornstarch. \nAlso it cracked even with a water bath. Thats bc of overbeating the eggs.\nSo 2nd time.\nI replaced the sour cream with greek yogurt. Replaced butter with heavy cream. No flour or cornstarch usex 3 whole eggs 2 egg yolks. And half confectioners sugar half white sugar.\nAdd eggs last. Ive baked a cheesecake in a 350°F oven for 1 hour no water bath &amp; if i add the eggs last it doesnt crack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muffy"
},
"reviewBody": "Absolutely fabulous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ange"
},
"reviewBody": "This was exactly the texture of cheesecake that I wanted. Light and fluffy, but maintains the perfect amount of richness. Tastes amazing alone or with the additional of fruit on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "A good, basic recipe that works wonderfully with any topping or none at all. I thought the temperature would be too high and create cracks, so I baked it at 425 for 10 minutes and then knocked it down to 225 until done. No cracks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Followed the directions exactly, except: Wrapped outside of pan with foil. Put 9x13 pan of hot water on rack underneath cake. Cooled in oven 3 hours. Did not crack. So easy and so very delicious! Will make it again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Pace-Maron"
},
"reviewBody": "Made it!! Tasted amazing, developed a giant crack in the middle, followed the instructions with the exception of adding strawberries. This is my very first cheesecake but I'm pretty clueless how to fix it but I will continue to experiment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzz"
},
"reviewBody": "I'm new at scratch cheesecake, but I had ricotta leftover and didn't want it to go bad so a search brought me to this recipe. I read all the reviews to get extra tips and added my own flare. Best cheesecake ever! I used vanilla bean paste, as it's the only way to go. I didn't have lemon so I used the zest and juice of a whole orange. I used chocolate Graham cracker crust as that's all I had in the cupboard. (orange and chocolate are a wonderful pair). I did a water bath on 325° for 70 minutes, left in in the oven for 2.5 hours, cooled on counter 1 hour and refrigerator over night. The orange flavor is amazing, and I didn't think I would like the chocolate crust, but it's wonderful with orange creaminess of this magnificent cheesecake. High five"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Subocz"
},
"reviewBody": "It came out great! And was my first attempt at a cheesecake EVER. I followed the suggestions posted by Dawn as well, as far as temps, times, and the water bath. Not one crack and nothing but compliments! About to make it for a second time now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Deyns Zerilli"
},
"reviewBody": "I have never gotten so much praise for anything I made like I do for this cheesecake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd"
},
"reviewBody": "I am from philly originally and have made many different styles of cheesecake and this is by far the closest rendition of an East Coast cheesecake that I have run across this is fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Porter"
},
"reviewBody": "it did develop a small crack while cooling but it was so creamy &amp; delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell Barron"
},
"reviewBody": "needed to use waterbath, first one was ugly and cracked, used waterbath on second attempt, turned out prettier, tasted the same. Did notice that if i aged it in the ice box for 3 days it really brought the flavor out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karens66"
},
"reviewBody": "My grandson and and I made this, he gave it a thumbs up and so did everyone else that I shared it with. It's been my favorite cheesecake recipe I have made...... I have made several.\nI LOVED IT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Marie"
},
"reviewBody": "I made it exactly as the recipe stated. It was FANTASTIC but high in carbs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "I’m half Italian, and always wanted to try making a ricotta cheesecake. This one tastes just like my grandmothers.\nIt was a big hit. Everyone loved it.\nVery easy to make, I didn’t change anything.\nI will be making it again in a month!\nThanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeeBait"
},
"reviewBody": "It was too much batter for the 9\" springform pan. I ended up using the 9\" springform and two 6\" cakepans, (I lined the bottom of them with parchment paper) and baked in a waterbath. But it was sooo good! I will make this again. I gave away the 6\" cakes to two different neighbors, and they really enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was too much batter for the 9\" springform pan. I ended up using the 9\" springform and two 6\" cakepans, (I lined the bottom of them with parchment paper) and baked in a waterbath. But it was sooo good! I will make this again. I gave away the 6\" cakes to two different neighbors, and they really enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teddykpitts"
},
"reviewBody": "Just amazing. needs no topping but easily soaks up whatever you might use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plyshaw R"
},
"reviewBody": "Fantastic cheesecake - made as directed. The dry texture from the ricotta and cream cheese is perfect. Much better than the New York creamy style IMHO. I did use a cookie sheet with a few ounces of water and it came out with no cracks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Awong"
},
"reviewBody": "This recipe was easier than my go-to recipe. I needed a recipe that could convert to keto friendly which I did with Konjac gum for the cornstarch, artificial sugar, and almond flour (used conversion charts online). Tasted delicious! My attempt at a keto crust was a fail though, so next time will make this crustless. I used parchment paper underneath to help lift from my springform pan. Thanks for the awesome recipe. Next time I'm going to make as written for me and my hubby (but I already know it will be fantastic!!)."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/154297/italian-cream-cheese-and-ricotta-cheesecake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
"name": "Cheesecake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/154297/italian-cream-cheese-and-ricotta-cheesecake/",
"name": "Italian Cream Cheese and Ricotta Cheesecake"
}
}
]
}
}
, "about": [
]
}
]