				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Italian Biscotti"
,"datePublished": "1999-08-19T22:10:02.000-04:00"
,"dateModified": "2022-08-08T11:37:57.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Bernie"
,"url": "https://www.allrecipes.com/cook/24321460"
}
]
,"description": "A traditional biscotti recipe. Great for dunking in coffee or tea."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_lMnxzDSMdeFX4JfZzrHTF2R298=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/394274-3df82b3e92be4d409be88aa7c5ddefa9.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Italian Biscotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "218"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "275 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "61 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "150 mg"
,"sugarContent": "12 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"12 ounces butter",
"1.75 cups white sugar",
"6 eggs",
"1 teaspoon anise extract",
"2 teaspoons vanilla extract",
"6 cups all-purpose flour",
"0.5 teaspoon salt",
"2 teaspoons baking powder",
"8 ounces chopped almonds" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F ( 165 degrees C )."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream the butter and sugar together. Add eggs one at a time; beat until fluffy. Stir in the anise and vanilla extracts. Sift together the flour, baking powder, and salt; Add them to the egg mixture along with the chopped almonds. Stir with a spoon and as the dough comes together, Knead by hand."
} ,{
"@type": "HowToStep"
,"text": "Divide the dough into 4 parts. Roll each piece into a log about 15 inches long. Place logs onto cookie sheets, 2 to a sheet, the long way. Flatten the logs out until they are about 3 inches wide with a slight hump going down the middle. Bake for 25 to 30 minutes in the preheated oven, loaves should be firm. Cut the loaves into diagonal slices 1/2 inch wide, place the slices onto the cookie sheets and return to the oven. Toast on one side, then turn them over to do the other side. This will take about 7 to 10 minutes."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very Easy. ! I halved the batch... Will drizzle something on it for Easter Treats !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa in Phoenix"
},
"reviewBody": "Biscottis have always been such a mystery to me so I had no idea that they were so easy to make! I cheated and used my kitchen aid mixer instead of kneading by hand. I cut the recipe in half because I didn’t want to waste so many ingredients if they didn’t turn out. Boy was I sorry. We ate the 40 pieces in two days. I made as directed but they didn’t seem done enough after the last 10 min so I turned the oven off and let them sit in the oven another 15 min. The color and consistency was perfect. The only thing I will do differently next time (besides make the full recipe) will be to double or possibly triple the anise extract because that flavor didn’t come through as much as I hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elizabethOJ"
},
"reviewBody": "Absolutely one of my favorite recipes! I make it multiple times a year. I usually use almond extract instead of anise extract because my kids like it better. I have also traded out 1/2 cup of flour for cocoa powder (sifted) to make chocolate, added cranberries, swapped out different types of nuts, and dipped in chocolate. The best!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis"
},
"reviewBody": "I love this recipe. I did make a small change. I substituted cherry juice for the anise extract because I didn’t have any anise and added 1/2 cup of chopped cherries. Awesome taste and easy to chew. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amelia earhart"
},
"reviewBody": "I made this recipe exactly by the recipe and love it! I have also experimented with versions depending on what I have in the pantry. Today I used pecans with vanilla and maple flavorings. I came out great taste wise. I think I over kneaded the dough because it came out with lots of separations that are likely to become crumbly. Also, I usually baste with an egg wash before baking. This time I used the entire egg instead of just egg white. I won’t do that again. The wash looks very yellow &amp; didn’t look completely cooked on top —like the yellow wash still looked “wet,” even though I kept putting the biscotti back in the oven &amp; raising the grill closer to the top of the oven. It tastes good, I was just disappointed in the presentation though, &amp; I made it to give away. Live &amp; learn! Good base recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheZCook"
},
"reviewBody": "Just ...YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rain68"
},
"reviewBody": "This is a wonderful Biscottis recipe. I love a basic recipe that you can add your own add-ons, nuts, chocolate chips, drizzle chocolate on them. When you have a perfect Biscotti recipe, there are no limits to what you can do with it. Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLa"
},
"reviewBody": "I have had compliments on this recipe. The only thing I do different is 2 teaspoons of anise and 1 vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie CAL"
},
"reviewBody": "Good recipe and easy to change flavors. If you cannot find anise extract, you can use anisette liquor. It is not as intensely anise flavored, so, I double the amount when I substitute The alcohol burns/evaporates off during the baking time. The flavor is the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dinah"
},
"reviewBody": "Made as submitted and enjoyed it as did my guests!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nakesha"
},
"reviewBody": "Easy and delicious. I would suggest replacing some of the flour with cornmeal for texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy and delicious. I would suggest replacing some of the flour with cornmeal for texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Chambers"
},
"reviewBody": "I've made these several times. I always substitute the almonds for walnuts and use a Tbls of anise. The kneading is kind of tedious. I flour the counter top the top of the dough and my hands and keep repeating until the dough comes together, it works great and my Italian family loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Abraham-Ross"
},
"reviewBody": "Fabulous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Weisgerber"
},
"reviewBody": "Love this recipe, easy and very traditional"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuniorChef"
},
"reviewBody": "This is an amazing recipe! I didn't toast mine for as long as recommended on each side, only about 3 minutes. They were perfect to eat all by themselves! Kind of in between normal, dry biscotti, and a cookie: perfect! I took others' advice and floured my hands before kneading and that made it so much easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LJ Langston"
},
"reviewBody": "I love biscotti, especially around the holidays. But working the holidays all biscotti was gone when I had time to get some. This year is different. I have time, so I made it; first try.\nThis recipe is very easy. I used all the ingredients, but cut the batch in half; too simple. \nA word of caution. The dough is a little sticky when it comes to kneading time. Lightly flour your hands, your working surface, and slow add sprinkles of flour as you knead, and work it slowly.\nI went 5 minutes longer than max cooking time (35mn). Cut the biscotti with a serrated bread knife. Put it back in the oven to toast, upright not on side, and baked for 12mn.\nMaking half batch I got twenty respectable biscotti from two loaves.\nI would do this again, with a little embellish (pine nuts, hazel nuts, dry fruit, etc.)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "I made these as per the recipe and they came out wonderful . Just make sure you kneed it really good because they will break on you if you don't ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Rollings"
},
"reviewBody": "I used mixed nuts instead of just Almonds and it turned out delicious. Great with the affogato..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rob Wolff"
},
"reviewBody": "Tasteless Changed it by using butter flavor crisco and butter. No nuts and almond in the place of anise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaylyn"
},
"reviewBody": "I love this recipe so much better than others I've tried before. Just the right texture and flavor. It is versatile enough to add whatever nuts and dried fruits you may have. I didn't change anything in the recipe. I mixed everything in the mixer and let the machine do its job. I divided it into 3 instead of 4 as I find it too small for my liking. It's also very sticky if you knead it by hand and you would end adding too much flour if you do. So let the machine do its work if you have one and then once you split them into 3 (in the bowl) take one of them at a time in your floured surface to form it more into a SMALL log/ball (note: it's too soft to work with it so I'm doing it this way)then move it to your cookie sheet and form you log and flatten it there. \n\nCooking time is a bit longer for me I guess depending in your oven. I used a pizza slicer to slice them up but I don't slice them through and through. I leave about 1/4 inch as they tend to break so I start on the other end to finish the slice. It says 7-10 min to toast them some more once you've sliced them but this may be true for one side only then another 7-10 mins when you flip them. \n\nI hope I made some sense ;)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie Walker"
},
"reviewBody": "Flavor &amp; taste was great, however texture was much softer than traditional biscotti should be. I followed instructions exactly (cooking 3x) and they never got hard/crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurtin2472"
},
"reviewBody": "Wonderful! The only change I make is to leave out the nuts as we have a nut allergy in my house. Have used various glazes/frosting etc and they always turn out well. Our favorite is to drizzle with melted white chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather C"
},
"reviewBody": "This is the first time I've made biscotti and they didn't break. It's a delicately flavored cookie and not too sweet. I used almond extract in place of the anise since I didn't have it. These would be great with a chocolate drizzle. They're delicious and worthy of making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlejediprincess"
},
"reviewBody": "Just finished baking and OMG the biscotti are delicious! The dough was sticky to work with so I spread out some flour on the table and kneaded it which made it easier to handle before baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ettore "
},
"reviewBody": "The best recipe I found by far?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ricekake"
},
"reviewBody": "Easy recipe - it worked out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "The best biscotti recipe I've made. Dip one side chocolate w/holiday sprinkles......A+"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Shugan"
},
"reviewBody": "I Love Love Love this recipe.. so easy.... I used toasted Hazelnuts, Chocolate chips and ground Hazelnuts to the tune of about a cup and a half all together.. They are perfect.. Everyone loves them. Even the Italian in laws. hahahah. Fantastic doe. So silky and easy to handle. Thank you very much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryKirsch"
},
"reviewBody": "Made it for the holidays. Decorated with dark choc drizzle and crushed pecans. Super recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Jo Finney"
},
"reviewBody": "Love love love this recipe! Received so many compliments &amp; requests for this recipe. Working on a 2nd batch tonight! First batch was gone in 2 hours. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Hall"
},
"reviewBody": "My daughter chose to make this for extra credit for her living skills class. I was hesitant because I am not a good \"bread\" maker. This recipe was so easy to follow and it came out tasting amazing. She was so excited to get to take this to school and have her classmates try it. And we were glad that she made too much so that we could enjoy it with our cocoa/coffee this morning. Well written and turned out fabulous. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BETTYH88"
},
"reviewBody": "I made these as Christmas gifts several years ago, and people still are talking about it! These rival the pricey ones you get in the coffee shops. Along with the Peppermint and Brownie Biscotti from this site also, made for beautiful gifts that were very enthusiastically received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "imackie"
},
"reviewBody": "Very good recepie, however, not enough flavour. Need more of anise, maybe double."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "keff"
},
"reviewBody": "Great taste, in my oven I had to add 10 minutes to get it right, but in all the flavor is right on the nose.\nThanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "creativeinthekitchen"
},
"reviewBody": "I cut the recipe in half, but followed it with all the ingredients as listed. I'm not a big anise fan, but the flavor is not overwhelming and helps to create a very authentic biscotti. I did use my stand mixer instead of kneading by hand. The cook times were a bit long, even for the smaller versions I made, so they might go long for the standard size biscotti. I will make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Mihalik Rossi"
},
"reviewBody": "Very good recipe. For all of you new biscotti bakers who are having problems with sticky unworkable dough... you MUST refrigerate the dough after making it for at least 2-3 hours so that it is workable and so it bakes properly. I have been making these for 30 years and was taught to make these by a lovely Italian immigrant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jojie Valera"
},
"reviewBody": "It's just the right sweetness . . . men love it . ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michaela Gocnikova"
},
"reviewBody": "Brilliant recipe everyone loves them! I added some bits to it too tho... small bag of revels and maltesers and some dried fruit and pecan nuts.. yummy!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M.J."
},
"reviewBody": "First time making it and it was a great sucess. I like the taste of anise in recipe and I added almonds and cranberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fynrn"
},
"reviewBody": "really great recipe that I will use again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emsemmie"
},
"reviewBody": "I substituted for almond extract instead and didn't mix in the almonds.. next time I think i will though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica-in-Colorado"
},
"reviewBody": "These were a big hit with my family for Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lurkin1"
},
"reviewBody": "This is an amazing recipe and easy. I used vanilla extract only and finely chopped walnuts. I mixed it in a Bosch so it was well kneaded. The biscuits cut smoothly and didn't crumble when transferred to the baking sheet. Toasted to a light brown. Dipped bottoms of cookies in melted semi sweet chocolate chips. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lore"
},
"reviewBody": "this is the best biscotti - I made it dozens of times with variations on extract flavors, different types of nuts, dried cranberry or other dried fruits, chocolate chips, etc. Everyone loves it -including all my Italian friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzy Woman"
},
"reviewBody": "This was dynamite! The first time I made them, I did a double batch &amp; sent some to my friend in AZ. She loved them &amp; she's a big holiday baker. Didn't have anise extract, but almond extract worked fine. Substituted Egg Beaters for some of the eggs to reduce cholesterol. My husband said it's his favorite biscotti from all the ones I've made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lguidara"
},
"reviewBody": "I have tried several biscotti recipes and this one is the best!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista Jones"
},
"reviewBody": "This is a fabulous recipe! This was my first Biscotti recipe and it was easy as pie :) My slight mod's were I swapped Almond extract inplace of Anise because my husband hates liquourice flavor, added some crushed walnuts because I was low on almonds, and added near a cup extra of flour due to sticky dough. One thing I realized during the cooking process...the 2nd half of the dough was left to sit while the first batch baked. After that the dough was not sticky and became very managable. Perhaps letting the dough sit for a bit before making the logs (still with the extra flour however) would help with the sticky problem. I dipped some tips in chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ItsJeanettic"
},
"reviewBody": "Really good recipe, didn't change a thing. Was a bit softer than I like my Biscotti, definately softer than my Nonna made-- but really tasty anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Seagraves Reker"
},
"reviewBody": "easy and great for gift giving at Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ijustmetmaria"
},
"reviewBody": "i have made biscotti according to this recipe several times now, and every time, people absolutely love it! they say it is the best food i've made yet. i have you to thank for that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MKers"
},
"reviewBody": "This biscotti was very tasty! I swapped the flour for a gluten free coconut baking mix, and while the biscotti was much more crumbly than it normally would be, it was still delicious. The recipe also made enough that I could share with my mom (who is begging me to make more)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "Not bad at all, I think dipping them in chocolate would make them even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "I've been making this base recipe for the past three years, usually for Christmas. This is an excellent recipe and I thank the author profusely for posting it...I've received many compliments! Because I don't care for anise, I use two tsp of almond extract in addition to the two tsp vanilla and, for varied flavor and texture, I've used toasted, finely-chopped walnuts. I also coat the bottoms with semi-sweet chocolate. A few hints...if you find it difficult to work with the dough, simply place between two sheets of waxed paper to roll/shape your logs. You can then simply drop it on to your parchment paper-lined cookie sheet. Also, melting chocolate on a dinner plate makes it very easy to sweep the bottom of the cookie with chocolate...simply place on waxed paper-lined cookie sheets and cool. When attending holiday parties, placing six of these biscotti in a decorated goody bag tied with a red ribbon makes a wonderful hostess gift. Also great to give to teachers, neighbors, postal carrier, etc. I simply adore this recipe. This recipe is simple, but if you're not familiar with working with biscotti, be patient. They are SO worth it!!! Enjoy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeanTexas"
},
"reviewBody": "So pretty, with a fine texture and gentle flavoring. Like other reviewers, I lined the baking sheets with parchment and swapped 1/3 of the flour for whole wheat. My resulting dough was too soft to knead, so I simply floured my hands and 'shaped' the loaves instead. Following more advice; I let the loaves stand for 5 minutes before slicing (it firmed them up a bit) and stood the slices up for the second baking (avoiding the need to flip each cookie). This is an outstanding recipe - Thank you for posting it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RBRADY"
},
"reviewBody": "Delicious biscotti, great recipe and directions. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marisullivan"
},
"reviewBody": "Made these tonight. One batch with craisins and another with mini morsels. Ran out of Anise so used orange extract - when it comes to Biscotti - Anise makes it truly better. The logs were really sticky so I had to use extra flour to knead the dough. Overall: these were really good typical Italian Biscotti - not too sweet nor to chewy. Will make these many times over but with Anise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margo"
},
"reviewBody": "After taking the loaves out of the oven, let them cool down for at least 15 minutes before cutting and after the final baking, turn the oven off and leave the cookies in the oven to completely cool, with the oven door ajar. This will make them nice and crispy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tetya"
},
"reviewBody": "pretty good, basic recipe. It was easy to manage the dough. It didnt spread much in oven. Next time will try to add something different like cranberries... Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bonniebear"
},
"reviewBody": "Awesome Biscottis!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeKayComo"
},
"reviewBody": "LOVE, LOVE, LOVE this recipe. I always make these for Christmas gifts. Here are my favorite variations: 1.Add pistachios and craisins to the dough and (after baking and completely cooling)dip bottoms in melted white chocolate. 2. Add pecans and grated orange peel and dip bottoms in melted dark chocolate. 3. Add sliced almonds and toasted coconut and dip bottoms in milk chocolate. I put two of each flavor in a clear cellophane bag and tie with a ribbon. Very Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo"
},
"reviewBody": "Excellent recipe. A little time consuming but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AliciaVR6"
},
"reviewBody": "Great and easy! I halved the recipe, and had to add an additional cup of flour (4c total) to be able to handle the dough with my hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeachBaker"
},
"reviewBody": "Excellent recipe! The butter makes it more tender than a traditional biscotti and I like the large batch it makes because they are gobbled up so fast around our house. Here's a tip if you don't like slicing the logs: My non-baker husband while trying to help me finish the task of slicing the baked logs picked up the metal spatula next to the pan, instead of walking over to get a knife and I thought for sure he was going to smash the cookies to crumbs but the spatula worked beautifully. It cuts cleaner than a knife, doesn't leave the crumbs a knife does and is easier to use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angeldae23"
},
"reviewBody": "So good! I made these for christmas gifts for my family. Everyone loved it! Nothing better than to dip in a nice cup of hot chocolate or yummy coffee!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LisaG"
},
"reviewBody": "Don't know what the problem was, but I had to add alot of extra flour because the dough was a sticky mess. Also, they never crisped up enough in the oven, even when I left them in way past the recommended cooking time. The flavor was excellent, but just too crumbly. I am hoping they will crisp up after a day or 2. Also, I used sliced almonds because that is what I am used to - I don't recommend that. Definitely stick with chopped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QUILTBUGJ"
},
"reviewBody": "I halved the recipe and brought them to a dinner picnic. They were a huge hit! I used all vanilla extract since I didn't have almond - but I'm going to have to get some! The dough was really sticky. I made another half batch today and decorated them with melted chocolate chips. A definite winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISTI"
},
"reviewBody": "Delicious and looks fabulous (looks professionally made) when drizzled with white chocolate. Decadent! Thanks for a great recipe! Followed the recipe as written (which was perfect), but can see how this would be very versatile, and I'll be trying it with new things!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1txncookn"
},
"reviewBody": "This recipe makes the BEST biscotti ever! I did substitute almond extract for the anise as some other reviewers suggested, and tried several variations such as half white and half brown sugar, added a couple drops of vanilla, added dried cranberries, added walnuts, added slivered almonds, tried dried bluberries, etc. A good basic recipe that you can play around with and make your own by what you add to it or the combinations you come up with. Also drizzled/dipped some pieces in chocolate and white chocolate. Excellent...thanks for submitting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "georgie"
},
"reviewBody": "Very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuLu"
},
"reviewBody": "I found this recipe this week and have already made them twice. This is by far one of the best biscotti recipes in my collection. After the first bake instead of laying them flat and baking a few minutes on both sides, I simply stand them up and just bake them again once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Kate"
},
"reviewBody": "great! didn't crumble and was raved about. simple and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "Wasted 6 eggs, 6 cups of flour and 3 sticks of butter! Recipe doesn't say to use parchment paper or to grease the cookie sheets. They were in the oven for around 10 minutes and the bottoms were burnt, my oven was smoking. What a disaster! Something in the recipe can't be right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindsayW"
},
"reviewBody": "I had never made biscotti before and tried this recipe for my first attempt... it came out so well! I followed the directions and ingredient list exactly with the exception of adding about half a bag of semi-sweet chocolate chips. Thanks to whoever suggested working with the dough with well-floured hands on a well-floured surface... that helped a LOT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marypim47"
},
"reviewBody": "Loved these cookies, couldn't stop eating them! Recipe is definitely a keeper! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "This was my first time making biscotti. This recipe was simple to put together, and is absolutely delicious! Even my husband (who hates biscotti)loved these! I didn't have anise flavoring or almonds, so I substituted pecans. I made a simple cinnamon glaze to drizzle over it. (1/2 cup confec. sugar, 1/2 tsp. cinnamon, 1 TBSP butter, 2 TBSP milk). Try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda J."
},
"reviewBody": "This was great! The texture is a little bit more tender than some teeth breaking biscotti I've had before, but I found it to be very pleasant. Can't wait to make this for gifts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shinny"
},
"reviewBody": "I love these! The very first kind of biscotti's I've ever made! They turned out great! Yummy! = D I made them for my dance class, and family, they loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanB"
},
"reviewBody": "Absolutely love this recipe so easy! I also melt chocolate almond bark and dip the flat side of them in the chocolate. HUGE HIT - and if i want to get fancy i melt white chocolate or white choc. almond bark and fill a squeeze bottle to make fancy white drizzles over the dark chocolate. I take them to baby/bridal showers all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaymee Penrose"
},
"reviewBody": "I made this recipe to the tee.. RAVE reviews..even the people who didn't like biscotti loved this! Very buttery.. which was probably what set it apart from other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelsolake"
},
"reviewBody": "This was my first time making bicotti, and unfortunately I was a little disappointed. They were not hard and crunchy, s they did not soak up much coffee. The taste is good, but more like a shortbread, not like boscotti should taste. I would definately toast the almonds, they taste a little raw in the cookie. These are however, easy to make and are palatable. But I will keep looking for another recipe that really knocks our socks off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonia"
},
"reviewBody": "This is great. The texture is perfect and It's easy to change around to suit your taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moser"
},
"reviewBody": "I followed the recipe but added more almonds (toasted) about 1 cup of slivered and subsituted almond flavoring for the anise and added the anise seed (1 tbsp). Don't be discouraged because the dough is sticky, it will bake up nicely. These were not the rock hard type I've eaten before, thankfully, but when toasted are firm and dunkable. I increased the second baking to 10 minutes which was about 1 minute too long, but it was in a convection oven.\nMy husband loves these and he is very picky when it comes to biscotti. Not too sweet. I'll be baking these alot! Just watch the second toasting time. Good luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raylene I"
},
"reviewBody": "I have tried many Biscotti recipes and none seemed to turn out as good as my late mother in laws. This recipe is actually easier and much better taste. Works great with pecans too.\nRaylene Italiano Ellwood City, PA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LITTLEBIGJOHN"
},
"reviewBody": "This is a surprisingly simple, classic recipe for italian biscotti that any novice could make, and any expert would be proud to produce. I like biscotti a little thicker than average so I cut them into one inch slices for the second baking. As I had two trays to cook, I also raised the heat to 400 degrees and toasted them for 15 minutes so they were medium brown and very crunchy. Warm with coffee, they were so good I baked a batch to send to my mom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "used sliced almonds. Lori Manning loved these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dotes"
},
"reviewBody": "Great recipe and so easy! I made some half dipped in chocolate. This recipe makes a lot so I halved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Salami Mommy"
},
"reviewBody": "Just not right... I had to add more flour to be able to work with the dough. 25mins. was not long enough for the center to cook (maybe my oven?) so I ended up with too-hard outer layers and too-soft centers. They tasted more like sugar cookies than the biscotti my Grandmother used to make. I'll try other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ArleneN"
},
"reviewBody": "I just made this recipe and loved it.\nMy husband and family thinks it one of the best I have ever made. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BISODER"
},
"reviewBody": "first time w/ biscotti and they came out great. They weren't as hard as I had hoped but I'm told that my Italian grandmother used to give then a brushing with an egg mixture while they were baking. I'm going to try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaGest"
},
"reviewBody": "Yummy! Love these with coffee! They're pretty easy to make. I don't usually include almonds since I don't have them around. Make sure the cookies are pretty hard/dry. The softer the cookie, the less they'll absorb liquid (coffee, tea)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alohamarie"
},
"reviewBody": "Excellent receipe! However, anise flavoring isn't for everyone so I replace it with 2-tsps of almond extract and 1-tsp of vanilla. When the Biscotti has cooled I dip one side in chocolate and place that chocolate side up on a tray with wax paper, then drizzle with white chocolate. Then they go into the fridge for about 10 minutes to harden. I do this with half the batch and leave half the batch plain. It's a big, big hit whenever I make it. I feel so lucky to have come across this recipe. So easy too! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AY113SC"
},
"reviewBody": "This was my first attempt at making biscotti and it came out wonderful! The only change I made was to use 2 tsp of anise and 1 tsp of vanilla extracts. Everyone loved this and wanted the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIANA1234"
},
"reviewBody": "Awesome...Awesome...Awesome....I made these for the Christmas Holiday because my Dad wanted Biscotti and let me tell you these are great! The dough is a little difficult to work with but its worth it! Hands down! Give it a shot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malie Smith"
},
"reviewBody": "This recipe was excellent! I also experimented a bit with it, adding a teaspoon of almond extract instead of anise extract, and also swapping out a cup of flour for a cup of unsweetened cocoa powder. It seems to make the dough a little thicker, but it tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "I have been using this recipe for 6 years now. I make 6 batches of the recipe for Christmas and give to all my Italian cousins. I also dip one side of them in good chocolate. Because of the chocolate, I cut the sugar in the recipe in half and use half whole egg and half egg whites for less fat. They are loved! Thanks again Bernie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck in Park City"
},
"reviewBody": "Very good Bernie! I hope you don't mind that I added additional almonds and dark chocolate chips. Chuck"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KaraSMc"
},
"reviewBody": "Just made today... Perfect! So good, can't wait to serve them at my X-mas Party! WILL MOST DEFINITELY MAKE AGAIN AND AGAIN AND AGAIN!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aunt Bo"
},
"reviewBody": "New to baking, I've tried a few biscotti recipes. This is, by far, the best one! My boyfriend is upset because I made most of them for customers christmas gifts. I'll need to make more for home."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11593/italian-biscotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11593/italian-biscotti/",
"name": "Italian Biscotti"
}
}
]
}
}
, "about": [
]
}
]