				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Italian Spaghetti Sauce with Meatballs"
,"datePublished": "2000-04-05T17:06:13.000-04:00"
,"dateModified": "2023-03-01T19:04:34.092-05:00"
,"author": [
{"@type": "Person"
,"name": "Jeremy"
,"url": "https://www.allrecipes.com/cook/24324279"
}
]
,"description": "A delicious homemade Italian-style pasta sauce with tasty beef meatballs that&#39;s slow cooked for an intense tomato flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z6A0LAFr4gLAHtYQkwWBX7tZxwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21353-italian-spaghetti-sauce-with-meatballs-step-5-22-51dfb8726460455e986d3b71358a6356.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1959446526001",
"description": "This classic tomato pasta sauce with meatballs is easy and delicious.",
"duration": "PT3M39S",
"name": "Italian Spaghetti Sauce with Meatballs",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/04/07/21353-italian-spaghetti-sauce-with-meatballs-3x2-138.jpg",
"uploadDate": "2021-06-22T18:07:23.384-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Italian Spaghetti Sauce with Meatballs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "3666"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "347 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "77 mg"
,"fiberContent": "5 g"
,"proteinContent": "19 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "1493 mg"
,"sugarContent": "11 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["Italian"]
,"recipeIngredient": [
"1 pound lean ground beef",
"1 cup fresh bread crumbs",
"1 tablespoon dried parsley",
"1 tablespoon grated Parmesan cheese",
"0.25 teaspoon ground black pepper",
"0.125 teaspoon garlic powder",
"1 egg, beaten",
"0.75 cup chopped onion",
"5 cloves garlic, minced",
"0.25 cup olive oil",
"2 (28 ounce) cans whole peeled tomatoes",
"2 teaspoons salt",
"1 teaspoon white sugar",
"1 bay leaf",
"1 (6 ounce) can tomato paste",
"0.75 teaspoon dried basil",
"0.5 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FooBDuwpGZ4U_-0lBUfTYhC5dpI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21353-italian-spaghetti-sauce-with-meatballs-step-1-105-fc73877080c9445390b9e60770a97619.jpg"
}
]
,"text": "Gather all ingredients."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BBEA0d-sgOE9csQnv4Bn6dLsmwE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21353-italian-spaghetti-sauce-with-meatballs-step-2-108-bb26498aff7d4ba3be12a5e67bea3539.jpg"
}
]
,"text": "In a large bowl, combine ground beef, bread crumbs, parsley, Parmesan, 1/4 teaspoon black pepper, garlic powder and beaten egg. Mix well and form into 12 balls. Store, covered, in refrigerator until needed."
} ,{
"@type": "HowToStep"
,"text": "In a large saucepan over medium heat, saute onion and garlic in olive oil until onion is translucent."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AKFF8MBomgKqTQgmaiVclaaI-FA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21353-italian-spaghetti-sauce-with-meatballs-step-3-13-fe90f8e94412409b954283c2e7f4fce7.jpg"
}
]
,"text": "Stir in tomatoes, salt, sugar and bay leaf. Cover, reduce heat to low, and simmer 90 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z6A0LAFr4gLAHtYQkwWBX7tZxwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21353-italian-spaghetti-sauce-with-meatballs-step-5-22-51dfb8726460455e986d3b71358a6356.jpg"
}
]
,"text": "Stir in tomato paste, basil, 1/2 teaspoon pepper and meatballs and simmer 30 minutes more."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really great. As others suggested, I cut back on the sugar a bit, and I also browned the meatballs. I doubled the recipe and froze half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JD6"
},
"reviewBody": "I’ve been making this for awhile now and have dialed it into my liking. First, I added a couple grated up carrots from the food processor as well as diced mushrooms to make the sauce thicker and give it a garden fresh twist. I sauté the veggies with the olive oil before adding anything. I use 2 28oz cans of crushed tomatoes instead of whole pealed, the sauce gets done much quicker this way. I also stir in a 1/4 cup dry red wine when I add the sugar. I sub the meatball version of this recipe for Chef John’s on this website and the dried basil for Italian seasoning. I garnish it with fresh chopped Italian parsley and fresh grated Parmesan cheese. This is a 10/10 every time, the kids ask for it once at least once a week and I couple it with homemade garlic bread. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "1) I think it would make more sense to start with the sauce and then prepare the meatballs, since they aren't added until the last 30 minutes. That reduces the start-to-finish time, since the sauce needs to simmer for 90 minutes at the beginning. 2) I followed the meatball recipe almost exactly, except that I added a little bit of salt based on some of the other reviews and soaked the bread crumbs in a half cup of milk (I did a 1.5× recipe). I also used 80/20 ground beef, which isn't really \"lean\", I suppose, so I baked them for a bit first before adding them to the sauce in order to let some of the fat drain out and to crisp up the outside. My family found the meatballs to be lacking in flavor: quite frankly, they needed a lot more salt than the quarter teaspoon or so that I added. I would probably increase the salt to 1 tsp were I to make the recipe again. I also think the amount of garlic powder could be increased, and I would personally swap the parsley for a more flavorful herb or herb blend in the future. 3) The sauce, on the other hand, was very flavorful and delicious! I did have to make some substitutions regarding the type of tomato, given what I had on hand, but that only affects texture, not taste. I would definitely make the sauce again, and hopefully I will remember to buy whole canned tomatoes so that I can try it as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Takes a little time but so worth it. Simple instructions and excellent results first try. This is \"serve to company\" good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenn Hagmann"
},
"reviewBody": "Rating just the meatballs. I Used meatloaf/meatball mix, substituted dry breadcrumbs for fresh, Italian seasoning for parsley. Meatballs need salt, but otherwise good. This is definitely one to build off of. I made 16 small meatballs and baked 17 minutes at 350."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Didn't have tomato paste or dried basil. Still made it with everything else, used all the measurements according to the recipe except for the salt, ended up adding some salt to the meatball mixture and a bit at the end but that's purely preference. It was so good I was threatened with bodily harm if I don't save and remake this recipe at least once a month. I was worried about the meatballs not cooking all the way through, but I had absolutely no issues with that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "This is fantastic spaghetti sauce! This has a fresh bright flavor and it wakes up your mouth. Sooo delicious. This is not like any other sauce I have ever eaten. I found this over 15 years ago and then as life got busier with growing teenagers, I started using jar or package sauce for convenience. Now with today's prices and my favorite jar sauce being $9 a jar, I am making my own again. Easy and fast to put together, then most of the work is waiting for the time to elapse so you can eat. I did use canned Italian San Marzano tomatoes. I inadvertently used 1 can of tomato puree, because I thought they were both whole tomatoes until I opened them. That ended up being a happy accident and I am adjusting my copy of the recipe to reflect that change. I skipped the tomato paste as a result. I took an immersion blender to the whole tomatoes and crushed them up some before starting the sauce. I did use a little more garlic because 2 extra cloves popped out when I was pulling off the ones called for. They were little, so I went with it. I used a whole slice of bread and didn't measure to see if it was a cup or not. It worked. My only addition was about 1/2 tsp. of oregano to the sauce which was insignificant considering the volume of the pot. I baked the meatballs in the oven until they were browned, which was probably 20 minutes at 350. I just eyeballed them for color, and then plopped them into the sauce and let them simmer right along for the 90 minutes. I put everything right at the start after sauteeing the onion and garlic, and didn't space it out as directed because I couldn't be bothered. I used my caldero pot since I wanted plenty of space for all this to fit and it was perfect. My husband loved the meatballs so much he mentioned it. He doesn't usually comment on food, he just eats, so if he actually makes a comment, I know it's special. This was fabulous and I prefer it over the jar sauce aaaaand it gave me so much more. I like knowing what is in my food and being able to control the sugars and salts as well as other ingredients. Thanks for sharing Jeremy, this is going to be my go-to spaghetti and meatballs from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "Look no further!! This is a GREAT recipe!! The only change I made was I used about 24 plum tomatoes ( without skin) from my garden. It came out PERFECT. I am so happy to have finally found the perfect sauce and meatball recipe on the internet. And yes, it's hard to believe but the meatballs really do cook very well in the sauce w/o browning them first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cristian Lagarini"
},
"reviewBody": "I prepared this recipe today. My wife enjoyed it a lot. Both of us enjoy preparing tomato sauce with whole peeled tomatos. Next time we do this recipe again we will remember to buy groud lean meat. The ground beef meet we used had excesive fat . I added fresh basil leafs instead of dry basil. I also added a little more sugar. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "The sauce was good, but a bit sweet for us. I used our go-to meatball recipe using hot Italian sausage, but it was still nice, nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carissa"
},
"reviewBody": "Love this! Over the years I made some changes. Add a dash of cinnamon with the tomatoes. Add twice the amount of paste and a can of tomato sauce to thicken the sauce. Also, a dash of red pepper! LOVE IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it today. Everybody loved it 😋. Thanks for this great recipe. 👍👌"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Scarpa"
},
"reviewBody": "I've been making this recipe for years now. Tip 1: add chopped onion and minced garlic to the meatballs (cook in OO first, let cool, then add to meat mixture) Tip 1.5: Use meatloaf mix ONLY. This is what high-end Italian restaurants use to get a moist and tender meatball that packs flavor. Tip 2: Make sauce a day ahead Tip 3: Use San Marzano tomatoes only (I use Cento) Tip 4: Change LITERALLY NOTHING about the sauce recipe. It's perfect the way it is. My Italian family adores this and insist I make it for every holiday and birthday. And I eat the leftover meatballs cold from the fridge. THATS how good they are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Gregory"
},
"reviewBody": "A little too much salt, but very good. I will make it again with a little less salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debmorsbach"
},
"reviewBody": "I think this recipe is easy and delicious. I have cooked for over 40 years, raising 5 boys, and spaghetti was their favorite. After I had Covid, my recipe didn’t taste right. I try new recipes from this site all the time and I have to say most every one had been great. Try this one! The only thing I did was add 1/4 cup of water or milk to my meatballs. A true Italian taught me that. I put meatballs in crockpot to cook and this was a fantastic meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Ortiz"
},
"reviewBody": "I like this recipe because I made it before and my mom enjoys it. This recipe is one of my favorite Italian dishes I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I love this recipe. I have made it twice already and last night I served it to guests. They loved it just as much as my husband and I do. I cut down on the amount of bread crumbs in the meatballs and doubled the garlic. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy "
},
"reviewBody": "Excellent! No changes to ingredients. I browned meatballs in fry pan before storing in fridge. The finished cooking in the spaghetti sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LJE2025"
},
"reviewBody": "Love this sauce. I made 2 very minor revisions after reading the reviews. First, I reduced the breadcrumbs to 3/4 cup, and added 1/2 cup milk to soften the breadcrumbs initially, let the breadcrumbs and milk sit for a few minutes, then added the rest of the meatball ingredients. I added 1/2 tsp salt and 1/2 tsp basil to the meatball mixture as well. The rest of the recipe I followed exactly and we LOVED it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri Adams"
},
"reviewBody": "This is my go-to recipe for meatballs and bolognese! And I’ve been making it this way for years. Everyone I’ve made it for wants to know how I made it. It’s in the sauce! Depending on how much I like that person is the deciding factor on if I share it or not. Make the recipe as is, it’s perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "w5pnwc652g"
},
"reviewBody": "I’ve made this recipe as written with no substitutions or additions many, many times over the last 2 years and it’s absolutely delicious. I wouldn’t think of insulting the perfection that is this recipe by altering it in any way. This is high scale restaurant quality taste. A classic spaghetti recipe that withstands time. I make this when I want to impress my guests and often get asked for the recipe. Any leftover sauce and meatballs make for a supreme meatball sandwich atop toasted French bread. I could go on and on but do make this once and it will forever be a part of your dinner rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ananthrajmeena02"
},
"reviewBody": "It's too good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marleaheo"
},
"reviewBody": "omg this was the best spaghetti and meatballs I have ever tasted. I made a few changes. in my meatball I put basil and added water, oregano, Lipton onion cup onion cup of soup mix and I fried then just about 1 minute to make them firm. I also used ground turkey. the best meatballs. for the sauce I added 1 teaspoon Italian seasoning, oregano, 6 ounces of tomato paste and about of cup tomato sauce. instead of whole peeled tomatoes I used diced tomatoes and crushed tomatoes with basil. I also added a little more garlic, and shredded parmesan to the sauce. in addition to the items in the recipe. the absolute best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debora Ramos"
},
"reviewBody": "I added \"Italian Herb Mix\" and \"Garlic Salt\" to the sauce, it gave it lots of flavor. Yummy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Page"
},
"reviewBody": "This recipe is delicious as it is. My husband still goes on about the meatballs, and it’s been over a week since we made this. I made it following the recipe, with the exception of adding, seasoned (garlic and Sazon) sautéed mushrooms that I needed to use. This sauce has been added to our rotation, and we look forward to having it again soon. I love meals I can simmer, stir and smell for a while before we eat, and this one was delicious. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "koriileeautumn"
},
"reviewBody": "I've got to say thank you for sharing this recipe, I cannot wait to sit down and eat. The smells in the kitchen have got my tummy rumbling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAWN 1976"
},
"reviewBody": "Omg - so amazingly good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Molesworth"
},
"reviewBody": "I have been trying to make delicious meatballs for 30 years and I finally found the perfect recipe! I made 12 and they were gone in minutes! Family &amp; Friends said they were AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WWay"
},
"reviewBody": "I added Italian sausage to the ground beef 1:1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marysá"
},
"reviewBody": "Loved these!! I used fresh basil and parsley but followed the directions otherwise. This’ll be my new spaghetti and meatballs recipe for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Ochieng"
},
"reviewBody": "This is going into the regular rotation. I jazzed it up a little bit with adding green peppers. It helped, but the base recipe would serve your family well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "I also came up with 14 meatballs,used meatloaf mix,used two eggs instead of one,used Panko crumbs because that is what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j. cook"
},
"reviewBody": "I loved this recipe. The sauce truly tastes so “fresh”. For the meatballs, I doubled everything because I added a pound of ground pork. I think good meatballs need ground pork to counteract any dryness. For the fresh breadcrumbs, I soaked them in just a small amount of milk. Other than using fresh herbs because my garden is overflowing with them, that’s the only changes I made. A tip for the meatballs - DONT over mix them. The less handled, the more tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MichaeleM"
},
"reviewBody": "This is the best spaghetti sauce I’ve ever made. I have actually just canned the sauce three times this season already, so it’s ready to add to meatballs later. Thank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yummy25"
},
"reviewBody": "I wasn’t sure what to expect at first with the sauce. I was worried it was going to be runny or lack flavour but this sauce is amazing and so are the meatballs!! It’s was perfect, I will be making this sauce going forward. I didn’t chance a thing, expect I had to use fresh basil and fresh parsley. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Disney Gourmets"
},
"reviewBody": "Thanks for sharing this recipe, it turned out great! I was hesitant to add the meatballs without browning them but they turned out really good! The meatball mixture was perfect as the dense consistency allowed the meatballs to remain intact. I used 1 can of whole tomatoes and 1 can of crushed tomatoes for the sauce. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trixie"
},
"reviewBody": "For meatballs, I used 1/2 ground beef and 1/2 ground pork. For sauce I used (1) 28 oz can “Kitchen Ready” tomatoes and (1) 28 oz can tomato purée instead of the two cans listed. After sautéing vegetables, I added all to the pot at once, brought to a boil then simmered one hour. I then added (1) lb sweet Italian sausage and the meatballs. Simmered for 30-60 minutes more. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle S"
},
"reviewBody": "I have been making this for years with slight variations. I come from a large Italian family and this is as close as it gets. Never any sugar, that's insanity. I know people do it but who knows why. I also don't measure my seasonings, I do it by taste but here's about what I use: \n\n1 tablespoon parsley\n1 teaspoon garlic powder\n1 tablespoon pepper\n1.5 tablespoons of salt (taste and add more. I do not start with this much.)\n1 tablespoon of italian spice\n1 tablespoon of oregano\n1 teaspoon chili pepper flakes\n\nI also add a shake or two of a rather spicy blend of peppers we grow and grind ourselves at home.\n\n\nI even do this in the crock pot now and it comes out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Starmonkey"
},
"reviewBody": "Great recipe! Have made many times. The only change that I recently made was to use a crockpot. Submerge the raw meatballs in the sauce and leave it all day on low. Turned out the same as when I cooked in on the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BrewCrew"
},
"reviewBody": "The meatballs are great. I doubled the recipe and used half ground pork half ground sirloin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronda"
},
"reviewBody": "The best sauce I have ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calvin Stacey"
},
"reviewBody": "My 4th time making this and would not change a thing about this recipe.Superb taste to our Family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KingKong Long"
},
"reviewBody": "Agh...... The meatballs turned black"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke"
},
"reviewBody": "I made this using a 2 lb “ground Bork” (1 lb beef and 1 lb pork) that my local grocery store sells in the meat dept and just doubled up on the meatball ingredients. I kept sauce ingredients exactly the same. Followed the recipe. Super easy, Everyone loved it! The house smelled great all day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MishHatCamp"
},
"reviewBody": "Very Good. Our favourite meatball recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Gomez"
},
"reviewBody": "Really good! It was a hit with my family! I’ve made this sauce to use in my lasagna too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ct"
},
"reviewBody": "Very easy to make all I did was add Italian seasoning and some hot sausage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Wildermuth"
},
"reviewBody": "I made this recipe as it was written except that I baked the meatballs before putting them in the sauce. The sauce was delicious and the meatballs had a nice flavor, but were overcooked because I baked them. I will definitely make this again, following the recipe as written next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Preeta Unni Reghunath"
},
"reviewBody": "Great recipe, my family loved it ?? The Instructions are very clear and precise. Loved it. Thank you .."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamamission"
},
"reviewBody": "Excellent recipe. I grew up making Ragu sauce spiced up with some added ingredients and this simple and delicious recipe is just what I have wanted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marvin"
},
"reviewBody": "Delicious, those meatballs are perfect !\nAlso good made with lean ground pork :P"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emilyland"
},
"reviewBody": "Fantastic simple recipe. I made it exactly as is. I think next time I'll add 3/4 tsp of oregano just because I like that flavor in sauces, too. But really this is just a wonderful basic marinara recipe to simmer meatballs in. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "George Nagel"
},
"reviewBody": "Added more garlic (I like garlic). Very very good sauce but not as good as my wife's. I'll post hers if she'll let me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I did make a few alterations just based on taste preference. Added 1/4 lb. sweet Italian sausage to meat balls. Added small can of mushrooms to sauce. Increased sugar to one tablespoon because we love a sweet sauce. Meatballs held together perfectly. This was my Birthday meal this year and I could not have been more pleased. Love spaghetti,this recipe was a real present."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arturo06"
},
"reviewBody": "Made some of the adjustments mentioned. Adding tomate sauce and more seasoning to the meat balls made them fantastic. Also coated them with flour Nd browned them in olive oil. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mark"
},
"reviewBody": "I was very excited to try this recipe after I saw how many stars it had and the reviews I read. Unfortunately, I was very disappointed. The meatballs were actually somewhat chewy and not very good. The sauce was basically just a tomato sauce from a can. This spaghetti recipe was average at best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I made it to a T and omg I felt like a 5 star cook eating it!! Will definitely make all the time!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Hayter"
},
"reviewBody": "Some comments said that this recipe is lacking flavour. I (accidentally) used only one 28 oz can of diced tomatoes and I used 1 lb of meat (1/2 pork 1/2 beef) and this recipe was FANTASTIC! Had tons of flavour (probably because it wasn't diluted by extra tomatoes) and wasn't sweet at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oohbetty"
},
"reviewBody": "The best pasta sauce I’ve ever made! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Vazquez"
},
"reviewBody": "This was so easy. My wife loved the sauce and she hates red sauces. It was all gone.no left overs wow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindap"
},
"reviewBody": "This turned out great, I didn’t have any ground beef or turkey, so I used Italian sausage. Added parm reggiano shredded cheese and used fire roasted tomatoes, plus some cherub tomatoes to stretch. I also put in mushrooms and sautéed bell pepper and celery along with the garlic. By the time the tomatoes cooked for 90 minutes the bell pepper and celery cooked into the sauce and were not easily discernible - but was a value add for flavor. Also put in a little red wine - I only had Beaujolais - it all turned out good....when you don’t have precise - improvise! Lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULETTA"
},
"reviewBody": "Wonderful, I cooked in a slow cooker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tahoura Hashemi"
},
"reviewBody": "I made this spaghetti sauce for my Italian style birthday dinner and I made it a couple more times. The best thing that makes these meatballs stand out, to my opinion, is the fresh bread crumbs and Parmesan cheese. The meatballs don’t shrink and actually increase in size once they cook. \nOne of my favorite spaghetti sauce recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Barton"
},
"reviewBody": "Very tasty! I did add mushrooms to the sauce and would suggest a little less bread crumbs for the meatballs. It was a big hit with the in-laws and grandkids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Buitrago"
},
"reviewBody": "My husband liked this, and he is never happy when I make pasta or anything with tomatoes. I like the way the meatballs taste when they are cooked in the sauce. The sauce is light and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "Delicious recipe. Easy and tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RREN113"
},
"reviewBody": "Love this recipe! This is my go to recipe when I want spaghetti and meatballs. My family loves when I make this dish so I usually need to double the recipe to have enough for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "qualitymike"
},
"reviewBody": "I made as directed. We all enjoyed the sauce especially. I think I will make again, and may add something to the meatballs but they were ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MITHY1"
},
"reviewBody": "This is the same recipe our family (from the Calabrese region of Italy) uses. Always a hit, and everyone who has it wants the recipe. Sometimes I add a pork bone or pork ribs to the sauce. Sometimes I mix ground beef with half the amount of ground pork. It's very versatile. \"Just don't add oregano,\" my mom would say,...\"then it's Pizza sauce.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cate Leonard Brizzell"
},
"reviewBody": "Used crushed tomatoes, added small can of tomato paste and tomato sauce, a bit of oregano. For meatballs I used panko crumbs and subbed garlic salt for garlic powder. Crock pot for 7 hours with meatballs in the last 2. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jbalzy"
},
"reviewBody": "The meatballs were too bready. I didn't like them. I was leery about adding that many breadcrumbs to the meat but I went with it. I should have listened to my gut. Use less breadcrumbs and maybe it would be good. I cannot comment on the sauce, I didn't make the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was really easy and delicious. I didn't want to go through the trouble of making meatballs from scratch tonight so I just used some frozen ones I had and it still came out great.\n\nThe sauce was a bit salty even though I only used 1 Tsp instead of the 2 Tsp the recipe calls for. I'm not sure if this is because I used Kosher salt instead of table salt, but the recipe didn't specify. After adding the 1 Tsp I thought \"that seems like a lot of salt\" so I decided not to add the rest, and I'm glad I did. Still, it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexi"
},
"reviewBody": "Absolutely delish!!!!! Thanks for sharing this amazing recipe!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey Cargile"
},
"reviewBody": "I was the same way as Navy_mom first time I made meatballs and marinara without cooking the meatballs first. But it is the way to go. Only issue is the greasness that you get in the sauce but that makes it good. This is a great recipient"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tel703"
},
"reviewBody": "Only modification I made was to add Italian sausage - very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kooshaa"
},
"reviewBody": "This the second time i made this recipe. I added a tsp of salt in the meat. This is my family's favourite recipe now. Love it 10 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mai Mostafa"
},
"reviewBody": "I just added finely chopped onion to the meatballs paste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigHungryBrownBear"
},
"reviewBody": "Great recipe and always well received by the family! I quickly pan fry the meatballs just enough to get the outsides brown, but not cooked all the way through. It adds firmness and nice color. I have also made this successfully in the crackpot and let it simmer for hours. I did follow another Reviewer's suggestion and add 3 sprigs of parsley to the crockpot and it adds wonderful flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Thune Cooper"
},
"reviewBody": "Easy and awesome! Great recipe! Don’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Bragg"
},
"reviewBody": "Added red pepper to meatball mixture- perfect kick! Love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Manija Mainer"
},
"reviewBody": "This took almost 3 hours and to be honest it was not AMAZING...the meatballs were bland and the sauce needed some umph-not sure what that might be. I am all for taking time to make something wonderful for my family but no rave reviews by my kids or husband on this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ms_sasska"
},
"reviewBody": "Tip: There are two things I did different. First I BAKED the meatballs for 20 min at 400 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becka"
},
"reviewBody": "I absolutely love this recipe with a few changes! I use a half cup of olive oil as I add green pepper, zucchini, yellow squash and matchstick carrots. I sauté the onion &amp; pepper a few minutes first then add the rest of the veggies and sauté a few minutes more. I then add my garlic and let sauté one more minute before adding the tomatoes. I use 1-28 oz whole peeled tomatoes and 2-14.5 oz cans diced tomatoes. I also add 2-3 bay leaves depending on size. After simmering the 90 minutes I remove and blend the whole tomatoes with an immersion blender and return to the rest of the sauce. I then add a 12 oz can of tomato paste, 1 teaspoon Italian season, 1/2 teaspoon roasted garlic powder and 1/2 teaspoon basil. Amazing!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hans"
},
"reviewBody": "This sounds very much like a recipe that was given to me by a good friend 30 years ago! \n\nIt was amazing! Nothing more to say. My family loved it the very first time I made it! If you’re a fan of good sauce and meatballs, you WILL NOT GO WRONG WITH THIS RECIPE!\n\nPlease, give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Elliott"
},
"reviewBody": "love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanna"
},
"reviewBody": "It was very good. Everyone in my family enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Antonio"
},
"reviewBody": "OUT-STANDING!! OMG these were so good. I have had this recipe saved for a long time and finally made it tonight when I made a vegetarian casserole but my meat lovers needed something. I did half ground beef and half mild pork sausage. half italian bread crumbs, half toasted bread. Didn't have oregano or basil so used Italian seasoning. Didn't have regular crushed tomatoes so used the crushed tomatoes with garlic and oregano. Added some wine because....why not?! And I don't really measure...just add stuff. This was truly amazing and cooked perfectly. thank YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jomark"
},
"reviewBody": "I made this during Coronavirus stay at home order. I wanted to make a ton extra to freeze and get multiple sittings out of it. So, I upped the ingredients to serve 24. The sauce came out awesome! One of the best sauce’s I have ever had. The meatballs had too much bread crumbs. They were too dry and and tasted like eating bread not meat. I will make this again since I loved the sauce, but will cut the bread crumbs in half. The meatballs had good flavor just too dry and bready. I have the leftover sauce in my freezer and look forward to having pasta again. If cutting the bread crumbs in half makes the meatballs to my liking This will be my “go to” recipe. Members of my family thought the meatballs were good. Maybe its just me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chucktownchef"
},
"reviewBody": "The family consensus was this was the best spaghetti sauce ever. We doubled the cooking time for the sauce and kept the cooking time for the meatballs the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Kacher"
},
"reviewBody": "Meatballs were really tasty and the sauce was authentically delicious! Double your sauce and freeze it off to make chicken parm later!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JohnV"
},
"reviewBody": "I will mask again but will tweak it. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Bentley"
},
"reviewBody": "No substitutions needed, this recipe is wonderful. I served it over rotini."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrietalbott4"
},
"reviewBody": "This is THE best sauce! Added a little oregano and that was it! Perfect.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is THE best sauce! Added a little oregano and that was it! Perfect.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylee Stone"
},
"reviewBody": "This is my go to spaghetti and meatballs recipe! I make some adjustments, but they aren't huge. After it simmers for 90 minutes and before I move onto adding the tomato paste, I blend the sauce (be sure to remove the bay leaf first!). I also add in some red pepper flakes and oregano afterward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefPamela"
},
"reviewBody": "Really good. Will definitely make it again, and stop buying jarred sauce.. why when it’s so easy to make and so delicious. Very few modifications..added Worcestershire to meatballs and doubled the Parmesan, and used one can of herb and spices tomatoes for flavour. Loved it! Shout out to the chef who suggested to start the sauce first, since you have tons of time to make the meatballs while the sauce is simmering, yes do that! Love it. Try this recipe. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brprescott"
},
"reviewBody": "I was a little weirded out about putting the raw meatballs into the sauce but like most said, the meatballs turn out perfect and it makes the sauce even better. Very good, will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yolanda Humby"
},
"reviewBody": "I followed the recipe exactly as is and this is by far the best sauce I’ve ever had. My husband likes a thicker sauce so I fried out some hamburger meat, peppers, celery and onion for him and added the sauce to it and we were both happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fatima "
},
"reviewBody": "I liked the method however I added more garlic, all Italian seasonings and reduce the breadcrumbs and increased the cheese."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21353/italian-spaghetti-sauce-with-meatballs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/496/side-dish/sauces-and-condiments/sauces/pasta-sauces/",
"name": "Pasta Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/567/side-dish/sauces-and-condiments/sauces/pasta-sauces/tomato/",
"name": "Tomato"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21353/italian-spaghetti-sauce-with-meatballs/",
"name": "Italian Spaghetti Sauce with Meatballs"
}
}
]
}
}
, "about": [
]
}
]