				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jalapeño Jelly"
,"datePublished": "2020-06-18T23:08:48.000-04:00"
,"dateModified": "2022-07-14T17:43:32.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sue Delgrego"
,"url": "https://www.allrecipes.com/cook/24328479"
}
]
,"description": "This jalapeño jelly recipe has the best taste balance and is very easy to make. Its pepper flavor and a spicy kick are great with cheeses or meats."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7bF4EpZXTmA5r0goZd1f4bXlUW8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8420756-5af3a21a486e4cf28ba60be95d0c3ecb.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jalapeño Jelly"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "233"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "109 kcal"
,"carbohydrateContent": "28 g"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"sodiumContent": "1 mg"
,"sugarContent": "27 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 large green bell pepper",
"12 jalapeno peppers",
"1.5 cups apple cider vinegar",
"1 pinch salt",
"4.25 cups granulated sugar",
"4 ounces liquid pectin",
"4 jalapeno peppers, seeded and finely chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Working in batches if necessary, combine green bell pepper and 12 whole jalapeño peppers in a food processor or blender. Process until finely chopped."
} ,{
"@type": "HowToStep"
,"text": "Transfer peppers to a large saucepan. Stir in cider vinegar and bring to a boil. Reduce heat and simmer for 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Strain mixture through at least 2 layers of cheesecloth, and discard pulp. You should have about 1 cup of liquid."
} ,{
"@type": "HowToStep"
,"text": "Return liquid to the saucepan, and stir in the salt and sugar until dissolved. Bring to a boil over medium-high heat. When the mixture comes to a rolling boil (one that cannot be stirred down), boil for one minute, then stir in liquid pectin."
} ,{
"@type": "HowToStep"
,"text": "Stir in remaining finely chopped jalapeño peppers, and ladle into sterile jars leaving 1/4-inch headspace."
} ,{
"@type": "HowToStep"
,"text": "Seal jars in a hot water bath. Refrigerate jelly after the seal is broken."
} ]
,"recipeYield": ["32"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Seriously, people are waiting in line for a second round of JPJ gifts! I upped the heat ante by adding a seeded serrano chili. I think in the future I am going to try adding some fruit, like pineapples or peaches and thinking about a batch with mint and lime. Thanks for a superlaunching-off place!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisybug067"
},
"reviewBody": "This a big hit with all, I have peope lining up for this when i make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom of 4"
},
"reviewBody": "Excellent flavor. I made it as written, except that I used powdered pectin. After simmering the peppers, I had 1 1/2 cups of liquid. I imagine that it varies according to how juicy the peppers are. From there, I followed the method given on the pectin box. I ended up with 9 quarter pint jars and a couple of ounces of overage which we devoured with cheese and crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale Henderson"
},
"reviewBody": "Super easy and tasty. This will become a new staple at my house"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FERGIE"
},
"reviewBody": "I followed the basic recipe. I roughly chopped my peppers and simmered for 30 mins. (due to other projects and getting distracted). Had to dilute cider with 1/3c of water to make the full cup. I had 3oz of liquid pectin so I added a half of a pack of powder (boiling another minute or so). I removed the membrane but left the seeds in the 4 diced peppers (we like the kick).. Surprisingly.... It all turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Austin Ballard"
},
"reviewBody": "This is super delicious. I just wish there was more pepper flavor somehow. Maybe next time I’ll use more jalapeños so it’s more concentrated? Either way, definitely adding to my recipe book. It might be a great Christmas present."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judykj"
},
"reviewBody": "This made 4-8oz jars for me and I followed the directions the way they are except I only added 4 cups of sugar. This is good, but mine turned out pretty hot, so I will scrape out more seeds in the next batch. Oh,I did add a drop of red food coloring and love the color for Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANADAMABAKER"
},
"reviewBody": "The first time I made this I removed most of the seeds and it was a nice mild flavor. The second time, I left most of the seeds in and this batch has a kick! Both times I ended up with more like 2 cups of liquid. I used 6 1/4 cups of sugar and 2 pouches of liquid pectin (3 oz each). Definitely should have used a bigger pot to boil in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Doane"
},
"reviewBody": "no changes. Came out perfect. Family all love it. Ritz crackers, cream cheese and a little jelly on top. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmellia"
},
"reviewBody": "Easy recipe! Have made this before with a different recipe. \nMade the Jalapeno batch then redid a batch using yellow peppers and banana peppers. We sampled the goods and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wehrle Tilton"
},
"reviewBody": "I have made this numerous times and find it delicious. Everyone wants my recipe. I do add different flavors of jello sometimes to change it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2kmbhbknsc"
},
"reviewBody": "Delicious!! Instead of chopping the jalapeños for the last stage, I diced them in the beginning. Added a few more jalapeños for extra heat. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moomoosmom"
},
"reviewBody": "I made this twice so far. Very good. I did not strain the jelly though. I skipped that step altogether. I left the peppers in my jelly. No straining. I love the way it looks and it is really good. I put it on hamburgers and it is delicious on toast too. This is a really easy recipe and so delicious!!! Hope you enjoy it as much as I do!! I also have to make this every year because my friends and family look forward to getting their homemade jalapeño jelly from me!! Hint: makes great gifts!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tre Moreland"
},
"reviewBody": "This turned out KILLER!! \n\nI took a star because it yielded nearly double what said it would. I had to throw a bunch of this delicious jelly away because I didn’t have enough jars!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacklyn Horst"
},
"reviewBody": "It is great!!! I love making this jelly!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aquila Corbin"
},
"reviewBody": "I love this delicious jelly! I took another reviewers suggestion to add more sugar. because my peppers were huge, I added 5 ½ cups of sugar to get the taste balanced. Also I took the suggestion to stir in a Tbsp of butter (because, butter, yum.) when adding the certo to keep the bubbles down, then simmer for 3 to 5 minutes so it 'jells beautifully'. It's wonderfully sweet with a very spicy after kick. I could eat an entire jar with crackers ... or a spoon lol. Thank you for sharing your recipe. PS this was first my time making jelly and it was so fun and easier then expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Norris"
},
"reviewBody": "It was a lot easier then i thought, Everyone loves it. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy"
},
"reviewBody": "Best jalapeño jelly ever! Comes out perfect every time. I use the jalapeños from my garden so I sort of judge how many to use by the size. Depending on how many I use it will either come out as a jam or jelly. Everyone devours it either way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I made this jelly four years ago and totally forgot about it. I opened a jar recently (having come across it when my husband asked me to get a jar of pickled jalapenos from our pantry for a salad). I am so head over heels fond of this recipe. It is wonderful on anything. It can be said that I have a little bit of English muffin with this Jalapeno Pepper Jelly. A \"must try\" for the Jalapeno Pepper Jelly lover in you!\n Maggie from Oregon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L. Reintz"
},
"reviewBody": "very easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OkieChic"
},
"reviewBody": "Perfect in every way! Anyone who has tried it ,wants a jar! Thank you ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bies71"
},
"reviewBody": "I added extra peppers in the beginning. Turned out amazing!! Perfect over some cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Griffin-Fay"
},
"reviewBody": "I just finished jarring mine. It made 6 little jars. I added green food coloring to add a little eye appeal to the olive green it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "I added crabapple to it. really yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Vanhouten"
},
"reviewBody": "I made this it’s very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Taylor"
},
"reviewBody": "My jalapenos turned bright red so I made this with a red bell pepper - the colour is beautiful. I did not add the extra chopped peppers at the end. No too hot, pleasant flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Nesheim"
},
"reviewBody": "I ended up with 3 cups of liquid as I started with 16 jalapenos and 2 cups of vinegar. I did squeeze the juice out as that is just what we Norwegians do -- waste not want not. I used two 3 oz packages of Certo liquid pectin. I did boil for 3 minutes after putting in the pectin and I used 2 tbs (approx) to tame the foam. I ended up with at least 8 half pints of jelly. ran out of canning jars so I had to put in other small jars I had and just put them in the fridge w/o processing them. They will keep for months. Just tasted the last bit I had to put in a small bowl. It is yummy with cream cheese and crackers. I think the gal who said hers was soup didn't boil after adding the pectin. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georganna Gould Gore"
},
"reviewBody": "It's fine just like it is. I just usually make a BIG batch when I make. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Breeden"
},
"reviewBody": "Best recipe I've made. Incorporated all the peppers into the jam rather than straining them and discarding. Used 6 cups of sugar ,3 oz (1 pouch) of liquid pectin and 15 hot peppers from out summer harvest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jecika"
},
"reviewBody": "We loved the flavor if if our slight alterations made it a bit more spicy! However it did not set up correctly. I'm not sure what I did wrong. After refrigeration it gelled a little more but not like it should have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Casablanca"
},
"reviewBody": "Hubby said it was some of my best work..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "qwertyAR"
},
"reviewBody": "So delicious I couldn't stop tasting it. This was my first time making jam or jelly so thanks for the positive experience. I was short on regular sugar and so about two cups of the sugar was brown sugar which resulted in a lovely amber appearance and caramel-y flavor. Recommended! I also left in all the peppers and left the seeds in about five peppers total."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurel Davis"
},
"reviewBody": "I’ve been making this for several years now, ever since I found the recipe. I follow Raearendt instructions, but usually I remove the seeds from half the jalapeños. One time I guess my peppers were so hot I couldn’t eat it, when I left all the seeds in, so now I’m a chicken and remove seeds from half. I gave a jar to someone at work and now he makes sure to give me a big bag of jalapeños every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juanita"
},
"reviewBody": "Loved it and easy to make. My friends loved it will be making more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Loved this jam! I didn't put it through the cheesecloth and removed the seeds of about 3/4 of the jalapeño peppers. Just delicious with the right amount of heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Corbett"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Q Hardy"
},
"reviewBody": "I didn’t strain the pulp out and put 5 cups of sugar in . I love it and will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gingerg"
},
"reviewBody": "Delish!!! Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgia Duncan"
},
"reviewBody": "Wow! Spicy hot, even for a native Southern Arizonan like me, but very delicious! I did make some changes:I did not strain the peppers as directed - left them in as suggested by other reviewers; Used 2 green bells instead of 1; eliminated 4 fresh jalapeños at the end (can’t imagine hot much hotter that would have been!); used dry pectin (because that is what I had and found a relatively good conversion: 2T dry=1 pouch liquid and I added 1T extra for good measure); added a little green paste color since the mixture was not the pretty green I wanted. All in all, I will use this recipe again with my adjustments. It was plenty spicy...my hubby and I tried some on some crackers with cream cheese as a snack - passed the hubby test!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "My first time ever doing jelly. I had some heirloom Black Hungarian peppers that just went nuts this year and I didn't know what to do with all of them, so I gave this recipe a try. Like other reviewers, I didn't strain the jelly; I prefer a jam-like texture. Anyway, after reading through the reviews, I used about 5 cups of sugar and that gave me a really pleasant sweetness. Like another reviewer suggested, I put some butter in before the pectin and it worked! No foam! I also let the mixture boil for a good 5 minutes after adding the pectin. The taste test I did was sweet (but not overly so), with a nice warming heat after you swallow (my hubby can't do spicy foods, so this was perfect; I seeded all my peppers except three). I can't wait to taste it again after it has time to sit! I will be making this again, as my little pepper plants aren't done with me yet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mfraz"
},
"reviewBody": "It taste and came out great. it was a mild jelly so next time I will add more seeds and ribs of the jalapeno."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joe"
},
"reviewBody": "I was delicious, used only peppers from my garden so it was especially great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Bailey Brown"
},
"reviewBody": "Great recipe! Don’t do it alone the first time! I had to have help when I was boiling the recipe. My sauce pot wasn’t large enough and I panicked! Lol I haven’t tasted the jelly yet, but I’m sure it’s delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Guzauskas Ruby"
},
"reviewBody": "This is my forever-go-to-fav-for-pepper jelly. I tried it several times tweaking the ingredients. I got bad and great results. Learned to keep key components (jalapeño, apple cider and liquid pectin)the same, but found I could change bell pepper color if needed for seasonal color change.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "Loved it! Made some and gave away, been told to make more!! I did leave in some seeds to increase the heat was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ammo"
},
"reviewBody": "Intensely sweet and spicy. I made juice first, from 15 jalapeños and a green pepper. Let it sit and settle overnight, and poured off the clear juice, discarding the sediment. \nThen proceeded with technique described in the Pomona Pectin package. Added two chopped jalapeños to the liquid, with some extra cider vinegar and 2 tsp of pomona’s Calcium water, and simmered 5 minutes. Brought back to a boil, adding ½ cup granulated sugar mixed with 1-½ tsp pomona Pectin, until it all dissolved, then the rest of the sugar (1-5/6 cups) until all done. Removed from heat, filled 2 1-cup jars, and put a slice of fresh jalapeño in, then wiped the rims, sealed the jars and processed 10 minutes. Then I licked the spoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe. While simmering the peppers, I tossed in a handful of frozen berries for color and a hint of fruit. I ended up with more liquid than anticipated, leftover pectin and only had large jars, that when I got the brainstorm to rebatch some 3yo crabapple jelly that never jelled. I do think that 4oz has of pectin was a bit much, will probably use only 3 me time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy McBeth Horton"
},
"reviewBody": "Everyone loves this recipe. Made on 3 different occasions and put it over cream cheese- this is what I discovered: Jalapenos from your own garden are best! If you let the jalapenos sit out on the counter for a few days to dry out you should have no problem with the jelly setting. You can use old wrinkled jalapenos and you can't even tell the difference! Bell pepper is completely optional- couldn't tell a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjf"
},
"reviewBody": "Could not be any easier. Came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jseely"
},
"reviewBody": "I did not strain mine with the cheesecloth. I don’t mind the pulp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D'Ann May"
},
"reviewBody": "I've already made it again.... 3 times to be exact. My boyfriend and his father love it. They practically eat it with a spoon! Really!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy from Kansas"
},
"reviewBody": "This was the first jelly that I made and it came out absolutely wonderful! I splurged on a food processor and this recipe was very simple and quick. Everyone loves it! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy Cooper"
},
"reviewBody": "I made the jelly and thought it was a little sweet. My family thought it was delicious . I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caleb Martin"
},
"reviewBody": "I have made this twice now. Both times it came out great. I used about a half cup less sugar and kept the seeds of all peppers the second time. It came out a little spicier but just as good. I doubled the recipe both times, next time I will probably make a triple batch. I got about five 8oz. jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Magalis"
},
"reviewBody": "Love this jelly. My only problem is that first of all I don’t know how many jars it makes and secondly because I made a triple batch, some of the last jars got hard and turned into rock candy. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dardar"
},
"reviewBody": "I put my jalapenos through a juicer with no seeds or skin. Great recipe thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony Strasburg"
},
"reviewBody": "Easy to make, spice depends on the quality of pepper. I have made this a few times, always happy with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan R "
},
"reviewBody": "I know this was several years ago but I wanted a recipe for pepper jelly and found this with all the helpful comments. The thing I found most helpful was the butter to prevent the foam on top. I remember my mother and grandmother both getting a spoon and saucer and dipping the foam off. I just wish that I could share this with them now. \n\nNow I want to give you a tip. For those of you that want to remove the seeds use a grapefruit spoon. The serrated edges work great to clean them out. Even if you have to cut the pepper open you can use it to scrape the veins and seeds out. \n\nThanks to all of you that wrote the comments and hints. All of us recipe hunters really appreciate finding out from someone \"in the field\" that has really had the experience of making and fine tuning the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ortonio"
},
"reviewBody": "All of the liquid pectin that I could find came in two 3-ounce packets. I had many peppers so I tripled the recipe. I saved a lot of time by just washing the peppers and removing the stems. The seeds aren't going to change anything and they end up being discarded with the pulp (which I add to my compost). I also added some of the vinegar when using the food processor for chopping. The liquid makes the chopping in the processor go faster. I add either red or green food coloring. I also add some finely chopped colorful peppers at the end with the pectin. I highly recommend this jelly served with butterkase cheese on slices of french baguette bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kdelliot"
},
"reviewBody": "I made it exactly as recipe stated, very good flavor, but it was runny. Does set up if kept refrigerated. Made a similar recipe, more sugar, boiled longer after adding pectin, set up perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ole Sullivan"
},
"reviewBody": "Add water to waste pulp, 1 pkg pectin, 1/4 cup lemon juice. Bring to rolling boil, add 6 cups sugar, back to rolling boil for 1 minute. Jar and seal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geeklet"
},
"reviewBody": "I made some revisions, and this turned out great! \n\nI had foraged a bunch of random hot peppers out of my friend's garden, so I just used what I had and made half a batch (1 32-oz Ball Jar). I hand chopped the peppers and it came out to about 2 cups. I also left the seeds in to make it spicy. I boiled them down with 1.5 cups Bragg's ACV for 15 mins. I added in 3 cups of sugar and let it come to a boil (about a minute). Then I pulled it off the heat and threw it into a blender to make it smooth like soup. Next I added an entire package of sugar-free Sure Gel and let it boil for about 1.5 mins. It set up great. No food coloring (that's just weird, frankly); mine is a beautiful green. \n\nMy local grocers never carry jalapeno jelly so this may be in my regular rotation. Also, now my mouth is on fire! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ESpradley"
},
"reviewBody": "This came out great in taste, consistency and color. I used red and green jalapenos which turned the jam into an amber color. I used 6 cups sugar and didn't strain. I would absolutely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebbyC"
},
"reviewBody": "Everyone who tries it loves it. I have shared this recipe with friends and family. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIMSHUNNY"
},
"reviewBody": "This turned out pretty good for my first time making jelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bchapmon"
},
"reviewBody": "Yum, yum and yum. I followed the recipe exactly other than the fact that I used a fine mesh strainer rather than cheesecloth (didn't have any on hand) which seemed to work just as well. I chopped up whole jalapeños in the food processor which added to the heat and now have a beautiful jelly with significant bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen H."
},
"reviewBody": "However, I didn't make it like the recipe reads. I didn't have any cheesecloth so I pureed all the peppers, used red instead of green bell because that's what I had, and my Certo packet was 3 oz instead of 4. I cored/seeded about half of my jalapeños, which were very large and hot. Used 6 cups sugar, and 2 Tbsp of butter right before adding the pectin. My batch yielded 7 1/2 jelly jars. It's super spicy, but I love it.(5 stars for how I did it, 4 for this because I changed the recipe)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "huganrse"
},
"reviewBody": "I was disappointed at the yield, otherwise I would have given it 5 stars. I substituted Splenda for sugar and had to figure out the conversion of powdered pectin to liquid (1 oz liquid = 1 tsp powdered). I kept the seeds in to make it a little hotter. Can't wait to have this over some cream cheese with crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Ellingson"
},
"reviewBody": "made this jalapeño jelly came out perfect love the taste of it thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Gesner"
},
"reviewBody": "Very tasty , wear gloves......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stteeeffff"
},
"reviewBody": "Worked out great, tastes fantastic! Not very spicy, pretty sweet. Next time I'll leave the seeds in. I didn't strain the pepper pieces out because I wanted them for the texture and appearance. Pairs well with cream cheese on a club cracker or bagel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DebKoerner"
},
"reviewBody": "I made this without straining and added the 6 cups of sugar as raearendt suggested. Mine came out good, but the vinegar seems a little strong. I don't know what would happen if I cut it back a bit. Will definitely make this again. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Bianco"
},
"reviewBody": "The taste is fabulous!! My jalapenos from the garden had turned red (too long on the vine) so the result is a beautiful vibrant red color. I added the chopped jalapenos in green so it has a great holiday look! I agree with the other comments that it didn't produce enough liquid. I panicked and then thought to reboil more APC with the peppers which seemed to work. I can't imagine that the peppers would lose all their heat in the first boil. I'm a little unsure about the pectin as I only had powdered but I found some info on the web about conversions. If it doesn't set properly, I'll just use it as a meat glaze/marinade. The flavor right now is stupendous! And for the commenter who was looking for the Pepper Relish recipe (similar to H&amp;D) there is a great one on the web from Copycat Cook. :) Thanks for the great recipe, I'm new at canning but I think I'll be a converter soon! :) ENJOY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shannon Lindau"
},
"reviewBody": "I gave made this many times and have altered it several ways. My favorite way is to puree the peppers after cooking instead of straining them. I put my immersion blender into the pot and it gets a smooth consistancy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneMarie Lomuscio-Annese"
},
"reviewBody": "I loved this recipe was easy to follow. I did have extra liquid but was able to use for hot sauce. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kyle Montgomery"
},
"reviewBody": "easy and sweet with a nice kick to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cajun Jason"
},
"reviewBody": "So good we're making it the second time. A very good blend of peppers and sweet. I thought this good stuff only came from Texas, I guess I was wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "We can't keep this stuff around, it is so good!!! The peppers float, but that doesn't effect the taste at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcrossbutcher"
},
"reviewBody": "I didn't strain the jalapeno mixture as I wanted it more of a jam consistency. It was absolutely wonderful. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Turned out great! We had it on toast topped with cream cheese and eggs over easy for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Lape"
},
"reviewBody": "Is this recipe supposed to be firm or a little runny? I followed this recipe to the letter, and its a bit runny. Just wondering!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andpav75"
},
"reviewBody": "Don't add more sugar like some of the other reviews state, way too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott K"
},
"reviewBody": "Very good. I make a batch every year from the garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken Sweeney"
},
"reviewBody": "Easy to follow. \nThis was the first time I've ever made jelly/jam, OMG how easy it was and only took about a hour. \nI did add to the recipe though, I added 1 tlb spoon of lemon extract, medium red and yellow bell peppers and Serrano peppers(i like it with a kick!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Millie"
},
"reviewBody": "I loved this recipe, so easy and just made one batch and on my way to get another bunch of jalopenos. I left the pulp in as well, like it better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John E Lairson Jr."
},
"reviewBody": "Great jelly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cindy"
},
"reviewBody": "Great recipe! Just read the directions, and it works great. I got more juice than the recipe said I should get, but I just measured the juice, and added the proper ratio of sugar and pectin. And as others said, just add a little more or less peppers to the juice to make it hotter or to give it more substance. I also just did this with red peppers and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Waltz - WL Events"
},
"reviewBody": "What an incredible recipe. Made a big batch with peppers from our garden. Gave samples to many friends, everyone raved about it. Still have one canned jar. Save it for a special occasion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Dunn"
},
"reviewBody": "This recipe is most excellent. It is a good base and you can tinker with it a few ways to adjust the heat, sweetness, and taste to your (and everyone else's) liking. I have a huge bag of frozen jalapenos and habaneros which have lost a bit of their heat. I use 8 thawed jally's, 1 thawed Habby, and 4 fresh Jally's (and the bell pepper) for the first step. \n\nWhen I strain the cider/chopped pepper mix, I let an arbitrary portion of the crushed/boiled/chopped peppers into the liquid. Puts a little more substance and flavor into the jelly.\n\nFor the 4 chopped jalapenos it calls for at the end, I use 4 fresh ones from the garden, 2 regular, 2 \"mild\". I also use a thawed habanero I have. I do not de-seed. If seeds come out so-be it, but whatever is there I keep in.\n\nThe jelly is phenomenal. Everyone loves it and I have been asked for some jars. I have tried it on hamburgers and it is terrific. Plain hamburgers and also experimented on one with egg and bacon also.... OMG! Went really well on Pretzel Crisps too. \n\n\nIn all, being as efficient as possible, it takes just over an hour to complete. It is well worth it and this jelly is going to be a frequent destination for my garden peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I make this a lot. If I want it hotter, I add more seeds. Milder, I use flavored jello. Splenda also works to make it lower calorie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie"
},
"reviewBody": "Great recipe, jelly was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Marshall"
},
"reviewBody": "This is the best ever!! Just a bit of zing. Sets beautifully"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Wonderful jelly! I did not strain the peppers, but followed the recipe otherwise. Set up beautifully and had a nice kick...Great w/ cream cheese on crackers. I will be using this recipe again~YUM! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Albright"
},
"reviewBody": "This is an excellent condiment or addition to chicken and fish recipes. When heated it becomes a wonderful glaze. I sometimes mix it with prepared mustard for a sweet n sour spicy glaze or dipping sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hccs2000"
},
"reviewBody": "Great Recipe. I use a zester to remove the skin of the peppers before chopping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Damian Alexander Bur-ford"
},
"reviewBody": "I've made this bad boy several times now. Always great! I use raearendt's ammended 6 cups of sugar rule and got ! It works great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "backwoodsdog"
},
"reviewBody": "This recipe DOES make 4 8 oz. containers (ignore 11/13/2003 staff comment to contrary). Used Certo liquid pectin and found that 4 oz. is too much. Batch made with a 3 oz. packet of Certo was far superior."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mae Batista"
},
"reviewBody": "I made a bunch for Christmas gifts last year and people are STILL talking about it and asking if I have more. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthadeltorro"
},
"reviewBody": "I followed the tips provided by the first reviewer (raearendt). I did not strain or remove seeds. It made a wonderful, slightly spicy pepper jam. My husband,who isn't a huge fan of jalapenos or anything spicy, loved it too. Note: when you don't strain you end up with much more than 2 eight oz jars from this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/47520/jalapeno-jelly/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
"name": "Jams and Jellies Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/47520/jalapeno-jelly/",
"name": "Jalapeño Jelly"
}
}
]
}
}
, "about": [
]
}
]