				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jamaican Brown Stew Chicken"
,"datePublished": "2020-09-29T17:40:41.000-04:00"
,"dateModified": "2022-09-14T06:45:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This brown stew chicken is Chef John&#39;s version of the famous Jamaican stew. This Caribbean dish is sweet, savory, and spicy with jerk chicken flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Nbw5sze82YEZMf_lMm62l83HPhs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8589870-jamaican-brown-stew-chicken-Chef-John-1x1-1-d75eb0ca746c429d91746e5debbb461c.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6195705112001",
"description": "",
"duration": "PT9M26S",
"name": "How to Make Jamaican Brown Stew Chicken",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2d4a2f74-cc76-4cfa-bcb8-2ee5616398d8/c988042a-712c-471f-875a-bb093d5bed50/1280x720/match/image.jpg",
"uploadDate": "2023-03-10T12:04:09.056-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jamaican Brown Stew Chicken"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "40"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "343 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "91 mg"
,"fiberContent": "1 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1319 mg"
,"sugarContent": "10 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT40M"
,"recipeIngredient": [
"4 cloves garlic, minced",
"0.5 cup sliced green onions, white and green parts separated, divided",
"2 tablespoons packed dark brown sugar",
"2 tablespoons fresh thyme leaves, chopped",
"1 tablespoon minced habanero pepper",
"1 tablespoon cider vinegar",
"2 teaspoons minced fresh ginger root",
"2 teaspoons kosher salt",
"1 teaspoon freshly ground black pepper",
"1 teaspoon smoked paprika",
"0.5 teaspoon ground allspice",
"8 (5 ounce) bone-in, skin-on chicken thighs",
"3 tablespoons olive oil, divided",
"1 large yellow onion, diced",
"1 pinch kosher salt",
"1 tablespoon brown sugar",
"4 cups chicken broth",
"0.33333334326744 cup ketchup",
"2 bay leaves",
"1 cup sliced carrot",
"1 cup quartered baby bell peppers" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk together garlic, white parts of green onions, brown sugar, thyme, habanero, vinegar, ginger, salt, pepper, paprika, and allspice in a large mixing bowl."
} ,{
"@type": "HowToStep"
,"text": "Make 2 cuts, about 1-inch apart, into the skin side of each thigh, perpendicular to the bone, cutting all the way down to the bone. Add chicken thighs to marinade; mix until evenly coated. Cover and place in the refrigerator to marinate, at least 4 hours or up to 12 hours. If possible, flip thighs several times while marinating."
} ,{
"@type": "HowToStep"
,"text": "Remove chicken from marinade. Scrape off any chunks of marinade from chicken into the bowl and reserve for later."
} ,{
"@type": "HowToStep"
,"text": "Heat 2 tablespoons oil in a large, deep, heavy-bottomed skillet or Dutch oven over medium-high heat until almost smoking. Working in batches, brown the chicken all over, about 5 minutes per side. Transfer chicken to the marinade bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 tablespoon oil in the same pan over medium-high heat. Add onion and a pinch of salt; cook until golden brown, 3 to 5 minutes. Stir in 1 tablespoon brown sugar and cook until onions are dark brown and caramelized, 3 to 5 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Add chicken broth, ketchup, and bay leaves to the pan; bring to a boil. Add carrots, bell peppers, browned chicken thighs, and reserved marinade."
} ,{
"@type": "HowToStep"
,"text": "Reduce heat to medium-low. Simmer, stirring occasionally, until chicken is tender and no longer pink in the center and sauce has reduced and thickened, 1 to 1 1/2 hours. Skim excess fat that floats to the top; baste chicken occasionally with sauce."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Nbw5sze82YEZMf_lMm62l83HPhs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8589870-jamaican-brown-stew-chicken-Chef-John-1x1-1-d75eb0ca746c429d91746e5debbb461c.jpg"
}
]
,"text": "Taste and adjust seasoning. Stir in green parts of green onions."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT360M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "Incredibly flavorful and delicious, filling and comforting. It had just the right amount of heat for my tastes-- a pleasant, buzzy, medium spice. I made four chicken thighs instead of eight and marinated for about a full day. The extra sauce was great for the white rice I served with the dish. I simmered the chicken for about a full hour and it was the perfect amount of time; the chicken basically fell off of the bone. The sauce took about another full hour to reduce, so in the end it did feel like quite the process. I do think that I didn't heat the oil quite enough to really brown the chicken the way it did in the video, so I would try to remedy that next time. I also forgot to add the extra green onions at the end and accidentally used the dark parts in the marinade. But no matter, this still turned out to be an A+ dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was good but not as great as Chef John’s magical Jerk Chicken marinade,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "All I will say is if you follow the instructions as shown… Babyyyyyy your dinner will come out just as you anticipated it would! I had to pop my hand to stop going back for sneak tastings. 5 stars!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Rhudy Tsapalas"
},
"reviewBody": "Made this tonight and followed recipe. My entire family loved it and they are picky. thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really delicious wit a rich Caribbean flavour. I customised it by spicing it up a bit and it was perfect!! Went down really well with family and friends at Christmas dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yes, I used diced and fresh tomatoes, green, red, yellow peppers, less sugar, additional spices, crushed pepper flakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacyanne"
},
"reviewBody": "This is an exceptionally flavorful stew! It was a massive hit and has already been requested again. The sauce is delicious and was perfect over top rice. It was also great to reheat for lunch the next day. I would increase the spice a little bit and maybe add some spicy peppers and more bell peppers. A wonderful dinner that will be enjoyed again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing. I’ve made a lot of Jamaican food and this is something I tried for my family. They absolutely loved it. My girlfriend said it’s the best chicken dinner she’s had from me. Will definitely be one of my dishes I’ll definitely cook every week. Didn’t have any scotch bonnet so replaced it with hot cayenne pepper powder as it wasn’t spicy enough. Thank you whoever put this up 😍."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "A delicious stew which can be easily adapted to your heat/sweet taste preferences. I skipped the habanero pepper because of a guest with a sensitive stomach but otherwise made as directed. I then served hot sauce on the side for anyone who wanted some heat. Everyone raved about it. I'm looking forward to making this in the future with the habanero and freezing half for a future meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is fantastic. It reminds me of authentic Jamaican brown stew chicken. I should know I have been to Jamaica more than 28 times. I did make a few changes. Instead of using ketchup I chopped two fresh tomatoes. I also only added 2 cups of chicken stock instead of four. The other change I made was I simmered it out on my big green egg barbecue in a cast iron skillet. After about 1 hour and 15 minutes at 325 degrees I took it off the pit and remove the chicken to a plate to keep warm and then I simmer the sauce on the stove to reduce it a little. I served it over rice. It was perfect! I have more pictures but it only allowed me to put one on here. I used Scotch bonnet pepper instead of habanero since I grew them last year. I froze them in the freezer. I definitely 100% recommend this recipe 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karnerdrummer"
},
"reviewBody": "This was delicious! We just came back from Jamaica and loved the resorts brown stew chicken. So tried this recipe. It was so good. We did replace the bell peppers with cut up potatoes and replaced the habanero pepper with Jalapeno pepper. It was sooo delish! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkg7t"
},
"reviewBody": "Five star recipe without question. My husband was drooling just at the smells and the taste did not disappoint. I only marinated for four hours (unintentionally- I just kept getting distracted and forgetting) and it was still so flavorful and delicious. I'd run out of carrots so added in some zucchini and took the suggestion of less sugar in the marinade and diced tomatoes instead of ketchup. I also served over rice cooked with chicken broth and peas. My race wasn't perfect so I followed his advice and removed the chicken for the last 30 min or so and let the sauce reduce some more. Chef John recipes are so reliable, you really can't go wrong. Another win in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gavin Maximus"
},
"reviewBody": "I made this recipe without hot peppers coz I'm not into spicy food. I didn't use more brown sugar to colour the sauce coz I thought it would be too sweet. And, I used corn starch to thicken the sauce at the end when I thought I had the right amount of sauce left. Oh, and I used 10 pieces of chicken instead of 8 pieces coz I didn't want the two pieces to feel left out. It turned out amazingly! It's so delicious. I'm definitely going to make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakerJeff"
},
"reviewBody": "Very good! Ended up marinating for 3 days because of unplanned events, still tasted fabulous! Thank you chef John! Served with rice and peas and Jamaican coco bread! All paired perfectly together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lillyanne"
},
"reviewBody": "I doubled the spices on the chicken and let it marinade thee days. Other than that, no recipes changes. I have no idea what Jamaican chicken is suppose to taste like, but I did enjoy this stew. I thought it tasted better the second day. Reheats in the microwave really well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "I made this, and instead of using boned chicken I used 2lbs of skinless boneless chicken breasts....I also used a dried peach ghost pepper finely diced in place of the scotch bonnet....I think this turned out delicious ! It was only better the second and third day...Thanks, this is a keeper recipe for me !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "AMAZING recipe! My 'taste testers' at work absolutely inhaled this one. The only minor changes I made was that I did decrease the brown sugar to 1 T total; I used 2 habaneros (woo!); and I did use a couple of tablespoons of browning sauce. Delicious and it will most certainly stay in my recipe rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ikyra Davis"
},
"reviewBody": "Great recipe, however chicken should be cut in to smaller pieces we never brown stew a whole chicken. Use scotch bonnet pepper and scallion as well. Your recipe is awesome love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla"
},
"reviewBody": "I wrote long review which is not in the reviews. I messed up the recipe which made it easier and it came out FANTASTIC. Added fresh thyme to the dry rub as in video but not the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deanna leigh"
},
"reviewBody": "My husband is Caribbean (trini not Jamaican, but close enough!) and he said this tasted so similar to what his grandma makes!! He LOVED IT. I roasted some carrots on the side so instead of carrots in the dish I used halved mushrooms, which soaked up the sauce and were so tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ehamilton"
},
"reviewBody": "Elijah’s favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "Complicated recipe with very little taste. Marinated the chicken for over a day. Followed the directions and used ingredients as recommended. Was not impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bambi"
},
"reviewBody": "This was fantastic. First time making brown stew chicken for my in-laws, who are Jamaican. They raved about the \"cooked down chicken\"! I got the seal of approval! Marinated the chicken over night, tossing it a couple times. The only change I made was I reduced the brown sugar in the marinade from to 2T to 1T. Served it with Jamaican rice and peas, done in the instant pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Will"
},
"reviewBody": "Great no changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kiki"
},
"reviewBody": "The marinade tasted so good, my mouth was watering from the start. I used purple sweet potatoes instead of carrots and the taste was amazing.. but they got a bit too soft during cooking (I bet carrots would hold up better). DEFINITELY a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malkin"
},
"reviewBody": "Easy and very tasty! Watch the video for extra tips. This will become a regular at our house. Kids and adults loved it.\n\nNote: Directions call for bell peppers, but they are missing from the ingredients list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "losthollow"
},
"reviewBody": "I made this for our guests last night and it was fantastic. I didn't mess with the peppers or carrots, and marinated the chicken in the rub for 2 days instead of 8 hours. I also cooked it in a slow cooker for a few hours after I seared the meat in a skillet. I highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christophe Grimault"
},
"reviewBody": "Great flavor, I made Rice and “peas” Jamaican recipe for the side. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLouthan"
},
"reviewBody": "This was delicious! I made per the recipe, except for dried thyme instead of fresh. I also used jarred jalapeno chopped up for the marinade and added a fresh small jalapeno when I added the bell pepper.\nI added asparagus as well, and next time I think mushrooms would be really good.\nI didn't find it too sweet but I think without the jalapeno I would cut some of the sugar.\nThis reduced really well. The instapot would be easier but I'm not sure how well it would reduce.\nNot a lot of gravy, but full of flavor! The braised chicken was oh so tender. This kept well for leftovers too, and in my opinion was even better the next day. \nThanks for something different!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foody"
},
"reviewBody": "I marinated “skinless” chicken thighs (no fat skimming needed later) in the marinade overnight. Didn’t have habanero, so used 2 serrano peppers, seeds/ribs removed. The heat was the right amount for us, just enough to warm you up from the inside and still taste the food. I did sub the acid with pineapple/pineapple juice instead of the ketchup b/c of tomato allergies in the family, and added some cornstarch/water mixture to thicken the sauce in the end. Served it over a mix of wild/brown/white rice. The sauce makes this a nice dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "courtney c"
},
"reviewBody": "Excellent flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Bacon"
},
"reviewBody": "Very good-even my kids liked it which says a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Heitman"
},
"reviewBody": "I modified it a bit. I took the chicken skin off but used the grease to saute my onions in. I put the marinade, onions and chicken thighs in a baggie to marinade overnight. This morning I put about 3 cups of chicken broth and dumped the baggie into the crock pot and I am cooking it on high and will have it over white rice. It smells amazing! I cant wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JK"
},
"reviewBody": "Flavors were great! I was hesitant to let it simmer uncovered. In the end, I uncovered for a while but there was still a lot of liquid which was OK by me but I do think the next time we do this, we will simmer uncovered per the directions. Another habanero pepper or two to increase the heat is also probably in order. A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kristen Taylor"
},
"reviewBody": "Like other people have said, add some cayenne pepper or add the habanero peppers at the last 15 minutes of cooking. I really loved the taste of this but it had zero heat or spice to it. I would also cut out a tablespoon of the brown sugar because it makes it really sweet. Also, I would use boneless chicken thighs because the bones and cartilage breaks down during the cooking. Lots of cartilage and bones to pick out of your mouth is no fun! I will make this again with adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aputler"
},
"reviewBody": "This was an extraordinary dish! Made as written my first time. For personal preference, I'll cut braising liquid by about a cup next time. Served over jasmine rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farmer John Jensen"
},
"reviewBody": "Turned out great. Added Cayenne pepper, as it was too mild at first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Sheldon"
},
"reviewBody": "I made it exactly as Chef John stated except for fresh thyme. I had to use dried thyme leaves instead. This is a fantastic recipe. It had only a small amount of heat with the habanero, just right for me. Even my wife, who isn't much for spicy, had seconds."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/281733/jamaican-brown-stew-chicken/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/657/soups-stews-and-chili/stews/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/281733/jamaican-brown-stew-chicken/",
"name": "Jamaican Brown Stew Chicken"
}
}
]
}
}
, "about": [
]
}
]