				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Japanese-Style Cabbage Salad"
,"datePublished": "2020-06-18T23:32:34.000-04:00"
,"dateModified": "2022-11-25T15:08:00.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cynthia"
,"url": "https://www.allrecipes.com/cook/1624134"
}
]
,"description": "This Japanese-style cabbage salad is a healthy slaw with green onion and almonds tossed in a sweet dressing of sesame oil, rice vinegar, and ginger."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MrVycZaPbJCKZMnCWeDwQV0ufMU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9093408-30885b060ce64737b55619a7cc5806a8.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Japanese-Style Cabbage Salad"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "62"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "126 kcal"
,"carbohydrateContent": "8 g"
,"fiberContent": "3 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "208 mg"
,"sugarContent": "4 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.5 large head cabbage, cored and shredded",
"1 bunch green onions, thinly sliced",
"1 cup almond slivers",
"0.25 cup toasted sesame seeds",
"3 tablespoons sesame oil",
"3 tablespoons rice vinegar",
"1 tablespoon white sugar",
"1 clove garlic, minced",
"1 teaspoon grated fresh ginger root",
"1 teaspoon salt",
"1 teaspoon black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine cabbage, green onions, almond, and sesame seeds in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Make dressing: Whisk together sesame oil, vinegar, sugar, garlic, ginger, salt, and pepper in a small bowl until sugar is dissolved."
} ,{
"@type": "HowToStep"
,"text": "Pour dressing over cabbage mixture and toss until well combined."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "An all right flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jood42"
},
"reviewBody": "I halved everything in the recipe, and the sesame oil was so overpowering, it was inedible. I love bold flavors, and I cook Japanese dishes 3-4 nights a week, so it's not down to an unfamiliarity with the ingredients. I think the proportions are just way off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cupcakes and Cutlery"
},
"reviewBody": "This easy Cabbage Salad was so easy and really refreshing. This is a great side dish for any meal, especially one with sesame or ginger flavors. It was flavorful and will be a good summer salad to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Super simple and very tasty! I used all the 'optional' ingredients. The family liked this for a change from the normal slaw. I thought it could actually use a bit of spice, like maybe some jalapeño or hot chili oil or something. I will be making this again! Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsey Riley"
},
"reviewBody": "This Japanese-Style Cabbage Salad was incredible! The crunchy cabbage paired really well with the refreshing sesame dressing. We enjoyed this recipe so much that I already made it a second time this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Stadelman RDN"
},
"reviewBody": "I had this as a made side dish that went with chicken. The dressing really makes this dish and I felt like it would make a good marinade too. I changed the salad a bit as I used what I had on hand but great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "3.14.21 To me, this is coleslaw with an Asian flare, and there’s nothing wrong with that. We liked it well enough, just think there was nothing really special about it, and that’s OK too. It was a solid coleslaw with a dressing that tasted like many other dressings that I’ve had. A little kick of heat certainly wouldn’t hurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "breeworth"
},
"reviewBody": "We loved this...super easy to make and the kids like it too! Word to the wise... if you have never toasted sesame seeds in your oven, they give Mexican jumping beans a run for their money!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gladcam"
},
"reviewBody": "Delicious! I had a green cabbage and no green onions, and added chopped up pink sushi ginger for some flavour and colour. The dressing worked well, but I added some sushi ginger liquid and that worked rely well and “brought it home” flavourwise. The almonds and sesame seeds gave it a great crunch . It will happen again...paired it with some teriyaki salmon.....Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cook from sf"
},
"reviewBody": "I ran out of my usual rice vinegar so, I had to substitute a generic brand since the grocery store was out of my tried and trustworthy brand. Depending upon which rice vinegar used, the tartness can be over powering. I would suggest tasting the dressing as one pours the vinegar in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Simpson"
},
"reviewBody": "My family really enjoyed this salad. I added rice noodles and sugar snap peas to my version and the flavors were wonderful. Easy way to get the kids to consume cabbage for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "parndee"
},
"reviewBody": "I made this recipe according to directions, omitting the optional garlic. There was too much acid in the recipe and the flavors did not marry well. The ginger, especially, did not belong in the recipe, and I found the overall mix of flavors unappealing. I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Edmiston"
},
"reviewBody": "I've made this with three types of cabbage: regular, red, and Napa. Every one of these was perfect. The Napa was the least gassy of them all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SSC"
},
"reviewBody": "I love the crunch! I added broccoli and orange sweet peppers because I had them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JCM"
},
"reviewBody": "I subbed (triple filtered) coconut oil for the sesame, and honey for sugar. I adjusted the dressing by taste instead of measuring. I added in julienned green and pink lady apples for a sweet crunch, and left out the almonds. It was really tasty I plan to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marge"
},
"reviewBody": "Delicious. Take the time to toast the sesame seeds - 350F in the toaster oven until they turn just slightly brown. A reviewer doubled the dressing, but I actually doubled the cabbage using the whole head, and it was perfect. Almonds add a nice crunch. I may add dried cranberries next time or mandarin slices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladybug"
},
"reviewBody": "This \"Japanese-Style Cabbage Salad\" was both tasty and attractive. The dressing was nice and zippy: I made my dressing with fresh ginger and lots of pepper (and a tad of garlic powder rather than the fresh garlic called for since I was making only 2 servings). I made my salad with red cabbage, and the loads of almond slices and loads of sesame seeds, as well as the green onion, contrasted with the red cabbage beautifully. I think this would be a wonderful salad to take to a potluck. If I were to make this salad again, I would let my sliced green onion rest in the vinegar and honey by themselves a little longer before adding the rest of the ingredients (like I usually do) to remove the \"skunky taste\" from the onion. Thank you Cynthia for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Volleyballmom"
},
"reviewBody": "I followed the recipe exactly except that I subbed out the sugar and used honey. It is a nice fresh salad but found it a little underwhelming. We felt it needed something to spice it up a bit. Glad we tried it though. Thanks Cynthia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I used half savoy cabbage and half purple, the salad was very pretty and had great crunch. Overall, I enjoyed the salad, although I would substitute half of the sesame oil with another oil next time as the sesame taste did take over the salad slightly as other reviewers found."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy Kitty"
},
"reviewBody": "Very good slaw! It was simple but went perfectly with the mahogany chicken wings. The dressing could have used a little more sugar and I also used fresh ginger and let the dressing sit for a few hours. It's a keeper especially since it's so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delish"
},
"reviewBody": "Excellent! Love the flavors--the fresh ginger stands out, as does the sesame oil and rice wine vinegar. Love the addition of the slivered almonds and sesame seeds. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SWEETJAM"
},
"reviewBody": "This was very good. Next time I will shred my cabbage to a coarser texture. I did it in the processor because I was lazy and it was too fine. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "To give this salad a little \"kick\", I added a dash of Sriracha Hot Chili Sauce. I did not add the full amount of salt and pepper, I added it to taste. I made this around noon today as to give it time to sit in the dressing until dinner. VERY good, though my husband and I thought this needed more dressing. Next time, I will double the dressing ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daysee"
},
"reviewBody": "Just exactly what I was looking for! Used this for a filling in a turkey wrap. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StacyB1012"
},
"reviewBody": "Amazing. As is. Nothing else needs to be said. Just amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebbieS"
},
"reviewBody": "This was such a hit at my daughter's graduation party. I replaced half the sesame oil with half olive oil. I added shredded carrots for color and omitted the sesame seeds. I kept the other ingredients the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajschueler"
},
"reviewBody": "Great, light salad. I substituted peanuts for the almonds as another reviewer suggested (it was what I had on hand). I found the dressing to have a nice tang to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holidaze"
},
"reviewBody": "Absolutely what I was looking for. I had to use white vingegar because I was out of rice vinegar. And I was almost out of sesame oil. So I used half that and half sunflower oil. I also addes fresh mandarin oranges. But I think the recipe would have been wonderful as is. Thank yo so much. \nFantastic. I will be taking it to a simple dinner this afternoon, where they will be serving an oriental chicken soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DStam"
},
"reviewBody": "This salad was delicious! My husband and I lived in Japan for a couple years, and we're always looking for side dishes to go with our salmon and rice. This one was perfect!\nThe only thing I didn't add was the almonds. I also replaced the sugar with honey. Everything else I followed to the letter. I can't believe how fast and easy this was to make, I will be making it many more times, I'm sure. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsty Buchanan"
},
"reviewBody": "Great yummy salad but you really need to chop the cabbage thinly and I recommend using all the sugar as suggested"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hilarybear"
},
"reviewBody": "This is fantastic. I have made it a few times and it is always a crowd pleaser. I personally like using red cabbage because it makes a really pretty salad, and I have added julienned carrots and it looked and tasted great. I've also added cucumber which is also tasty. I followed some other reviews and used honey as opposed to sugar and it tasted really nice. Don't skip out on toasting the sesame seeds - it really gives it that nutty flavour. The dressing is really versatile too, I've contemplated using it for other salads, and it would probably be tasty with shrimp. This is my favourite cabbage recipe, thank you for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debbie Z"
},
"reviewBody": "I didn't use the ginger or garlic that it said was optional, and I found the dressing to lack a lot of flavor. It seems like a good basis, but it needs more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn't use the ginger or garlic that it said was optional, and I found the dressing to lack a lot of flavor. It seems like a good basis, but it needs more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobbi123"
},
"reviewBody": "When I made this I added some grated carrots and used all the optional ingredients. It was good, but my husband and I both agreed the dressing was a little too tart. I'll make again and either add a little extra sugar or replace the sugar with honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef4Six"
},
"reviewBody": "Nice crunch. Oriental flavoring. Good, quick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This salad is so delicious! The best cabbage salad ever. I am definitely adding this to my repertoire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yvetteski"
},
"reviewBody": "Very refreshing. I used a combination of toasted and plain sesame oil and added the juice of a lime. I also switched a scant quarter cup of unsalted, roasted peanuts and 2 Tbs of sunflower seeds for the almonds. Like others, I added 2 shredded carrots, but next time I would add one more and perhaps add a julienned red pepper. Instead of pepper, I used Siracha and a dash of cayenne. I served it with Asian pork tenderloin and basmati rice. This will definitely go into rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Great w/ Asian food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sangria"
},
"reviewBody": "Excellent salad. I added sunflower seeds to mine. The texture of this salad is sooo crunchy. Dressing has a zing to it...definately a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Florence"
},
"reviewBody": "I made this to go with a Japanese chicken dish, because I had half a head of cabbage to use. I was out of scallions, which would have helped a lot, and I chose not to bother with the almonds. I added two shredded carrots, did use the garlic, and used only 1/2 tsp pepper. Not bad, but the sesame oil was too overpowering. I ended up using another Tbsp each of sugar and vinegar to try to counteract the oil. If I make it again, will use 1 T. sesame oil and 1 T. canola, with the same amt. of other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane's Midwest Cooking"
},
"reviewBody": "I'm giving it 5 stars because I like the dressing. I did start modifying before I tried the original recipe because...I'm serving it to guests tonight and I wanted to take advantage of all of the good cooks' recommendations. I added carrots and broccoli, changed the sugar to honey and otherwise did as instructed. It's a wonderful slaw salad and uses many of my garden veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "main"
},
"reviewBody": "This recipe was a huge hit for a sushi party I threw recently. I did double the sauce as I found it a little light. Very tasty and is now added to my recipe box as a favorite. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "Just added 1 shredded or julienne carrot &amp; garnished with fresh parsley. Simply refreshing, healthy &amp; delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "texas"
},
"reviewBody": "This was really good. It made a huge bowl. I would cut it in half next time since my husband and I are the only ones that would eat it.\nthanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LITTLECHILE"
},
"reviewBody": "I tweaked this recipe a bit so that is why I don't have 5 stars....I added julienned carrots, blanched broccoli florets and instead of vinegar in the dressing I used lime juice and used honey instead of the sugar. I really liked the flavour but thought it needed a bit more dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladibugsnacking"
},
"reviewBody": "This is really great. I think this would be fantastic followed as is, but I made the following modifications for my own personal taste. I added about 1/4 cup of shredded carrots, I used roasted salted peanuts instead of almonds, and about half a bunch of green onion (a whole bunch seemed like too much)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Morosko Williams"
},
"reviewBody": "Great recipe. Very fresh and light. A nice healthier option to regular coleslaw"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/150135/japanese-style-cabbage-salad/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/699/world-cuisine/asian/japanese/",
"name": "Japanese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/150135/japanese-style-cabbage-salad/",
"name": "Japanese-Style Cabbage Salad"
}
}
]
}
}
, "about": [
]
}
]