				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jeanie&#39;s Falafel"
,"datePublished": "2019-04-02T02:47:17.000-04:00"
,"dateModified": "2019-04-02T02:47:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JeanieMomof3"
,"url": "https://www.allrecipes.com/cook/1348895"
}
]
,"description": "This is a tasty dense falafel that contains no eggs. Serve on pitas with tzatziki or tahini sauce with lettuce and tomato."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DvelBYojAHscs098YVwX831ElKI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/66176-ec3af40e1d14445d96c176378b2a9a24.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jeanie&#39;s Falafel"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "251"
}
,"cookTime": "PT7M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "317 kcal"
,"carbohydrateContent": "35 g"
,"fiberContent": "5 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "724 mg"
,"sugarContent": "2 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (19 ounce) can garbanzo beans, rinsed and drained",
"1 small onion, finely chopped",
"2 cloves garlic, minced",
"1.5 tablespoons chopped fresh cilantro",
"1 teaspoon dried parsley",
"2 teaspoons ground cumin",
"0.125 teaspoon ground turmeric",
"0.5 teaspoon baking powder",
"1 cup fine dry bread crumbs",
"0.75 teaspoon salt",
"0.25 teaspoon cracked black peppercorns",
"1 quart vegetable oil for frying" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mash the garbanzo beans in a large bowl. Stir in the onion, garlic, cilantro, parsley, cumin, turmeric, baking powder, bread crumbs, salt and pepper. Do not be afraid to use your hands. Shape the mixture into 1 1/2 inch balls; you should get 18 to 24. If the mixture does not hold together, add a little water."
} ,{
"@type": "HowToStep"
,"text": "Heat the oil in a deep fryer to 375 degrees F (190 degrees C). Carefully drop the balls into the hot oil, and fry until brown. If you do not have a deep fryer, heat the oil in a heavy deep skillet over medium-high heat. You may need to adjust the heat slightly after the first couple of falafels, and be sure to turn frequently so they brown evenly."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT32M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "Didn’t work for me at all. I followed the directions exactly and they fell apart in the fryer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Sugar"
},
"reviewBody": "I liked this as a base to start off with, but like some others I added an egg for binding purposes. I didn't have fresh cilantro so I used dried. I think that might affected the color and taste (I'm used to falafel being very green), but these were still tasty and everyone who ate them loved them. I'll probably make this again when I'm craving it, but will use fresh cilantro next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucero"
},
"reviewBody": "i put only one garlic and yes of course i will do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "Will definitely make this again. Only change I made was to use curry instead of cumin (I was out of cumin) and added an egg and a little water. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather T."
},
"reviewBody": "The flavor is fantastic in this recipe! The mixture was dry so I did add a little water per the recipe and that helped it to stick. The first batch I made turned out great, the second was much lighter in color and slightly fell apart. The third and final batch completely fell apart and became mush. Instead of falafel pitas, I made a falafel-esque salad with lettuce, tomatoes, tzatziki sauce and the \"mush.\" Still tasted great. I'll try baking it next time like a few reviews suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "These are SOOOOOOOOO good!!! I did have to add water to make them stick together and probably should have used more than I did because they were a little on the crumbly side after cooking but still WOW!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeremy Lugo"
},
"reviewBody": "I followed the recipe and when I put them in my deep fryer, they completely disintegrated and the crumbs burned in the fryer. I threw them out and am making pasta instead. They need eggs as a binding agent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzi135"
},
"reviewBody": "Loved this, with a few modifications. First I used my food processor and added an egg. It was still a little dry, so I did add a little olive oil to get it to blend. Next time, I'll add 2 eggs as I'd prefer the moisture come from them. The flavor is outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Barbara Skadberg Chavez"
},
"reviewBody": "The falafels tasted quite good, but no matter what I tried, the balls fell apart in the fryer. I lost quite a bit because of that. I would love suggestions on how to make the falafel balls hold together while frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "Excellent! Mine held together quite well even though I didn’t need all the bread crumbs. I did use gluten free ones, though. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This was very good. I added an egg as others have suggested and pan fried it. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelsy Gross"
},
"reviewBody": "I added a couple of eggs instead of water. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hellotiffy"
},
"reviewBody": "They're delicious!!! Not too many ingredients and they'll satisfy your Mediterranean cravings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loveleecakeshop"
},
"reviewBody": "I've used this recipe multiple times and love it. I usually add one egg so it doesn't fall apart when frying. I omit the baking powder because I thought that was the culprit in my oil bubbling over (only happens towards the last two batches of frying). But it wasn't the baking powder. Anyhow, this is an awesome recipe! Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrK"
},
"reviewBody": "Very good, and I'm Greek, so I know good Mediterranean food. However, I baked them at 400F for 30 minutes instead of frying them. They came out great, crispy on the outside, soft on the inside. Served them on a warm pita with homemade tzatziki, tomatoes, cucumbers.\n\nWhen blending in the food processor, I added the beans last, then mixed at high speed until the mix started to get hot and clump together. I think this is the trick to make them stay together and not fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StinkySweet"
},
"reviewBody": "I made this just because I had a lot of garbanzo beans (which I hate) and bread crumbs. It is amazing! this will now be a staple in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat Lynn"
},
"reviewBody": "Easy and delicious! I added an egg and a little water for moisture. As long as the oil is hot, you will get a nice crust! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sincerity"
},
"reviewBody": "I made this twice. First I deep fried them and most just fell apart. I tried to fry them on the skillet and those too fell apart. So I read some reviews and then added one egg and dipped them in flour before frying on a skillet. Success. I did include tumeric and red crushed pepper and cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jan"
},
"reviewBody": "I followed the recipe exactly, no substitutions. It was wonderful! I gave it a four because it fell apart while cooking. I will make these again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ddinnes"
},
"reviewBody": "The flavour is great, but if the oil temperature drops even a little bit, they disintegrate in the pan. Good in theory, but needs a binder like egg to keep them together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mekla"
},
"reviewBody": "Taste is good but completely falls apart once it hits hot oil. Once I saw that was hapening, I started using wet hands to make the balls and then coating with a dusting of flour to get it to hold its shape in the oil and that seemed to help the balls retain their shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ria Sanacore"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mollyjo"
},
"reviewBody": "Very good! I had never had falafel, and both my husband and I loved it. I baked the falafel instead of frying it. I baked it on 375 degrees until the outsides were crispy. Put them on pita bread with mayo, tomatoes and lettuce, yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hon-Ey"
},
"reviewBody": "This was amazing! I did not add cilantro because my husband dislikes it. \nI added an egg and I baked it in the oven for approx. 20 min until brown at 350ºF."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kassbee"
},
"reviewBody": "Great recipe! I used a 15 oz can of garbanzo beans because that is all that I could find. I kept the spices pretty much the same, and used just a bit less onion and bread crumbs. I baked the falafel instead of frying. I just put olive oil on a pan, brushed the tops of the falafel with olive oil and baked at 375 for 12 minutes on each side. Came out delicious! I served them with pita, tzatziki sauce, onion, spinach, and tomato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Saenz"
},
"reviewBody": "These tasted delicious, however, I had to add a little bit of flour to keep them from falling apart. Other than that, I made as stated. Would make again...with the addition of a little flour. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mary S"
},
"reviewBody": "Nope. Didn't work. Too dry, and too much cumin. I added an egg and it still didn't help. Will try adding much less bread crumbs and see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "akyra"
},
"reviewBody": "Excellent recipe for falafel. \nI have tried the dried mix a few times in the past. \nDisaster... never again. Nothing compares to fresh \nI have to admit I added an egg white to the mix and this made it a 4 star with fresh parsley. \nSecond round I added a tsp of fresh lemon juice and halved the amount of homemade breadcrumbs.\n\nGreat recipe. Served on a fresh naan with some parsley tomato cucumber mix and a yoghurt lemon dill dressing ... delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gbanninger"
},
"reviewBody": "Very good! Add the egg, no problem with it falling apart. Served with tzaziki from the Greek Souvlaki recipe with some suggested modifications"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bclc"
},
"reviewBody": "They fell apart in the oil. I wish I had read the one star reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz82"
},
"reviewBody": "OMG I made this tonight and it was so good! I pretty much stuck to the recipe with a few minor adjustments - I sautéed the onion, garlic and added jalapeno. I added 2 eggs to the mix. I baked them at 350 for about 8 mins on each side! Served them in pita pockets with hummus, tomatoes, cucumber, and carrot match sticks. SO GOOD! This is going to be a staple meal in my recipe box from now on :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "trwagner1"
},
"reviewBody": "Tasty, but fell apart and became mush"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Tasted great, but even adding water to get them to hold together didn't save my falafel - they fell apart in the deep fryer. We salvaged what we could and ate that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amulch"
},
"reviewBody": "Excellent! I added lemon juice to moisten and instead of frying I lightly sautéed in a shallow pan with 2 tbsp oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMorgan"
},
"reviewBody": "These were delectable. The only adjustment I made was to add an egg to hold it together, which was definitely necessary since I used beans I cooked from dry rather than canned. My only complaint is that the recipe doesn't make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tara Williams"
},
"reviewBody": "I wish I would have read the reviews of this recipe before I tried it because I had the same problem as a lot of other people...the balls completely disintegrated in my deep fryer :( The mixture was really tasty and thankfully I had half the balls I made left and baked them in the oven...definitely needs eggs to keep it all together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Watson Gloss"
},
"reviewBody": "Love this dish! Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kiwi88"
},
"reviewBody": "Fantastic recipe! It tasted amazing esp when I added my home made tzaziki to it and just patties for burger buns instead of pita bread (got lots of burger buns no pita go figure).\nThough I don't understand why the egg is ommitted. I don't see the point unless you're allergic. Whenever I do patties of any kind ESP if its vegetarian I have to do an egg otherwise its too dry and if you add water the texture is just right and a single egg fixes that. Its only an egg - its not going to bite you lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alan Pickel"
},
"reviewBody": "Decent recipe but it fell apart while frying my first batch. This recipe needs a binding agent. I am not vegan so I used egg whites and the rest came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Marie Natal"
},
"reviewBody": "You don’t have to be a vegetarian to enjoy how delectable these are. The Falafel is meaty and it also has very rich flavors. I loved these! They are so delicious and easy to make so please give these a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PeterT"
},
"reviewBody": "While the mixture might be worthy the process is not. The \"balls\" of falafel will totally disintegrate. Instead, form them into patties (like the picture) and use a shallow fry pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen A."
},
"reviewBody": "I thought these were great. The sauce was good. I added fresh garlic to it. My husband did not like the cucumber taste, but liked the falafel. I lightly fried these then baked at 400 for about 20 min. Came out crunchy and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Feldodo"
},
"reviewBody": "Better than any restaurant falafel!! Only changes were 1/3 of an onion, less salt and no cilantro. Can't wait to have our leftovers, yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniellepirelli"
},
"reviewBody": "Made these today. Very very good. Since I've only had restaurant-made falafel once before and have nothing else to compare to, these were quite pleasing. Better than the one I had from the restaurant. Took others suggestions and added egg and coated in flour before frying. Don't own a deep fryer, so I pan-fried them as patties on medium heat. I didn't have any problems AT ALL with them falling apart or disintegrating in the oil. I fried half the batter and baked the other (pan was sprayed with cooking spray - 350F for 10 min on each side and didn't coat with flour). I did however put the batter in the fridge for a little over an hour as someone suggested. I doubled the recipe and it made 20 patties the size of hamburgers. The only suggestion I have is to add more salt. I'm sure I added more than what the recipe called for and still I found it could use more. Ate them as is and they were great and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "Great taste, but mine fell apart. I baked them instead of frying, next time I will try frying them and see if it works out any better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine S"
},
"reviewBody": "Delicious! First time, the falafel totally fell apart in the oil :(. So next time I added an egg to the mixture (which helped with the firmness), and after forming the falafel balls, I put them in the fridge for 10-20 mins. Now it's great. Make sure the oil is hot before you start cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DMSKYBA"
},
"reviewBody": "I always follow a recipie exactly before making any changes. I really wanted Falafel as I had them recently in a trip to Europe. I cook alot an am always making new things for the family. I had the oil at a hot temperture and they still just fell apart and just literally melted into the oil- the whole mess of oil and falafel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLEONHEART"
},
"reviewBody": "I normally buy boxed falafel but decided to try something new last night, so happy I did!! This recipe is absolutely delicious!!!! The only thing I added was an egg, it did help it from falling apart when frying. Also, it is very important to let the oil reheat between batches. YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty"
},
"reviewBody": "I used 3/4 cup bread crumbs and subbed Italian seasoning for dried parsley. Also cooked in olive oil to make it healthier. This was fantastic. We eat falafels from box mix or at restaurants, but this is the best I have had. Very easy. I did use a food processor on pulse for the chick peas until very small grain sized chunks but before smooth, then seperately pulsed onion with cilantro, adding to the bowl with mixed dry ingredients. Perfect texture and flavor and so quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Justice Yost"
},
"reviewBody": "Oh holy moly - my first foray into the world o'falafels and I.am.hooked. My husband and I didn't even allow them to make it into the pitas I bought - we just stood at the stove and ate them plain (although I added some tahini to mine towards the end. Yum.) I followed directions almost exactly, just leaving out the cilantro due to a rather picky, cilantro-hating better half (is he really the better half if he hates cilantro? Hehe.) He immediately informed me that these need to make frequent appearances for dinner and then went to the kitchen to scrounge the leftover crumbs left on the plate. I already want to make them again. Like, tonight, less than 24 hours after my inaugural batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Very good in taste, but mine wouldn't stay together, and I didn't fry them . . .I used my slow cooker (seriously, it works). Still tasty, and worth making but I have to agree that it needs an egg. (I added water instead when it seemed crumbly bc I didn't want to add an egg, but that didn't work very well). how to make them okay for people who can't have eggs or are vegan or whatever, I can't say, but I'll try an egg next time. otherwise, very nice flavor and a good falafel. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rugger13"
},
"reviewBody": "Loved this recipe! First time I tried making homemade falafel, and I will definitely keep this one. I added 1/2 cup of water to help it stick together, but that was the only thing I changed. I also followed someone else's suggestion of mixing mayo &amp; Sriracha sauce (a.k.a. rooster sauce) for dipping, which was great, but the falafel was flavorful enough to eat plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sbreedi1"
},
"reviewBody": "These are really good. If you find your falafel falls apart when you try to fry it, put the dough in the fridge for a few hours and then roll and fry. You can also roll them in a little flour, too, which helps them hold their shape in the oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelcstac"
},
"reviewBody": "Amazing falafel! Sometimes, if the mixture is not sticking very well, I just add a little bit of water. I also have used this same recipe and baked them in the oven at 350 for 10 minutes on both sides and it was fantastic. Just have to make the balls more as patties so they cook all the way through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "The mix was easy to prepare, and I always appreciate eggless recipes. But unfortunately, they fell apart in the oil. I've tried this twice, and it happened both times. In reading the reviews, I'm clearly not the only one who had this problem. So, perhaps this is an issue that should be addressed somewhere in the instructions -- how do you prevent them from falling apart?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Wood"
},
"reviewBody": "Love to surprise my family with \"Josie's test kitchen\" recipes. This was my first try making falafel's and they came out great. Pan fried in olive oil and had to add just a little water to hold them together. Served them in pitas with tzitki, lettuce &amp; tomato. Thanks for a sucessful Josie's test kitchen meal the family really enjoyed this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SDEGRAW"
},
"reviewBody": "Yum Yum Yum! These are wonderful especially if you use them in a sandwich. These are so good even my husband the meat eater likes them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terraterre"
},
"reviewBody": "Great, flavourful falafels! The only change I made was to fry them just for a minute on each side for colour and then baked them at 350 for 20 minutes. You could also just grease the pan for a lighter colour. I will do this next time and there will definately be a next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarhigh"
},
"reviewBody": "I made these exactly as directed, with one crucial tip between steps 1 and 2: Freeze the falafel balls before frying. Just a couple hours in the freezer, then just throw them in the oil, no defrosting necessary. This helps the balls to keep shape without disintegrating in the oil (I do the same with Chinese fried spring rolls!). I kept them in the oil, flipping once until just brown on the outside (about 2 minutes), then stuck in the oven at 150C for 15-20 minutes to heat them through. Nice and crunchy on the outside, soft and flavourful on the inside!! Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bennybbc"
},
"reviewBody": "Sorry but authentic falafel doesn't used cooked garbanzo beans, certainly not canned cooked garbanzo beans. Use dry beans soaked in water for at least 12 hours. Don't cook them! They get cooked when you fry them. And why bother with the dried parsley? It has practically no flavor. Fresh parsley is the way to go here and use plenty. \nUsing the dried, raw, soaked garbanzo beans will make this recipe almost useless because the quantities will be off. There are plenty of recipies that use dried garbanzos. I would eliminate/reduce the bread crumbs and add ground corriander seed. What this recipe produces may taste ok but it isn't authentic and it will have a very different texture from a properly made falafel ball. Youtube has a huge number of falafel recipes that show you step by step how to do it. Unfortunately even a few of those use canned, cooked garbanzos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "starstylist"
},
"reviewBody": "very tasty but i had to bake it coated in oil because when i tried to fry them they dissolve in the oil???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeraJohn"
},
"reviewBody": "I followed this recipe because I had never made this on my own. It was delicious! As good as the first time I ever had it from a restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn Gardner"
},
"reviewBody": "I needed to add some of the bean juice (or water) back in, but I put everything in the food chopper and it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mombo"
},
"reviewBody": "Wish I had seen that last review before I made these! Used my deep fryer and not only did the balls disintegrate, they made the oil bubble up and overflow!!! Flattened a few balls into a patty and fried (not deep fried!) in a pan to get a crispy coat. Pretty tasty. Will add egg(s) as others suggested today and try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan Martinka"
},
"reviewBody": "mine totally fell apart in the oil. the tiny bit that did stick together I tried and it was tasty, however this recipe definetly needs a binding agent to be added. Also the recipe needs to include that the chickpeas need to be dried because the ones from the can give it a very wet structure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "I mixed everything in my food processor, it turned out great. super easy. My husband ate it like it actually had meat in it. :) I made it once the way the recipe states and it was a crumbly mess in the pan. I made a second batch and added one egg. It made all the difference. it held together beautifully. I fried in a skillet with a little coconut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Bachorick"
},
"reviewBody": "These were good but were missing something. I will definitely make them again, and not when I am in a rush! Maybe I forgot to add something! Instead of deep frying, I used a muffin tin and baked at 375 for maybe a half hour. I put a bit of oil in the bottom each cup to crisp them up. A little more oil than just a brush, but not too much. I put maybe a half inch in one cup by accident and the falafel disintegrated. My dinner guests enjoyed them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Kullman"
},
"reviewBody": "Fresh and so delicious! I always used the boxed falafel mix, but never again...this beats it hands down!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "These taste really great! I will definitely make them again. I made small patties and pan fried them. They do have some trouble sticking together. I added a bit of oil to the mix to help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve Crowell"
},
"reviewBody": "Loved this but next time I will add a bit of egg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "manal0908"
},
"reviewBody": "these were yummy. I followed the recipe but used fresh parsley and coriander as i didnt have cilantro on hand. I also baked them instead, by spraying them lighlty with PAM-olive oil spray. Came out yummy although dont hold together too well. Next time I half the amount of breadcrumbs and might add some egg to help them stick togehter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heetskillet"
},
"reviewBody": "First time making falafel at home, this one hit the mark. My girlfriend and even our toddler loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Buller King"
},
"reviewBody": "Everyone in the family loved these. We usually buy the box mix and add water, but had trouble finding the mix at our local store, so I decided it was time to make homemade. This was easy and tasted very good. I did end up adding an egg, and some water, to make it come together better, but otherwise wouldn't change a thing. Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princess of doom"
},
"reviewBody": "Decent alone with some dipping sauce for a quick lunch. Next time I'm going all out with pita bread and all the toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick Blanchard"
},
"reviewBody": "i had never had falafel before this, and it was so delicious (and fun to make). the only thing i changed was adding a couple eggs because i noticed the mixture was pretty dry. i will definitely make this again soon! yummmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "simply the best! did add an egg but sure water would have worked to moisten it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Yum, this was great. I added an egg just to be safe. I'm sure it would have been fine without it and just adding water. I baked mine jsut cause I didn't want a smelly house. 400 for 20mins flipped halfway and broiled for a few mins as another person suggested. My 7yr loved them too. But then again he eats anything :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loria"
},
"reviewBody": "I’ve never made falafel before, but this recipe looked easy enough for my limited skills. I left out the onions because I just don’t like them and the breadcrumbs because I didn’t have any. I added a spoonful of greek yogurt to help the balls hold together. I also baked them instead of frying (preheated oven to 400, cooked for 10 mins, rolled em over for 10 more mins, and then broiled for 2 minutes to get them crispy on top). Served in a whole wheat tortilla with a little sauce that I made from ½ cup greek yogurt and ½ teaspoon of dill. This was tasty and easy. My boyfriend asked me to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BigDaddy"
},
"reviewBody": "You must add water to hold it together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina Ramirez"
},
"reviewBody": "this was delicious!! will make again!! i served it with hummos and fatoosh salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tuesday"
},
"reviewBody": "YUM! The spice combination is the perfect flavor! I love it when I can throw all my ingredients into a food processor and be half way done! Went a healthier route and baked the falafel instead. Took 25 minutes at 350 (turning every 10) for a crispy brown outside. Stuffed the falafel in a pita with lettuce and tomato with a light champagne dressing and now my boyfriend thinks I'm a genius! Thank you so much for sharing! These are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Great Recipe!! I altered it a bit for my taste...BEST Falafel I have ever eaten!! I added 1 beaten egg, juice from 1/2 a lemon and they held together great..I added green onion and left out cilantro and dried parsley. Great base recipe you can \"tweek\" to fit your taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPUNKEE83"
},
"reviewBody": "These falafel taste AMAZING! Probably the best that I've ever had. I am new to fried foods, and when I made the mistake of not waiting for my pan-fried oil to reheat between batches, the falafel came out pale and fell apart. But the ones that I did right are crisp and attractive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Very good and easy to make although I did add an egg to bind them together a bit. I also used only half the cumin since my husband isn't a big fan of it. They turned out great. Thanks for introducing a new meat substitute to my dinner table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissah"
},
"reviewBody": "Will NEVER used the boxed mix again! These are fantastic, crispy outside, tender inside and just....magical!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shell C."
},
"reviewBody": "Very yummy. I did add 2 eggs to the mix to help it hold together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LUNACITY"
},
"reviewBody": "The seasoning on this recipe is good, but I highly recommend using dry garbanzo beans, soaking them overnight, and then grinding them in a food processer. This makes the falafel more crunchy and textured instead of the mushy version that using canned garbanzo beans will produce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex"
},
"reviewBody": "FANTASTIC AND EASY...WHAT MORE COULD ONE ASK?? I used Trader Joe's Tahini, lettuce, and grated carrots on pita bread. OMG!!!! EXCELLENT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "veg4life"
},
"reviewBody": "These are very easy and quick to make. They even taste good without some of the ingredients (if your cupboards a little bare, like mine). Are a little soggy and dry when reheated though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackies1654"
},
"reviewBody": "This makes a great falafel. I added one egg and then added water as needed in order to make it stay together. If I had not added water it definitely would have fallen apart. Left out the cilantro and parsley. I recommend using a food processor to mash the beans and garlic, and then stir in the finely diced onion. My food processor completely pulverizes onion, so I just dice it and stir it into whatever I am making."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "much2orange"
},
"reviewBody": "Hadn't ever made falafels from scratch, and decided to use this recipe because it was egg-less. However, I did use corn meal in place of the bread crumbs as some other recipes do. The first couple did not hold together too great until I started really packing the balls firmly with a melon baller. Worked great! Will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We did not like these at all. They are not what I recall eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Pham"
},
"reviewBody": "I actually added one egg to keep it together. I used fresh parsley and added ground coriander seeds. I sauteed them to get a brown crust and then finished them in the oven at 350 degrees. Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erninu"
},
"reviewBody": "This was my first attempt at making falafel from scratch and it was okay. I think it is probably a great base recipe and I will try it again with seasoning adjustments as I found it a little bland.\nHowever, I did bake it instead of fry it and that may have given it less flavor.\nI added in a mix of 1T ground flax with 3T water as an egg replacer and it held together really well.\nThank you for sharing this recipe. I will definitely give it another try one of these days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "blancovero"
},
"reviewBody": "I was very lucky to fried the first 3 falafels to check how they were coming and I saw my falafels disappearing in front of my eyes... so you MUST add 2 small eggs or the falafels will disappear in the frying process...\nYou also can reduce the salt using only 1/2 of teaspoon...\nHowever, the taste is SUPERIOR, the flavors are just perfect..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frodgy"
},
"reviewBody": "Delicious. Was made super easy with a little deep fryer my parents had at their place. I added chopped mushrooms, quarter cup fresh parsley, no cilantro, forgot the baking powder, extra turmeric. Yeah, its easier with the mix, but the taste does not compare. I also added the egg to help it stick together. The package stuff is bland and dry, these were nice consistency and lots of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gabyxxoo"
},
"reviewBody": "These were yummy and easy to make, I would add 1 teaspoon lemon juice and a pinch of cayenne. I enjoyed not adding the egg, but make sure the oil is super hot before putting them in, and let them brown before flipping so they won't fall apart. Also use the sauce (garlic pepper) in the pita with diced tomatoes and lettuce.\nDefinitely make tzatziki sauce (1/2 cup yogurt, 1/2 cup sour cream, peeled-seeded and grated cucumber,2 cloves garlic-minced, 1 tbsp parsley, 1/4 teaspoon salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin L"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saisy76"
},
"reviewBody": "Great."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/83307/jeanies-falafel/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
"name": "Greek"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/83307/jeanies-falafel/",
"name": "Jeanie&#39;s Falafel"
}
}
]
}
}
, "about": [
]
}
]