				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jean&#39;s Swedish Faux Meatballs"
,"datePublished": "2000-08-11T13:19:18.000-04:00"
,"dateModified": "2020-03-09T22:50:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "COURTNEYSUNSHINE"
}
]
,"description": "Burger-style crumbles (or TVP) combined with bread crumbs, onion and milk and formed into &#39;meat&#39; balls, then baked with a creamy gravy. Excellent served with &#39;no-yolk&#39; noodles and your favorite vegetable."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rdTJB4SxjCr5fPVQk_eT7LsUyVY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7940505-9aa5c19b49b24951a31a5bf13737b65e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jean&#39;s Swedish Faux Meatballs"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "14"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "560 kcal"
,"carbohydrateContent": "21 g"
,"cholesterolContent": "36 mg"
,"fiberContent": "7 g"
,"proteinContent": "94 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1375 mg"
,"sugarContent": "3 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3 slices bread, crumbled",
"2 tablespoons chopped onion",
"0.25 teaspoon ground black pepper",
"0.25 teaspoon ground nutmeg",
"0.75 cup skim milk",
"2 (12 ounce) packages frozen burger-style crumbles",
"4 tablespoons butter",
"2 tablespoons all-purpose flour",
"1 cup vegetable broth",
"1 cup half-and-half cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl combine bread crumbs, onion, pepper, nutmeg and milk. Stir in burger-style crumbles until well blended. Form into 1 1/2 balls."
} ,{
"@type": "HowToStep"
,"text": "In a large skillet over medium heat, brown the &#39;meat&#39; balls in butter. Remove with a slotted spoon and place in a 2 quart casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Whisk flour into drippings in skillet; cook until bubbly, stirring constantly. Stir in broth and cream and continue cooking, stirring, until sauce thickens and boils, about 1 minute. Pour over &#39;meat&#39; balls ."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kayla WB"
},
"reviewBody": "So, made this with actual meat because the husband failed to notice is was a vegetarian setup. just used ground hamburger. It came out pretty tasty, though! You have to be extra careful with the\"meatballs\", they do have a tendency to fall apart, but can be managed with care."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Ewell Crocker Csw"
},
"reviewBody": "More like 4.8, but still really excellent. My husband, a pretty terrific home cook in his own right, suggested we make the next batch with liquid egg product -- our easy-to-use choice for most recipes with eggs as an ingredient -- for the binder.\n\nOne more thing: The Lightlife soy crumbles, the most popular brand of \"soy ground\" in northern Orange County, Calif., come in 10-ounce packages, not the 12-ounce size cited in the recipe. I added diced and sauteed red onion to fill in for the two \"missing\" ounces of soy ground -- and it added texture and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emme"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CodySharpe"
},
"reviewBody": "This was an excellent vegetarian protein recipes, though I made a couple changes. \n\nFirst, I baked the meatballs on their own for about 40 minutes, at 400 degrees, and on a sheet of parchment paper so they wouldn't stick to the baking sheet. I've tried similar vegetarian protein recipes in the frying pan, and never had much luck getting them to hold together, so I decided to skip the pan and go straight to the oven this time. Plus, a higher heat unlocks the spices more.\n\nSecond, I included a spice rub in the recipe that my brother makes. He refuses to tell me what is in it, but I know it has sea salt, oregano, a smoked paprika, and a few other things I haven't figured out yet. The point is, include a little good-quality salt and a source of heat, and you'll be pleased with the outcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "amhv"
},
"reviewBody": "Not sure where I went wrong, but these didn't work for me in the least. They were way too sticky and we couldn't form them into balls - probably needed more eggs. We had to continually add flour and starch to get them to firm up. Eventually just chopped them up into a strange sort of crumb topping and fried them. Also punched up the nutmeg and added salt, which helped a little. Taste was good; the original recipe's texture could use some work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette Worth"
},
"reviewBody": "This was so incredibly delicious! I did make a few changes that did the trick. Instead of using burger-style crumbles, I used \"Gimme Lean Sausage.\" (100% vegetarian. It's a soy protein. I found it at Trader Joes) To that I added the nutmeg, onion, and pepper, and crumbed up toast. I did cut down the milk to 1/2 a cup. For the sauce I did have a bit of trouble but to solve that I added cold cubed butter and a bit more flour whisking that all together. Served everything over buttered noodles. It was just awesome! I will for sure make this over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gila"
},
"reviewBody": "I was a little bit iffy on the cream sauce but that is just because I am not a big fan of cream sauces in the first place. Also, since I didn't have half-and-half, I used 1/2 cup heavy cream and 1/2 cup soymilk. It came out very creamy and would, I'm sure, be appreciated by those who do like cream sauces. As for the meatballs, I made some changes but they came out pretty well. I substituted matzo meal for breadcrumbs and soymilk for skim milk. Since many reviewers found it difficult to keep the mixture from losing its shape, I added 1 egg and that worked perfectly. I also added about a teaspoon of allspice for more flavor. My brother the avid meat-eater said that these were good, although they didn't taste like real meatballs. Coming from him, that's high praise! I would probably make these again. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAGDYANN422"
},
"reviewBody": "This recipe is delicious but I only used the sauce portion. Based on other reviews, I avoided the \"meatball\" portion of the recipe &amp; instead used a frozen (but still vegetarian) brand. They got a little too mushy but worked out pretty well overall. If you cut down the bake time a little bit, it'll probably be perfect. When I made it a second time, I cut bake time &amp; used my own homemade \"meat\"balls &amp; it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Boller"
},
"reviewBody": "Upon reading the reviews of others, I decided to add 2 eggs to the mix in hopes that this would help hold the meatballs together, which it did! I also added a little bit of cardamom and all spice to the mix. This recipe is SO delicious! I definitely love the sauce as well. My husband and I ate the whole pan between the two of us. Poured over some egg noodles, it's almost like eating stroganoff. I absolutely would make this recipe again. It is definitely comfort food for the soul."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DianaD"
},
"reviewBody": "They were easy to make, and they tasted really good!!!!!!!! I used the morning star \"meat\" crumbles, and I went to the grocerie store and forgot veggie broth, so I used beef broth. Like the others, it was hard keeping the meatballs together, so I added an egg and that kind of helped. But with morning star it says the product only has to be heated to 160degreese so I made some into balls w/out browning them in the pan and they truned out good and stayed as balls!!! I mean for the sauce fake meat does not leave many juices anyway, so I just added more butter to the pan when I was ready to make the sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Krista"
},
"reviewBody": "They made a total mess and fell apart completely when I went to brown them. The sauce and meat ended up being tasty, but it was more like \"swedish ground beef\" over noodles than swedish meat balls...I'm going to play with the recipe a bit because I liked the taste so much, to find something that will hold together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen van Buren"
},
"reviewBody": "I halved the ground soy meat. I found the *meat*balls were difficult to keep together while browning as stated in a previous review. It definitely was a yummy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "adi"
},
"reviewBody": "i used store-bought vegetarian meatballs, so i'm only rating the sauce, which was good, but a little on the thick side and i wish i'd made a bigger recipe--there wasn't enough extra sauce for the noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The \"meatballs\" fell apart when I browned them. In the end, they tasted good, but didn't look very pretty!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21426/jeans-swedish-faux-meatballs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
"name": "Protein"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17251/everyday-cooking/vegetarian/protein/tvp/",
"name": "TVP"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21426/jeans-swedish-faux-meatballs/",
"name": "Jean&#39;s Swedish Faux Meatballs"
}
}
]
}
}
, "about": [
]
}
]