				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jerky Lover&#39;s Jerky - Sweet, Hot and Spicy!"
,"datePublished": "2020-03-04T23:59:21.000-05:00"
,"dateModified": "2022-08-04T10:34:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DIXYCHIK"
,"url": "https://www.allrecipes.com/cook/673874"
}
]
,"description": "This will be your favorite sweet and spicy beef jerky recipe for on-the-go snacks, sporting events, camping, or hiking. Enjoy the balance of flavors."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BeV546GEY83J5gd8rhepi9DEqTg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/454384-jerky-lovers-jerky-sweet-hot-and-spicy-Alberta-Rose-4x3-1-15dae42b64024ac2a7fdf24f54950ebf.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jerky Lover&#39;s Jerky - Sweet, Hot and Spicy!"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "299"
}
,"cookTime": "PT300M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "527 kcal"
,"carbohydrateContent": "47 g"
,"cholesterolContent": "60 mg"
,"fiberContent": "1 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "3319 mg"
,"sugarContent": "39 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon onion powder",
"1 tablespoon garlic powder",
"2 teaspoons cracked black pepper, or to taste",
"1 pound lean beef sirloin tip, sliced into 1/8 inch strips",
"0.5 cup brown sugar",
"0.66666668653488 cup soy sauce",
"0.5 cup pineapple juice",
"0.33333334326744 cup balsamic vinegar",
"0.25 cup teriyaki sauce",
"0.25 cup Worcestershire sauce",
"5 tablespoons liquid smoke flavoring",
"1 teaspoon red pepper flakes, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together onion powder, garlic powder, and black pepper in a small bowl or cup. Season beef lightly, using only part of the spice blend and reserving the rest. Place beef into an airtight plastic container or bowl, and refrigerate."
} ,{
"@type": "HowToStep"
,"text": "Stir together brown sugar, soy sauce, pineapple juice, balsamic vinegar, teriyaki sauce, Worcestershire sauce, and liquid smoke flavoring. Heat until brown sugar has completely dissolved. Refrigerate marinade until cool."
} ,{
"@type": "HowToStep"
,"text": "Pour cooled marinade over the seasoned meat, and mix by hand to coat. Seal the bowl, and refrigerate for at least 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Arrange beef strips on the rack of a dehydrator, and sprinkle with a little bit more of the spice mixture and red pepper flakes. Dry for 5 hours, or to your desired dryness."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT510M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've tried other recipes and always come back to this one. I don't bother with seasoning the meat with the dry rub anymore and just wisk everything together very well and mix with the beef. Definitely longer is better for marinating, go at least 18hrs and every few hours i mix all the beef and marinade by hand. I make it on a smoker so I don't bother with the liquid smoke."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherryberry"
},
"reviewBody": "I've been following this recipe for years and is the BEST!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skip Graham"
},
"reviewBody": "I left out the liquid smoke, and added a lot of crushed red pepper flakes directly to the marinade, but otherwise followed as instructed. My wife said it is the best jerky she has ever had. I used the single batch of marinade I made to make four 1lb batches of jerky. I would marinate a 1lb, then drain and strain the liquid, put the marinade in the fridge and put the meat in the dehydrator. Then next day I would take the same liquid and marinate another pound, and repeated this for 4 batches over four days. I then took the marinade and boiled it and then sealed it in a container and froze it. I will see if works again next time I want jerky. But all around this is a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe. I like the idea of saving some spice mix to sprinkle on while drying, adds some texture. I made up a slicing rig by tacking pieces of 1/4 inch trim to a 6-inch board. You can add 3/8 inch pieces on the other side. Makes the slicing go fast and uniform."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "green0marlin"
},
"reviewBody": "IMHO this is the holy grail of jerky. I've made it a dozen times marinating it for 24-48 hours then air frying at 140F x 8 hours using round roast sliced thin after an hour in the freezer. The only mod I made was to reduce the liquid smoke from 5 tablespoons to 1 tablespoon because it tastes more natural and makes the other flavours pop"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "the only thing missing is the curing salt, other than that it is a good mix of spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jstone7099"
},
"reviewBody": "This is one of the best recipes especially for venison all the flavors come together to amplify the flavor of wild game in an excellent way i’ve been using this recipe for years I use my wild game and give it to my friends and family and coworkers it never lasts and everybody is always begging for more even though it takes time and effort it’s a labor of love because you watch everyone enjoy the fruits of your labor I modify the recipe to fit my own taste but I use all the ingredients and pineapple juice is definitely the secret people can guess the flavors but they never get pineapple juice when loading your dehydrator when the rack is full then sprinkle onion powder garlic powder and small red pepper flakes on the raw meat when it dries it sticks to it I think it’s a better product Bon appétit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fallenangelmtl"
},
"reviewBody": "Improvised a bit since I had about 3 times as much meat: used 3 times the dried ingredients, but only twice the liquid and sugar. Submerged pretty well and first batch just came out of the dehydrator. tasty good recipe, will surely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoPenguins"
},
"reviewBody": "This is my favorite beef jerky. I have made this many times. I have basically quit looking for another recipe. Sometimes I make it more spicy (more crushed red peppers and I add 1 tsp cayenne red pepper), sometimes no crushed red peppers for the rest of the family. (They don't like it spicy) Both version are very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martina Buccellato"
},
"reviewBody": "You MUST marinade at least 24 hours. I made a sample batch after 4 hours of marinading, and while it tasted pretty good it was not nearly as tender as when i did the rest after about 30 hours of marinading. The pineapple juice (i also added a bit of orange juice) definately aids in a better texture. Flavour wise, i do find the sweetness is more noticeable too, as compared to the sample batch. I used AAA bottom sirloin steak tails, and did it in my convection oven setting on dehydrate at 140."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenl"
},
"reviewBody": "This recipe is excellent. I purchased a new smoker and used it with this recipe, for the first time smoking jerky. The only thing I’ll add, is it made enough marinade for probably two pounds of meat. Seemed like a lot to discard, so next time I’ll do two pounds of jerky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat Haylock"
},
"reviewBody": "This recipe is awesome. I didn't have pineapple juice so used peach fruit juice. I adjusted cooking time for my Air Fryer. Beef Jerky was sweet and Spicy Hot! I also used this recipe to make Black Peppered Beef Stir Fry! Use the marinade as sauce and add a little cornstarch at end to thicken. Add bell peppers and Brocoli, serve with rice or low mein. FANTASTIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Stephens"
},
"reviewBody": "Everyone loves this jerky! I make it every year for my daughter's boyfriend and it's always a hit and my family asks me to make extra. I love the hint of balsamic in this which makes it truly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Thompson"
},
"reviewBody": "Adding Grippo's seasoning while laying meat on dehydrator takes this to 6 stars!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Lackey"
},
"reviewBody": "Love the flavor!\nI did make some small changes in prep and ingredients. I really like my jerky spicy. I used venison instead of beef as my meat.\n? I substituted KC Masterpiece Caribbean Jerk marinade in place of the Teriyaki sauce. \n? I used reduced-sodium soy sauce.\n? I added 1/4 cup of Crystal hot sauce.\n? I added 1/4 cup of Skinny Girl brand raspberry vinaigrette salad dressing.\n? I added 1/4 cup Allegro brand Game Tame marinade\n? I used a combination of ground red pepper and crushed red pepper flakes.\n? I added two teaspoons of Sauers brand 7 pepper Grill seasoning.\n? I omitted the pineapple juice but it wasn't due to the fact that I did not want it. I did not have any in my pantry and I was too lazy to go to town. This is where the corn syrup base of the Caribbean Jerk marinade took the place of the missing pineapple juice.\n? I did not reduce my brown sugar content in a heated mixture of the liquid ingredients. I simply mixed all the ingredients together in a blender and hit the pulse button about five times to thoroughly mix all the ingredients.\n? I poured the marinade directly over the meat and refrigerated it overnight for about 12 hours.\n? When it came to adding the meat to my dehydrator, once I filled a tray with the slices, I went back with another small dusting of the seven pepper Grill seasoning on the top of the jerky pieces.\n\n Very sweet and spicy! One of the best jerky recipes that I have made in a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIANA M BECKMAN"
},
"reviewBody": "The BEST jerky I’ve ever made! My family just can’t enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "lees liquid smoke"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanette Polvino"
},
"reviewBody": "This is a very good recipe, and have made it at least 6 times. Our friends love it and I find myself making several pounds at a time!\n\nYou can save a lot of time and effort by purchasing \"stir fry beef\" strips in your local supermarket. These are strips with consistent length and thickness.\n\nAlso, we like our jerky more bold and spicy, so we triple the 3-spice blend and also add to it cayenne powder and sea or smoked salt. Then we dredge the strips in this spice blend, store in a bag in the fridge for 8 hours, then add the marinade and let it soak overnight. This amplifies the flavor a lot.\n\nWe've also added habanero sauce to the marinade with great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chili chico"
},
"reviewBody": "I took out the last 3 ingredients and smoked it over pecan for a few hours then finished in dehydrator. Awesome. Going to add fresh ginger next time. Good mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Adiasor"
},
"reviewBody": "Used some breakfast steaks and mesquite liquid smoke. Came out to be the best jerky ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ddgross"
},
"reviewBody": "Skipped the first step and added all ingredients in a mixing bowl (No heating) I included a few drops of Tabasco and marinated over night. I put in the over for 5 hours at 170 degrees. Next time I'll do 4 and a half. Seemed just a little dry but still it tasted great! I put what I didn't eat in a baggy and left in the fridge overnight to bring some moisture back. I used the left over sauce for cooking some chicken in my air fryer and that came out great as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gary N Bills Sr."
},
"reviewBody": "Followed recipe. Not much flavor and no heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "T D"
},
"reviewBody": "Not my style recipe is way off portion wise. Reds more salt to cure it better. Started to mold after a week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBERT DEIDA"
},
"reviewBody": "Whoever rated this poorly most likely burns water. This was one of the best jerky’s I have ever had, I swapped out the brown sugar for a little swerve, used low sodium soy and added more red pepper flakes for a more intense kick to the mouth. Great recipe will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mudflap"
},
"reviewBody": "I made this last year with venison. Best jerky I’ve ever had. I’m in the process of making it again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ike"
},
"reviewBody": "Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kris"
},
"reviewBody": "Must need to marinate more than the 3 hours specified. Very little flavor in the finished product. If I make it again I will marinate overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Scott"
},
"reviewBody": "great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gasparilla BBQ"
},
"reviewBody": "Fantastic recipe. Made a few revisions to bring out more flavor\n-Replaced pineapple juice with one cup fresh pineapple (or frozen, they both worked great)\n-Added 2 diced jalapeno's and 2 Pablano's, both with seeds\n\nI blended the pineapple and peppers then added to the remaining ingredients.\n\nThe flavor was very good - the pineapple came through just perfectly. This quickly became the goto for my family. It's somewhat spicy, but not overpowering. I like spice and will likely add at least one more next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Flenner"
},
"reviewBody": "Absolutely the best jerky marinade I've ever used. I've been using it for years on venison and beef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Harmon"
},
"reviewBody": "Best beef jerky recipe I've made so far"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G_Beret"
},
"reviewBody": "Cut back on the pepper to enjoy the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Steinberg"
},
"reviewBody": "My son will not eat any other jerky after trying this! Amazing recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robphen"
},
"reviewBody": "It’s a perfect recipe for a sweet and spicy jersey . Everyone I gave some to thinks I’m a great jersey maker ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tasty! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Rawls"
},
"reviewBody": "Great recipe love the flavor. I would recommend using a little less liquid smoke so that it doesn't over power the rest of the flavors. Other then that this is differently my go to for a sweet and hot jerky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Plume"
},
"reviewBody": "First time ever making jerky and I doubled the batch right off the back. Excellent turnout. Made it in a hot air fryer at 160 for 6 hours. Gave to a few jerky experts for taste and texture test and they were wowed by it. Thanks. Make more today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Rewerts"
},
"reviewBody": "I totally screwed up and read the directions off another recipe, ended up throwing everything together cold and marinated for about 15 hrs, removed the meat from the marinade and placed in dehydrater, no towelling off, took about 5.5 hrs (cabellas unit) on high (160f). \n I used eye of round loin from Costco. Anyway it all worked out in the end, probably the best I’ve made to date. \n I had 5 lbs of meat after trimming the fat, multiplied the recipe by 5...WAY TOO MUCH MARINADE!!, next time I’ll maybe start at double the recipe for 5 lbs... live and learn..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cooterb123"
},
"reviewBody": "Just needs a little more spice on my end but it’ll work for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ocshannon714"
},
"reviewBody": "This is my GO TO beef jerky recipe. I make it exactly as the recipe shows - and believe that is important in the rating of a recipe. Nothing needs to be changed - it is perfect as is. My kids friends actually request this jerky. Simple and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShayleyAnne"
},
"reviewBody": "I made this and it was fantastic! I was concerned about the liquid smoke, as this was all I smelled for the next couple days! But, it turned out great! I did add the peppers as I like hot, for the meat I used a tri tip trimmed of fat and frozen for easy slicing. Otherwise, I stayed true to recipe. I will be making it again this weekend, because it’s about gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Latham-Villarreal"
},
"reviewBody": "I did not use the liquid smoke and this recipe was perfect my husband loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenz"
},
"reviewBody": "I definitely loved this recipe it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISA"
},
"reviewBody": "My husband and three boys \nLOVE this recipe! \n Also works well with venison."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Örn Ingi Hrafnsson"
},
"reviewBody": "Made this for a weekend at the lake with multiple families. I doubled the recipe. Made it in the oven at the lowest setting ( my oven goes down to 170 F) with a ball of aluminum foil to keep the door open a crack. Took about 4 hours. Everyone loved it. They couldn't stay away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEGGY"
},
"reviewBody": "We love it, easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Fowler"
},
"reviewBody": "Will definitely keep this one. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Domanski"
},
"reviewBody": "Followed the recipe. Used orange juice instead of pineapple. This was so good. Best jerky ever. My kids wiped out our first batch super quick. Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tgerm"
},
"reviewBody": "A great mixture of flavours and a versatile base to make adjustments without altering the core ingredients. I have also made it with honey garlic in place of teriyaki with success. Only thing I find is the brine has an exorbitant amount of liquid for just 1 pound of meat and go with 2 or 3 pounds of meat and marinade overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Moore"
},
"reviewBody": "Try and pat dry your meat prior to put it in a dehydrator I just used a couple of paper towels to soak off the excess liquid and mine turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M. C. Z."
},
"reviewBody": "Truly an excellent recipe, I originally started with this recipe many years ago and I've made it a dozens of times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was dead on! The flavor is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty "
},
"reviewBody": "This was my first attempt at jerky. Nice flavor and turned out well. Will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarkAnthony Kiley"
},
"reviewBody": "I thought this was EXCELLENT! I made no changes and it turned out to be tastier than any store-bought jerky I have ever had. I don't eat beef so I used turkey and YUM! P.S. Thanks for the hint of boiling and using the left-over marinade. I like to be thrifty and this recipe isn't exactly cheap-it really bugged me to throw it out after marinating my meat in it. Now I know how to use it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Levi Wells"
},
"reviewBody": "loved this one! made a slight modification by downing the soy sauce by 1/3 cup and substituted in hoisin sauce. used the same amount of liquids on 2lbs of meat. Had to up the onion/garlic/pepper mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Molina"
},
"reviewBody": "I made the recipe as described. Adding the dry rub after marinade is essential. I smoked it rather than dehydrator so no liquid smoke required. I added a little prague powder #1 to preserve and smoked it low and slow with hickory and mesquite. Its the last recipe ill ever need. My kids wont eat spicy foods. They disappear this jerky no matter how much pepper flake i add to keep them away. Simple , tasty, and easy to prepare. My family and i love it. The semi frozen meat cutting is a great tip as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skittle68"
},
"reviewBody": "I have made this several times, and it is amazing. I never do the 2 step process though- just marinate overnight all together and it turns out great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy B"
},
"reviewBody": "This is the 3rd recipe we tried and so far the best. It could be a little spicier for my taste so next time I'll add more red pepper. Also don't be afraid about eh \"sweet\" in the title as it is not very sweet at all, just a hint of sweetness. I do agree that it makes a lot more marinade then is needed. I made about half the recipe and it was enough for almost 1.5 pounds of beef cut 1/4\". It does taste professional and will definitely make it again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Grafton"
},
"reviewBody": "Fam really liked this one. Made one batch without second layer of seasoning and no pepper. Mmmmmm. Fully seasoned next batch, more heat but so good. Got 3.3 lbs fron 8.25# roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAREN"
},
"reviewBody": "I doubled the recipe and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M.C. Masulis"
},
"reviewBody": "My changes : Doubled the beef and used only a tiny hint (1/4 teaspoon) of liquid smoke. I only had orange juice. I didn't cook the marinade either. 1 pound of beef strips (carne asada already sliced) each in 2 large mason jars, split the marinade, refrigerate overnight, food dehydrator on 160 for 4 hours. Resist the temptation to dehydrate any longer! Mine was just right. Lots of compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Beatty"
},
"reviewBody": "For the most part, this is a great recipe (though too much brown sugar and not enough spice (add a 1/2t of cayenne) for me), but do not marinade in a bowl. This requires more liquid than necessary, all the liquid is at the bottom and the top stays dry. Marinade in a Ziploc bag and put it in a baking dish so that it lays flat. I was able to half the liquid in this recipe, and quadruple the amount of meat. Also, you have to marinade a lot longer than listed, at least 24 hours. I go 48 hours, massaging and turning the bag very 8-12 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacyrn"
},
"reviewBody": "This is my go to jerky seasoning! Husband and kids love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacy"
},
"reviewBody": "AMAZING !!! Only complaint wish I would of doubled recipe didn't make a lot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jemps"
},
"reviewBody": "sweet, but it a good way. i added a little more heat (dave's insanity.) ate it all the same day i made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael Shedden Bean"
},
"reviewBody": "Every time I make this people love it!! I especially love making it with chicken breast. No one knows it is chicken!! My students beg me to make it for rewards in the classroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dsmithad"
},
"reviewBody": "Tasty, easy and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Baroldy"
},
"reviewBody": "This is one of the best recipes I've come across!!\nI use it just as written and smoked in my Masterbilt Electric\nSmoker!!\nCompletely Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Difani"
},
"reviewBody": "This is one of, if not, the best Jerky Recipe i have found. I use a pellet smoker and opted out on the liquid smoke since smoke was going to be introduced via the smoker. I also used a shoulder roast (clod heart) for my choice of meat (cheap!!) Otherwise I followed the marinade recipe to a tee . After 4 hours on the smoker (140 degree area) I pulled all but the thicker cuts and put them in a zip-lock. As they cooled at room temp a delicious glaze formed. These things are like potato chips! You cant eat just one. The more you eat the more the heat comes out. This will be my go to recipe, Though as a self proclaimed cook and pellet head smoker I will continue looking for an amazing jerky marinade it may be entirely futile with this finding. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WARRY"
},
"reviewBody": "I didn't add the final round of spices (my mistake) but even so it was very good- I might bump it to 5 stars once I properly follow instructions. I'll definitely make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PITA"
},
"reviewBody": "I am a beef jerky addict. I found this recipe to be an EXCELLENT base recipe and for that reason I am rating it 5 stars. Don't misunderstand, It's absolutely fantastic and yummy in it's own rite just as it is. I too marinade at LEAST 24 hours. You can make this recipe and you will be very happy with the flavors. I, however, like my jerky SPICY. I add several additional ingredients to make it my own with the right amount of spice that I love so much. I'm talking Carolina Reapers or Ghost Peppers. One ingredient I add seems to give it some richness/depth/body, about 5 heaping spoonfuls of Chili Garlic Sauce (Note: I do 5 pounds of meat at a time.) I put the dried chili flakes into a coffee bean grinder and pulverize them into a powder. It really distributes the spice throughout. (And you don't find little flakes all around your house.) An immersion blender mixes in the garlic and onion powders well which tend to clump in the liquid. I'm lucky enough to have a store nearby that will slice my meat super thin for me which is most of the work (I use bottom round sliced cross-grain) and a 5-drawer dehydrator. It can dry 2-1/2 lbs. at a time. LOVE LOVE LOVE this recipe. Whether you alter or use as is, you will love this recipe. \nI'm making 20 lbs. at a time now. It's basically a 3-day commitment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colette Lillis"
},
"reviewBody": "I made this recipe Exactly as it was written. The only change I made was to marinade the meat for 24 hours. Everyone loved it. I don't have a dehydrator so I put it on racks in a low oven(170) for 5-6 hours, turning half way through. I've made this four times in the last few months and believe me it goes quickly. The last few times I doubled the recipe much to my husbands delight. It's just as described- Sweet, Hot and Spicy. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bunnybarbie23"
},
"reviewBody": "Added some balsamic glaze! Amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "This is the best jerky recipe I've made . Followed the recipe but left out the liquid smoke .Made this in our smoker cooked at 200 for 4hours it is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Stark"
},
"reviewBody": "I have used allrecipes for years, but have never felt compelled to write a review before now. I made this jerky yesterday with a mixture of venison and beef, and it is easily, hands-down the best jerky I have ever had. The family agrees! I mixed the spices in with the marinade instead of doing the rub, marinated overnight, then into the dehydrator. We tripled the meat - the recipe above for the marinade can easily handle three pounds of meat. So addictive, we're starting another batch tonight. Perfect balance of flavours, and the smell is heavenly. Thank you for sharing this amazing recipe! If there was a Nobel Prize for jerky, it would be yours!(lol)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlmac017"
},
"reviewBody": "I made this exactly according to the directions. Amazing. I will not be searching any further for another recipe. This is the one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSCHECH"
},
"reviewBody": "Didnt have teriyaki- excellent anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CountryCouple"
},
"reviewBody": "Excellent flavor for my deer jerky. After not making any venison jerky for over ten years because it was too much hassle, I decided to drag out the old dehydrator after my latest harvest of a couple of deer. The problem...I had long forgotten my recipe and needed a new one. I've always liked the sweet and spicy jerky I purchased in the store so decided to give this one a try. We are sure glad I did! I followed the recipe with only a few exceptions. First I always marinate the meat overnight using ziplock bags. Every time I get in the fridge for something I work the meat around without having to open the bag. The result is less mess with evenly and thoroughly marinated meat. Secondly I'm not crazy about the liquid smoke taste so I cut it back and even omitted it on one batch. I guess that's up to personal preference. Lastly and probably most importantly to us, instead of the crushed black and red pepper I used in its place some creole seasoning and McCormick Caribbean Jerk seasoning. It resulted in some great jerky...sweet with just enough pop of heat. Sweet, spicy and OH SO GOOD! My family and friends are eating it faster than I can make it. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sauvignonomatic"
},
"reviewBody": "Hands. Down. The best! I did only use 3 TBL mesquite liquid smoke and did ~4 hours at my lowest temp, 170F. The flavor is phenomenal, I would recommend using 2 lbs of sirloin tip since it makes a lot of marinade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this recipe and its the best jerky ive ever tasted BAR NONE! Took it to work with me and they all said the same thing! To the people on here that said its not good, your pallet is smoking crack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Handy"
},
"reviewBody": "I have smoked jerky for 15 years and have tried many recipes. After reading the reviews; I decided to try the recipe. However; instead of using pineapple juice I used 1 can of frozen concentrated pineapple juice. Pineapple juice is a natural meat tenderizer and it breaks up the chewy fiber in the meat. Using concentrated vs. juice will give you the real sweet taste of pineapple. Also, I added crushed pepper flakes / sprinkled over the meat before it went to the smoker. It adds heat to the jerky so you get the heat and sweet taste. Basically, I used everything in the recipe except I added concentrate vs. juice and added additional red pepper flakes after marinating the steak. The overall taste of the jerky was excellent and friends that try all of my different types of jerky liked this one the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Gushue Conway"
},
"reviewBody": "Used 3 tbsp. liquid smoke instead of 5.\nAdd 3 tbsp. honey\nUse 1 1/2 tsp of garlic powder (use 1/2 teas minced garlic)\nUse 4-5 drops hot sauce\nNo additional salt\nMoose meat best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel"
},
"reviewBody": "Best jerky ever!!! Followed recipe to the letter except 2 things: low sodium soy sauce and half of the suggested liquid smoke. This will define tell be the family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christi Pinkerton-Vanegas"
},
"reviewBody": "This is the best jerky EVER! I love making this so much I have to keep from eating it raw! OH MY GOD does it make my mouth water!!!!! I have made it by the recipe and then i made some adjustments. (it was a touch too spicy for my crew.) 1. I never have teriyaki sauce so I just add more soy sauce and pineapple 2. I cut the liquid smoke to 2 or 3 teaspoons. 3. I dump all the spices in the liquid. 4. I cut the red pepper to 1/4 tsp and the black to 1 teaspoon mainly because I ran out of cracked black pepper and had to use ground. That said. its good GOOD! I love love love this! I also dont let it dry to the dry dry stage. I like a little chewiness to my jerky. Its soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SnowCrab"
},
"reviewBody": "The Good,the bad n`the jerky ... dust ball Rolling by .."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Miller"
},
"reviewBody": "I I love you very much! M"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "worm_3000"
},
"reviewBody": "I had to create an account because I had to give credit for this recipe. It's perfect. If you want it hotter just add some more Tabasco. Everybody I shared it with loved it also. Especially my wife. She ate about two bags to herself. Thank you very much for this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdees"
},
"reviewBody": "I added more red pepper flakes to make spicier. It was absolutely delectable. I also made some without the red pepper flakes for my husband because he doesn't like spicy. It's the best jerky that we have tried I highly recommend it. Oh I also added an extra half cup of pineapple juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R. J. Nequette"
},
"reviewBody": "I have made this recipe twice without changing anything except trying several different cuts of meat. My husband wanted beef jerky so I put the first batch in and showed him how to do it. Over the next couple of days he had made several batches to take on a trip out of town. Yeah, now he can make it whenever he wants to. I don't eat jerly, but my husband said this is a 5-star recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Handyman"
},
"reviewBody": "I have made jerky for 20 years. This recipe is pretty good. After reading the comments; I decided to make some minor tweaks. First; I doubled the pineapple juice and simmered it to concentrate the sweetness. Then, I added a ¼ cup of orange juice along with the other ingredients ( I use a smoker so, I omitted the liquid smoke). I doubled the dry ingredients / coated the meat and let it marinade for 4 hours. Then I added the liquid marinade and let it set over night. I don’t pound the meat before smoking; I like the big chew. “This step is essential” before smoking / dehydrating; take meat and out of the marinade and place it on a towel. Place another towel on top to absorb the moisture. Then, put the meat on a rack (uncovered) for an hour or until the color turns grey. This helps the curing process and stops the marinade / seasoning from exiting the meat when smoking dehydrating. I hope you find this hint helpful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAURUSGIRL"
},
"reviewBody": "This was my first time making jerky. I do not have a dehydrator so I followed advice of another reviewer and it worked perfectly. I used a foil lined bakers sheet and put the jerky on a cross-wire cooling rack. Baked at 150 for about 5 hours, opening the door to let out steam every now and then. Followed recipe exactly (did marinate overnight and doubled the meat but not the marinade) and would not change a thing, nor leave anything out. This was excellent and easy! This jerky is the PERFECT road trip snack! I definitely recommend doubling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "Followed the recipe exactly. After marinating for 4 hours I took out 1/2 the meat to dehydrate. Once that batch was done drying I made the rest and had people taste test them to see if marinating them longer (18h) made a difference. It did not. It was all fantastic! \n\nThanks for sharing! I have my next batch in the fridge marinating now :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brad"
},
"reviewBody": "Excellent! First let me say great job and thank you. Taking the time to record and post proper potions made my part a piece of cake. Now, if I like I can tweak it. The only thing I did different was to add my own dried ground Sarrano peppers in the amount you recommended, great kick. \nI remember growing up and when my Mom and Dad would get back from elk or deer hunting we would string row after row of jerky across the garage and back yard. My Mom would salt and pepper it and that was all. Hay it was great but it was the same every time. Carne seca. \nI love that this is sweet and spicy. I knew after reading it that it would be caramely sweet because of the ingredients. No surprise there. Again, thanks for the recipe. Brad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janene"
},
"reviewBody": "This has to be the best jerky I have ever tasted!! My first time ever making it, I viewed a few other recipe's and most of the comments before hand. I only changed a few things.. i changed the meat cause I couldn't find anything on the shelf at the grocery store, I used a slab of flank steak from the butcher. I sliced and marinaded it for 12 hours. used 3.5 tablespoons of the liquid smoke. also I just added all ingredients to a big bowl instead of the two steps stated above (just easier for me)\nIts still in the dehydrator now, been 5 hours, Just checked on it and had to test a small piece, I couldn't resist it anymore lol mmmm mmm mmm wow!! My hubby will be in heaven when he gets home!! Our thanks to you for posting!! CHEERS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri L Kriete"
},
"reviewBody": "Love love love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori A."
},
"reviewBody": "I was marinating a steak in balsamic dressing and didn't get to cook it in a day or two so I decided to make jerky. I put the beef strips on a grilling rack; the pan was lined with aluminum and I sprinkled with ground black pepper. I cooked the beef on the racks at 150 degrees for 5-6 hours. I will definitely use this again when I am pushing the envelope on a steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Vereschagin Tripp"
},
"reviewBody": "I bought myself a food dehydrator this last spring intending to use it for the most part for the extra fruits and herbs I grow but my husband asked me to try to make some jerkey since he loves it and the store bought stuff is so expensive. I searched for a recipe to try and came across this one. Don't bother with heating the liquids and sugar or seasoning the meat w/dry ingredients, just mix everything except the meat in a bowl and stir well, the sugar dissolves really easily and you don't have to wait for the marinade to cool down. I didn't use the worcestershire sauce because it has fish ingredients and instead used extra teriyaki sauce and balsalmic vinegar and we love garlic so I used and extra 1/2 tsp. Let me tell you it was a hit! On my second batch I used a tiny bit more onion powder, black pepper and red pepper flakes than called for so we could have a bit more heat to balance the sweet. I've made this a dozen times now and have given it out as gifts, made it to take camping and sent some with my husband to work and everybody who's tried it has raved about it. The recipe makes way more liquid than needed for 1lb of meat, I've used this recipe to marinade 3lb of beef and it was fine. Put the marinade in a large ziplock bag, or divide between two depending on how much meat you have, squeeze out the air and let marinade over night for the most flavorful jerkey you've ever had. I not going to bother searching for another jerkey recipe, this is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JennnnLian"
},
"reviewBody": "This was not good! I'm not sure how it got such high reviews. I followed the recipe exactly. The end result was slightly sticky jerky with a caramelized coating. It was more of \"spicy beef candy\" than a traditional jerky. Also, this make a LOT of marinade...you could use a lot more than the recommended 1lb of meat for the amount of marinade the recipe yielded."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slief"
},
"reviewBody": "This recipe is great! Like others, I cut back about 50% on the liquid smoke. I also added a little bit of maple syrup and honey. Very impressed with this recipe. One of the best beef jerky's I've had!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/86194/jerky-lovers-jerky-sweet-hot-and-spicy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17041/appetizers-and-snacks/meat-and-poultry/jerky/",
"name": "Jerky Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/86194/jerky-lovers-jerky-sweet-hot-and-spicy/",
"name": "Jerky Lover&#39;s Jerky - Sweet, Hot and Spicy!"
}
}
]
}
}
, "about": [
]
}
]