				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jewish Chicken Soup"
,"datePublished": "2002-06-17T21:42:01.000-04:00"
,"dateModified": "2022-08-28T23:22:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Layla"
,"url": "https://www.allrecipes.com/cook/24325562"
}
]
,"description": "This traditional Jewish chicken soup with matzoh balls is hearty, soothing, and delicious. Perfect for anyone feeling under the weather."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hZZWnoh1_zBaaL11_VJ0c4ZdSRc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2458827-jewish-chicken-soup-Allrecipes-Magazine-1x1-1-ea216ff1eeff4335af8595612039b8ba.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3327078391001",
"description": "This traditional chicken soup with matzoh balls is the original “health food.”",
"duration": "PT3M37S",
"name": "Jewish Chicken Soup",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ab5b33b4-dd36-45a5-a1fc-c268ade00742/8c36592e-2269-4842-b8c7-7cde24ff1b84/1280x720/match/image.jpg",
"uploadDate": "2021-07-16T02:50:56.977-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jewish Chicken Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "80"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "525 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "212 mg"
,"fiberContent": "3 g"
,"proteinContent": "32 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "721 mg"
,"sugarContent": "3 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 whole chicken",
"2 quarts cold water, or as needed",
"8 carrots, peeled and sliced",
"2 stalks celery, chopped",
"1 parsnip, chopped",
"1 medium yellow onion, chopped",
"1 bunch fresh dill weed, chopped",
"salt and pepper to taste",
"3 cloves garlic, crushed",
"2.5 cups matzo meal",
"6 eggs",
"6 tablespoons vegetable oil",
"2 teaspoons salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place chicken, breast-side down, into a large pot; fill with enough cold water to reach about 3 inches from top of the pot. Add carrots, celery, parsnip, onion, dill, salt, and pepper. Bring to a simmer over medium heat, and cook, partially covered for 2 hours. Do not let the soup boil. Skim any fat from the top of the soup. Add garlic, partially cover, and simmer for another 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Mix matzo meal, eggs, oil, 2 teaspoons salt, and 1/4 cup of broth from the soup together in a medium bowl. Refrigerate until set, about 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Bring a separate pot of water to a rolling boil. Roll matzo mixture into about 16 balls. Wet your hands to keep the dough from sticking to them. Drop matzoh balls into boiling water, cover, and cook for about 35 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hZZWnoh1_zBaaL11_VJ0c4ZdSRc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2458827-jewish-chicken-soup-Allrecipes-Magazine-1x1-1-ea216ff1eeff4335af8595612039b8ba.jpg"
}
]
,"text": "Meanwhile, remove chicken from soup; remove the bones and skin and cut or shred into pieces. Strain broth, reserving vegetables. Return broth to the pot; add chicken and vegetables (or reserve for another use). Remove matzo balls from boiling water using a slotted spoon; add to soup."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT270M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Schott"
},
"reviewBody": "I've always simmered the chicken and removed the scum before adding the vegetables. The time I did it your way the soup wasn't as clear. Hmmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryllion"
},
"reviewBody": "Really the recipe deserves five stars but I don't understand why they tell you to strain out all those yummy vegetables (Even though all the pictures of this recipe show it with the vegetables in the bowl). We just leave everything in. And it is amazing. The matzo balls came out two dense for us, so I just use the recipe on the matzo container (the third time I made this) and they came out better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanC"
},
"reviewBody": "came out fantastic. used 2 cups of matzoh instead of 2.5. liked them heavy like that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "I prepared this recipe tonight. I was confused on when to add the salt and pepper and I thought I should of added it in the beginning or when adding the garlic. I added extra garlic (5 cloves) instead. It tasted wonderful but I think would of had a more flavorful had I seasoned it earlier. The flavor was good (next time I will season in the beginning), the Matzo balls were very pleasantly easy to make and had wonderful flavor. This was my first time making or eating the soup. Than you for sharing this wonderful recipe. I did forget to garnish the soup with more fresh dill. Very healthy soup. Husband loved it and that’s what counts too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clevin"
},
"reviewBody": "Great soup recipe! Easy to make. Leftovers are great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond"
},
"reviewBody": "Great Chicken Souprecipe. \nI did not have parsnip, so I used a smally celery root, instead. \nIt may have tasted a little salty, to some, even though I added less than a teasponn of pink Himalaya salt.\nBut great.\nAnd the kneidlach were very good, too. Instead of \"vegetable oil,\" as called for, I used organic, extra virgin olive oil, from this season's batch. Calling them \"sinkers,\" is an understatement. But they were very good and very filling.\nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guyinatie"
},
"reviewBody": "I love this soup and make it once a month since I found it here. I’m not Jewish and wish I could make it as good as my childhood best friends g-ma use to make it. My kids love it w a little bit of dill pickle on top. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Works Gibson"
},
"reviewBody": "I’ve made two slow cooker batches this week — one for my house and one for my daughter’s because her family is fighting a bad flu and maybe pneumonia. Never leave out the garlic &amp; parsnips. I add sliced shiitake mushrooms — not traditional but definitely healthful. I like to add fresh lemon juice to individual servings. I don’t make the matzohs but do add rice, wild rice or interesting gluten free noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "garyst16"
},
"reviewBody": "Wow! Great depth of flavor! Modified the recipe a bit. Purchased a roasted chicken and used chicken broth instead of water since I wasn't cooking the chicken. Cooked the veggies for about an hour and 15 minutes. Added the chicken ast the 45 minute mark. Also added noodles to the soup. Excellent recipe. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne"
},
"reviewBody": "My family enjoyed this chicken soup. I added back fresh onions, celery and carrots and added back the shredded chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becka"
},
"reviewBody": "I made this delicious soup and my whole family enjoyed it including my picky eater 12yr old loved child didn’t make a fuss about dinner. This soup deserves a 20+ rating"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helio"
},
"reviewBody": "Love this soup - It is easier than the soup I have always made and it tastes amazing. I ended up using a pre-mixed box of matzo balls; as the store didn't have matzoh meal to follow the recipe. Wish I had the matzoh meal now. My family loved the soup and I had a lot left over to freeze for another time. This is now my go-to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Arlene Margulis"
},
"reviewBody": "This is a variation of the soup that I grew up with and it was tasty. We are of eastern European decent (I'm first generation American) and want to comment about some of the criticism, especially regarding dill. In my opinion, it's the dill that makes this Jewish Chicken Soup. However, different regions make it different ways and to be a snob about what should or shouldn't be included is just plain wrong. In Europe, especially during war time, people would put whatever they had into the soup so that they could stretch it out for several days. Root vegetables were cheap and plentiful so parsnips, carrots, parsley root, potatoes, and anything else that could be cooked and eaten would find it's way into the soup. So, to all of you soup \"purists\", have fun with it and understand that you are lucky to have the chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Shrode"
},
"reviewBody": "My boyfriend and I made this on the first night of hanukkah and we used a rotisserie chicken in the soup which cut down both the prep and cook time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Korostoff"
},
"reviewBody": "This is the matzah ball soup recipe that tastes most like the one I grew up with. If you're looking for dense \"sinker\" style matzah balls, this is the recipe for you. The flavor is really good and rich, though I use all chicken legs, rather than a whole chicken, which I feel gives a better result. Also, I think 4 hours is a decent minimum, but I usually do 6 hours. In a pinch, you get away with 2 hours by dropping in a bouillon cube or two at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Wasserman"
},
"reviewBody": "followed the direction it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacee"
},
"reviewBody": "Great recipe. I added egg noodles. If I had more time, I would have let the broth set overnight to skim off the fat, but it came out good..... bit hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beat_boutique"
},
"reviewBody": "Easy peasy chicken soup! Love the flavour... couldn't find Matzo in store .. ended up buying Knödel (Dumplings) instead .. skipped Parsnip ...added more garlic ... still tasted wonderful :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JACALK"
},
"reviewBody": "Good cooking method and natural ingredients. Flavorful chicken soup, the way it should be. I'm in love with parsnips, they add great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andreagua"
},
"reviewBody": "Doubled the veggies in the soup, used Rotisserie chicken for ease and flavor. Took off all the meat and then cooked the carcass and bones in the soup for 2 hours. Strained that out and added in the shredded chicken. Matza balls were a little dense/dry maybe would add more liquid when making them. Very tasty soup , will make again especially with a cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Gibson"
},
"reviewBody": "I leave out the parsnip and and add thyme and poultry seasoning. The dill weed is a must! Sometimes I add some petite diced drained tomatoes too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred"
},
"reviewBody": "I will make it again. it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGGIESCHNAUZER"
},
"reviewBody": "I have been making it just like this for years and now my grown children make it for their families. This is a great soup. We don't like the matza balls we use big wide egg noodles instead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniella Wilson"
},
"reviewBody": "I have made this so many times now and I love love love this recipe!. The soup is tasty and the dumplings are fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elf"
},
"reviewBody": "When I'm sick, I want chicken soup, made this and froze some, when my son got sick and I was away from home it made him feel better. He was well again in a day, even took some with him to work the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tessa Zamora"
},
"reviewBody": "This was one of the most delicious soups I have ever had. Hubby loved it. Teenager loved and even the toddler kept coming back for more! The only thing I did differently was no parsnips. I also used a matzo ball and soup mix for the balls since apparently no one cooks jewish food around here. Took a week to find it. Will have to special order matzo meal online because I will be making this everytime I make chicken soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen E."
},
"reviewBody": "My daughter and I made this recipe and it turned out to be a keeper! Thank you so much! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Good recipe only I add 4 or 5 chicken feet for flavor and adds a jelly for richness... discard them after cooking....also garlic and peppercorns and celery root are added .Carrots and parsnips can be added to cook in broth in final 30 minutes.Serve with barley or matzo balls.Skim some fat off after a day or so in fridge.....\nThe fat on dried bread makes a nice treat for birds in winter!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krissyxoxo68"
},
"reviewBody": "This soup is fantastic. My only difference when I'm rushed for time is using a rotisserie chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "Made this during Passover, but forgot to review until now. I loved the fresh dill in this and will continue to make it every year from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheilaT"
},
"reviewBody": "The longer this soup simmers, the more delicious it gets (sometimes I even make it a full day in advance), so if you only have a couple hours until you need to serve this, you might want to think twice. The blend of flavors is unforgettable, particularly when they all soak into the matzoh balls. (I like to put the matzoh balls in at least an hour before I serve the soup.) One shortcut I take is using a rotisserie chicken (meat only) and canned broth rather than start from scratch with the whole chicken in the pot, and the soup always turns out amazing. I've made this with parsnips a couple of times with good results. You really can't go wrong with this soup!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Miller"
},
"reviewBody": "I loved this soup althought the best thing for me was finding my mother's \"heavy\" matzo ball recipe. Hers were sinkers too and we loved them. She also never strained the soup but I guess with 5 hungry children, anything that filled the soup was a blessing. Thank you so much for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NNChick"
},
"reviewBody": "I tried this recipe twice. Once with the garlic and parsnips, once without the garlic and parsnips. I liked the latter. It's all about your personal taste, but it gave me a great foundation for lots of variations. For the Matzo balls, I made them smaller than the average. Smaller than a walnut... I like the little matzo balls and I also added some dried parsley to just give it a little color. Everything was excellent! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjustjoan"
},
"reviewBody": "This recipe truly works! I made this for my husband yesterday and this morning he was able to go back to work. I made one substitution however, a chayote instead of parsnip. He hates parsnips but loved how great the soup made him feel. Thanks for this recipe, it was worth the time it took to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpococke"
},
"reviewBody": "Excellent, whole family enjoyed and no leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msjamiesachs"
},
"reviewBody": "Amazing, amazing, amazing. We make a double batch and freeze quarts that we mix with manichewitz matzo ball soup whenever we want some awesome chicken soup!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "I came across this recipe searching for matzo ball recipes since I wanted to try making them from scratch vs. a mix. I haven't made them yet but wanted to comment on the soup recipe. It's interesting to read what others put in their soup. My Russian Jewish Great Grandma made hers with whole chicken, celery, parsnips, turnips, carrots, onions, dill and \"flanken\" (I later learned that flanken = short ribs). You only use a few pieces of the short ribs to give it some added depth &amp; flavor. For me dill is the most important ingredient for without it, it simply doesn't taste like Jewish Chicken soup. It comes down to what you're used to or what you grew up with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Talulabelle"
},
"reviewBody": "The parsnip gave it a flavor that I did not like. Next time I will leave out the parsnip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scriber"
},
"reviewBody": "I made this for my roommate, who came down with a nasty flu bug, and thought, \"Holy cow, I'm going to have to freeze some\", because it makes so darn much. Now, I'm extremely grateful it does, because roomie has passed the bug to me, and this soup is perfect for those under the weather days. I'm definitely saving this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannen"
},
"reviewBody": "Great recipe thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bangels117"
},
"reviewBody": "It was very easy to make and delicious. I also added some egg noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This is a wonderful recipe! My mother and grandmother (both Jewish) made chicken soup like this ~ they never used garlic! Always used parsnip, dill &amp; parsley along with the other veggies.\nThe only difference ~ never cut up the onion,parsnip dill &amp; parsley ~ threw it in and discarded after it was all cooked.. Actually they ate the parsnip! \nAlso good with fine noodles instead of matzo balls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deltakitten"
},
"reviewBody": "This was wonderful, thank you. I've made stock previously but always boiled it for hours. I noticed a big difference with the simmering. Thank you, great tip! I didn't add the dill but only because we didn't have any. I strained the stock into another pot and then picked the meat off the bones when it was manageable. Unfortunately, I ate the legs/thigh with some salt because I'm such a guts but, hey, cook's treat! But I used the breast meat in the soup and everybody loved it. Thanks for sharing Layla! Great recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "webdd"
},
"reviewBody": "Bland, Matzoh bombs. OK for stock, soup was just OK. Not much flavor. I will try and jazz this up tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Half Baked"
},
"reviewBody": "My husband said it was the best chicken soup he'd ever had. The matzoh balls bombed but the soup WAY more than made up for that. The dill and parsnips gave it a nice fresh taste. This one is saved and will be my go to recipe. Now if I could just solve the matzoh ball problem..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Garcia"
},
"reviewBody": "Who needs Campbell's?!?!? This is easy to make and very good! I opted to leave out the celery (not a fan) and added more garlic (whole cloves, not crushed) also used egg noodles in lieu of matzoh balls. Didn't even have to \"cut the chicken into pieces\" because by the time I finished cooking it the chicken pretty much just fell to shredded pieces! (you do have to be VERY careful to pick out all of the small bones before returning the meat to the broth!). I also added cooking sherry and parsley to my recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NaturalNat"
},
"reviewBody": "Delicious and Easy!\nThe only change I would make is to try and remove as much of the skin from the chicken before throwing the chicken and veggies into the pot. It just ended up being harder than I thought it would be to \"skim the fat off\". \nI cooked everything in the pot for three hours total and the bones were very easy to remove from the meat. \nVery yummy and has a large yeild. It will last me for days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dina"
},
"reviewBody": "An easy &amp; healthy soup. We're always trying to incorporate more veggies in our diet &amp; this soup helps us accomplish that. A low-fat dinner that everyone eats up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicejewishboy"
},
"reviewBody": "GREAT RECIPE!!! I love the \"sinkers.\" Thick, heavy Matzoh balls are the best! And I eat EVERYTHING. That means parsley, parsnips, and anything else added, including, guess what--the skeleton. Ugh... But simply delicious and very gratifying. Another suggestion: If you have a good bite, get into the bones, or suck the meat right off the bird. By now it's tender, right? :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny Allerton Monier"
},
"reviewBody": "We LOVE this soup! As I type this I am making a huge batch for us as we are all sick. This soup usually makes us feel better- settles upset tummies, clears out plugged up sinuses, and makes us sleepy. The only change I make is that I use 3 medium onions, 3 parsnips, no carrots, and no matzo balls. Per the suggestion of another person I stab the onions with a fork (I tried it with the parsnips today, too). Looking forward to a bowl of soup later! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Kaplan-Amitai"
},
"reviewBody": "In Israel practically everyone uses dill weed and it is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ozzie"
},
"reviewBody": "In every way I have been taught about chicken soup or chicken based soup ..... I was told to flavor it with garlic as they use this to avoid colds ---- don't knock it, it works. I have not had a cold in years and I am now turning 67. Add ginger to your taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lena-lena"
},
"reviewBody": "Great recipe, although in our family we never add garlic. Dill weed and parsnip go into the soup in Eastern Europe, it's the version I grew up with. To make the process a little easier, simply tie up a bunch of dill (I also add parsley) and drop into the pot. Same for onion -- no need to chop. Peel it, pierce with a knife in a couple of spots, and drop it in. Discard boiled dill and onion when done. Garnish the soup with fresh chopped dill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cyndee w"
},
"reviewBody": "wow--made this soup for my jewish husband who was sick--he was better the next day--this will really cure what ails you--I am a pharmacist perhaps I should print this out and give it to my customers--hummmm--thanks so much for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "matzohball"
},
"reviewBody": "I don't know what region the author is from, but in the south, we Jews use the following ingredients for REAL Jewish chicken soup: cut-up chicken, carrots, celery, and onions. parsnips and dill weed? No way! Of course, the matzoh balls are great. I like your recipe for them. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Beasley"
},
"reviewBody": "Loved it. This is a great tasting recipe for what we call \"jewish penicillin\". It will cure anything and everything. I made this recipe earlier this week after being dehydrated from the flu and I got back on my feet in no time!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faeriegal"
},
"reviewBody": "Wow! This was truly a tasty recipe. It was an exact duplicate of my grandmothers soup but I never had the recipe. Unfortunately, I couldn't find matzo meal at our store here on Kauai, so I had to settle for the soup without the matzo balls, but it was wonderful! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef4Six"
},
"reviewBody": "Sooo Good! Just like my mother always made it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Go GiGi"
},
"reviewBody": "great recipe! However, it is missing the chicken feet, just like my jewish great-grandmother's from europe taught her daughter. This recipe (plus the feet for flavor and gelatin quality) , including parsnips, has been used in our European Jewish family for hundred's of years?\nAnyway, here is an important tip:\nUse free range chicken not the grocery store chickens. This will give your soup a much richer flavor.\nAlso, simmer slowly for several hours, this also makes the soup much richer.\nIf you are in a hurry, you can add some Lipton's Onion soup mix, this will definitely give it a jolt of flavor.\nPS: I like floaters LOL\nthank you for posting this old favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "Very good flavor. Didn't use the parsnips. Only had dried dill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "I skipped the parsnip. Excellent \"floaters\" made with 1/2 the matzo. Dill was a great touch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy"
},
"reviewBody": "Gotta cold? Well let me tell you this soup kicks chicken noodle soups rear! If you are sick or its just cold outside this soup is like curling up in your favorite blanket and pj's,if you haven't already you gotta try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha Adams"
},
"reviewBody": "I made this for my sick husband and he declared that he was feeling \"much better\" right after having two bowls. The only change that I made was I boiled the chicken first in water, threw out the water (this way, I got rid of a lot of the chicken fat and other \"stuff\" that comes out when you first cook the chicken, and then I started with step one per the recipe as written. Really delicious and a definite addition to our family recipe book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanaquil"
},
"reviewBody": "This is a staple for me, I have made this soup many times! (I have yet to make the matzo balls, I have my own recipe for dumplings &amp; make mine differently.) But the method &amp; and ingred. for the broth are perfection---really warms you up on a cold Autumn day! Thanks so much for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie Hubshman-Edinger"
},
"reviewBody": "perfect chicken soup recipe yet no great Jew would ever add parsnips, never, and I love this recipe and use it all the time as I am an old practicing jew of old."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessabelle"
},
"reviewBody": "Fresh dill added a perfect flavor. I'll definitely keep this recipe around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbbdirks"
},
"reviewBody": "This was very tasty soup. I couldn't find matzo meal at the store, so I used my standard dumpling recipe. It was still very good. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cutediva"
},
"reviewBody": "Ok- This soup was amazing! Followed the recipe exactly and everything was perfect. The only thing I could not figure out was how to remove the chicken bone fragments from the chicken meat after the soup was finished...."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/51255/jewish-chicken-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
"name": "Chicken Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/51255/jewish-chicken-soup/",
"name": "Jewish Chicken Soup"
}
}
]
}
}
, "about": [
]
}
]