				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Jose&#39;s Shrimp Ceviche"
,"datePublished": "2018-06-08T09:46:54.000-04:00"
,"dateModified": "2018-06-08T09:46:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "carrielee"
,"url": "https://www.allrecipes.com/cook/2334148"
}
]
,"description": "Shrimp are marinated in lime juice, chopped, then tossed with tomatoes, hot peppers, celery and avocado for a zesty appetizer. Serve as a dip with tortilla chips or as a topping on a tostada spread with mayo. The fearless palate might like this with hot sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/__mIL8aO3rIo55wf7jdPqWTKHdo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1364063-8f54415666324e659ad13fdb2fabd1e9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Jose&#39;s Shrimp Ceviche"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "114"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "73 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "35 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "61 mg"
,"sugarContent": "2 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 pound peeled and deveined medium shrimp",
"1 cup fresh lime juice",
"10 plum tomatoes, diced",
"1 large yellow onion, diced",
"1 jalapeno pepper, seeded and minced, or to taste",
"2 avocados, diced",
"2 ribs celery, diced",
"chopped fresh cilantro to taste",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place shrimp in a glass bowl and cover with lime juice to marinate (or &#39;cook&#39;) for about 10 minutes, or until they turn pink and opaque. Meanwhile, place the plum tomatoes, onion and jalapeno (and avocados and celery, if using) in a large, non-reactive (stainless steel, glass or plastic) bowl."
} ,{
"@type": "HowToStep"
,"text": "Remove shrimp from lime juice, reserving juice. Dice shrimp and add to the bowl of vegetables. Pour in the remaining lime juice marinade. Add cilantro and salt and pepper to taste. Toss gently to mix."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cowboy Coug"
},
"reviewBody": "Excellent! I think a local store copied this, so I went looking for a recipe that looked familiar. This ingredient list is pretty close to what is the local's, looked the same after I made a batch.\nTo #Allrecipes: You show yield information with your recipes but I rarely see the actual serving size in the nutritional data. Given that weights may differ from person to person, batch to batch with the same liquid/juicy ingredient when using cups/milliliters makes the \"per serving\" measurement a bit lame. For this recipe I used about a ? cup basis but an actual weight would be better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NNN"
},
"reviewBody": "Recepie is great. I had to adjust it for my taste a bit to make it more sour and spicy. otherwise it's easy to make and it's perfect as everyday or a party dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funnygirlsue"
},
"reviewBody": "Left out the celery"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OtisT"
},
"reviewBody": "Fresh squeezed Lime juice and it was perfect. We're in the deep south and shrimp is usually fried. This was a big hit! I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DD in AZ"
},
"reviewBody": "I received rave reviews on this one. I did tweak it a bit by Marinating shrimp in equal parts lime, lemon and OJ (like Rick Bayless) . then draining it and then adding fresh lime and 1 T. oj at the end. It was delicious and fresh tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debrane51"
},
"reviewBody": "I used cooked, large prawns and added them one hour before serving with second half of the lime juice a wee bit of tabasco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Estrella"
},
"reviewBody": "followed directions exactly and was a big hit!!! very very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coral McMurtry"
},
"reviewBody": "Added cucumber instead of celery! Super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonC"
},
"reviewBody": "I ate a seafood ceviche in Dallas a few months ago, and I liked it so much that I wanted to try making it at home. I made this shrimp ceviche for lunch today. Didn't have any avocado and my DH doesn't really like celery in things, so I left those two optional items out. I used my mini food prep machine to finely dice the onion and jalepeno so they wouldn't overpower the taste of the other ingredients. I also cheated and used pre-cooked, shelled, and deveined shrimp. I think it would be even better with fresh shrimp, but that isn't always available here because we're too far from the coast. (Shrimp in the butcher's case here has always been frozen.)\n\nThis was really good. We tried it with cracker, soft tortilla, and tortilla chips. We decided the chips were the best. Thanks for a most enjoyable recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "howard"
},
"reviewBody": "THE BEST I HAVE EVER MADE! I made a half recipe, as there are just 2 of us, leaned heavy on the onion and cilantro, used some fairly large shrimp I got that were already cleaned so all I had to do was remove the tails and some of the shell and chop them up. chilled overnight and we both loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Thomas Sturm"
},
"reviewBody": "I added Chile tepin for extra spice marinated shrimp for at least an hour actually hour and a half after mixing everything together seems to taste better a few hours later rather than right away. I used lime juice and lemon juice some people I noticed use orange juice as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Sanford"
},
"reviewBody": "Excellent! Took it to a party and everyone loved it. Followed directions except a little bit short on the lime juice because I ran out of limes and used mostly sweet yellow onions with a little red onion to use it up. One big avocado was perfect. I am not a fan of celery so I left that out. Perfect spice with one large seeded jalapeno. I added 1 1/2 tsp of salt, 3/4 tsp of pepper, and lots of cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kris521"
},
"reviewBody": "I have to say this first people the lime juice will cook the shrimp do not cook it. I changed it a little saved one avocado for the top and used red onion and very little cilantro I don't like it. Very good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Harrell"
},
"reviewBody": "I used raw shrimp, gave me a nice \"crunch\" or texture. Nice flavor was excellent and easy to make. I cut recipe in half and still had a lot for two. I am about to make more with home grown tomatoes. Must eat when ready, leftovers bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pdzpt73"
},
"reviewBody": "Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr. Cynthia Butler"
},
"reviewBody": "I thought this would be challenging, because I never cooked any seafood with lime juice. It worked! The ceviche is fabulous! I did make some changes. I don't use table or sea salt, so I used a little lemon pepper, chili powder, and cayenne pepper (I like it spicy). Thank you so much for this recipe! Now I don't have to go to the store to get Shrimp Ceviche!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Handy"
},
"reviewBody": "I live in the Mexican Caribbean so options for ceviche abound! However, it's always the same, tomato and onions and shrimp with a bit of jalape単o, I went searching and found this recipe so I could make it myself. This is a great recipe and I love the use of the avocado. For a really nicely presented ceviche, make sure to dice all the vegetables and the shrimp (as the recipe states). Also, I like to add mango and finely diced zucchini but I omit the celery (not a fan). The dicing takes a while but worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Krischano"
},
"reviewBody": "Very easy and delicious.....Thanks for the recipe...!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol B"
},
"reviewBody": "It was delicious, but I agree that the shrimp needed more like an hour rather than ten minutes to \"cook\" in the lime juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erika Neyer Steinman"
},
"reviewBody": "They only change I made is I used an English Cucumber in place of the celery, and I pre-cooked the shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Bailey"
},
"reviewBody": "Wonderful flavor, but the shrimp does take way longer for the shrimp to 'cook' than the recipe says. After reading other reviews, I cut my medium shrimp into thirds, and it still took about an hour for them to turn pink. Totally worth the wait though! I will definitely be making again, but will plan on a longer wait this time around. Four stars for the recipe as written because of the time discrepancy, but definitely 5 stars for taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mara B L"
},
"reviewBody": "Excellent, simple recipe. Tasted just like on the beaches of Mexico. Used all ingredients, except celery and red pepper instead of jalape単o."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha Frank"
},
"reviewBody": "Love, love. love this recipe . It makes a lot so for a small party I cut it in half and still had plenty. Some people used pre-cooked shrimp. Don't do it. Fresh raw shrimp is what makes it Ceviche."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Moore McPherson"
},
"reviewBody": "I'm not a fan of this..but my husband thinks its the bees-knees. \nPlease soak your shrimp much longer then the recipe says..and cut your shrimp into much smaller pieces so it \"cooks\" faster and much much more even. It has a very very authentic taste to it...very very lemony..which I do not prefer (I lean more towards more american style ceviche) looks great served in those scoop style tortilla chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allbugs"
},
"reviewBody": "Amazing!!! I don't care for raw shrimp, so used a 12 oz pkg of cooked shrimp, cut up, and marinated in the lime juice for 10 minutes. I would cut the lime juice amount in half when doing it this way. Otherwise, I did the recipe as written, but cutting the ingredients by 25 % to accomodate the 12 oz pkg of shrimp. Everyone absolutely loved it. It makes tons, so for a smaller group, definitely cut it in half. I will be making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glenn good"
},
"reviewBody": "Awesome! Followed recipe exactly! Great starter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oscar Garcia"
},
"reviewBody": "5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinInCali"
},
"reviewBody": "I minced jalape単o, cilantro and onion in food process. Diced celery, and tomatoes. I added a squeeze of lemon juice and Louisiana brand cocktail sauce in the mixture. Also, I did not add avocado in with all the ingredients, I added in as I served. This is very tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "W0ndrW0m6n"
},
"reviewBody": "Fantastics flavorful cerviche! Great dish! I've made it many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alysaw184"
},
"reviewBody": "Added an extra jalapeno and a lot of salt and extra lime juice. Didn't use celery"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin Fogle"
},
"reviewBody": "I agree with other comments about the marinating time. It definitely takes more than 15 minutes for the shrimp to be ready. But other than that, this recipe is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy Plumadore"
},
"reviewBody": "Brought this to a cookout yesterday and it was a big hit. Based on other reviews, I rough chopped the shrimp before marinating it in the lime juice for about an hour. I added diced cucumber instead of celery. I would probably not add all of the lime juice the next time as there was a lot of excess liquid and it was a little tart, but everyone loved it - even my picky daughter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Hartman"
},
"reviewBody": "This is the best shrimp ceviche recipe I have come across yet. Tried it yesterday and the family loved it to death. Just followed the recipe as is and it turned out great. Just the right amount of kick to it and it works really well with the strong flavors from the cilantro and lime juice. If you want yours to be a little hotter just use a couple green jalapenos and chop them up finely. Great job. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan Zahariades"
},
"reviewBody": "minus jalapeno, bell and less celery, cooked shrimp instead----- loved this!!! easy, quick and family loved it!! served with tortilla chips ????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessicastanfill"
},
"reviewBody": "Used only half an onion, no celery, tasted great. Put it on chips. Definitely takes longer to cook the shrimp than 10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Omit the celery - add seeded &amp; diced cucumbers instead, and you've got real ceviche! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jEn"
},
"reviewBody": "This was reallly realllllllly good BUT the shrimp did have to marinate for a couple of hours before it was \"cooked\" all the way through! (Chopping the shrimp up to increase the surface area helps, but still takes about two hours) Seriously worth the wait though. Will make this again, and again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Contia"
},
"reviewBody": "Dencent and tasty, I didn't cook the shrimp in lime, I added it after and let the lime juice marinate overnight. Also added extra onion powder and added the into the remainder in with the veggies. Afterwards I added the cevivhe on a tostada then drizzled garlic aioli along with sriacha on top. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ErinM"
},
"reviewBody": "Delicious. Easy. I have made this recipe twice. The first time it took about 25 minutes for shrimp to cook in the juice. The second time because I was packing lunches to go I just followed the recipe time of 10 minutes and although they didn't look quite cooked through yet, they continued to cook in the lunchbox and were ready when I was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rocky86"
},
"reviewBody": "I tried it exactly as the recipe goes. I think next time I'll add more shrimp in it. But it was delicious! I'll definitely make this again?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Faught"
},
"reviewBody": "I shelled deveined and cut up the shrimp prior to adding to fresh squeezed lemon juice. I used one avacado and only half an onion. I didn't use celery. Basically I followed the recipe but used what I had on hand. It cooked for approx 2 hours. Anyhow. Thank you for sharing this recipe. It is a great foundation and I agree with the other reviews, don't be afraid to make it your own. It will be awesome as the rest have. Enjoy it. It says summer fun all over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xtriciax"
},
"reviewBody": "Very awesome flavors. Shrimp in no way done after a few house. Finally had to pull them out and quickly blanch them in boiling water to cook in time for party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H2Monroe"
},
"reviewBody": "This was so good. You can add what ever you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daddysgrl"
},
"reviewBody": "The first time I made this I followed the recipe as is and it was scrumptious although the shrimp isn't cooked in 10 min no matter how small the pieces are, I did mine overnight. I made it today with the following changes:I used radish instead of celery,red onion instead of yellow &amp; let sit for 4 hours in fridge before adding ingredients other than shrimp and lime juice. We eat it on scoopable tostitos and it's delish! Soak your onion in salted water for 10 min to lesson strong onion flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sdriver19"
},
"reviewBody": "I was looking for a healthy meat with a lot of flavor and this was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandee1"
},
"reviewBody": "Made this recipe for a New Year's Eve party and it turned out great. I did make some modifications though....First, the \"cooking\" time was definitely NOT 10 mins. It was more like 4 hours and I even cut them in small pieces after the first 2 hours. I added diced mango, green pepper &amp; crabmeat. I used red onion instead of white and cucumber instead of celery. Very delicious and even better the day after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medea Dudley"
},
"reviewBody": "Absolutely loved how easy this was to make and it tasted great too. Used Serranos and jalape単os and they worked. Took it to a New Year's Eve get together and it was a hit!! 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "foodiefoodie"
},
"reviewBody": "I cooked my shrimp first by boiling just in case the lemon doesn't kill everything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilee"
},
"reviewBody": "This is one of my favourite recipes! Didn't change a thing; so easy to make yet never fails to impress guests. I served it as an appetizer with hunks of pumpernickel bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashleigh Byrd Siddiqui"
},
"reviewBody": "I was looking for a quick and easy ceviche recipe and this was perfect! The flavors were awesome. I used cooked, frozen shrimp and did not use the avocado or celery. We made it twice over the Memorial Day weekend and EVERYONE asked for the recipe. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I prepared this recipe mostly as it suggested but needed to let my shrimp marinate longer than they stated because they werem still quite raw after 10 minutes. my limes may not have been acidic enough to work fast. I decided to cut them up smaller and let them go longer until they firmed up a bit and no longer appeared translucent inside. I also grated a small amount of fresh orange peal and added it to my dish along with the juice of 1 orange just before serving. It rounded out the flavors of the dish nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heavy Kevy"
},
"reviewBody": "great recipe. We had large 21/25 shrimp so I let them \"cook\" overnight. We also added some homemade dried jalapeno and 1 small grove pepper to add more heat. served with hot faltbread\nand throughly ENJOYED!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kris McDonald"
},
"reviewBody": "Rating is on this particular recipe only. If the shrimp are raw, the time given is NOT even close to long enough. For best results, I leave raw shrimp in lime juice over night in fridge to properly \"cook\" them. At least 6 hours if I don't have the time to make the night before. For quick prep, I use cooked and peeled shrimp. I add other ingredients several hours before serving to let everything absorb and mix flavors.\n \nI also add Mangos to this recipe for some extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moni"
},
"reviewBody": "My husband absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LalalandMamma"
},
"reviewBody": "I have made this several times. It's always a hit at get-togethers. I like to try different variations. I am going to try adding mango next time. Spicy &amp; sweet. I also use imitation crab and 4 jalapenos, 1 wasn't enough kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nettie"
},
"reviewBody": "Truly a wonderful recipe. We just got back from a trip to Belize where we ate Ceviche every day, made with shrimp, conch, or snapper. This recipe was almost exact to what we had down there. The only thing I did different was to add cucumber and I did not add the optional avocado or celery. Very tasty and authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GMonkeyMomma"
},
"reviewBody": "I just made this today and it's fantastic!!! I didn't have a yellow onion so I used green onion, and I also added red bell pepper. I left out the celery and cilantro. I love recipes like this that are so versatile. I can't wait to make it for my family when we go to the beach this summer.\r\nThank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Casabal"
},
"reviewBody": "Omited celery added mango. My husbandand I loved it. He is usually hard to please."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Al Harris"
},
"reviewBody": "Added minced garlic and left out the celery and jalapenos (I have a child who cannot take even the slightest spiciness). Served it in hollowed-out avocados with blue corn chips on the side. Turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cedar"
},
"reviewBody": "Delicious! Had never made Ceviche before and I'm so excited that it's so easy and so open for creativity. I used cucumber intead of celery, extra jalapeno, I threw in some yellow bell pepper for sweetness and color, and at the last minute decided to throw in some black beans. Everyone Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faasie"
},
"reviewBody": "Served this on lightly toasted french bread with a dab/drizzle of Sriracha Hot Sauce. Amazing!\nMade this on a beach trip using pre-cooked frozen shrimp. Was excellent even with frozen shrimp! Was so good and went so fast they sent me out to make a second batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NJstixx"
},
"reviewBody": "Loved it, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swells22"
},
"reviewBody": "Wow! This was so tasty and simple to prepare. My boyfriends mom is an excellent Hispanic cook and he said these were pretty darn close to hers which are fantastic! We were a little leary about just using the lime juice to cook so I added the shrimp to boiling water for about 2 min then put them in an ice bath before chopping up and adding it to the lime juice. I then let it 'cook' in the lime juice for about 30 min. I followed the recipe as written from there. I served the ceviche on fresh corn tortillas That were baked till crunchy in the oven. Excellent recipe, I know this will become a fresh, healthy staple in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coronagirl0828"
},
"reviewBody": "This was good. It took waaaay longer then 10 minutes for the shrimp to \"cook\", close to an hour. I think this would be great for dipping tortilla chips in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debi Dempsey"
},
"reviewBody": "This was really good! It's nice and fresh tasting; would be a great summer meal. \nIt did take a few hours for my shrimp to 'cook' in the lime juice, so keep that in mind. I halved this recipe, but next time will halve everything but the shrimp and avocado...then, it would be perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrscdc228"
},
"reviewBody": "Excellent! I added a few cloves of minced garlic and one sliced up avocado to this recipe, the avocados stay green and firm thanks to the acid from juice. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamabaker08"
},
"reviewBody": "If you're going for authentic, sure follow the \"cook\" in lime juice method; but it's still delicious if you use pre-cooked shrimp. If I had been brave enough to use fresh, raw shrimp I would let it marinate longer just for good measure even if pink/opaque shrimp is the sign of it being done. I really enjoyed the flavors in this dish, despite not being a big seafood fan. I made it for my husband who loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PM Nichola Saunders"
},
"reviewBody": "Absolutely Love, I prepare this w/o the celery and avocados. My family enjoys this very much. I goes really quick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Regina"
},
"reviewBody": "This was so yummy and fresh. I can't wait to make in the summer time. I did make a couple changes... I added: 2 cups Clamato cocktail juice, cucumber, white onion instead of yellow and lemon juice instead of lime. We put this over tostadas. And it was Mmm mmm good. Easy dish to make for a lot of people. 4lbs of shrimp served about 8 adults and 4 kids. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tara Thomas"
},
"reviewBody": "This recipe was very similar to one that I had in a little mexican place in the middle of Nevada. It needed more than one jalapeno though. I was a bit wary of \"cooking\" the shrimp with the juice. I only had cooked shrimp the first time around and it was bland from not absorbing the juice. It was much better the second day though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fonaneno"
},
"reviewBody": "so easy to mix and match whatever you like. I love this with mango added!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been using a recipe similar to this for years, but we call it shrimp salsa. I make it all the time for parties, and I never have any leftovers to bring home. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisadynae"
},
"reviewBody": "I've been using a recipe similar to this for years, but we call it shrimp salsa. I make it all the time for parties, and I never have any leftovers to bring home. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rachaelcdy"
},
"reviewBody": "I love ceviche! great reicipe minus the celery. It took the shrimp about an hour to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeremiahjohnson"
},
"reviewBody": "i am currently in the process of preparing this dish and the shrimp have soaked for over an hour in the lime juice but have not cooked through. be extremely cautious following this recipe under the advised 10 min soaking as food poisoning is extremely dangerous and life threatening, especially shellfish. though the shrimp may appear cooked (white) on the outside be sure to open them and check the center. you may even try cooking the shrimp and then soaking in lime juice. i'm sure the final product is going to be delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merestwins43"
},
"reviewBody": "Haven't tried it yet but it's been over an hour and the shrimp have yet to \"cook\" through. I just diced them up to try to speed it up as I am serving this in two hours....I recommend letting it marinate all day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marivee"
},
"reviewBody": "Loved it, was a big hit at my daughter's birthday party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikeinak4u"
},
"reviewBody": "yumm just like Panama (the country that is)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "I made this ceviche for a potluck and everyone loved it. I used half a pound of halibut and half a pound of shrimp, and added a mango instead of avocado or celery. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inna"
},
"reviewBody": "It was delicious! I added half of a yellow pepper and a teespoon of evoo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cusine By Colleen"
},
"reviewBody": "Made it last night for a big group of friends &amp; they all loved it! The celery really did add a nice little touch. Since I didn't have a lot of time, I used already cooked shrimp - only marinated for about 2 hours before I served it. Fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nina Rocca"
},
"reviewBody": "Yum! I was craving ceviche and this was perfect! I tweaked it slightly though, by adding diced cucumbers instead of celery, the juice of one lemon, and some lemon and lime zest. I also used frozen cooked shrimp and canned diced tomatoes, and was amazed at how fresh it still tasted. This is a great basic ceviche recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Phillips"
},
"reviewBody": "Loved this! I didn't change a thing. Great balance of flavors - I am a huge fan of ceviche and am thrilled to have a new \"go to\" recipe that is so simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "Loved this recipe!!!! Next time i am adding some mango for some extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lin brand"
},
"reviewBody": "I made this for a dinner party I threw. Everyone love it. I ended up using large shrimp and only used half a pound. I added two pieces of white fish as well. I let it \"cook\" in the lime juice all morning. Other than that I pretty much stayed with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Geranimo"
},
"reviewBody": "This is quick! If you want to \"kick it up a few notches, use green jalepeno's chopped fine. It gives a sweet starting taste and a little \"afterburner\"... Sweet and sassy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NancyJak"
},
"reviewBody": "I used this recipe in conjunction with a ceviche I had at a restaurant so I ommitted the celery and avacado and used a red onion instead and added mango.\nI let the shrimp soak in the lime juice for about 4 hours, put everything together and put it on ice to get it really chilled.\nI quartered flour tortillas, sprayed them with cooking spray and baked them @375 for 10 minutes and served them with the ceviche - they were perfect together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefjulia"
},
"reviewBody": "It was great and simple. Everything really tasted great together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeramie L Velarde"
},
"reviewBody": "My taste buds are dancing this is a great dip.I used stewed tomatos instead.I reccomend Marvin Gaye as your fixing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mryan44"
},
"reviewBody": "The flavors for this recipe worked really well together, and the final product tasted great. The marinating time for the shrimp was way too short. After an hour, I cut into a n ice pink shrimp to find it completely raw in the middle. I cut the shrimp up into little pieces, and let it marinate for another 3 hours until it was pink all the way through. The recipe is worth making, but I recommend cutting the shrimp up and then letting it marinate all day."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/139917/joses-shrimp-ceviche/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
"name": "Dips and Spreads Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1244/appetizers-and-snacks/dips-and-spreads/shrimp-dip/",
"name": "Shrimp Dip Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/139917/joses-shrimp-ceviche/",
"name": "Jose&#39;s Shrimp Ceviche"
}
}
]
}
}
, "about": [
]
}
]