				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Kalbi (Marinated Beef Short Ribs)"
,"datePublished": "2020-06-18T23:10:27.000-04:00"
,"dateModified": "2022-07-14T17:18:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LYZZARD"
,"url": "https://www.allrecipes.com/cook/938508"
}
]
,"description": "This variation of a traditional Korean recipe for marinated beef short ribs uses a marinade with soy sauce, sugar, sesame oil, and garlic."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/vEOpsiBKFrZCH-jIlfMKN_kuSTI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3321797-e7d28ae17026498cb43626e502ad6122.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Kalbi (Marinated Beef Short Ribs)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "45"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "995 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "155 mg"
,"fiberContent": "1 g"
,"proteinContent": "39 g"
,"saturatedFatContent": "31 g"
,"sodiumContent": "1888 mg"
,"sugarContent": "26 g"
,"fatContent": "80 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.75 cup white sugar",
"0.75 cup soy sauce",
"0.25 cup sesame oil",
"4 cloves garlic, minced",
"3 green onions, chopped",
"2 tablespoons sesame seeds",
"5 pounds beef short ribs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir the sugar into the soy sauce in a bowl until the sugar dissolves completely. Whisk the sesame oil, garlic, green onions, and sesame seeds into the soy sauce. Place the short ribs in a large, sealable bag and pour the marinade over the meat. Marinate in refrigerator for 8 hours or overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat an outdoor grill for medium heat, and lightly oil the grate. Remove the ribs from the bag; discard the marinade."
} ,{
"@type": "HowToStep"
,"text": "Cook the short ribs on the preheated grill until they are very firm, hot, and grey in the center, about 15 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C)."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT520M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Limelite NoGA"
},
"reviewBody": "Delicious as directed. But for real over the top flavor, drizzle honey and good balsamic vinegar on the short ribs when served."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rownak Chy"
},
"reviewBody": "I followed the instructions of the recipe for the most part but I added chopped cilantro and chilli powder to the marinade. Seeing I don’t have my grill ready for the season yet, I baked this for 8 hours at 275 degrees. It was fall off the bone beautiful. My family loved it. Will definitely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angie Townsend Telford"
},
"reviewBody": "Way too much sugar. I’d use just enough to make it a little sweet or better yet use a healthier option. I’d add some fish sauce, and a little spicy red pepper too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke Meade"
},
"reviewBody": "this recipe was very good. I cooked it in the oven like someone stated previously. my friend loved them and has been craving them so she asked for the recipe. the only thing I did different was I added about 1/2 a cup of the glass bottle coke."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Forsberg"
},
"reviewBody": "My family loves this recipe! We make it frequently. I have tried various cuts of beef with it - our favorite is to use Sliced Beef Ribeye Rolls from our local H-Mart (Asian market). Yum yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shoshanawitz"
},
"reviewBody": "This recipe was beyond amazing. My only change was I used half the sugar. Otherwise I followed the recipe completely. My dinner guests were so impressed. So flavorful and delicious. Just perfect. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toi "
},
"reviewBody": "I marinated my short ribs for 8 hours and cooked them in the oven for 2 1/2 hours on 350. Removed the bone once meat started to separate. Very tender, they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Wiley-Williams"
},
"reviewBody": "I tried this recipe. Followed all of the ingredients except the sesame seeds. Also baked on oven for 3 hours as opposed to grilling. Flavor was wonderful, meat was tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paul Williams"
},
"reviewBody": "Really great flavor. I baked them instead of grilling just because I don't like to grill. Baked at 225 for four hours, without removing the marinade. Meat was falling off the bone, and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissCook"
},
"reviewBody": "It's a good recipe to follow for a standard version of Korean BBQ. I have an Asian friend who taught me this recipe 10 years ago, using brown sugar instead of white, and including ginger to the marinade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "n/a"
},
"reviewBody": "We loved it but I made quite a few changes. I didn't marinate at all but put everything in the slow cooker. I turned the ribs every couple of hours and cooked on high for 6-7 hrs. then low for 1 hr. We would do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Hester-Jernigan"
},
"reviewBody": "Love this recipe! Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alycia Newland"
},
"reviewBody": "Made this for dinner. Soooo yummy! The whole family enjoyed it, including the picky teenagers and 2 yr old"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Jenski"
},
"reviewBody": "Awesome marinade!!! I didn't have enough short ribs for the fam so I got a chuck roast and cut it in thin slices across the grain and added that to the mix. My kids LOVED this and they are picky. My son wanted to eat more for breakfast the next day. Turns out I am not a fan of short ribs, so next time I will just make the chuck roast this way and make a double batch as the leftovers didn't last at all! I also made Fried Rice Restaurant Style and my picky eater ate everything on his plate (which never happens). Solid 5 star recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scorch"
},
"reviewBody": "This is really good, very nice flavor! I only marinaded the beef ribs for 3.5 hours and it was great. If I would have let it marinade over night it would have been even better. I recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S S"
},
"reviewBody": "I will make this again. I didn't use it in short ribs. I used this to marinate thin cut steaks. I also marinated chicken. The meat took to the marinade in about 4 hours, but the chicken needs to be marinated overnight.\n\nI reduce the sugar to half, as I like my meat with more of soy sauce flavor. Also used a generous portion of ginger and garlic. \n\nExcellent flavor, and I will use the recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sol Poms"
},
"reviewBody": "I made this for supper and it went fantastically well! The family loved it. The flavoring was spot on and the portion was perfect. I as well opt for baking it the oven for 400 degrees for two hours. I didn't feel like grilling it or I was lazy to pull the grill out. Highly recommend this dish to anyone. It was very easy to make and the ingredients were simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lar"
},
"reviewBody": "awesome served on rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LJ65"
},
"reviewBody": "Easy to put together will try it on chicken wings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "Great flavor! After marinating overnight, I cooked them with the marinade in a crock pot on low for 8 hours. I wasn't convinced that straight to grill would be good, all short ribs recipes I had required slow cooking. The crockpot made the beef so tender. I intended to grill after cooking but didn't need to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charmaine"
},
"reviewBody": "I tried this and the whole family loived it. Those of you who thought it tough should probably try to brine you meat first 8 hours or overnight. (3/4 cup kosher salt, 3/4 cup sugar, and dissolve in 1 cup boiling water. To this add 1 gallon cold water). The sauce is excellent and will try it on pork chops this week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nakia"
},
"reviewBody": "This was so good. The aroma and the taste, we were licking our fingers, it was yum yum good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lynnardo"
},
"reviewBody": "Terrible, might have been the ribs I bought but they were tough and they just had a horrible taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blarlene"
},
"reviewBody": "I tried this recipe and the only thing I did differently was cook them covered in a 400degree oven for 1 hr because it was raining outside. I couldn't wait for the veggies and mac and cheese to finish cooking because when I taste-checked the ribs for doneness, they were so darn good that I snatched one out of the pan and ate it up! I refer to them as \"award winning\". I'll bet they are totally awesome on an outdoor grill.-CharleneB"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "Delicious. Made easy with bottled marinade; Trader Joe's Island Soyaki Sauce. Low-and-slow-cooked in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabray"
},
"reviewBody": "This was the first time I have ever made ribs at home (besides cooking in a dining facility) and I decided to prepare them using this recipe and they came out superb. Although the recipe says to grill ribs, I let mine bake in the oven for 1 1/2 hours instead. I felt like I was eating at a chinese restaurant after trying these. At first I thought about adding honey to sauce, because I was concerned about soy sauce giving ribs a salty flavor, but decided to prepare as is and was surprise at how well the flavors blended together. I am looking forward to preparing this again in the near future. Thank very much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Used this sauce and boneless short ribs in the crock pot. Served over rice. Fantastic! one of our new favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I've used this recipe a handful of times. Each time I made it, everyone raved about the ribs, even scooping up the last drop of juice and and pouring it over their rice. Since I do not have a grill, I cooked the ribs in the oven. I used aluminum foil to seal the ribs like a tent and gave it more of a steam effect so that they came out very tender; the meat was falling off of the bones. I cooked it in 400 degrees for 1 1/2 to 2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bluebearpt"
},
"reviewBody": "Used the marinade for a flank steak. Fantastic! Such good flavor. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alenh85"
},
"reviewBody": "Great recipe. Simple but yet so yummy. The meat does not require so much time to marinate. I marinated my ribs 2 hours and it was more then enough time. So much flavor. I already tried this marinate on chicken wings and they came out delicious. This will definitely be a recipe that I will use time and time again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILoveTaiwaneseSausage"
},
"reviewBody": "This recipe works for me. To get the best taste, I marinate the ribs for 5 days. The weather is not too nice to grill right now, so I cook it in my Flavor Wave. It turns out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MawMaws"
},
"reviewBody": "This recipe was amazingly good. I did use the boneless ribs and I did do it in my crock pot is the only thing different. they came out so tender...even my picky hubby loved them =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "philly6288"
},
"reviewBody": "This was good but was a bit salty. Could be my fault because I didn't put as much sugar as the recipe asked for. I would make it again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmandaT"
},
"reviewBody": "I give this only 4 stars because I did not make the recipe as directed. I used boneless short ribs. I ran out of soy so I had to use some teriyaki and also used a gourmet bloody mary mix when I ran out of teriyaki. I didn't have any sesame seeds so I omitted them as well. Instead of grilling, I broiled the ribs for 7 minutes per side and then sliced them into medallions. They were so tender and flavorful and were a huge success at my party. This marinade recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Saucier Du Fer"
},
"reviewBody": "I totally agree with Rogue; these babys are going to be tough and virtually inedible, done with short ribs on a grill for 30 minutes. In a smoker, (periodically basted,) or braised in a reduction sauce or a light broth in the oven, or a dutch oven, stovetop... that'd be the way to go. But, I'll give it three stars foir the marinade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Royall Clark"
},
"reviewBody": "I used the marinade for some Korean style spare ribs and then put on the BBQ. My guests really liked the flavor and took the recipe with them. There is nothing I would change in this recipe. BUT, if you were so inclined, you could add hot spices to this to kick it up a notch or two! I'm not into heat but some of you I'm sure are! Aloha!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RandySweet"
},
"reviewBody": "I can see why your friends all request it - repeatedly. Since I found this recipe about 3 months ago I have made these ribs 5 times. This is such the perfect recipe. Every sense - and those of the neighbors - are heightened when this is cooking. Fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ScottFamily"
},
"reviewBody": "This did not work for us at all. The flavor was very good (hence the 3 stars) on the tiny portion that was edible, but the ribs didn't grill right at all. I think it would have been much better to try this marinade with slow cooking the ribs instead of grilling them. They were almost impossible to eat and mostly went to waste, it was very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irma"
},
"reviewBody": "OMG! THE INGREDIENT COMBINATION WAS SUPERB. IT SOUNDED SO GOOD I COULD NOT WAIT TO MARINATE I JUST BAKED. DELICIOUS THANK YOU"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/67001/kalbi-marinated-beef-short-ribs/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/700/world-cuisine/asian/korean/",
"name": "Korean"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/67001/kalbi-marinated-beef-short-ribs/",
"name": "Kalbi (Marinated Beef Short Ribs)"
}
}
]
}
}
, "about": [
]
}
]