				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Kentucky Bourbon Balls"
,"datePublished": "2018-07-19T09:03:32.000-04:00"
,"dateModified": "2023-02-23T10:56:03.832-05:00"
,"author": [
{"@type": "Person"
,"name": "KY Piano Teacher"
,"url": "https://www.allrecipes.com/cook/auntjessy"
}
]
,"description": "These bourbon balls are made with Kentucky bourbon-soaked nuts mixed with butter and powdered sugar and dipped in smooth chocolate for a boozy treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7ej0cy8i19vv0p7y6J-KqyfTxsg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/176961-kentucky-bourbon-balls-DDMFS-Beauty-3x4-2672-fad0b3b0de4a4a83957f8c6ab22ca58c.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Kentucky Bourbon Balls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "149"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "252 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "10 mg"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "28 mg"
,"sugarContent": "29 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dessert"]
,"recipeCuisine": ["Southern"]
,"recipeIngredient": [
"1 cup chopped nuts",
"5 tablespoons Kentucky bourbon",
"1 (16 ounce) package confectioners' sugar",
"0.5 cup butter, softened",
"waxed paper",
"18 ounces semisweet chocolate" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KYOvaq6pSGqUyaIYF2Km2jAWarE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/176961-kentucky-bourbon-balls-DDMFS-Step1-2605-e6e4c8e6a1f84c6a9f906a992859dff5.jpg"
}
]
,"text": "Gather all ingredients."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_Qw7lpE7gSiBzQeiCVGVMHez4kg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/176961-kentucky-bourbon-balls-DDMFS-Step2-2609-1-e64040574b374134a6a58d8e342c4915.jpg"
}
]
,"text": "Place nuts in a sealable jar. Pour bourbon over nuts; seal and allow to soak for 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/asHoY7Hr6L7L_JV_-u83NixfaK4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/176961-kentucky-bourbon-balls-DDMFS-Step3-2611-1-80f2f26a7b674760b66a571e2a5c9268.jpg"
}
]
,"text": "Mix sugar and butter in a medium bowl; fold in soaked nuts with bourbon. Form mixture into 3/4-inch balls and refrigerate for 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Line a baking tray with waxed paper; set aside."
} ,{
"@type": "HowToStep"
,"text": "Melt chocolate in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6s0vGaxKWN3bIE7GUvG153IHXAU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/176961-kentucky-bourbon-balls-DDMFS-Step4-2665-1-e2d1d8acb880441b8af0817b521e326c.jpg"
}
]
,"text": "Roll balls in melted chocolate to coat; arrange on the prepared tray. Store in the refrigerator until serving."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT990M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very disappointed with this recipe. Couldn’t taste of bourbon and near impossible to form into balls… they fall apart very easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "doug fenimore"
},
"reviewBody": "They tasted really awesome but I had a challenge with the chocolate dip. We are going to keep working at it to develop a good technique."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the way my Mammaw always made them. She made them with \"the same bottle of bourbon\" every year. I swear she took a nip or two over the months before the holidays but either way they were a great memory as well of the delicious things she made. She always made the holidays special by always adding \"Love\" to all she did for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bright"
},
"reviewBody": "I did not use any nuts in the recipe. I used 8 vanilla wafers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kate5977"
},
"reviewBody": "The bourbon soaked in to the chopped pecans perfectly. I soaked them for about 24 hours. I needed to add some Canola oil to the chocolate chips to have a nicer consistency to work with. Also be sure the balls are very well chilled prior to dipping. Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kestrel Moore"
},
"reviewBody": "I actually made a profile on here just to say that this is the worst recipe I have ever made. No, that’s not overly dramatic. It’s true. The ‘dough’ was sticky then crumbly and simply tasted awful. I wouldn’t even admit to using our good bourbon for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Conrad"
},
"reviewBody": "Super easy to make(bourbon,butter, pecans and chocolate best combination EVER). After I soaked the pecans overnight I blitzed them in a food processor to make them a more consistent size. I used a small cookie scoop to make the balls, and also froze the balls so they were easier to dip in the chocolate. Will become a much used recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "WOW!! First time making but definitely not the last. I did soak the nuts in a mason jar. Add enough bourbon (Willett) to just cover them then just rotated the jar throughout the week. Used a slotted spoon to remove from the jar into the butter/sugar mixture. Came out perfect. Put rolled balls in freezer for 30 minutes. I used melted chocolate almond bark (used 1/2 of a 24 oz package) and a fork to coat. They are so creamy and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamieusc25"
},
"reviewBody": "I loved this recipe as did the recipients of the Bourbon balls. I allowed the nuts to soak for a bit longer for a stronger punch and found it helpful to freeze them before dipping in chocolate. I'm making them again this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "William Wells"
},
"reviewBody": "I attempted this recipe twice and it was disastrous. The core of the bourbon balls starts to dissolve quickly when dipped in the chocolate, making it difficult to get a nice even coating. The finished product did not taste like any bourbon balls I've ever eaten in the past. The first time around, I thought maybe I was doing something wrong. My second attempt was rigorous, and still severely disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "Needs something with the melted chocolate so it doesn’t get chunky-looking and thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "The bourbon balls were delicious but the chocolate kept melting them before I could get them all dipped"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinginColorado"
},
"reviewBody": "So easy and everyone loved them. I did not change anything. The difference between these and other bourbon balls is that the bourbon flavors the rest of the ingredients without overwhelming them. (I used good bourbon, which may help.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Estes"
},
"reviewBody": "Have made these several times. Taste very much like the ones you would buy from makers mark. I use MM bourbon and add a little extra :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I have made Kentucky bourbon balls for years, lost my recipe. I decided to try this one. All went well until the chocolate. I used the double boiler on the stove (not my first attempt for this process.) It was mess in trying to dip roll whatever. I started over with a microwave method of melting the chocolate much easier and more efficient. Will not do this recipe again. I need to find my old family recipe. The flavor is not favorable.. I was told it taste like home. What happened?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Toland"
},
"reviewBody": "i rather liked them but my husband thought they were too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Made it last year as a part of my annual Christmas candies for gifting. They were a HUGE hit with everyone that tried them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cook"
},
"reviewBody": "Make them every year, everyone always loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chery"
},
"reviewBody": "This was my first time making these. They were easy to make. I did pop them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ruth"
},
"reviewBody": "This was wonderful! In fact, I gave one batch to my good friend for Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "margaret"
},
"reviewBody": "Needs more bourbon, but everything else was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cblackgo"
},
"reviewBody": "I made them a little extra boozy by soaking the pecans in 6 tbs. of bourbon. Like others, I found the mixture very sticky/runny to work with and found intermittent trips to the freezer very helpful. Even so, I found the mixture often melted under the heat of the chocolate coating, as I was dipping. (It melted into the bowl of chocolate as I was dipping/coating). I appreciated the other tips I read, here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason Henson"
},
"reviewBody": "Delicious. \nWill definitely make again. It became a quick favorite for everyone. \nEasy instructions, just follow as is and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Riordan Whitman"
},
"reviewBody": "great recipe. made these for christmas candy and they were a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luv 2 cook"
},
"reviewBody": "I made these with the semi-sweet choc. And although I hated to waste the other good ingredients I ended up throwing them out! Way too sweet! I made them again using milk choc. morsels with 1 TBSP shortening using a double boiler. I also freeze the balls with toothpicks in them so dipping them is easier. They do need to be kept in the fridg. until ready to serve, as the choc. gets a little soft. If you're like me pop one in your mouth every time you pass the fridge. Ha! You can use regular candy making dipping chocolate too , which is a firmer choc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrid"
},
"reviewBody": "Froze them before dipping in chocolate. Soaked the nuts for almost a week and they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Much better than the recipes with vanilla wafers. Reminds my husband and I of the bourbon balls we have purchased at the local Kentucky specialty and liquor stores. I added extra bourbon (a 4 count) while mixing the butter and sugar. They were not too dry. We finally found THE bourbon ball recipe. Will definitely be making every year. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "Perfect recipe and easy, use the whole 16 oz box of powdered sugar and don’t drain the nuts! The sugar and butter looked very dry (still like powdered sugar) after mixing. I was going to drain the nuts after reading some of the reviews that said to, BUT DON’T. That tiny bit of extra liquid brought it together perfectly. I used my stand mixer and a cookie scoop for the balls. The scoop eliminated the mess of rolling the balls and they looked perfect! And they are delicious! The photo is before dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita"
},
"reviewBody": "Made multiple batches for an organization event. They came out lovely and the flavor was spot one. You can get about 25 one-inch balls per recipe. I put 5 cups of chopped pecans into a quart jar, adding 5 tablespoons of bourbon after each cup of pecans. I rotated the jar for 2 days so the nuts absorbed al the liquid. Making a double batch per heavy duty mixer worked great. I coated the first 100 with semisweet chocolate &amp; a pecan then coated the last 50 with unsweetened ghirradelli cocoa. The stronger bourbon flavor came through with the cocoa, although the chocolate were fabulous. Considering the work and mess involved with melted chocolate, I'll have not problem coating them all with cocoa in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pat Jones"
},
"reviewBody": "I made it as written except I doubled the recipe. Sickening sweet, truffle like texture. Taste is acceptable but I could only eat one. Will continue to try and find a similar recipe but not quite as sweet. A small crock pot works wonderfully to melt the chocolate and keep it warm while dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ukaggirl"
},
"reviewBody": "This recipe, with just some minor adjustments won me the blue ribbon at the Kentucky State Fair. They are very popular and requested for every party and gathering. I like to keep my pecan pieces a little on the larger side. This helps in getting more concentrated bursts of bourbon flavor and makes them a little less sweet. I also soak my pecans for several days to really let them soak up all the bourbon. If I am using general semi-sweet chips (think Nestle or Hershey's) I typically add a little shortening to thin it out a bit and help get a nice sheen. They are even more delicious if you can use a high quality chocolate that is tempered. A plastic fork with the center two tines removed makes an excellent dipping tool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "miss whitney"
},
"reviewBody": "These turned out great. The only thing I would suggest is putting them in the FREEZER a day or two in advance. I had mine in the fridge initially and they didn't harden very well. Even after they are in the freezer, I was still able to roll them into a ball.. which was nice because they lost their round shape when they were in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna "
},
"reviewBody": "Great easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettyj Rivera"
},
"reviewBody": "I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L L"
},
"reviewBody": "I made this according to recipe except I used B&amp;B (Benadictine and Brandy) because that's what I had on hand. Everyone LOVED them! Will be making these for the Christmas season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shore Bird"
},
"reviewBody": "Very good but the recipe did not tell you were to / when to put I the 5 tbs of bourbon. So I will try this again and they will turn out better. Very good flavor. I did soak some pecans halfs in bourbon then drained, lightly salted with sea salt roasted them at 375 for 5 min per side. Put them on top of the completed balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "If you make the recipe as given into 3/4 inch balls ,then count on having more. I doubled the recipe meticulously sticking with the 3/4 inch size. I ended up with 7.5 dozen balls. I suggest that you make each ball as small as possible (1/2 inch). Also, I recommend soaking the pecans longer than one night; especially if you like bourbon (who wouldn't!). I did add about 2 T. of bourbon to the BUTTER mix thinking it was too dry. This was a great idea! I then put the butter balls in the freezer since I had an errand to run. DO NOT ADD BOURBON to the chocolate. Rookie mistake! It will set up your chocolate in the double boiler like a rock in two seconds. (Can you tell I like the bourbon taste) I read that many folks say using toothpicks work, but I found that a dinner fork is faster. Keep a rubber spatula in the chocolate using it to scrape off excess chocolate. My maternal grandparents are from Kentucky so this will be a great Mother's day gift!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "At my husband's suggestion that it needed the Nilla wafers, I pureed a whole box of the mini's and added it to the other ingredients. This seemed to give the dough a bit of the backbone needed when I attempted this recipe with the original ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Barrows"
},
"reviewBody": "Simply one of the easiest candies I've ever made and they taste delicious. Everyone loved them. I used a Eagle Rare single barrel bottle of bourbon, which gave it a smooth taste and was absolutely worth it. I omitted the extra nut on top and was glad I did. It was creamy and smooth with a hint of honey from the bourbon, no harsh after taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GrannyV303"
},
"reviewBody": "Very good and easy. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stevie"
},
"reviewBody": "This recipe did not work for me. I had no bourbon (don't care for it), so used rum and followed recipe as stated. I could smell the rum, but no flavor was in the sugar/butter mixture. I could not even taste the nuts, just sugar/butter. It must work for many others though! However, I will try another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I made these several times and used some of the reviews to change it. I also freeze the balls before dipping in the chocolate but I make the balls smaller like 1/2 in. and put a pecan slice on top. This is a sweet recipe so smaller balls goes further ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Warrick"
},
"reviewBody": "These are incredible. I took them to work and they were the hit of the day. The reason I gave them 4 stars is that I think they are a little too sweet for me: personal opinion. No one else seemed to mind the sweetness. Please make these exactly as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gin"
},
"reviewBody": "I followed the recipe exactly and the dough was so soft you couldn't work with it at all. I added extra powdered sugar and that didn't help. I had to spoon the dough onto the wax paper. This is the worst bourbon ball recipe I have ever used and would not recommend it to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha Reynolds"
},
"reviewBody": "These are legit! Fantastic for holidays and parties. People's eyes always light up when you walk in the door with these bad boys! Full disclosure, I didn't add the crushed/soaked nuts to my second batch as I prefer a creamy consistency - like Rebecca Ruth bourbon balls. But either way is a total home run. Like another poster said, adding half a stick of paraffin to your chocolate will give the finish a nice shine. Serve at room temp to release the full \"effect\" of the bourbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherryH"
},
"reviewBody": "Best recipe ever! My first attempt wasn't great, changed to\nKnob Creek and it made a world of difference. Freezing the balls with a toothpick is key in getting a good result in dipping. The 60 % Cacao melting chips is also a must."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marical30"
},
"reviewBody": "This is an all time Christmas favorite gift to give to dear ones. My whole family loves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karinahicks"
},
"reviewBody": "I made them and they were amazing! My guests loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Armstrong"
},
"reviewBody": "I love this recipe, but I cut back on the bourbon by one Tablespoon. I also added a tiny bit more butter and creamed it without working it too much. They were creamy melt in your mouth! Not dry at all. Yes, the longer they sit the stronger they are!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Nowlin"
},
"reviewBody": "This is a good recipe if you know a little bit about what you're doing. You really don't need vanilla wafer crumbs &amp; corn syrup. The only thing I'd try to improve on is to add just a tad more bourbon to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MBD"
},
"reviewBody": "These are true Kentucky bourbon balls. I’ve reviewed them before but I wanted to note that every time I make them, I double the recipe and get over 100 balls each time. A single recipe is much more than 24 servings as it indicates. A bourbon ball should be about the width of a quarter...not sure how big the creator of the recipe was making them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hopeitsapar2"
},
"reviewBody": "Super easy as a Kentuckian the are as close to what I grew up on as any I have had. will do again for Derby"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Max"
},
"reviewBody": "My mother made these every year but put the bourbon straight into the sugar mixture. The whole family loved them and we continue to make them even though Mom is long gone. Be aware however, there is no cooking so the alcohol DOES NOT get burned off and they are potent little boogers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "deborah Matthews"
},
"reviewBody": "Wish I had read through all the reviews to pick up on how much tweaking this needs!! Even have injected extra bourbon and cannot taste it per too sweet and gooey. I am an excellent baker but found no way to salvage these. So, so disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I have used this recipe for years but have used dark rum. My family, especially the males, are seriously disappointed if I don't make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise"
},
"reviewBody": "I have used this recipe for over 40 years and they are always perfect. I use dipping chocolate because using paraffin is not supposed to be consumed (read the warning on the box). I purchase my dipping chocolate at a cake/candy store or you can purchase on-line. Wilton makes dipping \"melts\" in milk chocolate, white chocolate, semi-sweet and dark chocolate and is available at Wal-Mart. I chop my pecans very fine, cover with bourbon and do not put a nut on the top. Good quality bourbon, butter and powdered sugar insure a good product. My dipping chocolate is melted at half power in the microwave (stirring often because it will scorch) since even one drop of water ruins your chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirl"
},
"reviewBody": "My friends and I held a 4th July party as we'd all recently returned from separate holidays in USA. I made these and they loved them. I initially thought they'd be too sweet given the large amount of sugar, however, the nuts and bourbon seem to counteract this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ammiller"
},
"reviewBody": "This is a great recipe! I didn't have any bourbon in the house so I used Jack Daniel's Honey Whiskey. The famiy loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mskygirl01"
},
"reviewBody": "I love this recipe. I make these Bourbon balls every year and they are a huge hit with my family and friends. The must have is good KY Bourbon. Generic just won't do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chaosbean"
},
"reviewBody": "This recipe is great, however I don't thing the poster makes it clear enough that you need to drain the nuts before adding them to the mix. If I hadn't made candy before I would have had an awful mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yarniac"
},
"reviewBody": "Great recipe!!! I was looking for the recipe my late MIL used to make. I am soaking the nuts for my second batch. I will buy regular baking semi chocolate for the next batch.. I messed up and bought chocolate chips this time. I added 2 Tablespoons coconut oil to 2 cups chips. I was worried because they didn't look like they would set up. I put them in the refrigerator and left them alone about an hour and they are great! I did run out of chocolate, though. I can't wait for hubby to try these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dayna"
},
"reviewBody": "This is a real bourbon ball rather than the other recipes that use vanilla wafers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Narbi70"
},
"reviewBody": "Very tasty and easy but definitely make ahead of time and put in the freezer to mature the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Suetholz Cobb"
},
"reviewBody": "Everybody loved these - for the 2012 season I rolled some in cinnamon sugar, some in powdered sugar and some in cocoa powder. I didn't do the chocolate yet - try it in 2013."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FOODAC"
},
"reviewBody": "Shazam, these are way too sweet. This is my first time eating a bourbon ball so I'll assume this is normal and won't rate based on taste. However, I was guided to this recipe by the instructional video and it wasn't until I was up to my knuckles in a mealy butter/sugar mixture that I realized the recipe didn't follow the video. The vanilla was missing, the video appears to use way less sugar, and the ingredients are mixed in a different order. What gives, KY Piano teacher? Did Allrecipes ruin your good recipe? Thanks for submitting it. Now I have a bottle of KY bourbon so maybe I'll make a cocktail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phlox"
},
"reviewBody": "These are great. I love to bake for the holidays, but find a lot of recipes to be much too sweet. The bourbon in these balances out the sweetness very nicely (I added a little extra). After reading the toils and troubles others had with the melted chocolate, I rolled mine in unsweetened cocoa powder and it worked great. The sharp contrast between the interior and exterior flavors is amazing. Next time I'll soak the nuts for a few days instead of overnight. Best stored in the refrigerator."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzan Satterfield"
},
"reviewBody": "Made these for some bourbon-loving clients last year and they were a huge hit so I'm doing it again. I added some fresh-squeezed lemon to mine so there was a little tart with the sweet. These should come with an addiction warning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al Hughes"
},
"reviewBody": "This is pretty much the same as my old family recipe. We like to use black walnuts. They just seem to go well with the bourbon. I use Makers Mark as well although I have used Wild Turkey, Woodford Reserve and Elijah Craig. Elijah Craig was my five great-grandmother's brother so I guess I have bourbon in my blood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanR"
},
"reviewBody": "As an inexperienced candy maker, these were very easy to make. I made a batch without nuts and added the Bourbon to the batter instead of soaking the nuts. I increased the amount of Bourbon by a couple of tablespoons for a slightly stronger Bourbon flavor. The key to successful dipping is to make sure the balls are cold enough (otherwise they start to melt in the chocolate, making it lumpy.) These are absolutely delicious and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are the best. Made these and listed in my shop and sold them. I received a review that said these were the best ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Val"
},
"reviewBody": "I made these for my Kentucky Derby party last week. To say they were declicious is a gross understatement. Guests couldn't stop eating them. I made them too big, but I did get 30. I was nervous about the dipping, but it worked out fine. I had to stop midway and reheat the chocolate (I did this in the microwave) and cool down the balls, but they came out beautifully. I didn't add the extra pecan on top, but they still looked great. A real crowd pleaser!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catty"
},
"reviewBody": "I used Maker's Mark bourbon and then dipped the balls in Wilton Red melted candy. I wanted to make them look like they had red wax like the Maker's bottles. Although the Wilton Red is vanilla flavored, they turned out great and added a great suprise in my gift baskets. This is THE recipe to use when making bourbon balls. I also dipped some in chocolate and then dipped the top in the red candy to reflect the red wax on the Maker's bottles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loni Garling Peroni"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "I don't like bourbon, but everyone who had one, loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Cooper Richardson"
},
"reviewBody": "The first time I made these I made them exactly as the recipe calls for. The second time I used pecans and milk chocolate. I think the milk chocolate smoothed out the flavor and made them just right! I live in Kentucky so I believe in using a GOOD Kentucky bourbon to make these!! I actually use Maker's Mark when I make them, in our house there isn't any other bourbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "loricmc"
},
"reviewBody": "Flavor is great but I must be doing something wrong because my mixture is so soft that even after sitting in the fridge overnight, I can't get them to form balls. And then the minute I do and dip them in the chocolate they fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Kurth"
},
"reviewBody": "If I could give them six stars I would!! These taste just like the way I get from the local chocolatier . You cant go wrong with these!! Definitely will be making for many years to come !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calgirl312"
},
"reviewBody": "Excellent Recipe! I grew up eating these in Frankfort Kentucky and these are the real deal. Thanks Ky Piano Teacher!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "I am a cook, turned holiday baker. An important note for anyone not familiar with making this type of candy (so stating the obvious for you expert candy makers ;) ) the the bourbon creme is easiest blended with your hands. Once you have mixed the nuts in with the very powdery butter/confectioner sugar mixture just start blending with your hands. It forms a nougatvery easily when you do this. This recipe is virtually fool proof and so amazing. Reminds me of my old Kentucky home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bjoseph"
},
"reviewBody": "First time I've made bourbon balls...they were great. Still need practice with dipping them in chocolate, but reading some of the reviews was helpful. I'll try freezing them with the toothpicks before dipping!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paducah1983"
},
"reviewBody": "I made these last year and everyone is already asking for them this year! These are very close to the ones I grew up with in Western KY- no nilla wafers, no karo syrup, just this recipe. It's the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Thomas"
},
"reviewBody": "These are marvelous!\nI suspect that the folks who've had trouble making the filling have not worked with fondant before thus the directions may be a little too simplistic. I would add \"with a mixer, blend the butter and powder sugar. This will produce a lumpy powdery mixture. Then, work this mixture together with your hands, kneading it to a stiff dough-like consistency.\" It is also important to note that 2 cups of powdered sugar do not equal 16 oz. You must go by weight, which isn't too difficult if you purchase a 2 pound bag of powdered sugar and eyeball it. \nWe made a triple batch of these and the sugar quantity when tripled was still dead on correct. Soaked our coarsely ground nuts for a few days in a mason jar using Maker's Mark, then drained them quickly when adding to the filling. Good bourbon is definitely important! I do not normally enjoy bourbon balls, or bourbon in general for that matter, but these are great! We made them for my father's 70th birthday and he is very pleased!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "I liked the fact there were no vanilla wafers in this recipe. My daughter in law likes amaretto, so I changed the nuts to almonds, the liquor to amaretto, and used white chocolate to roll them in, instead of regular chocolate. They were very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacque"
},
"reviewBody": "HAVING ONLY FOUND OUT ABOUT THESE I MADE THEM WITH AMAZING RESULTS, EVERYONE LOVED THEM AND THEY WHERE GONE AS SOON AS THEY WERE MADE. MANY THANKS THESE BALLS ARE BRILLIANT. I USED THEN FOR PRESENTS FOR THE FAMILY FROM THE KIDS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllish"
},
"reviewBody": "This is a great recipe. I am from Kentucky and have been making Bourbon Balls for 40+ years. This is one of the best recipes that I have found.\nThank you Ky. Piano Teacher for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany Strauss"
},
"reviewBody": "We didn't have bourbon and my hubby prefers Jack Daniels, so I turned these into Tennessee Whiskey Balls. I think next time I will Almond Bark for the chocolate coating, it was a bit thick for me. Great, easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Shepard"
},
"reviewBody": "My boyfriend really liked these and the bourbon taste really came through, but they were a little too soft for my liking, especially if they are left out of the refrigerator for any period of time. They were also messier to coat than my other truffles (I used the easy decadent truffle recipe to make a variety of other flavored truffles) as dipping these in chocolate, even after I had rolled them into balls with toothpicks and frozen them in the freezer, wanted to come apart in the chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lori Dawless Haller"
},
"reviewBody": "I love bourbon and almost everything with it, but I must admitt to being disappointed with these. I used good quality bourbon and chocolate, but I thought they were too sweet and too dry. Might try again with some tweeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frisby0"
},
"reviewBody": "These tasted delicious and very alcohollly :-) for the holidays. The only little problem was that I misread the powdered sugar amount to be by weight instead of volume and ended up with a bucket load of the base butter/sugar mix. Maybe it's just me but it would've been nice if the recipe had said \"1 cup\" instead of 8 oz or whatever it was. Sugar is packaged in weight so both my husband &amp; I made the assumption that the recipe was referring to weight. Oh well. I ended up with a quadruple recipe of the base, 1/2 of which I made the Bourban Balls and the other 1/2 I made my own creation of Creme' de Menthe and chopped dark chocolate-a happy creation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLK"
},
"reviewBody": "Huge hit! Everyone loves them. We made a double batch and froze some. They freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "David loved these - be sure to thin the chocolate with some parafin; otherwise,it is too thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "David loved these - be sure to thin the chocolate with some parafin; otherwise,it is too thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farina"
},
"reviewBody": "These ROCK!! I made a batch following original recipe and they came out wonderful. I also made a second batch that I added 3 TBS of cocoa powder to (cuz I am a chocoholic) and since I ran low on pecans I used half walnuts/half pecans, and that worked too:) The only drawback is that I may have to make more because I don't think these will last until Christmas;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "plj4all"
},
"reviewBody": "I was really disappointed. I thought they were way too sweet and basically flavorless. I would only recommend making this recipe if you've had Kentucky bourbon balls before and know you like them. I was sorry I had put a lot of time and expense into making these for friends for the holidays ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ellen"
},
"reviewBody": "I looked at this recipe, the print recipe. Then I watched the video, no vanilla listed as an ingredient...Oh well too late now. Also very messy to roll into a ball even after refrigerating overnight. I am almost afraid to coat them in melted chocolate, might just have to eat them with a spoon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wandrr4"
},
"reviewBody": "Excellent recipe. My brother is allergic to nuts so I made a batch with coconut and he said they were fantastic. I soaked the cocnut in bourbon like the nuts and they turned out the same way. one option to consider if you're making them for someone with a nut allergy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redrose1330"
},
"reviewBody": "i dont understand what i did wrong. . i got a pack of walnuts and chopped them then added the bourbon and let them sit overnight. . then i poured the nuts into the mixed butter and sugar, but after i folded the nuts in, the mixture was very very runny. i stried to form balls, but just became blobs. i put them in the freezer to try and have them hardened but it didnt work. . i kno these things are great and want to make them for christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nmornar"
},
"reviewBody": "My daughter was married this summer in Lexington KY. Most of the guests were not from KY. We wanted to give our guests a taste of KY and the bourbon balls were perfect. We put them in small gift boxes and gave them to the wedding guests as favors. Everyone loved them. Since it was for a wedding, we made half of them with white chocolate and half with milk chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kentuckymom"
},
"reviewBody": "This is the true bourbon ball recipe. For best results use a single barrel bourbon and soak the nuts for at least one week. Also, if the sugar mixture is dry and crumbly, do not hesitate to add a touch of the bourbon that the nuts soaked in. I drain the nuts, and reserve the bourbon and start the nut soaking process all over again. They store wonderfully in the refrigerator, for several weeks ( I have stored as much as 6 weeks in advance of the holidays ). Enjoy---"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/176961/kentucky-bourbon-balls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
"name": "Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/751/desserts/candy/truffles/",
"name": "Truffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/176961/kentucky-bourbon-balls/",
"name": "Kentucky Bourbon Balls"
}
}
]
}
}
, "about": [
]
}
]