				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Key Lime Pie - Low Carb Version"
,"datePublished": "2019-04-03T23:32:36.000-04:00"
,"dateModified": "2019-04-03T23:32:36.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jo Ann"
,"url": "https://www.allrecipes.com/cook/597853"
}
]
,"description": "A delicious, low-carb pie that actually tastes great! You, your family and friends will love this one."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/O88rvo4vCqiuxkpy0blkK8JVJRs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5085565-92d21141e1454179a270778b60e3eba3.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Key Lime Pie - Low Carb Version"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "79"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "415 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "93 mg"
,"fiberContent": "2 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "268 mg"
,"sugarContent": "1 g"
,"fatContent": "41 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"1 cup ground pecans",
"3 tablespoons butter, melted",
"2 (1 gram) packets Splenda® no calorie sweetener",
"0.5 teaspoon coconut extract",
"0.5 cup heavy cream",
"2 (1 gram) packets Splenda® no calorie sweetener",
"1 (.6 ounce) package sugar-free lime-flavor Jell-O®",
"0.33333334326744 cup boiling water",
"0.33333334326744 cup cold water",
"2 (8 ounce) packages cream cheese, cut into pieces and softened",
"0.5 teaspoon coconut extract",
"2 tablespoons ground pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, mix together 1 cup ground pecans, butter, 2 packets sweetener, and 1/2 teaspoon coconut extract. Press firmly into bottom and up sides of an 8 inch pie plate; refrigerate until firm."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl, whip the heavy cream with 2 packets sweetener until soft peaks form. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl with high sides, mix the gelatin with boiling water until all the gelatin has dissolved. Then stir in the cold water. With an electric mixer, slowly beat in the cream cheese. After all cream cheese is added, stir in remaining 1/2 teaspoon coconut extract, and beat at high speed until smooth. Carefully fold in the whipped cream. Use a spatula to scrape mixture into the pie pan and spread around. Sprinkle remaining 2 tablespoons ground nuts on top. Refrigerate several hours or overnight to allow gelatin to set thoroughly."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT275M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "faraabdul"
},
"reviewBody": "I used \"tastesgreat\"s modifications with the lime zest/juice, less jello and I actually opted out of splenda completely in the filling. I might be on keto but I don't miss sweetness that much - overkill. I was out of vanilla so opted for a teeny bit of almond extract. I also increased amount of crust ingredients (1.75 c pecan, 5 T butter and a little less than 1 total packet splenda) and slightly browned the butter which made for a *chef's kiss* crust! Now, I was a little impatient and didn't let the cream cheese soften enough making for a slightly lumpy filling. I could care less because it tasted phenomenal. 4/5 because, with this many modifications, not sure how much I'd recommend the recipe as written. With a few changes, it was stellar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Slocum"
},
"reviewBody": "I used lower fat (1/3 less) cream cheese. I make this pie often. I used strawberry or cherry jello sometimes and add a little fresh fruit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deirdre Gordon"
},
"reviewBody": "Followed some of the suggestions. Used the recipe for the 2 packs of 0.3 sf lime jello and 2 bricks of cream cheese, however substituted diet lemon lime soda for the cold water and added the juice of 1 lime and added lime zest. I also added about a cup of sour cream and used Swerve sweetner instead of splenda. I used walnuts for the crust and doubled the crust recipe. It was divine, rich and creamy. Was brought to a birthday party and was gobbled up by everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gracie Krohne"
},
"reviewBody": "This is the best keto recipe i have used from allrecipes so far. I did make them into snack sized mini pies and they were great. The whole family enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsey Henderson"
},
"reviewBody": "I substituted almond flour for the pecans, and it made a perfect crust. This is so tasty and versatile. You can use any flavor of jello to make it! I will definitely be making this a regular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Fayle"
},
"reviewBody": "I made all kinds of flavoured pies with this recipe it is amazing.........also add 2 packs of Splenda and a heaping tablespoon of coco to the crust. MMMMMMMMM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kshellhorn"
},
"reviewBody": "I did make some modifications based on other reviewers but will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "vanbenschotent1"
},
"reviewBody": "Not impressed and kinda hated the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blessed Mama"
},
"reviewBody": "This is my favorite low carb dessert to date. HOWEVER, I did make changes. Like someone else, I used sf strawberry banana jello. Instead of coconut, I used vanilla extract. I also sweetened with Swerve instead of Splenda. I think that was what made it so much better than other things I’ve tried. My family didn’t care for the crust, so we omitted it, and just ate a scoop with sf cool whip on top. Tastes like cheesecake. Absolutely delicious. I will be making this with many other flavors in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ColleenCanuck"
},
"reviewBody": "Very yummy but couldn't find coconut extract easily, used vanilla and sprinkled coconut on top. And I cheated by using choc graham cracker crust. Everybody liked though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Thotbot"
},
"reviewBody": "**Update to previous review. Made this again, for filling using only 1 pkg cream cheese, 1 pkg jello, 1/2 cup hot and cold water, no heavy cream substituting 1/2 cup sour cream, one pkg Splenda and juice of one lime. This made a more key lime tasting treat and the cream cheese wasn't overwhelming and the texture was a lot lighter** I've made this twice. Once as stated in the recipe and once following tastesgreats modifications. The original recipe was too sweet for me, and while tastesgreats was better both were a little too cream cheese tasting for me. I felt like I was eating cream cheese mixed with a green food color and a slight, I mean slight, lime taste. Next time I'm going to cut the cream cheese by half a package and up the jello to one and a half pack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "I made this for my daughter who is cutting way back on sugar. She is a very discerning eater and she loved it as well as other guests. A winning recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "claudia"
},
"reviewBody": "Turned out great. Next time I will make more crust and modify to be more tart"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johni O'Dell"
},
"reviewBody": "I have never made key lime me pie before and I have made a lot of pies in my life,Just never key lime pie. I changed this recipe to cut even more fat. Instead of using heavy cream, I used sugar free vanilla pudding using fat free milk. Plus I added fresh squeezed key lime juice when adding the cold water stage in the jello. This pie came out so tasty. I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Betty Thompson"
},
"reviewBody": "I did make some changes to the crust by substituting almond meal and adding a 1/4 cup additional to the crust recipe. Baked for 8 minutes at 350 degrees. Came out nice. The filling however was another matter. Followed it as stated and the unpleasant green tint from the Jello leads me to continue looking for another sugar free recipe. I hope this tastes better than it looks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nancy"
},
"reviewBody": "I used the pre-made Graham cracker crust and I still didn't like it. I calculated the calories to be 320 for 1/8 piece and felt it wasn't worth the calories. It tasted like whipped up jello. Maybe if I topped it with cool whip it would have been better. Definitely won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Page"
},
"reviewBody": "This is a very good version of Key Lime Pie that gives a low carb diet a respite from the usual cardboard and bland desserts. Just don't expect it to be like Key lime in texture, and the taste is more like a key lime cheesecake and you won't be disappointed! Very good with black cherry or cherry jello with a few maraschino cherries chopped up for added texture too. Also going to attempt orange with vanilla flavor to see if it tastes like a dreamsicle ice cream pop. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tik"
},
"reviewBody": "Made this recipe twice - delicious. For crust I used almond meal, and only used .3 ounce package of sugar free lime jello\nwith the amount of water in recipe, used zest and juice of one lime as suggested by another user. For the whipped\ncream, cheated and used half of 8oz cool whip added to cream cheese mixture and added rest to top of pie - does not taste\nlike a sugar-free desert - Thanks Jo Ann for a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Oaklandteacher"
},
"reviewBody": "Taste was a 2, texture poor (my daughter said weird) , a waste of cream cheese, jello, pecans, and cream! \n\nMade another version using classical cheese cake recipe, substituting Splenda for the sugar, that everyone loved. Also used ground almonds for crust instead of pecans, which doesn't interfere with the taste of cheesecake, like pecans did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jguillory"
},
"reviewBody": "horrible dessert, cheesecake should not be jelloy. Would not make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cherby"
},
"reviewBody": "This was pretty bad. I believe it was the use of the Jello. I'm going to try it again without the Jello."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Eidson"
},
"reviewBody": "We love key lime pie in my house! For this to be called a \"key lime pie\" it needs more zest and tartness it. I made the recipe as written. Very rich but a delicious dessert. Just do not easy it and expect key lime pie. I will add lime juice next time. I also plan to change it up and try it with cherry or strawberry jello sometime... Maybe 2 packets of it....Thanks for this great recipe for me to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilcat"
},
"reviewBody": "I did not have coconut extract so I used vanilla. It needs the coconut extract, the vanilla I thought made it seem like it needed something. I did make extra crust as I felt it would serve better and I am glad I did. I made this in a pie pan and it turned out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "duck"
},
"reviewBody": "While this did not really make me think of key lime pie, it was quite good. I did add the juice of 1 lime and doubled the crust (was not nearly enough for my 9\" dish). Was a treat for my diabetic husband to have a good low carb dessert (but don't forget the high calories). I thought it was even better the next day, will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nina"
},
"reviewBody": "To me the texture of this recipe was more like a cheesecake. So I halfed the cream cheese, doubled the jello and heavy cream. Used the juice of one lime and some sugar free lemon/lime soda in place of the 2/3 cup of cold water. Much more like a mousse this way. We loved it with these modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angel Helene Watson Atkins"
},
"reviewBody": "Very good.\n I think 35 minute prep time may be a little off though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vicki H"
},
"reviewBody": "I made it with .6 oz (2 small boxes and it was a lot greener than the picture shown and the texture was way too If the amount of Jello was different, I would givethe recipe 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "old man"
},
"reviewBody": "It was good,but not as good as the high carb version. When your on a low carb diet,any desert you can have is great. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "It's OK, but it doesn't really taste like Key Lime Pie. I don't think I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSBSRQ"
},
"reviewBody": "This was awesome! Thanks for sharing...I think I am also going to try this with pineapple jello and almonds for a Pina colada pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chuck Yeager"
},
"reviewBody": "Not so much a cheesecake, but more like a whipped dessert with cream cheese. I did not like the crust at all, but the cheesecake part was 3.5 star worthy. I only made one change, and I am glad that I did - I only used 4 ounces of the jello."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moreen"
},
"reviewBody": "Thanks to my 18 year old we have cut out carbs from our lives. It has been extremely hard, but this cheesecake gives us hope! I love how you can use almost any flavor of jello that u have on hand. Our favorites are key lime and black cherry! Recipe is easy, key is to make sure cream cheese is room temp and use a tall container to mix, you will need it....splatters a lot! Good flavor/good texture! Thanks for posting the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harmingc"
},
"reviewBody": "Very fluffy with good flavor! Not a key lime taste but excellent lime flavor! Definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shavon"
},
"reviewBody": "Great Recipe!!!\nThis recipe is such a treat, it is so hard to find great tasting low carb recipes, but this one is a keeper!! I used almonds instead of Pecans because that was all I had, turned out great! doubled the crust and used 2 Tbsp. of warmed coconut oil in the crust instead, this gave the crust a nice hold after it was chilled! My husband didn't even know it was low carb. We both loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Connie Meacham Craig Barillas"
},
"reviewBody": "Kids didn't care for it. Could have been the green color and that they were expecting something more traditional."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Pippen"
},
"reviewBody": "This was delicious. The only thing that I did different was to crush up walnuts for the crust instead of pecans. It was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "potter"
},
"reviewBody": "If your looking for something to put you in the \"mind\" of key lime pie..this is a great base recipe...Instead of making a crust i used a store bought pre made graham cracker crust, vanilla extract instead of coconut, a tub of light whip cream instead of heavy cream, 1 (.3 oz) sugar free lime jello, a heaping of splenda (to taste) and the zest and juice of 2 limes. and kept everything else the same.YUMMO!!! ..while its not the real thing its a lighter summer substitute..and did the trick for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "malia"
},
"reviewBody": "Pretty good.. Try it if you haven't. I made it exactly how the recipe called for it and we ( myself and two boys 4 and 6 ) enjoyed it. They didnt realize it was sugar free. Great low carb dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hanan"
},
"reviewBody": "I loved it and I really didn't think it was too sweet as some reviewers mentioned. Next time I think I will up the heavy cream from 1/2 to 1 cup. I would prefer the creaminess overpower the jello-ness. I think I might even experiment with different flavored sugar free gelatins....orange first as I like the orange and cream idea. Also, I substituted vanilla for the coconut extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jean Kaufman"
},
"reviewBody": "thought this was great, but needed a little modification for me. needs a little key lime juice and maybe 1/2 another pack of lime jello. had just a little too much cream cheese taste. more lime will fix that. loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pineconewars"
},
"reviewBody": "I'm sad to say that this wasn't very good. I was hoping for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chyan"
},
"reviewBody": "I loved the crust, however I wasn't too happy with the filling, I didn't have coconut flavoring but used vanilla. I ended up tossing it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Magun"
},
"reviewBody": "Crust: I made it with 2 cups of ground up almonds instead of pecans. I skipped the coconut extract (just not my thing) and substituted Fresca soda for the cold water for some more citrus flavor. Also added some lime juice. The consistency was great, and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Celtic"
},
"reviewBody": "I was very happy to find a Low Carb version for pie! I am not a lover of Key Lime Pie, but I could not resist, since I have not been able to have a piece of pie since I started my Low Carb Diet to reduce my blood sugar, as I am Diabetic. This was amazing! I love the Pecan Crust, that was my favorite part, and I will be using it to make other kinds of pie. I am trying to figure out a way to make a Coconut Cream Pie! I think I beat the cream too long, because my pie came out a bit 'tough' but it was still delicious! The Coconut was a definate show stopper! Yummy! It is very rich, so I was only able to have 2 pieces (I saved up my carbs all day so I could really go crazy, but it was too rich, and that is not a bad thing). I thought that crust and the pie could have had more Splenda added to them, as they were not sweet enough for me, but I like things sweet. All in all this was an excellent experiment, and I am going to have fun making as many different things as I can from this! For Low Carbers out there like me, it is a definate winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdventurousSpatula"
},
"reviewBody": "I've never had the real deal, but this was enjoyed by both low carbers, and carbaholics alike. I've made this twice, using cool whip the first time because it was what i had on hand. The real heavy cream is better, but both ways are good. Also used, as suggested by others, vanilla instead of coconut extract, and added the juice of 3 key limes to the jello mixture. Hard to mess up as i added two cups of water the first time and it was still good (more of a marshmallow texture)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tastesgreat"
},
"reviewBody": "This has been one of the best sugar free treats I have had. I've made it twice, and liked my modifications to make it more tart. Modified: vanilla instead of coconut; sour cream instead of heavy cream (just mix in with cheese); half the package of jello; and added juice and zest of one lime. Almost like real key lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SUBLIMEMIND82"
},
"reviewBody": "Not very good. The gelatin made the cream cheese lose its creaminess. I thought I'd be eating something light and fluffy, similar to cheesecake, but it had a weird, thick texture and kind of a \"salty\" flavor. It was hard to eat one piece and that's saying something coming from someone who is stuck on a low-carb diet and adores dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessitlv"
},
"reviewBody": "Pretty good! I was dieing for some sweets on a gestational diabetes diet. I ate the whole thing myself :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chocolatekisses"
},
"reviewBody": "I made this for my mother who is on a low-carb diet and loves Key Lime pie. I took others suggestions and omitted 1 pkt of splenda in the crust. The pie tasted like a lime cheesecake to me. My mother said it was not sweet enough for her, which surprised me after everyone said it was too sweet! She also mentioned it a little too thick, but overall a good substitution for those who are craving a Key Lime pie and can't have the carbs. It only made enough crust to cover the bottom of my pie plate and not the sides. Needs some whipped topping on top. I feel other jello flavors would taste just as nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lioness357"
},
"reviewBody": "Wonderful recipe idea, however I changed up the recipe just a bit. Instead of regular cream cheese I used cheesecake flavored cream cheese. I also added splenda brown sugar to the crust recipe instead of the regular splenda. I made this using sugar free cherry jello since my husband loves cherries and he LOVED IT! I even topped the pie with sugar free cherry pie filling and it turned out great! The pie consistancy was very light and smooth. (You definitely have to allow the jello to completely dissolve though because it gels quickly and makes chucks.) I will definitely try this recipe with other flavors and the crust recipe is a definite keeper! I plan to try that crust with other no bake pie recipes in the future. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Great recipe! I would recommend to anyone who is watching the carbs. I did double the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie B"
},
"reviewBody": "Pretty good...nice and tart. Lots of flavor makes up for lack of carbs. Didn't really like the crust. Might make only half so it isn't so thick next time. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yummy mummy"
},
"reviewBody": "Very good recipe (especially when you have forgone sugar for a while and are craving something sweet!) The only problem I found with this one is that it really was too sweet. (That's coming from someone with a sweet-tooth, too!) I could only manage a small slice before the taste just got too overwhelming. I absolutely adored the crust, though! Very good for \"low-carbers\" to have this basic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryan Wilder"
},
"reviewBody": "All things considered, I think this turned out very well. You can really only do so much for lo-carb recipe variations though so don't expect perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Kelly"
},
"reviewBody": "I made this recipe at the same time that I was making real Key Lime Pie for everyone else. I don't like real Key Lime Pie, but this is noting like it. It's nice and sweet with a soft cheesecake-like texture. It was very yummy. I loved the crust. I am going to use that crust more often for other pies that I make. I will also try this pie with different flavors of Jell-o. Don't eat too much of it though. It may be low-carb and that's great, but it's very fatty. Pecans are fatty, so is cream cheese, and heavy cream of course. I just ate a piece and now I'm headed to the Gym."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "WILLDOOIT"
},
"reviewBody": "I wasn't thrilled. Like other reviewers I thought that the lime was overwhelming, and the consistency was just too weird. I may have had my hopes up too high...to be fair, this IS low carb and for someone who needs to give up sugar, this could fill a craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Little Hooter"
},
"reviewBody": "I have made it both with sweet-n-lo and splenda. It is GOOD either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DCSTONE81"
},
"reviewBody": "After having no sweets for weeks, I thoroughly enjoyed this recipe. I first tried it with strawberry/banana jello because I live out of country and it was the only flavor of sugar free to be found. I thought it tasted a bit like a banana split! When a visiting friend brought the lime jello, I made it with lime and found it to be excellent. It is not going to rival REAL key lime pie, but if sugar and flour have been banished from your eating plan, this makes a very satisfying substitution. (We also don't have coconut extract. I've been using vanilla most of the time.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ATLMICHELLE"
},
"reviewBody": "I thought it was just ok. The flavor was decent, but the lime flavor overpowered the coconut extract so I couldn't tell at all that I had put coconut flavoring in it. The pie was also very very dense like cheesecake. It did not have the consistency of actual key lime pie, which was what I was hoping for. Not horrible, but I don't think I'll ever make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STEPH61"
},
"reviewBody": "I used vanilla, instead of the coconut. The flavor was excellent. I think next time I'll make more of the crust, so it's thicker. Thanks for the recipe! My low carb husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KB82"
},
"reviewBody": "I found this to be just ok. The cream cheese flavor was overwelming. I enjoyed the crust, but I think it might be better if the crust is baked for a little while to roast the nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CHAMNHAOLE2"
},
"reviewBody": "tasted too tangy. I thought the pie wasnt sweet enough.The crust is better baked with more sweetner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaista Nasar Trost"
},
"reviewBody": "Great recipe with a few minor changes... added half the amount of jello (too sweet and tangy otherwise) and I used raspberry (my fav.) instead. Wonderful with heavy whipped topping on top... yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARTHECOOK"
},
"reviewBody": "The rating say's it all it is so good. I will try out different flavors. I used vanilla extract in place of the coconut(no one likes cocount).This pie will be a staple in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was good for a low carb dessert. I added some whipped heavy cream (0g carbs) on top of each piece, it added little more taste. Next time I'll try cherry jello and have me a \"New York cheese cake with cherries\"..my favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FULF"
},
"reviewBody": "Excellent recipe! I doubled the crust and left the filling as per the recipe and put it in a 9 x 13 pan. Next time I plan to add whipping cream to the top. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jo Ann"
},
"reviewBody": "Suggestions, try using one packet of splenda instead of two. Use vanilla extract instead of coconut. I did this and it turned out very well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I found that this recipe is too sweet. Next time I think I'll try with only one box of sugar free jello. My family could only stand to eat a very small piece. The crust however, was great. I think I'll use this crust with other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MELLO 57"
},
"reviewBody": "Really good for so low carb!!! It is like a mousse pie. Be sure to let your cream cheese sit out for a long time to soften. Loved the pecan crust- I just used pecan chips.(very small) I mixed the jello into the boiling water in the saucepan, then added the cold water. Then poured it into the KitchenAid bowl &amp; went from there. I let the crust sit in the fridge for 1 hour &amp; the finished pie for 5 hours. Lots of filling that I had to pile up- but it worked! Beautiful with the sprinkling of pecan chips on the top. Thanks for the recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/73386/key-lime-pie-low-carb-version/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
"name": "No-Bake Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/73386/key-lime-pie-low-carb-version/",
"name": "Key Lime Pie - Low Carb Version"
}
}
]
}
}
, "about": [
]
}
]