				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Kolachky"
,"datePublished": "2018-03-21T12:21:07.000-04:00"
,"dateModified": "2018-03-21T12:21:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "TRISH1452"
,"url": "https://www.allrecipes.com/cook/467618"
}
]
,"description": "My father and grandparents were born in Czechoslovakia. I use to watch my grandmother make these small pastries at Christmas time and I couldn&#39;t wait to eat them when she was all done. I do hope you will enjoy this recipe as much as I do. You will need a large area to work."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3NEsCUGBjrlxYti_NbSRoDoETBM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/414457-7c9f83e18e4e45009178f51a259fd4cb.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Kolachky"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "100"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "241 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "35 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "37 mg"
,"sugarContent": "4 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"2 (8 ounce) packages cream cheese, room temperature",
"2 cups unsalted butter, softened",
"4 cups all-purpose flour",
"1 pound chopped walnuts",
"1 egg",
"0.5 cup honey",
"1 (12 ounce) can poppyseed filling",
"1 egg white",
"0.5 cup confectioners' sugar for dusting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, mix together cream cheese and butter until well blended. I like to use my hands, but you can also use a wooden spoon. Mix in the flour 1 cup at a time. As the dough becomes stiff, turn it out onto the counter and knead in flour until it is no longer sticky. Continue to knead the dough for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Crush the walnuts to a fine consistency in a food processor. Stir in the egg and honey. On a well floured surface, roll the dough out to 1/4 inch thickness. Cut the dough into 3x3 inch squares. Place a teaspoon of filling in the center of each square. Use walnut for some and poppyseed for the rest. Roll the squares up and seal the edges. These can also be formed into triangles. Place the cookies 2 inches apart onto ungreased cookie sheets. Brush with egg white."
} ,{
"@type": "HowToStep"
,"text": "Bake for 15 to 17 minutes in the preheated oven, or until lightly browned. When cool, dust with confectioners&#39; sugar."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT115M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the first year I have tried my mother and great grandmothers recipies since I was a teen. I was so happy to find your family recipe here. I made prune and apricot lekvar for the filling and they were absolutely heavenly. Took me back to my childhood. Thank you so much for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "metalist"
},
"reviewBody": "Just like my mom used to make. Great job TYTYTY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "spietrzak"
},
"reviewBody": "I made these twice per the recipe.\nI did not care for cookie recipe, too mu h flour, made a funny taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kazimmerman"
},
"reviewBody": "Added 1 tsp. Strong Lemon juice and 0 .5 cup powdered sugar to dough. Family loved the freshness of the cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "This is the recipe handed down in my family from my Slovakian grandmother. Some people are posting that the dough is too sticky. We have always put the dough in the fridge for at least one hour prior to rolling out-it helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheddar Y"
},
"reviewBody": "I added just a dash of almond extract to the dough. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TeamRinaldi3"
},
"reviewBody": "My grandmother made these when I was a kid. She's gone now (and with her, the recipe) so I figured I'd try these. No light, crispy butter flavor, these are just dough and flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fishydo9"
},
"reviewBody": "This is a very yummy recipe! I made a half batch and got 28 cookies with cutting 3 inch squares, according to recipe. The dough was like a pillow! When I was folding the cookies the dough did stuck to the counter though, and I used a small knife to help pick the corners off the counter which made it easier. Used apricot Solo filling and would recommend that. Next time I will try making 2 inch squares, great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ckercher7"
},
"reviewBody": "Delicious ! Used the recipe as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakerybeardogchef"
},
"reviewBody": "Great recipe, exactly the same one that my grandmother gave us. I lost my copy and was so glad to find yours! Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessichka"
},
"reviewBody": "Awesome just like my Babushka's (grandma) Kolache! I used mostly raspberry filling and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Montgomery"
},
"reviewBody": "I have made this many times with the filling crushed pineapple (thickened) and the nut (sugar, vanilla, butter and milk cooked till butter is melted) my family love these right along with my Nut rolls which are a tradition in my family at Christmas time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Out of the 2 Kolachky recipes I used off AR, I did prefer this recipe more. I used 9 different fillings (pineapple, grape, apple butter, apricot, mixed berry, cherry, poppyseed, cottage cheese/raisin blend, and walnut) and prefer the walnut filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vickie"
},
"reviewBody": "really good and simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DPetersen"
},
"reviewBody": "I followed this recipe exactly and they turned out very dry and flavorless. I had a problem with the dough remaining sticky. It was unworkable with 4 cups of flour so I added another. It was still sticky but I managed to roll it out and create the cookies. I used the walnut filling as specified. 1lb of nuts to 1/2 cup of honey? That turned out to be a very dry filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loves2bake"
},
"reviewBody": "My Great Grandmother was German and made \"Kolaches\"...and this recipe took me back to my childhood the minute I bit into the finished product.....Perfect! I'm not sure if it is the exact one she made, but it took me back to the childhood Christmases . thank you! Perfect blend of everything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jean"
},
"reviewBody": "I was so happy that I found this recipe! It's one of my favorite Christmas cookies. It was not as sweet as I had hoped - but lots of powdered sugar cured that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joann Nygard"
},
"reviewBody": "A really good Kolachky recipe. My parents are both from Poland - i have tried many many recipes to see if i could find one that was close to what my mother use to make - that didn't 'open up' in the baking process. This is the best one i have found so far. They do open up a bit - but if you really press the dough together - it will stay closed - so its more of just handling it properly - i found they worked better if you pinched the dough in the middle - rather than close up the ends (the different ways of folding)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Yummy...filled them with homemade blackberry jam. Only thing....mine were not done in 15-17 minutes....mine took closer to about 20 minutes. Will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "My great-grandparents were from Bohemia (what they called it back in the day). I've always made these using yeast but no more! These are really, really good and will be making them for my family on Thanksgiving. Thank you for posting this recipe- it's great to keep our heritage alive. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sahri21"
},
"reviewBody": "My boyfriends family makes kolachky for all major holidays, and I've had several version. Some are like cookies, others are bread pastries but the term is pretty universal in eastern Europe. His family makes cookie kind so I tried this recipe.\r\n\r\nNot exactly the same but still good! The 3x3 size is huge though, and you need to roll them much thinner as it puffs up a lot in the oven. It also took several minutes longer to bake them.\r\n\r\nThe dough once rolled was a little sticky and soft so my next batch I am chilling in the fridge for an hour.\r\n\r\nI used pineapple preserves, and raspberry preserves. Other flavors I've had are apricot, prune is popular, and apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Byrnes Wilson"
},
"reviewBody": "Trish, PLEASE respond - are you sure that it's 2 cups of butter? Every other recipe similar to this calls for 2 STICKS/1 cup of butter. I'm dying to make these since my Czech grandmother used to, but the butter amount seems insanely excessive. Thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gastronome"
},
"reviewBody": "Am I the only one who had to use a lot more flour? It is cold and dry here and I used over 6 cups of flour. My mother-in-law taught me how to make these. Her mother came to the US from Poland through Germany and to Ellis Island when she was 4. I thought I'd try a different recipe but I'll go back to hers. Maybe the author meant 2 sticks of butter not 2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CaeriBaeri"
},
"reviewBody": "As the mom of a multiple food allergy kid (nuts, dairy, egg, fish, nectarines - I bake \"vegan\"), I'm always on the lookout for new recipes I can convert so that he can enjoy the same traditional foods as the rest of the family. I was able to use Tofutti \"Better than Cream Cheese\" and Earth Balance buttery spread, added another cup of flour to get the dough consistency right, used a maraschino cherry in each and skipped the egg bath.. and voila! Vegan Kolachkis!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "thatgirlcancook"
},
"reviewBody": "I work for Chech boss and every year in May Prauge,OK. Has a Kolache(that's how they spell it) festival and we make these every year and we always make a lot of differnt fillings for these and like they get almost a crumble topping and are amazing and I hate pastry! I get these all the time the little doughnut places my town sell these"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JD_RJ_Atl"
},
"reviewBody": "Very easy to make and exceptional taste! I will never have to buy this cookie again! Even my husband that doesn't care for sweets loved these cookies. I used raspberry jam and melted chocolate as the filling... I want to try the walnut filling next... Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Kolachky cookies are a MUST at every get-together in my family, (also Czechs)....my mother has made them for as long as i can remember...when she became sick with cancer, i took over making them because there is a sightly tedious process to making them, and when you do make them, you're usually making over 250 + cookies at one time (..i come from a family of 14 kids). Our recipe is only slightly different...we add 2 tblspoons of sugar, and 1 tsp. of baking powder, in addition to the recipe here. It's also beneficial to refrigerate the dough overnight, or at least a couple of hours before rolling out. You can also make star-shaped cookies by cutting all corners into the center, placing jelly of choice in the center, and bringing every other corner to the center and pinching together. With my mother, it was always apricot filling, but i've started making a cream cheese filling which has become the new favorite. You cannot have a party offering these cookies and not get asked by a number of the guests for the recipe..they literally melt in your mouth, they are so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judyvandy"
},
"reviewBody": "Great recipe! One change to be just like my Slovak grandmother's: roll out the dough onto a sugared surface and sprinkle sugar on top as you roll. I also roll about half as thick as recommended. The shape I use depends on how I feel at the moment: usually just pinch 2 opposite corners together or roll up like a little kolac."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindylu"
},
"reviewBody": "This recipe is a Christmas tradition in my family. I'm not sure where my mother got the recipe (we are English and Norwiegan) but it is always my favorite for the holidays. We shape the cookies differently though by bringing all 4 corners of the square together in the center over the filling and pinching it to hold it together. It bakes up nicely and some of them open slightly to reveal the filling. My favorite filling is the Solo apricot filling. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie K."
},
"reviewBody": "These kolachky remind me of when I was very little at christmas time at my grandmothers house. I highly recomend them! Get creative and use different types of jams and jellies! Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WeezaG"
},
"reviewBody": "This is the recipe I've used for the dough for many years. I roll my dough thinner and I cut my squares smaller, so I get many more cookies out of 1 batch. I like to use jars of apricot filling and prune filling from Baker's. They are always the highlight of my cookie trays at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deidre"
},
"reviewBody": "I made the dough in my kitchen aid mixer and followed the recipe exactly. I think you must chill the dough (for at least one hour) to get this to turn out well. The chilled dough was very easy to work with. I rolled them out much thinner than the directions state. We really like the Solo apricot filling. We did not at all like the poppyseed- even though it is traditional and we did not really like the almond either (both Solo brand canned filling) Next time I'll buy 2 cans of Solo apricot and probably try the homemade walnut filling. Yum! Great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Rose"
},
"reviewBody": "We made these for the first time this Christmas and got a lot of requests for the recipe. We followed the recipe as written, but did not make the poppyseed ones (we don't like poppyseeds). The first time we made the walnut ones I used old honey that had partially crystallized. I used fresh honey in the second batch. The fresh honey ran all over the cookie sheet and made a mess in the oven. The crystallized honey stayed where it was supposed to--I'm using that next year too! The honey-walnut mixture has a taste similar to Greek baklava but not as sweet, and the cookie crust is to die for--buttery, flaky, and delicious. Don't skip the dusting in confectioner's sugar--the cookie needs the sweetness because the crust has no sugar in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sutra"
},
"reviewBody": "This is the exact replica of my Granny's recipe (at least in taste) I didn't come across this one when I searched the site probably because we spell it differently in Polish. I tried another that didn't work out well. Thanks allrecipes for daily e-mails and thank you Trish for sharing. This Yule my kids have a little taste of my childhood in Eastern Europe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Apron"
},
"reviewBody": "AMAZING! Followed exactly, only change was halving the recipe. It made about 50 medium-large kolachky. Filled with homemade apricot jam and baked on parchment. Flaky, rich, sweet, yum. 12/16/2011: Made these again today and they are just soooo good. Not a difficult recipe to follow at all. Do not overmix-it will keep the patry tender. If you haven't worked with kolachky dough before, a half batch is easier to manage. Thank you so much for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SShandell"
},
"reviewBody": "Delicious! These are now a staple in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BFire"
},
"reviewBody": "Awesome, exactly what I was looking for and relatively easy to make. I made raspberry, poppyseed and walnut filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the recipe I've used for the dough for many years. I roll my dough thinner and I cut my squares smaller, so I get many more cookies out of 1 batch. I like to use jars of apricot filling and prune filling from Baker's. They are always the highlight of my cookie trays at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakergirl"
},
"reviewBody": "Delicious! Easy to follow recipe! I like trying different fillings with it. Better then my Czech best friends kolache!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4kidsinthehouse"
},
"reviewBody": "Very much like a traditional Slovak treat! My grandma and dad were thrilled to hear I had made these for a special Christmas treat. The dough was a little different to work with. Next year I will make smaller treats and let the fillings ooze a little. I used Solo brand poppyseed and apricot fillings. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ellen"
},
"reviewBody": "This recipe is Very Good! And most important when I rolled it out on wax paper using flour and confectioners' sugar....it was Great! This is certainly a keeper!! So many other recipes like this tend to make me swear during the roll out process!! I got 90 cookies and in my oven they only needed to bake for 14 minutes! Thanks Patricia!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kris"
},
"reviewBody": "I loved this little cookie. However, I tried the poppyseed, and that one didn't make the cut. I did end up purchasing a can of almond filling....and holy moly, it was amazing. The nut mixture was tasty as well. I advise using the almond mixing instead, soooo yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carie Gonyo-Johnson"
},
"reviewBody": "The dough is very easy to make and a breeze to work with. I was surprised how much it fluffed up in the oven. These are really delicious - not too sweet and perfect with apricot or raspberry preserves inside, no matter how you roll them. Personally, I found that the smaller ones I made turned out better... I wrapped them like a wonton - bite sized. This is nice for breakfast/brunch or with coffee any time of day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ronaele"
},
"reviewBody": "These taste like flour (astringent). They aren't sweet like a shortbread nor flaky like pie pastry. We were so very disappointed. I'm sincerely puzzled why they were given such great reviews. Are they supposed to just taste like flour? (I only used 4 cups per the recipe and the dough handled fine.) I didn't tell my family my reaction to them and just watched when they ate them. They either took the one bite and no more. I finally resorted to kneading 1 cup of powdered sugar into the dough and then continued with the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BAKININBUDAPEST"
},
"reviewBody": "Darn tasty! Used cherry pie filling in some, poppy seed filling in others. Sifted powdered sugar over the top at the end. Served to Slovaks and Hungarians who loved this recipe. I'm not convinced that it is the \"real deal\" as this is the same cream cheese/butter/flour recipe I use for mini quiches. Even so, this is sure tasty. Not quite the same taste as in Slovakia and Hungary, but tasty enough for no one to mind. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diana Goncalves"
},
"reviewBody": "After reading all the amazing reviews, I decided to give this recipe a try. I obviously did not get the same results as everyone else as my outcome was fairly disastrous. I added the indicated 4 cups of flour and it quickly became obvious that I needed significantly more to form the dough. Secondly, 1/4 of an inch seemed to be quite thick to roll/fold/pinch (or any other method) to hold the filling which then of course needed a longer baking period. The end product tasted all right, but, from a personal opinion, not worth the effort and the products used (or in this case wasted). It appears that maybe family traditions (or methods) may be useful in this case for rendering a successful and delicious product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luka'sMum"
},
"reviewBody": "These are WONDERFUL!! I used peach and raspberry filling. I used the lid of a mason jar to cut the rounds and folded two opposite sides together....worked well! Made little star cutouts for the kids and just put a little dollop of filling in the middle! Will definitely make again.....a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hurst gals"
},
"reviewBody": "I also am originally from Binghamton, NY. Although none of my family is of Czech descent, this was a holiday tradition from my mothers' family. I'd lost our receipe, and have been looking for one. We had a refrigerated recipe, where we made the dough up the night before. We used Lakvar (prune butter), but am not able to find it here in KY. We cut the dough in small rectangles, spread on the butter, then rolled, baked and sprinkled confection sugar. It was always a hit. I'll try this recipe and one of the other fruit butters. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hello"
},
"reviewBody": "These kolachkys tasted like the ones I get at the bakery! They were really good. They needed more sweetness though so I would put a lot more confectioners sugar on top. I tried some with the nut mixture and then I put a cream cheese mixture in the others. These were delicious and pretty fast to make. I will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lg48tn"
},
"reviewBody": "My mother, Hungarian background, made this recipe for years. Her version of the walnut filling: add 1 to 2 TBS. each of orange and lemon zest (depending on your taste preference)along with the egg and honey mentioned. Sometimes she would substitute about half a cup of sugar instead of the honey. She also made the apricot filling (mentioned by another reviewer)from simmered dried apricots, then mashed. She also added lemon zest for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LatinaCook"
},
"reviewBody": "I scaled the recipe down to 12 \"cookies\". I used the Solo brand Apricot filling and it didn't ooze and tasted wonderfully. I had some issues with the dough sticking to the counter but I dusted confectioner's sugar and that helped a lot. I used a round cookie cutter, spread filling in the middle and then folded in the sides. See my pictures. I think they came out pretty and they were really tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband is Czech and I spent a year living in Prague with him. I've never seen a Czech Pastry that was so flat. Everything that his very traditional mother made was puffy and more like a little bun. I actually made Kolácky with a quick puff pastry dough before tryin this recipe, and my husband liked them much more and thought they were much more authentic. This dough is too simple, but it is fast. Still, I'd recommend buying frozen puff pastry and filling it with these fillings if you needed to make these in a pinch. They don't taste bad, they're just not traditionally \"Czech\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rodak77"
},
"reviewBody": "My kids really loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "icefishingprincess"
},
"reviewBody": "I always try to look for new and different cookies to make at Christmas time. I tried this one last year and let co-workers and guests at the resturant I worked at sample them. They were so wonderful I was asked to make 4 doz. for a very upscale dinner party. They were a hit and I have been flooded with requests for them again this year. A DEFINITE KEEPER!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deirdre"
},
"reviewBody": "My Mom is American born but 100% Hungarian and we both make these, although we also make apricot and prune filled 'cakes' as well as the nut. My family calls them 'little cakes' for some reason. To make a truer apricot filling than pie filling, we buy the dried apricots, then boil them until soft, then mash with sugar and a little vanilla. The prunes get the same method but no vanilla. Much better than pie filling. Also, to keep your cakes neat and not split open, make sure you pinch the corners over the filling. I then twist the dough ends after pinching to make them look pretty. We also bake them at 375 for 9-11 minutes vs. 350 degrees. I've been making these for over 30 years, since I was a small child helping my Mom and Grandma in the kitchen, and they're by far my favorite cookie of all time. Enjoy!\n\nBTW--they freeze well, just don't dust with confectioner's sugar until you serve them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Veltstra"
},
"reviewBody": "We call these Kifli's (that's the Hungarian name for them) and we've been making the walnut version forever. They're absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennyblue"
},
"reviewBody": "we make these every year for christmas. they are my absolute favorite cookie ever. our favorite fillings are almond and raspberry though, not too traditional, but fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlynn"
},
"reviewBody": "This is definitely one of my favorite recipes. When I was little, my family used to call me the \"Kolachky Kid\" because of how much I loved kolachky...then I found this recipe a little while back, made it, and renewed my love of the pastry all over again! My family loves them, as well. Definitely a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wiley"
},
"reviewBody": "Well, this went over very well at my house. My boyfriend's grandfather was Czech, and I've been hearing about Kolachky for years. I halved the recipe and didn't make the nuts (only used poppyseed), because he's told me that he didn't like the nut ones (so I can't comment on the nut filling). I also prepared it the same way his grandmother did -- rolled the dough into two rectangles, spread the filling over top of each, rolled them up, brushed on an eggwash, and then cut them into slices after they were baked. I'd never had it before to compare it to another recipe, but my boyfriend raved! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coco"
},
"reviewBody": "These were superb and a lot easier to make than I had imagined. I would say even better than store or bakery bought. The only thing I would like to add is that it takes a lot more flour than 4 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Hettler"
},
"reviewBody": "Very good dough, I did add 1/2 tsp vanilla and some lemon zest to freshen up the flavor. I did not make the filling, instead I used jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SADUKIE"
},
"reviewBody": "My grandpa came from Czechoslovakia and this was the same recipe he used. We typically use sugar instead of honey in the nut filling and also use Solo pie fillings besides poppyseed. Other flavors we use include Pineapple, Apricot, Strawberry, Raspberry, and Cherry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEFFERYBOY"
},
"reviewBody": "This recipe brought back memories, My Grandma would make these for us on special occasions, No one could make them as perfectly as she could but this recipe came very close, My Mom and I enjoyed making them and Thank you for sharing it! A few tips, We cut ours out with a diamond shaped cookie cutter but found that the tops popped out if not pinched closed tightly so we used a glass instead and I believe this was the trick becuase they came out bigger and you were able to pinch the top easier and they did not pop open during baking, Course as my Mom says \"Grandma would never let me pinch the tops because they would open up and she would gently say \"honey let me do them\". Also we used canned poppyseed filling and Almond paste, The almond paste is definetely a favorite. I would make these again with my family just to bring an old tradition back into the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRENDAJST"
},
"reviewBody": "very tasty pastry. My mother is Slovak and has always called these cookies \"rushky\" (not sure on teh spelling) and she rolls hers up but the pastry is the same. I tried some with a berry preserves filling and they were the favorite, though the filling needs to be cut down or it seeps out too easily. Also, 3\" X 3\" size is HUGE, more like a danish or pastry than a cookie, so if I do it again, I will cut that size way down as well as cut down on the quantity of filling I use. Overall delicious though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hillary53"
},
"reviewBody": "wonderful recipe. very simple and easy for first time kolachky makers! thanks so much for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jen20508"
},
"reviewBody": "The recipe I have is slightly different. I got it from my mom and grandma who've been making them since before I born. It's become a tradition in my family. I always use Raspberry or Apricot filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tania D"
},
"reviewBody": "I guess this must be an Eastern European recipe! My mother made these cookies for Ukrainian Christmas, and everyone loved them. I lost the recipe, so thank you for sharing it. She called them \"rohalyky\" (horns)because she rolled the dough into a 12 inch circle, cut it like a pizza into 12 slices, put a teaspoon of jam at the widest end and rolled it towards the narrow end. She sprinkled the top with a mixture of sugar and nuts. They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "My dad is from the Czech Republic and I made these for him as a surprise. He loved it and was so happy he immediately emailed my grandma to tell her what I made. Thanks so much for the recipe!! I am giving it 4 stars because he was confused about what they were at first- he is used to them being circular with jam in the center, like a thumbprint cookie. But they were delicious and my whole family loves them! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tawnee"
},
"reviewBody": "My greatgrandmother made these every year around the holidays. When she passed the tradition died. I am grateful to find this recipe. The only trouble I have is keeping the husband and kids out of the kitchen long enough to get a platter full of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trizydlux"
},
"reviewBody": "These cookies were pretty good! I had a hard time understanding how to shape them around the filling, but I ultimately decided to just bring 2 opposite corners of each square up and over the filling and pinch them together on top. They were pretty and tasted great. I think no matter how you shape them they are likely to be tasty. Great recipe overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLFROMSCRATCH"
},
"reviewBody": "I ditched my old recipe for this one. This was the easiest dough that I ever worked with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Dolly"
},
"reviewBody": "Perfection. Used the shot-glass (unfolded) method, just like my Mom used to when I was a kid. I used Solo apricot filling - I could eat them all myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klzee"
},
"reviewBody": "Great recipe! Fruit jam also makes a delicious filling for those with nut allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guiseppe Piscopo"
},
"reviewBody": "I have never tried making these myself before and these turned out very well. Recipe was a lot simpler than I thought it would be. Cream cheese, butter and flour. That's it! Second time I made them, I wanted to go for a low fat version and used fat-free cream cheese and low fat butter. Taste was the same but the texture came out a little rubbery. It's an ok sacrifice to enjoy these with a little less guilt that way. I didnt make the walnut filling and just bought canned filling in Poppyseed, Apricot and Rasberry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAHLERS"
},
"reviewBody": "This was very good! The walnut filing was great, my husband ate about 15 of these within 15 minutes of them coming out of the oven. \r\nMy Bohemian family would take these (with the prune filling my grandma always made) and cover them with heavy cream. The walnut filling is much better! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIKEYMAD"
},
"reviewBody": "I have wanted to make these for years,but could never find a simple recipe,this is SO good,I used Solo fillings as others did. To save some time I also made some with a shot glass cut out and put a thumb print in it and filled that with the filling,they turn out the same! These are the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vegcook4six"
},
"reviewBody": "These were delicious and well received. For the filling, I used Solo apricot, poppyseed and cherry. The dough was so easy to work with-it didn't dry out and was very forgiving (my 1- and 3-year olds even helped!). Like the previous reviewer, I cut out rounds and then pinched two sides together. It took me one round to figure out exactly how much filling and how tightly to pinch so that it all looked perfect, but even the ones where the filling sightly oozed or the top separated tasted great. It took a long time, and because of the small circles I did, it made at least twice the four dozen expected. However, it really was well worth it. My Polish mother and grandmother loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Every year at Christmas time my Polish great grandmother would make these. This is the closest I have found to her recipe. My grandma would make them round however. I find that the smaller you make these, the less time you bake them, and the moister they come out. I suggest using a shot glass (dip the rim of the glass in flour to prevent sticking). Fill with your choice of filling and fold 2 sides in towards the center (pinch to secure) or even just leave them flat. Either way these little beauties come out perfect every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Tisone"
},
"reviewBody": "My husband could not get enough of these. I used different fillings also such as apricot and raspberry. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANISSA925"
},
"reviewBody": "WONDERFUL!!! These were delicious. They were easier to make than the roll out cookies I usually make. I got SO MANY compliments on them when I added them to my holiday treat baskets, that I'm sure I'll make them again.(Before Christmas rolls around again though.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Manos Emms"
},
"reviewBody": "I just made these this afternoon as a suprise for my husband (he is 1/2 Czech). They turned out great! He said they looked store bought. I used apricot filling instead of the poppyseed. If you make both the fillings - cut back the walnut version to half - I had a ton of the walnut mixture leftover. Worth the 3 hours it took to make these - they will be on the annual christmas cookie list. Thanks for a yum-yum receipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "They're just like the ones my Grandmother from Czechoslovakia use to make. She never learned to write in English, so I wasn't able to reproduce those wonderful little cookies until now. I'm teaching my 11 yo niece and 7 yo daughter to make them so they too can carry on a tradition."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/26159/kolachky/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/26159/kolachky/",
"name": "Kolachky"
}
}
]
}
}
, "about": [
]
}
]