				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Korean Spicy Marinated Pork (Dae Ji Bool Gogi)"
,"datePublished": "2020-06-18T23:34:49.000-04:00"
,"dateModified": "2022-08-28T07:50:29.000-04:00"
,"author": [
{"@type": "Person"
,"name": "funinthesun"
,"url": "https://www.allrecipes.com/cook/2367485"
}
]
,"description": "This spicy Korean pork is very good served with rice, kimchi, and salad."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cZd9z0WAhn-9Wb05YOIlrOAEmUs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2267835-korean-spicy-marinated-pork-dae-ji-bool-gogi-donna-4x3-1-e0b0ce6cbb054a92b52f98b4445b9cff.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Korean Spicy Marinated Pork (Dae Ji Bool Gogi)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "93"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "300 kcal"
,"carbohydrateContent": "17 g"
,"cholesterolContent": "55 mg"
,"fiberContent": "1 g"
,"proteinContent": "19 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "390 mg"
,"sugarContent": "8 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"0.25 cup rice wine vinegar",
"2 tablespoons soy sauce",
"0.5 cup gochujang (Korean hot pepper paste)",
"3 tablespoons minced garlic",
"3 tablespoons minced fresh ginger root",
"2 tablespoons red pepper flakes",
"0.5 teaspoon black pepper",
"3 tablespoons white sugar",
"3 green onions, cut into 2 inch pieces",
"0.5 yellow onion, cut into 1/4-inch thick rings",
"1 (2 pound) pork loin, cut into 1/4 inch slices",
"0.25 cup canola oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir together the vinegar, soy sauce, hot pepper paste, garlic, ginger, red pepper flakes, black pepper, sugar, green onions, and yellow onion in a large bowl. Mix in the pork slices, mixing well until completely coated. Place into a resealable plastic bag, squeeze out any excess air, seal, and marinate in the refrigerator at least 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Heat the canola oil in a large skillet over medium-high heat. Add the pork slices in batches, and cook until no longer pink in the center, and lightly browned on the outside, about 5 minutes per batch. Be careful when cooking the meat, the spicy fumes will hurt your nose!"
} ]
,"recipeYield": ["8"]
,"totalTime": "PT240M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "There is an art to Asian cooking that eludes me. Figuring out what goes with what has been a learning experience. However, this recipe is so easy and so delicious. I made this for my Korean wife and she raved about it. She actually said it was better than hers. If you know anything about Koreans, that's like a six star review. I'm familiar with the heat of gochujang so, I omitted the red pepper flakes (for my benefit). I tell you what, it was spicy enough for her and tame enough for me. I'd say on a heat scale from 1 -10 it's about a 6 without the red pepper flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Goodwill"
},
"reviewBody": "I used to get this all the time when I was stationed in S. Korea. Always been one off my favorite dishes. I wanted to try and make it for family and friends when I moved back home. Found this recipe and it turned out pretty close to my surprise. Everybody that can handle the heat loves it. I leave out the ginger and add a little extra of the paste and garlic. If you like spicy, try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "I should have either sliced the onions thinner or started them before the pork, because they were not even close to tender when the pork was done. And overall this flavor wasn’t as complex as I expected, I mostly just tasted the hot pepper - and I love spice but I just wish it had some other things going on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KELLAY"
},
"reviewBody": "I made this without any modifications. Wasn't bad but not quite as good as what i get in the restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn M"
},
"reviewBody": "Will definitely make again. Used 2 tbs brown sugar instead of white and 2tbs siracha since I did not have Gochujang. Threw in a little extra soy to counter the vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Cormier"
},
"reviewBody": "What can I say, just great tasting, spicy pork dish, was just devoured by my family. One of the best dishes I have had recently and I have had lots of great food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The_reluctantchef"
},
"reviewBody": "Love, love, loved this! Made exactly as stated, as I always try to make a recipe the way the creator intended before I make my own changes. (Well I just remembered I left out the red pepper flakes for the kids and it was still plenty spicy for us!) It was DELICIOUS! I make a lot of Korean dishes, but I really liked how this one turned a very american cut of pork into a delicious Korean dish! Try it! You won't be disappointed! As far as some comment that it tasted to vinegary I totally disagree! I used straight rice vinegar (the the seasoned kind) and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marielena"
},
"reviewBody": "This dish is almost a staple for my family. We love Korean food and this dish is delicious an so easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Blount"
},
"reviewBody": "My plans were to make this and another pork recipe for the same meal. I expected this to be too spicy for some at the table. As it turned out, there is a little heat but it's not overbearing. Everyone at the table preferred this to the other pork I cooked. Will definitely be cooking this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NikkiDunaway"
},
"reviewBody": "The whole family loved this spicy dish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mr. Clarinet"
},
"reviewBody": "I followed this to the letter and it is great! What a tasty, yet lean, dish.\n\nI increased it for a 5 lb. pork loin, and mixed the final result with cabbage and carrots to use as my work lunch for the next 2 weeks.\n\nThe directions were solid. If you like flavor, this one's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "uno13"
},
"reviewBody": "Loved this recipe. Perfect as is. All I added was a bit of sesame oil and I cooked mine in the crock pot on high for 2.5 hrs. It's was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Bridges"
},
"reviewBody": "I made this for my Korean roommate who told me it was up there with her father's recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sjperkins"
},
"reviewBody": "This was excellent! Having had authentic bulgogi I knew it was extra spicy so I reduced the chili paste to 1/4 cup and the crushed red pepper to 1 tbsp and it was wonderful! Also I only had pork cube steaks and they were melt in your mouth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andy1982"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tingsv"
},
"reviewBody": "Make sure you use a good quality hot pepper paste. I used Hot Pepper Paste Gochujang by Haechandle medium hot. The sauce is also good for chicken and beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fred Mandich"
},
"reviewBody": "Made this exactly as listed, except for the garlic salt. I used fresh garlic. I also used my Food-saver marinator. I marinated for 4 hours turning the pork every half hour. (Use ice bath under the marinator.) \nI used pork loin and it came out juicy and tender. I garnished with fresh scallions. The flavors were very good, but I was expecting something bolder, or spicier. \nI will make this again but next time I will double the crushed red pepper, and add a touch of sesame oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabrielle Guerrero"
},
"reviewBody": "Came out delicious! I chopped up pork and ended up marinating overnight. Restaurant quality!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chococatzles"
},
"reviewBody": "I added one tbsp of soy sauce to try to thin out the gochujang, and I also used slightly less than 1/2 cup of the paste itself. The flavor is wonderful, but my face is about to melt off! I'm eating it now, and I had to take a break because I thought I would need medical attention if I continued. Maybe my paste is more potent? Definitely handle with care if you're sensitive to hot foods. I'm going back in for round two now ... wish me luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stjchurchcook"
},
"reviewBody": "This was wonderful. I hate it when people change things and then rate the recipe but I had to make one change since I couldn't find the Korean hot pepper paste. I used Sambal instead. I had a pork tenderloin I wanted to use up so I sliced it very thin and marinated it overnight. This tasted just like the spicy pork bowl that we get at our favorite Korean restaurant! I will be making this again soon. Thanks so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimm"
},
"reviewBody": "I will keep returning to this recipe often. Perfect sweet, acid, heat, fermented taste. Can't wait to play around with variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Nelmes"
},
"reviewBody": "Loved this and our exchange korean student said it was like home. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "wow just wow.. i cut this in half and used two bone in pork chops that equated to 1 lb.. for the korean paste i used garlic chile paste and halved it (2 T) and cut the pepper flakes in half (1.5 tsp).. left out the sugar per usual.. added the bit of green onion that was left in the fridge.. i like the warning at the end \"Be careful when cooking the meat, the spicy fumes will hurt your nose!\" i could only imagine the full strength.. i enjoy spicy but this was even pushing it for me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebeccah Dean"
},
"reviewBody": "Absolutely delicious. My husband loved it. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nakomis"
},
"reviewBody": "I love this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarcazmo"
},
"reviewBody": "Closest recipe I've tried yet that matches the real thing!\n\nOne thing I'd do is cut the vinegar amount in 1/2 and add a tbsp or two of sesami oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squeakers215"
},
"reviewBody": "I only marinated for 30 min but the flavor was delicious! Tasted just like the spicy pork at my favorite Korean bbq place! I did substitute a mix of fermented soybean paste and sriracha for the hot pepper paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "h_bosch"
},
"reviewBody": "I was looking for something with gochujang, a great stuff I remember from my short stay in Korea.\nI made one change to the recipe as suggested by some reviewers: I reduced the amount of vinegar to 1 tbs. \nThe meat waited about 20h in the fridge (but purely due to cancelation of the event it was made for). The result was GREAT. \nThanks a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "I didn't follow the recipe exactly. I reduced the hot pepper paste to half of a 1/4 cup and red pepper to 1 tablespoon, and I added 1/4 cup of Spicy Korean Cake sauce. I didn't have green onion, and I used ginger powder instead of fresh ginger. I also used pork chop meat instead of pork loin. I didn't have rice wine vinegar so I used rice vinegar instead. I didn't think the vinegar taste was strong but the ginger; it is possibly because I never really like the ginger taste. I suspect that many reviewers used apple cinder vinegar instead or rice vinegar since ACV has a stronger vinegar taste than rice vinegar. Hot pepper paste is really HOT, and whether the recipe calls for too many hot pepper paste is really a matter of personal taste. To sum up, the favor is good, and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Way too spicy. So much so my family couldn't eat it and I cut the hot pepper paste in half. If you make this cut the pepper paste way, way down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Kotzian"
},
"reviewBody": "Although I did not have ginger on hand, this was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mominator"
},
"reviewBody": "This is outrageously good! I'm making it tonight for the third time this week! First time was with pork, and it was delicious. Had to try it again with beef. Incredible!! Highly recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "srwil7"
},
"reviewBody": "Made this for dinner, substituted cayenne pepper for red pepper flakes and used ½ the amount, I was afraid of it being too spicy. Came out GREAT!!! Will make again as soon as pork tenderloin goes back on sale"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine1909"
},
"reviewBody": "I cooked this last night and it was delicious. I had some fresh herbs (mint, coriander and parsley) so I added a bit of each chopped up and had some left over tinned pineapple so I chopped up two rings. Apart from that I followed the recipe but didnt put as much hot pepper paste or chillies and it was nice to eat and left a nice tingle to the mouth after eating it. I will cook this again:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Cooks"
},
"reviewBody": "This is one of the best international recipes on this site! My children and I absolutely love this! THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Made it for five hungry Korean teenage boys. I followed the recipe, except I used regular white vinegar. They loved it and so did we! Adding to our regular menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Reed"
},
"reviewBody": "this is my favorite korean dish! It's so amazing. Now i don't have to wait to go to my mother's house to have it (she's korean) I can make it on my own. Gochujang has such an awesome flavor, i snack on cucumbers and dip it in the gochujang! YUM!!! I hope everyone tries this and enjoys it as much as my family and i do!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juliek"
},
"reviewBody": "I think this recipe is very reliable and always has great results. I use allrecipes all the time and I usually have to adjust things here and there but this is one recipe I think works just fine as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PASTAPASTA"
},
"reviewBody": "Add to it some grated Korean pear or pear juice and the meat will be even more tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IstyMae"
},
"reviewBody": "I made these for our annual \"hotluck\" - our spicy food hotluck, for those wondering. ;) I made this with chicken drumsticks because I figured it would be easier for people to eat and it turned out great. Other than that small change, I kept everything the same. My dish got rave reviews from fellow \"hotluckers.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LIZCANCOOK"
},
"reviewBody": "Halved the recipe, and subbed 3T of Thai red chile sauce. Still plenty spicy! Pork slices (I used tenderloin instead of loin) cooked up in mere minutes. I cooked in batches, sliding done slices under aluminum foil to stay warm. Went well with Spicy Bok Choy in Garlic Sauce and takeout fried rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cmgrove86"
},
"reviewBody": "Tasted very strongly of vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alo"
},
"reviewBody": "Really good. Had to sub the Sroracha hot chili sauce for the gochujang and just sprinkled some pepper flakes. It was still pretty hot for us and my hubby likes hot. Flavors were great though, will make again just reducing the chili sauce, probably by half to try and increase if needed. Made with lemon basmati rice off this site, went well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LYNDERAE"
},
"reviewBody": "We really enjoyed this dish. I used Garlic Chili Paste &amp; instead of sugar I added pineapple juice &amp; a T. of hot pepper jelly. I also added 2 tsp. of sesame oil to the marinade. Spicy &amp; delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Blevins Ford"
},
"reviewBody": "This is my new favorite food, seriously I can't wait until a week goes by so I can make it again. I use Sriachi hot chili sauce instead of the korean hot pepper paste (couldn't find the paste). I also leave out the hot pepper flakes so the kiddos can eat it. It is still spicy and delicious... YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo C."
},
"reviewBody": "I don't think I've ever had this before in a Korean restaurant so I am not sure how it is suppose to taste. I had some loins I needed to use up so I put this together without the gochujang. I substituted Siracha instead. Otherwise followed this recipe to a T (marinated pork 8 hours) and it was amazing!! Love the heat in this sauce. It is not for the timid!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NambyPamby"
},
"reviewBody": "really good, a bit spicy for my taste, but that's the whole point of the dish! We got the chili paste from the local little Korean market down the street. It comes in a plastic container. Served with rice and gai lan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vwbug7"
},
"reviewBody": "Good recipe, however next time I will omit the rice wine vinegar. I felt that it dominated the flavor of the marindade. I only added one tablespoon of crushed red pepper and it was plenty spicy (and I love spicy), and I used one tablespoon of crushed ginger paste in lieu of the fresh ginger root. The Korean hot pepper paste definitely gives it the flavor typical of restaurant style bulgogi. Overall, very tasty, this would be great with chicken or beef as well. Nice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "avabug"
},
"reviewBody": "Awesome dish! I was looking for something new to do with pork and this is it. I used a different chili sauce so it wasnt as hot, but was still the best thing I ate all week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jocelyn T"
},
"reviewBody": "So delicious! This is a great recipe. My son and I love it. On first try, we didn't have the gochujang, so we substituted with siracha vietnamese chili sauce. It was good, but too hot. the gochujang chili sauce had a better balanced flavor and was obviously more authentic. Also, the meat marinated better. We had it with short grain white rice and some of it with boston lettuce leaves. Try this recipe today!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J Moore"
},
"reviewBody": "To bulk it up, you can add sliced carrots, green peppers, and/or bok choy to it before you fry it. For best flavor, it is traditional to use pork butts instead of pork loin. You must also add some sesame oil to the marinade for an authentic flavor.\nVinegar is not really a traditional Korean ingredient. Most people who live in a built up area can find Gochu Jang which is Korean hot bean paste. Substitute that for the vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Augustitus"
},
"reviewBody": "I left out the red pepper flakes completely, used about half of the sugar, and it was PERFECT. You can use beef, chicken, pork, whatever meat you want. This recipes is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babymama1025"
},
"reviewBody": "Awesome recipe. Thank you so much for sharing. I have looked up many recipes and came up short and this recipe definitely hit the spot! It was little bit sweeter than I expected (I am Korean and I rather like my food just spicy and not so sweet) but it was pretty true to taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koki"
},
"reviewBody": "Amazing! I did some stuff differently, some not on purpose though. I halved the chili paste and red pepper flakes. I didn't think I would be able to handle it full on. I also ran out of white sugar so I used brown. Then I added a few drops of sesame oil. These were small changes and it tasted amazing. It wasn't too hot either. My husband loved it. Usually he has a complaint about everything. He said this was great. Thank you very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefF"
},
"reviewBody": "This dish is amazing! My fiance who is part Korean loved it and said that he forgot I made it. He thought his mom made it. Thank you so much for such a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rockaway"
},
"reviewBody": "This is my husband’s favorite when we dine at a Korean restaurant. Overall, the recipe is close to what we’ve had, but a bit sweet for our taste, so I would cut down the sugar to 1.5 Tbsp. next time. We made two meals out of this; the first night we had the pork over rice, with Korean kimchi and stir-fried veggies on the side. The next day, we made tortilla wraps with the left-over pork, with dollop of sour cream, sliced avocado, and shredded lettuce – wow, it was da bomb! By the way, Kochuchang (Korean hot pepper paste) can be found in any Asian grocery store, usually in the same refrigerated section as miso (soybean paste) and such. Thank you funinthesun for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2boxerk9s"
},
"reviewBody": "this was incredible!!! Used bone in porkchops and found myself gnawing on the bone, finger licking good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elsabarry"
},
"reviewBody": "Couldn't find hot pepper paste in a timely fashion so I used korean BBQ sauce. Still came out great. I have found an asian store that carries hot pepper paste so I will try this receipe again correctly. I know it will be the bomb!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "This was perfect just like the resturant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dwells1210"
},
"reviewBody": "This was amazing. I marinated the pork loins over night. I didnt have the pepper paste, so I used 1/2 wasabi paste. It came out great. I served with white rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TOELESSINCA"
},
"reviewBody": "This was delicious. I didn't have the korean hot pepper paste. I used some other hot sauce on hand. I marinated 4 large pork chops with bone in for 24 hours and grilled them. All the dogs in the neighborhood were drooling with wagging tales. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeClercq"
},
"reviewBody": "I bought a huge pork loin and cut it into 4 pieces. I put a different marinade from the site on each one and froze them. This one turned out the best of the 4. Very good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJ"
},
"reviewBody": "I wish I'd seen this recipe the first time I purchased bulgolgi (this is how it is spelled at the AFB commissary we shop). I absolutely love it and will make it as often as I can. My SO and I love spicy foods. I didn't have hot pepper paste and substituted Sriracha Hot Chili Sauce and would bet the outcome was as good or better. Thanks for sharing this one. Can't wait to serve it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scuba_Steve"
},
"reviewBody": "Excellent flavor and easy to make; my favorite combination! I didn't have rice vinegar so I used red wine vinegar, which also has a lighter flavor. My wife and I love super spicy food so I doubled the red pepper flakes and black pepper. Man was it good! Thank you for a great and authentic tasting recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen Feehan"
},
"reviewBody": "Dae Ji Bool Gogi is one of our favorites! I've never been brave enough to try cooking Korean cuisine, but I went for it with this one- such a great recipe. I couldn't find the pepper paste in any store, so I substituted with a Vietnamese chili paste and that was WAY too spicy, the heat overpowered the taste; next time I'll have to find the real stuff for this recipe. This is awesome when served with lettuce leaf and rice.\n*when we have had this at restaurants it is served with a paste-like condiment- do you know what that is and how to make it?\nThanks for delicious authentic Korean Recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Kilo"
},
"reviewBody": "My stepson recently came back from serving in Korea, and requested this dish. I tried this recipe and he ADORED it. I am a vegetarian, and used the sauce with some tofu. It was PHENOMENAL. A very tasty dish. Preparing it without the red pepper flakes will take some of the heat out for those who are not into spicy foods. I found that without the red pepper flakes, the heat was just right for my taste."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/162036/korean-spicy-marinated-pork-dae-ji-bool-gogi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/700/world-cuisine/asian/korean/",
"name": "Korean"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/162036/korean-spicy-marinated-pork-dae-ji-bool-gogi/",
"name": "Korean Spicy Marinated Pork (Dae Ji Bool Gogi)"
}
}
]
}
}
, "about": [
]
}
]