				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Korean BBQ Beef (Pul-Kogi)"
,"datePublished": "2020-06-18T23:08:52.000-04:00"
,"dateModified": "2022-07-14T18:08:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tanya"
,"url": "https://www.allrecipes.com/cook/24328739"
}
]
,"description": "A fruity marinade - made with minced pear or kiwi, garlic, sesame oil, and rice wine - tenderizes and flavors the beef, creating a dish that is sure to please. This version is cooked on top of the stove in a grill pan."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/LUMlGqmuQp5GoeW289VuY6ayHrQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/847520-da0f8b41ace948b2b23afd72a4a2aa34.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Korean BBQ Beef (Pul-Kogi)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "203"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "276 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "60 mg"
,"fiberContent": "2 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "947 mg"
,"sugarContent": "9 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 pound beef top sirloin, thinly sliced",
"6 cloves garlic, minced",
"0.5 pear - peeled, cored, and minced",
"2 green onions, thinly sliced",
"4 tablespoons soy sauce",
"2 tablespoons white sugar",
"1 tablespoon sesame oil",
"1 tablespoon rice wine",
"1 tablespoon sesame seeds",
"1 teaspoon minced fresh ginger",
"1 teaspoon freshly ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large resealable plastic bag, combine beef with garlic, pear, green onions, soy sauce, sugar, sesame oil, rice wine, sesame seeds, fresh ginger, and ground black pepper. Seal, and refrigerate for 2 to 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven&#39;s broiler and set the oven rack about 6 inches from the heat source. Brush oil over grill pan. Place beef on pan. Cook, turning to brown evenly, for 3 to 6 minutes, or until done."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "This was excellent as written. It is a keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "I wish it made more marinade so I could boil it down and make it saucier. It was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lin"
},
"reviewBody": "So good! I marinated it for much longer than a few hours, and the flavor really soaked in well. I only made one ingredient substitution: I didn't have pear, or any fruit for that matter, on hand other than some frozen soursop pulp. I used a bit of that and increased the ginger so that there would still be an adequate amount of meat tenderizing. I don't think it changed the flavor terribly much; I just wanted to note that other acidic fruit can be used in a pinch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medora Jensen"
},
"reviewBody": "Well it's COVID19 time, and I didn't have all the correct ingredients but even with substitutes it was amazing!\nNo pear, I used half an apple.\nNo rice wine, I used sherry.\nI also used beef tenderloin thing my cut.I\nI served it with rice noodle with a spy sauce, not sauce, honey and garlic sauce and taken cauliflower with a spicy Korean bbq sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Davenport"
},
"reviewBody": "I made it as is and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordanruth"
},
"reviewBody": "It was delicious! We added a tablespoon of some spicy sesame oil and a tablespoon regular and it made a wonderful sweet and spicy mix"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hdw"
},
"reviewBody": "Excellent recipe!! And so EASY to make!! Goes great with fried rice and veggies! Which I used the juice to season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah Lizzy"
},
"reviewBody": "Good, but not the flavor I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angie-b"
},
"reviewBody": "everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Until today I would have thought the only way I could ever make pulkogi this good would be if I were reincarnated as an Ajuma. Didn't have pears but applesauce worked just fine. Marinated an extra hour or two. Two pounds of beef fed 8 of us with hearty appetites--and some leftovers! That's what I love about Korean food: the amazing meat is just the beginning--then there's the kimchi and the seaweed and the lettuce and the steamy rice and the gochu jang. Wow, feeling satisfied and already looking forward to having the leftovers for lunch tomorrow! Thanks for sharing this recipe Tanya!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Unreal!!! Absolutely DELICIOUS!!!!!! Made the recipe exactly except used thinly sliced London broil and marinated overnight. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JARRIE "
},
"reviewBody": "We normally make bulgogi on the grill. I was surprised by how good this was, even though I totally do miss the charred crispiness that the grill adds. This is by no means a second-rate cousin to grilled bulgogi, though, it's more like the difference between grilled burgers and pan-fried: can't really fairly compare one to the other as both are so good. I did not like the pear being so small, it got all squishy. In the future I would either use pear juice/nectar or large chunks of pears so that I could eat them separately from the meat as the texture just didn't please me. *It is possible that my pear was too ripe, too.* Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "poison_ivy"
},
"reviewBody": "Good flavor, considering only marinated 2 hours. Was more soft than \"crispy\". Will try on BBQ next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIFFANY LENNING"
},
"reviewBody": "My first attempt at Bulgogi &amp; this was perfect. I didn't change a thing. Marinated for a few hours &amp; then broiled on the oven broiler pan - wonderful. I prefer my Bulgogi extremely thin &amp; that was probably the hardest/longest part of making the recipe, but it was worth it. Will be making this again &amp; again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msmit245"
},
"reviewBody": "I've been to a lot of Korean places for BBQ and this is the closest I have gotten. Loved it. Very sweet but full of flavor. Cooked it on a counter top grill and it was perfect. They come out great. Definitely try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "briguy"
},
"reviewBody": "I tried this recipe a couple weeks ago, and it is really good,and easy! The only things I thought were missing were some vegetables and more beef,so I'm making it again tonight and I will post my results soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "treecitynigh"
},
"reviewBody": "Wow, wow, wow... This might be the tastiest thing ever prepared in my humble little kitchen. I can't believe how easy it is. I have a new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Rodziewicz England"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "I have never been to a Korean restaurant, but if this is what the food is like, I'm going the first chance I get! This was delicious!! I made exactly as listed. It was wonderful and I ate it 3 days straight until it was gone! The hubby hates white rice and I hate brown rice so I made it with Beef Rice A Roni. It was a big hit. I will definately make this again. Thanks Tanya!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wyattdogster"
},
"reviewBody": "Outstanding!I marinated the steak all day and did it on the grill..the sauce sort of caramelized and it was oh so good! Served it with rice and one of those napa cabbage/ramen noodle Asian type slaws and we all thought we had died and gone to food heaven. Thanks a million!! Rice vinegar worked just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susy"
},
"reviewBody": "Nice and easy! I only gave it 4 stars due to the fact that only 4 of my five picky eaters liked it. (too salty) Don't let this discourage you from trying this excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark G"
},
"reviewBody": "I prepared this for a group of 70 that meets every month for lunch, but substituted pork tenderloin for the beef because of cost. I served it to be portioned in a romaine lettuce leaf or flour tortilla, and with bean sprouts, julienned carrot and cucumber, chopped cabbage, and thinly-sliced sweet onion and fresh ginger, and fresh cilantro marinaded for 4 days in sesame oil, rice vinegar, and Serachi. I also made a side of fresh lime-cilantro mayonnaise that needed to be replenished half-way through the line. I also offered jasmine rice as an accompaniment.\n\nWithout exception people reported it was the best lunch they had every been served at their meetings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Just_G"
},
"reviewBody": "my kids loved it and it's so easy to make. Cheers Tanya! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BrittanyG"
},
"reviewBody": "this was ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "techbri"
},
"reviewBody": "Wonderful! We changed nothing and it was magnificent. Perfect with rice and stir-fry vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni-Mic"
},
"reviewBody": "This is the Korean BBQ recipe to end all Korean BBQ recipes. It is absolutely delicious. I used a small Asian pear,(I have a tree in my yard-I love that tree) grated, and followed all else exactly. I am never going back."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spapsdorf"
},
"reviewBody": "This is a good dish. A bit sweeter than I was expecting. Next time I will half the sugar or omit it altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BethDai"
},
"reviewBody": "Wow, this is our second Korean Dish we have made recently (Bi Bim Bop was our first) and we are in love. The flavors are incredible, and we only marinated for an hour and a half. Made with sticky white rice and sauteed Mushrooms and broccoli in the remaining marinade. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annabel Docken Middleton"
},
"reviewBody": "Delicious recipe. Very simple. Only change I made was to reserved marinade (after steak was taken out). The amount of marinade left after taking the steak out was very small. So to the marinade being boiled I added:\r\n2 T Hoisen sauce\r\n1/2-3/4 C chicken stock\r\n1 T corn starch\r\nMix well and boil for at least 10 minutes. Then drizzle sauce over grilled meat and veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "supernovanator"
},
"reviewBody": "I would rather die than eat a pear so I left it out. Still absolutely fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ORGFISH"
},
"reviewBody": "I couldn't believe how fabulous this was! I'm not much of a cook, and it turned out great, much to the happy surprise of my fiancée and myself. Note that I did substitute rice wine vinegar for rice wine, because I realized too late that we had no rice wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jtaylor"
},
"reviewBody": "I followed the recipe only changing the rice wine to rice vinegar due to not having any. I made a double batch to freeze ahead.When I pulled 1 out I let it marinate a day in a half. It was so good my picky eater took the rest to school for lunch without a crumb to spare. This dish is sweet and spicy. Just right. Not hot, but very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meowmix318"
},
"reviewBody": "Excellent and yet very simple and versitile! I use rice wine vinegar as well and omit the sesame seeds because I never buy them and have them in the house. I also omit the green onions sometimes when I am out of them and this recipe still comes out wonderful! My family love the sauce. You will not be disappointed with this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elball"
},
"reviewBody": "This is one of the better Korean BBQ marinades I've come across. The only thing I added was some sriracha sauce (about 1/2 tbsp) as I like a little heat. As I like my beef a little pink in the middle, I marinated a whole flat iron steak (1.5 lbs), broiled it (5 to 6 minutes a side), and then thinly sliced it. I have also done this in the past with a flank steak. (The marinade may not penetrate the center of the steak if you do it this way.) To save some time on prep, I put all the marinade ingredients, except the sesame seeds, into my mini food processor and made a puree. I added the pureed mixture to a ziploc bag with beef and sesame seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spec2"
},
"reviewBody": "Don't forget to hang on to the marinade! If you boil it to kill any lingering bacteria from the raw beef, you'll end up with a great sauce for some stir-fried or grilled veggies on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marina"
},
"reviewBody": "did not have sesame seeds or the pear, but still came out delicious!!! even my 2 year old ate it :-) and she is very particular about her food. Next time I'll make as written here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BigDaddy"
},
"reviewBody": "Taste of sesame oil is too much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SISTERTASH"
},
"reviewBody": "Great recipe. I eliminated the pear, rice wine, and ginger - only because I don't enjoy these components. The rest really took me back to the pulkogi of my youth growing up in Hawaii. Every week our family would eat Korean BBQ. Just get a good helping of sticky rice and kimchee to garnish and I am 12 again! Wonderful!! Also of note, I mix the marinade, put it in a gallon ziplok freezer bag and throw in my cut meat, push out the air and let it marinate overnight. You would NOT believe the effect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avocat"
},
"reviewBody": "This was really good, even though I made it wrong. I emptied the beef along with the marinade into a skillet, so it didn't have the charred effect. Next time, I'll empty the beef onto our grilling basket, which will strain the excess marinade, and then grill the meat in the basket. Outstanding flavor! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avocat"
},
"reviewBody": "This was really good, even though I made it wrong. I emptied the beef along with the marinade into a skillet, so it didn't have the charred effect. Next time, I'll empty the beef onto our grilling basket, which will strain the excess marinade, and then grill the meat in the basket. Outstanding flavor! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissassm"
},
"reviewBody": "This was really tasty! I followed the recipe exactly except for the pear. I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Kosturos"
},
"reviewBody": "Unfortunately the grocery store I went to didn't have sirloin so I ended up getting flank steaks or something like that. The meat didn't cook quite like I would have liked, but the marinade is AMAZING! I put extra ginger in. I used vegetable oil and rice vinegar instead because I didn't have the other ingredients and it tasted just fine. I have purchased beef top sirloin this time and am going to re-try the recipe with the right meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "biochemchef"
},
"reviewBody": "Great recipe! 10x better than bulgogi I've had at various restaurants. I was too lazy to pick up a grill pan for this, but a regular pan worked fine (I just drained a bit of the liquid away before cooking). The ginger really stood out and was a bit strong for my taste, so I'll most likely cut the amount in half next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RotorTrash"
},
"reviewBody": "mouthwatering, makes it easier to nt GO OUT to eat! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "This was tasty but I really prefer Bulgogi over Pul-gogi. I used beef tenderloin and didn't marinate the beef. The flavors still soaked in because the tenderloin was melt in your mouth good. Served with \"Quick Sesame Green Beans,\" \"Korean-style Seaweed Soup,\" \"Chinese Cabbage Salad I,\" and leftover \"Sesame Noodles.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nefret"
},
"reviewBody": "Just excellent! Made as described and it was devoured quickly. The meat was extremely tender and I loved the slight sweetness lent by the pear."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caitlin Brewer"
},
"reviewBody": "Very tasty recipe. I marinated the meat for just over an hour (lost track of time...oops), and it turned out fine. Served it with jasmine rice, and the skillet was scraped clean!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JK"
},
"reviewBody": "This was pretty darn good. I will make it again. The pear wasn't very strong. Might add a whole pair next time. Also might try it on the grill for variety. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mochi-Mochi"
},
"reviewBody": "The best recipe I have come across. I made it and used it with noodles, cucumbers and bean sprouts to make vietnamese spring rolls with nuoc cham sauce. I'm sure it would go great with rice as well. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SakuraSlime"
},
"reviewBody": "So awesome! And so easy! I hate to cook, I'm really bad at it, and am extremely picky, but I love this recipe! So do my picky kids! I've been using an apple, because pears are expensive and hard to come by where I live, and I leave out the ginger, as none of us are fans, but my meat still comes out tender and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bishmyu"
},
"reviewBody": "This recipe is delicious and very, very easy to make. My fiance loved this. It is his new favorite homemade meal (with Japanese rice or Thai sticky rice). I used an Asian pear. My fiance hates onion so I left the onion out of the recipe but it tasted great. Do not marinate longer than 2-4 hours because the meat will become tough if marinated for a long time (like overnight). I made too much and the leftover meat that we cooked the next day was not as tender as the meat we had cooked the night before. If you use a grilling quality steak for the beef, then don't cook the meat well--cook it only to rare or medium rare for maximum flavor and tenderness. This recipe deserves 5 stars because it is so easy to make and is so good. We have eaten this many times in restaurants and this version is much better than any restaurant version either of us has ever eaten. I think this will be one of your favorite recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCGOPS"
},
"reviewBody": "I followed this recipe exactly, and loved the results. I also reserved the left over marinade and reduced it to give people the option of putting an extra dose of flavor on the finished product. I used Kikkoman Koterin Mirin, a sweet rice wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Schoon"
},
"reviewBody": "Followed directions-only variation was to add 1 small habanero peppers thinly sliced because we like a little heat without meat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mike ronson"
},
"reviewBody": "I got turned onto Korean BBQ in Berkeley of all places and came across this one day and tried it out. It was absolutely delicious. I modified it a little though. I used shredded angus beef which made the meat so delicious. As not a big fan of ginger (I know, weird) I nixed that and the second time I used an entire pear (a \"cooking pear\") because I loved the sweetness the first time. I let it sit in a freezer bag as long as I can handle as I think this is the key to a great result. I used \"sushi\" soy sauce which I don't know how different it is and I chose to use brown rice instead of white. I didn't have any rice wine vinegar so I just didn't use any and it was still FANTASTIC. I also used organic granulated white sugar (all I had) but unsure how that changed the flavor.\n\nPersonally I think that thai sauce (sriracha) (that red pasty stuff with the green lid and all the asian writing on it) is *mandatory*. It has vinegar in it. To me that brings this dish home :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zubs"
},
"reviewBody": "This was really good and simple to do.I added onions cut up in wedges, 1 grated carrot and the green onions to make it a complete meal.Didn't have rice wine so used white wine instead. Marinated only 1.5 hours and was still very tasty.Served with white rice and Miso soup.Will surely make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gungerly"
},
"reviewBody": "This recipe is phenomenal! Im not usually one who likes to combine fruit and meat but in this particular instance, the combination of flavors was absoutely delicious. All in all, it tasted like authentic Korean Bulgogi/Pul-Kogi from a restaurant. Thinly sliced meat like that is called for in the recipe can be difficult to find; I suggest going to your local supermarket butcher and buy fresh sirloin there and have them slice it thin for you, free of charge. The thinness of the meat is very important in this recipe; too thick and its just not the same. Also if you are using a pan, dont stir the meat around too much. When you initially place the meat in the pan, let it sizzle for a bit and get a nice brown color and then flip the pieces over to sizzle on the reverse side. Serve with rice and fresh Kimchee and voila...an absolutely delicious, incomparable dinner that will wow everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "noellesumma"
},
"reviewBody": "From my experience with bulgogi recipes a 2:1 soy sugar ratio provides a salty result. I used 3T instead of 4 and 1T honey, 1T sugar and and grated apple instead of pear, and it turned out great. If you don't have rice wine, just leave it out rather than using rice wine vinegar - it is not the same thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia"
},
"reviewBody": "Very tasty marinade. I used boneless chuck steak, marinated overnight, broiled and then cut into slices. Everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRINGORN"
},
"reviewBody": "Great!! Don't overmarinate it or the meat gets salty. 2-3 hours is enough! Also, don't forget to use the sugar, that is what helps it brown when you cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bevin"
},
"reviewBody": "This was really good and my boyfriend loved it. I doubled the sauce as suggested but I found it to be a bit salty even though I used low sodium soy sauce. I will make this again but need to figure out a way to reduce the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Absolutely wonderful dish! I did not change the recipe a bit, and it's a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Olivia G"
},
"reviewBody": "tasted very good but meat wasn't as tender as i expected. next time i will slice it really thin, i had it about 1/4\" thickness this time. nice flavor but not \"to die for\". i used apple cider vinegar cause i couldn't fine rice wine...maybe that changed it?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "XMASRED"
},
"reviewBody": "Five star recipe! Primarily because of taste, but also because preparation can be done ahead, general presentation can be beautiful, and ingredients are those I have on hand! Very very tasty dish -- and a dish I can use for overnight guests, since I can prep all items ahead of time, be out all day, and come home have it ready in about five minutes. Thanks, Tanya!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Michelle"
},
"reviewBody": "Really, really, really good. I threw everything in a ziploc and marinated overnight. Cooked the strips on a stove top grill. Served with white rice and \"traditional pot stickers\" from this site. Thanks so much for the recipe. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Fritz"
},
"reviewBody": "This was so tasty! I used a London Broil instead of the cut called for, and it still turned out tender! I also used a stove top grill pan, so I was able to save the pear bits and serve them with the beef, too. Extremely good, will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Frank Furter"
},
"reviewBody": "It was ok, not quite what I thought it'd be. Flavors didn't seem rich enough, perhaps it needed to marinate longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC324"
},
"reviewBody": "I'm Korean-American and have had Bul-Go-Gi countless times. This is the best recipe, trully authentic as others have stated. Recipes I've tried from Korean cookbooks did not turned out as well as this one did. This is definately a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deb"
},
"reviewBody": "This is a terrific recipe, every bit as authentic and delicious as the dish I ate in Korea many years ago. My husband &amp; our guests raved about this. We'll have this again! We served with the Korean Cucumber Salad, which was the perfect side dish for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ"
},
"reviewBody": "Nothing short of Excellent!!!! I'll be using this one on a regular basis."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlenaUSF"
},
"reviewBody": "I used to live in Korea and have been craving the food recently. This is my first time making this dish and it came out awesome. I had to substitute the rice wine for just a white wine, used honey instead of sugar, and an apple instead of a pear. I just didnt have these things around, but it came out awesome anyway!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "This was very very good! My husband and I both loved it. I followed the recipe, except I didn't have any rice wine, so I used rice wine vinegar, and I added a tablespoon of sesame chili oil for a little bit of heat. It was awesome and I will be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alice Li"
},
"reviewBody": "Very authentic in taste! I blend the ingredients so it won't be chunky. This way when I BBQ it the garlic and green onions won't burn before the meat is done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mifabeefa"
},
"reviewBody": "Have made several times and love it. Used the marinade on beef as well as chicken, great on both!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMLE234"
},
"reviewBody": "I love this recipe. My only mistake was salting the beef before putting it in the marinade. I used low sodium soy sauce and didn't realize its sodium would be enough. Besides for being a little salty it was great! Next time, I won't add more salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicole"
},
"reviewBody": "This marinade is delicious, although I didn't feel like it was traditional Korean BBQ. It tasted more like a basic asian marinade than something spicy which I associate with Korean BBQ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy G."
},
"reviewBody": "This is an absolutely AMAZING and DELICIOUS dish. The flavors in this are tantalizing and I was worried about too much garlic but it was just perfect. I let mine marinade all day and this was so good, it got gobbled up quickly. Well worth getting your rice wine for this recipe. Thanks so much for posting this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jecca"
},
"reviewBody": "I really did not like this recipe. The \"Sesame Beef\" recipe on here is 10 times better. It may have been partially the meat it called for, as well as a few ingredients. As far as I remember I dumped the left overs...not a family favorite and just didnt do it for us..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "purplegold"
},
"reviewBody": "I love this recipe! It makes me feel like a pro making this. The results are so impressive. The first time I made these I didn't have rice wine or sesame seeds and I decided I was ok with that. I used white wine instead, but after my first attempt I bought rice wine to get a more authentic asian flavour (and was surprised coz rice wine wasn't so expensive). Also as the pears I use are quite small I use the whole thing. Tips: 1. beef thinly sliced cooks quite fast, esp in soy sauce, so I cook the beef then leave the onions in the pan with the sauce to let them caramelize, then i return the beef to the pan and heat a minute before serving. 2. These are also great for bachelors and bachelorettes who live alone - i cooked a few slices from the bag one night and cooked a few more the next. 3. I like to use more sesame oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TKEENAN"
},
"reviewBody": "Subsitute the sugar for honey. That is how I usually make it and it taste musch better. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "readernut"
},
"reviewBody": "I haven't had this in a good twenty years. It's still as yummy as ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spence S"
},
"reviewBody": "My wife and I thought this was pretty good but our kids (aged 5 and 7) absolutely loved it! They gobbled it down and there were no leftovers. Who knew?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "This recipe is a keeper! It is simple and delicious and my young children love it. I have made it multiple times with different cuts of steak and it has been tasty every time. I omit the pear and substitute 1/2 tsp of rice wine vinegar for the rice wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMR"
},
"reviewBody": "So good and so tasty! I followed the recipe exactly as written. My husband thought it was really good and we ate it with steamed rice and the Korean Cucumber Salad that's also on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anjilee Tolle"
},
"reviewBody": "Everyone loved this! Such a good flavor; similar to teriyaki. I pan fried it and couldn't get the crispy exterior some of the reviewers said it should authenically have. I think I'll try to cook it a different way next time. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Popham"
},
"reviewBody": "AWESOME recipe. We lived in South Korea for a year this is VERY reminiscent of a little place we liked to eat at. Very Good and the meat was so tender with a perfect crispy exterior. I marinaded overnight. Also stir fried some cabbage and carrots in the marinade with a little extra oil. Served with the stirfry and jasmine rice. BIG HIT!!!!\nThanks a million!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Em"
},
"reviewBody": "This is pretty good, but a bit too sweet. I'll use less sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TropicAnna"
},
"reviewBody": "This was delicious! The meat was very flavorful and I only marinated it for 2 hours. Next time I will try the others' suggestion of thinly slicinig the meat while frozen. I cooked the meat in a hot wok since we didn't have a grill pan and it still came out great. Thanks for the recipe, will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cook"
},
"reviewBody": "This is a great dish. We absolutely loved it and I will make again without changing anything except doubling the recipe! Thank you so much sharing recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pickycook"
},
"reviewBody": "entire picky family loved it. tip: freeze the beef for about 1/2 an hour before slicing it. it makes it much easier to work with. i followed the recipe exactly (marinated 3 hours) and it was absolutely perfect. couldn't be easier. thanks for a really great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PROUDSOLDIERSWIFE"
},
"reviewBody": "This recipe was amazing! The flavors were perfection....I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iq5203"
},
"reviewBody": "This was an incredible recipe. I stir fried some veggies to go with it and served it over rice. \n\nWas a bit salty, I'd recommend low sodium soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowlvr"
},
"reviewBody": "VERY GOOD!! Only change I made was to only put in 3 T soy rather than 4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PURSEONALITY"
},
"reviewBody": "GREAT!! mmm very tasty.. I marinated for 2 hours only and they were fabulous! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilovemy4kids"
},
"reviewBody": "All my 4 children liked this dish, so this will be a regular rotation in this household. Easy to prepare, and so tasty. I bought the thinly sliced beef usually used to make sukiyaki dishes so the beef were really tender. Since I wanted to sneak in vegetables, I doubled the marinade and boiled the vegetables with it and poured it over the beef as gravy. Thank you for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nakina Clark"
},
"reviewBody": "fantastic flavor..served it w/ homemade fried rice and veggies...we loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisainCalifornia"
},
"reviewBody": "This is my favorite marinade. I have used it once a week since I discovered it last summer. I often marinade short ribs or steak in it, and then cook them on my double grill pan (fits over two burners on my stove). My whole family loves it! Many thanks for posting it!\nLisa"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori K. Bogren"
},
"reviewBody": "Very good, but nothing spectacular. I used it to marinate whole steaks (not thinly sliced steak), then we grilled them. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMANUEL"
},
"reviewBody": "I agree with the other reviewers, this recipe was great. I will marinate for longer next time. Smelled wonderful when cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BARB9000"
},
"reviewBody": "Are you joking? This is the best! I am half Korean and grew up with this - tastes just right! Soooo good - everyone loves this dish. Can't go wrong."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/48546/korean-bbq-beef-pul-kogi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/700/world-cuisine/asian/korean/",
"name": "Korean"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/48546/korean-bbq-beef-pul-kogi/",
"name": "Korean BBQ Beef (Pul-Kogi)"
}
}
]
}
}
, "about": [
]
}
]