				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Kosher Salt Encrusted Prime Rib Roast"
,"datePublished": "1999-12-29T10:19:36.000-05:00"
,"dateModified": "2022-08-15T20:11:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MARBALET"
,"url": "https://www.allrecipes.com/cook/39277"
}
]
,"description": "Its flavor-enhancing power is salt&#39;s greatest culinary asset. Try this slowly cooked (4 to 5 hours) roast and see for yourself."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iQ8EHTXjeFqlnWQbdy-t0uqs9aQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6119300-kosher-salt-encrusted-prime-rib-roast-gregscher-4x3-1-28c9794985194efe9deffaaa660b1f22.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Kosher Salt Encrusted Prime Rib Roast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "398"
}
,"cookTime": "PT270M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "391 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "107 mg"
,"fiberContent": "0 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "30921 mg"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups coarse kosher salt",
"4 pounds prime rib roast",
"1 tablespoon ground black pepper",
"1 tablespoon seasoning salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 210 degrees F (100 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cover the bottom of a roasting pan with a layer of kosher salt. Place the roast, bone side down, on the salt. Season the meat with the ground black pepper and seasoning salt, then cover completely with kosher salt."
} ,{
"@type": "HowToStep"
,"text": "Roast in preheated oven for 4 to 5 hours, or until the internal temperature of the meat reaches 145 degrees F (63 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Remove from oven and let rest for 30 minutes. This sets the juices and makes the roast easier to carve. (Note: Be sure to remove all the salt from the roast before serving.)"
} ]
,"recipeYield": ["6"]
,"totalTime": "PT280M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this for the last Christmas's and it has been amazing each time. What the recipe doesn't tell you is you have to wet the kosher salt before covering the prime rib."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Schottelkotte"
},
"reviewBody": "I have made this recipe several times ! It always comes out perfect! The prep change I do is to dry age the roast with herbs and spice in the refrigerator for a day or so… I have a temp probe in my oven that makes it so easy to know the roast is done ! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "We have made this recipe a number of times and we love it every time! This time we added garlic cloves imbedded in the meat is various spots and cooked it just as called for. My only advice is to watch the time in the oven. I used a meat thermometer to 135 degrees F. It was done 1.5 hour before I thought it would be. I am not sure if it is our oven or location, but since it was just our family it was fine. perfectly done they way we like it, medium rare still pink inside. Hope this helps. Enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa P."
},
"reviewBody": "Made it for Christmas and it turned out great. The only thing I did different was add some injection. And the leftovers made a great French dip sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Roberts"
},
"reviewBody": "I loved it and have been doing this for many years. I mixed the salt with some water and pasted it on. The sides, not so much Then I looked at a picture and the entire roast is buried in salt.\nI did get jammed up due to the low temp and the need to get the rest going at 400.\nI made twice baked potatoes, brussels sprouts and Red Lobster cheddar bisquits.\nNailed it! My Thanksgiving 2020."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FLYINGSCOT4"
},
"reviewBody": "I reviewed this roast and gave it 5 stars and I still do. At that time I hadn't read many of the other reviews and I want to add to the comments of others. Purchasing meat today is not necessarily getting what you pay for. You cannot make a USDA Select piece of meat into a USDA Choice+ quality roast. If you know your butcher it will help a lot. Knowing what a good quality piece of meat looks like is of high importance. My grandmother said, \"If you don't know your meat, you better know your butcher.\" Second, do NOT use table salt! Large crystal salt (like rock salt) or kosher or sea salt are what to use. Don't skimp on the salt! Further, if I'm cooking a large roast (5 lbs or more) I take it out of the refrigerator 2 hours before putting it into the oven. Next, know your oven! Some ovens are off by more than 50 degrees! Not only should you have a meat thermometer, you should also have an oven thermometer and you should be able to read both without opening the oven door. Watch your meat thermometer! It will look like nothing is happening and then start to rise. When that happens, it will go up pretty quickly. Let it rest for 30 - 45 minutes before carving. Don't get anxious. This is a great method for prime rib. I have never had salt encrusting fail. Hope these help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Turned out great . Little stress,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gomez Addams"
},
"reviewBody": "It came out waaaaay too salty. Even after discarding the crust. In general it was a mess and not worthy of such an expensive cut of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "huskerfan"
},
"reviewBody": "I didn't use that much salt but it turned out great! Thanks! Will go to 135-140 next time so it is a little more rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bj"
},
"reviewBody": "Made it for Thanksgiving! No leftovers! Was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Fitz"
},
"reviewBody": "I was very pleased with the beef roast and I prepared it using the exact instructions\nMy husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Renee S"
},
"reviewBody": "It was good but a little salty for my taste. Others liked it, but I would put less salt if to make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Stilwell"
},
"reviewBody": "Bar none, the best prime rib recipe we have tried!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CJ Jackson"
},
"reviewBody": "Looks and smells great. Taste I would add rosemary and garlic next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissthomas"
},
"reviewBody": "I make this every year for Christmas and it always turns out perfect. I dry age my prime rib in the fridge for a few days before as well. Just clean and prep the meat and place it on a drying rack over something that will catch any drippings. Dry as best you can and cover loosely but completely with paper towels. Then put it in your fridge for up to a few days before cooking. It concentrates the flavor so much and really makes it pop!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charles"
},
"reviewBody": "the best ever!! Incredibly tender and flavorful. Only regret is that there is no \"au jus\" because the salt soaks it up-but really not needed. ONe change--at the end, we blasted it at 425 for ten minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Imma Schmitz"
},
"reviewBody": "I made this and was perfect. If you dont follow directions then dont complain about how it turned out.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ralph Bregant"
},
"reviewBody": "This is the first and most delicious prime rib I have ever made and tasted. I have always been too intimidated to make prime rib. I got a 6 pound roast and left it in the oven for 5 hours. Never opening the oven door to check it. When I took it out it was 145 degrees. A little higher than I wanted. So, I didn't wait the 30 minutes to cut it. It was delicious. I will no longer go to a steak house for prime rib. I will make my own.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erick Dean"
},
"reviewBody": "Everything turned out great. I will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Scher"
},
"reviewBody": "As many of you know that follow me, I always try a recipe or restaurant at least 3 times before passing judgment on it. Such is the case here.\n\nTo begin with, I read all of the negative reviews and all but one or two were complaining about how salty this recipe was. Ladies and gents, that is NOT the recipe's fault, it is the cook's fault. Always make sure the meat is rolled and tied securely (if you have a boneless type) and ALWAYS, ALWAYS be sure to REMOVE ALL OF THE SALT before untying or carving the meat!!!\n\nIf you follow the directions of this recipe E-X-A-C-T-L-Y and remove all of the salt before untying or carving the prime rib, you will have a flawless result every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farmgirl4095"
},
"reviewBody": "I've been making this for years. I worked at a high end restaurant in my younger years where they cooked prime rib this way. They used a spray bottle to lightly dust the top of the salt with water. Works every time. Do not cover the roast with foil or lid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time I ever cooked prime rib was this way. Roast was raw, the rest of the dinner was ready, it was a disaster. Meat so salty could barely eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bandbswart"
},
"reviewBody": "First time I ever cooked prime rib was this way. Roast was raw, the rest of the dinner was ready, it was a disaster. Meat so salty could barely eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Steven Kapustka"
},
"reviewBody": "This is the worst recipe ever. Anyone who'd cook a Prime rib roast to 145 degrees needs to have their head examined. Anything beyond 120-125 is well done. Remember, you can always cook some slices more if needed but you can't reverse the process."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fiddleddd"
},
"reviewBody": "I want to make this but I have a question. The recipe says to put the salt on the bottom of the foil. But then it never says what to do with the foil. Do you wrap it around the meat or do you leave the roast open? Thanks! Sorry, I had to leave a star rating in order to post this. I left 5 stars even though I haven't tried it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OMA8"
},
"reviewBody": "Make sure to use coarse ground salt. I have been BBQing this with a whole tenderloin for 50 years. Wrap in thick brown paper and throw onto the coals. The salt crust just cracks easily and it is the best steak ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Kat"
},
"reviewBody": "In a word....Fabulous!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie MacRae"
},
"reviewBody": "I've made this several times it is so flavorful, but it is our indulgent treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Reed"
},
"reviewBody": "I have never cooked a whole ribeye, and I was pretty nervous about this, and worried I would ruin such an expensive portion of meat. It turned out absolutely amazing. One of the most delicious things I have ever cooked! The family loved it. Followed the recipe as directed. It was a thing of beauty :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Law"
},
"reviewBody": "Turned out great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NavyMom"
},
"reviewBody": "This is a wonderful recipe! Do not be afraid to be generous with the kosher salt. In order to form the salt crust, you must lay it on thick. The crust which will indeed break off easily once the roast has cooked and cooled down. If you fail to add enough salt to form the crust, you will end up with salt saturated meat. One minor change I made was to slather the meat with olive oil and chopped garlic prior to salting. Excellent taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cardwhiz"
},
"reviewBody": "Great recipe, no changes needed. The kosher salt crust came away in chunks, try this one, yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jacqueak"
},
"reviewBody": "Served this for a small dinner party and received no complaints. The meat was tender and juicy and only the end piece was \"to salty\" ( I did not get all of the salt off the posterior end area prior to carving ). I did follow the recommendation to moisten the meat with water to get the salt to stick to the edges and sides, this worked really well to create a \" total encrusting .\" My rationale for giving this 3 stars vs. 4 is that by using the salt encrusted method you do not end up with usable drippings for au jus. I made au jus from beef broth using another recipe and it was not bad, however, I do like using drippings for sauces and graveys."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patrick Campion"
},
"reviewBody": "Flavor was delicious, and meat was juicy and tender. However, it needed to be pulled from the oven at a lower temp. It continued to cook past where I expected it to, even using the meat thermometer. I pulled it at 140F and it was medium rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Bliss"
},
"reviewBody": "I made this last year and am making it again this year, and will continue to make it because it truly is the best, juiciest prime rib! Sounds crazy, but it is delicious! You have to make a paste with the salt then apply it to your prime rib and then gently put in the oven. You don't want the salt to crack , then when done scrap off the salt and place on plate for carving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIM Kay"
},
"reviewBody": "It turned out great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Ann Metzger"
},
"reviewBody": "I only sprinkle the rock salt all over. a fair amount, then there is no taking it off, it's perfect and not too salty. Also, like some others, if you want rare/medium rare, then you only cook 115 to 120. it will rise another 10 degrees as it sits. if you want medium to we'll then cook longer, but that's kind of a waste for such a great cut of meat. There is another recipe on this site that is reverse seared prime rib. It's the best way and I tried a few. you will love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie Zimmermann"
},
"reviewBody": "FABULOUS! Followed the recipe to the letter. After 4 hours in the oven, my meat thermometer read 150 degrees after done a 4 pound roast, but it was perfect! Juicy and pink throughout... succulent! My husband said it was the best Easter dinner he had ever had! Looks like it'll be Prime Rib instead of a ham each Easter from now on! Thanks for posting the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBagLady"
},
"reviewBody": "Made a rib roast before with another recipe and was sooo disappointed at the waste of money and time. Made this for Christmas eve family formal supper. 11.5lb boneless rib roast. Bought 4 10oz containers of kosher salt, added water to make a \"paste\" of sorts and OMG...... This was the Bomb! Tender, Juicy, Flavorful and not salty in the least! My whole family adores me now, Thank you for an awesome recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chpdj"
},
"reviewBody": "This recipe is the BEST! The roast came out perfect. I unfortunately \"over cooked\" it which just means for us instead of medium rare it was medium. This is how I'll be making all of our prime ribs from now on. Btw I used a 7.5 lb roast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat D."
},
"reviewBody": "This is the best, juiciest roast that I have ever made! Like others, I added a little water to the salt to make it more paste-like and I covered the roast in cheesecloth. I seasoned the roast with finely chopped garlic. I took it out of the oven when it reached 120 degrees, which was \"blood rare.\" The end pieces were a bit salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Garland"
},
"reviewBody": "Amazing recipe and right on the money. Yes, it is a little on the salty side. However, the end results is a perfect, restaurant quality Prime Rib. Whether you sear it first, rub mustard on it, or add whatever you want to the rub mix, the low and slow cooking method on top of a bed of kosher salt leaves you with an extremely tender and flavorful roast. \nIn fact, at one party where I cooked this meal a couple met and later went on to get married. Was it the roast or love at first sight? Who knows, but at their wedding reception they served Prime Rib :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Tuschinski"
},
"reviewBody": "Absolutely the best prime rib roast ever!! And easy! Has become a favorite in our family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxana Cintrón Moerscher"
},
"reviewBody": "I have been using this recipe for a few years and the roast comes out perfect every time. I do rub the roast with minced garlic and pepper, but that's just to add more flavor (not that it needs it) because my family loves garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kierok"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Flory"
},
"reviewBody": "I fix this at least once a year. it is easy and offers the same cut of prime rib to everyone. We take ours out around 130, as it continues to cook in the pan, we all like our prime rib med rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Decolongon"
},
"reviewBody": "Made this recipe for 6 people (3 bones ~9 pounds) had the butcher remove the bones then tie back on. Don't worry about the amount of salt used! Crust cracked off nicely! Since I was short on time I cooked it at 350 for 20 mins then decreased the temp to 270 for 3 hours until the meat thermometer hit 130. I removed it and let it rest for 30mins before cracking the crust off and slicing. It was a perfect med rare. Key element is to use all the salt the recipe asks for (I added water to the salt to make a paste so it would stick better) and follow the meat thermometer! the prime rib was soo juicy that the au jus I made on the side wasn't really needed. I won't look at any other recipe besides this. It was a success for my first time making prime rib!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La Gringa Gourmet"
},
"reviewBody": "Simply amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "Absolutely the best ever....took out at 135 for perfect med rare...otherwise the recipe was followed to the tee..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kandie Sampson"
},
"reviewBody": "Did a 6 lb roast. Wonderful!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cheryl Fenner Brown"
},
"reviewBody": "Followed the recipe but at 145 the meat is WELL-DONE! Will try it again and cook till 120."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elk Country Homes"
},
"reviewBody": "For the minority of people who didn't like the recipe I can only guess that the salt wasn't applied correctly, a meat thermometer wasn't used or possibly just a bad piece of meat to start with. \n\nFor the meat thermometer, invest in one that I digital with a probe the inserts into the meat and a small heat-proof cable that goes to the digital part and allows you to monitor the thermometer without opening the oven door during the roasting process. Mine was around $25 and is well worth it. Ignore the clock an pay attention to temperature. \n\nSecond, there seems to be such an issue and debate with the salt and maybe this will help. Just remember back to when you were a kid and you would go to the beach. Remember how the soft, wet sand felt? Remember the consistency that made the best sand castles? That's what you're aiming for here - get the consistency of your salt to the consistency of wet sand and then 'entomb' your meat in the wet salt. I can hear it in the reviews - people are trying to rub it in or sprinkle it on and it's not working, the roast is coming out salty and that is why. Hope that helps! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRFHRLAW"
},
"reviewBody": "Fantastic taste - easy to do! Did a 5.5 lb oven-prepared prime rib roast for Oscar night, seasoned the roast all over with pepper and a package of Lipton onion soup mix,then pasted on a mixture of coarse kosher salt, Montreal steak seasoning and water. I roasted at 425 for 20 minutes, and then at 215 until the temperature reached 140. I let it sit for 15 minutes, cracked/scraped off the crust, and it was perfectly medium, tasty and juicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I thought I had kosher salt but I only had coarse sea salt - result was excellent - family loved it - tender and juicy. Salt brushed off easily. Will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "Amazing! I am a foodie and this was amazing! Best ever so far. I just coated the Prime Rib with butter than salted the #$@# out of it. And yes, like the other reviewer said, it does look like a snowball when you are done! And yes, even though the recipe doesn't specify, you DO coat the cut ends with butter and your seasonings if you choose and then the kosher salt. I brought the roast to room temp before I through it in the oven. It was a five pound roast and at 215 degrees F it reached 130 degrees F in 2.75 hours with browning at 425 degrees F for the first 15 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NBAS"
},
"reviewBody": "I have been making this recipe for Christmas for the past four years...everyone raves about the meat. The salt layer under slow heat does form a crust that is easy to remove. One thing I have noted is that small end of standing rib roasts (while oh so great quality beef!) lack fat at the top of the roast or some butchers cut it down. I get a quality large end roast with a SMALL TO MODERATE (can't see the pink of beef shining through) amount of fat layer on the top and find it helps to keep the meat from becoming salty. The fat heats to form the crust layer with the salt. It and the fat peel back to reveal the most juiciest rib roast ever. Hope this helps. Making it again tomorrow....enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin73"
},
"reviewBody": "We tried this this recipe years ago while camping it was so moist and tasted so good and not like salt at all. Will do this again for christmas this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily blemily"
},
"reviewBody": "This recipe is delicious. I made it for Easter and received tons of compliments!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DARLENEBUTTOLPH"
},
"reviewBody": "Will do again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aaron"
},
"reviewBody": "I’ve made this 5 times and it’s actually really amazing. Having said that, I did marinate it for 3 days in a vacuum sealed bag full of Traeger Prime Rib Rub, olive oil, minced garlic, and sage. I mix them all together and make a paste. Then I cover it in Kosher Salt. I use 4.5 lbs for 3 adults."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "Very nice and moist beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cakedecr8r"
},
"reviewBody": "The most amazing prime rib I have ever had!!!! I rubbed the meat with montreal steak seasoning prior to the salt rub. It added extra flavor! Super tender, melt in your mouth, restaurant quality results! This is the only way to make prime rib!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doddie111"
},
"reviewBody": "We purchased a much bigger roast....so baker be ware, cooking a 10 lb roast took us 8 hours. On the flip side everyone was so hungry that they said it was the best prime rib they ever had. I was a little nervous about the salt crust but be assured that it will literally peel off....no worries ;) LOVED IT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndyH"
},
"reviewBody": "are you afraid? why are you reading the reviews then? do it correct and you will not taste the salt. i am really bad about following recipes, i cant even follow my own, but i do use them for a guide and this is an awesome guide. i peal and slice about 1-2 heads (yes heads, not cloves) of garlic and insert into meat (avg of 8-10lbs roast). generously coat with approx 1-tsp each dried basil, oregano, thyme, sage and chicken bouillon. leave uncovered in frig over night. set on counter early am and rest at room temp for at least 5 hours. lightly coat in olive oil (lightly!). mix +/- one cup water per 3 lb box of \"kosher\" salt, to make thick paste. cover all sides, including bottom and sides. quick roast at 500 deg for about 10-15min, turn down to 210 and cook till thermometer reads 10 degrees below desired doneness, will cook while resting. IT MUST REST REST!!!! the salt will lift off like a helmet and you will not taste it. if you want gravy, make with bouillon, the drippings are not good for gravy. i have made this recipe several times, it is by far the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmy13"
},
"reviewBody": "I served this roast for Easter Dinner a few months ago, and everyone LOVED it! There is no danger of over-salting because the crust comes off after cooking and the meat is amazingly tender and flavourful underneath. I bought enough to feed eight people (there were only six of us), and the entire roast was GONE...no leftovers! I definitely plan to serve this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wisedusty"
},
"reviewBody": "I'v done the roast this way for years, except I sear the roast on all sides in a large frying pan first. I also, roast at 250 degrees, and take it out, when the temp. reaches 125 deg. rest for 45 min. covered in foil. I tie the roast between the ribs, so that it doesn't come apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Childofchaos"
},
"reviewBody": "Excellent! We used a 6lb roast and baked for the full 5 hours. It came out perfect. We also moistened the salt to a moist sand consistency so it would encase the meat better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn G"
},
"reviewBody": "Forgot to add in my original review that I did tweak this a little, I added water to the salt and made a paste, which I then applied to the roast. This way after baking the salt little made a hard crust that I was able to break right off with no residue on the meat. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msnopkowski"
},
"reviewBody": "I have made this twice and it turned out perfect both times! I gave this recipe to a new bride who was freaking out about making dinner for her husbands family.. It couldn't be easier. Everyone at her dinner asked for the recipe.. Thanks for the post"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Henning"
},
"reviewBody": "This is fabulous! I've never made a salt crust it definitely made a very tender roast.\nThis is the only way I'm going to make prime rib from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cookerholic"
},
"reviewBody": "Way too salty. I ruined a great piece of meat and our special Valentine's Dinner. Don't try this one unless you want to waste $40.00!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irlandese"
},
"reviewBody": "Unbelievably juicy!! I'll never cook a prime rib roast any other way than this. I like it rare/medium rare, so I took it out at about 130F and let it sit for a half-hour. Was perfectly pink throughout."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redzinf40"
},
"reviewBody": "I marinated my 8 pound plus prime rib for 2 days in an olive oil spice concoction. I made my kosher salt snowball and baked it to 138 degrees. My mistake was letting it rest for 20 minutes. My family likes their meat medium rare, i.e. pink with no blood. The thermometer read 150 and was more well done. Like i said, my mistake. If there is a next time, i will serve it immediately. I felt as if i wasted $70."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gutschke"
},
"reviewBody": "The roast turned out great, but I made a couple of improvements.\n\nI marinated the prime rib with olive oil and rosemary for two days prior to cooking.\n\nInstead of black pepper, I used a dry rub of ground green and pink peppercorns and ground coriander seed. Just put all the dry ingredients into a coffee grinder. I also coated with a little bit of a vegetable-based garlic spread. That's easier than trying to make garlic cloves stick to the meat.\n\nWhen done, I served with a basic gravy made from a dark roux (margarine &amp; flour fried at high heat), beef broth, au jus concentrate, red wine, and juices from the roast. Everybody commented on how well the gravy turned out, despite the fact that I didn't have any beef drippings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CUTEUTE"
},
"reviewBody": "SO perfect! This recipe yields a perfect prime rib from end to end, be sure your thermometer is in the center, not touching a bone. Also instead of the seasoned salt we use montreal steak seasoning and some garlic powder with the pepper, then cover it with kosher salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "P Duke"
},
"reviewBody": "very good, family loved! Hard to get the salt to stick even with lots of water"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise D"
},
"reviewBody": "FABULOUS, I'll never make prime rib another way again! My roast was 5.08 lbs and took approx. 5 hours at 210F. Like others had suggested, I made a paste with some water to make my salt crust. The salt just breaks off in chunks after resting. I allowed my roast to rest sitting in my microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Proudmama"
},
"reviewBody": "Well, if you've read one review, you've read them all and ours. Excellent recipe, used one reviewer's help and created a \"paste\" with the salt. TY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant"
},
"reviewBody": "Awesome! Very easy. Wet the Kosher salt down a little to make it pack better. My cut was a little under 5lb and time was still spot on as we like a little more on the rare side of medium. Let sit covered with a towel loosely in the microwave for about an hour and the temp when cut was perfect. My first attempt so will go with a larger cut with more people now I have the confidence! Used a dry mix Au Jus sauce because you cannot make one from the drippings. Get a good horse radish sauce as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda K"
},
"reviewBody": "Terrific!! On the cut ends I coated with butter. And I preheated the oven to 450 and cooked the prime rib 15 minutes and then turned down for the rest of the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "placer pond"
},
"reviewBody": "add some fresh sage or rosemary while cooking(even better)fresh garlic will dry the meat out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenifer Good"
},
"reviewBody": "i started 25 years ago cooking my Christmas prime rib in this manner. needless to say, it is something we look forward to all year....it is AWESOME!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole in TX"
},
"reviewBody": "This was so moist and tender but salty! I did scrape the salt crust off, but the flavor was still very powerful. I will try it again with just the pepper and seasoned salt and see how it goes. The meat almost melts in your mouth. I used a round eye rib roast from Sam's Club for the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jammie Lynn Smith"
},
"reviewBody": "This was deliciouse! Just like at a really good steak house!! My fiance and I loved it....we had no left overs...I only used a 2 1/2 lb rib roast tho. Sooo good. def. make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck"
},
"reviewBody": "I make this a couple times a year. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawncc12"
},
"reviewBody": "this was the BEST I've ever had!!! Used a 5 pounder and cooked for almost 6 hours.....just fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chef-boy-r-dee"
},
"reviewBody": "I followed the recipe to a 'T' and my family found the roast very salty tasting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hendotoo"
},
"reviewBody": "Best yet. Well worth a try. My fam loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pverzal"
},
"reviewBody": "I tried this with boneless ribeye roast instead of prime rib. Amazing! My husband can't quit talking about it... he even picked up another roast this week so I can make it again. He loves making sandwiches with the leftovers :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinksnowflakeliz"
},
"reviewBody": "Amazing! I made another prime rib recipe years ago from this site that got great reviews, however I wasn't that excited about the outcome. This recipe, however, is the winner. It was so easy to prepare and cook - no needing to baste or do much prep work other than light seasoning and covering in salt. It also doesn't heat up your kitchen! Always buy the top grade beef you can afford, and you can't go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perri Pender"
},
"reviewBody": "Add me to the list of happy prime ribbers! This was one of the best I have ever cooked. I did add water to the salt and for fear of it being to salty(yeh i know I read ALL the reviews and yes it is not salty!) I took cheese cloth and wrapped it twice around the middle, this protected the end pieces, to get the salt to stick on the cheesecloth i put olive oil on it and the salt stuck perfectly! The top and the bottom did not have any cheesecloth and the salt made a perfect crust. When I removed it 125 let it sit 20 minutes, removed the salt crust and popped back in the oven at 350 for 10- 15 minutes, I prefer my prime rib warmer, It was cooked perfectly, everyone RAVED! took it out at 135 degrees medium rare perfection. When cooking prime rib YOU MUST USE A THERMOMETER!! period! it was tender juicy and had a wonderful flavor. I sprinkled garlic powder all over it before I put on the crust, for those disappointed on no ajus, just buy \"Johnny's Au Jus\" located somewhere around the BBQ sauces and ketchup in your local store, it is concentrated and is way better than Au Jus I can make and is 100 times better than the pkg mix!! Problem solved! Enjoy and try this don't be scared it is wonderful!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna"
},
"reviewBody": "I made this for our Seder meal at church and everyone just raved about it. I was pretty shocked myself on how well it turned out! I used a 15 pound roast and it was boneless and still only used about 2 cups of salt. I also cut slivers of garlic and stuffed down inside the roast. It was amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Subvet"
},
"reviewBody": "I followed recommendations from other members by moistening the salt in order to aid the crust formation. I also kept salt off the ends to eliminate oversalting those pieces. Furthermore I started with an oven preheated to 500 degrees, cooking the roast for 5 minutes before lowering the temp to 210 for 4.5 hours. \n\nThe roast came out wonderful.\n\nThe next time I'll have it sit on the sideboard for a while at room temp. That seems to also help. \n\nAll in all, a very good recipe and worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KissTheChefette"
},
"reviewBody": "Delish! I didn't crust properly, but it still came out really good. The parts that were crusted properly were amazing! It gives me incentive to keep trying, bc even the mistakes are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "South Carolina Girl"
},
"reviewBody": "Followed the instructions and this rib roast came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danni Skaricki"
},
"reviewBody": "Amazing....it's about all I can say! I use this all the time for holiday dinners! It's on request every single year! :)\n\nThanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gmsusie"
},
"reviewBody": "Amazingly perfect and delicious -- next time I will not put the salt on each end -- those pieces remained very salty tasting. I cooked it to 135, and it was perfection. Can't wait to do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "h8nlyfe"
},
"reviewBody": "Easy and very good.....you cant mess it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Brown"
},
"reviewBody": "Best prime rib I've made. Kept two digital thermometers in the meat while baking and pulled it out around 125-130 (thick-thin side). Flavor was awesome, even better with custom horseradish cream and fresh grated horseradish on the side). It was excellent and even the foodies at our dinner for 12 were pleased."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17143/kosher-salt-encrusted-prime-rib-roast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
"name": "Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17143/kosher-salt-encrusted-prime-rib-roast/",
"name": "Kosher Salt Encrusted Prime Rib Roast"
}
}
]
}
}
, "about": [
]
}
]