				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Kulfi"
,"datePublished": "2000-07-13T10:57:38.000-04:00"
,"dateModified": "2022-12-07T21:39:42.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Simmi G"
,"url": "https://www.allrecipes.com/cook/simmi_g"
}
]
,"description": "Cardamom flavored frozen dessert made with condensed and evaporated milk, white bread and whipped topping."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/XFhOqHKWqiUPHjPYtZr5UCOFSqQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/736349-kulfi-Leisha-1x1-1-27872b0a38bc4766bdb3217d3a7f214f.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5767780096001",
"description": "An easy recipe for Indian inspired ice cream!",
"duration": "PT47S",
"name": "Kulfi",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/5f2a3ae0-f3dd-44b1-aca4-6e18ea61ece2/d21a268d-fe17-4d9a-9411-d5752cc21d5f/1280x720/match/image.jpg",
"uploadDate": "2021-07-17T05:30:26.874-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Kulfi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "119"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "139 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "9 mg"
,"fiberContent": "0 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "67 mg"
,"sugarContent": "15 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.25 cups evaporated milk",
"1.25 cups sweetened condensed milk",
"1 (16 ounce) container frozen whipped topping, thawed",
"4 slices white bread, torn into pieces",
"0.5 teaspoon ground cardamom" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine evaporated milk, condensed milk and whipped topping in a blender and blend in pieces of bread until smooth."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/XFhOqHKWqiUPHjPYtZr5UCOFSqQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/736349-kulfi-Leisha-1x1-1-27872b0a38bc4766bdb3217d3a7f214f.jpg"
}
]
,"text": "Pour mixture into a 9x13 inch baking dish or two plastic ice cube trays, sprinkle with cardamom and freeze for 8 hours or overnight."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT500M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CRNAsarah"
},
"reviewBody": "I halved this recipe (which was still plenty) and incorporated cardamom into mixture as well as sprinkled some on top. I thought it set way before 8 hours in the freezer and it tasted amazing. The sweetness from the cream and milks goes so well with the spice flavor. I will definitely make this again and may play with the flavors by adding rose water or pistachios as some have suggested. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Marshall"
},
"reviewBody": "Stuff is packaged differently in Canada so...\n\nI used a 354ml can of Fat Free Evaporated milk, a 300ml can of Sweetened condensed milk and a 1 l tub of frozen topping. Instead of bread slices I used a large kaiser bun. I incorporated 1/2 the cardamon and a 1/2 cup of pistachios into the mix. I sprinkled the remaining cardamon on top. My blender was too small so I used a larger food processor. \n\nIt turned out great with a nice texture and flavour. Next day I let the frozen mix warm up in the fridge for a 1/2 hour and transferred to a covered container."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "F.P"
},
"reviewBody": "This is just perfect!!!!!! I used to make kulfi from normal milk and the stove and i wouldnt get"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "Almost perfect--All that needs adjusting is the amount of bread to add into the mixture and amount cool whip. 4 slices of bread is too much, imo. Next time I will just add 2 slices. I only used 8 ounces of cool whip and that was just right. Any more, and it would've been too sweet and the texture would have been off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Giddens"
},
"reviewBody": "I decided to introduce my sister and her family to Indian food, and made this for dessert. Adding bread kinda weirded me out, but it was really delicious, and had a unique flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney Gillihan"
},
"reviewBody": "Did the same as other reviewers...two pieces of bread and one can of each type of milk. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spence3787"
},
"reviewBody": "So simple, rich and delicious - I did not use any bread since I wanted more of an ice cream texture. Also used 1 pint heavy whipping cream instead of frozen. When the whipping was almost finished, I added the Evap. and Cond. milks and whipped just enough to blend. Then stirred in about a cup of chopped pistachios"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adeela Zaidi"
},
"reviewBody": "I tried this receipe and my family loved it ,my kids wants me to make this everyday ,very easy to make and veryyyyyy yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMPhil"
},
"reviewBody": "I made this for my dinner group where we choose a theme and all contribute a dish. It has expanded my repertoire immensely, trying new cuisines. It was simple to prepare and everyone loved it, but I have one complaint in the preparation instructions: the ingredients will not all fit in a standard 5-cup blender! I had to do the first few ingredients, then, when I realized, transfer to a large bowl and blend in the Cool Whip with my mixer. I think that the next time I will just cut the recipe in half, as the 9x13 dish fed a large group and there was about 1/4 of it left.\nI sprinkled the cardamom on top a little at a time through my sifter, shaking and moving it around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CS"
},
"reviewBody": "This was really easy &amp; tasty. I only made half the mentioned amount though. I did read everyone's reviews &amp; made necessary adjustments....like grinding cardamon with the milk. I also added pistachios. The only criticism was that it was extremely sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mokpochica"
},
"reviewBody": "As others have said, this is an easy way to make ice cream without an ice cream maker. My sister bought me a bunch of cardamom from Sweden and I went looking for recipes and found this one for kulfi. So glad I did! My kids love helping me make it. I read the reviews and ended up making it with 1 can of sweetened condensed milk, an 8 ounce package of cool whip, a can of evaporated milk and 2 slices of white bread. The kids couldn't wait to eat it, so I added a bunch of ice cubes and made it into a shake. It was super sweet, but very tasty. This second time I've made it with 8 ounces of half and half in place of the cool whip and I added about 3 tablespoons of sugar. I think this batch will be just right. I put it into popsicle molds for the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wicksy"
},
"reviewBody": "I'm not really familiar with \"traditional\" Kulfi but this works for me; other than the fact that I abhore whipped topping. I whipped my own cream, and that may also solve the problem for people who find it too sweet, as I'm sure whipped topping has plenty of sugar. I also topped with ground pistachio's and almonds. No grainy texture at all as per some reviews. I removed the crusts from the bread and blended thoroughly with about a cup of evap milk before adding the rest of the ingredients. People at the dinner party loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huma"
},
"reviewBody": "Excellent, have shared this recipe with my family and it turns out great. Although, before freezing to avoid crystals on the kulfi, cover tightly with saran wrap and snap on the lid"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrea92fl"
},
"reviewBody": "I loved the taste of this! I didn't have white bread so I used wheat and still tastes good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CreamPuff"
},
"reviewBody": "Ohhhhh my this is some good stuff! I suggest you store in a plastic container with a snap-on lid as to keep the freezer taste/smell off your kulfi. Of course, if you're like us, you'll eat it up before that can happen anyway - but it makes a lot, so you might think about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawne"
},
"reviewBody": "This is one of the best recipes ever!!!!It turned out delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mehitabels"
},
"reviewBody": "completely easy to make, super sweet, a spoonful makes a perfect sweet tooth satisfier. a bit messy to remove from ice-cube trays, but stores well. didn't have cardamom, used cinnamon on one tray and nutmeg on the other, plus used wheat bread which gave it a nuttier flavor. excellent and easy - thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarkAngel"
},
"reviewBody": "My husband could not stop raving about this one. It's very similar to how my mother used to make it, but I can't remember if she added cool whip. I took other reviewers' advice and added an 8 oz. container instead of 16 oz; one can of evaporated milk, one can of condensed milk and two slices of bread instead of four. I didn't have pistachio so after I was done blending the ingredients I stirred in some slivered almonds, which tasted great as well. Thanks for an easy and wonderful recipe that reminds me of childhood!\nUpdated 07/29/2016 - so today I only had the Pepperidge Farm Very Thin white bread slices. I had to actually use four of these. I think if the slices are thicker, two are fine. I also toasted slivered almonds before adding them to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "constructiongal1"
},
"reviewBody": "Out if cardamon, used 1/2 cinamon and allspice. Goes great with gingerbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dad2twins"
},
"reviewBody": "I have never had Kulfi, or even heard of it for that matter, but when I read the recipe it sounded so refreshing I had to try it. I read some of the comments and it did fill the entire blender so I needed to slowly add the whip topping in batches while pulsing, but a couple of extra minutes and some patience was greatly rewarded. This recipe is extremely easy to follow and produces the creamiest and smoothest ice cream I have ever had. I did need to substitute cinnamon for cardamon but I don't think it lost anything. Thanks for the great recipe we now have a new summer staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pennycandy"
},
"reviewBody": "I like trying new recipes, so I gave this one a shot. It was easy to make, but had to hand stir in the most of the whipped topping because it was too much for my blender ( holds 7 cups). I have never used cardamon and was shocked at the price, luckily the store sells it in bulk so I could buy only the amount needed. As for the taste, it was very light, but I had a hard time getting past the grainy texture, I assume is from the bread. Not sure if I will be making this again, but if I do I will make a few changes and play with it a bit. Maybe cocoa or espresso powder in place of the cardamon and omit the bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "christieellen"
},
"reviewBody": "Just okay. I found that the bread gave it a weird texture. To me it tasted like bread dipped in sweetened condensed milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britni"
},
"reviewBody": "We were having a Indian themed dinner at our house so I decided to make this for dessert. It worked really well to use one can of evaporated milk, 1 can of sweetened condensed milk and 1 (8 oz) container cool whip. I also added 1/2 teaspoon cinnamon along with the cardamom. Everyone loved it! It tasted like chai tea in ice cream form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashlou"
},
"reviewBody": "Fast and easy, though I have a feeling this isn't how they make it in India..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guljan"
},
"reviewBody": "WOW- this was sooo good! Seriously I was so surprised how much it tasted like REAL kulfi. Yuum, I would gave never thought it was so easy to make! Will be making this for everyone I know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Tastes like authentic kulfi. My Indian bf was in awe that it tasted like authentic kulfi and wanted me to make it for his mom when they next visit from India. I wanted to try different flavors, so I divided the given recipe (including the cardamom) into different sections and tried the following flavors: cinnamon, rose (via rose water, which was the best flavor), pineapple (pineapple juice), and extra cardamon. They were all wonderful. I also used wheat bread as I didn't have white bread on hand, and it didn't make any difference. I also used 1/2 light whipped topping and 1/2 normal. My favorite flavors were the cinnamon and rose, although they were all delicious. I put each in portion sized little tupperwares with lids, making for an easy, anytime snack-sized dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FinleyJ978"
},
"reviewBody": "Great. Especially for kids, and easy to mak.e"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "very good, very easy. i followed the tips that one person put in to boil the evap, sweet, and 8 oz cool whip. then blended bread with 8 oz milk. blended all together, poured in a pan, sprinkled in almonds and cardamom on top. i was very skeptical of blended bread, but tried it anyway, and everyone loved it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "szc1219"
},
"reviewBody": "This recipe was absolutely amazing! We had over 70 guests and decided to make this kulfi for dessert and everyone LOVED it. Even my dad, who's a big dessert critic, said this is the best kulfi he's had since he was back in Pakistan. Some things I did differently (as mentioned by other reviewers) were to crush the cardamom and mix it in with the rest of the ingredients and add rose water. This kulfi recipe makes a great falooda too..just add some cooked, cooled, and partially drained angel hair pasta, water soaked tapioca seeds, and Ruhafza. This is def my permanent kulfi recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tooba"
},
"reviewBody": "I really loved this recipe. It was my first time making it and I got a lot of compliments for it. I think that the mixture was a pinch too sweet so I just added the left over evaporated milk that I had. It turned out perfect. I also topped it with cut pistachios. I let it freeze for about 4 hours and then topped it with pistachios."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MANDIEGIRL92"
},
"reviewBody": "This was excellent, I've made it three times now and just love the cardamom flavor. Making \"ice cream\" with bread is something the kids find fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nadia"
},
"reviewBody": "My dad has made this for my sisters,me and my mum many times. He's pakistani and this is also a pakistani dish. We love it and it is so easy to make. Just a month ago we went for a holiday in Pakistan. We enjoyed this tasty treat everywhere we went!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desicook"
},
"reviewBody": "This is an exceptional recipe, truly faithful to the original Kulfi. Like others, I mixed in the cardamom powder into the Kulfi. Other than that, it's mouth-wateringly perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "Unfortunately we weren't delighted with this recipe. It tastes like frozen sweetened condensed milk with cardamom. This an unusual dessert to try, but not so delicious as I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J. Marsh"
},
"reviewBody": "Good flavor! I used whole-wheat bread because it was all I had, and it made it a little gritty. Next time, I'll be sure to use white bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingdiva"
},
"reviewBody": "Awesome recipe!! I made this yesterday for the first time for some dinner guests and everyone raved about it. I did as another reviewer suggested and mixed 1 can fat free evaporated milk, 1 can lite condensed milk and 8 oz lite cool whip w/ 2 slices of bred. Also, I added 1 tsp of saffron extract, few strands of saffron and abt 4 tbsp of coarse ground pistachio &amp; almonds. The result tasted like authentic malai kulfi from India."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cre8ive Cook"
},
"reviewBody": "Amazing! I followed this recipe exactly and we all were blown away at how delicious it is. Easy Easy Easy too!!! Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave W."
},
"reviewBody": "One of my co-workers brought this in to work for the office gang. She substituted cinnamon for the cardamom, and everybody thought it tasted great !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Woolf"
},
"reviewBody": "Wow! This was so unusual and easy to make. It tastes very authentic and was wonderful served with and Indian meal I made. I wouldn't change anything, it's great for a change of pace."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Prommygirl"
},
"reviewBody": "This was excellent and SO easy to make. I didn't have white bread so I used one piece of sourdough and it came out delicious. My friends raved over this dessert. I used fat-free cool whip and fat-free sweetened condensed milk and added the cardamom and cinnamon to the mix. Upon serving, I add chopped pistachios on top and a chocolate wafer on the side! Great combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love2bake"
},
"reviewBody": "Wow...this is the best recipe I've seen so far. Extremely easy to make and it turned out perfect. Will be definitely making it again. Definitely try it, you can't go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valance"
},
"reviewBody": "excellent. very easy to make. kids enjoyed makeing it and it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VS"
},
"reviewBody": "Excellent recipe! My family loved it. I omitted the bread and it still turned out wonderful. Also, I added chopped cashewnuts, pistachios and almonds. CAN'T WAIT TO MAKE IT AGAIN!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodLover"
},
"reviewBody": "I really didn't think something so easy to make could come out this DELICIOUS! So creamy, so yummy- this is really the best ice cream out there. Thank you so much for this awesome recipe. \n\nYou all have to try this one!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly McNamara"
},
"reviewBody": "Made this for a 5th grade school project- my son had to take in something from India for the class to taste. This went over very well! I did not want to spend $8 on the cardamom, so I added a rounded tablespoon of Tastefully Simple's chai (which has cardamom as an ingredient) Tasted very good! The texture (with the bread) is a little grainy, though...not sure if that is the way it is supposed to taste or not since we have never had Kulfi! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natashasmom"
},
"reviewBody": "very easy to make and excellent results...I made a few changes..I boiled milk until it reduce by half the original volume, and then beat it well after adding condensed milk. I omitted the cream and evaporated milk and it still turned out very well...thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beginner_cook"
},
"reviewBody": "This recipe is AMAZING!.. it tastes just like the kulfi I've had in India. I was skeptical at first coz I thought it would taste icy-icy (sorta like frozen milk or something yuck haha) but I;m glad the frozen kulfi proved me VERY wrong :) Extra additions I made were: I used cardomom seeds from the pods and crushed them (even though they sunk to the bottom, it didnt alter the taste), I also sprinkled crushed saffron threads to the top before freezing (I used arabic saffron - its just soooo amazingly fragrant, and great after taste). Thats it, I didnt add any pistachios coz I had none. Also, the recipe calls for 10 oz each of condensed and evaporated milks. I used 14 oz of condensed milk and 12 oz. of evaporated milk (basically, the entire tin cans) and I forgot to buy whipped topping, so I just added about 4 oz of whipped cream (the yellow carton) that I had left and it made no difference to the taste. I froze my kulfi overnight... deeelicious. You have to try it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Ford "
},
"reviewBody": "VERY easy to make, and delicious. Everyone loved it. The only thing I would change next time is to mix the cardamom into the kulfi, rather than sprinkle it on top. I found the when I sprinkled it, some areas were a little more clumpy with cardamom, and that can be an overwhelming taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carrie Rose"
},
"reviewBody": "This is a very easy way to make \"ice cream\" that is easily customized. Unfortunately, I didn't like it. I could taste the bread and it didn't appeal to me. My husband really loved this recipe, however. I used low-fat ingredients and he still thought it tasted rich and decadent. I think this would be a hit with children (I was going to try it on my stepdaughter, but my husband finished it up)! I have never tasted real kulfi, so maybe this is a good approximation that deserves a higher rating. I won't eat it again, but I might make it sometime for family members since it's so easy to whip up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ammelyn"
},
"reviewBody": "Easy prep with deceivingly, decadent results. It was too sweet for my taste. But that can be adjusted next time by including less condensed milk. I used fat free evaporated milk and fat free whipped topping. Still quite rich. I made a batch with mango pulp and a few drops of rosewater. Ohh. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "capicu"
},
"reviewBody": "So good and so easy! I really like ending a good Indian meal with kulfi...never thought I could make it, until I found this recipe. I added approximately 6 TBLS mango pulp/puree (can find it at your local Indian grocers), and made mango kulfi instead. After around 8 hours in the freezer, it was still soft...like a soft serve ice cream. But, after leaving it in the freezer overnight, it was perfect. Can't wait to make it for my Indian in-laws."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "InspiredChef"
},
"reviewBody": "Very tasty and very authentic! My Indian friends couldn't believe that this was not the traditional Kulfi. It was a hit at the last potluck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shenadoah"
},
"reviewBody": "Who would have ever thought.......... this was incredible!! My son had to create an \"Indian\" dessert for a class project and this was a HIT. I went to school to help serve and all the kids agreed - this was the best dish there! Sooooo very easy and so very good! This made a lot (I filled 5 ice cube trays) and used miniture craft sticks to make it like a popcicle. Takes like a vanilla pudding pop. YUM YUM will definatly make over &amp; over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SIyer"
},
"reviewBody": "Excellent!! Easy, quick and fabulous results! Everyone thought it was professional grade Kulfi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marigat"
},
"reviewBody": "I was amazed at how the liquid mess I had created in my blender froze into a very ice cream-like consistency! I doubled the recipe, using two cans of sweetened condensed milk, two cans of evaporated milk, and four slices of soft Wonder bread. I also used six drops of yellow food coloring with two drops of red to create a light orange color. I'm already imagining how this will taste with some fruit or other goodie thrown in (maybe mango or raspberries or even coconut or nuts. Thanks for a great, unique dessert after a spicy Indian meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "p2009"
},
"reviewBody": "I found this recipe a few months back &amp; I have made it several times since. I just wanted to say thank you as it is the best recipe I have ever found. This is the quickest and easiest way to make kulfi. The original recipe is much more time consuming and complicated. I have gotten many compliments on my \"infamous kulfi\" and of course I refuse to share it. Even my older relatives (who know how to make kulfi from scratch) love it. Thanx!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook03"
},
"reviewBody": "this is so easy and tastes SOOO good!! everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenbook"
},
"reviewBody": "So easy to make and delicious. I served this to many of my Indian friends at work and they were quite impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angi"
},
"reviewBody": "This is incredible! I used cardamom and cinnamon and it turned out amazing. Thanks for the recipe!! We will have this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nila0"
},
"reviewBody": "I tried this recipe for a potluck and everyone enjoyed it, it was like icecream, too sweetish for my taste, but it is not like the traditional kulfi taste. i tried it with whole wheat bread and guests liked it, but white bread was more better. not like kulfi but a very easy and good recipe. i also added little saffron."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I must admit I was a bit suspicious about a dessert with white bread in it, but this is fantastic! I made it once on a whim because I needed a quick dessert for a dinner party and all my friends loved it! EVERYONE will be asking for the recipe. Do try it with 1/3 c. chopped pistachios."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KASHMIRIGIRL"
},
"reviewBody": "Great recipe, almost like my mom's. We use one can each of the ev. and condensed milk, 8oz of cool whip and 2 pieces of bread.\r\n\r\nAlso I've added pistachios and almonds minced to the recipe. Another great idea is adding food coloring, you can stage freeze different colors for a rainbow kulfi effect too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cookiemonster"
},
"reviewBody": "Wasn't the best. A little too sweet for my taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAUJLA52"
},
"reviewBody": "I made a few changes: I grounded up the cardomom seeds cuz I didnt have any powder and added cinnamon. A wonderful recipe - it was a hit with everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "EGGIWEG"
},
"reviewBody": "Very good, but much better with a few changes. I thought the original recipe came out too sweet, and the cool-whip gave it a strange, gummy texture. The second time I made it, I scalded (almost boiled) the evaporated milk, sweetened condensed milk, and 1 1/2 cups whipping cream with 1 teaspoon cardamom seeds (instead of ground cardamom). Then I blended 3/4 cups regular milk with the bread. I strained the scaled milks into the bread mixture to remove the cardamom seeds, and it in the fridge to cool off. Then I put it in the ice cream maker... it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent! I've never made Kulfi before, but in the past two weeks since I've discovered this recipe, I've made it twice already. I did as suggested and substituted fat free evaporated milk and Cool Whip Lite. I also blended the bread and Cool Whip first to avoid overflowing the blender too much, then added the milks. I also had some trouble sprinkling the cardamom without clumping it, but managed it by finger sprinkling it. I sprinkled the cardamom on before freezing it. Swirling the cardamom into the top layer seemed to give it a bit more flavor. A fantastic recipe! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Emily Powell"
},
"reviewBody": "It was kind of gritty, that's my only complaint. Tastes kinda like vanilla....but not really lol. I might make it again, but probably not for awhile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SOAPSQUIRTLE"
},
"reviewBody": "Perfect!!! I substituted the evaporated milk with fat free evaporated milk and the same for the whipped topping. It came out wonderfully. Its a constant demand in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RIKELLE"
},
"reviewBody": "I thought that this turned out very nice. It had a nice taste and texture but was a little sweet for me. I added groung pistachios and it tasted very close to my favorite dessert at an Indian restaurant. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANA4"
},
"reviewBody": "Great recipe! I tweaked it up a little bit by doing the following: I first took whole cardamom pods (skins removed), 1/4 cup pistachios, and ground them up in a coffee grinder until powdery. Then I added it to the blender with the remaining ingredients, plus 1/2 teaspoon of rose water. Also, I used Light whipped topping. It tasted great! Everyone loved it, and I have already made it twice in the past few days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S107S"
},
"reviewBody": "This recipie finally satisfies my kulfi cravings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WOW! my husband is super picky, as is my father, when it comes to food...and they both gave this rave rave reviews, please do try it, its super easy, and very very yummy :) also, i used fat free evaporated milk and 2 8 oz tubs of cool whip fat free topping...trying to make this a healthier version of the Indian Kulfi. I also added one cup of pistachios in the blender with the rest of the ingredients, and then after pouring the mixture in the tray, added some whole pieces, tasted sooo...good and very authentic! ~ sema"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMCGINNIS"
},
"reviewBody": "An easy, different, and tasty creation. Definitely worth trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Yummy. Being a food snob, I didn't like the idea of using \"whipped topping,\" but it's great in this. I didn't have cardomom powder, but used cardomom seeds by simmering them along with a bit of cinnamon stick and a couple of cloves in the evaporated milk, then strained them out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKSMALLEY"
},
"reviewBody": "I am part of a supper club and our theme this month was Indian. I was assigned the dessert and brought this recipe. Everyone loved it! I added the cardamom and cinnamon right into the ice cream (as another reviewer suggested) and I sprinkled each person's serving with chopped pistachios. It made for a very pretty presentation. It was almost embarrasing how easy it was!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRIDS00"
},
"reviewBody": "Awesome!! It tastes exactly like the kulfi you get in India! Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prema"
},
"reviewBody": "This kulfi recipe was very delicious and so easy to make. I made it for a large gathering, and everyone loved it. I added rosewater, cardamon, and a few saffron threads (which I'd soaked in a little bit of hot water so that the color would be released). The finished kulfi had a nice, light golden color. I also took note of a previous reviewer and sprinkled the pistachios on top, so that they wouldn't sink. Excellent! Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chocolate Moose"
},
"reviewBody": "YUM! I omitted the cardamom and substituted 1/2 cup crushed pistachios. Then I put everything but the evaporated milk in the blender. I mixed the milk in last so the blender wouldn't overflow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Bayramian"
},
"reviewBody": "OH MY! this was great! I have always loved Kulfi in the Indian restaurants,but every recipe I found for making it was so involved! This is easy as can be &amp; so very close to the original. For an added taste-add pistachios.Scrumptious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is good simple recipe, I had never made kulfi before and didnt know that you could \"cheat\"! ;) It turned out great, eventhough i made some alterations, everyone loved it. I didnt have cardamom powder so i let the seeds simmer in half a cup of eveporated milk until it reduced to 1/4 cup and let it cool ( i used 1 1/2 cups eveporated milk instead of 1 1/4) and i used a 1 pint carton of heavy whipping cream and whipped it myself. I also added crushed pistachhios to the mix. this made 16 popsicles for me with a little bit left over which i froze in a small food saver. thanks for a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRAHMAN"
},
"reviewBody": "This was very good, but it almost overflowed my blender. I think next time I'll scale it down a bit. Also, I think it would taste better with the cardamom blended in with the ingredients instead of sprinkled on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SONALI_77"
},
"reviewBody": "Outstanding! I made this for an Indian get-together and everyone was asking for the recipe. I blended in rosewater and almonds and ran it through an ice cream maker for added creaminess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLOVERDALE1"
},
"reviewBody": "I have a friend from India she always makes the best dinners ever. She likes to kid me how Canadian I am but when I offered to bring dessert for our next dinner and brought KULFI \r\n(stored it in the frozen cylinder of my ice-cream maker and put that in a cooler) She was very surprized how well I had done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farzi"
},
"reviewBody": "Simply Excellent. I added some rose water and lotsof nuts(almond). It was even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEMASSEY"
},
"reviewBody": "Yummy and easy! I had to use my kitchen aid mixer because it wouldn't all fit in my blender. Also, it made a lot! I filled 2 ice cube trays and 2 8-oz. Cool Whip containers! Even my picky-picky husband likes this! Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best Kulfi I have had in years! My kids (who are very vocal critics of my wife’s culinary skills) think the world of this recipe. I have improvised on the basic process by adding crushed pistachio to the mixture. Roshan of Delhi would be proud of the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was very good. I plan to make it again. I stirred the powdered cardamom into the kulfi mixture itself, and then sprinkled coarsely ground pistachios on top of the kulfi when it was half-frozen (I was afraid that the pistachios might sink in if I did that earlier). I made 10 kulfis, not 24, but the servings were about the right size, I think. I poured equal quantities in disposable plastic cups to get the \"kulfi\" shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent, and simple. My daughter and her class were studying India, so we made it and she took it to school to share. The children (and teacher) really enjoyed it, they even sent a thank you note home. I gave the teacher a copy for future use. I tasted it too, it was like vanilla, but the Cardamom is in place of the vanilla beans. My daughter brought the spice to class too. Very \"Kid friendly.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAWNCANDACE"
},
"reviewBody": "This recipie was awesome! I had never made Kulfi before this and was a bit nervous. I made it for a get together where several of my friends recall their mothers making it for them at home and said it tasted just as good. But, I found it incredibly easy to make and absolutely delicious. I used cardamom and rose water for extra flavor and even used cinnamon with the cardamom on one batch. I blended them all together instead of sprinkling the cardamom and cinnamon on top aftwewards. Because I was having a Post-Valentine's dessert party, I added a few drops of red food coloring to one batch. I highly recommend this recipie to anyone who loves ice cream yet desires something different and more healthy! TO cut down on fat and not sacrifice taste, you can also use fat free sweetened condensed milk and low fat evaporated milk with fat free or low fat Cool Whip. It tastes just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best ice cream I've ever tasted and I love Haagen Daz and Ben and Jerry's!! I didn't have cardamom and it was too expensive, so I just sprinkled cinnamon and it was great! My inlaws never had Indian food and were skeptical at first, but they went home with the recipe. I highly recommend Kulfi. It's as rich and creamy as any premium ice cream and fun to make!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19834/kulfi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
"name": "Indian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19834/kulfi/",
"name": "Kulfi"
}
}
]
}
}
, "about": [
]
}
]