				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lactation Cookies"
,"datePublished": "2020-06-18T23:54:02.000-04:00"
,"dateModified": "2022-05-19T06:29:37.000-04:00"
,"author": [
{"@type": "Person"
,"name": "kfwarden"
,"url": "https://www.allrecipes.com/cook/9923416"
}
]
,"description": "These delicious lactation cookies feature brewer&#39;s yeast, wheat germ, flax seeds, and oats to help support milk production for breastfeeding mothers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1w4Nk8LKBpg9QHiZDm5bHpHtK8g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2018680-7192709dfbb147a89c933d3a36d09ccf.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4396000074001",
"description": "Whether you believe or simply need a reason to eat cookies, these are what the doctor ordered.",
"duration": "PT1M33S",
"name": "Lactation Cookies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/3b944a71-5e03-48a9-9bec-bfae3a22f846/8d7e4401-f311-4be6-8a5a-c6382afe090e/1280x720/match/image.jpg",
"uploadDate": "2021-07-11T17:40:43.025-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lactation Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "356"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "158 kcal"
,"carbohydrateContent": "21 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "107 mg"
,"sugarContent": "11 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons flaxseed meal",
"0.25 cup water",
"1 cup butter, softened",
"1 cup white sugar",
"0.5 cup brown sugar",
"3 egg yolks",
"1.5 teaspoons pure vanilla extract",
"2 cups all-purpose flour",
"0.25 cup brewer’s yeast",
"1 tablespoon wheat germ",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"0.5 teaspoon cream of tartar",
"2.5 cups old-fashioned oats",
"1 cup chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix flaxseed meal with water in a small bowl and let soak for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Beat butter, white sugar, and brown sugar together in a large mixing bowl until creamy. Add egg yolks and vanilla extract; beat to incorporate. Stir in flaxseed mixture."
} ,{
"@type": "HowToStep"
,"text": "Mix flour, brewer&#39;s yeast, wheat germ, baking soda, salt, and cream of tartar, in a separate bowl."
} ,{
"@type": "HowToStep"
,"text": "Add dry ingredients to the wet ingredients and stir until just combined. Fold in oats and chocolate chips."
} ,{
"@type": "HowToStep"
,"text": "Roll dough into walnut-sized balls and place 2 inches apart onto a baking sheet."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1w4Nk8LKBpg9QHiZDm5bHpHtK8g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2018680-7192709dfbb147a89c933d3a36d09ccf.jpg"
}
]
,"text": "Bake in the preheated oven until the edges are golden, 10 to 12 minutes. Allow cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Edits I made: I used plain flour instead of all purpose, and I used vinegar instead of cream of tartar. I added a little cinnamon. I didn't add wheatgerm because I didn't have any so I just added a little extra Oats. The cookies turned out nice, still sweet, I couldn't taste the brewers yeast at all. I actually flattened each cookie a little with a fork dipped in vanilla sugar before baking. I think they could be really nice with some dessicated coconut added so will try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My daughter just had her second child but before he was delivered, she sent the recipe and asked if I would make these cookies for her! They were gone within the week! She likes them plain, with chocolate chips and even with raisins. I’ve just completed the recipe a second time and expect a refill request next week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stokes21"
},
"reviewBody": "I didn’t go through ALL the comments but I wanted to post my changes in case anyone was wondering. My rating is not contingent on my changes, as they altered the recipe from the original, and that wouldn’t be fair. Although I made these for myself, a lactating Mother losing my supply after having the virus-that-must-not-be-named, I do have older kids and that requires sharing lol! My son has an anaphylactic egg allergy AND he has a gluten sensitivity. So I substituted regular flour for Anita’s Organic Gluten Free All Purpose and I substituted the egg yolks with the equivalent of 2 eggs worth (I wasn’t sure what to sub with for JUST yolk?) of Bobs Red Mill Egg Replacer. For the oats I used One Degree Organic Sprouted Rolled Oats which are certified gluten free. How did they turn out? They’re delicious! They are soft, not crunchy, which I really like. I do find the GF flour makes them fall apart a lot easier than regular flour, but that’s pretty typical of GF baked goods (I’m pretty new to this so I’m still experimenting with different flours and brands) If you need to go GF, this recipe still does not disappoint! Knocked it a star because I only used half the sugar based on another review, and I’m so happy I did because I couldn’t imagine using an ENTIRE cup of sugar in this. It would be way too sweet. All in all, fantastic, delicious recipe that I would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Nakagawa"
},
"reviewBody": "My best friend loves these! Honestly I did too. Lol these cookies and staying hydrated really helped her milk supply. We both were skeptical but shes pumping constantly. These cookies keep her happy and she eating overnight oats too. So it could be the combination"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "macooper865"
},
"reviewBody": "I just made these and I suggest using half the sugar. \nI’m waiting to see how they improve my milk supply."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nisha"
},
"reviewBody": "I followed the exact recipe for these cookies and I am very pleased with the outcome. Super yummy and they are helping with increasing my milk supply. Lactation cookies are a bit expensive, now I can make multiple batches for the price of one box of lactation cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcfesso"
},
"reviewBody": "Great cookies! Followed the recipe exactly and ended up with yummy cookies (even non-lactating people agreed. Haha!). I did use the debittered brewers yeast after reading reviews about the after taste. I think the cookies helped increase my milk supply 1-2 ounces total for the day when I was trying to get my milk to come in. So nothing amazing, but every little bit helps sometimes. I would eat 3-4 a day because they’re so yummy. Only negative of the recipe is trying to find all the ingredients, but was worth it to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tkp4me"
},
"reviewBody": "Not only are these yummy little breakfast cookies good, they deliver on the promise of assisting milk output. Three a day helps the supply stay! Seriously though, I’d recommend them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa R"
},
"reviewBody": "Wasn't sure if I would like these or not. But I just tried one and they are great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donna m."
},
"reviewBody": "These cookies are so good and very quick to put together. If I don't hide them, my husband will start to eat \"just half\" of the batch before I can deliver them to my daughter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Harris"
},
"reviewBody": "Use the non bitter brewer’s yeast and it will make all the difference in taste. Great cookie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Spry"
},
"reviewBody": "Love these! They are better than the store bought ones I had and way cheaper to make! We used butterscotch chips instead of chocolate chips! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angiekc"
},
"reviewBody": "I’ve made these twice and they are delicious. I added an extra 1/2 cup of chocolate chips and even my husband couldn’t resist eating them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Elliott"
},
"reviewBody": "Made these cookies for a friend. Realized at the last minute she’s lactose &amp; gluten intolerant. After messing it up a bit, landed on these substitution that worked great. Switched coconut butter for butter (1:1), steel cut oats for wheat germ (1:1), almond flour for all purpose (2:1). The cookies are soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KK Nieves"
},
"reviewBody": "This is my second time making these cookies. I’ve tried store bought brands and not only did they not work they gave me a negative return on my milk supply. This recipe definitely does the job! I did however tweak the recipe instead of water i used Oatmilk and i ran out of oatmeal so i substituted with a 1/2 cup of farina. Everything was followed to the T and they are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jatti B"
},
"reviewBody": "I followed the recipe exactly, and I was able to find all of the ingredients at Safeway- except the brewer's yeast, which I found at the vitamin store. I thought the dough was a little weird looking so I refrigerated it before baking. When I pulled the dough out of the refrigerator it still didn't have regular dough consistency but I baked it anyway. They came out great! Nice and soft, and VERY YUMMY! I ate 6 cookies (I couldn't control myself!) And I have yet to see results, update to follow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aleahp"
},
"reviewBody": "SO GOOD! And so much cheaper than “store bought”. I eat several every day to keep my milk supply up, but also because I can’t stop. I keep them in the freezer and munch away over the course of a week or 2. I bake them the full 12 minutes and add a bit more salt to avoid the after taste others have mentioned. Again—SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "francoise"
},
"reviewBody": "My daughter loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kalene Adamsss"
},
"reviewBody": "The first batch I followed the recipe, they were ok, a little salty and bitter so I just added another cup of chocolate chips to the next batch and viola, wonderful. I ate about 30 cookies over the course of a week and it has helped my milk supply, I’m able to start stocking my milk up now which is great for a working mom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Alves"
},
"reviewBody": "Came out GREAT!!! I forgot to add the Cream of Tartar, but the recipe still worked great and came out super tasty! 10/10 recommend, specially to any moms trying to find a recipe to produce more breast-milk. :)\n\nP.S. this makes MANY cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "Love these! So does my hubby! Still delicious with 2/3 amount of sugar recipe calls for"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virgilia Figredo"
},
"reviewBody": "Great cookies!!! \nMy 8yr old likes them too. Had to ask him to go easy on them since they are fatty and sugary .. \nlove it how they bake perfect when I stick to the recipe. I was very skeptical with baking as I never hav any luck getting it done good. Gathered all the ingredients by lots of R&amp;D and since it’s COVID-19 situation I could browse around freely like I would normally. But once I did crosses my fingers and went for it. Took me a while since I had things to attend to my newborn but once they were done it was just worth all the hard work. Thank you so much for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kirby"
},
"reviewBody": "I hope you don’t eat these things"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ankita"
},
"reviewBody": "The recipe was amazing....I threw in a handful of almonds too! Being a new mother I’ve been some what lost about increasing my breast milk, and I’m hoping that these would help. Otherwise I can’t stop myself from munching these all day long!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Apexclover"
},
"reviewBody": "These are super yummy! We just made them today will update on milk supply!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shahista Afroze"
},
"reviewBody": "These cookies are amazing !!! So moist and tasty. I skipped the wheat germ and brewers yeast because I couldn't find them anywhere but it turned out great regardless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laton Abu"
},
"reviewBody": "These are actually tasty! I started snacking on them while they were still gooey and warm along with some cold coconut water (that tastes like milk to me but it's also a good source of hydration for breastfeeding.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Steyer"
},
"reviewBody": "I added a cup of peanut butter. They are delicious. I can't speak to how they affect lactation yet because I just made them today, but other lactation cookies I have had helped and th ingredients are basically the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Sunday"
},
"reviewBody": "I followed the recipe as shown as they turned out amazing. I love the taste of them. I just made them this morning so I’m waiting to see how they help with my milk supply. But either way I would make these again just because they’re so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Andrick"
},
"reviewBody": "These cookies are delicious. I much prefer the taste of them the following day+ when the cookies start to harden. The first time I made them with nutritional yeast not knowing how important the brewers yeast was when it comes to increasing milk supply, so I can't yet speak for how they effect supply. I substituted half of the butter for coconut oil and added some cinnamon, as suggested in a prior review. Recipe yields a good amount of cookies and I will definitely be eating them all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jomaze"
},
"reviewBody": "These are pretty fantastic. I used double the chocolate ( dark chunks and semi-sweet, doubled the vanilla, and used cake flour. Yummmmmm...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerrianne Rolle"
},
"reviewBody": "It was amazing.. I hope they work.. My husband loves them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bailey Soule"
},
"reviewBody": "These are SO good! I was weary because I'm your stereotypical adult that doesn't like healthy food all that much and therefore stays far away from things such as flaxseed...I had to hide these from my husband (Also the stereotypical type). I deliver in a week and I'm hoping they help support a good supply, if they don't though, I'll still be making them just because they seem to already be a favorite in this house.\n\nThank you for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catinthemoon"
},
"reviewBody": "I used nutritional yeast instead of brewers yeast. They were very good. Will make again even when I am done breast feeding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nknfuts"
},
"reviewBody": "I made these but used nutritional yeast flakes. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alatoof"
},
"reviewBody": "So yummy! I took some of the reviewers advice and subbed coconut oil for some of the butter. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Melrose"
},
"reviewBody": "Most delicious cookies ever. I will make these even when I'm done nursing. I have made them at least 5 times so far, exactly as the recipe is written. \n\nOne time i had forgotten the oatmeal. Then they were just like chocolate chip cookies. But they were better than any other chocolate chip cookies i have ever had.\n\nWhat's odd is they aren't as good straight out of the oven or even the same day. But the next day and for the few days until they are gone - absolutely addicting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anissa Frazier"
},
"reviewBody": "I loved these cookies. I didn’t find them bitter at all, but that might be due to me not eating sweets very often so I’m not used to it. My first time making them was exactly how the recipe called and I enjoyed them very much. The second time making these I added a tablespoon of cinnamon because I wanted the added benefits of cinnamon (I know it sounds like a lot but it worked out great). I also don’t like regular chocolate chips so I used Hershey chocolate chips instead. I am trying to get my left breast to produce more milk, and so far things are going good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Lee"
},
"reviewBody": "Super tasty! I made mine with almond slices and craisins and then drizzled honey on them when they came out of the oven. Majorly delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "psych0t1ck1tten"
},
"reviewBody": "These were addicting. I couldn't stop eating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AC Ross"
},
"reviewBody": "These turned out great! I forgot to pick up cream of tartar so we left that out. We will definitely bake these again.\n\nOnly two complaints, the Brewers yeast was a bit pricy, and the cookies tasted a bit bland to me (dad). \n\nWife LOVES them. Thank you so much for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ash Douglas"
},
"reviewBody": "I made these cookies twice. The first time I followed the recipe exactly and they were just okay. Definitely edible and no bitterness like some of the other reviews claimed, but nothing special. I remade them today but I used half butter and half coconut oil, 1/2 cup more chocolate chips, and a large handful of roasted almonds that I roughly chopped. They turned out fantastic!!!! I will definitely be making these again with the changes. And I have noticed an ounce or two increase in my daily milk production so far. It's only been 4 days but it seems to have helped a little. I give the original recipe 4 stars but with the changes I made I think it's worth 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Kalmbach"
},
"reviewBody": "Wow this is the s***!! I’ve purchased lactation cookies that are expensive and dry and these are on another level!!\n\nI didn’t have all the ingredients but it turned out PERFECT!\n\nI didn’t have any cream of tartar or wheat germ so I just didn’t put them in. Instead of 1 cup of choc chips I did a 1/2 cup and then added 2T of cocoa powder. I also only had a 1/2 cup of oats left so I put that in and then added 1 cup of baby cereal (gerber brand: oats, rice, grain mix). I know this sounds ridiculous but they turned out sooooo good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sewgood123"
},
"reviewBody": "I made these lactation cookies and they helped with milk production. The cookies were delicious. I just did not use the wheat germ"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geri Hayes"
},
"reviewBody": "These are delicious! This recipe makes a TON of cookies! Make sure you make them small and space them enough!! My 2nd batch was 3 lines of cookie that were stuck together and didnt fully cook so they weren't crunchy and fell apart!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fmel20"
},
"reviewBody": "Love these so amazing! Make sure you let the butter sit at room temperature to soften do not melt in the microwave!! \n\nUse quality ingredients for an even better cookie :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Di F"
},
"reviewBody": "I did not make any changes this time around and they turned out pretty good. Easy recipe for a first time baker. Next time, instead of using chocolate chips, I will probably add in butterscotch &amp; raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GBearry"
},
"reviewBody": "These turned out great!! I modified a little with the help of some of the previous comments. I used freshly milled flour (same amount 2cups), 2 whole eggs, and added 1 tsp of cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Callis"
},
"reviewBody": "These were very good while fresh, but they didn't keep long. After a day or two they got an odd flavor to them. But overall, very tasty as long as eaten the same day they are made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeAnn"
},
"reviewBody": "Awesome tasting. My daughter loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "enance"
},
"reviewBody": "I made these following the recipe exactly the first time and they were AMAZING! I’ve just made them again and subbed out the butter for unsweetened applesauce and added an extra tablespoon of wheat germ. The results were a much cakier cookie, cooked for 10 mins. The original recipe was better, but considering I ate about a dozen a day, I’ll continue to make with applesauce. I intend to try this recipe with a few other healthier adjustments and will update with the results when able!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Kowalski"
},
"reviewBody": "The cookies turned out great but the first batch made was like a cookie pie, it all melted-baked together! Not sure if it's b/c i didn't roll it into little balls or if it's b/c i sprayed the cookie pan? The next recipe, i will substitute the sugar for coconut sugar, and coconut/almond flour instead of regular all purpose to see if the taste will be a big difference. \n\nAs far as increasing milk production, we will see?!!..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "isa927"
},
"reviewBody": "I’m trying to up my supply since stress seems to be lowering how much I make. I made these cookies in a rush since my new breast pump is arriving tomorrow. I forgot to add baking soda to mine but it didn’t seem to leave the cookie tasting nasty, will add next time. I bought regular active dry yeast that was less than the 1/4 cup in the recipe, added cinnamon, realized I didn’t have enough butter (about 1/2 cup) and used coconut oil to substitute the rest. Also, I didn’t fully review the recipe and just threw everything in one bowl. Next time I’ll use all butter, and I won’t use just the egg yolk. And, I doubled the amount of flax seed in my recipe, only because I love the stuff. I ordered the brewers yeast today and will use in the future. Overall, they still taste better than the cookies in the store, so I recommend taking out the time to bake them. Also, it will save you money just to bake them yourself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iamsarahlee"
},
"reviewBody": "Wow! I was not expecting these to be so delicious. I did not have cream of tartar and I used almond flour instead of regular flour. These are really really good and I’m not a big oatmeal fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Nicole Crase"
},
"reviewBody": "My whole family loves these cookies and I notice an extra 2 to 3 ounce when I have them made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gretchen Barr"
},
"reviewBody": "Works great, tastes great! I've made with chocolate chips but my favorite is with butterscotch chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Homer Simpson"
},
"reviewBody": "Yummmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keston Cummings"
},
"reviewBody": "Love this recipe. I added 1/4 cup of iquid milk &amp; 1/4 cup ground flax seed instead of adding water to the whole flax seed, 1 cup of brewers yeast, 2 cups of wheat bran &amp; 1/2 cup of flour instead of 2 1/2 cups of flour &amp; I added 1/2 cup more oats. I also only used 1 cup of brown sugar total. Super moist and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Vonhoff"
},
"reviewBody": "This recipe is great! The cookies are moist, taste great and you can make around 24 from one batch. I added 1/3 cup of brewers yeast and was able to handle the taste/after taste so I think I'll add half a cup next time and see how that goes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristine Bumagat"
},
"reviewBody": "Yummmmy! Followed it exactly. I had to leave it in the over a little bit longer (around 20 minutes) and they came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC Campbell"
},
"reviewBody": "fantastic tasteing cookie. followed directions as writte."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Marie Johnson"
},
"reviewBody": "Love these! Made them yesterday to help with my flow and they worked! My daughter has began sleeping more through the night which slowed my flow, I gave these a try had just 3 or 4 of these in a 6 HR period and was able to feed fully at bedtime and be engorged by 4 am bedtime is at 10p. The only change i made was due to not being able to find brewers yeast at my local walmart and needing to stay budget friendly i got regular yeast and used a small portion less than the recipe called for and got the same results and loved the taste!! I also used dark chocolate chips as they are healthier and I love the flavor better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hazel Fausone"
},
"reviewBody": "They are very easy to make and they taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Gerber"
},
"reviewBody": "Tasty recipe, I did make a few modifications though. I added a tablespoon more of flaxseed &amp; brewer's yeast, 1/2 cup more of oats, 1/4 cup peanut butter &amp; 1 tsp cinnamon. I took them out sooner &amp; let them sit. Chewy goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krissy Yunker"
},
"reviewBody": "This made 62 cookies because I made a few a little smaller. I added 1 Tb chia seeds as well.\nThey’re delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britshain"
},
"reviewBody": "Super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maya Pettiway (MayaPapaya)"
},
"reviewBody": "They work wonderfully and taste delish!! My whole family loved them and their easy to make, as well as being healthier than the store bought/made ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrssnyder"
},
"reviewBody": "Followed directions (minus wheat germ). Seem a little dry but otherwise very good little cookies. Also made another time with Betty crocker oatmeal cookie mix based on a review which was good too... Maybe a little sweeter than I like with the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hannahbekka"
},
"reviewBody": "These cookies are great! I will say- this recipe makes a LOT of cookie dough, so I go ahead and roll half of it up into preformed balls and freeze them so that I can have some ready whenever I need some more. I don’t even thaw them, and they turn out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alma Mendoza"
},
"reviewBody": "This recipe is awesome even my son enjoyed them. I also added 2 bananas because I had 2 very ripe bananas and rather than throwing them away I just added them as well as 1/2 tsp of coconut extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Practically Simple Life | Sierra"
},
"reviewBody": "love this recipe! i wanted to make my own vs buying some. I added cinnamon, raisins sometimes, and extra chocolate chips. i also add a little more salt and vanilla. ive used self rising yeast at first, before i had brewers yeast, just used half the amount of yeast it called for.\n\nplanning to try using applesauce and some coconut oil as substitutes for eggs and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mark"
},
"reviewBody": "I used coconut milk instead of water.They turned out great, &amp; didn't last long. Made 64 cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ginko"
},
"reviewBody": "Great taste, but dry and crumbly.\nWill try a few more variations to see what might help. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britney Gentry"
},
"reviewBody": "I had baking powder instead of baking soda ... they turned out delicious anyways ... they're just a fluffy cookie instead of the more dense cookie that chips ahoy makes. They're still crispy and amazing ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakingmama91"
},
"reviewBody": "Seriously looove this recipe!! Quadrupled my milk supply an went from a little over 2 oz to 12 oz In one pumping session. Excellent! I added a little more flax than asked for in the recipe. They also taste great. I had to hide them from my three year old"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Darden"
},
"reviewBody": "Super yummy, easy to make and the recipe makes a ton of cookies! \nWill defiantly be making more\nThey doubled my milk production in just a few cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ola Alanqar"
},
"reviewBody": "Those cookies are so good, so delicious, and really moist. I replaced the white and brown sugar with coconut sugar and the taste was beyond amazing. And it’s effect on breast milk is great! Totally recommend it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Hanapi"
},
"reviewBody": "I just made these for the first time for my sister who just gave birth. This recipe was very easy to follow. I've never baked cookies from scratch before, and when I was rolling the balls to put into the baking sheet, I worried that they might come out too dry... but I was so wrong! These cookies are delicious, and just the right amount of moistness. I will be baking these for every new mom I know!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Commons"
},
"reviewBody": "SoOo good! I also added walnuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly M"
},
"reviewBody": "2nd batch turned out fantastic! 1st batch was so bitter due to the brewers yeast, so I bought a de-bittered brewers yeast (Mommy Knows Best from Amazon) and now the cookies are so good! The whole family loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquieg"
},
"reviewBody": "I followed the recipe and just added some cinnamon but they turned out delicious! Hardest part was tracking down the Brewers Yeast, wheat germ and cream of tartar. But it was worth it. Anything I can do to keep my milk supply going I will do. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jdawg88"
},
"reviewBody": "I used dark chocolate chips. Did exact measurements and they are perfect! Soooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bree Marian"
},
"reviewBody": "These cookies are amazing! My husband even likes them too! I followed the recipe as it was written. I think these come out better when you bake them closer to 12 minutes. I was able to make 62 cookies with this recipe and my cookies were average sized. So it definitely makes more than 36 cookies. My milk supply has increased too! Pumping 6 oz in a session and my baby is one month old."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nod"
},
"reviewBody": "Might just be me but all I can taste is the brewers yeast and it’s not pleasant. At all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Grace Westbrook"
},
"reviewBody": "Pretty tasty, easy instructions and helped with milk supply."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "Great cookies! Soft and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia S."
},
"reviewBody": "Added just a bit of cinnamon and they tasted fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Riggs Moore"
},
"reviewBody": "Added 3 teaspoons molasses"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missus Ava"
},
"reviewBody": "I just made a batch of these for a girlfriend who just had a baby, and the cookies are excellent! I'd probably make these again, babies or no babies, they're that good. Didn't change a thing about this recipe. Also, I can hardly taste the brewer's yeast whatsoever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cariss2709"
},
"reviewBody": "I made mainly for lactation, so I used just under a half cup of Brewer yeast and removed half cup of flour and added an extra half cup of oatmeal. Doesn't taste as great as original version but it does a good job of masking taste of Brewer yeast and definitely helps with lactation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "It was very good! I substituted the wheat germ with 1/4 cup unsweetened shredded coconut, the flour with whole-wheat flour, and 1/2 of the butter with 1 cup of tahini (it’s excellent for lactation!). I also added 1 cup of Reese’s pb chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emilie"
},
"reviewBody": "I added 4-5 tbs of creamy peanut butter to these, left out the cream of tartar (didn't have any) and these taste fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee Lumb"
},
"reviewBody": "I made this recipe as directed, but I added in a cup of shredded coconut as I love coconut in my oatmeal cookies. Also coconut is also known for helping with breastfeeding. Super yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justbethanne"
},
"reviewBody": "Very yummy cookies! I’m not a fan of chocolate really, so I used 3/4 cup white chocolate chips &amp; 3/4 cup craisins. Delicious! I also added 1 tsp cinnamon. Good base recipe! Hoping they’ll increase my supply.. will soon find out ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cposik"
},
"reviewBody": "I made these today for my daughter and grandson who is in the nicu. I added a tsp of cinnamon to the recipe which really enhanced the finished flavour. also used 2 cups of chocolate chips . My son ate one and pronounced it delicious. I plan on adding cut- up dried apricots, which are also good for lactation, to the remaining batter. I also will use \"quick oats\" rather than \"old-fashioned rolled oats\", which are a little chewy for my taste, to the next batch. This is an excellent cookie for all! I just made up the rest of batter and added the apricots. I found that the oats had softened some from sitting in batter in the frig-next batch I will let sit for 24 hours before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Lucie Marie Smith"
},
"reviewBody": "I opted for craisins instead of chocolate chips. Came out wonderfully. I have yet to see what they do for my milk supply. Fingers crossed they work"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa A Avila"
},
"reviewBody": "Cookies came out so good. Followed the recipe exactly. Ate 4-5 cookies and woke up the next morning engorged which I haven’t felt like that in a few weeks. This was the perfect recipe to give me back my boost. I’ve been eating about 3 cookies in the morning and a couple in the evening. Wish it wasn’t so high in calories but does the job which is what I was looking for. I ain’t complaining &amp; neither is baby. Thank you!\nTip- Use REAL butter! Makes a huge difference in taste &amp; texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larke Benda"
},
"reviewBody": "Totally amazing!!! I also added a handful of slivered almonds, pumpkin seeds, an extra tsp of vanilla and 2 of cinnamon, some dried cranberries, cherries, and blueberries. They’re my favorite cookies now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staceface"
},
"reviewBody": "Super yummy!!!! I’d like to try with raisins instead. I used 2TBSP of active yeast as I couldn’t get brewers yeast. Worked well. I don’t know if it works as well for lactation though."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232191/lactation-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
"name": "Oatmeal Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232191/lactation-cookies/",
"name": "Lactation Cookies"
}
}
]
}
}
, "about": [
]
}
]