				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Laura&#39;s Quick Slow Cooker Turkey Chili"
,"datePublished": "2005-02-14T02:51:29.000-05:00"
,"dateModified": "2022-05-26T11:19:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LauraKKH"
,"url": "https://www.allrecipes.com/cook/182790"
}
]
,"description": "This is an easy crockpot turkey chili recipe you can throw in the slow cooker and forget about until dinner. Zesty flavor meets convenience here."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PZFnlhnY-QkgepTA410E83cf7m4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1009122-fa8d56db99f947488c72864c6f067d95.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2889980732001",
"description": "Toss a few ingredients into the crock pot and forget about it!",
"duration": "PT2M2S",
"name": "Laura's Quick Slow Cooker Turkey Chili",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/1f291ac3-3596-40de-8a46-d8aff5b847ba/282759a2-03ef-47d9-9eff-05fe8cd62068/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T09:03:36.474-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Laura&#39;s Quick Slow Cooker Turkey Chili"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1650"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "276 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "42 mg"
,"fiberContent": "11 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "547 mg"
,"sugarContent": "1 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"1 pound ground turkey",
"cooking spray",
"2 (10.75 ounce) cans low sodium tomato soup",
"2 (15 ounce) cans kidney beans, drained",
"1 (15 ounce) can black beans, drained",
"0.5 medium onion, chopped",
"2 tablespoons chili powder",
"0.5 tablespoon garlic powder",
"0.5 tablespoon ground cumin",
"1 teaspoon red pepper flakes",
"1 pinch ground black pepper",
"1 pinch ground allspice",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a skillet over medium heat. Place turkey in the skillet, and cook until evenly brown; drain."
} ,{
"@type": "HowToStep"
,"text": "Coat the inside of a slow cooker with cooking spray, and mix in turkey, tomato soup, kidney beans, black beans, and onion. Season with chili powder, garlic powder, cumin, red pepper flakes, black pepper, allspice, and salt."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PZFnlhnY-QkgepTA410E83cf7m4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1009122-fa8d56db99f947488c72864c6f067d95.jpg"
}
]
,"text": "Cover, and cook on Low for 8 hours, or on High for 4 hours."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT255M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe, this was the first recipe I have tried on allrecipes and it did not disappoint. I used Italian ground turkey for a little extra flavor. The chili tired out just a little on the spicy side but in my case that is a good thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "To A Tea"
},
"reviewBody": "I have made this turkey chili so many times, and we love it. I will admit to using tomato sauce and crushed tomatoes instead of soup. Today I am changing it up and using stew beef instead of the turkey. Fingers crossed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hugh Hibbert"
},
"reviewBody": "The chili was absolutely delicious and really hit the spot! The recipe was simple as well. Definitely adding this one to the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin Jutrzonka"
},
"reviewBody": "I had ground beef on hand so I used that instead of turkey. It was good but other reviews led me to believe that this would be spicier than it is. I think I'll toss in some peppers next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Durivage"
},
"reviewBody": "This was a hit with my kids. The only thing I did different was season the ground turkey with some Chupacabra seasoning, cayenne, and ground black pepper. This is a hearty chili. I'll definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Sindoni"
},
"reviewBody": "This was a great recipe base for my best leftover Thanksgiving Turkey chili ever! As in typical Allrecipes fashion, I have to make adjustments (mandatory). I took the canned corn, canned green chili advice. 2x pinto bean cans, 1x black beans. No tomato soup, instead the highest quality tomato purée and diced tomatoes you can find, about equal parts. Throw 2 hot sausage links in to brown with carrots and/or your raw turkey. 4 or so mins later, throw in the celery. A few mins later throw in the onion. Finally, throw in fresh garlic, instead of powdered, for 3 or so mins tops. If you have tomato paste, throw 2 tablespoons in, stir to incorporate, then *do not touch* until carmelized - about 6 mins. Next, throw in about 2 tablespoons of red wine, let simmer for 5 or so mins. This adds a bunch of flavor. Proceed to add in your remaining ingredients like cooked leftover turkey, if youre using that instead, and tomatoes. I added some spices you may be interested in trying. Moroccan Ras El Hanout - about a tablespoon. You could substitute with curry powder or paste, although it wouldn't be the same. About a tablespoon of Urfa pepper. If you're not using smoked leftover turkey like me, add a dash of Liquid Smoke and thank me later. I used more of the spices then called for in this recipe, but I just taste and see. Slightly under season, give it a few hours, add more. I added 15 oz of water, likely 2-3tbps of chili powder, etc. Cheers m8s"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megrarian"
},
"reviewBody": "Wonderful chili. I never thought tomato soup would work, but it was one of my best batches of chili! Of course, there had to be substitutions, based on what I had. I didn't have low sodium tomato soup, so I used regular, and because I only had one can of soup, I used 1 can of store bought tomato sauce. Everyone loved the flavor, and it was great for leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really easy to make. Substituted plain tomato sauce instead of the soup and liked the less sweet flavor profile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Peterson"
},
"reviewBody": "Excellent chili!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asydnes"
},
"reviewBody": "This dish never fails to impress, though I cut the red pepper flakes out, as it is a bit hot with them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Jacks"
},
"reviewBody": "I loved this recipe! It was easy to make and VERY enjoyable/we (my husband and I ) enjoyed the portion size it made as we both had dinner AND nice dinner the next day for my hubby! I did read the reviews before cooking and made the \"tweaks\" recommended. 1. Used ONE WHOLE CAN of tomato paste instead of any of the tomato sauce 2. Used TWO cans of the MILD Tomatoes with green chili's (the small cans from Walmart-I drained about 3/4 of the liquid before pouring in the crockpot) 3. Used ONE TB Chili powder instead of two (honestly didn't see it was two but one was just fine!) 4. Used OLIVE OIL to brown the turkey and that was just fine; I also threw the onion in there with it and browned it all together and that worked out great! My husband told me it was a \"keeper\" and to \"def make again\" sooooo, I would say it's a HUGE SUCCESS!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved this! I use whatever beans I have on hand (sometimes the correct amount, sometimes black eyes peas, sometimes mixed beans) and it is a smash hit - also makes great leftovers. My husband and my family of picky eaters very much enjoyed (especially if I added sour cream and cheese). I'm wondering - has anyone doubled this recipe in their crockpot? I think this might freeze well but I'm not sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLDROE"
},
"reviewBody": "Very simple! We made it using leftovers from Turkey Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharron from MS"
},
"reviewBody": "I love this recipe. I have been making it for almost a year now. I enjoy the ease of using my crock pot so having a great recipe is always a plus. I don't eat beef so Laura's Turkey Chili is just perfect for me. I took several tips from others who commented. I only used one can of kidney beans and I substituted one can of tomato soup (Campbell's low sodium) with a can of Rotel tomatoes. I didn't have any Allspice seasoning, so I just added a sprinkle of cinnamon. Because I am watching my sodium intake, I drain and rinse my black beans and the kidney beans. Makes it a little bland but it is still delicious. I have been experimenting with the Red Pepper Flakes. The amount listed makes it TOO hot for my taste buds. So, I've been decreasing the amount every time I make my chili. I'm done to 1/8 teaspoon. After it's done, I top my chili with avocado slices. OMG!! It makes up for the low salt and it's healthier. Sometimes I'll top with a small amount of sour cream but not often. I previously ate Tostitos multigrain chips with my chili. But I am now in love with the Simply Organic white cheddar Doritos. Yum-yum! You've got to try it. It's the only time I enjoy these chips. Even though it's blazing hot outside, I actually have a batch of Laura's chili cooking now. It's really that good! Enjoy y'all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I always make it with my family and now it’s a go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KarenMakoid"
},
"reviewBody": "The recipe was easy to put together, but 7 hours in a crock pot was too long, especially since the meat was already cooked. It became thick like a paste. If I were home all day I could have spotted this and stopped the cooking process, or added some water. I ate it anyway, but the children said it was bland so I gave them some sour cream. Perhaps more spices. We were disappointed with this one. K."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hmrbqzrktg"
},
"reviewBody": "Was really good I added bell peppers and a few bay leaves to mine but was still delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "solarite1"
},
"reviewBody": "We pureed out own tomatoes, with jalapenos, garlic and red onions as our base when we used the receipe! We like it hot and added cayenne and chili powder!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha K."
},
"reviewBody": "This is a now staple in our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Schmitt"
},
"reviewBody": "This is my go-to chili recipe and I make it several times each fall and winter. It's so tasty and easy to double when I'm feeding guests. We all love it with Jiffy corn bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rickyoku"
},
"reviewBody": "I use my crock pot to slow cook Turkey Chili along with different beans and rice. 4 hours on high then 2 hours on low. YUMMY LOVE IT!! One pound of ground Turkey at Walmart for example is $2.98 and people just add what you like different beans spices and enjoy a healthy bowl all winter long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food4Thought"
},
"reviewBody": "Copied this recipe to a T. Hearty dish, didn't find it spicy at all but was delicious. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dx29bt9fhr"
},
"reviewBody": "So easy and everyone loved it. I added a couple of jalapeños which added a flavor. I had to use Bush’s black beans which were too sweet. I’ll definitely use all Goya beans next time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "talk2reena"
},
"reviewBody": "Gosh this recipe is so good. I've made it so many times and for so many people, figured I might as well leave a review now \nI always end up putting 2 cans of diced tomatoes though, and then adding 2 cups of broth to make it not so thick. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KarenS"
},
"reviewBody": "I did not care for this recipe. I could tell once I started making it that there were way too many beans than there was meat. The soup did not do anything for this recipe and was very bland. Disappointed as I always look for raving reviews before I make something new."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEAD"
},
"reviewBody": "This chili was amazing as is, but now that I made it I've started experimenting using my own personal tastes and reading user comments. 5 stars +"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charisse Williams"
},
"reviewBody": "Mom and I love this recipe. I wasn't sure if I should use condensed tomato soup or regular so, I used the condensed and added about 3/4 can of water. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krobson"
},
"reviewBody": "Love it!! I used one can of Rotel tomatoes and one can of diced tomatoes, not a big spice fan. Would add a green pepper next time. But love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles Fordtran"
},
"reviewBody": "I did a half batch and halved the measurements accordingly, with very minor adjustments. I used the entire can of black beans (didn't want to waste the other half), half bottle of Shiner Bock, and I used a mix of chili powders (green ancho, chipotle, and regular chili powder ) to the proper portion. Easy, quick to prepare and tasted great. C\n\nP.S. even though I hail from Texas, I love a bean-less chili, Texas Red (so to speak). Regardless, this was great with the beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I made this chili tonight in the slow cooker for my family and they all said “best chili You’ve ever made , always make it this way!”. I did make some changes. I cooked the turkey meat with onions and red bell pepper instead of green and garlic (extra), before placing in the crockpot, I made sure that I didn’t grind the turkey up too much I left Chucks, my boys love that!I used a can of chili &amp; kidney beans mixed and a can of just chili beans i did not drain them. I added a can of diced tomatoes, and 4 oz of tomato sauce?, 1 tablespoon of sugar, a little bit of Worcestershire sauce, and some red wine vinegarette. And I seasoned the turkey meat while cooking it with salt and pepper and a little bit of Worcestershire. Never in 1 million years would I think that tomato sauce would’ve made it so delicious and I only chose this recipe because of all of the other reviews!! I made sure that I didn’t grind the turkey up too much I left Chuck submit my boys love that. and for ounces of tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Crouch"
},
"reviewBody": "This is a very simple and delicious recipe to make. I've made it with turkey, beef, bison, and venison and it turned out great every time. I think the next time I'm going to try elk.\n I wouldn't be a proper reviewer if I didn't make some changes to fit my own taste. lol I like a chunky, hearty chili. So this is what I changed, instead of 1 lb of meat. I use 1.5 lb and that works out better for me. Instead of the tomato soup, I use one 28-oz can of Red Gold whole peeled tomatoes. I dump them in and then I use my wooden spoon to crush them against the side of the pot. Some may choose to add some water, but I don't. Other than that, I keep everything the same.\n*Pro tip: If your chili comes out too soupy. Use a potato masher to crush up some of the beans, but not all. This will thicken up your chili pretty good. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie "
},
"reviewBody": "This was the first time I've made \"turkey\" chili. I usually use beef. It was outstanding and had great flavor. I will be making this one now instead of beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Gaston"
},
"reviewBody": "Quick, easy, yummy, filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YKurtz"
},
"reviewBody": "Great recipe. Have used this at least a dozen times; I've made my own tweaks to it to personalize the taste. I added 1 cup of red wine, and some cayenne pepper to heat things up a bit. (You can always add the cayenne pepper per serving if someone in the family can't handle the extra heat.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "This chili was so awesome! Super easy prep and so flavorful. Followed the recipe almost exactly- only used one can of tomato soup/added a can of diced tomatoes and a can of green chilis. I’m sure it’s delicious exactly as written though! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "This recipe was a hit! I used diced tomatoes as suggest instead of tomato soup and added about 4 cups of water about half way through when I realized how thick it was going to be. I also cooked the onions with the turkey burger and added about a tablespoon of fresh minced garlic. Lots of flavor and Very filling. This is my new Fav!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Fowler"
},
"reviewBody": "Super easy and my family loved it! I added an additional pound of Italian sausage to the turkey, giving it a little more meat and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tim B"
},
"reviewBody": "First of all, thanks for the recipe. People can be so nasty or rude on their responses. I appreciate it very much. The base was great. I did substitute a can of diced tomatoes with chiles for a can of soup. I also used 1/2 teaspoon of crushed chipotle peppers instead of the red pepper flakes. Otherwise, kept as is. It came out great! Family loved it. Thanks again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MIMI"
},
"reviewBody": "This is a good basic turkey chili recipe. I cooked on the stove top and made a few adjustments: omitted the oil and paprika - it wasn't necessary, increased the cumin to 2 tsp, added bottled hot sauce for more flavor and heat. I like to garnish my chili with shredded pepper jack cheese. Now it's perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HeatherO"
},
"reviewBody": "Too spicy with the amount of red chili flakes suggested. Otherwise good, I will try again without the chili flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TucsonRu"
},
"reviewBody": "Tastes wonderful. Made it in the Instapot. Turned out better than I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beachrunner5"
},
"reviewBody": "Family loved this!!!! Made into Frito Pie: Served over rice and fritos. Topped with shredded cheese, sour cream and jalepenos. Also great by itself the next day for lunch. yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Markham"
},
"reviewBody": "This is so easy to make I made it for my parents and it was so delicious that I am making it for my husband. Hopefully he will like it as much as I do. Thank you for sharing your recipe it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maduke"
},
"reviewBody": "Didn't want to use tomato soup, but diced tomatoes. Great taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natural8blue"
},
"reviewBody": "Sweet &amp; simple recipe with little prep and easy cleanup. Exactly what I was looking for. Nice alternative to beef chili."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plumeria girl"
},
"reviewBody": "Made a believer out of my husband that you can cook ground turkey and it still be edible. He loved it. I did add extra spices and heat for our preference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DOMMETT"
},
"reviewBody": "Sorry - didn't care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karyn"
},
"reviewBody": "I have made this recipe several times..however the last time I only had tomato basil soup.. I added bell pepper and corn and it turned out amazing. Kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cari Lee"
},
"reviewBody": "This has become a fave in our house. I make it several times throughout the year. The recipe is SO GOOD and the whole family (even the kiddos) loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle "
},
"reviewBody": "delicious! I had to make some changes due to not having everything on hand during the Covid-19 quarantine. I used 2 cans of diced tomatoes instead of soup and sprinkle of red pepper instead of allspice. I used 1 can red beans, 1 can corn, 1 can white beans. I also added 1/2 cup of water after reading another review, but it really didn't need it. I will be making this one again. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Vales"
},
"reviewBody": "Quick and tasty. My kind of recipe! I didn't have any tomato soup, so I substituted with a can of diced tomatoes with green chilies, a can of tomato sauce, and about a cup of beef broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melani Saltzman"
},
"reviewBody": "2 tsp chili powder instead of 2 tbsp. Cooked turkey with onion and garlic together and diced red bell pepper. Added some corn. Did not add red pepper flakes either. Used 1 can diced tomatoes and 1 can tomato sauce with 4 oz green chili peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis Wakefield"
},
"reviewBody": "Very good, simple recipe. Fairly mild with the spice as the recipe calls for, I double the red pepper and add some cayenne for extra heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this recipe many, many times. My grandchildren always request it so this is a family favorite. Easy and very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sentra10"
},
"reviewBody": "I have made this recipe many, many times. My grandchildren always request it so this is a family favorite. Easy and very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueRN"
},
"reviewBody": "I love this recipe! This chili isn’t very spicy, but the flavor is delicious! Easy to spice it up a bit to your own taste. I also substitute a can of chopped tomatoes or tomatoes with green chilis instead of one can of tomato soup. Corn is a nice addition too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trix"
},
"reviewBody": "So easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cwilson33"
},
"reviewBody": "This is a great recipe for turkey chili. I have used it as a basis for many years now. I like others do some individual tweaking. Instead of tomato soup I used fire roasted tomatoes. I also use two cans of green chili and tomatoes. three cans black beans (my fave), 2 cans each dark and light kidney beans. I also use two pounds of ground chili since we like our chili chunky. I obviously make this is large quantity so I use the serving option in the app to adjust the quantity of spice. I do also add about a teaspoon of turmeric and a teaspoon of smoked paprika and it adds to the flavor. thanks for sharing this recipe! it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carson Gibson"
},
"reviewBody": "I used two pounds of ground turkey and one package of\nwhole mushrooms.\nThe chili tasted ok, just not spicy hot like chili should be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turkey chilli recipe is a keeper. The only thing I did different was I seasoned the ground turkey with a little garlic salt,ground pepper and Italian seasoning. Also in addition to the recipe I added 1 can of chopped tomatoes with green chilies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tink"
},
"reviewBody": "I just increased the Chili powder by 1/2 and doubled the red pepper flakes. Each person also added hot sauce to their serving. My family loves spicy food. This was a delicious recipe as I am not a fan of chili, but I will eat this any day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Hayes"
},
"reviewBody": "Nice, easy recipe. Also good with beef. I took advice from other reviews and substituted various ingredients, depending on taste and what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2ivy"
},
"reviewBody": "My family loved this! I did make quite a few changes though. I couldn't find a dairy free tomato soup so used 3/4 can of tomato sauce and 1 can of fire roasted tomatoes. I also added about 1 tbs of cocoa powder. Our new favorite chili recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Excellent, I did add diced tomatoes w green chilies and one can of tomato soup. One T of chili pepper is enough , it was spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaKeshia Fonville Whitehurst"
},
"reviewBody": "It's easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jared Garlock"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucia Giancroce"
},
"reviewBody": "This is delicious and easy. I also took advice from previous reviews instead of two cans of tomato I used one can of tomato soup one can of stewed tomatoes and one can of Ro tel mild diced tomato and green chilies. I also added two cans of super sweet corn. light red kidney beans,black beans and Cannellini beans. And 2 pounds of turkey . I had to make more than six servings. I did not add water. I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLM"
},
"reviewBody": "One of my favorite new chili recipes! I had been making the same chili recipe handed down by my Grandmother for years, until I found this recipe recently and decided to try it. It's just perfect and my family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Meyers"
},
"reviewBody": "I made one change - did not add the jalapeno as I was concerned about how spicy/hot it might get. It turned out great and I would absolutely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joey"
},
"reviewBody": "Made a double batch, but only bought enough Tomato soup for half haha... So i used BBQ sauce to fill the requirements, and it was Delicious :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgi Wellington"
},
"reviewBody": "This is great, very spicy, the way I like chili. I made it in my Instant Pot and it was great. I am not a fan of turkey but needed to use it and this was perfect for me. I followed the other readers ideas of using the Rotel tomatoes but kept both cans of soup, and added a bell pepper cause I needed to use it too. Definitely a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wife of a Cajun Man"
},
"reviewBody": "This recipe is true to the description. I was amazed at how tasty and satisfying it is. Due to pantry constraints, I used tomato soup and cream of chicken soup and one can of pinto beans.I added a teaspoon of Italian herbs as well. My son-in-law walked straight to the crockpot saying, \"What's in here?\" because the kitchen smelled so good! With toppings this is a complete meal for anyone and pairs well with a green salad for a really full meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEB"
},
"reviewBody": "Sooo good. I too used diced, no salt added tomatoes in place of soup, added in chopped green chiles, some low sodium chicken stock and a pinch of smoked sweet paprika.\nBUT I served it over riced cauliflower, with a little sour cream a d shredded cheddar - will not serve any other way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queen"
},
"reviewBody": "Excellent chili!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "wannabe"
},
"reviewBody": "This is hands down the most boring/bland chili I've ever made: it tastes like it came from a can. \n\nI made it exactly as written and would never ever make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malyka Young"
},
"reviewBody": "Used a bit less pepper flakes for less of a spicy taste. \nWas wonderful! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mstammi"
},
"reviewBody": "No change to recipe and it was delicious. I will definitely make again but a bigger batch! Easy and big hit with the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "photogjeff"
},
"reviewBody": "Great recipe, but I find it funny that it's called \"quick\". There's nothing \"quick\" about a slow cooker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhianna Smuin"
},
"reviewBody": "This chili came out amazing! Some of my family said it was the best they'd ever had! :D I did make a couple alterations after reading some of the reviews. I took the advice of many people and I substituted 1 can of condensed tomato soup for 1 can of Ro*tel diced tomatoes and chiles and nixed the red pepper for the kids. It still had a mild kick to it. I also added a little bit of frozen corn at the end and 1/2 can of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Silvertash"
},
"reviewBody": "My 8 yr old daughter and I made this together. She normally will not eat much chili- and she begged for leftovers when this was done! We did substitute the tomato soup for Canned diced oregano and basil tomatoes. It was easy to set up and I would recommend it on a Sunday so you have easy leftovers for the beginning of the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sir"
},
"reviewBody": "Best chili ever!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosanna Montes Nuno"
},
"reviewBody": "I did make some changes after reading other reviews. I omitted the tomato soup and used two cans of diced tomatoes with Chile. Also added a can of tomato sauce and can of water, which I won’t add next time I make this just to see the difference. I used a pound and 1/2 of ground turkey. Also omitted the black beans and used a 30oz can of kidney beans and 30 oz can of pinto beans. Used the spices exactly as the recipe called for. Everyone thought they were good, even my executive chef son. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pina Rambo"
},
"reviewBody": "It turned out pretty good just a little sweeter than I expected. Think the creamed corn added too much sweetness. Will make it again but use drained whole corn kernels instead of creamed. Only substitution I made was I replaced the tomato soup with one can of rotel tomatos and one can of diced tomatos. Cooked it on the stove top. Ready in just about an hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phyllis Bleiweis"
},
"reviewBody": "Excellent recipe. Easy to make and quick clean up. I took the suggestion of another reviewer and eliminated the soup and substituted two cans of tomatoes with green chilies, reduced the amount of chile powder by a tablespoon or so and added a drained can of corn. I, too, found one can of kidney beans and a can of black beans sufficient. I suspect there are a bunch of variations that will work and will try some the next time I make it. I made it in my 4 quart slow cooker; it served 4 people with only a small amount leftover. I thought it was spicy but my guests added a bunch more chile power and a lot of Tabasco. To each his own....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "vivi"
},
"reviewBody": "Did not come out as creamy or juicy as I expected; it was more beans than anything else…. Somewhat lacking in flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "I added a can of water as well. Only used 2 tsp of spices. This is so yummy! Served it with jalapeno cheese cornbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "heather144"
},
"reviewBody": "I did not like this chili version. The tomato soup makes it sweet. If you like sweet chili, then follow this recipe as is. If I make it again, I’ll use diced tomatoes in lieu of the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vkapamas"
},
"reviewBody": "Super easy to make and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAT"
},
"reviewBody": "Thought it was wonderful. Did use tomato soup. Will omit next time and try with two cans of tomatoes with chile. Did use a can of mild chilies also. We are pansies when it comes to things being too hot. However, cheese/sour cream help if it is too hot. Did have enough for two additional meals in freezer. \n\nCouple of 'Wisdom'...Seniors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzykatt"
},
"reviewBody": "This chili was absolutely delicious. The only thing I didn’t do was add the hot pepper flakes. Everything else in the recipe remained the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa"
},
"reviewBody": "Still the best chili I've had. I make it with a little extra heat and more turkey, few less beans. It is SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa"
},
"reviewBody": "Still the best chili I've had. I make it with a little extra heat and more turkey, few less beans. It is SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan S"
},
"reviewBody": "Quick and easy, very good, I did tone down the spice in the cooker and added some to the turkey in the pan. Helped the turkey stand out a bit from the beans. I also added a can of white beans in lieu of a second can of red. Will make again and keep playing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jane"
},
"reviewBody": "The best Chili i’ve ever had! I didn’t use the red pepper flakes and I had ground clover instead of allspice but it turned out super tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "Excellent!! However, I must say that I took the advice of one lady that suggested that the red pepper be cut back. I cut it down to maybe a heaping 1/4tsp and it was perfect. Will definitely make again. Hubby love it and so did I!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eleanorcooks"
},
"reviewBody": "I added a healthy amount of Bell Pepper, and a can of fire roasted tomatoes with green chiles from trader joes and this is a FIRE recipe that I can get behind 100%! will be my recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie da Silva"
},
"reviewBody": "absolutely delish!!! I made it only for me so this was on the menu for the 3-4 days after, but i could not get enough! Something you can eat in a constant heat here in Florida or a cold winter day ...somewhere else than FL. haha I will keep this one forever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara VanTeslaar"
},
"reviewBody": "Left out the sour cream, but with the corn chips and shredded cheese it was well received by the family."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/82768/lauras-quick-slow-cooker-turkey-chili/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
"name": "Chili Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14765/soups-stews-and-chili/chili/turkey-chili/",
"name": "Turkey Chili Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/82768/lauras-quick-slow-cooker-turkey-chili/",
"name": "Laura&#39;s Quick Slow Cooker Turkey Chili"
}
}
]
}
}
, "about": [
]
}
]