				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Layered Mint Chocolate Fudge"
,"datePublished": "2005-09-29T20:18:27.000-04:00"
,"dateModified": "2022-11-16T21:59:34.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Eagle brand"
}
]
,"description": "Chocolate fudge is layered with white or colored mint fudge in this lovely holiday candy."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OBFUEK36UcZ7-rYP71-F3YFg5rk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/27327-layered-mint-chocolate-fudge-Emily-4x3-1-2cfd756a4f164859bbdc15429d60ba50.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Layered Mint Chocolate Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "161"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "146 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "6 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "25 mg"
,"sugarContent": "14 g"
,"fatContent": "7 g"
,"servingSize": "1 3/4 pounds"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 cups semi-sweet chocolate chips",
"1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk, divided",
"2 teaspoons vanilla extract",
"6 ounces white confectioners coating* or premium white chocolate chips",
"1 tablespoon peppermint extract",
"1 drop Green or red food coloring" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In heavy saucepan, over low heat, melt chocolate chips with 1 cup sweetened condensed milk; add vanilla. Spread half the mixture into wax-paper-lined 8- or 9-inch square pan; chill 10 minutes or until firm. Hold remaining chocolate mixture at room temperature."
} ,{
"@type": "HowToStep"
,"text": "In heavy saucepan, over low heat, melt white confectioners coating with remaining sweetened condensed milk (mixture will be thick). Add peppermint extract and food coloring (optional)."
} ,{
"@type": "HowToStep"
,"text": "Spread on chilled chocolate layer; chill 10 minutes longer or until firm."
} ,{
"@type": "HowToStep"
,"text": "Spread reserved chocolate mixture on mint layer. Chill 2 hours or until firm. Turn onto cutting board; peel off paper and cut into squares. Store leftovers covered in refrigerator."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Burnt Cheesy Chicken Flavored Whip Cream"
},
"reviewBody": "Best fudge ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakeyourself"
},
"reviewBody": "so minty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happybetti"
},
"reviewBody": "This was amazing!!! My kids say it’s better than their favorite candy bar. Lol. I added a bit extra chocolate just because i didn’t want extra in the house. Thank you!!! I’ll be sharing at all functions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpdirect"
},
"reviewBody": "I used white chocolate. I have to say the fudge is more like chocolate and was hard to get flat but I used the bottom of a cup and it worked great!\nThis recipe is soooo good!\nMy son came over (I thought he would like it) and he loved it.\nYou can’t have just one piece"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luckycharm7290"
},
"reviewBody": "love this fudge it is always my go to for Christmas or any time of the yr. Every time i make it everyone wants the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Richard"
},
"reviewBody": "Easy and great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elissa"
},
"reviewBody": "made this at Christmas and it was delicious ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YWOOF"
},
"reviewBody": "This was a huge hit at last year's Christmas party. I had to come get the recipe again because I am making it for this year's party too! Why change wonderful?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonja VB"
},
"reviewBody": "The texture may not be \"fudge\" but it sure is good, and so easy to make!! I have made this recipe many times, and everyone always loves it. I use an 8x8 pan, and find it is perfect. I don't change the ingredients at all. The only thing I do different is make 1/2 the chocolate part at a time instead of making it all at once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joyce Meredith-Gary"
},
"reviewBody": "Super easy to make but I thought the peppermint was a little strong. I don't feel the recipe needs to be doubled because it was think enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vivian lacerda"
},
"reviewBody": "really really good. I doubled the recipe and used a 9x9 and it was the perfect thickness. the regular recipe would undoubtedly have been too thin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mj"
},
"reviewBody": "Extremely yummy! A little bit goes a long way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "littleboss922"
},
"reviewBody": "My middle layer was crumbly. There was no \"spreading\" to be done. I dropped it here and there over the first layer, crumbled it some more with my fingers, and then used a spatula to press it down flat. It tasted okay, but it wasn't spectacular, and I won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justnana"
},
"reviewBody": "I have been making this for years. I use disposable aluminum square pans to make spreading and cutting so much easier. After done- simply peel off aluminum baking pan (cut off if necessary). I put a piece of wax paper under it and then use a big knife to cut it perfectly. I put the pieces in mini paper or decorative cups to add to my cookie trays. Another tip- I melt my Eagle brand and chips in the microwave. I make two recipes at once just splitting each chocolate layer in half. And each little square is just that little taste of fudge- if you want thick chunks of fudge- this recipe as is will not be your best choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JD0740"
},
"reviewBody": "Very tasty, but I tried to double the recipe and put into a 9x13 pan and there's NO WAY it would have spread out. I wound up putting it in a 9x9 pan, doubled. I also added a bunch of crushed peppermints to the middle layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ish"
},
"reviewBody": "We used the mint instructions from this recipe to modify the recipe found on the back of Jet Puffed Marshmallow Creme. The result was a delicious mint twist on traditional, squishy fudge. As this recipe was reviewed as being a) not enough chocolate layer and b) hard, not soft fudge, we went with the Jet Puffed recipe that has served us so well. We made one batch of traditional fudge as instructed on the marshmallow creme container, then made a second batch using 1 Tblsp mint instead of vanilla and white chocolate instead of semi-sweet (both as suggested by this recipe). We put half of each batch into 8x8 pans, then marbled. It is divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deenie"
},
"reviewBody": "This is a great recipe. My friends and family really enjoyed this. Also it works just as well with low fat condensed milk, and if you forget the vanilla, don't panic, it still works. I doubled the recipe and it came out great. If you don't completely mix in the food coloring you get pretty swirls! This was the first fudge recipe I've ever tried and it was easy &amp; delicious! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aliciamarie"
},
"reviewBody": "This was really good except I had to change the recipe slightly because the middle layer was so dry it a"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Stephanie Walker"
},
"reviewBody": "The mint layer turned out surprisingly well. However, the rest of the chocolate never would melt properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlflick006"
},
"reviewBody": "I have been using this recipe for a couple years and my family loves it. I use this recipe exactly as it is, using white chocolate chips and it comes out great every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparrows"
},
"reviewBody": "In Canada, our sweetened condensed milk comes in a 300ml can (which equals only 10 US fluid oz, not 14). A quick look on the Eagle Brand Canada site turned up the same recipe using the 300ml size. For those who live in Canada, here are the ingredient amounts: 10 (1oz/28g each) semi-sweet chocolate baking squares*; 1 can (300ml) Regular Eagle Brand Sweetened Condensed Milk; 2 tsp. vanilla extract; 1 pkg (170g) white baking chocolate*; 1 tbsp. peppermint extract; Few drops green food coloring (Optional); *If you want to use chocolate chips, I have done the conversions. Note: For those who may be thinking that 10oz equals 1 1/4 cups, remember that is in liquid form and liquid is measured by volume, whereas solids are measure by weight. 2 squares at 1oz each (2oz) = 1/3 cup; 4 squares (4oz) = 2/3 cup; 6 squares (6oz) = 1 cup; 170g = 5.99oz or approx. 6oz; 175g = 6.17oz or approx. 6oz; Substitute 1 2/3 cups semi-sweet chocolate chips for the 10oz of baking squares (6oz + 4oz = 10oz - see above); Substitute 1 cup of white chocolate chips (6oz - see above) for the 170g of white baking chocolate. The preparation is the same except that it states to add the vanilla extract after you remove the melted chocolate from the heat, to use parchment paper, and to use an 8 inch pan. The second time I made this, I made the chocolate layers in two batches. This allowed both layers to be even, and I also found the first time around that I had to reheat the chocolate after it sat anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camj0717"
},
"reviewBody": "The fudge was spectacular. There were a couple things i would change first is to use a bit of a smaller pan or not use all of the 8x8 pan to make the fudge a bit thicker. Also use some more white chips for the filling to get more of a mint flavor and to use more peppermint extract about 1 1/2 tablespoons. First time making fudge an im going to keep in making it,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABird218"
},
"reviewBody": "I doubled the chocolate and added extra mint and it was great. I made a big batch and gave it out as Christmas treats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shenzi96"
},
"reviewBody": "Fairly easy to make, very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kelly Jo"
},
"reviewBody": "Not good. Very hard consistency and not great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "damaboo"
},
"reviewBody": "This was my first attempt at making fudge and this was a fantastic receipe. I did follow the other reviewers suggestion to double the bottom chocolate and i left the white chocolate on the top. i found it difficult to take it out of my square pan so i started making it in my cheescake springpan. it came out a lot easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phartsock"
},
"reviewBody": "LOVE THIS RECIPE!!!!! The only thing I should've done was double it. It's so easy to make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "macattack"
},
"reviewBody": "I loved this fudge. It tasted like a peppermint patty. I highly recommend doubling the fudge layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matt Mock"
},
"reviewBody": "The recipe is so rich that the individual servings should be like after dinner mints. Thus, a double batch is not really necessary. Also, the peppermint flavor had an unpleasant tang, sort of like mouthwash. Perhaps that was the brand's fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Youngren Balentyne"
},
"reviewBody": "Very easy to make, virtually no cooking if you melt everything in the microwave. Kids love this fudge as well as some real sweet lovers.\nI also increased the mint by another 1/2 T, very minty but definitely did not ruin the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sulli3"
},
"reviewBody": "I was surprised it did not require the use of a double boiler. It was hard to get the temperature right to melt the chocolate and not burn it then it cooled so soft that you could not really pour it. (I'm talking about it literally taking about 10 to 15 seconds to cool enough to not be workable.) The perfectionist in me hated that I could not regulate the temperature enough to actually pour it and get a smooth layer... It looked so sloppy. The flavor was so-so. There are better recipes out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda P"
},
"reviewBody": "Turned out great! I did things a little differently with what I had on hand, but yum! \nI used 1 bag of semi-sweet MINT chocolate chips for the bottom and white chocolate chips for the top. I didnt try and triple layer it, just two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ninks"
},
"reviewBody": "I was looking for a quick no fuss treat to take to the family holiday meal and came across this recipe. I doubled the ingredients and put it in a 13X9 cake pan. It was great. My kids were disappointed when there were no leftovers to bring home. They have been begging me to make it constantly. I have had several family members call and ask for the recipe. Everyone can't get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking with the girls"
},
"reviewBody": "We made simple changes:\nCrushed candy canes instead of the extract (my daughter loved crushing them, and what else do you do with all the candy canes?)\nWe doubled the receipe and used equal parts white chocolate chips as chocolate so our fudge was equal chocolate and peppermint. One other change- we only did 2 layers, chocolate on bottom and peppermint on top. Super easy and both my girls love making (and eating) it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaberkley"
},
"reviewBody": "Really simple recipe and tastes great! I would also recommend to double to the recipe to get a nice thick piece of fudge. I made it a little easier and I didn't do the three layers, instead I layed all of the chocolate on bottom and then topped with the mint mixture, still has a nice presence I added green food coloring to the white chocolate mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith Smith"
},
"reviewBody": "The more complicated fudge recipes are usually reviewed as \"grainy,\" which some people seem to like. Who actually likes grainy fudge? I followed this simple recipe instead and it was perfect. I poured the fudge into a buttered pan of smaller than 9-by-9 dimensions which helped keep it a bit thicker. (Other reviewers have pointed out that with a 9-by-9 pan you might need to double the recipe to keep the fudge from being too thin.) I used Ghiradelli 60% cocoa chips, which my wife pointed out are technically bittersweet as opposed to semisweet - but it was absolutely fantastic. By the way, I liked the fudge to be chilled and she preferred it room temperature. Try it both ways to see how you like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nick DiOrio"
},
"reviewBody": "It just didn't have that fudgey texture and the mint got tiresome pretty quickly. Still satisfies a chocolate craving though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eden"
},
"reviewBody": "DO NOT MAKE THIS!!! I could not help myself and probably gained 10 pounds... seriously :) Super easy to make as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L B B"
},
"reviewBody": "Although this is a \"lazy\" fudge, this was easy and tasted good! will probably make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeniseM"
},
"reviewBody": "I made this fudge exactly as the recipe states and as far as I'm concerned it's perfect.\nMy 13 yr. old granddaughter couldn't stop eating it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aubrey Iacobelli"
},
"reviewBody": "ALWAYS a crowd pleaser, this one. :) Looks beautiful and tastes fresh and cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I layered this fudge in a different way for St Patrick's Day. I created the fudge layer then melted and molded the mint white chocolate chips so there were two different textures and tastes. They both worked out well. I am not such a fan of confectioners coating and prefer real vanilla or chocolate chips. All in all it was a fun recipe to tweak!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "love...love...love this fudge!!! I made it one time for a party and have been asked to make time and time again! soooooooo goood!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "traveler"
},
"reviewBody": "This turned out wonderfully! I gave it with a bunch of other treats to my neighbors at christmastime and it was favorite my many!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolynd"
},
"reviewBody": "Big hit during the holiday season!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "This fudge could have turned out much prettier had I followed the directions. I started this about 30 minutes before I had to leave the house; therefore, I didn't have time to chill it properly between layers. I did chill the bottom layer, but after putting on the mint layer, I immediately added the top chocolate layer. The fudge still turned out okay looking, and it tastes amazing. We are big chocolate mint fans, so this was a popular one in this house. I was also fortunate enough to find mint chips at the store, so I used those instead of the white chips, flavoring, and food coloring. Great, easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "candy4brandi"
},
"reviewBody": "i made this tonight for a bake sale at my daughters school and it turned out great! Next time i would probably only use half the peppermint because i don't like such a strong pepermint taste, but everyone that sampled it loved it just the way it was! i was also thinking next time i would use a girlscout thin mint cookie crumb bottom with or maybe without the peppermint all together! all in all great fudge!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jean-Henri Weldon"
},
"reviewBody": "This turned out more like chocolate candy than fudge. The taste was great but the texture was closer to a candy bar than fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbeth"
},
"reviewBody": "Really great flavor and super easy. I usually change recipes, but this one I followed exactly and it came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "futurivleegr"
},
"reviewBody": "This came out wonderfully. I saw on the past reviews that it may be a little thin. I would say that it was thinner, but I was making Christmas gifts with it and it was the perfect size for little slices. Next time I might double the chocolate though, just for a more aesthetically pleasing piece"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lacey"
},
"reviewBody": "mmmmm this is just yummy! My son kept asking if he could have another piece!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Momof5boys"
},
"reviewBody": "Not as creamy as I'd hoped and the flavor was a little blah. I'll keep looking for that perfect mint chocolate fudge recipe like I've had at Amish farms, but this definitely wasn't it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alisa"
},
"reviewBody": "Great quick recipe. Very easy to make. Was a little confused because I was unsure what the melted consistency should be (1st time fudge maker). The mixture was very thick but completely melted. I only did 2 layers; chocolate on bottom and mint on top. Definitely let the layers cool for longer than 10 minutes.The peppermint was a little too strong for me but, my husband disagreed. I used the white chips. The ingredients in the confectioners coating was off putting(palm kernel oil). Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer Cannon"
},
"reviewBody": "I am a seasoned cook and baker...I tried this recipe...and I have no idea why anyone said it was fine...mine came out creamy? never got hard...I ended up using it as a topping for another dessert...\"I just don't get it\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Beasley"
},
"reviewBody": "I love the taste of this, followed the recipe exactly using premium Gharadhalli white baking chocolate for the middle. Yummy Andes mint taste. However, I will not be making it again and gave it only 3 stars because it was very, very greasy for me. Maybe I did something wrong, not sure, b/c I see so many glowing reviews. When I put each layer in the pan to refrigerate, a layer of \"grease\" formed each time on top. I sopped it up with paper towels and continued. After refrigerating for several hours, the fudge set up, but was very hard to cut, and I could not get the whole thing out of the pan (waxed paper just tore). After only 10 min sitting on the counter, it began to get greasy again (though not soft). Will not be giving as gifts as planned, probably will throw out the rest, sadly :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GarlicQueen"
},
"reviewBody": "I doubled the recipe to fit in a 9x13 pan. I used 6 cups of chocolate chips in total and about 4 cups of white chips for the middle. If it gets really thick and hard to spread, put a dash of milk it works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keilypie"
},
"reviewBody": "This was pretty good tasting and the texture was nice. It was not very easy to work with though. I had to pat down each of the chocolate layers with my hands. i would have never gotten it to smooth out otherwise. Everyone who had some loved it though! UPDATE: The second batch was perfect to work with. I did the melting in the microwave, slowly. I think the first batch got too hot on the stove!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Moody"
},
"reviewBody": "Super easy and delicious. My first time making fudge and it was a huge hit! Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lsutton12"
},
"reviewBody": "Very easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty S."
},
"reviewBody": "I made this fudge for a bake sale at my church and it was a hit! I was so good. I plan on making it again to give as a gift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christines Comfort Food"
},
"reviewBody": "these are so good and beautiful to look at too! makes a great gift"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "GREAT fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eastergirl"
},
"reviewBody": "looks awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "I just adore this fudge, totally heavenly. I was a little concerned when I read a few of the other reviews about there not being enough chocolate. I doubled the amount of chocolate fudge and used the amount of mint fudge as stated. It created a wonderful deep fudge, next time I think I will also double the mint fudge just to make it look more appealing. The mint fudge was not too strong, just a wonderful refreshing flavor. Its so easy to make, I know I will me making this again and again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loves2Bake"
},
"reviewBody": "Really yummy and easy to make. However, there wasn't really enough for both chocolate layers and the whole thing turned out really thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri S."
},
"reviewBody": "I made this as a Christmas Day dessert and it turned out fairly well. It seemed that the peppermint layer was a little thin though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kwelch"
},
"reviewBody": "Takes extra time to make than 'regular' fudge, but this was a huge hit! I also made another batch, with the idea in mind to make the middle layer almond. I used almond extract, and everyone LOVED my 'chocolate cherry' fudge. Go figure! Not even a hint of almond. So if you want chocolate cherry fudge, just add almond extract instead of mint! lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "center layer crumbled and wasn't smooth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie P"
},
"reviewBody": "Very good, easy to make. Make sure you use the right amount of sweetened condensed milk to the chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "I thought this tasted more like candy instead of fudge, and my mint layer never set. Maybe because I used chips instead of coating? But, that being said... as a candy it is very delicious, perhaps even better than fudge would have been. The soft center layer makes it hard to give as gifts, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "recipes need gluten"
},
"reviewBody": "just made these yesterday-so easy, so fool proof. No matter the variation these will turn out great. I used pb chips, butterscotch chips and white chocolate with almond extract for the layers SO good. I need to hide these from me-will be added to the yearly Christmas baking. Thanks Keri for recommending these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "just made these yesterday-so easy, so fool proof. No matter the variation these will turn out great. I used pb chips, butterscotch chips and white chocolate with almond extract for the layers SO good. I need to hide these from me-will be added to the yearly Christmas baking. Thanks Keri for recommending these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cee Word"
},
"reviewBody": "First time I made this the mint was over powering. My second try i substituted and changed one thing ...I used mint chips, just like andes mints. This year i used orange extract instead of mint ...wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill and Scott"
},
"reviewBody": "Awesome recipe! I doubled the chocolate part of the recipe (not the mint center). I put them in the fridge to harden for about 2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I don't understand the high rating. I made one like this last Christmas but figured I would try it again, assuming the problem may have been something I did. Sorry, but this recipe didn't work for me. The chocolate never gets melted enough to pour, and then it is really too sticky to spread. If you are planning to use an 8x8 or 9x9 inch pan, you really need to double the recipe. On top of it, since the mixtures don't melt enough, it is impossible to get nice, even layers. It tastes okay, but both times has been the least popular baked good at Christmas parties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Amber"
},
"reviewBody": "This was a huge hit when I brought it to a Halloween party to share. I doubled the recipe and made nice thick pieces of it so that the layers would really stand out. I got lots of compliments on this one! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CupcakePolly"
},
"reviewBody": "i made this last year and everyone loved them. quick and easy and hard to mess up. I used white chocolate chips for the middle layer. I put the first and second layer in the freezer to chill faster. I layered the pan with foil which i lightly greased. No problems getting them out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trac689"
},
"reviewBody": "Very good but I think reminded me a bit of a breathe mint. Probably won't make again solely based on my personal preference. I was very creamy &amp; easy to make just not quite my cup of tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Farofoxx"
},
"reviewBody": "I made this recipe but decided to double it so I could fill a 9x13 dish instead of just an 8x8 or 9x9. It was just the right amount of ingredients, except for the condensed milk. DONT ADD 2 CUPS TO THE CHOCOLATE! I ended up with slightly gooey chocolate and very stiff white chocolate. I would adjust the ratio so I added less to the chocolate by maybe half a cup and added it to the white chocolate instead? Also, have extra white chocolate chips on hand, my one bag was just not quite enough to fully cover the middle layer. Otherwise, this recipe was delicious and my friends loved it too! Very simple and I felt better not using sticks of butter like other recipes call for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci-in-Cali"
},
"reviewBody": "I would start out with 1 tsp mint extract or less.. Too much tastes like tooth paste IMHO!.. Good recipe though!.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyh2008"
},
"reviewBody": "Super Easy and Good. This fudge really impresses others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ckoula"
},
"reviewBody": "This is a great recipe but I have made a different one in the past. All of the chips were doubled and you only did one bag at a time in the microwave so the chocolate didn't get hard while waiting for the layers to cool. Never had ANY problems doing it this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cook4U"
},
"reviewBody": "This was easy to make and turned out very good! I made it in a 9x5 inch loaf pan. I did one batch of green and one batch of red. Special thanks to Keri for helping me out with this on the recipe exchange. I'm giving these as Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "I just gave this out at work this morning and it's 8:30 and I've had 4 people call or email me for the recipe. This is the best. I doubled and made in a 9x13 pan and it worked great. I layered the bottom of the pan with wax paper and then sprayed the wax paper with pam so once I could pry it out of the pan, it just came right off. woo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Smith"
},
"reviewBody": "Like many before me, I made one substitution and switched out the confectioner's coating for white chocolate chips and 2T canola oil. Results were amazing: great presentation, simple recipe, and delicious taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I have made this fudge for quite a few years and my family &amp; friends love it. Very easy to make, not too sweet and actually the peppermint helps to settle the stomach also. I make a batch of red and then green so I can mix them when giving out.\nSusan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeusaCozinheira"
},
"reviewBody": "I made 1 1/2 batch of the chocolate layer and kept the mint layer as written. This was soooooooo good. Another reviewer wrote that the peppermint flavor was too strong. I disagree, I think it's perfect. Also be careful b/c if you add the extract while the confectioner's coating is too hot the flavor will cook off. Take the pan off the burner, then stir it in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tizzylizz"
},
"reviewBody": "Nice smooth texture, super easy! Used Creme de Menthe instead of extract because that was all I had. It worked fine, just not as strong of a mint flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keri"
},
"reviewBody": "I can't believe I haven't rated/reviewed this recipe yet! It's a great fudge recipe - the ONLY one I've ever been able to make where the final result was nice and smooth, not grainy. I also like to change this up a bit sometimes by making the middle layer a different flavor. I've used orange and raspberry with great success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alix Raymond"
},
"reviewBody": "2nd time I've made this fudge...first time was a disaster. Great flavor, but the mint part wouldn't even spread. This time, wasn't thinking and doubled BOTH the chocolate and the white recipes. OOPS! Definitely doubling the white is great to top the 8x8 pan, but you do not need to double the chocolate. Use a full 14oz can of sweetened condensed milk for each the chocolate and the mint, and it will be great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "This is so good, just melts in your mouth. Made it last year for a work bake contest and won 2nd place!!! Everyone wanted the recipe for it. I'm going to make it again this year for a fundraiser bake sale at work. I did double the recipe and used a large rectangular glass dish and it worked out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cheflynn"
},
"reviewBody": "Perhaps I've done something wrong. I found that only 12 oz. of chocolate chips didn't make a lot of fudge to divide in half. Plus, when I used white chocolate chips in lieu of baking chocolate, the white chocolate mixture gave off a watery residue. I ended up throwing away the white chocolate portion, sprinkled some Andes candies pieces on top of the first half of the fudge and covered it with the balance of the chocolate fudge. If I make this again, I will follow the recipe exactly. I also found 8 oz. of condensed milk from a 14 oz. jar didn't leave much left for the white chocolate portion (I used a liquid measuring cup to measure the 8 oz). I'd be curious to know if anyone else had this same problem. Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carey"
},
"reviewBody": "Very good, similar to Andes mints. I found the mint flavor a bit too strong, though, I would halve it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "freetochange"
},
"reviewBody": "This was so smooth and creamy. It tasted just like an Andes mint. I also added a few mint chocolate chips to the middle layer just before I put it into the pan for some extra texture. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelica Zaldivar"
},
"reviewBody": "This was a marvelous recipe!!! I made it for a bake sale fundraiser, and everyone wanted to know how to make it, and they all commented on the fact it tasted like Andes Mints...:D I made two batches, the first I did as directed, and the second I actually decided to sprinkle chopped up pieces of Andes, it was FANTASTIC!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyshea N Wilske"
},
"reviewBody": "This recipe was super easy and turned out exactly as promised. After reading some of the reviews I was worried the fudge would be too thin, but it was the perfect thickness. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "branchan"
},
"reviewBody": "I don't usually give bad reviews, but right now I have an 8x8 pan of chocolate mint goo sitting in my fridge that hasn't set, despite being in there ALL night! I followed the recipe exactly, except I had to use evaporated milk sweetened with sugar instead of sweetened condensed milk. Probably the cause of the problem, though I read another review that did the same and had it turn out fine...so I don't know. I probably won't try this again. [UPDATE] I tried this recipe again for my boyfriend's sake and it turned out perfect. This time I had the evaporated milk and as soon as I opened the can I realized why my first attempt looked more like soup. I'm not a big fan of fudge but he loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracyc"
},
"reviewBody": "Wow, was this easy! Instead of mint, I did a raspberry layer! Yummy! Although this doesn't make a thick fudge, I think it is perfect cut into small pieces and put into candy cups. As others have mentioned, you could double the chocolate layers to make it thicker, however, I prefer bite size pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "xoOrgullosaox"
},
"reviewBody": "I liked it, but everyone thought they looked unappetizing (the green threw people off) , and they didn't fully set. They were actually the only pieces of fudge that were left in my fridge after the night was done."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/91736/layered-mint-chocolate-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
"name": "Trusted Brands: Recipes and Tips"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/482/trusted-brands-recipes-and-tips/eagle-brand/",
"name": "EAGLE BRAND®"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/91736/layered-mint-chocolate-fudge/",
"name": "Layered Mint Chocolate Fudge"
}
}
]
}
}
, "about": [
]
}
]