				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lazy Perogies"
,"datePublished": "2019-08-07T18:40:02.000-04:00"
,"dateModified": "2022-06-21T13:48:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tonja Popowski"
,"url": "https://www.allrecipes.com/cook/598013"
}
]
,"description": "Making traditional perogies is a lot of work. These lazy perogies give you their delicious flavor in a casserole instead. Lasagna noodles divide layers of cottage cheese, cheesy mashed potatoes, and bacon and onions."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/deexLCwQGm3veaeNJ82Hl8olRVg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6636380-03d28e9b8f554a24984ecdb170fedca7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lazy Perogies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "22"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "271 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "46 mg"
,"fiberContent": "2 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "689 mg"
,"sugarContent": "4 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"9 uncooked lasagna noodles",
"4 large baking potatoes, peeled and cut into 1-inch chunks",
"0.5 cup milk",
"1 tablespoon butter",
"1 teaspoon onion salt, or to taste",
"salt and black pepper to taste",
"1 cup shredded Cheddar cheese",
"1 pound bacon",
"1 onion, chopped",
"2 cups dry cottage cheese",
"1 egg",
"1 teaspoon onion salt, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in lasagna noodles 3 or 4 at a time, and return to a boil. Cook noodles, uncovered and stirring occasionally, until cooked through but still firm to the bite, about 10 minutes per batch. Drain well in a colander set in the sink. Lay cooked noodles flat on waxed paper or aluminum foil while you finish cooking remaining noodles."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x11-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Place potatoes in a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Using a potato masher, mash potatoes with milk and butter until smooth. Stir in 1 teaspoon onion salt, and season with salt and pepper. Set the mashed potatoes aside to cool. When cooled, mix with shredded Cheddar cheese."
} ,{
"@type": "HowToStep"
,"text": "Place bacon in a large, deep skillet. Cook over medium-high heat, turning occasionally, until evenly browned and almost crisp, about 10 minutes. Place onion into the hot bacon fat, and cook and stir until onion is translucent, about 8 minutes. Break bacon into pieces with a spoon or spatula. Set bacon and onion aside. Mix cottage cheese, egg, and 1 teaspoon onion salt in a bowl."
} ,{
"@type": "HowToStep"
,"text": "To make the casserole, place 3 lasagna noodles into the prepared baking dish, and spread with cottage cheese mixture evenly. Top cottage cheese with 3 more lasagna noodles, then spread potato-cheese mixture in a layer. Top potato layer with 3 more noodles, then spread bacon and onion in an even layer on top of the casserole."
} ,{
"@type": "HowToStep"
,"text": "Cover the casserole with aluminum foil, and bake in the preheated oven until cheese is melted and the casserole is hot, about 30 minutes. Allow to set for about 10 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This casserole was beyond good, I made it at the beach and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggiegirl"
},
"reviewBody": "Loved this recipe! I stayed pretty close to the recipe as written. The only changes I made were to use half cottage cheese and half ricotta, which was tasty. Also, I left out the bacon since I am vegetarian. The mix of flavors reminds me of an authentic pierogi flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aatkins64"
},
"reviewBody": "Would definitely make again. May add some shredded cheddar on top to make it a bit cheesier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anne Olson"
},
"reviewBody": "This is very similar to a recipe I use. I use the \"Oven Ready\" lasagne noodles and regular cottage cheese, thus skipping a step. For those that found them bland, try my version's addition of 1 tsp. of garlic powder and 1/2 tsp. celery salt to the cottage cheese mix, reducing the onion salt to 1/2 tsp. in this step. Of course serving with sour cream always helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Savory"
},
"reviewBody": "I made this for dinner tonight and had it assemble in 30 minutes or so with the aid of my three little girls. I think the key to the \" lazy\" is planning ahead. With \" leftover mashed potatoes\" from a previous dinner cut down our prep time very much. In the 12-15 minutes it took to cook our noodles, we caramelized our onions slightly, fried our bacon and combined all the potatoes and cottage cheese ingredients together. I added minced garlic to the onions just before removing from pan. Also added a pinch of sour cream to the potatoes as I would do to my pierogis normally. ( usually used cream cheese but had none ) most family of 8 likes big and bold flavours and some don't. Therefore if you want more \"zing\" in this recipe then add it, if you don't want more \" zing\" leave it alone! I found it a good, simple dinner idea! Reminds me of a pierogi pizza I used to get!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "Pretty good. Took a long time to make. I think I was in the kitchen cooking/assembling for between 45min to an hour. I think I would have liked a different top layer under the bacon/onion mixture other than just a noodle layer, but wasn't sure what, so I didn't change it. If I make it again will definitely need time. No one here seemed to eat the leftovers (and there was a lot), even though they liked the casserole. I liked mine with sour cream on the side to dip each forkful into."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "slowcooker"
},
"reviewBody": "I thought these were okay, a little bland, but okay. My husband wasn't fussy at all. In fact, he wondered why I even bothered, as the frozen-in-a-bag variety have more flavour. I'm giving it three stars because I think the idea is creative and that there is something to be had here, I'm just not sure what can be done to improve this recipe, but perhaps someone else can build it on to make it something a little more flavourful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katies mom"
},
"reviewBody": "Made for my crew at work, they are perogy crazy. They loves this. I used the fresh made sheet lasagna. and did one layer with cottage cheese and cheesy mashed potatoes, another layer with cheesy mashed potatoes, fried sausage and onions and the top layer with reamaining potatoes, baked for just over an hour. Put grated cheese mixed with chopped bacon and chopped green onions. Placed on top after it came out and covered until cheese melted, served with sour cream and a salad..They were in heaven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LizzyReed"
},
"reviewBody": "Awesome! I agree...the name does not suit it. How about Pierogi Casserole?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "I substituted some chopped cabbage for the bacon to make it vegetarian and it was delicious. Would also be great with bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim C."
},
"reviewBody": "This was very good! I used the entire box of lasagna noodles. A word of warning, however...although I have never made \"real\" pierogies, and I'm sure it's time consuming, this recipe is not quick and easy as \"lazy\" in the title would have you believe. It took me quite a while to assemble the ingredients...I would say well over an hour...and maybe closer to two!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dorothy Burton"
},
"reviewBody": "made this with home made noodle dough (flour, 3 eggs and 1/2 tsp salt) rolled thin and left in 4x6\" pieces. Absolutely delicious and a perfect dish for a church potluck! Also I used cooked, diced back bacon in the potatoes and bacon in the cottage cheese layer just to add variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ACAMRON"
},
"reviewBody": "So delicious and totally possible to make a healthier version...I used non-fat cottage cheese, skim milk in the mashed potatoes and turkey bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twiggy"
},
"reviewBody": "I wouldn't dare attempt traditional pierogies, but this is the perfect substitute. NOT healthy, but oh so good. My husband (who grew up on polish food) loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie "
},
"reviewBody": "This is a great way to have an entire perogie casserole....great taste with all the flavours of perogies and easy to warm up as leftovers. I added a layer of steamed finely-chopped cabbage. I substituted ricotta for the cottage cheese and omitted the onion salt. This would be a great pot luck contribution....lots of flavour but fussy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kassondra"
},
"reviewBody": "I love this recipe! Perogies without the work! The only change I made was to chop the onion end to end so I had thin strips; then I sauteed the onion on low (don't let them burn, this takes a while) until they were the color of caramel. True comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajandjer"
},
"reviewBody": "This was wonderful. DO NOT USE NO BOIL NOODLES. I did and they were a little tough. I will also use ricotta cheese next time in place of the cottage cheese, and 3 cups not 2. My Baba made these when I was growing up, and perogies are alot of work. I am also going to lightly stir fry some shredded cabbage and onions in butter and add that as a layer also. All and all these were just yummy, with that old fashioned flavor. Thanks for the great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neo"
},
"reviewBody": "I had to laugh at the person who wanted to know what was so lazy about these Perogies lol Obviously she has never spent all day making the traditional ones - which are amazing by the way. This was a fast and easy way to get a similar taste in a fraction of the time. I even tweaked it a little and used salt pork instead of bacon to match more closely with my authentic recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mr Science"
},
"reviewBody": "I may be rating this higher than I should. It is very time consuming, tastes only fair and has far more Calories: 271 | Total Fat: 10.4g | Cholesterol: 48mg than I would ever feed all the thin ladies that party with us. If there were only guys coming over it would be a fifferent story."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213183/lazy-perogies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213183/lazy-perogies/",
"name": "Lazy Perogies"
}
}
]
}
}
, "about": [
]
}
]