				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lebanese Mountain Bread"
,"datePublished": "2017-07-12T00:33:12.000-04:00"
,"dateModified": "2022-11-23T14:48:12.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "This Lebanese mountain flatbread dough is stretched very thin and quickly cooked in a hot cast iron skillet. Perfect for wraps or dipping in hummus."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xvES9FlzJs_1zDpQ9F-prJDFcTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4535952-8112d00174cf4ce4924b135a1b3d0a82.jpg",
"height": 960,
"width": 1440
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5513531847001",
"description": "Chef John’s favorite flatbread!",
"duration": "PT8M19S",
"name": "Lebanese Mountain Bread",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/c7b96d7d-1697-4c3c-8527-9a86b392cd03/bde9e48b-0649-4fa5-b070-928f2519b3e4/1280x720/match/image.jpg",
"uploadDate": "2021-07-28T08:45:27.079-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lebanese Mountain Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "31"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "47 kcal"
,"carbohydrateContent": "6 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "181 mg"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 cups bread flour, divided, or more as needed",
"1 teaspoon active dry yeast",
"1 teaspoon white sugar",
"0.5 cup warm water",
"1 tablespoon olive oil, plus extra to coat bowl",
"0.75 teaspoon kosher salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place 1/2 cup flour, yeast, and sugar in a mixing bowl. Pour in warm water. Whisk together thoroughly, 2 to 3 minutes. Cover bowl and let sit until mixture gets bubbly, 30 to 60 minutes."
} ,{
"@type": "HowToStep"
,"text": "Drizzle in olive oil; add salt and remaining 1 cup flour. Mix together until mixture forms a sticky (not wet) dough ball that pulls away from the sides of the bowl. If mixture seems too wet, add a bit more flour."
} ,{
"@type": "HowToStep"
,"text": "Lightly flour a work surface. Knead dough until it is soft, supple, and slightly elastic, about 2 minutes. Pour a few drops of olive oil in a bowl. Transfer dough ball to the bowl and turn to coat surface with oil."
} ,{
"@type": "HowToStep"
,"text": "Cover bowl and place in a warm spot. Let dough rise until it has doubled in size, 60 to 90 minutes."
} ,{
"@type": "HowToStep"
,"text": "Transfer dough to a work surface and knead to remove air bubbles, about 1 minute. Transfer to a resealable plastic bag; refrigerate, 8 hours or overnight."
} ,{
"@type": "HowToStep"
,"text": "Lightly flour a work surface; dough may be sticky so make sure you use enough flour to keep dough from sticking to the surface or your hands (but less flour is best). Break off a piece of dough slightly smaller than a golf ball. Roll into a smooth ball. Flatten and roll out into a circle about 1/8-inch thick."
} ,{
"@type": "HowToStep"
,"text": "Invert a smooth mixing bowl on the work surface; lightly flour the bottom. Lightly stretch the dough and place the dough circle on the floured surface of the inverted bowl. Gently stretch dough evenly down the sides of the bowl, working your way around the edges, until it is very thin and translucent, or as thin as you can get it without tearing it."
} ,{
"@type": "HowToStep"
,"text": "Heat a cast iron skillet over high heat. Flour your hands and carefully remove the dough circle from the bottom of the bowl. Transfer to hot skillet. Cook until blisters form and begin to brown, about 45 to 60 seconds per side."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xvES9FlzJs_1zDpQ9F-prJDFcTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4535952-8112d00174cf4ce4924b135a1b3d0a82.jpg"
}
]
,"text": "Transfer to a dish and cover to allow bread to steam and stay moist and supple."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT600M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ellie Zimmerman"
},
"reviewBody": "I found it too dry and a tough finished product, not soft and supple as it was supposed to be. I didn't even add all the flour. I may? try to make it again using considerably less flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "juliebensinger64"
},
"reviewBody": "I followed the stated recipe and it was very easy to make. While the bread was good, I felt it was too chewy and not light and fluffy like other Lebanese breads I’ve enjoyed. I used bread flour, so I will try again with all purpose to see if it will have a lighter texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ken Myers"
},
"reviewBody": "(1) increase the water you put in sponge from 1/2 cup to maybe 1 cup; \n(2) when you remove dough from fridge, make sure you let it come to room temp before you do next steps; \n(3) cooking these on high for 45 sec per side may very well burn them, depending on your burner strength. I found about 25 sec on medium high got each side fully cooked;\n(4) in the video, Chef John seems to roll /stretch the next one out while the first is cooking, but I think the time is too short, particularly if your cooking time is less like mine was, so I suggest you pre-roll/stretch all of them out before you start cooking.\n\nFULL DISCUSSION/REVIEW:\nFirst, I am a big Chef John fan, have loved a lot of his recipes. If you have not tried his Pita recipe, try it, it's great. However, I feel on this one he phoned in the written recipe as it does not match what he does in video. \n\nFirst, the recipe as written is significantly drier than what he is using in the video, starting from the very first sponge he makes. His sponge looks almost like pancake batter, whereas if you follow the recipe which calls for a sponge with a 1:1 ratio flour to water, you're sponge will be much thicker, more like cookie dough. Due, at least in part, to this drier dough, it was not possible to stretch it nearly as thin as he does in the video, as it starts to tear almost immediately when you start the bowl stretching."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rochelle"
},
"reviewBody": "I love this bread! I’ve made it a few times, today I made a double batch because I’m always disappointed when it’s gone. It’s tender but elastic, perfect for folding into a sandwich or eating by itself. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Oliver"
},
"reviewBody": "CJ, again you stepped up and pleased the whole family! I agreed this bread will now replace our flour, corn, naan and pita fix! You definately do not need to buy store made wraps of any sort, you can adjust the recipe to suit the meal and make either larger or smaller versions of this recipe, thanks again for another job well done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lezann9"
},
"reviewBody": "Made it using exact ingredients. The only thing I didn’t do was the stretch on the bowl. I stretched it by rolling it. Worked great with your gyro recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wegenka-Moretti"
},
"reviewBody": "This has become one of our favorite recipes! It took a few times making it to get the hang of the technique, but the video in this recipe really helped. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This is awesome! I did have trouble at first with the stretching and having some tearing of the dough. After a bit, it was easier. I think it might be as it becomes more room temperature it becomes more pliable rather than right out of the fridge. Three of us ate the whole batch with Chef John's recipe for American Gyros! Yummmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Was not difficult to make and I found it rather easy to stretch out. Be sure to add the additional flour gradually. I dumped in too much initially and had to fuss with it a bit to get a dough with a good consistency. This is a great textured bread though I feel if you will be eating it on its own it could benefit from additional salt. If you will be adding fillings then don't increase the salt so whatever ingredients you put in will shine through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "I used whole wheat flour. Definitely double the recipe. Also, golf ball sized balls of dough aren't large enough. Need to double that to get a good size pita."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haroldo Altamirano"
},
"reviewBody": "Tastes like pizza dough but is like a stiff-ish tortilla. I would cut down on the salt. It’s too savory (like pizza without condiments). \n\nI 4x this recipe since we eat a lot of tortillas. I recommend not making only 8 servings.\n\nYou can also make this more low carb by having the added flour be part gluten-free flour. I made the flour sponge with allpurpose like normal. However, I added half flaxmeal for the next step’s addition of flour. It does not stretch as far but it is still thin and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dryad"
},
"reviewBody": "The best flatbread ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matthew Pumphrey"
},
"reviewBody": "I'm SURE it was a user error but the dough seemed to be too dry by the time I added all the flour. I also had an issue with the bread tearing during the stretching. Probably due to it being too dry. I will be making it again and I have high hopes still."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annad3333"
},
"reviewBody": "I’m making this bread for the third time. First two times, it was amazing. My whole family loved it. Very good recipe. And much easier to make than I thought it would be. Don’t be intimidated by having to stretch it out. I alternate between stretching it on a bowl and rolling it out with a rolling pin until it gets big enough. I’ve found that works best for me. Watch the video if you need help. I didn’t think it was quite as easy to stretch as he makes it look. But it’s not too bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth "
},
"reviewBody": "So good with hummus! It is just hard to wait until day two to cook it. Kind of cruel not to mention that at the start of the video! Stretching over the bowl is fun once you get the hang of it and then it is so much faster cooking than the pita bread recipe. Plus I find that it puffs up much better. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renate"
},
"reviewBody": "I made this for pizza! Homemade pesto, garden tomatoes and mozzarella slices! 425 oven for 12 minutes and YUM! This was perfectly taught and presented! I made it as written with delicious results! Thanks again Chef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anzapp2"
},
"reviewBody": "DELICIOUS bread recipe and I highly recommend. BUT I suggest adding in the second round of flour slowly, the first time I made this, the 2 cups made it much too dry and there was no going back. Which should be done with all bread recipes...but I was being impatient. It’s amazing with Chef John’s gyros, tzatziki, and any kind of grilled lamb!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billme123"
},
"reviewBody": "Wow is this worth it. Made 1/2 batch before and the other after overnight refrigeration. Noticeably better after refrigerating but great either way. This taste better than the naan I get at Indian restaurants. Used with chef John felafel and tahini sauce. Excellent combo. For me a big difference was cooking 30 seconds on each side TWICE rather than 45-60 secs at once. Less burn and a GREAT air rise to create a nice pocket for the felafel"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steve K"
},
"reviewBody": "Made it with All-purpose flour. It was still very good. Alas, I slept in a bit and it took longer than 9hours and 38 minutes to make...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Made this just as written. Family loved it. Even my 12 year old granddaughter like this, which she usually doesn't like anything that is homemade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Fejeran"
},
"reviewBody": "Thank you Chef John! \n\nThis recipe is delicious!There is a learning curve on the stretching over the bowl technique. I used bigger dough balls and did less rolling out, more stretching by hand.\n It's so much easier and more fun to make than a traditional loaf of bread. \nAlmost no clean up and just tastes so darn scrumptious! Hold me back!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "Tasty and easy to make, with a slight crisp to its softness. The dough ended up being too dry even with thorough mixing however, upped the olive oil to 2 tbsp and it made the perfect tortillas for taco night, thanks Chef!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/259099/lebanese-mountain-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
"name": "Flat Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/259099/lebanese-mountain-bread/",
"name": "Lebanese Mountain Bread"
}
}
]
}
}
, "about": [
]
}
]