				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lebanese-Style Red Lentil Soup"
,"datePublished": "2019-07-10T02:59:44.000-04:00"
,"dateModified": "2022-09-06T15:00:47.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jen Yagoobian Pfister"
,"url": "https://www.allrecipes.com/cook/1396214"
}
]
,"description": "This Lebanese lentil soup recipe is a tangy, spicy Middle Eastern dish made with red lentils, cilantro, and onion flavored with cumin and lemon juice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ks3m0NZQOMMiLKPUOA6K9MrwN50=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/291193-lebanese-style-red-lentil-soup-cookinmama-4x3-1-1966e7bfdb6f4cb5a5ba5f428313bdf9.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lebanese-Style Red Lentil Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "313"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "276 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "9 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "524 mg"
,"sugarContent": "3 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"6 cups chicken stock",
"1 pound red lentils",
"3 tablespoons olive oil",
"1 large onion, chopped",
"1 tablespoon minced garlic",
"1 tablespoon ground cumin",
"0.5 teaspoon cayenne pepper",
"0.75 cup fresh lemon juice",
"0.5 cup chopped cilantro" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring chicken stock and lentils to a boil in a large saucepan over high heat. Reduce heat to medium-low, cover, and simmer for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, heat olive oil in a skillet over medium heat. Stir in onion and garlic; cook until onion has softened and turned translucent, about 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir onion mixture into lentils; season with cumin and cayenne. Continue simmering until lentils are tender, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Purée soup in a standing blender or with a stick blender until smooth. Stir in lemon juice and cilantro."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "els2586"
},
"reviewBody": "Wasn't a fan. I followed the recipe and it just tasted too lemony. Very overpowering. Not enough seasonings. Rudimentary flavor profiles. Not anything close to what I've tasted before. I wouldn't make it again or recommend it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Lee"
},
"reviewBody": "I had this style of soup in a mediterranean restaurant. It was garnished with garlic pita chips. This recipe is pretty close to tasting like it. I made some crushed chips to sprinkle on top - brush a pita bread (thin pocket style ones) with olive oil and sprinkle with garlic powder, then cut up in small pieces and bake on a cookie sheet till crisp. Savoury and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delish"
},
"reviewBody": "This was delicious! I cooked everything in one pot starting with sauteing the onions and garlic. I put a little less lemon juice than called for and reduced the cayenne by 2/3 and put in a little paprika instead. Salt to taste at the end and added some ghee right before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samar Jadeed"
},
"reviewBody": "This soup was so delicious! I didn't have some of the ingredients and added some stuff to make it heartier so here are some changes I made: \n- we're vegan so I used vegetable broth instead of chicken broth. \n- used red onion instead of white (ran out) --Added 4 chopped red potatoes and 3 carrots to the last 15 mins of it simmering. \n-used the juice of 2 lemons \n-didn't use a blender as the red lentils fell apart nicely. \nThe cilantro is a delicious addition! Will be making again for sure. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JENSJON"
},
"reviewBody": "Doubled the cumin as several others suggested. Left out cayenne with kiddos. Otherwise made as written. Expected lemon to be overpowering but it wasn’t, which is a good thing...wouldn’t change it. Good change of pace soup but not sure I’ll make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Schenk"
},
"reviewBody": "This soup was delicious! I did add carrots and sweet potatoes, but it was approved by all 5 kids! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saber"
},
"reviewBody": "Very easy to make. I used my instant pot and pre-soaked my lentils so it was fast and easy. Very tasty also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex animates"
},
"reviewBody": "My Armenian Mommie made this often. She didn't use cilantro in it but going to try it with the cilantro next time. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "Loved it! My riffs on the recipe: Add 1tblsp sweet curry to oil w garlic. Then add finely chopped cilantro leaves, shallots, mushroom, onion, celery and carrot to sautée. Put all into boiling lentils. Lentils will soften after 20 min or so. Add juice of 1/2 lemon to soupHand blend some - not all. Leave some pieces of veggies. Garnish w cilantro leaves"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ipdf3"
},
"reviewBody": "Delicious soup. I wound up having to sub in shallot and harissa for the white onion and cumin because I ran out of both without realizing it but the soup still came out amazingly well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria E H"
},
"reviewBody": "I made it. My whole family loved the flavor and smoothness of this soup. Easy to make in 30-40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suziematoozie"
},
"reviewBody": "This soup is ridiculously good!! I did sauté diced carrots with the onion and garlic. Did not have fresh lemon or cilantro, so instead I put in a hefty amount of lemon pepper seasoning, ground coriander, and some smoked paprika, leaving out the salt, cayenne pepper, ground black pepper, fresh cilantro, and lemon juice. So basically subbing what I did have to mimic the original of those particular ingredients, while trying to stick as closely to the recipe as I could! And I ate so much of it I was almost miserable, that’s how delicious it was!! Thank you for sharing this awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "veggiediva"
},
"reviewBody": "Bland, too much lemon. Doubled the other spices. Wouln't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Ransom"
},
"reviewBody": "I would definitely make this again. Very tasty. Next time I may add some sweet potato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney Fry Ridder"
},
"reviewBody": "THIS IS FABULOUS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney Ridder"
},
"reviewBody": "I made this vegan with vegetable broth. OUTSTANDING."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Richard"
},
"reviewBody": "Most of my changes were because I'm too lazy to go shopping. Also, if it helps, I'm not normally one for spicy. I find that the additions I made resulted in a soup that was warmly spiced but not HOT.\n\nI doubled the amount of cumin, plus a little bit more, added a little water, and used one cup of veggie broth because I didn't have enough chicken. I also used waaaaay more garlic than the recipe calls for. Also I added some chili powder. I juiced 3/4 of a lemon because that's what I had without going to the store. This is AMAZING. It feels like a warm hug to your stomach. I will be making this in this way for a long long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mademoseille"
},
"reviewBody": "I loved it. Its simple, yet flavoursome. I decreased the lemon juice to my own taste. I can see this to be firm favourite in my home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NurseCarol1974"
},
"reviewBody": "This soup is very easy to make and turned out pretty good. I used a slow cooker so I didn’t need an immersion blender. I added carrots and a little curry powder. I served with lemon wedges so everyone could add lemon juice to taste. Thanks for the recipe:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae Eyers"
},
"reviewBody": "I make this often, and don't bother pureeing. Easy, delicious &amp; cheap--it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Gorley"
},
"reviewBody": "I made it according to the recipe, and the lemon juice overpowered everything else. I used bottled juice because I didn't have fresh lemons, so perhaps that was where I went wrong. It tasted amazing before I put the lemon juice in, so I really regret that I didn't just skip it. I would warn you to add the lemon juice to taste! Also, it needed more liquid than called for, but that could be because I live in a dry climate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KChannel"
},
"reviewBody": "This is delicious... After living in Lebanon for years with all the wonderful cuisine, I was hungry for this soup. I added more cumin to the recipe and cooked lentils with Maggi Cubes to get the full flavor. Made huge pot and it was gone before I could have a second bowl. I will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MiniMoo"
},
"reviewBody": "Super easy and nutritious. I added more cumin and omitted the cayenne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scourge of the Kitchen"
},
"reviewBody": "Delicious! The proportions in the recipe would make way more than I wanted, so I cut them down at random rates. I would be careful of how much you want to make in relation to what the recipe asks, and coordinately scale it down, rather than just guessing. Mine was a bit too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Ogden"
},
"reviewBody": "One of my favourites. Easy, healthy and kid friendly if you go easy on the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "Excellent soup. I made it vegan by using a vegetarian broth, and added 2 sliced carrots to the onions and garlic when sauteeing. Blended it to a very smooth puree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeAnn Matson"
},
"reviewBody": "This is one of my family's favorite fall/winter dishes. It's delicious and filling! You can play around with the spices too. I don't always have cayenne pepper and have played with chili powder, red pepper flake, paprika - all have worked well. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VeggieJunkie"
},
"reviewBody": "I changed the spices to 2 tsp cumin, 1 tsp smoked paprika, 1/8 tsp garam marsala, salt &amp; pepper. I added 3 grated carrots. I also only pureed 3/4 of the soup and added it back in. Best lentil soup I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ronit Friedlander"
},
"reviewBody": "I used a vegetable broth mix with water to make it vegan. I also didn't add the lemon or cilantro to it because I not that crazy for either. Instead I added some cheese, which I wouldn't do again. \nThe soup really does need the sour flavor to compete it. To do that I think I'll try some yogurt or sour cream as a garnish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliana"
},
"reviewBody": "I love this soup!!! I add a bit of turmeric :) its delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne-Marie Proske Berk"
},
"reviewBody": "Is this ever delicious! I rough chopped the onions and garlic and some carrots and sauteed them, then added to the soup at the end. Did everything else according to the recipe, except I used low sodium chicken broth. The soup is surprisingly savory and rich tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Williams"
},
"reviewBody": "This recipe is delicious, simple, and fast. I did not make this exactly as written, but I think this is so wonderfully simple that you can adjust easily to taste. I did not have any cilantro, so I added spinach instead. I omitted the cayenne and opted for black pepper. I added the lemon juice 1/4 of a cup at a time, and stopped at 1/2 a cup. I did not bother blending as the lentils had cooked down enough for me. I will be making this more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blaketob"
},
"reviewBody": "This is the best soup ever and is super easy to make! I do add carrot and celery with the onion and I omit the cilantro because I personally dislike cilantro. Otherwise, I follow this recipe exactly as written and it comes out great every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EyeDoc"
},
"reviewBody": "Great Recipe. Here is what I added: increased the cumin by 0.5 TBSP, added a teaspoon of tomato paste, teaspoon of Moroccan spice, half a teaspoon of tumeric, teaspoon of dried mint. I also added 1 carrot diced and 1 celery diced, as well as 2 cloves of garlic. I sautéed all of the vegetables with the onion, then added it half way through. I pureed half of the soup, and left the other half as is to give some texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "william"
},
"reviewBody": "Super good.. i added twice the broth but i big on broth.\ngreat flavor so easy and cheap.\n\n\n\nloved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anon"
},
"reviewBody": "This a great soup - very flavorful, tasty and fast! I have cooked it for a few years now and never get tired of it. I only omit the pepper because my kids don't like spicy. I double the cumin as others have recommended and never blend the soup. The lemon and the cumin make this soup, I make sure to use both of them as fresh as I can. It also freezes well for those nights when you need to feed little ones quickly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "always_hungry"
},
"reviewBody": "My husband ate most of the soup in one evening. I happened to make it on a cold, rainy day, so it was very comforting. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Oh boy this is good and EASY! I used brown lentils instead of red (don't think it really matters) and I increased the cumin and the lemon juice during pureeing until I was happy with the flavour - no real science behind it. Also added extra broth because after pureeing I found the soup to be too thick. Instead of cayenne I used home-made chili powder that I made from chilis I grew in my garden. We don't use cilantro in my household so I substituted with parsley, which in my opinion is more traditionally middle eastern. Sounds like I deviated a lot but really I didn't, just tweaked here and there to my liking. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nick J Alba"
},
"reviewBody": "I love lentil soup. But not this one. The lemon juice is overpowering, and I don't care for the cumin in this soup. I will not make this again, but stick with the excellent Greek Lentil Soup recipe that I found on this website."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wanderinggypsy"
},
"reviewBody": "My family and I love this recipe.It reminds me of the food I had in Syria."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rich"
},
"reviewBody": "I used a lot more garlic, a lot more cumin, added orange bell pepper, and ground turkey... Phenomenal!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheyenne"
},
"reviewBody": "Love, love this soup it's been a staple in my house for a few years now. I make it exactly like it says and don't forget the lemon. I also add fresh spinach, kale and sausage links when I need more. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andrea Losurdo Cassidy"
},
"reviewBody": "I loved this! My family hated it. Because of that I had to give it 3 stars. Definitely add the lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TeresaS"
},
"reviewBody": "I forgot to mention in my previous review that I did not include the cilantro since I do not like cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WFDinner"
},
"reviewBody": "I didnt do a pound of lentils (just enough for me) and I used a pressure cooker and added some chicken sausage and left out the cayenne (and forgot the lemon) and used fenugreek leaves instead.\n\nIt was more like a chicken dal and super delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dina Nash"
},
"reviewBody": "Is quick and easy but I'd omit the cayenne next time. It makes the soup the wrong color, too brownish rather than yellowish. I also put it into the Vitamix and it became too smooth. I like to see some texture of the lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Po95"
},
"reviewBody": "Thank you! I've been looking for a recipe like my Syrian family makes and this is exactly what I have been looking for! I also throw in a small handful of rice along with the lentils if I'm having it as dinner instead of an appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Azure Wilson"
},
"reviewBody": "L-O-V--E. This was fast, easy, and delicious. I have to admit, I used bottled lemon juice since I didn't have fresh, but I can only imagine it would be even better with fresh! As a note, 1 lb of lentils equals about 2 1/4 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nihilistic Kitten"
},
"reviewBody": "Absolutely delicious, and so simple. I just love it, thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Keener"
},
"reviewBody": "Just made this soup! I added grates carrots and doubled the cumin. Used one pot first to sauté the veggies then set the in a plate to cook the lentils. I used the cayenne because...we like spicey. I used my submersion blender but only buzzed my soup a little to keep some texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brookela"
},
"reviewBody": "This was a delicious and refreshing recipe. I followed Ahmad Ghosheh's advice and forwent the cayenne pepper in favor of black pepper. I was looking for a lentil soup recipe that would mimic my MIL's (she's Egyptian and I LOVE her cooking), and while this didn't taste the same, it was a great alternative soup. Definitely had that delicious middle eastern tangy/savory flavor. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTRmenian"
},
"reviewBody": "This soup is incredibly flavorful, much more so than I expected it to be. The only changes I made were to cook the onions and garlic in a large pot, add the spices to the onions, and then add the lentils and broth to that pot, in order to save the flavors and juices from the onions and garlic. I also threw in half a cup of bulgur to the lentils and broth in order to add a little more protein and fiber. I did not puree the soup. The soup is good with or without the lemon juice. Without the lemon juice, you get more of the cumin flavor. Thanks for sharing this delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEWAGNER1"
},
"reviewBody": "Exact same soup I grew up with and wow! I had missed this soup so much. This is tasty stuff. My only suggestion is don't add all the lemon juice at once. Add some and taste. I use a lot less lemon juice but this may be personal taste. Thanks JENP1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni Losada"
},
"reviewBody": "Good, very very easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hailey11"
},
"reviewBody": "I agree with Amahad about the cayenne and cumin. But I use fresh tomatoes while simmering and do purée. My ex Mother-in-law is Egyptian and she taught me her way. She sauté some tiny noodles in butter and adds after it purée 's just to soften."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie C."
},
"reviewBody": "I saw no reason to cook the onions and garlic separate...I sautéed them first and added the spices, broth and lentils. I used about 1/3 c lemon juice at the end and a liberal amount of cilantro. This soup is excellent. It Is also attractive and I would not hesitate to serve this to company. Thanks, JENP1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Eden"
},
"reviewBody": "I was looking for an authentic Lebanese Lentil soup, this is an excellent recipe. I did find that there was too much Cumin and Lemon so I scaled the Cumin down to 1 1/2 tsp and the lemon to 1/3 cup and it is now perfect for my taste. Tip: don’t let it simmer for more than 20 minutes or it will be too thick. It is great on a cold winter Canadian day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esi ChicHerbivore"
},
"reviewBody": "Very good soup and easy to make. Instead of chicken stock I created my own stock with Edward&amp;Sons \"Not-Chick'n\" bouillon cubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I followed the recipe exactly and thought it was great. The lemon was a bit overpowering, which is why I didn't give it 5 stars. Next time I make it I plan to cut that back quite a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NanC"
},
"reviewBody": "simple...didn't need to puree...and since I am not fond of cilantro I used Parsley instead...added a bit more spice than call for....delicious and SO quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leslina21"
},
"reviewBody": "add dried mint for a turkish flare!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chloe"
},
"reviewBody": "Red lentil soup is awesome. If you haven't had it, try it. Omit the cayenne though. You might want to add a bit more cumin. I also omitted cilantro (imo, it tastes like soap). I used vegetable broth in order to make this vegetarian. Also, if you cook this a little longer, pureeing the soup is unnecessary -- red lentils will quickly dissolve on their own with no assistance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "niwalls"
},
"reviewBody": "What a fantastic recipe! Thank you SO MUCH.\nI agree with some posters about the Cayenne pepper though - whilst I like spicy and did eat ALL of it, my Hubby and kids couldn't eat it - too spicy. So next time I might try just a bit of fresh cracked pepper. Otherwise perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I've made this soup many, many times now. I love it. My friends love it. I made it for a friend who was recovering from heart surgery and he not only loved it, but asked for the recipe and now makes it himself. I usually skip the cayenne pepper, as I'm a cumin fiend! I also don't puree this soup, as I think the texture is perfect the way it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "botin2it"
},
"reviewBody": "Great flavor; halved the recipe; found it a bit too thick; will add more liquid next time.\r\nSecond time I made it: Made fresh veggie stock; 1 c lentils, 1 TBSP cumin, no cayenne, baby spinach, TBSP lemon juice (bottled) - not 3/4c and Matouk's hot sauce (1/8 tsp) at end after pureeing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bcorbin91"
},
"reviewBody": "Well done as a base starter. As per suggested, I doubled+ the cumin to get it closer to the Lentil soup that I'm served at a local Indian restaurant as that is what first hooked me! I also used vegetable broth as that is what I had in stock. I did saute 2 celery stalks and 2 carrots with the onion and put 4 cloves of garlic- I can never have too much garlic. I let simmer for about 30 minutes, then added the sauteed vegetables and let simmer for another 45minutes to an hour, until the carrots were completely soft. I used the immersion blender to puree and wow. Wonderful. I add cilantro/lemon squirt only when served and not in the entire soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Delicious! I added carrots to the onions/garlic, puréed only this mixture after sautéing. Cut cayenne in half and added 1t of salt to lentils. Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trixyinaz"
},
"reviewBody": "UPDATE: Made this again and made some more changes. First, I used 8 cups of homemade Vegetable Broth (Worlds Greatest Vegetable Broth listed on this site). Then I added 1 carrot (cooked the SWEET onion until translucent, then added the garlic and finely diced carrot). I upped the cumin to 2 tablespoons and added just a little less than a 1/2 teaspoon cayenne pepper and 3/4 teaspoon turmeric to the mix. Did NOT add the white pepper this time around (good call on my part). I also added 1/2 teaspoon of salt because I didn't salt my broth. I added about 3/4 cup lemon juice (freshly juiced), but continued to added more to my bowl separately. My husband said I NAILED it. He loved the added heat and said it was perfect. Thank you for such a great base recipe that allows changes easily. While it is not exactly like the soup we get at our local Lebanese restaurant, he LOVED it.\n\nORIGINAL REVIEW: Great base recipe. Had to make some changes. First, I used vegetable broth (going vegan) in place of the chicken broth. After simmering for 20 minutes, I noticed the soup was way too thick so I added the rest of my broth (I used a total of 64 oz. of broth) and it was still very thick so I added some water (maybe 2 more cups). PERFECT! I let it simmer some more while I finished the rest of the prep. We felt it was a little bland so we added a lot more cumin - sorry, didn't measure, just kept adding until we liked it. Left out the cayenne pepper and used white pepper instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke Laurel"
},
"reviewBody": "I really liked this. I dry-roasted the spices in a pan before adding them, just to release a bit more flavour. Also, I'd add the lemon juice to taste, as the lemons we get here in my neck of the woods are very acidic/bitter - I'd go gradually! Wonderful recipe, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay H"
},
"reviewBody": "Very good soup! While the lentils simmered, I dry-toasted the spices (double cumin + crushed coriander and smoky chipotle paprika), then added the oil, onion, and garlic. When the lentils were nearly soft (20 mins?), I added cubed carrot and sweet potato for about 15 mins, then leftover chicken at the end, and served over couscous. Next time, I'd add a dried dundicut pepper to the simmer time to add a bit of overall heat and flavor. Also needed salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NIROOLA"
},
"reviewBody": "My boys loved it! Followed other suggestions by doubling the cumin and black pepper. Threw a pat of butter into the bowl before adding the soup to make it richer for my kids. Added a sprinkle of ground sumac on top to give it that extra authentic flavor. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveCoffee"
},
"reviewBody": "Wow this was so simple but so good! I added the lemon to taste and ended up adding just over 1/4 cup. I did use the immersion blender but you could certainly get away w/out it if you diced the onion small enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruby"
},
"reviewBody": "Great recipe. Really yummy, and pretty easy, especially if you skip the blender, which is unnecessary.\n\nNext time I will try a little less lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shansen"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ali"
},
"reviewBody": "This was really delicious up until I added the lemon juice, it was way too much for me and drowned out all of the other flavors. Doubling the cumin helped. Next time I would only put a tiny bit of lemon, otherwise it was really delicious and healthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "The recipe was a great starting point for me to build upon, My daughter is a vegetarian so I substituted vegetable broth for the chicken broth, and I added cubed potatoes, diced carrots and threw in a can of pinto beans. Awesome, hearty soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jadedgurl"
},
"reviewBody": "This has been a favorite in our family for some time - we dont use cilantro we use middle eastern mixed spices, garlic, pepper and lemon. for added flavor you can add some carrots and potatoes to the soup and blend right along with the lentils.\nEveryone from Grandma - right down to my kids love this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitzi Cikra"
},
"reviewBody": "Really good and easy! Followed recipe almost exactly, just subbed fresh parsley for the cilantro. I added lemon juice. I actually tried a taste w no lemon juice, then one with the fake lemon juice (didn't do a thing), then the fresh lemon. Definitely use fresh lemon! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "v~"
},
"reviewBody": "very good but excellent for our taste preference with few changes others mentioned. First we added sauted onion, celery, carrot and quartered grape tomatoes at the end and stirred them in to maintain some crunchy texture. We also added 1 1/2-2 x cumin and extra hot Hungarian paprika, again our pref for spicy things. Per others rec to 1/2 the fresh lemon juice and add to taste worked for us and we stopped at 1/4-1/3c. Thanks for great recipe as with all recipes, they have to be tweaked to everyone's own preferences."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUMAHA"
},
"reviewBody": "So delicious! I loved the lemon flavor and I think this will be in my regular winter rotation. I added some small star pasta that I had on hand to make it a little more of a complete meal. I think next time I might add some chopped celery and carrot too. I decided not to blend it just due to personal preference. I found that 2 1/2 lemons gave me the juice I needed. Also, 1 lb of lentils was about 2 1/2 C. I did have to add about a quart of water because it got pretty thick as the lentils boiled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "supernan"
},
"reviewBody": "I LOVED this soup. I added a couple teaspoons of turmeric and didn't bother puréeing, but otherwise followed the recipe almost exactly. So delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin from Roseville, MI"
},
"reviewBody": "I loved it and thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Manos Emms"
},
"reviewBody": "Delish! I used Split red lentils - so they cooked a little faster. Also, did everything right in the stock pot. Sauteed onion, garlic, 2 carrots and 2 celery stalks in olive oil. Then added stock (used 2 boxes = 8 cups) and then added rinsed lentils. cooked everything until tender. Then, did a quick whir with the immersion blender. Added less lemon juice. Fast, easy, inexpensive and healthy. A winner! PS: Could also be served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bipppp"
},
"reviewBody": "This recipe is easy, delicious, filling and comforting - and so cheap to make! I halved the recipe because I live alone (there are plenty of leftovers for the week). Since I didn't have cayenne on hand, I used black pepper, plus a little ground red pepper for kick. I will definitely be making this again! It's hard not to over eat it :) I think this would be great with carrots, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "halfnotes"
},
"reviewBody": "This was good and spicy. I added 1 cup of chopped celery and 1 cup of chopped carrots and sauteed them with the onions in 3 Tbl. of butter instead of olive oil. I added the garlic when the onions were translucent. I was nervous about adding the full amount of lemon because others had said it was too strong. So I only did 1/3 cup of lemon. I couldn't taste the lemon at all so I will do 3/4 cup next time. I'm glad I added the celery and carrot. I think the soup would have been a little boring otherwise. It was pretty spicy for my kids, but they still enjoyed it. I did add a little sour cream to tone it down a bit and that tasted good as well. We aren't cilantro fans so we didn't add any. I will definitely make it again, but I will probably add a little less liquid next time. I think I'd like it better more as a chili and less of a soup. It was pretty thick as written, but I'd like it even a little more so. Yum! good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Crum"
},
"reviewBody": "I added a bit of turmeric and included some extra vegetables I had around. Turned out great, would have been good without the additions as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "libbylou972"
},
"reviewBody": "This is very similar to my the soup at my favourite Lebanese restaurant. It's just so comforting. I followed the directions exactly and was very pleased. I want to make some fattoush with this... what an authentically yummy lunch that would be!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tory Byrd"
},
"reviewBody": "SOOOO GOOD!!! I used brown lentils (that is what I had) and I just added the onion and garlic after 20 min instead of cooking them. I didn't blend because I like the texture of the whole lentils. Will definitely be making this regularly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sam Az"
},
"reviewBody": "Cut out the pepper and doubled the cumin. Added the onion/garlic at the end. Had to add waaay more broth to make it more like a soup than dal (indian curry)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreenGoddess"
},
"reviewBody": "This satisfying dish is a favorite 'go-to' when I'm not feeling motivated to cook. I sub veg. broth for chicken, leave out the cilantro, and often add carrots (and rarely do I blend it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NDAVENPORT"
},
"reviewBody": "this was super easy to make and tasted good too. I too didn't blend all of the soup. I blended only about half of the soup so there would still be chunks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPARKLER8666"
},
"reviewBody": "I am giving the recipe 5 stars because it is a great basic recipe from which many variations are possible. As written I am sure it is delicious, but I completely went rogue on this one and did my own thing just using the recipe only as a guideline. I wanted something a little heartier so... I browned lean ground turkey in a little oil and added a chopped red onion near the end. Added the spices (3x as much cumin and and equal amount of ground coriander) after the onion got soft. Deglazed with some vermouth and reduced. Added the garlic and heated that through. I subbed black pepper for the cayenne and added a finely chopped potato and some chopped celery leaves. My red lentils were pre-split so they cooked quickly in the chicken stock, but I also added a 15 oz can of tomato puree and a can of petite diced tomatoes with onions and all the juice from it. I squeezed 1/3 of a lemon into the pot and wedged the rest of it and served it, the cilantro and some finely chopped fresh cherry tomatoes on the side. It turned out beautifully and was very filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lisastarfish"
},
"reviewBody": "too lemony"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AAA"
},
"reviewBody": "Absolutely fabulous! I added more cumin and some carrots. I also didn't blend it very much either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbturnip"
},
"reviewBody": "So delish and simple, my daughter (1year old) loves it, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cniedziela"
},
"reviewBody": "This was a big hit in our house. Reminded us alot of split pea soup with a slight kick. It has a creamy smooth consistancy and pairs well as side dish to a baked potato, sweet potato or even a ham sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MACHALTER"
},
"reviewBody": "Easy and good. Added a couple sticks of celery too, and had folks add their own lemon and cilantro. A keeper and healthy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "countrymyst"
},
"reviewBody": "After reading everyone's reviews, I realized just how versatile &amp; forgiving this recipe is...use what you have &amp; don't worry about what you don't! I used vegetable broth instead of chicken stock. Added some sliced carrots and celery as I sauteed the onion and garlic (if you get a bit of browning on the veggies it brings out more flavor).\n\nI reduced the cumin to less than half of what's called for, and added dried thyme &amp; ground coriander (sorry, I didn't measure...just a good shake into the palm of my hand). Fresh tomatoes cut into chunks &amp; added at the finish are wonderful...along with a bit of coarse sea salt.\n\nSadly, the cilantro I had on hand wasn't the freshest, so I decided not to use it...also left out the lemon juice...but will try both next time.\n\nThis has just enough heat to not be overwhelming; this comes from someone who doesn't like hot, spicy food...in fact my husband was surprised that I was enjoying it, since the heat was just right for him :)\n\nThanks for this recipe...it's found a permanent home in my recipe box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Had wanted to replicate a Lebanese Lentil soup from a nearby restaurant. This is even better! I didn't use the cayenne, used vegetable stock instead of chicken (as we're vegetarians) and used parsley instead of cilantro. DELISH! The lemon juice and cumin MAKE IT!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/139262/lebanese-style-red-lentil-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14726/soups-stews-and-chili/soup/beans-and-peas/lentil-soup/",
"name": "Lentil Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/139262/lebanese-style-red-lentil-soup/",
"name": "Lebanese-Style Red Lentil Soup"
}
}
]
}
}
, "about": [
]
}
]