				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lemon Cupcakes"
,"datePublished": "2020-06-18T23:39:39.000-04:00"
,"dateModified": "2022-11-18T11:46:37.000-05:00"
,"author": [
{"@type": "Person"
,"name": "friedbluetomato"
,"url": "https://www.allrecipes.com/cook/3790217"
}
]
,"description": "This lemon cupcakes recipe makes a light, tart dessert from scratch with a fluffy whipped cream icing. Simply delicious, melt-in-your-mouth treats."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UO_69OGuQi9G2mNPCKG4L3UD054=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5154425-lemon-cupcakes-AllrecipesPhoto-1x1-1-4f3ad60a12cb4528b08d8a9f91d0aaa4.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2920842549001",
"description": "See how to make light, lemony cupcakes from scratch.",
"duration": "PT4M11S",
"name": "Lemon Cupcakes",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/07/25/201921_Lemon-Cupcakes_ZAKIAH_5154425_original-4x3-1.jpg",
"uploadDate": "2021-07-07T02:38:44.260-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lemon Cupcakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "569"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "232 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "64 mg"
,"fiberContent": "0 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "260 mg"
,"sugarContent": "17 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"3 cups self-rising flour",
"0.5 teaspoon salt",
"1 cup unsalted butter, at room temperature",
"2 cups white sugar",
"4 large eggs, at room temperature",
"2 tablespoons lemon zest",
"1 teaspoon vanilla extract",
"1 cup whole milk, divided",
"2.5 tablespoons fresh lemon juice, divided",
"2 cups chilled heavy cream",
"0.75 cup confectioners' sugar",
"1.5 tablespoons fresh lemon juice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Line 30 cupcake pan cups with paper liners."
} ,{
"@type": "HowToStep"
,"text": "Prepare the cupcakes: Sift flour and salt together in a bowl. Beat butter and sugar together in another bowl with an electric mixer until light and fluffy. Add in eggs one at a time, beating after each addition to incorporate. Mix in lemon zest and vanilla."
} ,{
"@type": "HowToStep"
,"text": "Gently beat flour mixture into butter mixture, 1/3 at a time, alternating with 1/2 of the milk and 1/2 of the lemon juice after each of the first two additions of flour. Beat until just combined; do not overmix."
} ,{
"@type": "HowToStep"
,"text": "Fill the prepared cupcake liners with batter, 3/4 full, and bake in the preheated oven until a toothpick inserted in the center comes out clean, about 17 minutes. Let the cupcakes cool in the pans before removing them to finish cooling on a rack, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make the icing: Beat cream in a chilled bowl with an electric mixer set on low until cream begins to thicken. Add confectioners&#39; sugar and lemon juice, a little at a time, beating after each addition, until fully incorporated. Increase the mixer speed to high and beat until the icing forms soft peaks, about 5 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UO_69OGuQi9G2mNPCKG4L3UD054=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5154425-lemon-cupcakes-AllrecipesPhoto-1x1-1-4f3ad60a12cb4528b08d8a9f91d0aaa4.jpg"
}
]
,"text": "Spread icing on cooled cupcakes. Refrigerate leftovers."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "A little on the dry side but overall taste was phenomenal. Iced with Lemon Buttercream Frosting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "I enjoyed the cupcake overall, it has a subtle lemon flavor so that it is not too overpowering, which is nice. I added more lemon juice to the frosting as you can’t taste the lemon with the amount given, I tripled the amount and it was better flavor-wise in my opinion. Everybody that tried them thought the cupcakes were great. I recommend adding lemon curd in the middle like I did for an added kick of lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "They were great but not the best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mai Gabby"
},
"reviewBody": "Fluffy, delicious cupcakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gem"
},
"reviewBody": "I halved the recipe but apparently overlooked measuring out the milk in half. What a happy accident as it actually what made the cupcakes turn out moist and less dense. This was my 3rd time making these and the previous ones were not as moist as I wanted them to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DemeChef"
},
"reviewBody": "These are very tasty cupcakes! The recipe really does make enough for 30 cupcakes, so make sure you have your pans ready. Simple and pure flavors, they were especially scrumptious made with lemons from my MIL's tree. The whipped cream frosting is SUPER easy! I've made these twice in the past week - special request for my son's birthday. I did reduce the sugar to about 1/4c in the cream frosting because my family doesn't like things to be too sweet. These are a new 'go to' for lemon cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Cybulski"
},
"reviewBody": "Like many others I didn't have self rising flour, so I added the baking powder. They turned out beautifully. I messed up the icing by not using confectioners sugar (used powder sugar). I like the ideas others had about using a raspberry buttercream frosting and will try that next time. These tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "I followed the recipe and baking time exactly. The cupcakes turned out dense, dry and overcooked. I had to remake these. In doing so, I added more lemon juice so the batter wasn't so thick. I then baked them fro 12 minutes instead of the 17 minutes. They turned out much lighter and moister."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakerGirl347"
},
"reviewBody": "I was looking for a recipe that wasn't too sweet and this recipe was perfect! It also wasn't too hard to make. I definitely recommend it for parties and just when you feel like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Justme222"
},
"reviewBody": "We made the cupcakes with a lemon fresh off the lemon tree. The cupcakes were fine but neither of us thought they tasted like a lemon cupcake. We couldn't detect lemon flavor at all. Very disappointing. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Faith"
},
"reviewBody": "I'm not sure what happened with this recipe. I halved the recipe and followed the instructions EXACTLY! The cupcakes did not rise enough. They were SMALL, DENSE and DRY. NOT HAPPY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaela Johnson"
},
"reviewBody": "These just came out of the pan, and two have been sampled! We are not bakers, only making cakes or cookies from scratch 1 or 2 times a year, so, my fourth grader and I read through the recipe, read through the comments, and carefully followed everything to the best of our ability. We were a little nervous because we were halving the amount, and weren't sure how that would work out. Knowing that we like strong flavors we did NOT halve the lemon juice. Since our oven runs a little hot, we reduced the temp to 350, and took the cupcakes out after about 15 minutes. We noticed the oils that other commenters had mentioned, but they were just in the pan and on the papers, the cake is not at all greasy. The only spots that browned were where we had overfilled the cups and the cake was touching the pan after rising. The texture of the cake is perfect. My personal preference might be for slightly less sugar and slightly more lemon, but we'll see after they are iced!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Randee"
},
"reviewBody": "I made these for a friend's birthday celebration, followed directions exact! They burned in the oven the next batch I made I lowered the temp to 350 and they were fine! I don't know if it was my new oven or just that the temp was too high. otherwise the cake was very good. I made a cream cheese lemon icing that was very good. I would recommend baking these at 350."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodieme99"
},
"reviewBody": "The cupcake were light and not too sweet. A great lemon flavor. The only change I made was I added a quarter teaspoon of salt instead of half a teaspoon. I would definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Chan"
},
"reviewBody": "This recipe is absolutely delicious. I have made this recipe a couple of times and it never fails to delight. The whipped topping is superb. I added lemon juice liberally and some corn starch to stabilise the cream. A change i would suggest is to substitute self raising with cake flour + 2 tsp of baking powder. I tried both types of flour and found the cake flour to produce fluffier, lighter cupcakes that complements the lemon flavour very well. I added blueberries as well into the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hazzura Hazura"
},
"reviewBody": "Successfully done. Didn’t make the frosting but it was still so yummy and easy to bake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marbella"
},
"reviewBody": "These cupcakes are very tasty and moist. They have a good amount of lemon when I added 1 cup of lemon juice instead of what it says to add. I highly recommend these cupcakes but I did not use the frosting. Instead, I used the Special Buttercream Frosting by Rick on this website and they came out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Izzy Bayus"
},
"reviewBody": "I thought it was amazing. I made my own glaze and it turned out great! I would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mekla"
},
"reviewBody": "Great recipe. I added double the lemon juice and zest as I like things to be really lemony. I piped Lemon Buttercream on top and they were delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gege Nkwo"
},
"reviewBody": "yummo!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Even"
},
"reviewBody": "These cupcakes were so moist and delicious! I used self-rising flour, and it came out perfectly! I recommend beating the sugar, butter, and eggs well to keep it light and moist. Also, I set the servings to 12. The adjusted recipe said 1.5 eggs, so I rounded it 2 eggs and the recipe still worked. One thing I don't like about this recipe is that I added extra zest and juice, but it wasn't lemony enough. Be sure to add extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kvkv"
},
"reviewBody": "In terms of flavor, this recipe is spot-on: very lemony, sufficient salt to mediate the flavor, and not too sweet. The cake batter is deceptively light, as the cupcakes turned out a little dense, which became evident once they were completely cooled. I tried making this recipe a second time, this time to make a cake. In order to combat the density, I only used half the egg whites. The cake batter was indeed more fluffy, and the baked cake lighter. The cake turned out delicious, served cold with hot coffee. The lemon cream frosting, in my opinion, is more suited to a cake than a cupcake, as the creaminess belongs more to the torte genre. I will be using a buttercream frosting henceforth when I make these in cupcake form."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maribeth"
},
"reviewBody": "I made this into a sheet cake and put cream cheese frosting on it. Bright it to work and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marishka"
},
"reviewBody": "Here are the changes I made from the recipe:\nI added raspberries to the top and almost doubled the amount of lemon in the recipe. Also “self rising flour” means flour with baking powder already in it (so if you have all-purpose you have to add 1 tsp of baking soda per cup of flour)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wenger"
},
"reviewBody": "These were great! I did make a couple changes. No self-rising flour so used 1 1/2 c. all purpose, 1 1/2 c. cake flour. and 3 tsp. baking powder. I used 1/2 c. butter and 1/2 c. safflower oil. Used a little extra lemon juice in cupcakes and added lemon zest to the frosting as well as about a tsp. of vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Kerby"
},
"reviewBody": "I added raspberries and grated lemon on top of the frosting as a bit of decor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AyakaSki2018"
},
"reviewBody": "add 3 tsp. of baking powder if using regular flour, and a little more lemon juice and zest. i also recommend buttercream frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carter"
},
"reviewBody": "I loved these! So tangy and delicious. [If make as a cake add five more minutes to timer.]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lumi N Michael Bianconi"
},
"reviewBody": "These are AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farah"
},
"reviewBody": "This recipe is for how many cupcakes and what do I do if I need less"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Irene"
},
"reviewBody": "While these cupcakes are flavorful they were very dry. I followed the directions with no changes so not sure why these were so dry. Good lemon flavor but not a tangy sharp lemon flavor which I would prefer. I even filled the cupcakes with a lemon curd to get more tangy lemon flavor. If it wasn’t for the dryness these cupcakes would be a 4 or 5 star recipe. Great frosting although the instructions say to mix for minutes and it it only needs about a minute. While this is tasty I won’t make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jah-Man"
},
"reviewBody": "BEST CUPCAKES EVER. Light, fluffy and absolutely delicious. We had to sub almond milk once and they still turned out. Wow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana Dutiel"
},
"reviewBody": "I'm sure that these are delicious and as closely as I followed the recipe, they didn't turn out great. However, I gave this recipe 4 stars because I am not the best baker. So, I'm sure others who are great bakers could make these lemon cupcakes taste delicious. Mine turned out a little dry and bland. What did I do wrong? I need the \"secret\" to making cupcakes - because I am missing something :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maya Manowiecki"
},
"reviewBody": "Like others I found my cupcake to be dense, however, this wasn't a big deal to me. In addition, they were on the sweeter side. One thing that I will do next time is to add more lemon, as I hardly tasted it. I also tweaked the recipe and filled the cupcake with lemon curd. Overall a decent cupcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veganlittleguy "
},
"reviewBody": "These were amazing. My family (5 cupcake aficionados)feel in love with these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adam Noel"
},
"reviewBody": "Very yummy, moist, and forgiving. I thought for sure I over beat the batter, but it came out very fluffy. Though, it didn’t have much lemon flavor in the cake itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cike85"
},
"reviewBody": "I followed the recipe exactly and the cupcakes came out beautifully. I frosted them with a lemon buttercream. very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cupcake Love"
},
"reviewBody": "I have made this recipe multiple times, and it's always been great. However, I decided to make some changes after the first few times I made it. First, I used half butter and half avocado oil (you can use any vegetable or canola oil for this, though) because the cupcakes will be a little dry if only butter is used. I have never tried the lemon cream icing that is included in this recipe- instead, I made some light, fluffy lemon buttercream. I just recently made these for a customer, and for a garnish, I candied some lemon slices and put them on top. It adds a great lemon touch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keira"
},
"reviewBody": "It is really great!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jac"
},
"reviewBody": "Made it for a dear friend’s baby shower. Due to our hot and humid weather, I used a lemon cream cheese frosting recipe (it holds its shape better) from another site instead. As the frosting was rather sweet, I halved the sugar for the cupcake. Other than that, I followed the recipe exactly.... It turned out great! Light and airy.... everyone loved it! Had a couple of requests for recipes too ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deerthemelon"
},
"reviewBody": "This cupcake is very delicious. We didn't even need to add frosting. This cake was very moist and lemony. I highly recommend. I didn't have a chance to taste the frosting though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Izzy"
},
"reviewBody": "Could have more of a lemon flavour for the cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANJ"
},
"reviewBody": "Beautiful subtle flavor; I paired it with a raspberry icing and WOW. Killer combination! They are delicious on their own without icing as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "I made this recipe without the icing. Reduced the butter a bit and added way more lemon zest and lemon juice. Super easy and light and fluffy! Definitely add more lemon to get that crisp flavor. I might make them with icing sometime but they are yummy without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia Desruisseaux"
},
"reviewBody": "This is a great recipe. Just the right amount of lemon. MMMMMMM...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Lynn"
},
"reviewBody": "Perfect as is \nDeeeelicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TigerMom"
},
"reviewBody": "Really light and fluffy and not too sweet. I cut the lemon extract to a half teaspoon and doubled the zest and juice so the more natural flavors could come through in the cake. I've also substituted buttermilk and added blueberries for an extra surprise. This is an easy recipe to halve if you don't have a need for 30 cupcakes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn Blair"
},
"reviewBody": "Found these on an Easter dessert list and tried it out. Loved the freshness of the lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "so very good , I love Lemon and this was perfect cup cake. I also used Lemon Cream frosting for more Lemon flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex"
},
"reviewBody": "Just made these today and I can see using this recipe over and over again. They are delicious and light, and I’m a huge fan of the homemade whip cream frosting. I love the suggestions for alternate flavorings based on the reviews and will try some of those in the future. For now, these will be perfect for our Easter celebration!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annamarie Darnall Hall"
},
"reviewBody": "These were a HUGE hit with family! We made a lemon glaze instead and drizzled it over the cupcakes, as my daughter had made these previously, and liked the cupcakes better without the suggested icing. Having said that, she still preferred them plain, but most of us LOVED it with the light lemon glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Aranda"
},
"reviewBody": "I made these for a baby shower and they were a hit! I'll be adding these to my go-to recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hwirtz"
},
"reviewBody": "these were really easy and tasty but I did make one modification. I added 2TBSP of lemon powder because I like in your face lemon flavor! I used a#24 scoop so the liners are only half full but they came out perfect for what I wanted!! Just enough room for frosting ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sydney Payne"
},
"reviewBody": "My friends and I loved these cupcakes. I did not use this icing and the first batch I made over baked, even though the time I set was less than the recommended time. Overall they were very good and I would recromend them for parties and family gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alcoholic John"
},
"reviewBody": "As far as Cupcakes go, what can I say there are none grander!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eddie P"
},
"reviewBody": "I substituted some sweetened coconut flakes for confectioners sugar in the icing...nice twist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joko"
},
"reviewBody": "The lemon cupcakes were divine, I did adjust the zest from TBS to tsp and they came out very lemony. I also made a lemon buttercream frosting instead, I tried the frosting in this recipe and it didn't turn out well for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JuniorChef"
},
"reviewBody": "I made these cupcakes for a potluck and they were great!! The cake itself was a little dense, but I also over beat the butter and sugar together, so only mix until fluffy. Also the cake was a little subtle in flavor so I added more (~1tsp more) lemon juice. When I made the whipped cream icing, I put 2.25 T of lemon juice, and added 1T of meringue powder to stabilize because I was piping it onto the cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzy"
},
"reviewBody": "I put more lemon juice and lemon zest in it and put less butter. I have made it many times. It tastes delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veta Wareing"
},
"reviewBody": "I didn’t use self raising flour which was my bad and the cupcake ended up being super dense. I also think more lemon needs to be added to the batter to make it more lemony but that’s just personal preference. on the other hand with the frosting I used cream cheese and added zest to it as well as a little extra lemon juice which turned out really good and was everyone’s favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy888"
},
"reviewBody": "They were very good and a hit at my friends birthday party! I didn't have unsalted butter so I used salted and omitted the salt in the recipe. I also used regular flour and 3 tsps of baking powder like another user recommended. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YoungChef"
},
"reviewBody": "Awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacklyn Bosscher "
},
"reviewBody": "It turned out amazing! They were sooooo good. The icing failed but the cupcakes themselves were excellent; so I didn’t put the icing on. I used food coloring for a silly twist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacklyn Bosscher "
},
"reviewBody": "It turned out amazing! They were sooooo good. The icing failed but the cupcakes themselves were excellent; so I didn’t put the icing on. I used food coloring for a silly twist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Tan"
},
"reviewBody": "This is not for a small mixer hahaha!\n\nA little too sweet, to be honest. But the texture was divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Osborne"
},
"reviewBody": "These are now my favorite cupcakes, the only thing I've done differently is I now use a raspberry frosting instead of lemon. Otherwise it's too much lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I made these for an adult birthday party, and they were perfect! Cupcakes are light and fluffy, and the frosting is perfection, not too sweet. The"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Gower"
},
"reviewBody": "Amazing cupcakes! I added extra lemon juice as some reviews said to give it a strong lemony flavour. I added about the juice of one whole lemon and they were perfect. I will make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luis Jessica Liu"
},
"reviewBody": "Really great cupcakes but they were very sweet. I would probably do half the sugar next time I make them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ealesh"
},
"reviewBody": "Next time I need to really cream the butter and sugar in step 1. the rest of the steps felt like I did it fine. The cake was good, but I didn't like the frosting at all (and I LOVE lemons!) not sure what I did wrong there. I need to try this one again with when I have some better baking skills, and see if it turns out better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rdkon25"
},
"reviewBody": "This was my first attempt at making any type of cupcake completely from scratch. I love anything lemon and this recipe was not only delicious but easy enough for someone like myself. The only change I made was rather than the self rising flour I used baking powder lime another review said. Also like I said I love lemon, so if you do to I would double the lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gilda George"
},
"reviewBody": "These cupcakes were amazing!!! I made them for my two year old grandson's birthday celebration. I took them to his school, and all the tots loved them. The texture was so light and fluffy, and the taste was so lemony and out of this world delicious. \n\nI only changes I made was that I used cake flour instead of all purpose flour and 3 teaspoons of baking powder.\n\nThis recipe is a definite keeper, I plan on using it whenever I need to made a superb, fresh tasting cake or cupcakes. \n\nThank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nisani Gunawardhana"
},
"reviewBody": "I just made the cupcakes, and halved the recipe. Instead of lemon juice and zest, I used lemon natural essence, and I baked them for 20 mins. This resulted in 14 delicious, fluffy, lemony cupcakes. I thoroughly recommend giving this recipe a go, it's very quick and easy to whip up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jade snow"
},
"reviewBody": "these cupcakes were so moist, fluffy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrownSugar"
},
"reviewBody": "Great recipe! My cupcakes came out very moist and delicious. The only change I made was to add 1/2 tsp pure lemon extract as well as the vanilla extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashlea Rock-Montalbano"
},
"reviewBody": "The flavor is excellent, however mine turned out like very flat muffins!!! I think I over filled but otherwise I followed the directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Mowbray"
},
"reviewBody": "Lovely cake, I'll definitely use this recipe again (with no changes), though I used the recipe for the icing from Lemon-Filled Cupcake from AR and filled these from the same recipe. They got raves from several sources where I served them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna P"
},
"reviewBody": "nice muffin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bill"
},
"reviewBody": "They were delicious. I made mini s and frosted with a lemon cream cheese frosting - they were a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lily211"
},
"reviewBody": "I loved making this and I made it sugar free it came out delicious I added more lemon zest and lemon juice....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kskelton"
},
"reviewBody": "Very good cupcakes my whole family love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "elkelley"
},
"reviewBody": "After reading a number of reviews I decided to add more fresh lemon juice than in the recipe as the cupcakes are for a party of a lemon-lover. Since only a dozen are needed for the party I cut the recipe in half ; doing so provided three cupcakes for taste testing. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Masty"
},
"reviewBody": "These turned out really good for me. I didn't have self rising flour, so I made some with baking powder and extra salt. I always use unsalted butter in my baking. I also decided to use whole buttermilk instead of whole milk. I bought some since most of my best cake recipes use them, and only picked this recipe out after I bought it. I thought that the tang of the buttermilk would work with lemon, and it did just great. The cupcakes were moist and tender. I also made a lemon buttercream frosting instead of this frosting, so I cannot rate that. I have to say that I ran out of lemon juice, so I added heavy cream to the frosting and it never curdled or anything. It was fluffy with a great hint of lemon, so I am really glad I gave it a shot. I was glad to have the sweetness of buttercream, but not the overly dense texture. \n\nI'm so happy to have a lemon cake recipe that works so well. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Hunter"
},
"reviewBody": "Delish! Great fresh lemon flavour! Used regular flour (and added baking powder &amp; salt) and buttermilk instead of milk (search tips on how to change the bpowder and bsoda)\n\nMade in a 9x13 glass pan with Ez for his 9th bday. Bake slightly less next time. But definitely make again. Made raspberry whipped cream for frosting. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I got rave reviews from my coworkers on this one. The birthday girl requested lemon with buttercream so I made half with the frosting it called for and half with my famous homemade buttercream. Birthday girl said it was a tie but all the rest said the frosting the recipe calls for was the best! Thanks for giving me another \"go-to\" recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Banu Mergen"
},
"reviewBody": "This one turns out to be the best cupcake I ever bake. They are wet and fluffy inside and taste really good. I used mandarin instead of lemon and for self-leveling flour I used 1 teasp baking powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakermom"
},
"reviewBody": "Made the cupcakes and they were a big hit with my friends. Lots of lemony flavor and the they were light and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Wessel"
},
"reviewBody": "Real easy and fun delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "I made these to send with my husband to his office, Everyone Loved these! I added extra zest and lemon juice to the batter, we like tangy lemon flavor. I also used a cream cheese frosting that naples34102 mentioned in her review. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdwerner"
},
"reviewBody": "Made these tonight with a friend! They turned out fantastic! Added extra lemon zest and juice to the batter and used some extra vanilla buttercream I had leftover from another cake I made (just added about a tsp of lemon extract to the buttercream)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AMHMC"
},
"reviewBody": "These were delicious moist cupcakes though the lemon flavor was extremely subtle. I used a lemon cream cheese icing but prior to that topped the cupcake with lemon curd to bring out more of the lemon flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "efos"
},
"reviewBody": "yummy! made with the meringue better cream and lemon curd frosting- really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyneer"
},
"reviewBody": "I made this exactly as the recipe specified. It's one of the best recipes I've ever made, and I'll definitely make it lots more! The frosting is light and delicious and a great idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diane Ryan"
},
"reviewBody": "The cupcake does not match the frosting.\n\nTHESE ARE MUFFINS. I had throw them out. So much time and energy. Total waste of both. \n\nDo Not Make these - horrible!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trice Sammy Antinoro"
},
"reviewBody": "1st - The flavor is good along with Texture excluding the \"frosting\"\n2nd - THESE ARE NOT CUPCAKES, these are biscuits that are in the shape of a muffin/cupcake.\n3rd - Does not have any lemon flavor at all and I zested and freshly squeezed the lemon. I made the recipe exactly as written and with all the correct ingredients. The frosting was essentially whip cream and again lacked the actual flavor of lemon. I never leave reviews but wanted to address that if you are looking for an actual cupcake this is not it. If you are looking for what tastes like a butter biscuit BOOM this is for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kokoscakes"
},
"reviewBody": "Enjoyed making it. Used SMBC as the topping instead. Really great. I wish a yield could be included though so one knows how many cupcakes can be obtained off a base recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRACI"
},
"reviewBody": "This is by far the best lemon cake recipe that I've ever had. I did add additional powdered sugar to the icing for taste. I live in Louisiana, surrounded by excellent cooks &amp; this recipe is FANTASTIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay Rowe"
},
"reviewBody": "I made these twice. The first time I made them, I made 24 (I only had two 12-count cupcake containers) and they turned out a little tall. They also were not very lemony, so I tried again. I was unable to locate dried lemon zest (is that no longer available?), but I did find some crystallized lemon and added plenty of that. Both times I added lemon extract to the recipe. Perhaps the lemon flavor is just meant to be subtle. The texture of the cake is light and fluffy, though. I did bake the second batch a little too long. I would check them after about 11 minutes with a bamboo skewer; they are not dark on top when they are finished baking. Do cream the butter and the sugar together for several minutes before adding the eggs and temper your butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momlovesbaking"
},
"reviewBody": "reduce temp to 350 and add some lemon essence.. tooo good!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/201921/lemon-cupcakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
"name": "Lemon Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/201921/lemon-cupcakes/",
"name": "Lemon Cupcakes"
}
}
]
}
}
, "about": [
]
}
]