				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lemon Poppy Seed Bundt Cake"
,"datePublished": "2019-04-03T23:28:44.000-04:00"
,"dateModified": "2022-07-14T17:56:12.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Shanna Fenton"
,"url": "https://www.allrecipes.com/cook/166245"
}
]
,"description": "An easy, moist cake made with a mix. Poppy seeds are blended in and it&#39;s baked in a Bundt pan."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0ZsGwE5RsXJQiy3YF4-IoICtXqI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/963817-7bec84d5711b43e9bb16826bd7420c76.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lemon Poppy Seed Bundt Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "172"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "249 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "55 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "337 mg"
,"sugarContent": "19 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.25 cup poppy seeds",
"0.25 cup milk",
"1 (18.25 ounce) package lemon cake mix",
"1 (3.4 ounce) package instant vanilla pudding mix",
"1 cup water",
"0.5 cup vegetable oil",
"4 eggs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Soak poppy seeds in milk for 2 hours. Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in water, oil, and eggs. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Blend in poppy seed mixture. Pour batter into prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Morancey"
},
"reviewBody": "Delicious. I subbed the vanilla pudding for the lemon too and it is a perfect lemony cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn T"
},
"reviewBody": "Very easy, very yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugardaddy"
},
"reviewBody": "I usually never make changes the first time I make a new recipe and I'm glad I didn't. Cake turned out beautiful and delicious. Made a lemon glaze to compliment the flavour which increased the sweetness just enough. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAUREEN21"
},
"reviewBody": "Turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn B"
},
"reviewBody": "I grew up with this recipe. It has always been a favorite! I have some lemon oil now and I will often add a bit of that for some extra lemon taste, or some lemon zest if I have fresh lemon on hand. We always dusted it in powdered sugar as well once it was cooled. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephanyP"
},
"reviewBody": "EASY and DELICIOUS!! The only change to the recipes I made was I swapped the vanilla pudding for a Lemon Pudding (as mentioned in almost every other review). I also did a stacked cake instead of a bundt and this recipe was enough for 3 layers using 6” rounds, which I baked for 40 minutes at 350. The cake stacked well! I used a lemon cream cheese frosting (recipes also from this site) and it was a HIT! I even got requests to make this cake again for someone else’s birthday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MeeMeeGee"
},
"reviewBody": "Very moist , I used yellow cake mix and lemon in stand pudding (reversed , it’s what I had) I also subbed water with carnation milk and did half melted butter and oil. The absolute most moist! Another trick I do is preheat 360 then reset to 350 after I put Bundt into oven , I made 8 small bundts so I baked 35 minutes and checked ... it was done! (I also go by the “Smell” to know it’s time to check if done., I know, weird, but I know not to check if the smell is not there! Lol . This recipe is a keeper the 4 , because I think milk made it better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I made this recipe awhile back, and it was fantastic!! It was so good that I’m back here looking up the recipe again to make for Father’s Day 2020. This time I’m printing and keeping it! My dad loves poppy seeds. You talk about a light, fresh lemony, very moist cake.... this is it!! This will be my forever go-to recipe for lemon poppy seed Bundt cake. I will make a blueberry topping to go with it as well! Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aniram"
},
"reviewBody": "Easy and delicious...thankfully, I was able to share most of it with my neighbors, so only a couple of slices remained for my husband and me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Trouskie"
},
"reviewBody": "It's great. I used lemon pudding, I think it enhances the flavor. Another thing, recipe calls for an 18.25 ounce package, they aren't available anymore. Use the smaller package and add 6 tablespoons of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Price"
},
"reviewBody": "Very nice - just lemony enough for me - made it to send to our friends who self-isolating - dropped off on porches in sanitised containers!\n\nThe only change I made was I used milk instead of water which I always do when I use cake mixes. \nVery tasty and moist - this recipe is going in my special binder!! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Anderson"
},
"reviewBody": "I’ve made this cake several times and my boyfriend and I love it! The only thing that I do different is I use lemon pudding mix and lemon cake for the extra lemony flavor. This is a staple in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "This cake is very easy to make and absolutely delicious! A favorite in our house now. Bake time in my oven is just 35min. So if you’re making this for the first time do the toothpick test after 30 min and add time if necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "Excellent and super easy using the boxed cake mix! I also added a glaze consisting of 1C confectioners sugar and 3T lemon juice. Other than using lemon pudding (vs. vanilla), I followed the recipe and it is really good and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "The neighbors and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cje"
},
"reviewBody": "Flavor was good but texture was gummy and it overflowed my pan during baking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rarehansen"
},
"reviewBody": "This my most favorite cake - I would choose this over any other cake. I followed the directions exactly the first time I made it, every other time (lots) I've used lemon pudding in place of vanilla. I also add a powder sugar glaze on top, but id does not need it! Delicious, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eleni Mavraganis"
},
"reviewBody": "Yes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yuchie"
},
"reviewBody": "I thought it was perfect! I took the suggestions of others and used Lemon pudding mix instead. The poppy seeds were a great addition for the crunch but I think I can use even just a tad less next time. I baked it in a bundt pan and it was came perfectly moist and done in 45 mins. I suggest setting a timer for 40 mins, test it, and see if it can come out. I'm sure it varies by oven. You wouldn't want to overbake this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueD"
},
"reviewBody": "I made this as written except I did soak the poppy seeds for longer than 2 hours. Not on purpose, it just happened that way. It was delicious! I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elinore Vanderhoek Bolt"
},
"reviewBody": "it was an easy recipe to follow did'nt add any other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Strombeck"
},
"reviewBody": "Love, love this cake! My hubby wanted lemon poppyseed and was bummed when our local grocery store stopped carrying it...but this is even better! I followed the directions with the exception that I substituted 1/4 of the cup of water with lemon juice; I also followed one reviewer's advice and made a glaze using 1.5 C of powdered sugar and the juice of a lemon and the juice of a tangerine (didn't have an orange). I heated it on the stove until the powdered sugar dissolved, then let the glaze sit until it became thick. I poked holes in the top of the bundt cake using a toothpick, then poured half of the glaze back into the empty bundt pan, and returned the cake to the pan. I then poured the rest of the glaze over the bottom of the cake, and let it sit again for 10 minutes. I then turned the bundt pan back over to remove the glazed cake again, and it was ready to serve. I really liked the mild lemony flavor of the lemon cake mix and vanilla pudding...using lemon pudding or yogurt would make the lemon taste stronger, which is fine if you like lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Hawkins Bennaceur"
},
"reviewBody": "i made this recipe exactly as it read except I only soaked the poppyseeds for about ten minutes. I made 24 cupcakes instead of the bundt cake and they were amazing!! I topped them with a cream cheese frosting and I couldn't be happier with the outcome! I am making a two tiered wedding cake this weekend and the bride has requested lemon poppy seed and I think this recipe will be perfect for it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MUSICMOM20785"
},
"reviewBody": "I used 1/4 c. Oil and 1/4 c. Lemon juice, as a review suggested. Used vanilla pudding, but I think lemon pudding would be great! Glaze was 1 1/2 c. P sugar and 1/4 c. Lemon juice. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "This was delicious and so moist. I used lemon cake mix and lemon pudding mix. After it cooled and was turned out on my cake platter, I poked holes with a toothpick and poured my glaze over it. Glaze: I squeezed the juice of one lemon and one orange along with a bit of zest of both, into a small sauce pan and added 1 1/4 cup powdered sugar. I wisked until it came to a boil and then poured it over the cake. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilene"
},
"reviewBody": "Wonderful....I'll make it again. It's a keeper for my family. Moist and just a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janel"
},
"reviewBody": "Turned out great. Replaced some water with lemon juice and added lemon zest for extra lemon flavor, but followed the rest exactly. Topped with lemon glaze (lemon juice, power sugar, and zest)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Island Girl"
},
"reviewBody": "This cake was wonderful with a few modifications. I used lemon cake mix and lemon pudding and I added a tsp of pear essence. I beat the egg, oil, water and essence until well blended. I added the dry mix and beat well. With the poppy seed mixture, I added a one eight ounce can of crushed pineapple (well drained) and about a half cup of shredded coconut. It was A M A Z I N G!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "socrmom15"
},
"reviewBody": "love this recipe except poppy seeds require a small jar of them at $4 a jar. Bible group loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Mika"
},
"reviewBody": "I cooked mine in 3 mini loaf pans at 350 for 35-40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol j."
},
"reviewBody": "Wonderful cake...I've been making it for many years!!! FRIENDS AND FAMILY love it!!! Very often I'll make it using two loaf pans or 1 9x 13 pan...anyway you slice it....DELICIOUS!!!!! TRY IT...YOU'LL BE GLAD YOU DID!!!!! carol j."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "the only yellow cake mix i can find near my place is 15.25 oz,others i followed the recipe,didnt change anything. a 10 inch bundt pan, 350 degrees 53 min. cake is moist, i like it but i do not LOVE it, i do not think i will make this again, not a fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keels1988"
},
"reviewBody": "his is really good for a cake mix recipe--normally I'm not a cake mix fan, but I needed something quick and easy, so I tried this, and it was really good. I did soak the poppy seeds and they were less crunchy, and I did use the full amount and thought it was fine. I also used lemon pudding mix, and I definitely wouldn't use anything else---if you're making a lemon cake, make a lemon cake. I made a powdered sugar and lemon juice icing and put over it while warm and recommend this as well. Very easy and good and my husband loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marymac"
},
"reviewBody": "Excellent cake. Took 45 minutes to test done. Cake is very moist and delicious. I topped with a lemon glaze (powdered sugar mixed with half lemon juice and half water until glaze consistency)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "This recipe just did not work out for me. Followed exactly but even though I baked for an extra 10 minutes and the tester came out fine, this was still not cooked in the middle. Just did not like both the taste or the texture. I won't be making this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TRISHLEATHERWOOD"
},
"reviewBody": "This wasn't the recipe I was hoping for. It would, however, make a great bread or muffin. I tried making it also the opposite, yellow cake mix and vanilla pudding, same great taste but took \"breadish\", if thats a word."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GloriaL"
},
"reviewBody": "Made as directed except added 1 tbsp of lemon juice, and made a powdered sugar glaze for it! Good and very moist. Best eaten the same day, I thought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asgari83"
},
"reviewBody": "really good. i used yellow cake mix and butterscotch instant pudding, really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommylady2010"
},
"reviewBody": "This was delicious. Like several others I did use lemon pudding mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Angelmaier"
},
"reviewBody": "Phenomenal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmendoza"
},
"reviewBody": "I made this for my husband who misses the cake he use to get from the grocery store in the midwest and this was EXCELLENT. He loved it. I soaked the seeds for 1.5 hours in the milk, used lemon instant pudding and topped it off with a glaze I made with powdered sugar, milk, and toasted almond slices, I also put in a little almond extract in the glaze. I baked this using heart molds and a mini bread pan. Baked at 325 for approx 25 (keep checking though b/c I am not sure of the exact cooking time but it didn't take 30 min that for sure) and it came out perfect. They were SO MOIST and the crust wasn't hard! I definitely will make this again and again, use the molds or even make cupcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phyllis"
},
"reviewBody": "I was having a craving for something lemony and had everything on hand for this cake. It was very good, and satisfied the craving!! Thanks Shanna"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cowardlylion"
},
"reviewBody": "yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wendybird82"
},
"reviewBody": "I thought it was pretty good, I'm more of a chocolate girl ;) I greased and floured my pan and it still stuck just a tad..so be sure to do a good job on that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katschy"
},
"reviewBody": "Love this cake. It's easy and inexpensive to make, comes out moist and light, and was a big hit with the family. I did what several reviews have suggested and used lemon pudding mix in place of vanilla, but otherwise made it according to the recipe here. Marvy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2cook32"
},
"reviewBody": "I wish I could give this a 10 star! I made this for a friend of mine at work as lemon cake is his favortie cake.. he siad this was the best lemon cake he has ever had! This was fantastic!!! I did make the orange lemon glaze one reviewer suggested. I will for sure make again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy Guillotte"
},
"reviewBody": "Really yummy made it in mini loaf pans , everyone loved it. I am a lemon lover so I think next time I will use lemon pudding instead of vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Sanderson-Shelton"
},
"reviewBody": "I have made \"Lemon Poppy Seed Cake\" before, but this one has the others beat \"hands down\"!! I didn't have vanilla pudding mix, but had cream cheese flavored pudding. I also used some fresh squeezed lemon juice and added some zest. Delicious and this one is a \"KEEPER\" for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Awesome recipe. I didn't realize that I needed to soak the poppy seeds. So my brilliant husband suggested I cook on a low heat in a saucepan the poppy seeds and milk. It worked! and I was able to make the cake within 15 minutes. Just be sure to constantly stir over a low heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy3Peas"
},
"reviewBody": "Easy Peasy and super yummy. I've done it as written, and also with yellow cake mix &amp; lemon pudding, and lemon cake mix and lemon pudding. All taste great :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosiesmom"
},
"reviewBody": "Based on suggestions in other reviews I made a few changes: I only used 1/4 c oil, and added 2 tbsp lemon juice to the batter. I also used lemon pudding and added a lemon and orange juice glaze. It was very light and I didn't think the lemon was overpowering at all. I baked for 55 min and that was a little too long. My 2 yr old loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nola P."
},
"reviewBody": "This is an excellent recipe for this cake! Very moist and flavorful, so it's a hit every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Very good! I didn't use poppy seeds, but it was so quick and easy! Nice lemon taste, but not over powering. Didn't give it 5 stars because it wasn't AMAZING, but it was very good! I'll make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made the cake exactly per the recipe. Came out really great and everyone liked a lot. Soft and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FAIR_LADY"
},
"reviewBody": "used lemon cake and lemon pudding- only 40-45 mins in the oven was necessary- made glaze with 1 1/2 c icing sugar &amp; 1/4 c lemon juice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladyblue"
},
"reviewBody": "Excellent cake with modifications. I used lemon pudding instead of vanilla. I also used 1/4 cup of lemon juice and 3/4 cup of water instead of 1 cup of water. No need to soak the poppy seeds, so I left out the milk. The cake had a nice crunch and slight lemon flavor. It was delicious. I made it twice in one week for two different groups. Everyone loved it. It does not have an overly lemon taste. It has flavor which a cake mix does not. Also, cooking time in a bundt pan was closer to 50 minutes not 60."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koolaidemomstaci"
},
"reviewBody": "I gave this recipe 5 stars for time-convenience, taste affordability, I have made it twice, once with the glaze...amazing and addictive, and without, very good and child friendly! I have printed and added to my 'go-to' recipe box, and will make often in the future. Thank you for submission!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "This cake was EXCELLENT! It was so yummy yummy yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marikay"
},
"reviewBody": "excellent! my daughter-in-law requests this for her birthday every year. delicious and moist. i usually drizzle this with a thin lemon glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "Needs some sort of glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WENDYO2"
},
"reviewBody": "I was trying to duplicate a cake a friend of a friend brought to my house for dessert. I found this recipe and it is terrific. My changes...to my chagrin, as I was half way through preparations I found that I didn't have any vegetable oil, only olive oil or butter. So...I used a cube of butter to substitute for the half cup oil. While probably not as light as the original recipe, it was still great. Since it is just my husband and I, I cut the cake into serving sized pieces and froze them. It's wonderful right out of the freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "Very yummy! I made this as directed and there was plenty of lemon flavour for my taste. I didn't let the poppy seeds soak for that long...maybe 10 minutes (which probably did nothing). However, I loved the little bit of crunch! Oh, I also added a lemon glaze - just sugar and lemon juice. So I guess I didn't make it exactly as directed. It was delicious, though. Definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "Very yummy and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MILADA"
},
"reviewBody": "This was a super hit! I substituted 1/2 cup apple sauce for the oil and used non-instant vanilla pudding mix (by mistake). This was DELICIOUS! Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jada Tapley"
},
"reviewBody": "This is an exceptionally good cake! I have used this to make a traditional lemon poppyseed bundt cake, but I've also omitted the poppyseeds and used it for a lemon cake layered with lemon curd filling and frosted with vanilla bean buttercream. In either form this recipe always gets RAVE reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jewel-icious"
},
"reviewBody": "Very moist and delicious. I substituted apple sauce for the oil and made muffins. I lined and then filled the muffin tins 3/4 full. It made 24 muffins.They didnt rise very high but still tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NoviceCook"
},
"reviewBody": "My family and guests raved over this cake, however, being a lover of lemon poppy seed cake, I found it to be just ok...it's possible it was my cake mix (I used an organic kind from Whole Foods), but I didn't find it to be sweet enough. Next time I will stick with a Betty Crocker/Duncan Hines mix. I will also use lemon pudding instead of vanilla. It wasn't near lemon-y enough for my taste. I served with a lemon sorbet which helped to sweeten and add lemon flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CorkiDeCat"
},
"reviewBody": "Not as I had hoped for.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DARLA11"
},
"reviewBody": "Moist and zippy! This recipe is a keeper. I followed the recipe as written. Outstanding results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBOTT"
},
"reviewBody": "Awesome! Because we really LOVE lemon, I used lemon pudding, added some lemon zest and followed another reviewer's suggestion for a glaze. I soaked the poppyseeds and didn't reduce the amount; we found that it was just right. I baked this for a birthday and topped it with a light dusting of confectioners' sugar. This cake was moist and a whole lot less bother to make than my usual lemon poppyseed cake. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle Hattasch"
},
"reviewBody": "This recipe did not come out like I expected from all the rave reviews. First of all, the recipe says to bake the cake for 60 minutes, however I checked it at 40 minutes and it was already overdone. I thought the pudding mix would add something to the cake, but the end result didn't taste any better than a plain old cake mix cake. I will keep looking for a lemon poppy seed cake recipe that suits my tastes better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CINDYLU35"
},
"reviewBody": "Made this exactly per the recipe. The Bundt fell a little after I turned it out onto the plate and part of the cake was \"thick\". Still a good cake tho and this will be eaten. I'll just try it again. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHOGARTH"
},
"reviewBody": "This cake turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimindallas"
},
"reviewBody": "Very moist cake; used lemon pudding mix as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "glal6909"
},
"reviewBody": "I too used lemon pudding mix. I just blended the poppy seeds right in and used an additional 1/4 cup lemon juice to add more moisture to relace the milk. I also only used 3 eggs. I came out nicely. I did adda glaze after baking for only 53 minutes as it tested done already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Ariadne"
},
"reviewBody": "I took this easy to make cake to a bbq and the guests loved it! It's light, moist and doesn't need any extra sugar or frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Gier"
},
"reviewBody": "Want it crunchy? This is my boys FAVE cake, and we add crunch easily: After buttering the pan, I sprinkle with raw sugar. It makes for crunchy sweet edges that makes this cake, everyones fave, and you don't have to frost it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "If you think that's good try lemon pudding Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlissaTakestheCake"
},
"reviewBody": "I used this recipe to make cupcakes. This recipe is of course not meant to be cupcakes so they sort of sunk in after they cooled, but they tasted phenomenal and after we put frosting on top you couldn't tell they were sunken in. I did use lemon pudding mix instead of vanilla and I used the lemon cream cheese frosting(the one with lemon juice and zest) from this website and they were so perfect. many people told me they were better than sprinkles, and I agree!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bkjanke"
},
"reviewBody": "I give this recipe 4 stars as is. If you add a glaze then it's definitely a 5 star recipe...especially since it is so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef24"
},
"reviewBody": "Made this (using lemon pudding instead of vanilla) in a bundt pan, and it was moist and delicious! I didn't even use a glaze, but it would be even more awesome that way! Sprinkled it with powdered sugar after it cooled, which covered up the flour left over from the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattyQ"
},
"reviewBody": "I love leom poppy seed cake and this was the best I have ever had. I made it for Christmas as a treat for the office and everyone wanted to know if it was from a bakery and from where! I have made several times already, and when I am at the last piece, I dice it and place at the bottom of a dessert glass and top with fruit salad and a scoop of whipped cream or vanilla ice cream for a fantastic extension of the dessert! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This cake is moist and has an intense lemon flavor - very yummy! I used a glaze recommended by another reviewer -juice of 1 orange and 1 lemon mixed with 1 1/3 cup powdered sugar. Heat the mixture just until boiling. I poured the whole amount over the top of the cake after I poked holes in it. I used the poppy seeds but I think next time I'll omit them and just have lemon cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KLUELESS"
},
"reviewBody": "I live in the dorms..so my resources are limited. I used the dry ingredients from a recipe for cake, I used lemon pudding. I didn't want to spend two hours creating poppy seed so i let it simmer in milk in a pan while i put together the other ingredients. also i used melted butter and oil... not all my choices were great, but i really stand by using scrath cake than mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "Use lemon pudding rather than vanilla, and glaze with a mixture of lemon juice and powdered sugar to take this recipe to 5 stars. Have made this several times and am asked for the recipe repeatedly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSLUV"
},
"reviewBody": "My husband, who normally rarely eats dessert, loves this cake. The only thing I change is that I add a dash of lemon essence to the cake mix and then do a lemon juice/butter/iccing sugar glaze. It has become a staple around our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "althorper"
},
"reviewBody": "I have made this recipe many times and for my family's taste, I reduce the poppy seeds to 2 tablespoons and add 1 teaspoon of lemon zest. I don't bother soaking the poppy seeds because I find it makes no difference to the final product. I also top the inverted cake with a glaze of 1 cup of icing sugar (powdered sugar) and 2 tablespoons of lemon juice to a cooled cake so that it drools down the indentations. Pretty and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Billingsley Cox"
},
"reviewBody": "Excellent! My daughter who is 6 normally doesn't like anything with lemon in it, loved this cake. My husband and myself liked it because it was best after sitting for a day. My oldest son loved it and normally loves sugary sweet things so it was a great cake for the enitre family. I did substitute lemon pudding mix for the vanilla and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Burrell"
},
"reviewBody": "9/1/08: My husband and kids have raved over this cake since I first made it. I have also made it for friends and family and they all love it as well. The only changes that I made were to omit the poppy seeds (could not find any) and I added 1/4 cup lemon juice to the batter. I used the glaze recommended on the reviews and its soooo good. This is a keeper in our family. To make the glaze I used 1 1/2 cups powdered sugar and 1/4 cup-1/2 cup lemon juice. UPDATE: 12/15/08: I have made this recipe so many times. It is a definite favorite in our house and I have been asked for the recipe as well. I have since changed how I make this to make it a little less moist. I think after making this several times 2 TBS of Lemon Juice to the batter is plenty and I use 1/4 cup Oil with no problems. I also use Lemon Pudding Mix instead of Vanilla. I have made the glaze using less and its still really good. 1/2 cup Powdered sugar 1/4 cup lemon juice works well together poured over the cake. I did also incorporate the Poppy Seeds this time &amp; love that in there. Thank you so very much again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StevenandMaggie McClain"
},
"reviewBody": "I just made cupcake with this recipe and they turned out great! I made a few adjustments to lower the fat and it did nothing but make it more moist and amazing. I subbed the oil for apple sauce, used fat free milk and added only 1 whole egg and 3 egg whites. I also glazed them with a milk, powdered sugar and lemon juice mixture. So light and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ay"
},
"reviewBody": "Some alterations I made are: replace eggs with egg substitute and replace all the oil with an equal amount of applesauce and I used lemon pudding mix instead of vanilla. I also added lemon zest of one lemon. The result was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Peters Clough"
},
"reviewBody": "I made these into muffins along with a variety of others. The Lemon Poppy Seed were a definite favorite! After cooling for about 10 mins I made a glaze with the juice from two large lemons and approx 3/4 C Pwd Sugar (stirred in slowly). These are DE-LISH! And I will definitely make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PENG1DEB"
},
"reviewBody": "Made it today for my son's 10th birthday (at his request) and it was extremely easy and very delicious! I made the alteration to lemon pudding, baked it for only 50 minutes and finished it with a basic powdered sugar/milk/vanilla extract glaze - YUM! Next time I'm going to do a lemon glaze, as I think that will enhance it even more. Good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Brendle"
},
"reviewBody": "Easy and fool proof. I added more seeds and lemon pudding mix. My church friends raved over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "This is a winner! Came out of the pan so easily - it looked great with just a little powdered sugar sprinkled on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Micki B"
},
"reviewBody": "Only soaked the seeds as long as it took to do the first few steps and didn't seem to impact the great taste of the cake! Cooked it 5 minutes less and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole Felice"
},
"reviewBody": "Super easy to make and everyone at work loved it. Will definitely make again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wilson FitzGerald"
},
"reviewBody": "VERY EASY GREAT RECIPE KIDS AND HUSBAND LOVED IT DID USE LESS POPPY SEEDS. wILL MAKE AGAIN VERY MOIST."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LehighBarbie"
},
"reviewBody": "This cake was so yummy! Quick, Easy and OH SO Moist. I used the full amount of poppy seeds and soaked them; I also used Lemon pudding mix instead of the Vanilla. I baked this little heart shaped aluminum tins for Valentines Day and drizzled them lightly with icing made from concentrated lemon and confectioner’s sugar."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/26033/lemon-poppy-seed-bundt-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/380/desserts/cakes/lemon-cake/",
"name": "Lemon Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/26033/lemon-poppy-seed-bundt-cake/",
"name": "Lemon Poppy Seed Bundt Cake"
}
}
]
}
}
, "about": [
]
}
]