				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lentil Ham Soup"
,"datePublished": "2019-04-03T23:59:12.000-04:00"
,"dateModified": "2022-08-28T23:20:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Arielle Darling"
,"url": "https://www.allrecipes.com/cook/5380375"
}
]
,"description": "This rich lentil soup with ham recipe is quick and easy to prepare. Mustard, garlic, and a splash of red wine vinegar add a delicious boost of flavor."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WDlHqrckzbybRTsB4ynUW39t-eY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7694490-lentil-ham-soup-Dan-Q-4x3-1-35b4916f57d7416eb8ae3115d191974d.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lentil Ham Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "63"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "178 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "8 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "694 mg"
,"sugarContent": "3 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (32 ounce) carton low-sodium chicken broth",
"2 cups water",
"2 carrots, chopped",
"2 stalks celery, chopped",
"1 large onion, chopped",
"1 cup dried lentils",
"2 cloves garlic, minced",
"2 tablespoons red wine vinegar",
"1.5 cups cubed fully cooked ham",
"1 teaspoon dry mustard",
"1 teaspoon salt",
"0.5 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir chicken broth, water, carrots, celery, onion, lentils, garlic, and red wine vinegar together in a large stockpot; bring to a boil, reduce heat to low, and simmer until carrots are tender, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in ham, mustard, salt, and pepper; simmer until lentils are tender, 20 to 30 minutes more."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "squibb1214"
},
"reviewBody": "Had so many 'leftovers' in the freezer, most of these ingredients, which helped make this soup a winner.. $0 cost! The soup was delicious, I added garlic to the pot while things simmered and at the end I added some horseradish mustard instead of dry masters and a splash of sherry vinegar. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MikeCas"
},
"reviewBody": "Great, fast, and easy. I always add the paprika and some smoked meat, (ham or turkey)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CO_CHO"
},
"reviewBody": "Definitely add smoked paprika! Used the instant pot and cooked on manual for 14 min. Quick release."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Wright"
},
"reviewBody": "This soup is delicious, especially with the addition of spices: I used a tsp of herbes de provence and a bay leaf, plus the recommended smoked paprika. I also threw in some spinach, just for nutrition; I don't think it added much in taste. I also waited to the end to add vinegar and no salt because I've read that acid and salt affect the cooking of beans. Usually I share my experiments with my neighbors, but they didn't get any of this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Johnson"
},
"reviewBody": "I followed all the ingredients as listed however I used a meaty ham bone from leftover Easter dinner to make stock for this soup. I didn't use chicken broth and omitted the salt b/c I figured the bone and all the rest of the ham would make a flavorful enough broth for our taste. I used 8 cups of water to cover the bone and cooked it for about 30 minutes and then proceeded with the receipt as listed. I used 1 1/2 cups lentils and added some leftover spinach I had to move."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayleenfairbanks"
},
"reviewBody": "Super yummy and a great way to use up Easter ham! I sautéed the veggies before putting everything together and let it simmer longer because who doesn't love when the house smells like delicious slow cooking soup goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "This was absolutely fantastic. I made it as directed except like other reviewers, I cooked the veggies in some oil before adding the liquid. I also did include the smoked paprika (2tsp) which I think is essential! Will definitely be using this for leftover ham in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NicoleTheCook"
},
"reviewBody": "Firstly, I fried one piece of chopped bacon and sautéed the onions, celery and garlic (didn't have carrots on hand) in the fat. Then I deglazed the pot with the red wine vinegar. Then I added homemade turkey stock (thank you Thanksgiving carcass!) and lentils and simmered for only 20 minutes. Added the mustard powder and doubled the ham. Simmered for another 5 minutes and it was delicious!\n\nI would never dump vinegar in a soup as is. Sounds easy but renders unsavory results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly, Addison & Caitlyn"
},
"reviewBody": "Great for cold days! Recipe is great as listed, definitely add the reccomended paprika. We serve it with garlic or some kind of crusty bread. I usually double the recipe to freeze for quick grab lunches. The soup gets better and thicker the longer it sits. \n\nI have made it with different variations. Sometimes I use bacon in addition to the ham. Sometimes I will saute the veggies in bacon fat. Depending on your preference and time to cook you can leave veggies cut big or small. My family loves garlic so I usually throw more garlic in. I use green lentils. I have made it on the stove top and in a quick cooker. The recipe is great as written but also easy for you to put your own flare on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miel Yap"
},
"reviewBody": "Good recipe. I tweaked it by using a pinch of pork bouillon to give the soup more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kcalcut"
},
"reviewBody": "i made it using smoked turkey legs instead of ham. The flavor is good, but the vinegar makes the lentils crunchy. I like my lentils soft. Next time I would leave out the vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingrid Winter"
},
"reviewBody": "This soup is really delicious! Easy to make and very flavorful! Love lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne C"
},
"reviewBody": "This is the best lentil soup/stew I have ever tried. The flavor is perfect which I think is a result of the red wine vinegar and dry mustard. I doubled the recipe so I could have leftovers. Very delicious. This will be my go to recipe for lentils from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momofsix"
},
"reviewBody": "I made this vegan by using vegetable stock and omitting the ham. I did add the smoked paprika found in the cooks notes. It was very good and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Baden"
},
"reviewBody": "i just made it just as published and added 1/2 tsp of smoked paprika as suggested and i sprinkled some parmesan cheese on top...i did do it in the electric pressure cooker and sautéed the carrots, celery, and onion in some olive oil, added the garlic a couple minutes later just before adding chicken broth and all the other ingredients..i put in on high for 10 minutes and quick released it..i used red lentils so they broke down almost all the way .. more consistent with a creamy soup, next time i may start at 5 minutes and work my way up if lentils not ready, or use brown lentils,but i liked it that way too..everyone loved it..definitely making again!! thank you..oh, i didn't have low sodium chicken broth just regular and figured my ham would be salty enough too so i left out the salt..it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kirbysgirls"
},
"reviewBody": "During coronavirus pandemic, limited options at the grocery store. Lentil soup was a wonderful option. Didn’t have celery so added some celery seed. Didn’t have chicken stock so used vegetable stock. Had some potatoes so added those for some added heartiness. Had some pita bread so made pita chips that we broke up at the bottom. Grateful for a hearty meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemarie Yandoli-Smith"
},
"reviewBody": "This was delicious! I used red lentils like some others because I like their creamy consistency and breakdown. Everything else was as listed. Great with a nice Caprese salad on a cold rainy night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Q"
},
"reviewBody": "I’ve been making this for a while. First few times using the recipe just as written. Very good! Later experimenting with different sausages in lieu of the ham. Also very good. Now I start the basic recipe and then look into my fridge to see what might spice it up. Tonight I added leftover turkey breast, only a cup, spinach and fresh diced tomatoes along with an aging 1/4 bottle of Chunky Pace Salsa. 16 oz bottle. Smells great. Can’t wait to taste it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Hébert"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen K."
},
"reviewBody": "Saute the carrot, celery, onion and garlic in 2 tbs butter first. Increased lentils to 1 1/2 c. Add 2 tsp of paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen M."
},
"reviewBody": "Delicious soup!! I made exactly as the recipe states with one exception: I boiled a smoked ham hock and added that broth and the meat to the soup. It gave a rich, smokey flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mronufrak"
},
"reviewBody": "This is one of my family’s favorite soups! I follow the recipe exactly except that I don’t add salt since the ham is salty. It’s hearty and flavorful and definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rolee"
},
"reviewBody": "My husband loved this soup! Per recommendation, I used 1 1/2 cups of red lentils. I also added 1 cube of chicken bouillon, in addition to the 32 oz. of broth. The piece of ham I bought was well over 2 cups, but there were certainly no complaints of having too much ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylynn"
},
"reviewBody": "Excellent soup, very easy to make. I make soup every week for some friends and this is one of the top 5 out of dozens.\nMinor tweaks:\n1. Smoked paprika is NOT optional, make sure to add it!!\n2. Sautéd the onion, celery, carrots, garlic and a pinch of salt in butter until soft and then added the ham, broth etc.\n3. Added an extra stalk of celery\n4. Diced (not chopped) the veggies and ham.\n5. Used red lentils and will add an extra 1/2 c of lentils next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Roberts"
},
"reviewBody": "The flavors are great for a quick soup. Very tasty! I'm getting my \"lentil hater\" to eat them in this soup, do it's good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles Clark"
},
"reviewBody": "We made this last week and loved it. I did add a little Ole Bay to ramp it up. I like spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey Govier"
},
"reviewBody": "very good everyone liked it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris in the kitchen "
},
"reviewBody": "So easy and delicious. I sauteed the vegies first, doubled everything except the salt and vinegar, and added chopped spinach, about a Tbs. of paprika, and some liquid mesquite smoke flavoring close to the end of cooking. It really had to simmer all day to break down the lentils, which is why only 4/5 stars. I also added about 1/3 cup instant potato flakes to add a creamier texture at the end, because the solids weren't mixing with the broth. My house guests loved it - great wholesome meal for a winter day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanner08"
},
"reviewBody": "Great soup. Added the smoked paprika and some extra veggies, as we love them and prefer soup with lots of stuff. Husband was very pleased. Will make again soon, as this will be a good soup for those cold Michigan winter days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicky Schildkraut"
},
"reviewBody": "I sauteed the garlic, onion and rest of the veggies first before adding chicken broth. I omitted the water--it would have made a watery broth. I also cut up a red potato and cooked it much longer than the directions--you could probably add 1/2—1 cup more lentils for a thicker soup. Overall, a delicious soup for a cold day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Ann"
},
"reviewBody": "Made the exact recipe and then added another 32ozs of chicken bone broth, as well as the ham bone. Plus 1 bay leaf. I will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arlene"
},
"reviewBody": "Easy &amp; delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "I had just enough left over ham that I didn't want to freeze again and had 1 1/2 cups lentils so went in search of recipes and found this keeper! I used 2 quarts chicken broth, 1 can stewed tomatoes and 1/2 can of water for rinsing the can that was added to this tasty recipe. Wasn't sure about adding vinegar so only added 1 tablespoon which was enough to perk up the flavor along with the light teaspoon of dry mustard and about 1/2 teaspoon smokey paprika (almost forgot, 2 bay leaves and a tsp of thyme &amp; a few sprinkles of Italian seasoning). My hubby was skeptical (because it was lentils) but had 3 bowls of it! He loved it and so did I. Next time I'll add 2 tablespoons of vinegar:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liser C"
},
"reviewBody": "Made with a dash of smoked paprika. So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Rodgers"
},
"reviewBody": "Delicious! First time I ever made this and it turned out delicious! I served it over white rice and spinach. The only thing I added to the recipe is a little brown sugar and bacon to bring out the leftover thanksgiving ham flavor. I had a little turkey too some I added it in the mix too but it wasn’t really needed. I used about 8oz of the bag of lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rochelle Bares Argue"
},
"reviewBody": "Great recipe! I followed everything. I added 2 cups of ham and then added a can of diced tomatoes. It's hubby approved. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chickadee"
},
"reviewBody": "This soupy was very tasty. I did add paprika as suggested. Will make it again this fall and winter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen"
},
"reviewBody": "I've made lots of versions of lentil soup - including this one. There is something most excellent about the dry mustard WITH the smoked paprika that another reviewer mentioned. LOVE THIS! Also, I've never added the vinegar, mostly because I forgot - great nonetheless! UPDATE - I made a batch of this yesterday without the ham - and it is better with it! Hope this helps someone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shay"
},
"reviewBody": "Very good....you don't need a lot of ham for a great taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mirusel"
},
"reviewBody": "Excellent soup. I added one bay leaf because we like that flavor. I am certain that this soup would have been spectacular without it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bsteph"
},
"reviewBody": "Easy peasy! Added extra ham, an extra can of chicken broth and mustard. Used the paprika. It was chunky and delish. Could add in more liquid for a soupier soup. May add in a can of crushed tomatoes next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jennieqg"
},
"reviewBody": "OK per Lance.\nDoubled everything except onion and used 1 tbsp white wine vinegar and no water. Also used 4 cups ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee-nice"
},
"reviewBody": "Simple to make. I used Aidells Andouille sausage instead. That gave it a nice little kick. I also combined red and green lentils. Next time I will cook it longer so the lentils are softer but there were no complaints from my table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee-nice"
},
"reviewBody": "Simple to make. I used Aidells Andouille sausage instead. That gave it a nice little kick. I also combined red and green lentils. Next time I will cook it longer so the lentils are softer but there were no complaints from my table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Roberson"
},
"reviewBody": "This is excellent! I had some bacon I wanted to use up so I browned it in the dutch oven then added the veges to cook for a few minutes before adding the liquids and ham. Also added some paprika and 1/2 cup of red wine. I cooked it for at least 1 hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vernroz"
},
"reviewBody": "I made it but used home made chicken stock instead, so I am not sure how it would turn out if it was exactly according to the recipe. All in all, I would make it again. I found it similar to a split pea soup but easier and quicker to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bebe10"
},
"reviewBody": "I made only one change. I used the regular chicken broth. The soup was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "This was a good lentil soup. I added a package of chopped spinach for more veggies and sprinkled parmesan on top before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jboy"
},
"reviewBody": "I am not a fan of lentils in pretty much much anything, but they are supposed to bring good fortune when eaten on New Years so I chose this recipe. I actually enjoyed it! I Heated the chicken stock in a crock pot while I pan fried the carrots, celery, &amp; onions. When they were soft, I added the water and lentils &amp; let it boil before adding it to the crock pot. After the mixture came to a boil, I added the mustard &amp; ham. It was ready in about 30 minutes. The only I didn't Care for was the mustard. I won't add it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CatLady2"
},
"reviewBody": "I followed a suggestion by another reviewer and used 1-1/2 cups of red lentils. I also added paprika. My husband loved it! Next time I will use less salt since the ham was already salty. Good recipe for leftover ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Miles"
},
"reviewBody": "Delicious! This soup has become a family favourite. We like a thicker soup so we add 1.5 cups of lentils and we cook it with the ham bone, which enhances the flavour. The celery was omitted, as we don't like celery. Also, we use Red Lentils. They're delicate in texture and eventually start to breakdown, giving the soup a thicker, creamier texture. For this reason, I also cut the carrots and ham into fine pieces. I highly recommend making the soup at least one day in advance. Your taste buds will thank you for it. Overall, I would say it is an excellent recipe. Easy to make and full of flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "An interesting and delicious twist on what seems like an an ordinary lentil soup. I made this with bacon instead of cooked ham, sautéing the bacon with the veggies and lentils at the beginning. I followed the notes for a smoky flavour by adding 1 1/2 tsp of smoked paprika. I cooked everything, including the bacon, mustard, pepper and paprika in a pressure cooker all at once for 13 minutes. It came out perfectly balanced in both flavour and consistency. The lentils were slightly al dente-which I enjoy. I was weary of the mustard powder but it works here. I suggest adding the paprika. This is very good soup that will surprise you - not just another lentil soup, trust me. Thank you MermyGirl for sharing your family's treasure!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/240996/lentil-ham-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/675/soups-stews-and-chili/soup/pork-soup/",
"name": "Pork Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17512/soups-stews-and-chili/soup/pork-soup/ham-soup/",
"name": "Ham Soup"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/240996/lentil-ham-soup/",
"name": "Lentil Ham Soup"
}
}
]
}
}
, "about": [
]
}
]