				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Light Chicken Piccata"
,"datePublished": "2019-07-10T02:54:55.000-04:00"
,"dateModified": "2022-07-14T17:04:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KBJORNSTAD"
,"url": "https://www.allrecipes.com/cook/1441617"
}
]
,"description": "This light version of chicken piccata features chicken breasts marinated in yogurt, then fried in margarine and olive oil, and finished in vermouth and lemon juice sauce with capers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/M9OaLpc265vdQ3u1j0xiC7d7WDA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/33913-9234cad7f1074c7b8a16e8ad79380185.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Light Chicken Piccata"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "40"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "370 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "72 mg"
,"fiberContent": "1 g"
,"proteinContent": "32 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "261 mg"
,"sugarContent": "10 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"8 ounces lowfat plain yogurt",
"4 boned and skinned chicken breast halves",
"0.5 cup all-purpose flour",
"1 teaspoon paprika",
"salt and pepper to taste",
"1 tablespoon olive oil",
"1 teaspoon margarine",
"1.5 tablespoons lemon juice",
"1 cup white vermouth",
"2 cloves garlic, minced",
"0.5 cup lemon juice",
"0.5 cup water",
"2 tablespoons capers" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Coat chicken with yogurt, cover, and refrigerate at least 2 hours, preferably overnight."
} ,{
"@type": "HowToStep"
,"text": "Rinse chicken, and pat dry with paper towels."
} ,{
"@type": "HowToStep"
,"text": "In a bowl, stir together flour, paprika, salt, and pepper."
} ,{
"@type": "HowToStep"
,"text": "Heat oil, margarine, and 1 1/2 tablespoons lemon juice in skillet over medium heat. Dredge chicken in flour mixture. Place chicken in skillet; cook, turning to brown both sides, about 15 minutes. Remove chicken to a plate, and keep warm."
} ,{
"@type": "HowToStep"
,"text": "Pour vermouth into skillet, and scrape brown bits with a wooden spoon. Stir in garlic, 1/4 cup lemon juice, water, and capers. Cook until reduced by half."
} ,{
"@type": "HowToStep"
,"text": "Return chicken to the pan, and simmer 3 minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT195M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeff"
},
"reviewBody": "Only used two chicken breasts because there's only two of us. Confused when ingredient list calls for 1/2 cup of lemon juice, but directions call for only 1/4 cup; reviewed other recipes and scaled sauce down to 1/2 cup white wine, 1/4 cup lemon juice, 1/4 cup water, and 1T capers. Awesome! Paired very well with Light Southwestern Tomato Pasta from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice21"
},
"reviewBody": "WE loved this, we are both on a restricted diet so have yo be careful, thank you for this great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "miggpa"
},
"reviewBody": "Had a very nice light taste to it. Will have again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kariallday"
},
"reviewBody": "I literally just made this recipe. I loved it! What I loved about it was how versatile it is. I only had 2 lemons on hand and it was plenty lemony. I used one lemon for step 4 of the recipe and one for step 5. Mind you I was only cooking for 2. I did have yogurt or time, so I used thin sliced chicken breasts and dredged them in the flour mixture as directed. I used 1 tbsp. butter instead of margarine. Half for step 4 and half for the sauce. That might still be considered light compared to traditional chicken piccata. Thank you for the recipe, I can't wait to play with other suggestions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meg k."
},
"reviewBody": "Agreed- Just be careful with the lemon. After a couple batches, it not only delicious, it's fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo22Babes"
},
"reviewBody": "We love this. It's hot outside and this cooks quickly. It's a light delicious meal. Changed nothing. Perfect as is. Served with steamed broccoli and brown rice. Yum thanks for a keeper recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna Plummer"
},
"reviewBody": "Loved all the favors in this recipe, except I would not deglaze the pan with sauce. Since I doubled the recipe the drippings over powered the sauce. But would make it again with out the deglazing step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ace831"
},
"reviewBody": "Flavor was all wrong for me. Too bitter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Moore"
},
"reviewBody": "Delish-will definitely make again. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "So I've now made this recipe 2x and once it came out lousy (cook's error) and once it was the best thing I ever ate. The difference.. the first time I didn't pan fry the chicken long enough. I didn't get any brown bits. Let that chicken burn, those bits are delicious. First time I didn't marinade in yogurt, 2nd time I did. I'm not real confident that this makes a big difference but I certainly had different results. First time, I was low on lemon, so I threw in a slice of lemon and cooked, thinking it would make it have more lemon taste. No. More lemon rind taste. The second time I used 1/4 cup fresh lemon juice (and chicken broth and a heavy splash of white cooking wine) Second time i threw in some mushrooms, sliced grape tomatoes and spinach. YUM. I will make again and again now that I got the hang of it. I should mention, I've only made this with thin sliced chicken breast. I can't imagine making it with bone in breast.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chill"
},
"reviewBody": "Thought it was pretty tasty. I usually make Giada's recipe that has way more butter. This one made me feel much more virtuous. I browned the chicken quickly then simmered it in the sauce. I did not have vermouth, so I used chicken stock from a bouillon cube. I do not mind the lemon flavor, in fact, we love it! We served it alongside a steamed rice with sauteed mushrooms, spinach, chicken stock, and lemon mixed in. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beeninspired"
},
"reviewBody": "Its good, basic recipe with good flavor. But I changed some things that will help. No need for the yogurt bath, it doesn't help much. Pat dry for a crunchy crust. Don't add lemon juice with the oil and butter, it will burn way before you get to the temp that will brown the chicken properly. Use only one lemon by slicing it thinly and adding it the hot pan to brown after the chicken is removed. Don't add any more lemon juice, the whole lemon will add alot of lemon flavor without making the dish too acidic. Add the garlic for a minute, but don't brown it, then add the liquids and cook to reduce. Definite do again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LESCARGOT"
},
"reviewBody": "This is so good! I don't have time to always coat with yogurt over night and it is delicious anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "radgrl2001"
},
"reviewBody": "I loved the flavor of the chicken and sauce. Plus, the chicken was very tender after being in the yogurt overnight. I liked another review about using a meat mallet. I may try that in the future, but I don't have any issue with the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "harr0752"
},
"reviewBody": "A bit too much lemon for my boyfriend, I liked it though. I add almost a full bag of spinach, fresh or crushed tomatoes and mushrooms to this dish and often serve it over angel hair pasta. One of our favorites in any version. I saute the shrooms then add them to the cooking sauce (they become more lemon flavored the earlier you put them in, so do it according to your taste preferences). Then I saute the tomatoes and lastly the spinach with any form of garlic and a bit of butter. Then just toss everything together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jog Dish"
},
"reviewBody": "We loved this, the sauce is so good and the chicken comes out nice and tender. I used white wine in place of the vermouth (didn't have). Also next time I'll cut the flour mixture in half as I wound up throwing over half of it away. Thanks for the recipe:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOXIEMOOSMOM"
},
"reviewBody": "I LOVE LOVE LOVE this. I've made it at least 20 times now. I do only use 1/4 cup lemon juice, and I love lemon...but 1/2 cup was to much. \n\nThe yogurt marinade makes the chicken so moist. Don't skip it (but do wash it off before cooking!)\n\nAnd capers...I loves me some capers...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Yum! Mine was a bit heavy on the lemon, but I didn't measure and probably did it to myself, so I don't think it's the recipe. It's a good thing I love lemon. LOL! I don't usually go out and purchase things for recipes since we have tons of food in this house, but we don't really have any chicken breasts right now, so I looked for them today at the store. I couldn't bring myself to pay for chicken breasts that weren't on sale, so I ended up with boneless skinless chicken thighs instead, but they worked just as well. I used white wine instead of vermouth since I didn't have it, and it worked just fine. I may have had the heat under the skillet up too high, bc I really had to work to get the browned bits off the bottom of the pan. Once I figured that out, it worked smoothly. I love capers, so I added more. Ate this with salad, bread, and spaghetti. I have plenty of leftovers (Bf's away) but I'm so excited about eating these leftovers, I don't even mind. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenai Lunea"
},
"reviewBody": "This was very good. I used buttermilk instead of yogurt and soaked overnight. Didn't have vermouth, so used a dry sherry. added mushrooms and served with a rice pilaf. very simple; I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daeelle"
},
"reviewBody": "Good recipe. I didn't use yogurt...just split the chicken breast, put each piece between plastic wrap and flattened with a rolling pin. Also I didn't use any lemon juice when browning chicken...I tried it but the lemon juice was burning, so I just added 1/3 juice to pan for sauce after browning. I only cooked each side of chicken for 3 mins to brown, used chicken broth instead of vermouth, and returned chicken to pan to finish cooking in sauce. Served with whole wheat pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BajaGirl61"
},
"reviewBody": "My husband and kids thought that there was too much lemon flavor - and I only used 1/4 cup of lemon juice vs. the 1/2 listed in the ingredients list. I thought it was good though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "This was delicious, easy and relatively healthy. My man loved it. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Wow, my husband and I loved this recipe! Delicious! His first reaction was \"what did I do to deserve a fancy meal?\" It's his new favorite dish. I made the recipe with two changes: no yogurt and substitued vermouth for leftover white wine. Instead of yogurt I used a meat tenderizer (the utensil)... it worked great. In response to another review, the amount of lemon was perfect; I would not reduce it. I definitely recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anelson825"
},
"reviewBody": "This chicken had SO much flavor!! It was so simple to make! I didn't have any vermouth, so I threw some Grey Goose in instead-- incredible!! I was shocked by the flavor it packed! Such a simple recipe, so delicious! Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon Martinez"
},
"reviewBody": "This was very good. I had recently had this at a restaurant and wanted to re-create it at home. It was very close.I agree that its really not necessary to put it in the yogurt. I would just use a meat mallet to make the chicken breasts thinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KARENKINM"
},
"reviewBody": "Tart and tasteless"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheris13"
},
"reviewBody": "Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LOOSENUP"
},
"reviewBody": "Very good! I didn't use the yogurt as I made with grouper and it was wonderful. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOVE 2 COOK"
},
"reviewBody": "I tried this recipe because I had bought some plain whole milk yogurt by mistake, and wanted to use it up. I did let the chicken sit with the yogurt overnight and the chicken came out wonderfully tender - my husband loved it. I made a few small changes. I did not have capers, so I added some fresh sliced mushrooms to the sauce just before putting the cooked chicken back into the pan. I also sprinkled the top of the chicken with some freshly chopped chives to add a little color. I used Pinot Grigio white wine since that was all I had on hand. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Very good! I'm not sure about the yogurt. Will use less lemon juice in the sauce next time. Loved the capers!\nServed with polenta for an excellent meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NEENEE265"
},
"reviewBody": "This was very good. We love lemon, so it was fine for us. Didn't have any capers and didn't really miss them although next time I think I'll try it with them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CARLYNSMOMMY"
},
"reviewBody": "This just didn't taste right to us. We thought the lemon was too much. I will try it again and not use as much lemon. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHITNEYBROOK"
},
"reviewBody": "This has become one of my favorite recipes. The chicken is most tender if you use the yogurt, but I made it the other day without it and it was plenty good. In fact, I may stop using the yogurt all together to save the trouble and just use a meat mallet to make the chicken thin/more tender."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/87149/light-chicken-piccata/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17187/main-dish/chicken/chicken-piccata/",
"name": "Chicken Piccata Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/87149/light-chicken-piccata/",
"name": "Light Chicken Piccata"
}
}
]
}
}
, "about": [
]
}
]