				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lime Bars"
,"datePublished": "2020-06-18T23:50:24.000-04:00"
,"dateModified": "2021-03-26T17:31:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jeanne16"
,"url": "https://www.allrecipes.com/cook/3347263"
}
]
,"description": "If you love lemon bars, try these delicious lime bars. They&#39;re similar, but they have the bite of fresh lime juice and grated lime peel. Fun to take to a picnic or just make anytime."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GF09Svl_iYRacpEu0m_9XluMLfY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9112755-883af027ac08462f9da66fff67bbc442.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lime Bars"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "109"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "153 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "34 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "84 mg"
,"sugarContent": "18 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.5 cup confectioners' sugar",
"0.5 teaspoon salt",
"1 cup butter",
"4 eggs",
"0.33333334326744 cup lime juice",
"0.25 cup all-purpose flour",
"2 cups white sugar",
"2 teaspoons grated lime peel, or more to taste",
"0.5 teaspoon baking powder",
"1 drop green food coloring, or as desired",
"1.5 cups confectioners' sugar",
"1 tablespoon lime juice",
"1 teaspoon grated lime peel" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x15-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Mix 2 cups flour, 1/2 cup confectioners&#39; sugar, and salt in a bowl; cut in butter with a pastry cutter until crust mixture resembles crumbs. Pat crust evenly into bottom of the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake crust in the preheated oven for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, 1/3 cup lime juice, 1/4 cup flour, white sugar, 2 teaspoons lime peel, baking powder, and food coloring in a bowl; pour over the crust."
} ,{
"@type": "HowToStep"
,"text": "Return baking dish to oven; bake until filling is set, about 25 minutes. Cool thoroughly."
} ,{
"@type": "HowToStep"
,"text": "Whisk 1 1/2 cup confectioners&#39; sugar, 1 tablespoon lime juice, and 1 teaspoon grated lime peel to make a smooth glaze; spread evenly over cooled lime bars. Let glaze set before serving."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT180M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "I expected key lime pie meets lemon bars and was disappointed. These weren’t tart and limey enough for me. My issue might have been the use of bottled lime juice rather than fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was disappointed in this recipe. First, it recommends a 12x15 baking dish. That is a non-standard size requiring recipe adjustments that are not always easily attained. Second, the glaze instructions in Step 6 instructs one to combine 1-1/2 cups of powdered sugar and 1 tablespoon of lime juice \"to make a smooth glaze.\" It is obvious that such a small amount of liquid will not result in a smooth glaze that easily spread across the lime bars. I attempted this recipe twice. Unfortunately, even with adjustments to the recipe, the outcome was not what I had hoped for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "Too sugary and not nearly enough lime. People add a LOT more lime/lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not enough lime flavor for my liking. Will try reducing the amount of sugar and use more lime juice next time. Overall, nice dessert bar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaylyngruber"
},
"reviewBody": "This recipe turned out delicious! I did do some things differently. First, I used a pie dish because I didn’t have any clean square pans. It fit perfectly for the size. Second, I had leftover pie crumb topping in the freezer, so I used that by adding some extra cold butter to make it stick together. This crust turned out great and I baked it for 15 min. Instead of 10. I didn’t add any zest and I used KEY limes. I noticed a lot of reviews sounded like they were using standard limes… I think the key lime factor is pretty important. I also used demerera sugar instead of the finer stuff (I use this in most of my baking and don’t tend to have issues with it.) I baked for 30 min. because the custard was still jiggly. I think I would bake it just a few minutes longer because the center was still slightly moving, but it still turned out great, just a bit gooier in the center. Lastly, I popped in the freezer because I’m impatient and topped it with confections sugar. Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best! I love the lime zest in the glaze. 10/10."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha "
},
"reviewBody": "I love this fabulous melt in your mouth delicious recipe, but do read the reviews first. I made just a few tweaks. I used the size pan the recipe calls for, and the amount of cookie base it calls for, but I doubled the amount of juice to 2/3 cup, because I had a beautiful lemon to use as well as the 1/3 cup of lime juice. The lemon-lime taste was amazing. I used the same amount of eggs, and sugar, lime zest, etc. This gave me a thick enough filling to be just right for the thickness of the cookie base. I used powdered sugar instead of the glaze. I got raves, and everyone went for seconds. I would make this again in a heartbeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "erica.87"
},
"reviewBody": "Way too much sugar! I’m not sure how this recipe has so many good reviews. It doesn’t even taste like lime. It’s just pure sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Atchison"
},
"reviewBody": "So simple and tasty! If you love limes, this is your bar cookie! Used all fresh lime juice for extra flavor and also added alittle water and more lime juice to the icing, was way to thick for our taste…\nWill definitely be adding to my favs and making again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sleepingwren "
},
"reviewBody": "I like the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Fantastic bars!! I halved the recipe and made it in an 8x8\" pan. That gave me the perfect sized bars! I loved the contrast of the lightly sweet, yet super buttery crust with the tart lime filling. I used the zest of two medium limes, 1/4 cup lime juice, and 3/4 cup sugar for the halved amount of filling. I then skipped topping the bars with a glaze or powdered sugar; and instead simply added an extra sprinkling of lime zest. This made for some really really lime-y bars that were fantastic! I will be making these again! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Korahnana"
},
"reviewBody": "Way too sweet!! Would cut down on sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa V"
},
"reviewBody": "I really liked this recipe… It was very easy and the bars came out perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamagi"
},
"reviewBody": "I’m a big lemon bar fan, so it’s fun to try a different twist with lime.\nThe crust is so easy in the food processor-\nWorth the clean up mess.\nI will definitely make these again. I followed the recipe 100% and they were perfection.\nI have never had a glaze on lemon bar so this is a nice addition, and pretty. Photo is before they were baked\nLove"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sonali Purohit"
},
"reviewBody": "I would not add the glaze. Otherwise, it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Lashley"
},
"reviewBody": "Fantastic! Made a few changes to the directions and put less sugar and more lime zest. The chef in me was a little suspicious but really really good. 1 thing: no artificial colours or flavouring. I mean, cmon now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Rinehart"
},
"reviewBody": "Love this recipe. We love lemon bars and this is just like lemon bars only lime flavored. easy recipe to follow. I added zest of 2 limes and juice of 4 which made about 1/2 cup lime juice. I like a really strong lime punch! I also sprinkled powder sugar instead of making the glaze. other wise followed the recipe and really pleased with the results. Crust is perfect too!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs Shakh"
},
"reviewBody": "Perfect. I think I even like it better than lemon bars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drossdude"
},
"reviewBody": "WOW, this was amazing. If you're wondering, YES, MAKE IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charmar97"
},
"reviewBody": "Excellent bar! Better than Key Lime Pie. Will definitely add this to my recipe collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natedot "
},
"reviewBody": "We truly enjoyed this recipe. I have made it following the directions and for me was way too sweet but most liked it. i agree about leaving out the food coloring. However the complaints people made over thick crust is there own doing. if you follow the directions and use a large pan equivalent to the recipe you get a nice thin crust. I doubled the lime top because I wanted that part thicker. So if your more about the thick buttery crust by all means use a smaller pan. I did make it with half the sugar in the filling and used Brummel and Brown Yogurt Spread in place of butter to help cut calories and sweetness. My husband loved them and said not to mess with the recipe. And no we don't top it with the glaze or even powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Catan-Paz"
},
"reviewBody": "Perfect recipe super simple and easy to follow . They\n don’t need food coloring so I skipped that. \nPerfectly tart and sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A lot easier than I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cgflames"
},
"reviewBody": "A lot easier than I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Roxanne Willett"
},
"reviewBody": "What a waste of my homegrown limes. Where do I start? The shortbread crust was so grainy that I felt like I was eating sugar granules. I used Irish butter for a better flavor but it was wasted on this. The lime filling was flavorful but way too sweet. l actually doubled the filling and was disappointed by the lurid green color and the overly sweet curd. Lime is supposed to have a tangy, tartness and sadly these were lacking. Then when they cooled and I cut them, as I lifted them out of the pan, the shortbread crust just fell away from the filling. I guess I will keep looking for a recipe that is worthy of my homegrown limes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tori"
},
"reviewBody": "I will most likely make these again. I was reading a bunch of reviews that said to double the filling so I did, and it took double the time (which I didn't mind), but it was a tad bit too much; next time I will try making the filling plus another half batch. For the crust I used a fake butter (I can't believe it's not butter) and oil (1/2 cup each) since I didn't want to use all the butter and it turned out pretty well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakerman2682"
},
"reviewBody": "Oh my goodness, these were absolutely delicious. For anyone else out there making something like this for the first time, don't worry if the crust is slightly bubbly when you first take it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trisha Fain"
},
"reviewBody": "I think the recipie calls for too many eggs!! Mine came out like egg dish.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "i followed the recipe with only one exception, I had to use a 13 x 9 baking dish. The lime filling was rather bland, everyone agreed it didn’t taste much like lime and was not tart at all. The filling does not need baking soda, it caused the filling to bubble and leave a top that looks over baked while the filling was still runny in the center of the pan. I even added a couple minuted to each bake to compensate for slightly smaller pan. I will not use this ever again and stick with my beloved lemon bars from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kelly Kap"
},
"reviewBody": "Way too sweet and not enough lime flavour. I recommend increasing lime and decreasing sugar. I used 1.25 cups sugar and it was still too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KSB"
},
"reviewBody": "I would definitely make again but would double the filling part. I skipped the glaze and the food coloring; doesn't need either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shelley Severin"
},
"reviewBody": "Way too rich, too much lime, could barely eat half a bar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Country Cook"
},
"reviewBody": "I'm giving it 4 stars since as written, I feel like it would not have been as good as the modifications I made. Like other reviewers, I used 1/2 a cup of lime juice and a tablespoon of lime zest and I still didn't find it overly limey. I think these would be even better with 1 and a half to two times the lime filling over top of the regular amount of crust. I sprinkled powdered sugar over top instead of the glaze too. The bars are really good, and next time I will try it with the additional filling and I think they will be even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gonzo"
},
"reviewBody": "This looked like a tasty alternative to a lemon bar and it turned out well. I did add an additional tsp of lime zest to help the flavor pop.\n\nThe glaze came in too sweet, so that will need adjusting next time. Also, if you can get something pliable out of 1 1/2 cups of confectioners sugar and 1 tbsp. of lime juice, you are awesome. I needed to add 2 tbsps. of water to even get it to com out of the whisk, much less spread.\n\nAll in all, it's a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Penny Emily Youngreen"
},
"reviewBody": "I followed the recipe to the letter but for me and my family they were just too sweet. I plan to make this again as I love lime but I think I could cut the sugar in the filling by 1/3 to half and it still be sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jamie McBride"
},
"reviewBody": "Not at all as good as lemon bars. Tasted kind of flat and crust was very blah. Will never make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamison Michael Steininger"
},
"reviewBody": "amazing make sure you have eggs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Issaarnold"
},
"reviewBody": "I baked in a 10x7 glass dish. My biggest gripe with this recipe is the crust. There's just too much of it! I only used about half. MAYBE in a 12x15 it would've been alright, but even then, I feel it would be a lot (and the filling would have been non existent). My crust could have used another 4 or 5 minutes in the oven, also.\nI cut the sugar down in the crust and filling (a little under 1/2c powdered and 3/4c reg) because my gut told me it was too much. Tasting the end result definitely makes me think that the listed amount of sugar would make this way too sweet. I also did not make the glaze because of this. I increased the juice and zest a bit, as many other people suggested.\n\nUltimately, I'd recommend backing off the sugar, making half the crust, and possibly double the filling, minus an egg or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "This is the best lime bar recipe ever I will use it for the rest of my life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Monahan"
},
"reviewBody": "For once, I did not alter the recipe. They are so, sweet, gooey and flavorful. I will most definitely be making these again. I prefer these over lemon bars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ImpoverishedBlonde"
},
"reviewBody": "I followed the recipe except for the glaze because I prefer plain powdered sugar. I like lime, but am not too crazy about these. I prefer lemon and much less or a bit sweeter crust. Won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meagan"
},
"reviewBody": "These were delicious! I made them for a coworker's going away party. They got rave reviews from everyone. I made a few small changes: I made them in a 9\"x13\" pan, I also upped the lime juice from 1/3 c. to 1/2 c., I decreased the white sugar from 2 c. to 1 1/2 c., I didn't use the green food coloring and I didn't make the glaze. I just sifted powdered sugar on top after they cooled completely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne-Marie Lefebvre"
},
"reviewBody": "Baked in a 9x13 pan. No glaze. More zest. Great taste and texture. My colleagues wanted more! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaVerne"
},
"reviewBody": "Love the crust the first time I followed perfect\nThis time I cut the sugar for the filling to one cup instead of 2 was way to sweet the first time but just perfect with just one cup of sugar. My husband loves them we have a lime tree so I will be making them often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Delicious. I did add at least double the lime juice in the glaze and added more zest. Every time I have made these, people want the recipe. They are a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cici"
},
"reviewBody": "I made this today and it came out pretty good :) my family enjoyed it. It was easy to make and bakes quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kira robinson"
},
"reviewBody": "When i first started making the crust i realized i didn't have the full 1/2 cup of confectioner sugar so i decided to just use what i had which was 1/4 of a cup of sugar so i made but it made dough not a crumble crust now is that how it's supposed to be? i have made this recipe once before but i couldn't remember how the crust looked so i dumped the first dough then i did it over again with 1/2 cup granulated sugar so 1 you need 1/2 cup of butter or more sugar and flour and 2 a smaller pan the was no way i was going to be able to fit that amount of crust in that size pan i didn't have the size pan you called for so i used a 11 by 15 and i still could't get it spread out evenly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayatri"
},
"reviewBody": "I followed the recipe exactly, it came out amazing. Might add a bit more lime juice to the glaze layer this time round. Yes, it's barely been finished and hubby and kids demanding that I make again! 13/1/17: Made it with more lime juice in the glaze.... huge hit! Just remember to score it while warm, cutting it later becomes difficult otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melis cherry"
},
"reviewBody": "This recipe was almost like any other lemon bar recipie. The lime bars are a nice creamy delicious treat. However in my opinion I would have liked a bit more filling because it was too thin. Next time I would make these lime bars in a 9x12 inch pan. This way I would be able to have more of a limey taste. They were a bit heavy so I would only have one. If you are planning to make these lime bars make sure you don't cut them up before they have cooled fully. Otherwise the limebars will be very messy and they will not look presentable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lksmith"
},
"reviewBody": "These are even better than lemon bars! I have made them twice and everybody, even people who don’t care for lemon bars, love these. I am partial to lime flavor so these are amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This was really good. I didn't use frosting, but just dusted with powder sugar and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Madu"
},
"reviewBody": "Made this exactly as recipe directed and everyone loved it. I baked it in a 9x12 pyrex at 325 because of the glass pan. Sooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa "
},
"reviewBody": "These Lime Bars are even better than Lemon Bars. I made this as written except I used a 9 X 9 pan.... I prefer thicker bars. I did use a little less crust... Maybe 1 1/2 cups flour and less butter... Baked the crust for 15 min. added filling and baked 25 min. more. I didn't use food coloring or the glaze... just dusted with powdered sugar... They were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Therese "
},
"reviewBody": "Delicious and super easy. I didn't have green food coloring which I think would have made them look more attractive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "OakleyMom"
},
"reviewBody": "These are a very good flavor. I gave only 3 stars because this does not make a 9X13 size! Should have read the reviews, too thin. I get annoyed with pictures that don't really represent the finished product. If I make again I would use a 9\" pan or double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "deb"
},
"reviewBody": "Was a huge hit with everyone. Have to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni"
},
"reviewBody": "Used 1/2 cup of lime juice and made them with the glaze. Really tangy and Limey. Delish!! Store in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunsetlakelinda"
},
"reviewBody": "I loved the tangy taste of these bars! A nice change from lemon bars, which I also love. The lime glaze made a great addition. The only changes I made to the recipe was to make it in a 9x13\" pan, and to cut down on the amount of sugar in the filling from 2 c. to 1 1/2 cups. I like the tart taste of limes to come through. I also needed to add additional lime juice to the glaze to thin it out a bit. I certainly will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dinner Date"
},
"reviewBody": "Easy to make and easier to eat. I made these bars last night for the first time. My hubby's favorite things are anything lime and he loved these. Two thumbs up from both of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathleen Doupnik"
},
"reviewBody": "The taste of the bar is very good but the size of the pan is wrong. I put it in a 12x15 inch pan and it came out the size of a thin pancake. The next time I make it I will use a smaller pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beryl"
},
"reviewBody": "Def will make again! Made as stated except used a 12 x 9 inch pan (thought they made mistake) and put tsp or 2 of lime zest in the crust. Came out perfect... Didn't time cooking crust just pulled out when edges were nicely browned. Poured in and cooked filling about 25 min until nicely browned (not barely but a nice toasty color). Sifted a bit of powered sugar on top. \nJust can't see how a 12 x 15 pan could work.... with 12 x 9 they seem perfect thickness for both crust and filling. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "catherlee"
},
"reviewBody": "I used this recipe as a guide for making something low carb. Used almond powder instead of flour, omitted the butter (enough fat in the almond) bound with egg ( a bit too eggy tasting) used Splenda in place of the sugar. Next time half the crust egg?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ESBARK"
},
"reviewBody": "Made this recipe as written with fresh limes from my tree. Found it to be very bland with little lime flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Loved these! Tasted amazing! I added more lime juice and rind to the glaze ?? Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystalball"
},
"reviewBody": "These were sooo good!!! I followed the recipe exactly and they were wonderful. I brought them to a gathering and everyone loved them. They're so zingy and I think the thing that makes them stand out is the glaze, which I've never put on a citrus bar before - really added more of the lime flavor. I just added a couple more Tbs lime juice since the 1 Tbs wasn't enough to moisten the amount of powdered sugar called for. Two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LibertyBelle78"
},
"reviewBody": "They looked right and smelled wonderful, but even after thorough chilling, they were liquid when sliced. I may have to try again, because my family loves Key Lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crochetmom"
},
"reviewBody": "I love lemon bars and I love limes!!! Baking this right now this will definitely be my dessert in the summer and spring !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "My 14 year old daughter made these for the first time for a cookie exchange. She wanted something different from the usual desserts. These bars are great. She followed the directions as written adding only a little more lime zest since we had it. The family thought they were full of flavor and her friends really liked them also. This will be one of our \"go to\" recipes. Enjoy! (P.S. I would encourage cooking the crust longer so it is brown and crisper.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shelby Randall"
},
"reviewBody": "So my lime tree is exploding limes, naturally, I am looking for any and every way to use them (extra Limey gin and tonics?!). About this recipe. It was alright. I went with some of the comments and doubled the lime juice and zest and I also used only about half of the crust and doubled the filler. Here's a list of what I liked: the glaze absolutely is necessary because the filler doesn't have any sugar so without the glaze it will be too tart, the added food coloring, the tartness mixed with sweet crust/glaze (it's hard to find a good tart lemon or lime bar), definitely glad I halved the crust and doubled the filling. Things I did not like: the crust was not crust like it was almost chewy...needed more flour or maybe shortening instead, next time I'm going to go with the suggested amount of lime...maybe a hair more. Otherwise the bars were yummy...but remember one thing folks...use the glaze!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Jones"
},
"reviewBody": "I made these with gluten free flour and they were delish! Next time I would make the following changes: there was too much crust for the amount of lime topping. So I would either use less flour or a much larger baking dish and spread it thinner. Secondly I would use more limes- I used two and got a little over 1/3 cup but it would have been even better with more. Lastly I would eliminate the 1/4 c flour from the lime topping - totally not needed. It gave the lime mixture a floury taste which I didn't like. I didn't use the glaze - just sprinkled powdered sugar on top. Also, I used less white sugar than the recipe called for, based on what other reviewers suggested. I think I used maybe 1 1/4 cups - I wanted it tangy. I baked at 325 F on convection setting and it was done in 20 min. \nYummy!! Definitely one to try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marian"
},
"reviewBody": "I love this twist on the traditional Lemon bars and my husband raved over them!! We live in the Carribean where limes are a local fruit and they added such a fresh, delicious flavor to the bars. I will certainly add this recipe to our list of family favorites. I would agree though, that the crust was a little too much for the ratio of lime mixture. But otherwise, its a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashlynn"
},
"reviewBody": "Tasted great but waaaay too much sugar for us. Next time I'll try cutting back by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StickySue"
},
"reviewBody": "I followed the recipe all though the bars had good flavor the were very thin...next time I will double the filling or go to a smaller baking pan. Thanks, Happy Cooking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Harmon Jones"
},
"reviewBody": "Delicious. If I were making these for company, I would have followed the recipe exactly. But it was just for my own family, so I cut the sugar back to 1 1/2 cups (in the lime mixture) and just lightly dusted with Powdered Sugar (instead of the glaze.) I also only used 1 1/2 sticks of butter in the crust (versus 2.) My husband said they were to die for! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Avon- status quo PRO"
},
"reviewBody": "made these for the Super Bowl party and they were a huge hit! Great color if you are a Seahawk fan!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marissa Kel"
},
"reviewBody": "Love them, but I don't do the glaze usually."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Abney"
},
"reviewBody": "Wow, talk about good. These were a huge hit at our tailgate party. Sweet and tangy , and frankly I liked these a lot better than lemon bars. We didn't use the frosting and opted for the powder sugar dusting instead. Delicious and incredibly easy !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisam10829"
},
"reviewBody": "Delish! I had to add some water to the glaze to get it to the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alipicard"
},
"reviewBody": "These were a big hit. I reduced the sugar down to 1 1/2 cups in the bars. I sprinkled 1/4 cup of confectioners sugar on the top. They were plenty sweet! I used all of the lime zest off of the two limes I used for the juice. Plenty of lime flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane Stempkowski"
},
"reviewBody": "I would never use a pan that size to bake it in I really needed a 9x12 I should have know better I bake all the time.The lime filling is to thin and I had to double the froasting then I put toasted coconut to make it look better.I measure my pans"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "92DORE"
},
"reviewBody": "These are terrific! The only change I made was to use 1/2 c. of lime juice. Also omitted the food coloring ... SOOOO good, and they came together easily! I sprinkled powdered sugar instead of making the glaze. Sweet, tart, tangy, delicious! Thanks so much for this recipe. I'll be making these a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iliana and Mia's Mom"
},
"reviewBody": "Easy to make and tasted wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L A Brown"
},
"reviewBody": "Followed the Exact recipe and everyone loved them including my little guy who doesn't like lemon bars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Escape"
},
"reviewBody": "Great recipe. Tripled the lime zest and doubled the juice in the bar and doubled the zest and juice in the icing for the extra zip. They were definitely zingy. Everyone loved them and they were completely gobbled up. I used a 9x13 pan for the recipe with no changes except those I've listed (and cooked a little longer)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "care925"
},
"reviewBody": "Delicious! I used key limes for a more intense lime taste and skipped the glaze. Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweet sakura"
},
"reviewBody": "I swear by these! OMG SOOOO GOOD! I didn't have sufficient lime zest and I do regret that but still came out soo beautiful and tasty. I will make these again for St. Patricks day for my co workers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "Wow! These are soooooo tasty. My son and I loved, loved, loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zabreder"
},
"reviewBody": "Don't accidentally bake them too long like I did. 20 minutes might be enough time... not 25 like the recipe says. All in all a good recipe that I would make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "altosaje"
},
"reviewBody": "Very delicious! I actually didn't add any topping, and they were amazing as-is. I do have to say I had a 9x12 and just used as much crust as I thought I should (probably ended up omitting about a cup) and used the whole amount of filling, and the ratio was perfect for me. Thanks for the great recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "I gave these 5 stars because this recipe is delish and even though I made a few small changes, the origional recipe would be still be great! I didn't put the glaze on top, just a dusting of powered sugar and they were great. However, there are a few things I would change in the recipe the next time I make these. First, I did use butter instead shortening because I like the flavor in a shortbread crust much more and will do so next time also. Second, I didn't like the ratio of crust to filling, about 50/50. Next time I will double the filling. Third, I increased the amount of zest a little to about 1 tablespoon because that was how much I got from one lime and wanted to use it all. I did only use the 1/3 cup of lime juice as the recipe calls for and overall I thought the lime flavor was great. (Other reviewers suggested to use more since the flavor wasn't strong enough.) I really liked these and will make them again for sure! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ursi"
},
"reviewBody": "We made this with out the sugary topping and they were delicious. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "The fact that this is simply a lime variation of a fairly standard lemon bar recipe doesn’t make these bars any less delicious. Some of these recipes, as does this one, call for flour in the filling; some do not. I’ve tried them both ways with equally good results. I wanted these really lime-y, so I upped the lime juice to a half cup and the lime zest to a full tablespoon. In most cases (cake might be another story) I don’t care for artificially green tinted lime desserts and by doing so I was rewarded with its classic, creamy pale yellow color. The shortcrust pastry is tender and buttery, offset by the fresh sweet/tart lime flavor. Not sure how the glaze would hold up on these, I chose to just stick with the traditional dusting of powdered sugar. If you like lemon bars, Key Lime pie or any citrusy dessert for that matter, you’ll find this a dependable recipe for a delightful, light and refreshing dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JillB"
},
"reviewBody": "Made these for a family reunion. Mostly the women liked them, not so much the men. Followed directions with just a couple of changes. While making the middle I used 5 limes so it equaled a little more than 1/3 cup. Also, I had to increase the glaze by an addional 1/2 batch to cover the bars entirely. I thought they were very tasty. I did use green food coloring as suggested, so they were pretty to look at too. I bet they would go good with a Corona - if your the type that's ok eating sweets with your beer."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223532/lime-bars/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/836/desserts/cookies/bar-cookies/",
"name": "Bar Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223532/lime-bars/",
"name": "Lime Bars"
}
}
]
}
}
, "about": [
]
}
]