				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lime Gelatin Salad"
,"datePublished": "1998-10-31T17:10:40.000-05:00"
,"dateModified": "2023-01-20T11:40:29.000-05:00"
,"author": [
{"@type": "Person"
,"name": "SHECOOKS2"
,"url": "https://www.allrecipes.com/cook/739799"
}
]
,"description": "This creamy lime jello salad also features crushed pineapple and chopped pecans for a refreshing green dessert that will please any crowd!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rUO89vN8D2xcQpJaDdkpvBDMgOg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1001429-bf5bee54dd2a49368f43b50f17ccef23.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lime Gelatin Salad"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "95"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "412 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "90 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "161 mg"
,"sugarContent": "23 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup boiling water",
"1 (6 ounce) package lime flavored Jell-O® mix",
"1 (20 ounce) can crushed pineapple, drained with juice reserved",
"1 (8 ounce) package cream cheese, softened",
"2 cups heavy cream",
"1 cup chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine boiling water and gelatin mix in a large bowl; stir until dissolved. Stir in 1/2 cup pineapple juice. Refrigerate until thickened but not set, about 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, place crushed pineapple and remaining juice in a small saucepan. Bring to a boil, reduce heat, and simmer for about 5 minutes. Remove from heat, and cool to room temperature."
} ,{
"@type": "HowToStep"
,"text": "Blend softened cream cheese and prepared gelatin until smooth. Mix in cooled pineapple."
} ,{
"@type": "HowToStep"
,"text": "Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form; fold into gelatin mixture. Fold in chopped nuts. Pour into a pretty glass bowl, and refrigerate for at least 4 hours, or until set."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT325M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "You don’t have to heat up the pineapple, the bromelain in fresh pineapple will keep jello from setting, but the process of canning heats it up to inactivate the bromelain. So just skip this unnecessary step. Otherwise it’s a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Kinsinger"
},
"reviewBody": "I've been looking for this for years! My mom used to make it when I was a child Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thesquirreliestone"
},
"reviewBody": "This was a definite keeper! I made a double recipe and in place of lemon-lime soda, measured out some of the sparkling grape juice you find in the stores around the holidays (because it is what I had!). I also used coconut flakes instead of nuts because of allergies. Based on advice from other reviewers, I added the cream cheese while the heat was still on and didn't take it off until it was completely melted and dissolved; the marshmallows and cream cheese were added while cooking, the whipped cream, pineapple, gelatin mix, and coconut added after the heat was off. Because I made such a large amount, I chilled it for two days. It came out extremely tasty and very well-set, not watery at all. Definitely going in my notebook of keepers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmc"
},
"reviewBody": "This is very good! I just had to use 1 box of lemon jello and 1box of lime jello because that was all I had in my house and I didn’t have time to run to the store. I did leave out the pecans (not because I wanted to) because I was taking this to a friends house and they don’t care for any kind of nuts in their food. Other than that I made it exactly as written. Very delicious recipe, thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Talia Langmo"
},
"reviewBody": "Delicious! Just like my grandma used to make it :) I add extra nuts and celery and it’s pure perfection"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Orr"
},
"reviewBody": "Just like my grandma made. Thank you so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Bryant"
},
"reviewBody": "I made this for my Christmas dinner December 2019. My grandma maymie makes it for all holidays and dinners. I saw this recipe and it looked just like hers. the taste was just like she made it for me. It was simple and my family loved thank you so much.\n stephanie Bryant \n Clarksville, Mo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Gill"
},
"reviewBody": "yes i would make it again!\ni added 1cup of marshmellos\nmarachino cherries\ncoconut"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Ritchie"
},
"reviewBody": "Next time I won't leave it in the refrigerator for a full hour because it begins to set. I think 30 minutes will be long enough. Everything else was simple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Part Time Cook"
},
"reviewBody": "Came out perfect! Will use it forever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Trevino"
},
"reviewBody": "Turned out perfect!, just like the one from Luby’s. Made one for thanksgiving and now gonna make another one for myself"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patticakes"
},
"reviewBody": "My family loved this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Genny Medford"
},
"reviewBody": "Used frozen thawed whipped topping instead of whipping heavy cream 16oz may be too much of whipped topping- So far I have only sampled before letting it set for a few hours so cannot really tell.\nAlso used key lime pecans as festive topping on top.These were green and premade at store. \nI used sugar free lime because I am diabetic and wanted to eat some although still sugar from pineapple and key lime pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Lentz"
},
"reviewBody": "Yummy! I didn't add the nuts, cause I just hate nuts in things.. lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Griffin"
},
"reviewBody": "This came together exactly as the recipe said it would! I was so pleased, as I had never had much luck adding fruit to Jello in the past. It's yummy with a dollop of whipped cream or mayo. Or just by itself. Very light and refreshing. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "My mom made this too except she also put in a small jar of chopped green olives with pimentos. We called it our Easter salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ken Gapinski"
},
"reviewBody": "it was a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Aiton"
},
"reviewBody": "No changes. loved it just as it is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VickiefromCa"
},
"reviewBody": "I remember making a very similar lime jello “salad” in the ‘70’s &amp; ‘80’s. Jello molds were very big back then. No decent party or celebration was without them! Lol! I got the recipe from a friend after eating it at her house. I remember She used Cool Whip but I converted it to real whipped cream. She always made hers with a mashed banana folded in too. It was pretty simple compared to a lot of the jello molds back then. A couple packages lime jello dissolved as directed on package (but with less liquid), a can of drained crushed pineapple, cream cheese, mashed banana, whipped cream and chopped pecans. I remember letting the cream cheese come to room temperature and folding it into the whipped cream and then folding that, the banana, pineapple and nuts into the lime Jell-O.. Never cooked or reduced anything just mixed it all together in a big bowl, then dumped into a pretty jello mold. Simple and good. Not something we make any more. Guess we’ve gotten too “Foodie”. Sometimes I miss the simplicity of the old days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "This is a great recipe and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki Horchner"
},
"reviewBody": "My Grandma used to make this during the holidays. I found three different hand written recipes of my grandma's and each recipe was a little different. She listed all the ingredients, but not the instructions. I made this recipe the night before Thanksgiving and I think it was the closest to my grandma's. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "noyester2011"
},
"reviewBody": "Very yummy and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnWC"
},
"reviewBody": "I was looking for recipes that were popular in the 70's for my disco/70's party, and remembered this lime jello salad! Mmmm! It was a delicious trip in the time machine, and everyone at my party raved about it. It is one of the dishes I remember always having at big dinners when I was growing up, and it didn't disappoint. Several friends say they still have it every Thanksgiving. I may need to revive that tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kitty Castillo"
},
"reviewBody": "This was delicious either as a salad or dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Peterson"
},
"reviewBody": "We really enjoyed this salad. I'm currently on a quest to discover those old fashioned American holiday dishes esp from the 50s and 60s 'When Cool Whip was a food group. \"\n\nThis was pretty easy to make, I left out the nuts. I' ll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "I added 1 cup of fresh shredded coconut. Whipped Philadelphia cream cheese instead of the block. Strauss whole whipping cream from Whole Foods. Put it in a mold. We have several Diabetics so substituted Splenda - 1/2 the amount specified. Let is set overnight. Was a HUGE hit. People went back for thirds! Glad I read that fresh Pineapple would prevent it from setting. The crushed Dole canned was fine. Thanks for the recipe. Passed it on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Holdcraft Lubich"
},
"reviewBody": "I grew up having this great tasting jello salad at our holiday meals. As an adult I continued the tradition for my own holiday dinners. My kids look forward to it. I have a \"thing\" going with one of my sons where when I make it I put a serving in a bowl for him to have earlier in the day. He looks forward to that \"special treatment\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Astral Squal"
},
"reviewBody": "I had lost the recipe for my grand mom's green stuff (a staple of every holiday during my childhood). This has too much cream and over powers all the other flavors. 1 cup of cream is plenty. Add a second cup of hot water to make up for using less cream. I think pecans would be good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy"
},
"reviewBody": "I used 2 boxes of Lime jello. Also used softened vanilla ice cream instead of whipped cream. I didnt heat pineapple nor did I drain it. Also didnt add nuts. I do put it in a crystal bowl, garnish with whipped cream rosettes, an cherries.\nMy grandmother made this for years this way and because my mom didnt like pineapple, grandma would make it with fruit cocktail for her."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Rouge"
},
"reviewBody": "Excellent recipe! I have been searching for this for years, we always had it at Christmas and this is it!! I omit the pineapple but use the juice and I prefer walnuts. very easy and very delicious. Thanks so much for sharing :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAWERI"
},
"reviewBody": "I was looking for something similar to my grandma's orange jello salad and this was a great substitute. I think I like the lime even better! I doubled the recipe but kept the cream the same and it turned out great. I love pineapple, but a whole can is a bit overwhelming and too chunky. I'll cut the pineapple in half next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Skulls Black"
},
"reviewBody": "I made this for last years thanksgiving and everyone loved it so much that it was gone by the end of the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Saint Anne"
},
"reviewBody": "As written, it was a little problematic... One hour in my fridge and the thick jello had already set up. Next time I will do 1 c. of cold liquid (juice/water) in addition to the 1 c. boiling water, and only chill for 45 minutes. Added marshmallows, as is common in this kind of salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "macshirleyw"
},
"reviewBody": "I have been making this salad for over 55 years -- but we have always included small chopped pieces of celery -- try it with celery - just perfect to us. At Christmas always decorate with maraschino cherries -- now going to try as suggested red jello on top -- t1hank you for recipe -- lost my original written recipe. Oh, I forgot to mention -- have never heated pineapple - just dump whole can crushed pineapple into partially set jello with celery and chopped walnuts. Let set in refrigerator 15 to 30 minutes then fold in whipped cream. Have also used 1 small lemon jello with 1 small lime jello and sometimes small curd cottage cheese -- especially good in summer with the cottage cheese.\n\nmacshirley"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Livengood"
},
"reviewBody": "I love this jello salad!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Novice cook"
},
"reviewBody": "Made this for a family cookout lats night and everyone LOVED it. I read the negative reviews for this, and disagree. I did everything exactly as the recipe called for, though I'm not sure what not heating the pineapples would do to it. We all liked it a lot :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Great recipe. I made a few changes for people watching their carbs. I used sugar free Jello, used half the amount of pineapple and juice (made up the liquid in water -- it was still plenty sweet. Used walnuts because that's the kind of nuts I had. We loved it, and it was very pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Essynkardi"
},
"reviewBody": "This is a perfect recipe for Homestuckers looking for a good Sopor Slime recipe! And this is someone who literally spent months looking for a good sopor recipe that gave the opaque-ness and color of sopor in the comic and still tasted good. \n\nWhen I first tried it I didn't have any lime (only lemon) jello and no whipping cream. Even then, it turned out great with a little bit of improvised coffee creamer and milk!\n\nMy second attempt was with Green Apple Jolly Rancher jello. The flavor of the pineapple juice (I didn't add the pecans or the solid pineapples to keep the aesthetic, I also added a bit of green food coloring) combined with the green apple jello is very unique and a perfect mix!\n\nNext time I plan on making it in a pre-crusted pie tin for Sopor Pie and maybe also use some sort of mold to make them into little snackables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ReneePaj"
},
"reviewBody": "I lightened this recipe up by subbing 2 pkgs SF lime jello, FF cool whip, and reduced fat cream cheese (and only used 6 oz.) I didn't understand why you needed to boil the pineapple in it's juice, so I omitted that step. I used walnuts instead of pecans, because that's what I had on hand. I've made similar salads like this in the past, they are delicious, but more of a dessert than a salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda_Quilts"
},
"reviewBody": "This is the fifth or sixth year I have been making this recipe and we love it. It is one of the things that my family asks for every single Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tranggurly"
},
"reviewBody": "Delicious!! I make this every year during the holidays... friends &amp; family always say \"oh noooo, not that green thing again,\" but it's always the first dish to be finished! I add walnuts instead of pecans. \nBe sure to boil the crushed pineapple! One year I tried to throw in the pineapple without heating it on the saucepan as directed, and the gelatin never solidified. \nThis is a great side dish and a big hit at every party gathering"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HuggyKat"
},
"reviewBody": "I have loved this recipe since I was 3 yrs old (so 42 yrs.) As an adult I call it \"Big Spoon Salad\" because I'll keep returning to the fridge with a big spoon (tablespoon ) and get a spoonful at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Ballard"
},
"reviewBody": "I love this recipe, though I add small curd cottage cheese and eliminate the nuts (kids tend not to like them)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CBUNNUMS"
},
"reviewBody": "This has been a tradition at our holiday for years. We leave out the pecans, don't heat the pineapple (our recipe didn't call for that) and sometimes don't whip the cream when short on time. Still turns out great! Oh and an immersion hand blender works beautifully when the jello sets up a little faster than you expected.\n My husband doesn't like pineapple, so I made him a cherry version. Subbed two 4 oz. boxes of sugar-free black cherry jello, upped the boiling water to 1-1/2 c. and added chopped fresh bing cherries. Yum! Could even add chopped almonds to compliment the cherries. Next? Strawberry-banana walnut? The possibilities are up to you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Very good. Fist time making I thought the prep directions were more than needed to do. So the second time I made it, I dissolved the jello in the hot water, added the cream cheese and beat with mixer. Added the pineapple with juice, and 1/2 cup pecan pieces. Then I folded in the whipped whipping cream. This way it was more simple to prepare and came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tranggurly"
},
"reviewBody": "It looks kinda gross but it's D E L I C I O U S"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Ash"
},
"reviewBody": "i did not add the pecans because i didnt have them but this dessert is light, refreshing and addicting. my friends couldnt stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Couch Strebler"
},
"reviewBody": "Maraschino cherries are a must... they add a beautiful color that's especially nice at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Pacheco"
},
"reviewBody": "Made this for Thanksgiving and everyone loved it. Making it again for Christmas. It's so light and fluffy with a great texture. If you want to give a little kick add 1/2 teaspoon of Horseradish. Sounds crazy but it gives it a little zip. I have made it with and without and they are both great! Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki"
},
"reviewBody": "This is fantastic! I omitted the pecans and made it just like the recipe says. It was great and everyone enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Stanton"
},
"reviewBody": "Simple and delicious. I've made this recipe several times and gotten compliments each time. I sometimes add a bit of sweetened coconut to mine. Also, I save time by chilling it a few mins in the freezer before moving it to the fridge. Just be careful not to let it freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAWNA1"
},
"reviewBody": "For a really pretty addition add some diced pimentoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "This was great! I doubled the recipe; fifteen people still managed to eat the whole thing!!!! The only complaint that I got was that there were too many pecans. Next time, I will cut in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "divegreat"
},
"reviewBody": "I have now made this recipe two times.\nWhen the recipe calls 2 cups heavy whippping cream, I confused about if it meant 2 cups whipping prior to being whipped up or after being whipped. \nThe first time I made it with 2 half pint cartons of whipping cream. The second time I made it with just one carton. I thought it served more people with the 2 cartons of whipping cream, but thought it tasted sweeter when I only added 1 carton. I also chose to omit nuts due to offending many people. When I made it for the first time, I had an immediate request for the next gathering to make this exact jello, so it is tasty and popular."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTLMSTR"
},
"reviewBody": "Very, very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlwaysCookin"
},
"reviewBody": "OK, so it's fattening! But it sure is good! I'll be making it again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Took this to a Christmas get together on my hubby's side &amp; it was a complete hit! Mother in law even asked for recipe as well as 2 others. We served it with the meal, and some chose it for dessert too, (over pumpkin pie). My grandma makes a variation of this with marshmallows, but I prefer this recipe. I recommend it setting overnight for the flavors to blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Made several salads for potluck, took this one--knew it would go over well (make night before for flavors to blend and to set). What can you say bad about a jello salad that looks as pretty as this one! The refreshing lime green color just makes your mouth water. This is an old tried but true recipe thats been around for years and the reason is --- it's goooood! I'll be making this for years to come, it's easy and can be served with the meal or as a dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I was not impressed with this salad. Sorry. I guess I was expecting something more. I added one package of instant vanilla pudding and that seemed to improve the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RoxStar"
},
"reviewBody": "It was good, but not as sweet as I am accustomed to this recipe being."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "S.O.S. I am hosting my first Thanksgiving dinner and am a little stummped!!\r\nI know that this is NOT an open forum, but would love anyone to respond as far as categorizing this recipe as a side dish or dessert! It sounds wonderful, but not sure when to serve it!!\r\nThank you!\r\nMRSKKS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HomeJewel"
},
"reviewBody": "I just took this to a potluck today. My 10-yr old daughter made it and we weren't able to bring any of it home! She elected to not include the nuts. I wouldn't have minded the nuts, but who am I to disagree with a cook-in-the-making?!\r\n\r\nJust like the other reviewer, we found that it needed only one-half hour to set. We previously tried an hour and it was too hard so the kids got some jello jigglers instead from that batch. We had trouble dissolving the gelatin, but it really didn't matter much once it was blended with the cream cheese. The best part of this recipe is the combination with REAL whipped cream instead of the typical Cool Whip. It will definitely be added to our favorite jello salad recipes. Thanks for posting! \r\n\r\nNext time I will try using orange gelatin because I also love the orange/pineapple combination, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Shute Iverson"
},
"reviewBody": "I've been searching all my cookbooks for this recipe - my grandmother always made this for holiday meals, and I'm so happy to have found it! I found that the gelatin sets up too firmly if left for an hour - 1/2 hour is adequate. Also, I used only a little more than half of the whipping cream and it turned out fine. Molds beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was good, but not as flavorful as it sounds. I could hardly taste the cream cheese...but you can't hardly go wrong with cranberry, cream cheese, pineapple, and nuts all in one dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Gilbert Sigman"
},
"reviewBody": "It was really good, just like the kind at Luby's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMDAD4KIDDIES"
},
"reviewBody": "I came across this recipe a couple years back while looking for something similar it has been a huge hit with Thanksgiving and Christmas..When I ask my Mother and sister what they want me to bring for dessert its always Lime Gelatin Salad..WONDERFUL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARILYN GREEN"
},
"reviewBody": "This is a wonderful salad. I made it for the family Christmas buffet and added a layer of red jello to the top for a festive look. It will be a new family tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Thank you for this recipe. My Aunt used to make this for every family gathering when I was young. Until now no one in the family could remember how to make it. It it now a staple at all family gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "When I first made this recipe, I taste-tested it before wanting to serve it with Thanksgiving dinner. When I came to my senses, I realized that I had taste-tested 1/3 of the bowl! Wonderful stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very delicious! Although, I would put a small amount aside without nuts for kids. Lots of kids hate nuts. Oh, and if you double this recipe be prepared for a lot!! Chris"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13595/lime-gelatin-salad-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/373/desserts/specialty-desserts/dessert-salads/",
"name": "Dessert Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/980/desserts/specialty-desserts/dessert-salads/jell-o-salad/",
"name": "Jell-O&reg; Salad"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13595/lime-gelatin-salad-i/",
"name": "Lime Gelatin Salad"
}
}
]
}
}
, "about": [
]
}
]