				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Liège Belgian Waffles with Pearl Sugar"
,"datePublished": "2020-06-18T23:41:33.000-04:00"
,"dateModified": "2022-09-20T13:45:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BRSMITH63"
,"url": "https://www.allrecipes.com/cook/71265"
}
]
,"description": "These Liège waffles are a tasty treat. The pearl sugar softens under the heat of the iron and creates areas that are crispy and sweet throughout."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AC0p7dVtTrikr36D7uhZsdsDrP0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/470854-52fc4f60d55947c3911c1b16e6badd55.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Liège Belgian Waffles with Pearl Sugar"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "160"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "458 kcal"
,"carbohydrateContent": "62 g"
,"cholesterolContent": "106 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "277 mg"
,"sugarContent": "3 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (.25 ounce) package active dry yeast",
"1.5 tablespoons white sugar",
"0.75 cup lukewarm milk",
"3 large eggs",
"1 cup melted butter",
"2 teaspoons vanilla extract",
"3 cups flour",
"0.5 teaspoon salt",
"1.5 cups pearl sugar (such as Lars' Own®)" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sprinkle yeast and white sugar over warm milk in a small bowl. The milk should be no more than 100 degrees F (40 degrees C). Let stand for 15 minutes until yeast softens and begins to form a creamy foam."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, melted butter, and vanilla into the yeast mixture until evenly blended; set aside."
} ,{
"@type": "HowToStep"
,"text": "Stir together flour and salt in a separate large bowl, and make a well in the center. Pour the egg mixture into the well, then stir in the flour mixture until a soft dough forms. Cover with a light cloth and let rise in a warm place, 80 to 95 degrees F (27 to 35 degrees C), until doubled in volume, about 30 minutes. Gently mix in the pearl sugar."
} ,{
"@type": "HowToStep"
,"text": "Preheat a waffle iron according to manufacturer&#39;s instructions."
} ,{
"@type": "HowToStep"
,"text": "Place a baseball-sized ball of dough on the preheated waffle iron. Cook waffles until golden and crisp, about 2 minutes. Repeat with remaining dough. Allow waffles to cool for 2 to 3 minutes before serving."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sduffa"
},
"reviewBody": "These are a favorite in our house and are expected by family for Christmas treats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Today was the first time I made these. I had no idea what to expect but my husband says they remind him of being in Germany Definitely a keeper ! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Gatt"
},
"reviewBody": "Quick and easy to make. They turned out perfect. They cook quicker than waffles made from a more liquid batter so be careful to not let them burn. The pearl sugar tends to stick to the waffle irons making cleanup a chore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Campbell Armstrong"
},
"reviewBody": "I lived in Europe for awhile 20ish years ago and loved these waffles. I never thought about making them until I came across this recipe! These are really delicious. Not exactly the same as the ones in Europe, but really close and more homemade!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eck"
},
"reviewBody": "This is an excellent recipe. My Belgian stepfather said they taste “just like home”!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christinalouisawilson"
},
"reviewBody": "Exactly what I was looking for. The recipe was right on target, and the crispy caramel coating that results from the pearl sugar is soooo delicious! I would definitely recommend toppings such as whipped cream, fruit, etc. But it would also be great with savory toppings. Bacon anyone?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Cecil"
},
"reviewBody": "I made these tonight for a fun dessert and they are incredible! I ended up having to let the dough rise twice on the counter because of an interruption, and they were still perfect! I served them with whipped cream, strawberries and chocolate sauce and it was a delicious combination. These are perfectly crisp from the caramelized pearl sugar, yet tender and yeasty in the middle. I made the recipe exactly as written and I wouldn’t change a thing. My new go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BILL"
},
"reviewBody": "Never again. Way too much trouble. They were okay. Definitely needed syrup as they were a little dry. And what a mess! I saw the other reviews about cleaning up the waffle iron. I may have to just throw away the waffle maker and buy another one! Things to think about: how does one mix butter and milk? LOL. Not very easily. Also, do you have a \"warm\" place for the dough to rise? I didn't. I warmed up the oven and used that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "Too much sugar! I suggest you make the first waffle with half the sugar and then adjust to taste by adding some more. I used Pearl Sugar from King Arthur which says it doesn't melt &amp; it didn’t. Someone else mentioned another kind of pearl sugar which carmelizes- would that be better? The waffle itself was tasty- but my 5yr old grandson complained too sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abbygallagher13"
},
"reviewBody": "I followed this recipe exactly. When I mixed the wet and dry ingredients the result was more like a batter rather than a dough. I let it sit to rise but it did not rise much at all. I was worried that I'd done something wrong but the final result was absolutely delicious. We sometimes get waffles from Waffle Cabin at different snowboard resorts and this was my attempt to recreate those. Everyone loved them and said they were extremely similar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oddasiangirl"
},
"reviewBody": "These have got to be the best liege waffles recipe out there. The taste and texture were perfect. Just know that you will have a helluva time cleaning up that waffle iron after you are done but these are all so worth it. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill E"
},
"reviewBody": "These are doughier, yeastier, and sweeter than what I have come to know as a “Belgian waffle” but I think that’s because these are authentic. Not sure as I’ve never actually been to Belgium, Ha! They don’t need a lot of sweet/heavy toppings as they are already very sweet and buttery right out of the iron, so I would top for a little fruit and maybe some whipped cream. They leave your iron messier because of the pearl sugar caramelizing all over the place, but biggie. Glad we tried them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isa Gargi"
},
"reviewBody": "I have been attempting to recreate through testing various recipes the Liège waffles I had in Belgium. This recipe came closest - it's delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelnorthrop"
},
"reviewBody": "Excellent recipe! The best recipe I’ve ever found on this site.\n\nI followed it exactly and was super happy with the results. I used Red Star Platinum yeast which is what I always use. I had a bag of pearl sugar but didn’t want to use the entire bag so I cooked sugar down (1.5 cups sugar and 4TBS water until about 295 degrees) and poured it out onto a baking sheet with parchment paper over it. After letting it cool for 15 minutes I chopped it up and used half that and half pearl sugar. In the future I’ll just use the cooked sugar method as I think that melts a bit better into the waffle surface than the pearl sugar did. I only have a little tiny Dash waffle maker that makes eggo sized waffles but it worked fine in there. I normally buy these expensive Belgian waffles and these are identical in size and flavor! Since the Dash waffle maker makes such tiny waffles, this recipe made tons! Would recommend!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Great for breakfast, dessert or a snack. I used smashed up sugar cubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DubyaD40"
},
"reviewBody": "We have been waiting for the right time. We made for my daughters birthday at work. Made our breakfast waffle buffet. They didn’t last long. I would reduce the amount of pearl sugar a bit on my next batch as there is a lot in the recipe. Great but a lot of work when making 1 at a time for a huge crowd"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "Greeting from Japan. \nAdded Japanese coarse sugar on the surface instead of adding the pearl sugar into the dough. It’s so good with a cup of coffee.\nThank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "5krunner"
},
"reviewBody": "In what can only be described as “the best waffles I ever ate”, this recipe is amazing! I made it 100% as is, didn’t change anything. I ordered the pearl sugar on Amazon, pricey but well worth it. The only thing I absolutely detested about this whole experience, was the cleanup. Cleaning that waffle iron after it was done was awful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalia Yukhnovskaya"
},
"reviewBody": "Made few times, very good, same taste as i tasted in Brussels. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koby Weiner"
},
"reviewBody": "I‘ve made these multiple times for my family and we absolutely love them! They are easy and relatively quick and don’t make a mess. The only trouble is cleaning the waffle iron when done. Also, I didn’t want to waist that much pearl sugar, so I only used about 1 cup. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Henry"
},
"reviewBody": "These taste almost exactly like the waffles I used to buy on the street corners in Verviers, Belgium thirty years ago!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kylee Williquette"
},
"reviewBody": "Love this recipe!! We have tried several Belgium Waffle Recipes and this one is the best! Some of the tips that I thought were helpful: 1) Used crushed up sugar cubes and then put them through sieve to get 1 1/2 cup pieces only (without fine sugar bits) 2) After rising and mixing in sugar pieces, put dough in fridge for 1 hour. It rose some more and made it easier to work with 3) Cooked it about 3 1/2 minutes on high in waffle maker to make it crispy on outside and soft in middle (makes a mess but worth it) 4) Kept done waffles warm in 190 oven, on wire rack over cookie sheet. This way they stay warm and don’t get soggy. 5) Served with Nutella, Strawberries and Whipped Cream!!! Delicious!! We will definitely be making them again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariel"
},
"reviewBody": "These were amazing. I ordered Lars' Own Belgian Pearl Sugar from Amazon. I left the dough to rise in the built-in microwave above my preheated wall oven. Followed recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luke Roebuck"
},
"reviewBody": "accidentally doubled the butter but still good, eager to retry with the proper amount!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodiemom"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani Iraheta"
},
"reviewBody": "I absolutely loved how they turned out! \nIt was a hit at my daughter's party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kazi Caze"
},
"reviewBody": "Delicious...simply delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "specialk4791"
},
"reviewBody": "Love this recipe. I use this (with less sugar) for my waffles n' chicken combo. The steps are extremely important to follow and having pearl sugar absolutely makes a difference in caramelization of the sugar on the surface."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Patricia Penchuk"
},
"reviewBody": "Really great result. I used Swedish pearl sugar found at an Eastern European grocer, but I think \nIkea stocks too. All-clad waffle iron worked a treat. I let the dough sit longer than the recipe stated but only because we were not ready to make them yet. No issue with leaking butter either. I would suggest the iron itself has to be able to really heat up hot, and a generic waffle maker just cannot do that. \nFlavour was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dallin Bruun"
},
"reviewBody": "I make this vegan, super delicious. My suggestion: don’t add the pearl sugar until you’re ready to cook, it will dissolve into the dough and won’t caramelize the surface of the waffle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella Chef"
},
"reviewBody": "Just like Jamba Juice! I loved them. I just crushed sugar cubes to go in, the amount of butter is fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Aston"
},
"reviewBody": "Excellent waffles, just like in Bruges!Now, IF you don’t use all your dough, bake the dough balls at 400F for 25 minutes (dark golden brown). Incredible sweet rolls. You’re welcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margaret H."
},
"reviewBody": "Made this exactly as directed. As I folded in the sugar I thought it looked like a lot compared to similar recipes I've tried...about 50% more with less of everything else. Oddly enough, they didn't seem to be any sweeter. I will reduce the sugar to about 1 cup next time. The extra sugar made much more of a mess in my waffle iron and left a pretty hard sugar crust on the waffles, otherwise I might have given this 5 stars. Overall good flavor and texture. I will try this recipe again with less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheela"
},
"reviewBody": "I love this recipe and make it often"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennybean0305"
},
"reviewBody": "These waffles are amazing! We ate them plain, and it was fantastic. I did also have butter leaking out onto my waffle iron, even after refrigerating the dough to try to prevent it. I will probably cut back on the butter next time by a bit - maybe decrease to 3/4c. Even with the butter leakage, they are SO GOOD!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Medina"
},
"reviewBody": "I love love LOVED this recipe! my husband was a big fan too! The waffle is sweet enough to eat alone if you don't have any toppings. It is even better with some whipped cream, strawberries and blueberries on top! the texture is crisp on the outside and soft inside. The instructions were pretty straightforward even for a novice in the kitchen like me. will be adding this one to the books!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalia Pakin-Amer"
},
"reviewBody": "Turned out great! Made a large batch, separated into individual portions, saran wrapped and froze in a freezer safe bag. Makes for easy breakfast or lunch any time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIKINE22"
},
"reviewBody": "I didn't have pearl sugar, so I ground up pure maple candies (the ones in the shape of maple leaves) and added brown sugar. Amazing! These were such a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thy"
},
"reviewBody": "Definitely a keeper! Followed the recipe exactly. The suggestion to refrigerate was a great idea but not a must."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quita Endicott"
},
"reviewBody": "Super easy. We have a restaurant here that does a waffle with goat cheese, bacon, basil and an egg (over easy or sunny side up) all on top, served with maple syrup. It was way expensive to add the bacon, so I thought I could do it myself - it was fabulous! I just followed the recipe until the pearl sugar part and then put the goat cheese, bacon, and egg on top then garnished with thin sliced basil leaves and topped with syrup - my family loved it and it was cheap and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aimée Weissman"
},
"reviewBody": "The pearl sugar needs to be cut by 1/3 to a 1/2, but overall yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M'Liss"
},
"reviewBody": "I made it as the recipe suggested and they were very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nurt"
},
"reviewBody": "I agree with another review, there is too much oil. My dough also started seeping as I was using it.\nI reduced the Pearl sugar to 1 cup, as the pearl size I had was on the larger side, and In glad I did. It was plenty. The waffles came out tasty, but also more fragile than other recipes I've used. Great for the relatively quick rise time, and pretty nice end result overall. I hope they freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "randi"
},
"reviewBody": "I’ve made these many times, so much that I’ve killed 2 electric waffle makers! (Now I’m using a non electric stove top aluminum waffle iron)\n\nI reduce the sugar amount to just 1/2c of pearl sugar for perfectly sweet waffles. They freeze well too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CorBreWhit"
},
"reviewBody": "Tweaked it a tad bit, great waffle!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Ehh, tasted kinda plain, didn’t use real pearl sugar. It just sounds gross and makes me feel sick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KBarberRN"
},
"reviewBody": "Delicious! Turned out perfect even though I didn't have quite enough pearl sugar I substituted the rest with turbinado sugar crystals and they still turned out great. I'll definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary E Lieurance"
},
"reviewBody": "Recipe turned out great! Will definitely be making these delicious waffles again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby Scharffs"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Whyte Caplin"
},
"reviewBody": "I’m married to a Belgian and we visit the county often. These were authentic, divine and are pretty easy to make. I made the recipe exactly as written with the addition of putting dough balls back in fridge to firm up the butter before cooking. These were so yummy guys. Make them!!!!! I’m thinking new x mas morning treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Snyder"
},
"reviewBody": "SO GOOD!!!!!!!!\nI made these with diy pearl sugar. Wasn’t that hard to make. Drizzle these with chocolate and put raspberries and whipped cream on them as a topping!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lytta_c"
},
"reviewBody": "Great waffle recipe! We wanted a sweet Belgian waffle and this is definitely it. It does take a bit of planning ahead but was good for a lazy Saturday. We didn't want too many waffles since it was just my husband and I that would be eating them so we halved the recipe. Turned out great with my husband making the pearl sugar (not sure which recipe he used but I know it was normal white sugar in it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "boo"
},
"reviewBody": "I think it was way too much butter - dripping with oil. Would definitely reduce the butter. The waffle dried out after just one day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim D"
},
"reviewBody": "Not a fan of standard waffle recipes, but the sugar in this (purchased on Amazon) makes all the difference. I can eat these plain with no toppings and they’re delicious. The recipe is also very easy to follow, and besides waiting for the dough to double in size is finished rather quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jill Christine"
},
"reviewBody": "I didn’t like them. I prefer a waffle that is tender, I found these tough. The amount of butter called for was crazy, I reduced it. That may have affected the texture, but regardless there is too much butter so I won’t make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "I lived in Belgium and fell in love with these. The local waffle food trucks do a decent job but this recipe is better. I didn't change a thing, used Belgian pearl sugar from Amazon and we got 7 great gauffres de Liège. Merci!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jena-licous"
},
"reviewBody": "Mind blown flaky ness! Made pearl sugar myself. Don’t skip or sub that ingredient ! Served with vanilla sauce strawberries and whipped cream. Divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "psychomar"
},
"reviewBody": "We found these more dense than we like but the flavor is good. I prefer them without syrup as they are very sweet with the caramelized sugar. I made them the night before and left mine to rise at room temp and then let them finish rising in the fridge. Not sure if that made the difference, but we are also at a high altitude, which may have also played a factor (around 7000 ft). They are easy to make but I would give it five stars if they weren’t so dense. We prefer ours light and crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SDStace"
},
"reviewBody": "It really needs 1/2 tsp cinnamon, but otherwise, it's a winner. Very similar to the waffles we enjoyed in Liege."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie Porter Vorderstrasse"
},
"reviewBody": "This recipe is an ok one when I couldn't find the one I usually use. Tip: if you don't have or can't find pearl sugar you can crush up sugar cubes in a bag with a rolling pin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "srbibo"
},
"reviewBody": "They did not come out as I expected. They were too dense and cakey. Nothing like the real thing! I made the recipe twice with the same mediocre results. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Laz"
},
"reviewBody": "Made these for my husband and nephews (9 &amp; 13) and we loved them! I used an ice cream scoop to get a good size ball of dough into the Belgian waffle maker. The recipe was easy to make and we used all ingredients but I cut the pearl sugar in half because we put Nutella, or cinnamon w/whipped cream or berries and whipped cream on top. We still had plenty of sweet, crunchy bits throughout the waffles. Fantastic and everyone would eat it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Prepared exactly according to recipe. These are so good the really don't even need anything on them. Yeasty and sweeter than the regular type waffle mix. It's more of a dough than a batter. Just carry on. They do not fill the waffle iron pad to the edges due to the doughy texture. These are delish!! Well worth the extra time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha"
},
"reviewBody": "I'm still eating it and cooking as I type this. This is an amazing recipe. I'm eating them plain but will probably be eating this all day. Got the sugar off of Amazon and think this recipe is 100% accurate! Love love love them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koekje"
},
"reviewBody": "OMG!!! This is EXACTLY like the waffles we eat here in Belgium. I would not change a thing. For those having problems with them being too greasy or with the butter seeping out while they are baking try putting the dough balls in the refrigeration for at least an hour if not longer and then bake . I did notice the dough was a bit too greasy after it had risen, so I added my pearl sugar, made balls and then set them in the refrigerator for about an hour and a half then baked them. I am so happy we have pearl sugar here. :)) This is approved by a Belgian. If you haven't tried this recipe you should."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I've never tried Belgian Waffles before. I picked one up at a local juice bar for breakfast and I was hooked! I knew there had to be a recipe out there. I made about 20 waffles for the price of 1 waffle at the store! I froze most of them and take one out for work when needed. Going to try sugar cubes instead of pearl sugar next time. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vivian"
},
"reviewBody": "I used 1/2 cup of butter and 1/2 cup half-n-half. I also left the dough overnight to rise. My husband and kids love them. They were crunchy outside and chewy inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stella"
},
"reviewBody": "Amazing. If you make them ahead of time, DO NOT stir in the sugar ; wait till it’s time to start cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "These were very good. I used this recipe, but with bread flour and a different technicue based on a Belgian man I saw make them. I used instant yeast and combined that with the flour, sugar, and salt. Added softened butter to that in pieces then the milk then the eggs and then the vanilla. I did need a bit more flour though. After the rise I added the hail/pearl sugar in mixer with dough hook on low. Divided into 10 portions on a sheet pan then refrigerated for 20 min before cooking. Had no problem with oozing butter. Would definitely make agin! Found the sugar on Amazon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Jones"
},
"reviewBody": "Just like I remember from my time stationed in Belgium. I made my own pearl sugar by adding a tablespoon of water to 3/4 cup of sugar and cooking on the stovetop on low setting for about 30 minutes to clump the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Delish!! I used instant active dry yeast/bread machine yeast. I halfed the yeast. So yummy with cookie butter and whipped cream. Oh and I did not have any pearl sugar, I just made without and it still was yummy. I am sure it would be better with it, but just put on more cookie butter. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Kudrna"
},
"reviewBody": "Tasted great just like the Leige waffle place I like to visit. I used a regular waffle iron and would think it works better with a Belgian waffle maker. The only challenge I had was having to rinse off the iron after every waffle batch because melted sugar and butter were burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penelope Theisen"
},
"reviewBody": "Taste is delicious! However, what am I doing wrong? I always need to add extra flour to make it a dough. It's just batter when I follow the recipe. Not judging the recipe on my situatio. 5 stars!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquie"
},
"reviewBody": "fabulous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Ellis"
},
"reviewBody": "I loved the recipe but found that I could use a little less butter (3/4 cups) and it turned out just as good. A little lighter in fact. \n\nAlso, I couldn't find pearl sugar so I bought sugar cubes and crumbled them with a meat tenderizer. This worked perfectly. No need to go find fancy pearl sugar or make your own on the stove when you can just smash some sugar cubes. \n\nThis recipe however is delicious. Now one of my favorite desert recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amy Lindell"
},
"reviewBody": "I made the dough and then after it rose, I put it in fridge till morning. Dough was very stiff and I had ti fold in sugar by hand. I got 8 balls out of it, but the waffles did not impress me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vitor Lory"
},
"reviewBody": "The family loved it, but it did offer a few challenges while baking.\nIt's relatively easy to overfill the waffle iron, so I actually reduced the amount of dough.\nI guess a baseball size chunk will be for very big waffle irons.\n\nOver the concerns of too much fat, I reduced the amount of butter by around 15%."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "I tried this recipe after attempting another recipe which required a lot more time. This recipe was so much easier to follow and the results were so much better. They taste amazing and I would make them over and over again. The only change was that I used turbinado sugar instead and I used only 3/4 cup. They probably could have been less sweet, but my husband and I loved them and I can't wait to make them for our children."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rora Starita"
},
"reviewBody": "In the last few years, I've made this recipe over 10 times. Last Christmas, I made over 80 of them as presents. When I first started, I used the Swedish pearl sugar because that's all I could get my hands on and they were great. Last year I was able to order some Belgian pearl sugar online (and now it's available on Amazon as well) and they weren't necessarily any better but they were different in a good way. I don't change anything about the recipe though I occasionally add walnuts. To get consistent sizes, I cut my dough in half until I have 16 balls. Just to get things started, I spray my waffle iron with a little coconut oil before the first waffles go in but after that the butter takes care of things. I can't recommend these enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Lee"
},
"reviewBody": "I was initially worried as they looked like they were going to turn out heavy, but instead they turned out perfect. Children approved and this recipe will take its place amongst our regular Sunday morning rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SIS"
},
"reviewBody": "I made this recipe in a Gluten Free version for my daughter who has Celiac disease. The end result was yummy! They aren't as light but I wouldn't expect them to be. They have the golden crust and the sugar bits that make them just delicious. I was very pleased! I will say that I read some of the previous reviews and did cut the butter down to 1 stick (1/2 c) and the pearl sugar down to 1 heaping cup. This worked well for us. Plenty of butter to crisp up and keep things from sticking and enough sugar to add the crunch without being overwhelming. Easy to follow instructions cap off a great waffle experience!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Merkert"
},
"reviewBody": "These are very rich, but very delicious. I needed to add an extra half cup of flour, and I used Lars Belgium pearl sugar; which I found on Amazon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Arens"
},
"reviewBody": "My third Liège waffle recipe and the others were nowhere as good. This is so close to the street-market waffles I just had in Belgium that I am ecstatic. Anyone know where to buy pearl sugar cheap?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "riblet"
},
"reviewBody": "Too buttery - it oozed out everywhere. Too much sugar, was very sweet. Possibly a recipe that could be tweaked, but as is - not a keeper. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYBROOKE"
},
"reviewBody": "Excellent! This is the second Liège waffle recipe I've tried and it turned out much better than the other. I'm not sure if it helped that I accidentally heated the milk, sugar, yeast mix more than the recipe said, but it helped bind all the other ingredients together which was a problem with my last recipe. These were delicious and we all agreed they were better than the local restaurant's version that we sought to copycat. Definitely keeping this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Palmquist Bixler"
},
"reviewBody": "Good, but overly sweet. I used my grandmother's very old waffle iron and they came out crisp. (Cleaning the 75 year old iron was a bit more than I had planned on, but I do love that waffle iron!). I'll keep this recipe, but will keep looking for perfection. We ate them with fresh strawberries, the Cadbury version of Nutella, and real maple syrup. (not all three toppings at once. )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie R."
},
"reviewBody": "OMG!!! This was an amazing recipe!!! My children inhaled these waffles. Santa was kind enough to put a Belgian waffle iron under the Christmas tree this year ;-) and since then, I've been on a mission to find the best waffle recipes ever! This is one of my top 2 recipes that our family of 5 loves.\n\nI did have to splurge by buying the sugar on Amazon, but it made the waffle. I went ahead and bought 10 pounds, because I figured it won't go bad. The kids loved the sugar in the waffles so much, (and by itself it's fun to eat) I had to hide the bag so I have it for the waffles!\n\nI think the only thing I would do differently is to slightly stretch the dough into a Frisbee shape when placing it on the iron. The waffle ends up being larger and isn't quite so dense.\n\nOverall, amazing recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marl"
},
"reviewBody": "this is the kind of waffles I've been lookin for. I'm not a sweet fanatic so only used 1 cup of pearl sugar and just a stick of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennySuey"
},
"reviewBody": "Made these exactly to the recipe, with the Lars Belgian pearl sugar. Used a George Forman grill on a med-high setting. So delicious. It was a test batch for an upcoming brunch party, my husband and I ate them with whip cream while standing over the grill waiting for the next batch to be done. Super rich, but so good. Definitely more of a dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rytt"
},
"reviewBody": "Amazing ! These taste just like the ones I had as a kid from some missionaries in Belgium. The hardest part was making the pearl sugar. And a little tip with waffle maker clean up. You will have carmalized and burnt sugar in the maker. The easiest was to clean it is to let it harden in the grill. Then turn it on high for 10 to 20 second and ALL the sugar will just peel out like taffy. And\n it taste great to after it hardends reminds me of creme Brule sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SASD"
},
"reviewBody": "Easy and delicious. Made my own pearl sugar first and it worked very well in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pcrider"
},
"reviewBody": "Followed directions exactly but used half the butter, 1 cup is just too much. This was perfect. After allowing the dough to rise you pour in the Dutch sugar pearls. Don't use the Swedish pearls which are a smaller granular. I thought it was weird pouring I gravel size sugar into the dough, but the waffle iron melts the sugar through the waffle. It took a couple of waffles to get the right temp. Just one below medium heat. The waffles should be dense on the outside and moist on the inside and the sugar melted through!!!! I'm trying the other recipe found on google. Takes 2 days to make, several dough rise and refrigeration steps to do. Happy waffleling!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bepple"
},
"reviewBody": "Best waffles! A weekend tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebeccaRealtor"
},
"reviewBody": "Truly like the waffles in Belgium kiosks! Yummmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Fernandez"
},
"reviewBody": "These are absolutely fantastic!!!!!! They are our family favorite. We make no changes to the recipe.... I usually don't rate recipes but I felt obligated to rate this one, it is that good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Payton Mastromauro"
},
"reviewBody": "This is a fantastic recipe. I let the dough rise over night. I would say add the sugar in first as the dough gets very bready and is hard to mix the pearl sugar in after its risen. I also added only about a half cup of the sugar and it worked beautifully and was still plenty sweet. We tend not to like an overly sweet anything! Fantastic recipe as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Chase Romero"
},
"reviewBody": "These waffles are so good. I made 300 for my sisters wedding and have made them several times since. They are always enjoyed by people. They cook nicely and they do well even if you prepare the dough the night before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stenji"
},
"reviewBody": "Years ago, a new mall opened close to our house in Irondequoit NY. There was a little red English delivery van there that had been converted to a Belgian Waffle concession. I fell in love at first bite, and used to make excuses to \"go to the mall\" so I could sneak a snack. Unfortunately the owner closed up after a year or so. Years later while in Brussels I found my wonderful waffles again... just like I had loved back at home. I tried this recipe today, and it was perfect!! I tried chopping sugar cubes to make the pearl sugar... a real pain to get 1-1/2 cups worth. I think I'll order pearl sugar for my next batch (oh yes, there WILL be a next batch!!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hillary"
},
"reviewBody": "Tasted like waffle truck waffles! They were dee-lish! My favorite way to top them is cookie butter (or biscoff), bananas, fresh whipped cream, and a caramel drizzle. If you need more ideas for amazing toppings check out waffle crush, waffle love, and waffle bliss."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213251/liege-belgian-waffles-with-pearl-sugar/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
"name": "Waffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213251/liege-belgian-waffles-with-pearl-sugar/",
"name": "Liège Belgian Waffles with Pearl Sugar"
}
}
]
}
}
, "about": [
]
}
]