				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lobster Ravioli in Tomato Cream Sauce with Shrimp"
,"datePublished": "2019-04-03T23:48:32.000-04:00"
,"dateModified": "2021-08-23T15:16:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ugamuddy"
,"url": "https://www.allrecipes.com/cook/1487920"
}
]
,"description": "Packaged lobster ravioli are dressed up with a fresh shrimp and white wine cream sauce in this impressive pasta dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/l2CKeiw1R3EGm_4xoLQlf0J4Fkc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9359006-5beac3822fb74737b6d64735f3c4ee3b.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lobster Ravioli in Tomato Cream Sauce with Shrimp"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "25"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "606 kcal"
,"carbohydrateContent": "69 g"
,"cholesterolContent": "174 mg"
,"fiberContent": "8 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "911 mg"
,"sugarContent": "8 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 pound unpeeled large shrimp",
"1 yellow onion, quartered",
"2 stalks celery with leaves, cut into pieces",
"1 lemon, halved",
"1 tablespoon dried basil",
"1 tablespoon dried oregano",
"1 tablespoon dried thyme",
"2 tablespoons whole black peppercorns",
"0.5 cup chopped fresh flat-leaf parsley",
"3 cups water",
"1 tablespoon unsalted butter",
"1 shallot, minced",
"2 cloves garlic, minced",
"2 teaspoons lemon zest",
"1 teaspoon kosher salt",
"0.25 teaspoon freshly ground black pepper",
"1 cup white wine",
"1 cup canned petite diced tomatoes",
"0.5 cup heavy cream",
"salt and freshly ground black pepper to taste",
"16 lobster ravioli",
"1 tablespoon chopped fresh flat-leaf parsley",
"1 teaspoon lemon zest" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Peel and devein shrimp, reserving shells and heads. Chop shrimp into bite-sized pieces."
} ,{
"@type": "HowToStep"
,"text": "To make shrimp stock, combine shrimp shells and heads, onion, and celery in a large pot. Squeeze lemon juice into the pot, then add lemon halves as well. Add dried basil, oregano, thyme, peppercorns, parsley, and water. Cover the pot and bring it to a boil. Reduce heat and simmer, uncovered, for 1 hour, skimming away any foam or impurities that have risen to the surface. Strain shrimp stock and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat butter in a large skillet over medium heat. Cook shrimp pieces until pink and almost cooked through, 1 to 2 minutes. Remove and set aside. Add shallots to the pan; cook and stir until shallots have softened and turned translucent, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in garlic, lemon zest, salt, and ground pepper. Cook for thirty seconds, then add white wine. Bring to a boil and cook until white wine is reduced by half, about 5 minutes. Add shrimp stock to the pan, bring it to a boil, and simmer until sauce is reduced by half, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, fill a large pot with heavily salted water and bring to a rolling boil over high heat. Once water is boiling, stir in ravioli, and return to a boil. Cook uncovered, occasionally stirring, until ravioli float to the top and filling is hot, 3 to 4 minutes. Drain well, reserving a little pasta-cooking water to thin sauce, if necessary."
} ,{
"@type": "HowToStep"
,"text": "Stir diced tomatoes and cream into shrimp sauce and heat through. Return shrimp to the pan, taste sauce, and season to taste with salt and pepper. Fold ravioli into sauce."
} ,{
"@type": "HowToStep"
,"text": "Place four ravioli onto each of the four warmed pasta bowls or plates and top with sauce. Garnish pasta with chopped parsley and lemon zest."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "Made this last night and it was excellent. I made some substitutions based on what I had on hand. I didn't have shrimp with heads so I only used the shells, I used white and purple onion, and I used dried parsley in the stock. Not sure how much of a difference it made, and I burned it a little at one point, but it was still delicious. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "This was great. I added more whipping cream like the reviews suggested. I didn’t use lemon, I also added Parmesan cheese and I added shrimp and crab meat to the sauce. It was soooo good once I finished. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Warren III"
},
"reviewBody": "Was an interesting taste. Very sour but was pretty good. Too sore for my daughter though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Warren Lee"
},
"reviewBody": "To lessen time, skip step 2 and use chicken broth (could use seafood broth as well)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Shelley"
},
"reviewBody": "Made this for some good friends while we were at the Gulf Coast. Perfect place for all the “right” fresh Shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Great sauce and great recipe! I added mushroom, but overall it was exactly like restaurant ravioli!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grandX4"
},
"reviewBody": "It is a very good recipe. I basically wanted the sauce recipe to go with ravioli from Costco. Since I didn't have any shrimp, I used chicken broth. It was delicious and didn't overwhelm the taste of the lobster ravioli, but rather complimented it. My only criticism is that the sauce is very thin, even with time spent trying to reduce it. My husband loved it though, so I'll be making it again- with the shrimp next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeerCityChef"
},
"reviewBody": "Any recipe that calls for diced tomatoes, I automatically substitute \"fire roasted \" and then added some cherry tomatoes from the garden (10 halved) and simmered them half way through, while the wine and shrimp juice were cooking down for good measure.The cream wine sauce was light and delicious next to the rich ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mustachio"
},
"reviewBody": "I followed every single solitary detail of this recipe. What ruined this recipe? The insane amount of lemon. One whole lemon cut in half, and squeezing it's juice into the stock, was a HUGE mistake. Compound this by later adding in 2 tspn of lemon zest. Ugh! Horrible!! This was BITTER. Not to mention 1 tspn of Kosher salt was way too much salt as well. And yes, I do like lemon, but in this dish it was overkill.\n\nIf you want this recipe to go well, here is what I recommend….Use half a lemon in the stock, and don't squeeze the juice out at all, just let the stock absorb it. And because you already have the lemon, completely skip using the lemon zest, period. Zest is bitter! Use 1/4 tspn of salt. If that's not enough, add it to your OWN plate later! Also, too much parsley - 1/4 cup would have been enough. Don't use Diced Petite Tomatoes. Go with Italian plum, and shred them up. This sauce needs a little bit of sweetness to kill the bitterness of the lemon.\n\nI ended up having to add some sugar to kill the bitter flavor of this sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Vidrio"
},
"reviewBody": "I used the sauce recipe for another homemade ravioli and it was a hit with the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vannemic"
},
"reviewBody": "awesome! i made this for my wife for valentines day and she loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa "
},
"reviewBody": "This is a SAUCE recipe not a Lobster Ravioli recipe. However, the sauce was delicious and is rated based upon this recipe with changes. Still looking for a Lobster Rav recipe though. Will keep making this sauce in hopes I can pair them. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THECSCARPS"
},
"reviewBody": "I did not do the shrimp stock. The sauce itself is incredible and does not need it. For the sauce I used nonfat milk and some cornstarch instead of heavy cream. I used a cheese ravioli instead of lobster ravioli. Then added some mushrooms. So very good and will definitely make again. Restaurant quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donny D"
},
"reviewBody": "Very ,very good ! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redskit"
},
"reviewBody": "I gave this 4 stars because the sauce as is needed some changes. I added more heavy cream and some parmesan cheese to thicken it up. With those additions, it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa r"
},
"reviewBody": "this is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "Amazing! This is one of the best recipes I have yet to come across. No alterations needed. Great as is! Thank you for sharing! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DOLORES"
},
"reviewBody": "I USED THIS RECIPE AS A BASE, I USED CHICKEN STOCK INSTEAD OF MAKING THE SHRIMP SAUCE, OMITTED THE SHRIMP, USED 1 CUP OF CREAM AND ADDED THYME AND GARLIC POWDER, THEN I THICKENED IT WITH A BIT OF CORN STARCH, IT WAS WONDERFUL, JUST LIKE YOU WOULD GET AT A RESTAURANT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momoe"
},
"reviewBody": "Well, I don't know what to say, this recipe is simply delicious. I was in a pinch because I was out of ravioli, I made it myself-using 2 cups sifted flour, mixed with 1 egg, pinch of salt and 1 tbsp olive oli--&gt;rolled into dough, with filling inside set on top of one another: fried mackerel(with olive oil, chopped parsley, dill, black pepper and salt), slices of fried aubergine, mozarella cheese and tomatoes. Then I followed this recipe as stated although I made a lot of changes, eg substitute celery with spring onions and celery seeds, I didn't have thyme so I omitted, I actually boiled my raviolis for 3 minutes in the strained shrimp stock, before making the sauce..added more dill to the sauce(love how the dills gave this dish a flavorful smell), substitute canned tomatoes with cherry tomatoes, white wine with white grape juice and 2 tbsp cider vinegar. My sauce turned out thin but really it was perfect when teamed up with the ravioli. I didn't have heavy cream so I omitted and use whipped cream in a can and spray on top of my dish. This was the first time I learn what is ravioli and how to make them I was surprised myself it turns out soo juicy and tasty. I am impossible you can try it your way but overall this recipe is so hearty and delicious I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveIsTheAnswer"
},
"reviewBody": "Sauce is to die for!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/213134/lobster-ravioli-in-tomato-cream-sauce-with-shrimp/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/213134/lobster-ravioli-in-tomato-cream-sauce-with-shrimp/",
"name": "Lobster Ravioli in Tomato Cream Sauce with Shrimp"
}
}
]
}
}
, "about": [
]
}
]