				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lori&#39;s Famous Crab Cakes"
,"datePublished": "2019-07-10T02:53:40.000-04:00"
,"dateModified": "2023-02-02T15:13:53.000-05:00"
,"author": [
{"@type": "Person"
,"name": "SLJ6"
,"url": "https://www.allrecipes.com/cook/610783"
}
]
,"description": "Peppers, green onions, parsley, and plenty of seasonings make these crab cakes a memorable mealtime hit!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GpZscXxTzsL89Fdnl3qWiB9N3Xg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1001937-loris-famous-crab-cakes-Cattastroficka-4x3-1-1802bbb14b7d42ad901ecc147303605d.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lori&#39;s Famous Crab Cakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "308"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "225 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "77 mg"
,"fiberContent": "2 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "508 mg"
,"sugarContent": "2 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.33333334326744 cup dry bread crumbs",
"0.25 green bell pepper, seeded and diced",
"0.25 red bell pepper, seeded and diced",
"2 green onions, thinly sliced",
"4 sprigs fresh parsley, chopped",
"0.5 teaspoon hot pepper sauce",
"1 egg white",
"2 tablespoons mayonnaise",
"1 tablespoon fresh lemon juice",
"0.5 teaspoon Worcestershire sauce",
"2 teaspoons Dijon mustard",
"0.25 teaspoon Old Bay TM seasoning",
"0.25 teaspoon dry mustard",
"0.25 teaspoon onion powder",
"3 (6 ounce) cans crabmeat, drained and flaked",
"0.5 cup dry bread crumbs",
"1 cup canola oil for frying" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a bowl, toss together dry bread crumbs, green bell pepper, red bell pepper, green onions, and parsley. Mix in egg white, mayonnaise, lemon juice, Worcestershire sauce, and Dijon mustard. Season with Old Bay seasoning, dry mustard, and onion powder. Fold crabmeat into mixture. Form into 6 large cakes. Coat in remaining bread crumbs."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large, heavy skillet. Fry cakes 5 minutes on each side, or until evenly brown. Drain on paper towels."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "not enough Old bay...1 teaspoon NO PEPPERS none No onions too much mustard .... 1/2 teaspoon too little mayo .... 1/2 cup 1/2 cup mayo now you will have a great crab cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "I really liked these except that I found the seasoning was too timid, and I would also skip the extra bread crumbs on the outside. I don't know if maybe my cooking surface needed more oil, but those crumbs really didn't crisp up and made the texture a little grainy. Otherwise these were great. I had a little trouble getting them to hold together, so I added a bit more egg white and mayo, and let the mixture sit, and then it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Suter"
},
"reviewBody": "I liked this recipe. I too had trouble keeping the cakes together when frying them. (Maybe I didn't drain the crab carefully enough? Maybe I should have patted it dry?) Pretty good flavor, and I liked the taste of the peppers. Thanks, Lori!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smm"
},
"reviewBody": "This is just the best recipe for crab cakes that I have ever found. I too froze the cakes for a few minutes before frying, and they held together well. I added just a touch more of Mayo, hot sauce and lemon juice as a personal preference. My family begs for them now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Wyvill"
},
"reviewBody": "Excellent! I used 2 1/2 lbs of crab meat based on the texture of mixture. I couldn't find how much to use noted in the recipe. Also I did not roll in addtl bread crumbs. Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Di Di"
},
"reviewBody": "One of the best crab cakes I've had. \nEasy to make, moist and delicious.\nReduced the lemon juice to 1 teaspoon and sautéed red bell pepper (didn't use green) before adding to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pat Eacho"
},
"reviewBody": "They were okay , but to me and my family veggies don't go into crab cakes , just egg , cracker crumbs or bread crumbs worchestershire sauce &amp; old bay , I bake mine in muffin tins to me they are better than fried , sorry but I won't make them by this recipe again !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DJ54"
},
"reviewBody": "I have made this recipe as stated on multiple occasions. I always double the recipe. My family always loves it. I do need to mention that I use imitation crab meat. I just chop it up fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie W"
},
"reviewBody": "I made the crab cakes, but left out the peppers. I also used a combo of crushed saltine crackers, fresh bread crumbs (I keep in the freezer), and Panko. They were absolutely delicious. My husband loved them too. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TonyB"
},
"reviewBody": "These are great! Followed the instructions as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "A decent taste, but it didn't bind together well. It fell apart way too easily. Not as good as some other crab cakes I've had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Koch Hanmer"
},
"reviewBody": "Great recipe! I did use an entire egg vs just the yolk. I added the lemon zest as well as juice. I also made the patties and then refridgerated for a couple hours so it didn't fall apart and it worked perfectly. I served with a remoulade of mayo, dijon, lemon juice, worchestire and hot sauce. So delicious. My daughter's favorite appetizer anywhere we go is crab cakes and she said these were among the best she's had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yourhuckleberry"
},
"reviewBody": "Meaty, every flavor is balanced. Reminded me of my 11 years living in the DC area. I didn't change anything in recipe. I did, however, serve it with Arnaud's remoulade sauce - that's from living in East Texas/Western Louisiana for 15 years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy17"
},
"reviewBody": "I did use a whole egg &amp; regular mustard (instead of just the egg white &amp; was out of Dijon) and the family was quite happy with the results ! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "Easy to make. Everyone loved them and said they’re the best crab cakes they’ve ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreen"
},
"reviewBody": "I made the recipe as directed, but used two egg whites and extra mayonnaise to ensure the cakes stayed put while frying. I also substituted 1/2 tsp. onion salt since I didn't have onion powder. I found that 5 minutes on each side was too much, so I turned down the heat to medium on my stove and cooked approximately 3 1/2 to 4 minutes on each side. I followed the advice of another person who tried this recipe and I placed the crab cakes in the freezer for 15 minutes prior to frying them. I made extra cakes, so I am going to try broiling them tomorrow instead of frying them. I think a sauce would be a nice complement. Will explore those options tomorrow as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Great, much better than store bought where all you get is breading. My husband is not a fan of crab cakes. He ate 3. He thought they were wonderful. Will definitely make these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DSA1"
},
"reviewBody": "These were terrific! We had left over King crab from New Years Eve, so the flavor of the crab really came through. I didn't have bell pepper so I used a little more green onion. I didn't have Old Bay, so I used a copy cat recipe from the web. I thought these were terrific! Lot's of flavor, I did have to use more binder (Panko) as Lori mentioned in her follow up, which I think was due to moisture from the crab. But they had more flavor than what I usually find at a good restaurant! I made some Sirachi aioli to go with, but they were so flavorful it wasn't needed. Thanks for such a good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "12katie"
},
"reviewBody": "I made it just as written, except I only had two cans of crab so cut everything by a third. They were great! I used a sriracha crab cake sauce recipe with them. They were crunchy on the outside, tasty on the inside. I felt slightly like something was missing so may add a little salt next time?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snclr"
},
"reviewBody": "I made them exactly as explained and it came out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Skubon"
},
"reviewBody": "Easy and fun to make. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ron schaefer"
},
"reviewBody": "sauteed peppers otherwise followed directions, my wife who is a picky eater loved them will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terri"
},
"reviewBody": "My husband loved these. I cut back on some of the oil but other than that I followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Vick"
},
"reviewBody": "Fantastic! We made them into crab cake bites for appetizers at Christmas! Very yummy with a simply aioli on the side!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FC"
},
"reviewBody": "I love these!! I typically don’t care for crab cakes but these are so flavorful!!! It’s my go-to recipe for crab cakes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Al Burn"
},
"reviewBody": "I made it just as it was posted and I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen wilkerson"
},
"reviewBody": "These turned out so good. Everyone loved them and I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mike F Powell"
},
"reviewBody": "Really good and easy to make. I baked in the oven instead of frying. 350 for approx 12 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SDW"
},
"reviewBody": "Absolutely delicious. Made mostly as is... Just a few minor adjustments - I used whole beaten egg and made smaller crab cake balls - they seemed to hold together a lot better than the bigger ones. Used Gluten Free bread crumbs, and just a red pepper with no chili sauce. I also use the Pontchartrain Gulf caught lump crab meat. Serve it with coleslaw, shoes string fries, and a pink sauce (Mayo, Ketchup, Worcestershire Sauce, Lemon Juice, Tabasco) Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grealtor"
},
"reviewBody": "Delicious recipe and always gets great reviews"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tmiller"
},
"reviewBody": "We use jumbo lump crab and broil instead of fry them and top with mango salsa! I love these!!!!! My husband is so picky about his crab cakes and most restaurants do not compare to his love for these. Since we do the jumbo lump and do not fry them, they can break easily, but we just gently slide off the baking sheet on to the plate. Best crab cakes ever! Thank you for sharing!!! Dice everything really small to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathryn Terhune Cotton"
},
"reviewBody": "I confess I had to make a few changes here. I used fresh King crab meat instead of can. It looked like I didn't have enough crab meat, so I added some shrimp meat to the mix. I did have ground bay leaf, so I used 1/4 tsp. of thyme. I also didn't have fresh parsley, so I had to guess what four 'sprigs' of parsley might look like (thankfully I've often used fresh parsley before!) with dried. Finally, I didn't have any green onion so I used regular red onion and I only used red pepper. Lots of substitutes perhaps but they came out fine. I think in next time, I'll try having all ingredients on hand - and I will definitely try freezing the patties before frying! Maybe chilling the mix before forming them also. My one complaint on this recipe (maybe all crab cakes) is how sticky it was when I was making the patties; I felt like I was waiting too much of the mix because of the amount stuck on my hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Selena Patterson"
},
"reviewBody": "I make these all the time. I lightly dust bread crumbs on the patties and put the in the fridge for about and hour. This helps them set and keeps them from falling apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "djpcan1964"
},
"reviewBody": "I had a 16 oz can of crab so I worried about measurements, but I don't think it would have mattered. instead of bread crumbs in the mix I used almond meal, vegannaise instead of mayonnaise, and the bread crumbs to coat the patties I used a mix of gluten free panko and chickpea flour. I misted the top of the patties with olive oil and baked at 400 for 15 minutes, turned them over misted again and baked for another 8 minutes. nothing was going to hold these together, I needed 2 spatulas to flip them, but the flavor was good, very tasty. I think adding the egg yoke might have helped. I will keep looking for a crab cake recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "caseyb"
},
"reviewBody": "Made just as directed with 3 changes to the technique...sauteed the vegetables in a bit of butter before adding them to the mixture, put the mixture in the fridge for an hour and then baked, instead of fried, at 375 for 15 minutes. They still weren't piping hot, so I may do them a little longer next time. Really great flavors, very vibrant and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dynzle Kellebrew"
},
"reviewBody": "Loved these crab cake very tasty, just the way I like them. I did cut back on vegetables a bit, and made a hollandaise sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "Gluten free baked version! Don't be mad because of my changes, it was necessary for me! Substituted gluten free bread crumbs, used 1 lb. fresh crab meat and baked instead of fried. Chill 2-4 hours after making patties. Preheat oven and foil lined try to 400. Coat baking sheet with canola oil (about 1 T.). Bake 15min and the turn over and baked additional 5 min. Remove to paper towel lined plate to absorb extra oil and serve with your favorite remoulade sauce. I've never had crab cakes because finding them gluten free is next to impossible. I'm so glad to have tried this recipe...it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Topaz Caroline"
},
"reviewBody": "This is by far the best cheese cake recipe. I have made this exactly as the recipe is written and it has come out perfect. I have also used this recipe as a base for other flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gene Snyder"
},
"reviewBody": "In 1972 after returning from Vietnam I was stationed in Biloxi MS at the local police station with town patrol. The cook at the PD made what has been the best crab cakes I have ever eaten... Till now. These crab cakes are at least as good and that says a lot. I added a little more mayo and a lot more (1tbsp) of Old Bay but this is a great recipe. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hot Dish"
},
"reviewBody": "This was my first time making crab cakes. I picked this one because for me it seemed like the ingredients were all there, and my name is also Lori :) Personal taste/instinct told me to add carrot and extra bay seasoning. A quality canned crab meat is definitely the way to go. They are delicate to handle, all part of the challenge! I pattied and bread crumbed then put in the freezer for 20. Re-bread crumbed then fried. I was also careful to slice the veggies very thin to prevent falling apart. Next time I'll try the food processor to save some time. A keeper. Thanks Lori!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judydominic"
},
"reviewBody": "love it...this is the only recipe that I have been using!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cattastroficka "
},
"reviewBody": "Excellent crab cakes. I chopped the veggies fine and sauted in butter, otherwise I made exactly as written. I knew these would be good just by looking at the ingredients. Next time I'm adding some cayenne pepper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Geer Michael"
},
"reviewBody": "I added chopped celery, garlic and parmesan to mixture and put the cakes in the freezer before dipping them in panko flakes. I used extra fresh crab my husband had just gotten out of the ocean that day. Fried them in a little oil in my Grandma's cast iron skillet. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MATENNIS"
},
"reviewBody": "These were great. For anyone that had problems with them falling apart my advice is to use less oil, fry them on medium and do not turn them until they have set. That said, we are from a small town in Michigan and do not have anywhere to purchase \"real crab meat\" I have to confess that I followed the recipe exactly, but substituted \"fake\" crab meat and it was still excellent. if and when the \" Real\" stuff is available, believe me we will try it. But even with the substitution, it was a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danese Lanctot"
},
"reviewBody": "This is my go to recipe for crab cakes ! I always try any crab cakes on any menu when we go out and these are as good as it gets ! I make them with the best crab I can find and they never dissapoint !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mia"
},
"reviewBody": "I used 1/2 Panko Bread Crumbs with 1/2 Progresso Bread Crumbs, and added a 2nd egg white to bind the mixture. The Panko keeps the Crabcakes lighter, as well as less likely to overwhelm the delicacy of the Crab ( I used fresh, from my local FishMonger). I added some seasoned salt, lemon pepper and Cayenne Pepper to the last of the breadcrumb coating mix. Served it with Cheese Toast, grilled, and it was fabulous-- best I've ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony S"
},
"reviewBody": "Great recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jim "
},
"reviewBody": "Used whole egg , crushed ritz crackers for breadcrumbs inside and panko for outside. Fantastic and will make again and again used 16 oz can of claw meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel B"
},
"reviewBody": "Great recipe! I have made this recipe as is and variations of it and the cakes turn out great every time. For a minor kick I add a teaspoon of two of Siracha. Another change in my recent batches is that I halved the frying time, drain, and then pop in the oven, so the feel less oily and have a nice crunch. Plus, if someone is late coming in for dinner it's super easy to heat up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mollie Emmert"
},
"reviewBody": "My boyfriend and I love this recipe!!!!! Only prob is they don't stay together well for me ?? I've made them numerous times though and will cont to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happiness"
},
"reviewBody": "Excellent, freezes well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KONWAL"
},
"reviewBody": "These were wonderful! I used 1 can of crabmeat and one 6 oz bag of crabmeat (the real stuff, not surimi) from Walmart. Used much less oil. Also made in the late afternoon and then put in the fridge till I was ready to cook. Also diced the vegies really small. If the nutritional info is based on one cake per serving, count on doubling the calories and fat. It made 6 average size patties and my husband and I each ate two of them. One would not have been enough for a dinner serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikhail Paulau"
},
"reviewBody": "Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Stepnowski"
},
"reviewBody": "I made mine without papers. It was so yummy! My dad even said better than any crab cake he's had ever. Num!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay Lucarelli"
},
"reviewBody": "Very good. I made some modifications to achieve 10 servings. By using 4 cans of of pink crab in 6 oz. cans (very affordable), I added a 5th can of wield small shrimp to create texture. Also, I baked the 10 crab cakes at 375 for 12 minutes then broiled them until they were my desired golden color. This will be our new to-to crab cake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chihuahualover"
},
"reviewBody": "Delicious! I followed the directions almost exactly, except I used dried parsley and 16oz crab claw meat that I shredded up. I also BAKED them at 375 for about 15 min. The first time I made them, I baked half and pan fried half, and my husband and I agreed the flavor comes out and the texture is much better baked. I spray the tops with fake butter spray about 3 minutes before I take them out and they crisp up nicely. These also make me about a dozen decent sized cakes, and reheat in the oven perfectly! Thanks for a great recipe! Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlh"
},
"reviewBody": "Fantastic! Used a whole egg and baked them with a bit of spray oil and used fresh off the boat Dungeness crab which we can get in San Francisco area. SO much better than restaurant crab cakes with way too much 'filler'. These were great as they were mostly crab and vegetables--maybe the best recipes I've tried from this site and I've tried a lot! The perfect special night dinner--this one for my valentine of 25+ years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SarahD"
},
"reviewBody": "I'm sure this is a fine recipe, but I think I've decided after trying several crab cake recipes that in fact I just don't like crab cakes! I tried this one, and it just didn't do it for me. Thanks for sharing though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "Made these crab cakes today and they were wonderful! I, too, used 16 oz. of fresh crab, the whole egg, and put Panko on the outside of the cakes instead of regular breadcrumbs. Also, I lightly sautéed the vegetables prior to mixing them with the other ingredients. I popped them into the freezer for 15 mins. before frying them in a little canola oil and they held up perfectly. My husband, who is very fussy, loved them and said these were definitely a \"for company\" recipe. I'll be making them as part of our Christmas Eve dinner. Thanks Lori for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha"
},
"reviewBody": "These are some of the best crab cakes I've had. My parents get loads of crab every year and it's good to have a new stand-by receipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna"
},
"reviewBody": "This is the best recipe for crab cakes I have ever made! I saute the veggies and add garlic like some reviewer mentioned earlier. They are the best! Thank you Lori :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Richards"
},
"reviewBody": "Very good. I added garlic in addition to the other spices. I pan fried them but think I'll try baking them at some point. The whole family enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mtnmama"
},
"reviewBody": "Made an aoili to go with it too. Mayo, honey dijon mustard, lemon juice and garlic salt. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeanne"
},
"reviewBody": "This is the best crab cake recipe I've every used. My whole family raved about them. I did have to add extra mayo because the mixture was a little dry and I added extra crab. De-lish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sellison"
},
"reviewBody": "We really wanted salmon cakes tonight so we cooked salmon before incorporating and used that instead of crab. This was great, not as basic as most of the salmon cake recipes, but not so extravagant that it couldn't be done on a weeknight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "These were delicious!!! Very easy recipe and tastes very much like the ones we just had in Maine!! Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Squirt87"
},
"reviewBody": "I've never made crab cakes before, but I tried this recipe for Father's day, and it came out great! They loved them. I didn't even use a sauce. I used a little extra crab meat and made it for 8 servings. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQ Girl"
},
"reviewBody": "These were SO GOOD !! I kind of lost track of how many I ate...ha! Just the right mix of seasonings. Easy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Volcjak"
},
"reviewBody": "I just made these about 15 minutes ago. Love them! Only thing I did different was saute the veggies with a few cloves of garlic! Used a litte bit of Evoo and regular oil. Perfect! Did not fry them so to speak just enough to give them that beautiful color and crispness. Used some Dijon mustard as a side. Thanks Lori!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Doublebb1"
},
"reviewBody": "I followed the recipe to a tee, wife agreed, It was a mushy mess! Teasted like a dinner crab cake. It was a waste of the crabmeat I used on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annalee Sutton"
},
"reviewBody": "Loved it! Pretty easy, incredibly tasty. Always a great party hit, or great at home with a good steak. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Athompson"
},
"reviewBody": "This recipe had the perfect amount of crab. Great recipe. Really good with a side of Japanese steak house shrimp sauce, or a remoulade if you can find it on the shelf at your grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lyndsey Shaffer Olaleye"
},
"reviewBody": "Just awesome! Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "huge hit in our house, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherbear1"
},
"reviewBody": "These were great , but I had to make a few additions. I used a 16oz package of flaked imitation crab. I added a little extra green onion, 1 jalapeno, 3 cloves garlic and 1/8 cup parmesan. Made the garlic aoili sauce to dip them in. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thecritic"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Junio_91"
},
"reviewBody": "They taste alright, but I had a lot of trouble getting the patties to bind together. The directions do not make clear just how fine the vegetables need to be chopped either. Really, they need to be closer to minced. I ended up crushing bread crumbs into a fine powder and adding about twice as much Mayo, Dijon Mustard, Worcestershire and seasoning. Even then, it only yielded about 4 small cakes. I will continue to use the seasonings from this recipe, but I'll be re-tooling how some of the more basic ingredients are implemented."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "R_Hart"
},
"reviewBody": "First time making crab cakes and they were delicious! Really easy to make. I baked them, just because I had my cooktop full, but other then that I followed the recipe exactly. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashbeem"
},
"reviewBody": "A HUGE thanks to Lori, wherever she may be, for sharing this fantastic recipe. It has all of the flavors I look for in a delicious crab cake. I appreciate the fact that it doesn't call for too much mayo, because that can really ruin a crab cake for me. I like to cook the bell peppers and garlic beforehand just to bring out a little more of the flavors, and we usually bake our crab cakes to avoid the extra fat from the oil. Turns out perfectly every time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spapsdorf"
},
"reviewBody": "These were fantastic. Very happy with the recipe. We needed to cook a bit longer though and I think it was because of the thickness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WannaBeChef"
},
"reviewBody": "This recipe wasn't bad. To be honest, next time I'll choose another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anicia"
},
"reviewBody": "I wish I had have added some garlic to the mix after reading the other reviews. Overall, this was a great recipe. At first, my mixture was too loose, so i added more egg. I saw another user suggest to add more mayo. I will do that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aisha"
},
"reviewBody": "Really good recipe, my boyfriend at them all up. I have learned I am just not a fan of crab meat, but I won't mark the recipe down because of that fact."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kgaetz"
},
"reviewBody": "I would pay for these in a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin M."
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "girlrock"
},
"reviewBody": "I made this exactly as stated and they were delicious!! The only thing I would change in the future, as a previous reviewer already stated, is that I would saute the veggies first to get them softer. I wasn't a fan of the \"crunch\" in these crab cakes but it's an easy fix. They are very zesty and tasty. I will make again with the softer veggies and update in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "island_gypsy_81"
},
"reviewBody": "i put a spin on this recipe and omitted (i.e., didn't have so i improvised) the Worcestershire sauce and the Dijon mustard. I used red onion, no onion powder, and dried parsley flakes. i replaced the hot pepper sauce with serrano peppers and placed the mixture in mini phyllo shells. A-MAZING! we couldnt get enough of them and i can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yvette"
},
"reviewBody": "This was a Father's Day hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Jamison"
},
"reviewBody": "Made this last night and it was REALLY good. I added a pressed and then diced garlic clove. Make sure you add just enough bread crumbs to help the binding process. Better to leave it on the loose side because what I think is the key to getting the mixture to hold together is to refrigerate the mixture for an hour before dividing into patties to give it time to set up. Also I used the small panko breadcrumbs which made for a nice light crust. I cooked them in butter and then drained on paper towels. I used a canned lump white crabmeat from Costco and it was delicious. Lastly I made a simple aioli by mixing some mayonnaise with Sriracha sauce and it really was a great fit for these awesome crab cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rayissa"
},
"reviewBody": "These came out really well for me. I used a mix of crab and lobster meat. I also took some of the other reviewers advice and sauteed chopped shallots, celery, and red pepper in a pan first and added that in to the mixture. But the spice mixture was great. These were a great hit - I made mini ones - and will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick Gibietis"
},
"reviewBody": "This recipe is outstanding. I made this for the first time for a party and everyone raved about how great it was. A number of folks asked for the recipe and will happily pass it on. I did add some garlic to the recipe and did saute the peppers, green onion and garlic before adding to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUEDONOFRIO"
},
"reviewBody": "I made these tonight and they are by far the best crab cakes ever! Absolutely delicious! Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Cunningham"
},
"reviewBody": "These were very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Stephens"
},
"reviewBody": "These were amazing. We made a sauce to compliment the crab cakes. It was made by mixing 2 tablespoons of mayonaise, the juice of half a lemon and a few shakes of hot sauce. It was all very tastey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kreader4420"
},
"reviewBody": "Tried this recipe verbatim and it turned out wonderful. Very good flavor but maybe a little too rich if you plan on eating a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lissa Wicked"
},
"reviewBody": "Wow! I should have made more! I used red, orange and yellow sweet peppers (I don't like green) and also used panko-style bread crumbs. My only prob was that they fell apart when I went to flip them in the pan. I had even made smaller sized cakes. I think maybe my oil could've been a little hotter. I served these with lightly dressed mixed greens, garlic aioli and roasted red pepper coulis. These were a huge hit as an app at my Mardis Gras dinner party, but I will be making them more often than just special occasions! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "astutefl"
},
"reviewBody": "These were delicious. This was my 3rd time making them. The first time, I used real crab meat from a seafood market and it came out perfect. The 2nd time, used same seafood market, but there was pieces of crab shell in the crab meat. The 3rd time, I tried to used canned crab meat, but it didn't work out very well, it fell apart in the oil because the crab meat was too fine. Be careful if you use canned crab meat, maybe add more bread crumbs to see if it will stick together better. I love the recipe and will keep working with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B"
},
"reviewBody": "Really good, I bake these on parchment paper and drizzle a very small amount of melted butter on each crab cake while baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "delicious_ninja"
},
"reviewBody": "I made these for guests this weekend, although I mad smaller ones so we could have them as an appetizer. The flavor and texture of the cakes was very nice. I did however choose to bread them differently (due to lack of freezer space to allow them to \"set up\" as other reviews suggested, I figured a little thicker breading would keep them together, I was right!). I made small cakes, lightly coated them in flour, dipped them into beaten egg and then coasted with dry (Italian seasoned) bread crumbs, them I fried in oil. Served them up with a little bit of tartar sauce (forgot the mango salsa at the store!!!). Great reviews from my guests, even a request for the recipe! I will definitely make them again :-)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/51850/loris-famous-crab-cakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1238/appetizers-and-snacks/seafood/crab/",
"name": "Crab"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1240/appetizers-and-snacks/seafood/crab/crab-cakes/",
"name": "Crab Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/51850/loris-famous-crab-cakes/",
"name": "Lori&#39;s Famous Crab Cakes"
}
}
]
}
}
, "about": [
]
}
]