				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Low Sugar / No Sugar Strawberry Jam"
,"datePublished": "2011-05-06T19:32:37.000-04:00"
,"dateModified": "2022-02-11T13:23:34.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Ball"
,"url": "https://www.allrecipes.com/cook/ball"
}
]
,"description": "This jam has all the fresh-fruit flavor of fresh strawberry jam but with less sugar."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YCIwel94WDwXW6mXkBYvCBiMaLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/976448-f2f3146968904c43a627f4a4a6bce0de.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Low Sugar / No Sugar Strawberry Jam"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "21"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "16 kcal"
,"carbohydrateContent": "4 g"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"sodiumContent": "0 mg"
,"sugarContent": "4 g"
,"servingSize": "2 (8 oz.) jars"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1.3333333730698 cups crushed strawberries (wash, hull, then crush one layer at a time using potato masher)",
"0.33333334326744 cup unsweetened fruit juice, thawed fruit juice concentrate, or water",
"1.5 tablespoons Ball® RealFruit™ Low or No-Sugar Needed Pectin",
"0.5 cup granulated sugar, sugar substitute, or honey (or less, depending on taste)",
"2 Ball® or Kerr® Half-pint (8 oz) Jars with lids and bands" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare waterbath canner, jars and lids according to manufacturers instructions, if preserving. Prepare and measure ingredients for recipe."
} ,{
"@type": "HowToStep"
,"text": "Combine prepared fruit with fruit juice in a large saucepan. Gradually stir in Ball® RealFruit™ Low or No-Sugar Needed Pectin"
} ,{
"@type": "HowToStep"
,"text": "Add sugar, sugar substitute or honey, if using. Return mixture to a full rolling boil. Boil hard 1 minute, stirring constantly. Remove from heat. Skim foam if necessary."
} ,{
"@type": "HowToStep"
,"text": "Ladle hot jam into hot jars, one at a time, leaving 1/4 inch headspace. Wipe rims. Center lids on jars. Apply bands and adjust to fingertip tight."
} ,{
"@type": "HowToStep"
,"text": "Place filled jars in canner ensuring jars are covered by 1 to 2 inches of water. Place lid on canner. Bring water to gentle, steady boil."
} ,{
"@type": "HowToStep"
,"text": "Process jars for 10 minutes, adjusting for altitude*. Turn off heat, remove lid and let jars stand for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove jars and cool. Check lids for seal after 24 hours. Lid should not flex up and down when center is pressed. Clean and store according to manufacturers instructions."
} ]
,"recipeYield": ["32"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy N"
},
"reviewBody": "I tripled the recipe then realized I had more strawberries, so some last minute recalculations, but proportions remained the same. I did add tablespoon of butter to help cut down the foam. I used an emulsion blender as hubby likes less \"chunks\". Turned out amazing! I did the spoon test to be sure it was good to go. Waiting on second batch to start pinging already. Be sure to get to rolling boil on step 2 which it doesn't specify."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia-NOLA"
},
"reviewBody": "This was very good. I tripled the recipe and made a few minor additions to it. I added about 2 Tbl lemon juice and chopped about 15 mint leaves and added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharilyn Murgia"
},
"reviewBody": "Added lemon zest \nAnd a juice of a whole lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbsee"
},
"reviewBody": "I followed the recipe and used the water and sweetener recommendations. It tasted great and I will probably try it on other berries as they come into season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "The taste is fantastic, I used sugar and apple juice. I am going to decrease the apple juice as it was more like an ice cream topping than a jam. It makes the toast soggy when I use it, and I use butter. I doubled the recipe and got 5 8 oz jars of strawberry. I am going to tweek this as I really like the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Prairie Epicurian"
},
"reviewBody": "Meh. Just okay. I used Stevia as a sweetener and it turned out okay. It's a good starting point. I think the flavour of my jam is not \"right\" because of the stevia. Next time I'll try half stevia half sugar, or honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Louise Fell"
},
"reviewBody": "A couple of tips. This recipe is for a very small amount. I tripled the ingredients and ended up with 5 - 8 oz jars of jam. I boiled the recipe for 10 minutes, and I skimmed off all the foam after removing from stove, otherwise the fruit will fall to the bottom. And last , I returned the full jars with lids back into a bath of water, covering the jars for 10 minutes. This will seal the jam and you will hear the lids pop as they concave. Otherwise you will need to use paraffin wax. This way your jam stores for a year without spoiling. I hope this helps some of you, because I have made many mistakes in the past, like having to recook the jam, the fruit falling to the bottom of the jar and so, it's with tips like this you will save extra work . Once I had had some friends try it, I will let you know how they liked it. Oh and I used Cranberry concentrate for the liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julieg"
},
"reviewBody": "My family loved this jam! I added 1/3 cup of minced fresh basil from my garden for something a little less sweet and it came out perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ERiNR99"
},
"reviewBody": "I listened to the only 2 star review and made sure to add 'and bring to a boil' to step 2. This was wonderful! I also listened to 'alexabean' and tried my favorite fruits. I did cherry and then blueberry. 30 cherries made 2 perfect half pint servings. I think 2 cups blueberries (pre smash) would do the same. I did about 2 1/3 to start and had a little extra. I used honey and apple cider. It wanted to separate into the jam and the pulp. I fixed this by turning them over and shaking them about every hour. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "FLLman"
},
"reviewBody": "I followed it exactly, and only after my jam was runny and didn't set did I realize the recipe does not include an important step.T You add \"and heat to a boil.\" to step #2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Souvannasing"
},
"reviewBody": "I am making this recipe for the second time, as my family and I, as well as my co-workers, absolutely love it as is. This will be added to my recipe collection as a keeper. It is so simple and easy to make. You could never tell that it is a low sugar recipe. I'll continue to make this recipe for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I tried this recipe for the first time today and it turned out perfectly! The level of sweetness was just right, and since low-sugar pectin is used the huge amount of sugar one normally uses in making jam isn't needed for preservation. (I used water instead of fruit juice and the 1/2 cup sugar). \n\nAs one other reviewer mentioned, the consistency inside the processed jars seemed to be more like thin syrup at first, but about three to four hours after pulling them out of the water bath they had thickened up to a perfect consistency. I highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kwatkins"
},
"reviewBody": "First jam I made and it was simple and SO good. Plenty sweet so can't imagine how sweet the regular jams are. Can't wait to make more!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alexabean"
},
"reviewBody": "Perfect amount of sweetness. Have also used this for peaches, cherries, and blueberries, and I always add cinnamon and/or nutmeg, ginger. Can add in some finally chopped mint too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent & Anna"
},
"reviewBody": "I used this recipe for making 12 8oz jars of Strawberry jam and it turned out perfect! It was my first time making jam ever and I also never did canning before. I used honey and apple juice as well. I multiplied this recipe x8 and it called for 3 cups of sugar or sugar substitute. With a regular jam recipe it calls for 7 or 8 cups of sugar. So not sure if I could call this recipe low sugar but at least you can use honey instead of granulated sugar so it's still so much better. Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I subtracted one teaspoon of water and added a teaspoon of pure vanilla extract. I made no other changes or substitutions. This turned out absolutely perfect. I've been wanting to try low sugar jam for a while now (because my family eats an obscene amount of jam) and you know, it was just as good. My oldest child said that he preferred it \"less sweet\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heth"
},
"reviewBody": "yum! thought it was going to be syrup but it thickened right up a few hours after the canning process was done"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandi"
},
"reviewBody": "I used honey and apple juice. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Toner Kintzle"
},
"reviewBody": "so easy and great strawberry taste. I have never made jam before as I thought you needed way more berries. Not so! I will definately make this again An added note I did add the lemon juice, 2not 3 teasp per 2 half pint batch."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/217924/low-sugar-no-sugar-strawberry-jam/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
"name": "Everyday Cooking"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/217924/low-sugar-no-sugar-strawberry-jam/",
"name": "Low Sugar / No Sugar Strawberry Jam"
}
}
]
}
}
, "about": [
]
}
]