				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Lumpia (Shanghai Version)"
,"datePublished": "2018-06-08T09:18:58.000-04:00"
,"dateModified": "2022-12-07T06:59:32.000-05:00"
,"author": [
{"@type": "Person"
,"name": "MINKCHAN"
,"url": "https://www.allrecipes.com/cook/442140"
}
]
,"description": "Lumpia Shanghai are Filipino spring rolls that have a meatier filling compared to other lumpia. Serve these crispy savory treats with a dipping sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IhtHWZCYE1HdUkq1yiR5PHvT-uU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/732449-lumpia-shanghai-version-Kim-Watson-4x3-1-2d53e45f71fa49e6999ddbd9a238be36.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Lumpia (Shanghai Version)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "129"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "262 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "38 mg"
,"fiberContent": "1 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "1037 mg"
,"sugarContent": "1 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"1 pound ground pork",
"1 pound ground beef",
"1 medium onion, finely chopped",
"1 carrot, grated",
"0.25 cup soy sauce",
"2 tablespoons salt",
"1.5 tablespoons garlic powder",
"2.5 teaspoons black pepper",
"1 (16 ounce) package spring roll wrappers",
"0.25 cup water, or as needed",
"1.5 quarts oil for frying" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine ground pork, ground beef, onion, and carrot in a large bowl; mix well with hands. Gradually blend in soy sauce, salt, garlic powder, and pepper until incorporated."
} ,{
"@type": "HowToStep"
,"text": "Working one at a time, lay a wrapper on a flat surface with a corner pointing at you. Place about 2 tablespoons filling in a line, no thicker than your thumb, across the center of the wrapper. Moisten the edges of wrapper with water. Fold the bottom edge of wrapper snugly over filling. Fold in the left and right sides of wrapper towards the center. Roll up tightly to seal in filling."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a deep fryer or heavy skillet to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Working in batches, fry lumpia in hot oil, turning once, until golden brown, 3 to 4 minutes. Drain on a paper towel-lined plate. Cut lumpia in half, or serve as-is with dipping sauce."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan McKinley"
},
"reviewBody": "This recipe is very similar to how my mom makes her Lumpia. I would skip the salt because, as others have mentioned, the soy sauce has enough salt. I also minced garlic instead of using garlic powder. Otherwise I really loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wholistictrainersid"
},
"reviewBody": "Delicious! Similar to my Mom's recipe except she doesn't use carrots, beef or regular onions. She used green onions and ground pork. She kept it simple. I on the other hand, substituted the carrots with \"black fungus\" or \"Taingang daga\" in Tagalog which literal translation is \"rat ears\" haha but it's not--it just looks like it once you chop up the mushroom. But a warning: chop them or grate them into tiny pieces and use sparingly just to bring out the flavor of the ground pork more and to add more texture--I made this with 1lb of ground pork (no 1lb of ground beef) so obviously cut all the quantities of ingredients by half. So for 1 lb of meet, I used 1 tablespoon chopped black fungus and instead of regular onions, I used green onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Andy Castillo"
},
"reviewBody": "2 tablespoon salt, too salty. I should have read reviews first before trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose Rosenberger Boyd"
},
"reviewBody": "This is pretty close to my mom’s recipe, who grew up in the Philippines. I will definitely make it again with a bit less salt. I also added 2-3 green onion and a can of chopped water chestnuts. It’s not lumpia unless you get the right wrappers. The super thin ones. Try ranch 99 if you have one near you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ivy Durias"
},
"reviewBody": "OMG I followed the recipe and ended up with a very salty batch of lumpia shanghai! Needless to say this is very disappointing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "Except for using all ground beef, I made it as instructed. We used Sweet Chili by Mai Ploy to dip them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Dalimonte Camilo"
},
"reviewBody": "I make this all the time without the additional salt - it is not needed at all! I also use lumpia wrappers that I buy at an Asian supermarket. Nom nom nom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curt McLey"
},
"reviewBody": "I discovered lumpia on a Taste Made segment and decided it was something I'd like to try. This recipe is the closest I could find to the recipe from the TV show. It *is* time consuming, but by the time I completed the thirty or so lumpia rolls, I had the hang of it. I went to an Asian store because I really wanted the authentic lumpia wrappers. I didn't realize how amazingly thin these wrappers are. Though they are difficult to work with until one has some experience, the light pastry turns out very well once deep fried. Please note: the amount of salt called for is quite high. I will probably reduce the salt volume to 1 tablespoon at the most the next time I make these. One other tip: Once the grease reaches it's target temperature, turn it down slightly because the temperature will keep increasing with each batch that you fry. With too much heat, you run the risk of burning the lumpia. One final note: the recipe does not state whether one sautes the mixture before placing it in the lumpia wrappers. I did. I was concerned that raw sausage and ground beef may not fully cook if I didn't saute it before loading the mixture in the lumpia wrappers. I'm anxious to try this recipe again with other ingredients. I have another thirty wrappers in my freezer. I highly recommend this recipe; it's well worth the inconvenience of tracking down the lumpia wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Atkinson"
},
"reviewBody": "The basics on this recipe is great, but to the novice you need to be specific on spring roll wrappers. DO NOT use Vietnamese spring roll wrappers as they will not brown. I guess there are regular spring roll wrappers....we'll see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Carpenter"
},
"reviewBody": "Great recipe, we added more shredded cabbage and carrots to make the rolls heartier. We used Badia All Seasoning which is the same thing as the Adobe Badia All Seasoning. Delicous and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ben debaggis"
},
"reviewBody": "it is really good with sweet and sour sauce ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "Delicious recipe! I made as instructed using a food processor to ensure the carrots and onions were finely minced. It was a huge hit with my family. I’ll definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marknmich"
},
"reviewBody": "Very good, however the soy sauce flavor was a tad overwhelming. The next time I made it I used 1/8 instead of a 1/4 C and added an additional carrot as only one seemed lost after cooking. My grocery store did not have spring roll wrappers, so I used egg roll wrappers. Not traditional, but came out nicely cooked after three minutes in a 375 degree deep fryer. Served with Thai sweet chili sauce. I made this for a housewarming party and they were a big hit! My family also loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AB"
},
"reviewBody": "These were very good ..made as directed. A little labor intensive but freezes well so make a large batch and save some for another time. Will definitely make again since husband and friends enjoyed them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Mariscal"
},
"reviewBody": "This is an easy recipe reminder of how to make lumpia. I made it over 30 years ago when I was 12 with a friend of my mom's. I remember using ground beef and we didn't add any salt. A friend said, \"You don't have to cook the meat because the frying cooks it.\" However, I remember my mom's friend cooked the meat before we fried it. I think the hardest part is rolling them up. Give yourself time to roll them! They are so worth it! Even the ones that open during frying are delicious. None are ever left on the platter when they are served!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "calebs wife"
},
"reviewBody": "This is great, but is SALTY!!!! Made it a couple of times with less salt and they came out perfect. Maybe a typo?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandee"
},
"reviewBody": "I made this for a baby shower. Doubled the pork, omitted the beef and the salt. It easily made 60 lumpia (I also cut the wrappers in half) and I could have made another 60 if I had more wrappers. So either double up on the wrappers or cut the recipe in half. I served it with sweet chili sauce found in any Asian supermarket. They were devoured in no time! Awesome recipe. Can't wait to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Therese Nicole"
},
"reviewBody": "This recipe called for way too much salt. I'm Filipino and my mother loves lots of salt on her food but even she said it was too salty. We added diced shrimp and water chestnuts and omitted the carrots. Carrots can make the lumpia a little mushy due to the extra water. Definitely use real garlic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Yvonne Broughton Moore"
},
"reviewBody": "I lived in the Philipines for a few months and this was my favorite snack food. I tweaked the recipe a little by using part of a package of coleslaw mix and fresh bean sprouts for some added crispness and did not add the salt. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan "
},
"reviewBody": "I love this recipe. I didn't add the extra salt and it was perfect! It is time consuming but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCCOMBSS"
},
"reviewBody": "I cooked the beef/pork and ingredients minus the salt before rolling them. This is how my dad who is Filipino used to do it. Turned out so good and flavorful! This recipe makes 26. I definitely recommend doubling this and freezing the rest. When doubling the meat, I only doubled the soy sauce but kept garlic powder and pepper the same amount. Also, make sure to drain the meat before adding the other ingredients.\nTo bake: 450 degrees for 10 minutes, flip the lumpia and bake 8-10 more minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jimmy Steele"
},
"reviewBody": "I used low sodium soy, and all of the salt: too much salt!!! Complete batch wasted. Live and learn, I guess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber H."
},
"reviewBody": "Very very good! Reminds me of my childhood. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mskitschy"
},
"reviewBody": "It's a good base recipe but I agree with kiko150, insanely salty. :/ I realized as I was pouring in the soy sauce that, in addition to the table salt it already asked for, something just wasn't right... and sure enough on my first test try egg roll it was super salty. Good thing I had only put maybe half the soy sauce and salt at this point, and managed to salvage it by adding another cup of carrots, but it's still a bit salty for my tastes. In my opinion if you can't eat them by themselves it's no good; I couldn't eat them without rice and drenched in sweet chili sauce. I suggest omitting the table salt completely and just do soy sauce? Whatever less than a 1/4th but more than 1/8th a cup is lol. But as I said it's a good base recipe :) I only had two pounds of pork but it still came out delicious, will definitely try half and half next time. Oh I also added finely minced green onions, maybe three or four sprigs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Akimoto"
},
"reviewBody": "Need to let the marinate the meat for 1 day to get the flavour on the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adaheide"
},
"reviewBody": "This is a good recipe. But I cook mine in the oven due to diet restrictions and they are perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yummers"
},
"reviewBody": "Recipe is great. TIP: before rolling the lumpia fry up a quarter size of your meat mixture to taste seasoning level. Adjust if needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicurnc"
},
"reviewBody": "I have made these many times but I knew the salt ingredient was an error. I also love making them using shrimp instead of meat and dipping them in Asian sweet chili sauce. The problem is you want to fry them and eat them right away. Can't make them fast enough for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jena Schallhorn"
},
"reviewBody": "Very Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ina Roi"
},
"reviewBody": "I made this last friday,and turns good.but i only used 1 teaspoon of salt and i put celery as optional.Now my boss asking me for more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "made these today they were a hit, I couldn't find spring roll wrappers so I also had to use egg roll wrappers, made 32 and had lots of filling left over, went to rest for a few came back upstairs and all but two were gone. so I guess they were a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie C. Harding"
},
"reviewBody": "This is my favourite type of lumpia and I'm glad that I can make it now for my own family. Knowing that there is soy sauce in the meat mixture, I omitted the salt. I only used about a TB of soy sauce, which was a teeny bit bland, so next time I will use TB. I also used green onion, sliced very thin. As for wrapping the lumpia, I actually used another technique from another recipe on here, where you spread a thin line across a WHOLE wrapper sheet, roll it up, seal the edge, then cut it into thirds (or halves if you prefer larger lumpia). I find that this enable the meat to cook all the way through as the ends are open, and not sealed :) It also makes for cute finger food for parties :) Overall, great recipe! Next time, I'll play with the recipe and try it with shrimp :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Souza'sGirl"
},
"reviewBody": "This reminded me of my aunts lumpias growing up! I did add chopped water chestnuts, green onions, lots of garlic, rice wine vinegar &amp; omitted the white onions. Really great and everybody loved them... All 50 we gone in the matter of minutes. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happysoupandrice"
},
"reviewBody": "Delicious! I substituted Johnsonville Italian Sausage for the ground beef and it added a nice flavor. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "otis"
},
"reviewBody": "These were good but the flavors were a little mellow the first time around. The next time, I let the filling rest in the fridge for 24 hours. This allowed the flavors in the meat to develop more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alexiscool1021"
},
"reviewBody": "I think one ingredient that is definitley missing is FISH SAUCE! Replace the salt with 1 tablespoon of fish sauce. Also, test your filling by cooking a little in a pan to adjust the seasoning before you roll! I always use a combo of proteins, I've done shrimp and chicken, chicken and beef, pork and shrimp, pork and chicken etc. I like to get one lean and one fatty meat to balance out flavors and textures. Another secret for THE BEST TASTING FILLING IS to add a dash of sweet chilli sauce. The sugar and peppers in it balance everything out! Also be a bit sparing with the soy! 1/4 cup is waaay too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LadyCastle"
},
"reviewBody": "This is a great recipe. I would omit the salt, though. You can also add chopped parsley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvu61"
},
"reviewBody": "these were good make sure to use good quality meats. you may want to use salt free soy sauce or they may be a little salty for those who dont care for salty flavors. be sure not to put too much meat in or it will not cook all the way and the outside will burn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "browneyedgirl3571"
},
"reviewBody": "These are awesome. I followed the recipe exactly. Took them to a work carry in and everyone wanted to know the recipe. Gone in minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Watson"
},
"reviewBody": "all I have to say is YUMM. I added some fresh parsley as a Filipino friend does. I think next time I may add a bit of chopped cabbage too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babseezcookin"
},
"reviewBody": "Easy recipe, but time consuming - and well worth it. This was my first attempt at lumpia..the kids were eating them as fast as I could cook them! I added some chopped green onion to the filling and used fresh garlic instead of powder (3 cloves) and used only ground pork (my preference). Didn't use much salt..as the soy sauce has plenty for my liking. Paired with sweet thai chili sauce - quite addicting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ricci Cottrell Kennar"
},
"reviewBody": "This recipe was GREAT! BUTTT I did add the 2T. of salt and they were sooo salty no one in my house ate them! I had to add more meat to my leftover meat to be able to cook the rest. BUt I look forward to making them again with less salt :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel RedVelvet"
},
"reviewBody": "I had a very good friend from Thailand who made these for me once. I begged her to make me some more and she made me about 50 of them, that I kept in my freezer and pulled out whenever... she has since moved away and I lost touch with her, but I stumbled upon this recipe (yay!)... \nI used a Lb of ground beef, and a Lb of ground pork. I followed the recipe exact, but I added 2 tsps. of sesame seed oil, for that nutty flavor, and also added some bean sprouts to the meat mixture as well (because I remember the ones my friend made had bean sprouts in them), and it adds a extra 'crunch'. this is a very good recipe. can't wait to make these again but I will make sure to save enough to stash in the freezer for a quick appetizer ;)))"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1tsp"
},
"reviewBody": "I didn't use any pork, only beef. I used a bit more carrot and onion. They turned out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BABYCAKESAZ"
},
"reviewBody": "Good recipe, I used mild pork sausage for the ground pork and ground turkey for the beef and it was amazing. The pork sausage gave it a nice flavor. I also used egg roll wrappers and i cut them in half and filled with one tablespoon filling. It made quite a bit and used up all the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jsun12"
},
"reviewBody": "Very easy to prepare but would definitely cut the salt in half next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CASANTOS"
},
"reviewBody": "Pretty good - but I felt that the soy sauce completely overpowered everything! I'll try either halving or omitting it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bhoneycutt"
},
"reviewBody": "Made this for our Filipino night and they were just how we remembered them. The Filipinos used to make these when we had fair on the Navy base in Sicily when i was going up. Yummy blast from the past thanks! I got the spring roll wrappers from a local international grocery store. I did however use all ground pork and no beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Te"
},
"reviewBody": "This was the recipe that was the closest to what I ate when I grew up in Subic Bay, PI. I love this recipe and Pancit. Our Maid Lute use to serve 2 types. Fried and Raw. Raw was always done with fresh cooked Shrimp or Crabs. Cooked used either beef or pork or both. Depends on availability at the time. Thanks for the recipe and stirring my teen year memories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MyEmmy05"
},
"reviewBody": "I've made this recipe without changing a thing and they were SO GOOD, I can't say the extra salt made a difference either way. I've also made these using 2 lbs of ground turkey instead of the other meats and they turned out great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinay lumpia winner"
},
"reviewBody": "My husband loves lumpia, he is the one who put me in a lumpia contest,and i won!..check out my recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimmyboy2"
},
"reviewBody": "Delicious! Try dipping in banana catsup (from your oriental grocer). Or try with a sweet and sour sauce - not authentic but great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "This recipe is simply delicious. I made 100 for a church picnic and they were all gobbled up. Next time, I will try just pork mixture and add in finely chopped celery for a little variation. It's definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheypal"
},
"reviewBody": "OMG THANK YOU!!! I lost my Ewa Beach Tiny Tots Lumpia receipe (ya I know shoulda been memorized by now), so thank you very much for posting this receipe. ... Now I get to show my hubby what lumpia should taste like ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "Perfect! I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kiko150"
},
"reviewBody": "I was really disappointed with this recipe. I followed everything that was in the ingredients and now my whole batch is ruined because it's too salty. I'm so upset. It took me a long time to finish wrapping all those lumpia only to find out that the food is TOO SALTY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CASSIDY0123"
},
"reviewBody": "VERY easy to make!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Sundaram"
},
"reviewBody": "Great! Very easy to make. I've made them twice. The first time I followed the recipe and loved them. Second time I used ground chicken instead of pork/beef and less salt. Even thought I was using low sodium soy sauce I still thought the original recipe is too salty. I loved it with ground chicken and even added the extra meat filling to Pancit...yum! My local Asian market carries frozen Lumpia wrappers so I used those instead of egg roll wrappers....I am not sure if there is a flavor difference between the two. Another variation...I did brown my ground meat before adding the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cecille"
},
"reviewBody": "it tates good.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Capra"
},
"reviewBody": "Love it, I just added more garlic and onion to mine for more flavor. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEEDS678"
},
"reviewBody": "Yummo! Even better reheated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABYLADY907"
},
"reviewBody": "I have been making lumpia for years now using all pork, all ground beef and even all ground turkey for the filling. The pork filled lumpia came in first for taste with the ground turkey coming in second. Check the lumpia wrappers for mold before you check out in the grocery store. Experience has taught me that the lumpia wrappers either need to be used almost immediately or frozen for future use as soon as you get them home. They mold easily and I have bought my fair share of unchecked moldy wrappers home. It is really important to only put about a pinkie's worth of filling in each wrapper as these cook up pretty quickly and you want to make sure these are done completely. Sometimes I cheat using store bought shredded carrot and cabbage cole slaw mixture and a half a medium onion for the vegetables. Oh and dont forget to pull all of the wrappers apart before you start rolling (a huge time saver). Just remember to cover them back up with a dry dishcloth as to prevent drying out while rolling. I always create an assembly line using about 7 wrappers at a time quickly stuffing, rolling then sealing them. Sweet Chilli Sauce is a must have for dipping. It can usually be found next to the sweet and sour sauce of any grocery store while the wrappers can be found in the frozen section. Both can be found at just about any international grocery store. Cook some lumpia now and freeze the rest for a later date."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ga'chong"
},
"reviewBody": "Wonderful! I love the sweet carrot to balance the saltiness of the soy. But I prefer a shred to a grate to give more texture and color. And getting the lumpia into uniform shape takes a bit of practice! But SO worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Lee"
},
"reviewBody": "The flavor is outstanding and very authentic! The only criticism I have is that if you are indeed going to use spring roll wrappers, you need to brush them with olive oil and bake instead. If you fry them, they are likely to not meet your expectations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gary Cole"
},
"reviewBody": "This was the closest to my mother's and aunt's lumpia I have tasted. I would cut back on the salt quite a bit and I tried the spring roll wrappers (rice flour/tapioca wraps) and they did not turn out. I need to find actual lumpia wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dawn"
},
"reviewBody": "These are great with sweet chili sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "renee"
},
"reviewBody": "so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Iliana and Mia's Mom"
},
"reviewBody": "I substituted the ground beef for additional ground pork and omitted the grated carrots. My family throught it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Godiva Goddess"
},
"reviewBody": "Great recipe I think that beef/pork lumpia is one of the best versions. I usually steam some white rice and add it in as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smithy"
},
"reviewBody": "Very good recipe. Omit the salt though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Very good recipe but I didn't have spring roll wrappers so had to use wonton wrappers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaMiaItalia"
},
"reviewBody": "AMAZING!!! way better than our favorite place here!!! I used only pork and lumpia wraps (I found them at my regular grocery store non problem). Thanks for the recipe. I have been cooking Italian food for a few people in exchange for some lumpias but never got them back from them :( well, now I do not need them, I can make them myself!!! they are super easy and super yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingfor8"
},
"reviewBody": "great recipe. now i don't have to bug my philipino friends to make them for me. i made them and froze them so they were on hand when i needed them. just go from freezer to hot oil. so good......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BernieG"
},
"reviewBody": "I love lumpiang shanghai, and this is a good recipe. However, I definitely only use ground pork because the beef is too heavy, in my opinion. I also add minced water chestnuts, and that gives a little more texture. I have used green onions in place of regular onions, too, and either way has been good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YummyTummy"
},
"reviewBody": "yessss. finally someone else who makes the lumpia with just the meat =D!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mattfraziner100"
},
"reviewBody": "I am filipino and this recipes reminded me of home. I made a few changes though....I used actual lumpia wrappers intead of spring roll wrappers. They're harder to find, but they change the texture. It's a little crunchier and the paper is a little thinner (which is a bit truer to what it should be). However, if you do this you need to use an egg as a way to close the wrapper. I as well only put one tablespoon of salt. Other than that....it was great...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coconutheather"
},
"reviewBody": "yummy, but a little bland. They were quick and pretty easy to make too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CILLAANN21"
},
"reviewBody": "This recipe is good but called for way too much salt! Next time I'll be sure to use a little less, but otherwise it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RHONDA35"
},
"reviewBody": "These were good! The only thing I changed was.. I added raisins and sprinkled some cayenne pepper to the mixture. This gave it a very unique flavor that everyone loved! Next time I will cook the mixture first.. I like my spring/egg rolls stuffed with mixture.. that's hard to do when the meat is uncooked at the beginning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DD2146"
},
"reviewBody": "This is a very good recipe. My grandmother on my fathers side was of Chinese/Pacific Islander and she always made things like Lumpias (we grew up calling them wontons due to the fact that we used wonton wrappers lol) and kim chee just because of the places she grew up and the influences on her cooking.\n\nThis recipe is less extravagent than hers but its fairly the same idea. I always did enjoy her cooking as a kid and even though wrappers to absorb plenty of grease this is a simple recipe that creates a fantastic finger food.\n\nI like to add green onion, lots of fresh garlic (crushed) as well as the powder, and I use pork/beef combo going heavier on the pork. And of course wonton wrappers :)\n\nGood recipe. Simple and enjoyable if maybe a little unhealthy haha."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenny McGuire"
},
"reviewBody": "My Filipino grandmother made the BEST pork/beef Lumpias. Unfortunately, she passed away several years ago. I nor my mom cant seem to find her recipe. So, I tried out this one. \n\nI found it to be incredably salty! I would cut back the salt to 1 TSP at the most. The sodium from the soy sauce adds to the saltiness anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sola"
},
"reviewBody": "I am going to have to rate this on filling alone because my spring roll wrappers were horrible. Well, first I tried to make them myself, which was sort of a failed experiment. Then I bought the first ones I saw at the store, which had a taste similar to what Elmer's glue must taste like. So instead, I cooked up the beef and the onion and combined it with the rest of the ingredients. I added 1 tablespoon of roasted red chili paste and layered it between two layers of sliced potatoes in a large round casserole dish. I baked it in the oven for 45 minutes at 400 degrees, covered. It turned out great. The reason I am knocking off a star though is that there is no need for additional salt when you already have soy sauce. I used lite soy sauce alone and it was plenty salty. If I ever get the hang of making spring roll wrappers, I will try this as listed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REBECCAINCHICAGO"
},
"reviewBody": "Made some alterations, but just like my Filippino friend makes! Very tasty! They were gone in a blink at my party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bdh76"
},
"reviewBody": "I'm by no means a Filipino cuisine cook, but I had some wonton wrappers to use up. I know this recipe calls for spring roll wrappers but....why not? These were good, though greasy. Maybe the wrappers aren't recommended due to the amount of grease they soak up. Anyway, worth trying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Was not good at all, many people gave high rating, I dont know why. This is not a recipe I would try again. I suggest only pork no beef as it changes the REAL LUMPIA taste and burns the oil. Suggest alittle small sliced cabbage to each lumpia and more black pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SONYABOW"
},
"reviewBody": "This was pretty good. The kids liked it. Will add different veggies next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLABALL"
},
"reviewBody": "Unbelievably tasty!!! I cut back on the salt, but that was the only change I made. Outstanding flavor and very easy to make. I think this has definitely made the dinner rotation in my house!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "azzilann"
},
"reviewBody": "Awesome recipe...I gave it 4 stars because the salt intake is a little high for me - but still delicious.\r\nBe sure to add green onions as well.\r\n\r\nI used a ziploc bag, snipped off the corner and used it to squeeze the mix out - it'll save you A LOT of time and MESS. Also, to make the wrapper stick better, make sure to wet it with water as you are wrapping it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KELLYGOFF"
},
"reviewBody": "We LOVE these. Excellent recipe. If I could give 10 stars, I would. YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "HOODLIE"
},
"reviewBody": "Lacked flavor and the texture was not what I was use to in lumpia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SummerRain"
},
"reviewBody": "It was a bit too 'meaty' for me...I'm more used to springrolls with more veggetables in it and more spice... Next time I'll try substitue half of the meat for bamboo shoots or vermicelli..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Javagoddess"
},
"reviewBody": "Deeeeeeeeeeeeeeelicious!\r\nWe followed the suggestions of using just pork and eliminating the salt. Also, we used about 4 tbsp of filling per wrapper (enormous lumpia!) in order to use all the filling with just one package of wrappers.\r\nVery tasty, and thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Houk"
},
"reviewBody": "Delicious! I would cut back on the salt, though. I used gyoza wrappers and had tons of leftover filling (probably more than half), so I would either buy 2 packages gyoza wrappers, or make half the filling if you wanted to go that route. They were great little bite sized yummies for us to have while opening Christmas presents!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JASOL"
},
"reviewBody": "I didn't really follow the measurements of the liquid portion of the ingredients to the exact number (I didn't want to taste the uncooked meat) so I had my dad put in whatever he thought was necessary. Anyhow, it was a big hit in the house. I prefer cutting the lumpia wrappers in 4's to make bite size lumpias so you can just pop em in your mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Stotts"
},
"reviewBody": "Aside from substituting onion salt (and reducing the salt content) for the regular salt, and adding 1/4 cup sliced green onions, I made NO changes to this recipe. These are excellent!!! I will DEFINITELY make these again (probably weekly)!!! I also used egg roll wrappers instead of spring roll wrappers (didn't have them on hand at the time). I have also found that I can brush them with peanut oil and bake them in a 425 degree oven for 25 min to reduce the fat content, turning the lumpia after 10 minutes. The peanut oil also adds a nice flavor when deep fried. Thanks for the great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BugNBear"
},
"reviewBody": "This was a great recipe, although I recommend not adding any salt because the soy sauce makes up for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAN4WES"
},
"reviewBody": "Mmmm! Only thing I'd do is reduce the salt, we had to add 1/2 lb of meat to make it taste less salty. Hubby loves this recipe and it was so easy and quick to make!! We'll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love this dish! I made my variation w/ ground pork mixed w/ shrimp cut into small pieces, omitted the soy sauce and added finely chopped water chestnuts. If you can't find the sweet chili sauce, you can make a sweet and sour sauce using ketchup, a little vinegar, sugar, cornstarch and water mixed over low heat. It was a hit on my office party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SIERRAMUM"
},
"reviewBody": "Great recipe. Tasted just like the lumpia I ate growing up. Just need to find the perfect dipping sauce for it, then I'm in heaven! LOL!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/40351/lumpia-shanghai-version/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
"name": "Wraps and Rolls"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/40351/lumpia-shanghai-version/",
"name": "Lumpia (Shanghai Version)"
}
}
]
}
}
, "about": [
]
}
]