				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Luscious Lemon Snaps"
,"datePublished": "1999-11-12T13:37:48.000-05:00"
,"dateModified": "2022-07-14T16:39:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Juanita"
,"url": "https://www.allrecipes.com/cook/26842655"
}
]
,"description": "This is THE cookie for the lemon lover. Not overly sweet, but tangy from fresh lemons."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MR1ywygQq7_Rg1eONfYdkEhIEJY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8273454-ed76406ea3a64e93bc7bc75583e691aa.jpg",
"height": 1501,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Luscious Lemon Snaps"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "124"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "159 kcal"
,"carbohydrateContent": "23 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "130 mg"
,"sugarContent": "13 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2.5 cups all-purpose flour",
"1.5 cups white sugar",
"2 teaspoons baking soda",
"0.25 teaspoon salt",
"2 tablespoons lemon zest",
"0.75 cup vegetable oil",
"0.5 cup fresh lemon juice",
"2 teaspoons vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F ( 175 degrees C ). Grease cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, stir together the flour, sugar, baking soda, salt, and lemon zest. Make a well in the center and fill it with the oil, lemon juice, and vanilla. Stir everything together until it forms a dough. Alternate method: Put everything into the food processor and blend until dough forms."
} ,{
"@type": "HowToStep"
,"text": "Drop cookie dough by teaspoonfuls, about 2 inches apart, onto the prepared cookie sheet. Bake for 10 to 12 minutes in the preheated oven. Edges should be golden brown. For a softer cookie, bake for only 7 minutes. Cool on racks, and store in an airtight container."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lh37865"
},
"reviewBody": "I baked these today as per the recipe. They are delicious and so easy. I'll definitely bake these again. I got 65 cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these Lemon Snaps, following the recipe exactly. They are easy and the result is a crisp cookie but they are NOT what I would call a lemon snap. You can not taste the lemon. I will try them once more, adding lemon extract, more lemon zest and cut the sugar to 1 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnydurial"
},
"reviewBody": "I modified the recipe, but it turned out great! Here’s what I did…used yellow limes (yes yellow limes are real). Plus I used half butter flavor Crisco and half butter melted in place of oil and cut back 1/3 of what it called for. I mixed the lime juice, melted crisco, butter and vanilla together then added it to the dry ingredients. \nSprinkle the top of cookies with granulated sugar before you bake them. They took about 13-15 minutes to bake and turned out delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EMartyMartin"
},
"reviewBody": "Add more lemon zest and add some citric acid if you want really sour cookies. Less oil would make dough a little less greasy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicholas Cohen"
},
"reviewBody": "it made my kids happy! as a mother I think more people should be homeless"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Greene"
},
"reviewBody": "Y es, I used applesauce instead of oil. Mine did't look like the picture but the taste was good !! My dough was different I guess. I would make them again---and I used part Splenda also ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura J Paquette"
},
"reviewBody": "It baked for 7 minutes and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kaylyn"
},
"reviewBody": "Not a fan of this recipe. I increased the lemon zest by using 5 lemons. Still not very good, oily &amp; all sugar. I know I won't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "These are great! After reading a few of the reviews, I only used a half of a cup of oil and then added 1/4 a cup of half and half to my dough to bring it together. I also rolled the dough balls in sugar before baking. Took them out after 9 minutes... They were soft and chewy on the inside with the sugar crunch on the outside and deliciously lemon. I recommend these cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ann Reid"
},
"reviewBody": "Made this, hoping for some yummy lemon cookies. These were greasy, flat and did not have much lemon taste. I followed directions exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker with style"
},
"reviewBody": "It was really really good. It had very nice flavors, and I don't usually like lemon. Thanks for posting the"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "Note to self: ALWAYS read the reviews, not just the recipe and the number of stars! Followed the recipe exactly and wound up with oily flat cookies that didn't taste very lemony. The first batch spread almost to cover the cookie sheet. For the second batch, I put fewer cookies on the sheet, so at least they didn't melt into each other. I then rolled the remaining dough into balls, put them on a plate, covered them with plastic wrap, and refrigerated them for about 5 hours. When I took them out, they had melted into each other and were flat, VERY oily discs. I rolled them into balls again, squeezed each one into a paper towel to absorb some of the oil, put very few on the cookie sheet, and baked for 10-12 minutes. Still not crispy, but better than first two batches. I may try some of the fixes listed, like butter instead of oil and WAY more lemon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marg"
},
"reviewBody": "Made it exactly to recipe. Everyone loved them. Will be a favorite !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bothgrays"
},
"reviewBody": "Fantastic recipe! Used mid-size cookie scoop (2 Tbsp) to make large size cookie. Baked 15-17 min. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lrp93"
},
"reviewBody": "Very delicious cookie, but I made a major change - I used one stick of butter instead of the canola oil. I creamed the butter and sugar together, added the vanilla extract and whipped until it was very smooth. I mixed the flour ingredients separately (including the zest) and then I added the lemon juice to the butter mixture until it was incorporated and then quickly added the flour mixture. Very light and fluffy. I baked about 8 minutes, which left them soft and chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "S Wegner"
},
"reviewBody": "I tried this a couple time because I really wanted it to work and had a massive lemon crop, but it never worked for me even with the suggestions from other reviewers. They were nice enough, but I never felt like the lemon really popped and I probably won't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "They are flat as Pancakes and all I can taste is the Oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bee Jay"
},
"reviewBody": "they tasted like flat floury discs! I love lemon, but somehow the ingredients in this recipe made the lemon zest/lemon juice taste metallic without any citrus zing to it...and I used a generous amount of lemon zest too. I think this recipe might do better with butter rather than oil - very disappointing for the given star rating..sorry.. I would not recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "I followed the recipe except for using only 1/2 cup oil and 1 cup sugar. Everything else was the same. People who hate to zest, try a microplane. Zests easily in seconds. My favorite kitchen tool. I had no trouble removing the cookies from the cookie sheet after letting them cool a few minutes. Nice balance of tart and sweet. Made 6 doz using a teaspoon. Very easy preparation. If people are having trouble removing from cookie sheet, get yourselves a good quality sheet and you should have no trouble."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GingerAle7"
},
"reviewBody": "Sorry, but not too good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "akamslee"
},
"reviewBody": "Definitely will play with this recipe...the lemon flavor was not pronounced enough. By reading the reviews I used butter and not oil. I dusted with powdered sugar, good recipe overall"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ocean Girl"
},
"reviewBody": "This was a good recipe . the taste was great , but they were a little dry. - ocean girl"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alk02g"
},
"reviewBody": "I halved the recipe but otherwise followed exactly. they spread out more than I was expecting, though that's likely due to old baking soda, I would bet. they were well-received for Easter and I'd make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "I went by the recipe exactly, but I added a lemon glaze to the cookie. Next time I will take the oil down to 1/2 and add more lemon zest. Very good cookie with crispy edges and soft center. I also cooked then longer than 12 minutes, I just kept watching for the edges to be brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SmallRecipes"
},
"reviewBody": "I'm giving 5 stars for my variation of this recipe. I cut down the sugar to 3/4 Cup, I didn't add salt, and I used a heaping 1/4 Cup of canola oil. I needed extra moisture since I cut down so drastically on the oil, so I added water as needed to make a sticky dough. \n\nAt first these seemed too lemony, but the next day they were absolutely delicious. Try them with a tiny scoop of vanilla ice cream. My husband and I were amazed at how great these were, and we couldn't stop eating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Steinman"
},
"reviewBody": "My family loves these. They were a hit at Christmas. I added a orange citrus glaze icing on the top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rocking F Ranch"
},
"reviewBody": "This recipe didn't work for me. Like others suggested, I reduced the amount of oil but they still turned out greasy and flat. However, I was able to salvage them by making an ice cream sandwich of sorts by using lemon curd and cool whip between two cookies, wrap in plastic wrap and freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATSINTHEKITCHEN"
},
"reviewBody": "Oh my goodness. I just took out the first batch and they are wonderful. I made two changes. First, I used butter (unsalted, as I always do for baking) and second, I used 1 teaspoon of lemon oil and 1 teaspoon of vanilla. Using my 1 1/2\" cookie scoop I got a dozen 3 1/2\" cookies per sheet, baked on parchment. I tested them at 7 and 10 minutes and found them perfectly done at 12 minutes with lightly-browned edges but still chewy in the middle. I cooled them for 5 minutes before transferring to a rack to finish cooling but I couldn't wait and I was rewarded. I should also note that I used Meyer lemons (a friend grows them, lucky me!) and my stand mixer following the common method of creaming the sugar and butter with the zest then adding the juice, extracts and finally, stirring in the combined dry ingredients. I am going to ask for more lemons. These cookies came out fabulously for me and I hope my experience will be of help to others who have yet to try the recipe or who had less-than-spectacular results in the past. I'll let you know how they keep, assuming they do...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sushilover"
},
"reviewBody": "Crrunchy and yummy. I would add more lemon rind next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CaGirl93101"
},
"reviewBody": "I made this recipe just as it was written and they were delicious! They looked exactly like the picture showed. I had none of the problems with the batter, greasiness, or crumbling that other reviewers complained of (wondering what elevation they were, perhaps needed adjustment for that? I'm at sea-level.) \n\nJust a couple things though, I did NOT grease the cookie sheet. \n\nI did process the dry mix for about 5 min using the paddle attachment on my KitchenAid to help infuse the flour and sugar with the zest before adding wet ingredients, as well as after to bring it to dough. \n\nThe consistency of the dough was similar to sugar cookies, and should not be wet or overly sticky. \n\nI dropped by measured teaspoon balls (do not flatten) onto cookie sheet and baked exactly 11 min in a well preheated oven. \n\nThey came out as I said exactly as they appear in the photo - about a 1/4\" or so thick, crispy outside, slightly chewy inside. Cooled about 5 min on sheet, and removed with no problems. \n\nThey are sweet and lemony and absolutely delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "xsomber_resplendencex"
},
"reviewBody": "Flavor was fantastic, but the consistency was not. Thin and crumbly, I could not get a decent batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "First off, I'll say that I'm no novice when it comes to cookies. I'd even say that when it comes to baking, cookies are my forte. I just don't know what went wrong this time around. \n\nI did what other reviewers suggested: I reduced the oil to 1/2 cup and added a little more lemon juice. I also included twice the amount of rind, reduced the sugar a bit, and processed the rind with half the sugar. The batter wasn't runny at all, though it was a bit sticky. I used a small cookie scoop and baked the cookies for nine minutes and got delightfully soft lemon cookies that reminded me a bit of a sugar (or, dare I say it, the texture of a funfetti cookie). The texture was wonderfully. Unfortunately, the flavor of the cookie left much to be desired. It tasted like flavorless biscuit batter. With all the lemon I put in there, I thought my taste buds would be bursting with lemon with lemon sensation. I've used less lemon zest in other recipes (and no lemon juice) and have gotten much stronger lemon flavors. Perhaps it's the use of oil instead of butter that killed the flavor, but I can honestly say that I'll never make these cookies again. It's a shame too, since they had such a wonderful texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kati Remington Blackledge"
},
"reviewBody": "I did not care for these. Sorry. I did the \"put it all in the food processor\" option and they were just plain weird. I usually never fail on cookies, but this was a waste of ingredients. I used 1/2 cup butter and oil, and fresh lemons with excellent rinds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaLizGa"
},
"reviewBody": "I like having two dessert choices when guests are over and this is a great complement to chocolatey dishes. I zested and juiced two lemons - was just short of the 1/2 cup juice so I supplemented with bottled. Only 1/2 cup oil - which is maybe why my dough was a little dry to work with. Rolled, flatted slightly, baked on silicon for about 12-14 minutes and are perfectly tart and chewy! Smelled so good when baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abbagayl"
},
"reviewBody": "These cookies weren't very attractive looking, but they taste absolutely amazing. The perfect amount of lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NYC"
},
"reviewBody": "Not my favorite. I think it needs baking powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FoodByLauren"
},
"reviewBody": "Great recipe! I baked for 7 minutes and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "myannabellee"
},
"reviewBody": "I've been baking for twenty years, so I have had time and experience enough to know a good cookie when I see it. a) These have far too much oil which makes them greasy and puffy. b) They spread too thin after baking due to the excess greasing of the cookie sheet. c) Even on a greased sheet they are very difficult to remove without utterly falling apart. d) The flavour is decent but not mind-blowing. I maintain a baking journal in which I rate each recipe on a 1-5 scale; these got a 1. I don't even know what to do with the rest of the dough; I will have to try and modify it so that I can have something edible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla"
},
"reviewBody": "Mmm Mmm good! Per other reviewers changed oil to 1/2 cup, and only 1 cup of sugar (I don't like it too sweet). Baked 12 minutes. Otherwise as written. Came out very good and great easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DRCOX"
},
"reviewBody": "This one is hard to review. Had I rated them right out of the oven, I would've given it ONE star and called them a waste of good lemons. The next day, however... they improved! Somehow... they were still chewy and not what I expected, but maybe they grew on me overnight. Who knows."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Heather Ludwig"
},
"reviewBody": "I made these exactly by the recipe and the first batch was very, very mushy. I went back and added 1/4 cup flour with the same results. These mushy although the mush tastes good. Would not make to serve to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kari Held"
},
"reviewBody": "While I agree it does have an intense lemon flavor, ultimately with that amount of oil, it gives it a greasy fried aftertaste. Disappointing. Perhaps it could be made with less oil?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Franny"
},
"reviewBody": "Great recipe and easy to make. I took the advice of others and added only 1/2 C. oil and added more juice in a slow stream until the dough came together. I've also tried with oranges/orange juice and lemon extract substituted for the vanilla and all of those combos work nicely too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Kilpatrick"
},
"reviewBody": "Lemony, sweet, and easy! I used 1/2 cup melted butter and 1/4 cup canola oil instead of 3/4 cup oil. Two tablespoons of lemon zest took four or five lemons, zesting every bit of yellow I could find. I used a teaspoon measuring spoon to scoop out the dough and then I rolled the bit of dough into a ball, 25 per sheet. Take them out before they brown unless you want crunchy cookies. Using a cooled cookie sheet will give you lovely cracks in the cookies, like ginger snaps. Made about 80 small cookies, each one terrific! Brought them to the office today, and my coworkers love them, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "Tastewise these were good. My husband and several other extended family members thought they were good. However, the dough is so runny. A teaspoon of dough place on a cookie sheets bakes into a nearly 3 inch diameter cookie! And, its hard as a rock despite the reduced cookie time stated in the directions. I made these over the holiday for my Christmas cookie platter, however, I won't be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "khrys"
},
"reviewBody": "I followed the directions precisely. Some of my cookies were crisper than others, not sure why. I thought the cookies came out very bitter, but perhaps the lemons were off. My husband loved them, but my children and I could not get over the bitter taste. We are a family who loves lemon, so I will try one more time, perhaps in summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookie Monster!"
},
"reviewBody": "Absolutely phenomenal! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M. Dew"
},
"reviewBody": "OMG! These are perfect! I don't usually take the time to comment - but I had to this time. I made these to give as Christmas gifts - and everyone loved them! I also shared recipe with my sister. This is my new favorite cookie! Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "The Heinos"
},
"reviewBody": "I wish I would have read more reviews...too many high star ratings with modifications made me think at a glance that these would turn out as is. Mine spread out way thin and I was disappointed (too much oil, as it turns out, and as many have remarked). They honestly look like a little stack of pancakes, not cookies at all :( I MAY try again with less oil, but will probably experiment with other recipes first...just needs too many modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charly"
},
"reviewBody": "Great lemony flavor! As suggested by other reviewers, i used more lemon juice and less oil. Sprinkled them with yellow sugar. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "yoga4me"
},
"reviewBody": "Not your traditional cookie. Don't be alarmed by the oily dough or the flat thin cookies. These really are snaps. I used zest and fresh juice and the initial taste is good. But they do have an oily aftertaste. I probably won't make them again. If I do, I might try adding a cup of powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bookworm76"
},
"reviewBody": "I read the reviews before starting and decided to start with 1/4 cup of oil and add as necessary. I think this is a decent starting point for a lemon cookie. I kept them in the oven until the edges were a little brown, then took them out. They were still soft in the middle, but cooled to a decent texture. I didn't get the zesty lemon flavor I was hoping for. The next time I use this recipe, I plan to add more lemon juice and try using butter instead of oil. I think with a little doctoring, this could be a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Angileri"
},
"reviewBody": "Delicious! Soft and crunchy, sweet and lemony. I followed Mary Callan's recomendations and increased the flour and lemon juice while decreasing the oil. I mixed the final batter together by hand and topped the cookies off with a little sugar fresh out of the oven. I can't wait to play with this recipe and add raspberries or poppy seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Callan"
},
"reviewBody": "The BEST lemon cookie ever!!! I used 2 3/4 cups flour, zest of 3 large lemons, 1/2 cup canola oil and almost a full cup of fresh squeezed lemon and let it sit in the frig overnight only because I was too tired to bake them the same day. I used two spoons to place dough on cookie sheet by the 1/2 teaspoon only. (Scoop up mixture with one spoon and scrap off with the other). I baked for 8 minutes as I wanted soft cookies. Very delicious, tangy but sweet mixture. So freckin' good if you loooove lemon!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GTHERE"
},
"reviewBody": "so easy to do"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Erin_D"
},
"reviewBody": "I was so stoked about making this recipe. I followed the instructions exactly with the exception of taking Mary Callan's suggestions on these supstitutions: \"Full Review Apr. 6, 2007The BEST lemon cookie ever!!! I used 1 1/4 cup sugar, zest of two very large lemons, juice of three very large lemons (almost a full cup) and 1/2 cup of canola. Fantastic - I guarantee!!!\" Unfortunately, this did not turn out as it should have. I took Juanita (the recipe maker's) suggestion and put all the ingredients into the food processor until it thickened to a dough. However, the batter never thickened into a dough. Instead, it was the more like the consistency of icing. I thought it might help to place the mixure in the refrigerator (like other suggested to remove the thin consistency of the oil--even though I added much less oil than the recipe called for), but it never thickened up to a dough consistency. Very disappointing. I hate wasting food and I had to throw away this entire recipe as it was useless. Now, I am wondering what went wrong. It may be the baking properties of lemon juice and oil. I am on a mission now to find out. If anyone has any suggestions or comments, let me know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Fields Merriam Chadwic"
},
"reviewBody": "Wow! I cannot stop eating these cookies! I also ate about half the batter while making them, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "I didn't have good luck with these. They were very thin and either too hard or too soft. They either broke apart or fell apart. Not a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MACLEOD26"
},
"reviewBody": "Eh. These were okay. Very crispy, not the lemony-est cookies I've ever had. I might make them again in a pinch, but I think I'll keep looking for the perfect lemon crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June Bug"
},
"reviewBody": "easy to make, I had all the ingredients needed at home. I substituted the oil with 1 cup of ground flax seed meal and 1/2 cup of oil to cut out some of the fats and it worked out well! Could stand to use a little more lemon juice and rind, but still a moist inside and crispy edge cookie! (cut baking time to 9 min)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nannawee"
},
"reviewBody": "To me this was an okay recipe. Although my boyfriend can't say that. He devoured them! After reading some reviews I went ahead and used 1/2 cup of oil, everything worked out fine:) Also I used lemon juice from concentrate. I think that thats why I didn't fall in love with them. To me I really didn't taste any lemon at all. Also I did powder them with powder sugar. But again I'll say that this is an okay recipe if you use lemon concentrate, next time I'm definitely using fresh lemon juice!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rich"
},
"reviewBody": "This is a wonderful recipe, I wish i had read the reviews before I started. I ended up adding about a 1/4 cup of flour to get a batch of good full cookies, but well worth the time to tweek it. I love the flavor, I used 3 large wild lemons and the flavor was unbelievable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CARTOONRCKR"
},
"reviewBody": "I only tried this recipe because I had lots of lemons to use up. I won't make it again. They were ok, but the \"dough\" was more like a batter and the cookies came out really thin and not appealing. I added some flour to the rest of the batter to form \"dough\" and baked the rest. They were ok, but not excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "I don't like these cookies so much. I love lemon, but these were a pain. I read the reviews and decided to cut the oil down to a 1/2 c. I should've cut it more. These things spread like crazy, so much so that I put the remaining batter in muffin cups. The muffins were not any better than the cookies--they rose and fell in the oven. The only thing I didn't do was to refrigerate the cookies overnight, but I really wanted to make them today. Too bad--could've been a good cookie. Some of the pieces I scraped off didn't taste too bad, but the oily taste wasn't my favorite. I'll try other recipes instead. Thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly MacDonald"
},
"reviewBody": "I was looking for more of a lemon taste. Also the dough seemed to have a wierd consistency and didn't stay together too well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmbrown"
},
"reviewBody": "These came out wonderfully, with a few modifications. I used a full cup of lemon juice and only half a cup of oil. The dough was pretty gooey, so I chilled it for several hours and then shaped the cookies with damp hands. They taste sweet when you first bite into them but have a nice tangy aftertaste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "poggins"
},
"reviewBody": "zingy from the lemon, with great texture (crisp outside, chewy inside). just remember to cut down the oil (and in my case - sugar) - I added the lemon juice and vanilla to the dry ingredients, then slowly added in the oil while mixing, and stopped adding oil when the dough got to the right texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sarah Cravy"
},
"reviewBody": "I made a half-batch, with less oil and more lemon juice as other reviewers suggested. The flavor was nice and lemony, but the texture was awful. The cookies were flat and rock hard, not crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peculiah"
},
"reviewBody": "I made these essentially as written - 3/4 cup of vegetable oil and all! The only difference being I used 1/2 cup white sugar and 1/4 cup brown sugar. Baked for 10 mins in the oven, these were delicious. I brought them to work and all of my coworkers loved them - they are a deliciously different cookie. Next time, I would use more lemon zest and juice because I like a tangy flavour. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookies"
},
"reviewBody": "I reduced the oil some but other then that I followed the recipe exactly. I wish they were a little more tart. The cookie has a perfect balance of sweetness to tartness, It isn't overboard of either flavor, but I like alot of lemon flavor. If I were to make these again, I will try them with butter instead of the oil and more lemon juice for tartness. Update*- I froze half of the batch, and I find that I like to eat them better as frozen cookies! they seem to melt/defrost instantly while you chew them :) THX."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RCHS"
},
"reviewBody": "I read the other ratings and we adjusted the oil to 1/2 cup, adding a little more lemon juice to compensate. Then, we refrigerated the dough overnight.\n\nThese turned out WONDERFUL!\n\nOur very young son has a severe dairy protein allergy. I was saddened at the thought that he wouldn't be able to eat Christmas cookies when everyone else was enjoying a treat. We made these up and he LOVES them.\n\nThank you, thank you, thank you to the this recipe's author for submitting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dairy Free 4 B"
},
"reviewBody": "Very tasty! Perfect for my dairy-allergic boy. Something the whole family can enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TIPTIP82"
},
"reviewBody": "I followed the recipe exactly except that I halved the ingredients and reduced the oil by 1 tbsp (would have been 2 if I hadn't halved it). These were okay but they weren't very sweet. Perhaps the problem is that I don't know what a \"snap\" cookie is but I wanted a chewy, sweet lemony cookie and this wasn't it. Reminds me more of a lemon flavored tea cake cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Maneval Rode"
},
"reviewBody": "You know, my cookies didn't look anything like the ones in the picture, even though they tasted great. I re-read the recipe and realized I'd left out the baking soda--duh. They were flat, like wafers, and kind of crisp. But they were still wonderful! Leave out the baking soda and see what you think - they'd be awesome with some ice cream and raspberries, as one of my friends said. Next time I will definitely use the baking soda...thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yippee5"
},
"reviewBody": "Not bad for a vegan cookie. Has an unusual texture, but they stay soft for a long time which is nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "traceym"
},
"reviewBody": "easy enough to make, but next time i will use less oil,and increase the lemon.\nthanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AWO"
},
"reviewBody": "As a vegan cookie these get 5, but as a regular cookie they're a 3, so I'm giving a 4 overall. The taste was nice, but not particularly zingy and even though I reduced the oil slightly, they were still very greasy. The dough was very watery and I was running short on time, so I baked them up as bar cookies last night. When I tried to remove them from the pan this mornng, they turned into a crumbly, sticky mess. I wound up pressing the crumbs back together in small pieces and baking them again. I'll keep this on hand as a vegan recipe, but won't be making it again otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "204"
},
"reviewBody": "This is a yummy recipe! And for people with allergies, its great: no eggs, no dairy, no nuts! I sprinkled on colored sugar before baking to add a little Christmas sparkle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Medea"
},
"reviewBody": "I've been looking for a tart lemon cookie that I can freeze and thaw easily -- no icing, preferably. I made these and am test-freezing them, though I did taste them just out of the oven. My \"recipe mutations:\" I'm not vegan, and I was concerned about the greasiness mentioned in some of the reviews, so I used butter (1 stick) instead of vegetable oil. I also used the juice and zest of 2 good-sized lemons instead of measuring it (but it looked to my eyes to be about the measurements in the original recipe) and substituted 1 tsp lemon extract for one of the tsps of vanilla. That gave the dough a nicely tart bite. I also added 3 drips of yellow gel food coloring. The dough wasn't coming completely together with stirring (of course, I had left out 1/4 c. of oil), so I mixed it with \"impeccably clean hands\" to finish incorporating the flour. Instead of greasing the cookie sheet I used a silicone liner. My first three \"test cookies\" were teaspoon-size drop cookies baked for 10 minutes. They came off the pan easily, were lumpy, and did taste like Trix. Not bad, and my husband liked them (he said, \"You can't go too wrong with lemon and butter), but they still didn't capture that lemon \"zing.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deci 31"
},
"reviewBody": "This cookie is GREAT! I used Splenda in the place of sugar. You can really taste the lemon and their very light in texture. Would recommend for anyone that likes lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We make these about once or twice a month. One of my daughters has a life threating dairy allergy and these are a blessing. My 10 year old makes these on her own....including the zesting...whenever we are having company....different and refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ESJESSI"
},
"reviewBody": "I made this recipe for my co-op, and they got eaten up pretty quickly! I used about 2/3 of the oil recommended, as suggested by someone else here. That seemed to be a good amount. I also didn't have any lemon zest, so I used orange zest. The dough didn't seem to have much flavor, so I added a bit more lemon juice and some freshly squeezed OJ. That did the trick! I didn't have any vanilla extract, but they still tasted delicious. I wouldn't call these lemon snaps, though... mine turned out pretty chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a really good recipe; I have a little girl who is allergic to eggs and dairy, so it is tough to find good cookies to make her and this one is fantastic! I don't recommend cooking them the lesser because then they are way too soft. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Too much oil from the start--the first third of the dough, I sopped up a little oil before dropping them on the cookie sheet. This first batch took forever to cook--it seemed like almost 20 minutes, although I stopped counting after a while and just looked at the cookies... I ended up refridgerating 2/3 of the dough, and when I took it out six hours later, a lot of the oil had come out of the dough. It turned out to be a good thing because they seemed to bake faster than the first batch (12 minutes for pretty crisp cookies after cooling). I would suggest about 1/2 cup of oil instead of the 3/4 cup from the recipe. Otherwise, the cookies turned out pretty well, kind of like crunchier lemon bars. Like lemon bars, they turn out pretty tart, and could use a sprinkling of powdered sugar to balance the tartness (I also didn't use the lemon zest, because of personal preference, but I used more pulp in the cookie instead)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Divine- tangy and sweet with the perfect crispy texture! The best internet cookie recipe I've ever tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ABS140"
},
"reviewBody": "I was discouraged by all the other reviews, but was ery pleasantly surprised! I cut down a lot on the oil (about 50ml) and used the juice of 2 huge lemons to compensate on liquid. I also chilled the dough for a bit before baking, although I don't know if it needed this. They came out beautifully, not too flat, and with a light golden brown edge. The taste is very \"zingy\", great for a lemon lover like myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "these turned out really flat and oily. i followed directions exactly. they just taste like flat floury disks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this as bars, in a jelly roll pan. It was awesome and had a soft brownie-like consistency. Stayed soft all weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LUV2COOK"
},
"reviewBody": "Very refreshing, a great summer cookie. Everyone at work loved it. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious Recipe! I have made these cookies many times now and my kids, my husband, my mom, and my father-in-law all go WILD over them. I use the recipe EXACTLY as shown. Some hints to make the cookies turn out well are: 1. Keep the cookies on the small side. They do flatten, just like all \"snap\" cookies do. 2. Leave the cookies on the sheet for five minutes or so after they are done cooking. It will help them slide off the pan much easier. (When using baking stones, as I do, there's no need to grease the stone if it's seasoned.) 3. Defenitely use the zest along with lemon juice. You don't need any fancy gadget to zest, just use a cheese grater. ENJOY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Nothing special - in fact quite disappointing,even though I followed the recipe exactly. Very greasy and flattened out like pancakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a wonderful recipe. I looked everywhere for a Lemon Snap recipe and this was the best one I found. I had no problems what so ever they came out perfect. They were moist and came off the pan easy. I am not an expert by any means and they were the rave of my family Christmas Dinner, according to my family they were better than grandma's. WOW!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Marie"
},
"reviewBody": "I thought these cookies were really good - I made them today and have eaten WAY too many of them already! Not as lemony as I had expected, and I am going to cut the oil some next time, but otherwise I really like them. Also, I used PAM and had no trouble getting them off of the cookie sheet. On a scale of 1-10 I would rate these an 8 - Good Stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karisma"
},
"reviewBody": "Oh, heaven help those who use this recipe. Vegan is hard enough to bake with when it comes to cookies. Usually, they spread out, get gooey, stick like taffy to your baking sheet, and then sometimes they turn out wonderfully. Wonderful did not happen with these cookies. My only advice since the taste is decent, keep your cookies small. Small and less oil. Also when removing from the sheet. Cool them at least 5 mins first. Then take the side of your spatula and in short QUICK movements transfer the cookie to the cooling rack. I wish you the best. Some will love this and some will curse it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Unlike most recipes, these cookies actually tasted of lemon. They could have been a little tangier, but the flavour was almost perfect.(And from a vegan recipe, no less!)\r\nI found the vegetable oil made them quite greasy, but nobody else seemed to notice - I had several requests for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amydoll"
},
"reviewBody": "Wow! Did I ever love these cookies! Didn't have to change a thing, these are excellent just the way they are. Will make again and again! Thanks for sharing Juanita!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved these cookes. Preparation is very easy--the hardest part was zesting the lemons. I had hoped it would have been a little more tart; I will try to add a bit more lemon juice and decrease the sugar the next time. Or perhaps using lemon extract instead of vanilla.\r\n\r\nI did 50-50 melted butter and vegetable oil ('cause I wanted a buttery taste)--worked fabulous.\r\n\r\nI've already gotten a request for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pastrygirl"
},
"reviewBody": "I found these tasted like Trix cereal. But my guests who were lactose-intolerant liked them and would eat them again.\r\n\r\nI didn't find them to be all that lemony, even though I used fresh lemon juice and zest. I'd add more lemon juice next time, if the dough can take more liquid (I think it can)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SISSI808"
},
"reviewBody": "I thought they tasted kind of funny. People seemed to enjoy them anyway, though."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11605/luscious-lemon-snaps/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
"name": "Lemon Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11605/luscious-lemon-snaps/",
"name": "Luscious Lemon Snaps"
}
}
]
}
}
, "about": [
]
}
]