				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Make-Ahead Manicotti"
,"datePublished": "1999-04-09T15:16:27.000-04:00"
,"dateModified": "2022-09-25T10:13:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sandir"
,"url": "https://www.allrecipes.com/cook/24327930"
}
]
,"description": "This make-ahead manicotti is stuffed with a tasty blend of spinach, Parmesan, and mozzarella, and topped with store-bought spaghetti sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IpI11yLwCL-BNGRxvSM6k1G6-k0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6864154-de3269d64075401e8afa36a0b2d15eaf.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Make-Ahead Manicotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "227"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "507 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "112 mg"
,"fiberContent": "6 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1058 mg"
,"sugarContent": "18 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pint ricotta cheese",
"2 large eggs",
"1 (10 ounce) package frozen chopped spinach, thawed and drained",
"1 cup shredded mozzarella cheese",
"0.5 cup grated Parmesan cheese, divided",
"1.5 tablespoons white sugar",
"0.125 teaspoon salt",
"0.25 teaspoon ground black pepper",
"12 manicotti shells",
"1 (32 ounce) jar spaghetti sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix ricotta cheese and eggs together in a medium bowl until blended. Stir in spinach, mozzarella cheese, 1/4 cup Parmesan cheese, sugar, salt, and pepper. Stuff mixture into uncooked pasta shells."
} ,{
"@type": "HowToStep"
,"text": "Pour 1/2 cup spaghetti sauce into a medium baking dish; spread to cover the bottom. Arrange stuffed shells in a single layer over sauce. Pour remaining sauce over shells. Cover and chill in the refrigerator, 8 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "When ready to bake, preheat the oven to 400 degrees F (200 degrees C). Remove shells from the refrigerator."
} ,{
"@type": "HowToStep"
,"text": "Bake, covered, in the preheated oven for 40 minutes. Uncover, sprinkle with remaining Parmesan cheese, and bake for 15 more minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenniferW"
},
"reviewBody": "I've made this recipe for years. I love it, and I'm not a fan of ricotta. I use 2 jars of sauce, because I like my pasta saucy, but otherwise, I make it exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staceysj408"
},
"reviewBody": "Loved this recipe, it was quick and easy and delicious, not to mention easy clean up. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Pehl"
},
"reviewBody": "I added ground beef to the sauce and I added an extra layer of the ricotta mix on top of the noodles and then the sauce and it was extra cheesy goodness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Lynn "
},
"reviewBody": "I’ve made this and it’s really good my granddaughter loved it she’s not a meat eater. I will be making this soon. Not to mention I love it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tchr257"
},
"reviewBody": "This is the recipe my college daughter misses most about not living at home anymore. I do use it as a basic guideline. For example, she likes me to increase the sugar and to add Italian sausage. I omit the spinach. I have also learned, over the years of making this, that I don’t have to use the egg mixed with ricotta and it tastes just fine. As it is written, the recipe is superb. For my daughter’s tastes, I made the modifications above. This recipe is so easy to pop in the oven after a long day. The younger kids like to help stuff the shells the night before. I also highly recommend Paul Newman’s Sockarooni sauce to top this with in your dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dadecarlo"
},
"reviewBody": "I used 2 jars of spaghetti sause (I like the Prego Farmers Market) and used a little more mozzarella in the mixture. I also needed it for that evening so I baked at 350 degrees for an hour. This was so good. Even reheated the next day was just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pandoraw"
},
"reviewBody": "This was easy to make and very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L. P."
},
"reviewBody": "I made a double recipe for a potluck. Everyone enjoyed it, not a speck of leftovers to bring home.\nProblem, frozen spinach tasted like weeds and too much stems, am I too picky ?\nI made again tonight using fresh spinach trimmed off stems with scissors,, cooked in a dry skillet. Used home made spaghetti sauce with Italian sausage.\nPretty good ! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Dice Smith"
},
"reviewBody": "This is a great recipe. I hate trying to get the cheese into a cooked shell. I just used 2 jars (24 oz) of sauce so that the shells would cook and soften totally and it worked like a charm. I only put it in the refrigerator for about 3 hours as I did not read the instructions too closely. I guess I missed the \"make ahead\" part. It didn't matter. My husband loves cheese manicotti and he was thrilled that I finally found a great recipe for it! And BTW, I use an iced tea spoon to put the filling in the shells. It works like a charm. I fill one end and the fill the other until the manicotti is filled. Very simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Daddy"
},
"reviewBody": "I loved this recipe. I wouldn't change a thing. I did run into a problem piping the cheese into the pasta. It's hard to do one handed with a plastic bag and the filling is pretty thick, so it can pop a weak bag. I bought a piping kit which is really pretty cheap to find on Amazon for less than $20."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynthia Ann Pyle Lagow"
},
"reviewBody": "I've made this recipe for my family several times. It's easy to prepare and everyone loves it. If I don't have spinach, I just skip it and its still really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "The recipe turned out great and the dish was delicious. Even though I used smoked Gauda cheese with the Mozzarella it was still amazing. I sense I will be making this once again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Small"
},
"reviewBody": "My family prefers their manicotti saucy, so I added a 15 ounce can of tomato sauce with sautéed onion and garlic, and added basil and oregano to the jar of prepared pasta sauce. This has become a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kitchen Kitty"
},
"reviewBody": "Used half the amount of spinach. Was easy to prep with a ziploc bag used for the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tammy"
},
"reviewBody": "Very good and easy. Even put half in freezer for another day. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "george thomas"
},
"reviewBody": "This is great if you double sauce! Baked it for a party ... Easy because you could make it a day ahead! It's even better when it's two days old, yummy leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bombom"
},
"reviewBody": "Simple and delicious. Agreed with previous reviews. It needs more sauce.\nNext time I will add chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Lynd"
},
"reviewBody": "I love manicotti so much, and I'm so excited to finally have a way to make it so we can have it on a weeknight! This recipe was almost perfect. The only thing I would change would be to not add the sugar, or at least not as much; I really didn't like the sweetness. And maybe add a clove of crushed garlic. Definitely put it in a ziploc bag and pipe in the filling; much easier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TMV"
},
"reviewBody": "Easy dinner. Added more sauce and was very pleased. This is a base recipe in mind. Add things you like, sausage, mushrooms etc"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Superb recipe, make it exactly as recipe calls for! Huge hit with my big family for Saturday night dinners!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grnthum"
},
"reviewBody": "I never par boil manicotti or shells before stuffing. Make sure pasta is completely covered with sauce. They came out done perfectly and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Griffin-Capstack"
},
"reviewBody": "Loved this! I followed almost exactly as written, but I added additional sauce to make sure everything was covered and it came out delicious. Definitely will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "kids loved them. They were wonderful will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AtheistMama"
},
"reviewBody": "First of all, I ended up with a bowl of extra filling. Luckily I had extra manicotti shells (I adjusted the recipe for 9 servings, meaning 18 shells. I used 23 shells and still had enough for a few more!) Secondly, it wasn't very flavorful. I realize that had a lot to do with the plain store-bought sauce. But plain store-bought sauce is what makes this convenient and you don't want to start changing that around, so something else should have been done to add more flavor. I will probably make this again with the modification of (1) less filling ingredients and (2) adding some fresh garlic and maybe even jarred pesto to the filling to bulk up the flavor. It was nice to do a make-ahead, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brokensmiles143"
},
"reviewBody": "This is a GREAT recipe and easy to prepare, I made this for dinner today for my parents and little niece and they loved it!! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Meh. This was so-so. Both my hubs and I thought this was edible, but agreed that we'd pass on ever having it again. Oddly, this reminded me of all the frozen (manicotti) entree's I've tried in the past that I didn't like one bit. All the reviews are right - OMIT THE SUGAR! It gives the pasta a sweet taste that just doesn't belong (as subtle as it was). I BY FAR prefer my Pampered Chef florentine stuffed shells recipe. It takes a little work to prepare, but is OH SOOOO GOOD!!! Since I like idea of stuffing uncooked pasta shells (it makes filling a LOT easier!), I might give this another chance using my PC stuffed shells filling recipe instead. NOTE: A few reviewers suggested using a large Zip-Lock bag to \"pipe\" your filling into each manicotti shell. I agree. Simply snip the corner and use it as a pastry bag. A simple garden salad and garlic bread rounded out our weeknight meal. Maybe this will float your boat, but it left us sorely disappointed. Thanks anyways, Sandir. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie G."
},
"reviewBody": "So good! I followed some other reviewers suggestions and only put 1/2 tablespoon of sugar in the filling and it came out great! The only other change I made was to add less spinach than called for. I will definitely make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacebanty"
},
"reviewBody": "This was a big hit with family and extended family. I only used 1/2 the spinach and I think it was the perfect amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonna"
},
"reviewBody": "I have an Italian friend that told me to use egg roll wrappers instead of pasta shells.. It works \"fantastico\".. Just put the amount filling you want and roll.. Bake with the seam side down.. Quick and easy.. I did delete the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cara Lewis Hampton"
},
"reviewBody": "This was excellent! I also used extra sauce and it was easy and wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Hudgins"
},
"reviewBody": "I love this recipe! It was delicious the first day and the second day! I did use extra spaghetti sauce, I used 2 jars of 16 oz instead of 1 like it says, only because I didn't want the noodles to be dry.My husband loved it too, that does say a lot! This sure will be a recipe I use over and over again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "frankaff"
},
"reviewBody": "good Recipe, I add onion 1/4 of onion and a extra egg baked 1 hour 375 oven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Quinn"
},
"reviewBody": "I absolutely loved this recipe! How easy to make ahead and throw in the oven later for an easy dinner. I don't think I'll use the sugar next time, but other than that, it was very good. Thanks for the awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret"
},
"reviewBody": "This was delicious! A big hit with the entire family. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Bovenmyer"
},
"reviewBody": "I also added 1/2 lb of Italian sausage, as well as using about 1 1/2 jars of spaghetti sauce, and then about 2/3 spinach. I boiled the noodles for about 4 minutes... that might have been too long b/c some fell apart, but when they are baked, they kind of fall apart anyway. I baked them for 30 min covered, and 10 min uncovered. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeniferken"
},
"reviewBody": "These were good...I made as the recipe is written. Next time, I think I'll add a little spicy sausage to the cheese mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dakota"
},
"reviewBody": "Came out really bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "This was certainly easy enough. I left out the spinach because my family doesn't care for it. I also omitted the sugar and it was not missed. I did find the manicotti shells to still be a little gummy even after baking for an hour. I used two jars of sauce so it was all well covered. Wouldn't stop me from making it again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "I have to agree with other reviewers that stuffing an uncooked manicotti shell is much easier than stuffing a cooked one. But even after sitting in my fridge overnight and most of the following day, the edges of these were still hard after baking. I think that you really need to drown the manicotti in the sauce in order to get all of the shell to be soft. We cut a little of the edge off, and every other part was devoured. My kids loved these. One other change I made was to add in some fresh spinach that I sliced very thinly and then added to the cheese mixture. My kids didn't even know it was there, and it was an easy and delicious way to add some green to their meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "deniseksweet"
},
"reviewBody": "Noodles were a bit \"doughy\" but over all good. Would make it agaon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenne64"
},
"reviewBody": "Loved this! It was so easy and as I had never attempted to make Manicotti before I was kind of nervous. I shouldn't have worried though as the results were awesome and very filling. My whole family and a couple of passing friends gave this a serious thumbs up tonight. I made 12 but put some in the freezer as was suggested by another reviewer. I also added chopped mushrooms to the mix and I think that helped with it feeling as though it had more body. \n\nWould recommend this dish and eat it eat any day of the week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thepinkbee"
},
"reviewBody": "I accidentally added more salt than the recipe called for, so that was my own fault but this dish was absolutely delicious! I was afraid of not cooking the manicotti first but it cooked perfectly in the ovn :@)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "Really good!! Love that the shells are easy to work with because you don't have to boil them first. Genious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Slacker Foodie"
},
"reviewBody": "I tripled the recipe and put two in the freezer so I got a \"three-fer\" for almost the same amount of work!\n\nThe only thing I did differently was to leave out the salt and sugar, since most jarred spaghetti sauces contain plenty. I used Prego - their regular ol' flavor that comes in a Costco-sized jar - and the taste was just right for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nemui"
},
"reviewBody": "I've tried this with manicotti shells and for making stuffed shells and prefer the stuffed shells but either way is delicious. I've used fresh grated Parmesan and the stuff from the can and it's great either way, I just use mozzarella on top if I'm using the canned stuff. I love making a double batch the night before we have company coming and so I can focus on other things the day people arrive and just pop this in the oven for dinner. Normally when I ask my husband what to make for dinner he'll say something along the lines of \"I don't know, everything you make is good\" but this is one dish he will consistantly request if it's been a while since I last made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wastingtym"
},
"reviewBody": "Loved it! I made mine the night before then just popped it in the oven an hour before dinner. Super easy and very tasty. I took the advice of others and put the filling in a ziploc bag so I could pipe it into the shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Walters Parker"
},
"reviewBody": "So good. Although I didn't go by the recipe I still loved it. I went by other reviewers tips and cooked the shells first, stuffed shells and cooked right after adding everthing to the casserole dish. I was VERY pleased with the resaults."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbernardin"
},
"reviewBody": "Awesome!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Alexander"
},
"reviewBody": "Loved this recipe.. Like others that tried it, agree with these of the Make Ahead Manicotti.. I made a double batch and used spinach in half.. Used home made sauce.. and a pastry bag to fill.. Easy.. Used the sugar but think I will omit it next time do to my sauce had a tad bit of sweet flavor already.. I used half of ricotta and half cottage cheese.. Taste was wonderful. I am going to serve some tonight and then freeze the rest.. Thanks for posting this.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vincent the WAP"
},
"reviewBody": "Spend a little time making your own shells and it will go a very very very long way in improving your manicotti. get rid of the sugar its totally unecessary. If you have lots of time get a store bought sauce and a smaler piece of pork and simmer the sauce with the piece of pork in it for a few hours. Then you will have REAL MANICOTTI! Good quick version though, minus the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Storey Czlapinski"
},
"reviewBody": "I make this frequently. Very good--freezes great, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "spatula flipper"
},
"reviewBody": "This was just plain \"OK.\" I think the amount of spinach is just fine if you like spinach like we do. The problem I found was that it is bland. I would maybe add some chopped garlic to the cheese mixture and perhaps some parsley too. A little more salt as well. With those changes in mind, I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie Cardon Wright"
},
"reviewBody": "WAY TOO MUCH SPINACH! DEFINITELY cut back. Otherwise, a pretty good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tracyjamison"
},
"reviewBody": "I like the idea of preparing it the night before and throwing it in the oven. I gave it 4 stars b/c it was too sweet. I will try it again, but reduce the amount of sugar at least by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Franklin"
},
"reviewBody": "This recipe is so incredibly good! My husband loved, loved, loved this recipe. I did not have manicotti at hand so I made a \"lasagna rolls\" version. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "susiekew"
},
"reviewBody": "A great idea, and I will probably make something like this again, but I found it really lacking in taste. It needs garlic, onion, and more parmesan, at least. You can't rely on the sauce alone for flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cchrisb79"
},
"reviewBody": "This technique makes this ideal for midweek meals. I used freshly grated parmesan instead of the stuff in the bags. If you don't want to deal with stuffing manicotti, just switch to shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schurra11"
},
"reviewBody": "made this with stuffed shells and it was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MRSFROSTY"
},
"reviewBody": "Really good and easy. I made it the night before a day when I had to work late. My husband put it in and we had a delicious dinner when I got home. Pair with a salad and it's just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robins"
},
"reviewBody": "Made this for Christmas Eve for the family. Nice and easy. I made it the morning and cooked it at night. Easy to do, tastes great. Needs more sauce though than what the recipe calls for if you want it to stay moist baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Homrich Reinhart"
},
"reviewBody": "Delicious -- super easy to make and enjoyed by all. I used a generic brand spaghetti sauce with it and it was awesome served with breadsticks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katkah"
},
"reviewBody": "Fantastic recipe! I'm in charge of the menu at the adult foster care house I work at and this is a favorite there. The staff loves it because I make it in advance, so it's easy for them... all they have to do is toss it in the oven. There are never any left overs when this dish is served."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j doschadis"
},
"reviewBody": "great taste, couldnt stop eating it, very easy!! i used a 15 oz. tub of ricotta and filled 14 manicotti shells, with filling left over. chilled in fridge overnite and didnt bake until the following evening. wonderful! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHES408"
},
"reviewBody": "Incredible!!! I make this all the time... I add hamburger just to make it more hearty!!! I have, also, made stuffed shells with it!!! Delicious recipe!!! Thanx!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IBULJD"
},
"reviewBody": "I had some filling left over from another recipe and so i found this recipe...it was still the same filling, spinach, ricotta, eggs, etc.\n\ni thought it came out good. i did follow the suggestion of prefilling the manicotti and freezing it until later use for the following week. i just took out of the freezer and put in the tray and covered and baked...it did take a little bit longer to bake, but was good overall and great to do ahead and on a busy weeknight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "prell2k4"
},
"reviewBody": "This is sooo tasty. I added lots of sauce and seasoning to the sauce because I just don't like sauce straight from the jar. But WOW, I will make this more often. I made the manicotti on Tuesday afternoon and cooked it Thursday evening. You have to try it. I put parm and mozzarella on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "A nice do-ahead dish. I followed others advice and added a bit more sauce. Also, I forgot the spinach, but added a bit of fresh fennel and oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Patterson"
},
"reviewBody": "I made this for my vegetarian daughter's birthday party. I followed other reviews and added more mozzarella, shredded parmesan, grated parmesan, and garlic. It is so nice to be able to make ahead. It was a huge hit. Fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kgross"
},
"reviewBody": "Make sure to use enough sauce. Mine came out a little tough. But the flavor of the filling was delicious and a great way to make my hubby eat spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kcita_234"
},
"reviewBody": "Good, but nothing to write home about. I will definitely make it again when I need a quick dinner meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynno"
},
"reviewBody": "I really liked this recipe. It was easy to make a day ahead and then cook when you wanted it. Not sure it was anything special, but a good solid manicotti meal. Hubby said it was better than my lasagna. Only thing I did different was add more ricotta in mix and add moz cheese on top with parm. Anyway, thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "senoramandi"
},
"reviewBody": "Used 1/2 the spinach and extra sauce. Also added spicy Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This didn't work out for me. I think my mistake was that I used a sweet basil sauce and that, coupled with the sugar, made for a too sweet dish. The noodles didn't cook well either--they turned out a bit gummy (the sauce covered the noodles well)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yenny58"
},
"reviewBody": "This recipe was wonderful! The only reason why I did not give it 5 stars is because I did have to add some things to the sauce to make sure it stayed \"saucy\" enough after cooking. I used 1 jar spaghetti sauce, 1 small can tomato paste, 1 can diced tomatoes with the juice. This made for perfectly cooked noodles, and plenty of sauce left after cooking. I left out the spinach, added the entire 1/2 cup Parmesan cheese to the mixture and put mozzarella cheese on top instead of the Parmesan. My family LOVED this! This is a keeper, and will be made again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "I have made this twice so far and received rave reviews each time! I added a little more sauce than called for and used two different kinds in one dish: four cheese and garlic. I also added about 1 extra cup of mozzarella. We are cheese lovers over here! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEANNA"
},
"reviewBody": "Very yummy. I added a bit of water to my sauce before pouring onto the noodles, and did not have any problems with it drying out. So much easier than making manicotti with cooked noodles...I'll never do it that way again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeannie"
},
"reviewBody": "This was very good but needed more sauce. Tended to be dry after baked. Will make again only use more sauce next time. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THEREE"
},
"reviewBody": "This is a keeper recipe. I followed the recipe exactly except threw in some extra cottage cheese that I needed to use up and it turned out fabulous. I doubled up the ingredients so I could freeze some for later. \nPut them on a cookie sheet to allow them to freeze and then put them into gallon bags so I could pull out what I needed for that specific occasion. \nGreat way to get your kids to eat vegis too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrittneyJP"
},
"reviewBody": "I made this for my boyfriend's family (all 10 of us) so I had to double the recipe... They aren't huge eaters but we barely had enough... if you want to make this for a large group plan for 2 1/2 times the normal amount! Other then that, everyone LOVED it! I did take the other user's advice and cut back a little on the spiniach and then went overboard on the sauce (a good thing to do). It really was such a simple recipe that looked and tasted amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beachlvr2"
},
"reviewBody": "Very easy. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BetteDavisLies"
},
"reviewBody": "This is the most ingenious recipe. I always hated how manicotti got really watery after baking if I boiled the noodles first. Not only are the uncooked noodles easier to pipe into, they hold up after baking. The refrigeration allows the flavors to meld, and gives a finished restaurant quality product. My husband and I are vegetarian, so we add morningstar crumbles to the sauce before baking and this makes for a hearty dish that please both veggies and non-veggies alike. The spinach mixture would make an excellent lasagna as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miranda R."
},
"reviewBody": "This was awesome and really easy! I consider myself and intermediate cooker and this was wonderful! My husband loved it also and neither of us eat spinach. (We used it though) He thinks he has to have meat in everything too. I used meat flavored Ragu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROBYNBNB"
},
"reviewBody": "This was good, but a little dry.\nI always make my manicotti or lasagna with raw pasta, it just seems to save that step.\nI would mkae again, but add more sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRN"
},
"reviewBody": "This recipe was excellent. My family enjoyed it and are asking for it again. There were very few leftovers that were devoured the next day! I made the manicotti the day before, sprinkled the parmesan on it and popped it in the oven. Quick and easy for a busy week night. Thanks for the yummy recipe. I will make it again very soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wpbfl"
},
"reviewBody": "The first time I made this.. it was perfect. The second time I decided to change things around a little (added more spinich, cheese, etc.) and it turned out just okay. A little time consuming.. but worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShortCook"
},
"reviewBody": "Excellent! I've served it for multiple crowds and it always get good reviews. I like it because it can be made ahead of time so the work and the mess is done before your guests show up. It also freezes well but be prepared, as it takes about twice as long to cook when frozen. \n\nMy tweaks include: using 2 jars of sauce, not quite as much spinach, added mushrooms (canned or fresh), and lighten up with skim ricotta, egg substitute and reduced fat mozarella. In a pinch I've used shells rather than manicotti tubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fett's Lady"
},
"reviewBody": "This recipe was definitely a hit with me and my family!! The prep was easy! I did follow the suggestion of a few other reviewers and used 2 jars of sauce, and I am glad that I did! One jar never would have covered it. I also ommitted the spinach and added 1 lb of lean browned ground beef as I am feeding two men that want their meat! They both loved it and this recipe has become a staple...I have to make it at least twice a month!! Thanks for the recipe and all the great suggestions from the other reviewers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Capotosto"
},
"reviewBody": "Easy and so good! You definitely need 2 jars of sauce (don't try using pizza sauce) and less spinach. Thanks for the great idea Sandir!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ebell83"
},
"reviewBody": "Tremendous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Dudley"
},
"reviewBody": "I really liked this &amp; so did my Mother in law. My husband did not like as much &amp; says to stick with the stuffed shells recipe that I got from this website. Next time I make, I will use more sauce as 1 jar didn't seem to be enough, reduce the ricotta, add more motzarella &amp; bake for a little less time. That may make it more cheesy &amp; more saucy. Overall I really did like this dish &amp; would make again! My husband is not a big Italian fan. He said this seeemed like a dish you would get in a restaraunt, I see this as a compliment!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCaldwell"
},
"reviewBody": "This is a great time saving recipe. I don't like cooked spinach that much and I LOVE this recipe! Here are my \"tweaks\" to offer: 1) I add crumbled and browned italian sausage (turkey or pork) to the mix to make it more substantial since my guy likes to have meat on the table! 2) I definitely think it needs the extra sauce. I use 1.5 jars. Using the jumbo pasta shells makes this the simplest recipe ever. I usually make this on Sunday night when making Sunday dinner so that Monday night's dinner is a no-brainer!! Oh -- thanks to my bookclub friend Misty for passing this along!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PickettFence"
},
"reviewBody": "I was in a rush, so I cooked the shells and tried to stuff. Stupid idea because I made a mess! Also added italian sausage and my family really enjoyed it. Will make again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpmcminn"
},
"reviewBody": "I loved this recipe! It takes just a few minutes to prepare and stuff the shells and best of all it doesn't create a huge mess in the kitchen if you do it before bed like I did. Like another person said, I would add more sauce as it cooks because the noodles on the outside got a bit tough. It called for 12 shells and I used the entire package as there were only a few more than 12 and I had plenty of the cheese mixture. For those not so fond of spinach, like my husband, he recommends using half the spinach or better yet none. He thought it would have been good with just the cheese mixture and then adding ground beef to the sauce. So next time I make this, I might split the cheese mixture in half and use spinach only on my half. I could make 2 dishes with half spinach and half plain cheese and try freezing one. This is also a great dish if you need to deliver a meal to someone in snap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "docswife"
},
"reviewBody": "Tasty and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Brunmeier"
},
"reviewBody": "Really good! I've made this many times now. I like to add some cooked chicken breast and definitely a little minced garlic. Use a gallon ziploc bag with the corner cut out as a disposable pastry bag to make it clean and easy to fill the shells. I always use part-skim mozzarella and the lower fat ricotta and get a very creamy, tasty result. Some reviewers complained of the pasta not being soft enough. If you make sure that you really cover it with enough sauce you won't have a problem. You will need 1 1/2 jars to do this. You've got to make it ahead and let it sit in the fridge. If you bake it right away the pasta will be tough. Great to have a recipe I can throw together in the morning, come home and put in the oven, go to watch my son play high school sports, come home and serve!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TABLESPOON"
},
"reviewBody": "I made this recipe in large quantities and it turned out very well. I gave it 4 *'s because like other reviewers, I thought it needed more sauce (which I added). I froze it before baking, and next time I would add even more sauce towards the end of the baking time because the top of the shells got hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael"
},
"reviewBody": "This was sooooo good! Really easy to make too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole S."
},
"reviewBody": "Very simple and very tasty! I recommend putting the filling mixture in a large ziplock bag and cutting a corner off so you have a \"pastry bag\" type thing to pipe the filling in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "THELAWRENCES"
},
"reviewBody": "When a recipe gets so many good reviews, and then I don't really like it - I assume I did something wrong. However, I just didn't care for this recipe, and do have a different \"no boil\" recipe I like, so probably won't make this one again. Husband pronounced it \"good\"."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11857/make-ahead-manicotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11857/make-ahead-manicotti/",
"name": "Make-Ahead Manicotti"
}
}
]
}
}
, "about": [
]
}
]