				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mango Gazpacho"
,"datePublished": "2018-06-08T09:24:40.000-04:00"
,"dateModified": "2022-10-07T14:07:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "USA WEEKEND columnist Pam Anderson"
}
]
,"description": "Serve this intriguing variation of gazpacho at your next summer gathering."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZbhWQhe8OdY8KcmXu8CBwjXDR3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1157728-f551ac529ef9445a8bc07e97e1151922.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mango Gazpacho"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "84"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "147 kcal"
,"carbohydrateContent": "26 g"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "5 mg"
,"sugarContent": "20 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups 1/4-inch-diced fresh mangoes",
"2 cups orange juice",
"2 tablespoons extra-virgin olive oil",
"1 seedless cucumber, cut into 1/4-inch dice",
"1 small red bell pepper, seeded and cut into 1/4-inch dice",
"1 small onion, cut into 1/4-inch dice",
"2 medium garlic cloves, minced",
"1 small jalapeno pepper, seeded and minced",
"3 tablespoons fresh lime juice",
"2 tablespoons chopped fresh parsley, basil or cilantro",
"Salt and freshly ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Process mangoes, orange juice and oil in a blender or food processor until pureed. Transfer to a medium bowl, along with remaining ingredients. Season with salt and pepper to taste. Refrigerate until ready to serve. (Can be made several hours before serving.)"
} ]
,"recipeYield": ["6"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenniwest"
},
"reviewBody": "Great, easy recipe for a delicious summer soup! I made this for a small get-together after finding mangoes at Costco, and everyone loved it. I will definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luis Guarda"
},
"reviewBody": "An explosion of flavours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kit Ilardi"
},
"reviewBody": "My husband and I loved this. I made it exactly as written and it turned out great. I'll surely make this again on a hot summer evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karin"
},
"reviewBody": "Good, refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This was pretty good and very visually appealing! It came out a little orange-juicy though; not sure what to do to fix that next time. I pre-roasted the bell pepper in the oven with a little olive oil. I used half an onion and I liked that amount, it didn't overpower it. I left out the garlic due to sensitive stomach and I didn't miss it. If you want to add extra veggies, I think some riced cauliflower might be nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorraine Williams"
},
"reviewBody": "Made this as the first course of an outdoor luncheon on a very warm day for friends. Based on other reviews, I reduced the orange juice to 1 1/2 cups. I used 1/2 jalapeño with about 1/3 of the seeds to add a bit of heat. Added 1 small chopped avocado, then used an immulsifier blender for a few seconds only. The second course was an orzo, shrimp and asparagus salad served at room temperature. My guests wanted both recipes. I will definitely make both again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLLITZ"
},
"reviewBody": "I really liked it as is reads, but I made it a second time using mint instead of cilantro and I liked it even better! Very refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissDish"
},
"reviewBody": "This is lovely for a hot summer day! Have made this several times and find that puréeing the garlic and onions with the mangoes and olive oil helps the flavours combine. Also, I added salt and pepper to the cucumbers and red peppers for a few minutes before adding to the mango purée - this added just a bit of depth. Garnished with basil and jalapeño. YUM!! YUM!!! YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoupGirl513"
},
"reviewBody": "First off - I was looking for a Summer Breakfast \nSoup (a tall order) and after endless looking, decided on this. I did 6x the recipe, was 1/2 cu short on fresh mango (they had a blow-out deal at the grocery so opted for the extra labor with fresh) I had decided to use orange mango juice with frozen mango, but since I was using fresh to use OJ and I do not think the orange is overwhelming. I used half parsley and half cilantro. I prepared all the veggies using the processor on PULSE so there are varying sizes of \"chunks\" not too many large. I also had some roasted garlic to use up (about 2/3)and 1/3 raw so threw in an extra raw clove to compensate. I really love this. I think I'll try the ginger and curry variation next time! Thanks for a wonderful summer soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "This is really quite good - I substituted shallots for garlic and used about half of a pearl onion for the onion specified in the recipe. I also love jalapeno and cilantro so I used some of that as well. I made several bowls of this with the recipe and the first I put salt and pepper in it and it tasted a bit odd -- the second time I had it I didn't season it and I found it really delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I put one can of coconut milk and only one cup of orange juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sexpanther"
},
"reviewBody": "i made this and substituted the mangos for my own delicious . it actually tasted like my own toilet. scrumptious. i highly recommend the -gazpacho"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjc_cooks"
},
"reviewBody": "I followed the recipe exactly except for the orange juice - I didn't have any. I loved the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maria"
},
"reviewBody": "I love mango! And this was perfect to put on top of my shrimp! It's easy! It's cool! It's flavorful. I wish it was a touch sweeter, or a little less lemon! It would be perfect. But it was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "For me, the OJ dominated a little too much, so I definitely will cut that back next time, maybe even replace some of it with some white wine??? I used chopped cilantro, and I would definitely recommend that over either basil or parsley for this combo of fruit and veggies. This would be the perfect appetizer for a summer BBQ. Serve it icy cold, and you'll have a very tasty refreshing gazpacho. Very nice, indeed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nielcookin"
},
"reviewBody": "This was much easier to make than I anticipated. I removed half the orange juice and blended some tomatoes instead, as I wanted it to be heartier &amp; thicker. I would not hesitate to reccommend this to my fellow kitchen noobs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMALLTOWNGIRL"
},
"reviewBody": "Very good! The taste sort of reminds me of cerviche. I didn't want the 1/4\" dice \"chunks\" so I blended everything up all together. Paired it with grilled shrimp and it was delightful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moonchyldcrab82"
},
"reviewBody": "Wow. This was the first time I ever had gazpacho. I was skeptical but it turned out great! Forgot to add the jalopeno and it was good, added the jalopeno and it was great. I used cilantro. Will definietly be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "luvz2cook"
},
"reviewBody": "Good recipe but not my favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb Kavorkian"
},
"reviewBody": "Very good and easy to make this. I did serve this out of canning jars as something a little different, but I also canned some. You can also spoon out the chunks for a fruity salsa for on top of dishes. I did not have a blender so this turned out a little on the chunky side. Will puree it more when I can afford a new blender. Otherwise the taste was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SarahJP"
},
"reviewBody": "I did not care for this recipe. The orange juice makes it too sweet and runny, and there wasn't any spice to balance it. (I DID use a whole jalapeno, but couldn't taste it at all.) I do not recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "foodiefoodie"
},
"reviewBody": "This dish tastes great with fish. I added corn and would lessen the oj on this one by 1/4 a cup. It is good when the dish is very cold. I would probably use the same ingredients for a salsa next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I chopped the remaining ingredients finely, added half a shot of Tequila and served it as Gazpacho shooters. What a hit at the party!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xvc"
},
"reviewBody": "I had mango gazgacho at Medusa Grill in Lake Geneva Wisconsin a couple of weeks ago. I had to find a recipe because I thought it was a delicious first course. This is the only version on all recipes and it turned out wonderfully. It has more orange taste than the restauarant one had. I may have to experiment with it. Very glad I tried this. I used not from concentrate orange juice labled as having lots of pulp so my \"broth was thicker\" than the restaurant version. I love finding good recipes for cold summer soups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillallison"
},
"reviewBody": "I have made this recipe twice now. It is fantastic gazpacho...and so easy! I followed the advice of several other reviewers--dropped the OJ down to 1 1/2 c, blended the garlic cloves in with the mango and OJ, added about 1/2 T freshly grated ginger, and 1/2 tsp chipotle pepper flakes. My husband commented last night that this dish needs to be on heavy rotation while mangos are in season!! Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "SO GOOD! The only change I made was to puree the garlic and lime juice w/ the magoes, o.j. and evoo b/c I didn't want chunks of garlic in there and I wanted the lime juice to be well incorporated. This had great, fresh flavor and was a wonderful use for some over-ripe mangoes....so pretty too! I would make this again! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "Wow. This was even better than I was anticipating. I did make a couple of alterations for convenience and taste. I used a bit more than two cups of mango to finish up 2 mangoes and to make it thicker. I sauteed the garlic in the olive oil as I am not comfortable with raw garlic and skipped the onion since I was serving this to someone with an onion allergy. I'm pretty sure I forgot the lime juice and I think that would have added to it but it was wonderful anyway. I was glad to have help in the kitchen with all of the chopping. This was a bit of work to put together but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Doyle"
},
"reviewBody": "This was a great summer recipe and very refreshing. The only thing I would offer here is depending upon your knife skills, this recipe might take a bit longer to prep than suggested. I do not cut quickly, so it took me about 25 minutes longer to prep. The dish went over very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Stewart"
},
"reviewBody": "Delicious and I used Trader Joe's frozen mango which made it pretty easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "griebelecooks"
},
"reviewBody": "We just did made this recipe last night, and it turned out so well! We left out the chopped veggies and put them on a plate so everyone could garnish as desired. We also put in a little less oj than mango as we wanted to taste the mango more. Such a flavorful delight!! And so refreshing on a hot summer night. We will be incorporating this into our summer soups! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cassyl"
},
"reviewBody": "Very refreshing and super-easy, with a nice blend of flavors -- perfect for this summer heatwave. I added ginger and a bit of curry powder for an extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linda2d"
},
"reviewBody": "This was very different for me but surprisingly good. I'm not a big mango fan but like everything else so gave it a try. It's an interesting flavor blend. The cucumber was the only thing that I would possibly reduce next time. I used the cilantro and thought it added a nice brightness. The only changes I made were leaving out the oil and using way too big of a jalapeno. Therefore mine ended up a little too hot but I think I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lleblanc24"
},
"reviewBody": "Loved this recipe. I'm not that crazy about gazpacho to begin with, so I thought the mango variation would make this more appealing for me. Turned out great; I added some corn because I had some on hand (and I just really like corn), and it complimented the other flavors pretty well. I also used basil, though I think cilantro might have added a stronger flavor. Cut back on the OJ like everyone said to 1 1/2 cups. The only bummer was that it didn't make as many servings as I had hoped. I used this for a main meal (and I guess I eat more than most), and it made a very generious two servings. Next time will double the recipe. Delicious! Very refreshing on a hot day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Wenger Woodburn"
},
"reviewBody": "Delicious!! I was looking for a nice summer soup to serve to my vegetarian boyfriend and this looked like just the thing. I followed the recipe exactly except for the jalapeno -- astoundingly, when I went to the store here in New Mexico I couldn't find one (???) and so bought a Fresno pepper. I think the jalapeno would have changed the flavor for sure, but we got the heat we needed from the Fresno. All in all a very tasty soup that only gets better the longer it sits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dandy4411"
},
"reviewBody": "Great recipe if you're a gazpacho lover and want a fruity twist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RocketDoc"
},
"reviewBody": "Unique soup that I enjoyed, but had mixed responses from my other family members. The base recipe is a little heavy on the orange juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveNewRecipes"
},
"reviewBody": "It is tasty and interesting. Make sure you cut the vegetables small enough. Ours were a little too big. I had to add extra mango since the orange juice flavor was a little overpowering. A fun summer soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STEVIELYNN"
},
"reviewBody": "I thought this was almost fabulous. Too much onion and cilantro - will cut back next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valkyria"
},
"reviewBody": "Wow, this recipe is amazing!! What a delightfully different taste of summer!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Popejoy"
},
"reviewBody": "Delicious! I also lightly broiled a flank steak, marinated w/cinnamon, crushed red pepper, cumin and chili powder and added strips of it cold whenever I served a bowl (i did not put the med-rare steak in the actual big bowl of soup). It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pinkypink"
},
"reviewBody": "I actually like this on better than Pam's other recipe for Watermelon Gazpacho. This one is definitely more sweet than savory. I used about 5 really ripe mangos. I found it a bit too sweet because the mangos were really ripe, so I added a small can of coconut milk. Other than that, I followed this exactly. Oh, and contrary to any tomato gazpacho, this one doesn't taste that great the next day. I had a little bit leftover and it wasn't as good as when prepared fresh. I'll definitely make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quentin"
},
"reviewBody": "wow, this was great. It disappeared quick; I can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LauraJayAlbert"
},
"reviewBody": "I loved this! Sweet, spicy and refreshing!...Some had asked how to make it thicker-I used Orange Juice with \"lots of pulp\" which gave it a great thick texture. I hope that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "extra lime juice and chilies make it especially tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mollie Hyman"
},
"reviewBody": "Superb! Very tastey. I blended the garlic,jalepeno and lime juice with the mango, OJ and olive oil. Also I added a healthy shot of salt which I think really made the flavers pop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari Ann"
},
"reviewBody": "Fantastic! I have 13 mango trees on our island in Panama and sometimes don't know what to do with them all... I added Papaya as well (both in the blended mixture and little chunks stirred in with the other veggies) Great Job!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy"
},
"reviewBody": "This recipe is definitely a keeper, great for a light summer meal. Even the picky palates of my fiance and my roommate enjoyed this recipe. I served it with crusty french bread and Riesling. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissTessaMelissa"
},
"reviewBody": "I really liked this. I added some cooked shrimp to it to make it heartier. Great idea. I served it at a party where we had an almost tropical theme. It went really well with some pineapple and Mahi kabobs from the grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Kasz Willmarth"
},
"reviewBody": "This is so amazingly refreshing!!! I didn't have jalepeno's but I can't wait to taste it with those in it. I also had to use roasted red peppers in a jar. I added both cilantro and basil!!! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ayk"
},
"reviewBody": "Creative and fun use of mango! I think it would be awesome on some kind of fresh wrap. The mango is such a great base. It almost tastes like a dairy or cream base! Love the basil- it leaves a wonderful after taste. I wonder, how could I thicken it up a bit? It was a little watery. But I enjoyed this very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "purple-girl"
},
"reviewBody": "This was amazing exactly as written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie"
},
"reviewBody": "I'm not a cold soup fan, but this was awesome! It does taste like summer. I like that you can tweak it with the hot pepper..I'll make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corinne Thompson"
},
"reviewBody": "This tastes like Summer! I put all of the ingredients into a large pot (the size you would cook spaghetti in). I blended the mango, orange juice and olive oil first with a hand blender, then added the rest of the ingredients and used the hand blender for that as well. If you want some texture, leave part of the ingredients out and stir in at the end. I opted to use cilantro and it tastes wonderful in the soup. I used pre-sliced mango from Costco and it saved alot of time. Definitely try this. It sounds strange but tastes delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay H"
},
"reviewBody": "This is a terrific, fresh version of gazpacho. I love a mango salsa, and this was a great alternative. Not too sweet or too onion-y! I used canned mangoes in their own juice, and only about 1/4 of a jalapeno since I'm a wimp. :) I'm serving the leftovers tonight with Margarita Shrimp. Mmm. Try this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire Polis Mott"
},
"reviewBody": "This was WONDERFUL! A wonderful combination of flavors. I followed to the tee, except didn't use the cilantro/basil and used a few jalepeno slices from a jar - minced. The first time I made this as a trail, ended up eating it ALL myself. Doubled it for Bunco the next time, and everyone loved it. I had a little left over, it got pushed to the back of the fridge, and it was still delicious a week later!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kym Cox Surridge"
},
"reviewBody": "This is a good combination of flavors. I added avocado for more texture, and it was a nice complement. I used basil because I had extra, but I think the cilantro would be more flavorful (really couldn't taste the basil). I blended in the herbs, garlic, and half the jalapeno. Next time, I'll add a bit of cumin; it would go well with these flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOORES0"
},
"reviewBody": "This was both beautiful, delicious, and unique. I've had several Gazpacho's before, but never one quite like this. I will definitly make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Matt Grifo"
},
"reviewBody": "This recipe just was not for me I failed to find the blend between the sweetness of the broth and the crunch of the raw vegetables. That being said my family LOVED it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNYHAY71"
},
"reviewBody": "Superb! The flavors are amazing. The cilantro and jalapeno are a must. I just used a regular cucumber and seeded it. I may add chopped jicama next time. Thanks so much for the light, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RNESIN"
},
"reviewBody": "I found it very satisfying on some hot Texas days! Interesting flavors - cukes are good in everything! Ditto for cilantro (which was my herb of choice for this recipe). Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "I ended up making this and not serving it. There were just too many flavor combinations going on for me. The color is pretty, and it is refreshing, but I think that the OJ might have over-powered it too much to be really enjoyable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie C."
},
"reviewBody": "This would be a nice refreshing first course to a grilled shrimp dinner. I added more lime juice and used cilantro. The flavors blended nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlys"
},
"reviewBody": "Yummy! I listened to the other reviews and didn't put in any oil. I diced some of the cucumber and pepper more finely than others (with one of those dicer tools) and it added more texture since the chunk sizes were all different. Excellent! Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChanaLeah"
},
"reviewBody": "As a matter of personal taste, I put everything in the blender, after trying it according to the recipe; either way I give it five stars. A unique twist on the original, and very refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly"
},
"reviewBody": "I love this recipe. Here in Phoenix in the summer, the temps can reach 110 degrees. This soup is perfect for those too hot to cook days. I've varied this by adding a banana or a peach. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a wonderful Soup! I made this for about 20 people and everyone was delighted with it. I had never made cold soup, so when I first read the recipe I was a little worried that the onions, garlic and so on were not cooked or sauted before putting them in the soup. It was a very HOT day so I followed the recipe to the letter and it was wonderful. This is a real energizing soup. My husband called it Live food. I bought the Mango prepeeled and pitted. It was well worth the extra cost. Because of time, I put the soup in the freezer for about an hour and half before serving it. I will definately be experimenting with other Gazpacho recipes. It is easy and very tasty. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "I've never tried Gazpacho of any kind but this looked interesting and it was! I really enjoyed it but wish I'd paid closure attention to 2 TBS of parsley - went a little over board."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Yum! I've made this twice now and I recommend adding basil instead of parsley, but that may be my personal preference for basil. I also felt the orange juice was too strong, so I cut it to 1 cup and added 1 cup of water the second time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Maggie!"
},
"reviewBody": "I am not a fan of mango so i made this recipe with peaches. I don't know what kind of overall difference it made, but I found the gazpacho to be bland and boring, even with the added jalepeno."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMVINTAGE"
},
"reviewBody": "Delightful is right! I was out of fresh red peppers so I used a roasted red pepper from a jar, other than that I made no alterations. I did add one jalapeno &amp; loved the bit of heat it added...I think next time I might even add 1/2 of another. I chose to use the fresh parsley, although I think basil would be nice also. I was going to make this a first-course but decided this would make a better partner to the meal so I served it w/ Grilled Halibut with Cilantro Garlic Butter, some leftover rice frome a stuffed grapes recipe &amp; homemade italian bread, cooked on the grill &amp; served w/ infused oil. Pinot grigio paired really well but then again I like it w/ just about everything. LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernice Phillips-Ingram"
},
"reviewBody": "Delightfully different!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76988/mango-gazpacho/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14767/soups-stews-and-chili/soup/vegetable-soup/gazpacho/",
"name": "Gazpacho Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76988/mango-gazpacho/",
"name": "Mango Gazpacho"
}
}
]
}
}
, "about": [
]
}
]