				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Manicotti Alla Romana"
,"datePublished": "2019-04-02T02:43:06.000-04:00"
,"dateModified": "2022-10-21T23:28:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "markblau"
,"url": "https://www.allrecipes.com/cook/128051"
}
]
,"description": "This rich meat, spinach and cheese filled manicotti dish is covered with white and red sauces. It takes some time to prepare, but is well worth the effort!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FUOF4ECMNnkIdbpLo0_KQXAymJI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/818353-manicotti-alla-romana-Jessica-Allmond-4x3-1-05250ffb4f184e73851622a13d1f70ce.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Manicotti Alla Romana"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "944"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "612 kcal"
,"carbohydrateContent": "59 g"
,"cholesterolContent": "134 mg"
,"fiberContent": "6 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "992 mg"
,"sugarContent": "13 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"2 tablespoons olive oil",
"0.5 cup chopped onion",
"6 cloves garlic, finely chopped",
"1 pound ground beef",
"salt to taste",
"1 (10 ounce) package frozen chopped spinach, thawed and drained",
"1 (12 ounce) package manicotti shells",
"2 cups ricotta cheese",
"2 eggs, beaten",
"3 cups spaghetti sauce, divided",
"2 tablespoons butter",
"2 tablespoons all-purpose flour",
"2 tablespoons chicken bouillon granules",
"2 cups half-and-half",
"0.25 cup chopped fresh parsley",
"1 tablespoon chopped fresh basil",
"0.5 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a large skillet over medium heat. Saute onions until translucent. Saute garlic for 1 minute and stir in ground beef. Cook until well browned and crumbled. Season with salt and set aside to cool."
} ,{
"@type": "HowToStep"
,"text": "Cook spinach according to package directions. Meanwhile, bring a large pot of lightly salted water to a boil. Add manicotti shells and parboil for half of the time recommended on the package. Drain and cover with cool water to stop the cooking process and prevent the shells from cracking."
} ,{
"@type": "HowToStep"
,"text": "To the ground beef mixture add the cooked spinach and ricotta cheese. When the mixture is cool, add the beaten eggs. Spread 1/4 cup spaghetti sauce in the bottom of a 9x13 inch baking dish. Gently drain the manicotti shells and carefully stuff each one with the meat and cheese mixture; place shells in prepared dish. Lightly cover the dish with plastic wrap or a clean, damp towel to prevent shells from cracking."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Prepare the white sauce by melting the butter in a small saucepan over medium heat. Stir in flour and chicken bouillon. Increase heat to medium-high and cook, stirring constantly, until it begins to bubble. Stir in half and half and bring to a boil, stirring frequently. Cook for 1 minute, stirring constantly. Remove from heat and stir in parsley. Pour or ladle the sauce evenly over the stuffed shells."
} ,{
"@type": "HowToStep"
,"text": "Stir the basil into the remaining spaghetti sauce. Carefully pour or ladle spaghetti sauce over the white sauce, trying to layer the sauces without mixing."
} ,{
"@type": "HowToStep"
,"text": "Cover and bake for 40 minutes. Remove from oven, uncover and sprinkle with Parmesan cheese. Bake, uncovered, for 10 minutes more."
} ]
,"recipeYield": ["7"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it with heavy cream instead of 1/2 &amp; 1/2 like a previous review! Omg! So rich and decadent! Good as any 5 star restaurant! My Italian husband said it was the best he's ever had! Also used mild Italian sausage in place of hamburger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mom2Boys827"
},
"reviewBody": "I've made this recipe many times over the last 5-10 years or so. With my modifications, it is one of my favorite meals. These are my modifications: 🔹️I use Better than Boullion chicken base (2TBS) for the white sauce instead of regular boullion. 🔹️Prego, the kind with sausage , right out of the jar, I don't heat it on the stove or add basil before just pouring it on. 🔹️Instead of ground beef, I use mild Italian ground sausage. 🔹️Oh and when I don't care how it looks, I use jumbo shells instead of manicotti noodles because they are easier to fill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I last made this around 30 years ago, lost the recipe and this is the one I chose. I added some shredded mozzarella to the white sauce as a tweak because, well, cheese. It took a little longer because I have limited prep space but worked out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coreen R"
},
"reviewBody": "I used lasagna noodles because I couldn't find manicotti shells, otherwise I followed the recipe exactly and it was fabulous! I will definitely make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "4.5 stars. I changed the meat to 1/2 ground beef &amp; 1/2 sausage. Also put the tomato sauce on the manicotti first, and ribboned the white sauce over the tomato sauce. I found the method of stuffing the shells with a plastic bag more difficult than just stuffing the shells by hand. I used cottage cheese instead of ricotta. The meal was rounded out with Zuppa Toscana, roasted asparagus and focaccia bread (all from this site). Italian wine was the finishing touch to this Valentine's Day meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice M Baker"
},
"reviewBody": "This is a great recipe, and pretty easy to make, just a little time consuming. I found using hamburger meat left the flavor a little bland, so I now use ground Italian Sausage for a more robust flavor. I also much prefer using heavy cream instead of half and half, as I like that texture and flavor profile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinMama23"
},
"reviewBody": "This is insanely good! I substituted 1 of the two cups of heavy cream for evaluation milk because I ran out of heavy cream! Everyone loves this! Second time making it! My boss requested i make it for her!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junebug"
},
"reviewBody": "I thought this was excellent. I made my own Ricotta cheese, which easy and good. I liked the ricotta and spinach combination. I used half ground beef and half sweet italian sausage in the mixture, and I topped it with red sauce - no white. It was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skinny Baker"
},
"reviewBody": "Truly delicious recipe-you will not be disappointed! I used homemade manicotti and only two substitutions: ground turkey in place of beef and cottage cheese in place of ricotta. Highly recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul G"
},
"reviewBody": "So, I ordered all the ingredients from my local grocery store by curbside to go...you know, pandemic and all. Anyhow, they were out of Manicotti so they suggested substituting Shells instead. Long story short, followed the recipe verbatim with the exception of the aforementioned pasta and made a tasty Stuffed Shells Alla Romana."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Becky Chester"
},
"reviewBody": "I had left over ricotta so wanted to find a recipe so I could use it up. Stuffed shells sounded like a good option. I couldnt taste the meat in the stuffing mix. I thought the white and red sauces layered on top one another was strange but I'll give almost any food a try. I didnt like the white sauce at all and didnt like the two sauces layered either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lov_2_cook&eat"
},
"reviewBody": "Okay recipe. I added REAL parmesan regiano, mozzarella and pecorino cheese (no pre shredded, it really does change the flavor and melting ability) to the bechamel and the ricotta. It was pretty bland without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashleigh Jean"
},
"reviewBody": "This was delicious! I had to substitute the ricotta for lactose free mozzarella cheese. I did cup for cup and it turned out beautifully! I found there was so much white sauce left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat J"
},
"reviewBody": "Such a delicious recipe! It takes a little bit of prep work but well worth the effort. Followed the directions for the most part outside of not measuring some ingredients exactly (which who cares, we’re cooking here guys) and it cake out great... my wife had 2 servings and is already talking about making it again! This will definitely get added to the dinner rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Franke-Everette"
},
"reviewBody": "Yum! Added a little mozzarella to the filling and the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillemom"
},
"reviewBody": "This was delicious. I made the noodles using the recipe on this site for manicotti noodles. The noodles were super easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Carlson"
},
"reviewBody": "I almost always tweak recipes to fit our tastes, or what I have on hand. We didn’t have manicotti shells so decided to use lasagna noodles. I used the no-cook style but precooked them for just a few minutes to make them pliable because I wanted to roll them. I used 2 lasagna shells the short way, rolled each around a good butcher shop sausage and secured them with toothpicks. We used 4 sausages. It was messy to prepare them but they turned out great. I thought there would be too much sauce for the recipe but it was just right. The recipe was delicious! We are retired seniors so in an effort to eat less, we had enough for 4 meals; I froze 2 meals and will have the second meal this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "These were better than any manicotti dishes I’ve had in Italian restaurants! I used large shells instead of tubes because they are easier to fill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MANDT2"
},
"reviewBody": "This was good, but I totally agree with reviewers who said the 2 tablespoons of chicken bouillon granules made it WAY too salty. I can't help but wonder if the \"2 tablespoons\" is a misprint, since 2 teaspoons of bouillon granules is typically the manufacturer's recommended measurement for 2 cups of liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindaAasen"
},
"reviewBody": "Amazing! And..no work at all! I started to make this and asking my husband to chop the onions. He started on the onions while I gathered the garlic.\nThen he said, \"You have other things to do, I'll make the manicotti.\" Wow! I left the kitchen immediately and later returned to thoroughly enjoy this tasty dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bett"
},
"reviewBody": "Loved this recipe. Made enough to freeze for dinner for 2. Like others I substituted ground hot Italian sausage meat for the ground beef and I used chicken broth that I always have on hand from the many chickens I cook in making homemade dog food. Definitely worth the time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D4Say"
},
"reviewBody": "Wonderful! I've made this several times and is always worth it. I made it today for someone that doesn't eat meat so I substituted mushrooms. I liked it better than with the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "I loved this Manicotti. I've never had it with meat, spinach or a white sauce. Takes a little time and can be messy but I love to cook and it was fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan Mendoza"
},
"reviewBody": "i am currently making dish dish now i was short on couple things but having some knowledge of cooking rearranged the flavors but thank you for the idea of this dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooking mom"
},
"reviewBody": "Used 1/2 hamburger, 1/2 sausage. I made the beef mixture the day before and put in fridge. Noticed it was so much easier to stuff the manicotti when the mixture is cold. \n\nI only use 8 oz of Manicotti which is one box. I do end up with some filling leftover. I cover with the same amount of sauces. Family of three eats it all in 3 days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cindy roach"
},
"reviewBody": "This was very tasty but I found the filling to be on the dry side. When I make it again, I am going to try to remedy this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Only problem was I used a jarred sauce instead of the recommended sauce and it made the dish salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rmjones39"
},
"reviewBody": "Only problem was I used a jarred sauce instead of the recommended sauce and it made the dish salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holli Gaghan Holt"
},
"reviewBody": "I followed the recipe to the letter and OMG.... DELICIOUS!!!! My husband gave it a 10 out of 10! We will definitely be making again. I think we might try what another user suggested and mix the ground beef with some sausage! This was also a hit with my kids and the leftovers the next day might have even been better than the first night's serving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lorraine"
},
"reviewBody": "Love the idea of cutting the manicotti! Make it so quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy s"
},
"reviewBody": ". it is a tried and true recipe that everybody loves! Soooo goood! Mine made two 13x9's........ I always overcook. give it a try, you'll love it.\n i do make my own red sauce tho."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Cummins Burge"
},
"reviewBody": "The Italian man in the house thought these were fantastic. So, I’ll definitely make them again. Prob just half the recipe as the whole was too much for the two of us. It was easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chantel Murphy"
},
"reviewBody": "This is a great recipe! I only made two modifications: I used spicy pork sausage instead of hamburger and used about half of the packet of spinach! Makes for great leftovers too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MICHK35"
},
"reviewBody": "We used lean ground beef but next time will use the Italian sausage which would give a bit more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S.M."
},
"reviewBody": "I made this exactly as stated several times. I eventually switched the Manicotti for Giant Stuffed Shells, only because stuffing the manicotti took so long. It is as good and so much quicker and easier to create."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lazor"
},
"reviewBody": "Absolutely amazing. First time I've ever made it and it came out beautifully. Though points off myself for adding the basil to the sauce since the sauce was already herbed up. Will be adding this to my regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Eric Hudnall"
},
"reviewBody": "I followed the recipe exactly and my family all found it really lacked flavor. We didn't even keep the leftovers. If I tried it again would substitute Italian sausage for the hamburger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russ Thielen"
},
"reviewBody": "I've made it quite a few times and we prefer sausage over beef but love it! I use a bit more butter and flour in the white sauce and chicken bouillon to taste. Also to stuff the shells clip the corner off of a sandwich bag put the filling in and squeeze it into the shells. It makes it super easy and quick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clay Dixon"
},
"reviewBody": "I made it my way. I used homemade crepes, instead of, store bought shells. I used three cheeses(Ricotta, Shredded Mozzarella, grated Parmesan). I used Three Cheese Marinara Sauce instead of Tomato Sauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Boyce"
},
"reviewBody": "This recipe was lit. I did half beef, half italian sausage. It was fire af."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ricke"
},
"reviewBody": "Takes a bit of prep, but would make again. Flavor lacked some kick, so next time I'll add some spicy Italian sausage to the mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ycnaf-Jbob Nospmoht"
},
"reviewBody": "Crazy delicious! My hubby and I made this together last night. I think next time I am going to try to add artichoke hearts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanda Aurandt"
},
"reviewBody": "Used stuffed shells instead of manicotti and put in 8x8 pan. Otherwise followed recipe exactly. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "After reading reviews, I also used half spicy Italian sausage and half hamburger and then made as noted. My kitchen did look like a disaster area after all the prep, but this dish was well worth all the dirty dishes. My hubby raved about this one. Made a use batch so looking forward to leftovers for the next couple of days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Norris"
},
"reviewBody": "The sausage as many have said really makes this meal a 5 star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Gobeil"
},
"reviewBody": "I used this recipe to make stuffed shells. I used\n1-1/2 lbs ground beef and everything else stayed the same except pasta. I didn’t make the sauces. \nIf I was to make manicotti I would still use more ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used this recipe to make stuffed shells. I used\n1-1/2 lbs ground beef and everything else stayed the same except pasta. I didn’t make the sauces. \nIf I was to make manicotti I would still use more ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christie"
},
"reviewBody": "Made it exactly as called for. Very good. It does take a lot of time but worth it. Think I will try some Italian sausage with ground beef next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "preacherswife"
},
"reviewBody": "This.is.beautiful. It is so yummy, you’ll think you’ve gone to Italian heaven! I do add a Italian sausage when browning the ground beef. At this time I also add a tablespoon of oregano, 1/2 a tablespoon of Italian seasoning, and a sprinkle of garlic salt. I like my dishes cheesy so I add a cup of mozzarella and grated Parmesan to the mixture too. Piping it in the shells makes it easier. I ended up with two pans of manicotti- one to eat and one to share! Thank you for the besciamella recipe- this wonderful white sauce is so delicious! Italians add a sprinkle of nutmeg to it right before topping it on the shells. I did too, and yeah, it’s good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyDustinDrake"
},
"reviewBody": "One of the best recipes that I have made from this website. LOVE IT! Made as is, no changes needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patriot / Kenneth Burlingham"
},
"reviewBody": "Awesome dish! The taste magnificent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmmaria"
},
"reviewBody": "I love this dish and get rave reviews every time I make it. I do sub out the ground beef for Hot Italian Sausage because we love the extra spice (and seasoning). I also do not pre cook the manicotti shells, no need. I use a plastic bag with the filling to pipe into the shells. Easy and SOO delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Fantastic! I did make a few changes: Mild Italian sausage instead of hamburger, small can of spinach instead of frozen, 14 manicotti shells (not enough filling for more), 1 tsp. chicken Better Than Bouillon, 1 cup Parmesan. I also made homemade marinara instead of jarred spaghetti sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ttk"
},
"reviewBody": "Followed exactly, brought to Christmas dinner. Many family members asked for recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessmcgett"
},
"reviewBody": "if doubling, dont double the chicken bouillon! I just made that mistake and it was waaaay too salty. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blancanieve"
},
"reviewBody": "I used chicken &amp; mozzarella sausage (ground in my food processor)...definitely a keeper!! This recipe made enough for one 9x13 pan and a 9x9 pan which I froze"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinct"
},
"reviewBody": "This was a nice meal. I highly recommend following the advice of others by substituting ground sausage for the hamburg. Also, definitely make the white sauce. It added a deeper flavor to each bite, making this a unique and tasty recipe! I will make this again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamala Hawks"
},
"reviewBody": "Love these make enough to freeze"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christie"
},
"reviewBody": "It was a bit dry in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jsleopold"
},
"reviewBody": "Made this dish several times for special occasions and it is amazing. Everyone loves it. Most of the time I double the recipe because we want left over:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzzame"
},
"reviewBody": "Exactly what I was looking for! Took others suggestions and made with half Italian Sausage and half beef, and only used half (1TBL of chicken bullion) but other than that exactly as written and it was beyond delicious! Cream sauce really does make it over the top. I piped my filling into the shells and I don't know if it could have been any faster by cutting them open and filling, because piping was fast and easy. Make this dish and you won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dobinky"
},
"reviewBody": "This was very good. No changes needed to the recipe. Just make sure to take some cooking time off of the manicotti. I had a hard time not breaking the tubes while stuffing. I made extra of the filling and froze it. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mstop1"
},
"reviewBody": "This is by far the best Italian dish I have ever made!! It is a bit of work, but so worth it!! If I could give it 10 stars I would. Secret for making a little easier. Cook manicotti in salted water just until the pasta becomes soft 2-3 minutes. Working quickly cut the pasta lengthwise and fill with meat mixture and place in pan cut side down. So much easier than trying to \"stuff\" and no one is the wiser. I also use Italian sausage (sweet or hot) whatever your preference is in place of some of the meat. About half and half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4everACityBoy"
},
"reviewBody": "Followed the recipe as written. Perfect and subtle blend of flavors. I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emjai2003"
},
"reviewBody": "Nex time, I will add some finely chopped veg (peppers, broccoli, mushrooms) to the meat mixture. I would also add more spaghetti sauce/tomato sauce. Lastly, I would triple the amount of basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MN Steve"
},
"reviewBody": "great recipe. it has a long prep time but it is worth it in the end. my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doyle"
},
"reviewBody": "AMAZING! Followed the recipe to a T and it turned out fabulous! This one has been added to the go to dinner recipe folder!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Gallagher"
},
"reviewBody": "My husband asks for this to be cooked for special occasions. It is definitely restaurant quality. Actually, we went to olive garden and my husband thought this recipe tasted better. I made it exactly as the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Chef Esh"
},
"reviewBody": "I loved this recipe, I used 50% hot Italian sausage and 50% ground beef, and it had wonderful flavor! I froze half the shells without the sauce for a quick and easy dinner some week night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SWAN Norton"
},
"reviewBody": "I have made this recipe several times, and it has evolved a bit. I make it more like a baked ziti so that I can skip the stuffing step. I mix the ziti and spinach/meat mixture, place into the baking dish and top with the red and white sauces. At this point the meal can be frozen for future cooking or cooked and enjoyed then. A delish meal any way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "baseballmom3"
},
"reviewBody": "I made it with fresh spinach. I love fresh. I never use frozen. Such a delicious meal. Best of both worlds with the cream sauce and red sauce. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Jackson"
},
"reviewBody": "WOW!!! First of all, I don't just go around handing out 5 stars all willy nilly! However, this recipe is VERY deserving of the 5 stars!!! The only change that I made is that I used mild Italian sausage. I also used a very, very good store bought marinara(Publix had it on bogo)La Famiglia Del Grosso is the brand and it is really,really good. Make this, it takes a good bit of time, but it is totally worth it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eappro"
},
"reviewBody": "After the first time, I left out the white sauce because I didn't think it added anything to the recipe other than looking nice. I also use Italian sausage rather than ground beef, but that is just our preference. If you find that this recipe makes more filling than you have shells for, you can always put the sausage in the sauce that goes on top rather than in the filling mixture the next time you make it. I now buy two boxes of pasta shells so I have a few extra to use up all the filling. Great recipe with a couple small changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank Howard"
},
"reviewBody": "It tastes sooooo great! It's even better the day after you cook it. This recipe is perfect as is"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Kulsar"
},
"reviewBody": "This recipe was a great recipe. I didn't care for the white sauce it reminded me of chicken gravy, but my family loved it! Next time I will follow the same recipe again and try with Alfredo sauce to replace the white sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Basia Czaplinski"
},
"reviewBody": "Yum :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "Made this for Christmas Eve 2015 and used spicy Italian sausage instead of ground beef. I sort of halved the recipe as I had a box that was 12 oz. of manicotti (14 of them) and I only had 0.65 of a pound of meat. I went ahead and used 2 cups of whole milk ricotta since I was using no spinach. I will say the filling was a little runny. It all tasted good but would have been better if the filling was stiffer. Using half of everything listed (except the ricotta), it filled 11 of the manicotti shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gibby"
},
"reviewBody": "Made it for visiting family, all just loved it and even remarked the next day! The two sauces together were fantastic too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "Very Good. I didn't have chicken bouillon granules so I substituted 3 teaspoons of chicken base for the white sauce. Italian sausage is a good option as well as some mozzarella sprinkled on top of the parmesan cheese. Thanks for the submission."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "velda"
},
"reviewBody": "Liked this a lot. It did take some time but worth it. Add some italian sausage to spice it up. Also left out chicken bouillon cuz I did not have any but it did not seem to make a difference. Will be trying this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cblwolf"
},
"reviewBody": "I made the recipe as written, except I substituted sweet Italian sausage for ground beef. It was good, but given the amount of work, I don't feel like the taste was worth the work. I would rather have manicotti stuffed with an easier cheese filling.j"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvester La Macchia"
},
"reviewBody": "This recipe is great! I substituted the ground beef with bulk spicy Italian sausage. Makes it a little richer with a slight tang!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dabora"
},
"reviewBody": "I have made this dozens of times, one of my favorite recipes! The only things I changed was using Italian sausage and some days I had a difficult time filling the shells. Now I just skip the worst of the mess and fill them hard and bake it a bit longer. Turns out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juan"
},
"reviewBody": "Followed the recipe and it was AWE TO THE SOME!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ljprecious1"
},
"reviewBody": "Changed out the beef for Italian sausage and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenidye"
},
"reviewBody": "I don't normally review recipes (though I should because that's how I find such good ones from here). This recipe is perfect except sub ground beef with Italian pork and it will blow your mind!!! The white sauce is so insanely good I want to figure out other ways to use it. Yummy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne M Erskine"
},
"reviewBody": "OUTSTANDING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TWFME57"
},
"reviewBody": "Fabulous! I had a bit of stuffing left over so went back to the store the next day, bought another pack of noodles, and made up a smaller dish to freeze for another night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathanial Hale"
},
"reviewBody": "This is great but took me alot longer than 50 minutes. Give some extra time if youve never made this before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Hamilton Ulmer"
},
"reviewBody": "For anyone who thinks stuffing manicotti is a challenge, try putting your sit puffing into a ziplock bag and clipping a corner off. It works just like a piping bag. I liked this recipe with Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarlingDash"
},
"reviewBody": "I realize that there are some members of this community that don't like it when you rate something 5 stars when you make changes. I wish to politely disagree. I always read the reviews before I make something from this site. I consider myself a good cook but I always learn something from you guys and gals. This turned out fantastic and everyone loved it. It is a ton of work. Lots of steps. I used all Italian sausage, fresh spinach, fresh parmesan and a little mozzarella in the shell stuffing mix. I used one and a half cups Ricotta as I am not a big fan. I made the white sauce as recommend by so many reviewers with only one tablespoon bullion and added some fresh grated parmesan to it as well. I used a homemade tomato sauce that is a family favorite. There is enough stuffing to do another box of Manicotti shells. So it is in the freezer. It was delicious. Other than using the left overs for a second batch, I would only attempt this again for special occasions, just because of how much work it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Rominger"
},
"reviewBody": "Fantastic! I used a higher quality marinara sauce and mixed a bit of cottage cheese and parmesan cheese into the cheese mix. When I make this again, iI will not add as much bouillon as recipe calls, it was a bit salty. Great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meechy"
},
"reviewBody": "LOVED this recipe!!!! It was absolutely delicious and everyone who ate it was crazy over it. I took the advice of the reviewers and used 4 mild Italian sausage and 1/2 lb ground beef. I used Classico garlic and onion for sauce and used much more basil and parsley. The white sauce was terrific. I was afraid to try it but it really makes the dish. I used 2 chicken bouillon cubes for this. I also added a bit of Parmesan cheese to the mixture as another reviewer did. The shells were not hard to stuff at all with the zip lock method. I will definitely be making this regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Era"
},
"reviewBody": "I made it for dinner last night &amp; guests and husband loved it. Followed the suggestion of previous reviewers and substituted ground beef for mild Italian sausage. I also made everything the night before and placed in the fridge and just baked the next night. Very very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget B."
},
"reviewBody": "I made this as is, but added a little Italian seasoning. It was so so good. My mom has made manicotti as \" her dish\" on special occasions; this blows hers out of the water!! I can't wait to make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corey Harvey"
},
"reviewBody": "This is the best recipe ever! I've made it per the directions and with recommended changes and it's always awesome! This should be the number one recipe on Allrecipes! YES! I am that excited about this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Really tasty - made it pretty much like the recipe but made a cheese sauce. Not sure it's that much different from lasagne though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri Miller"
},
"reviewBody": "This recipe was delicious! It is a little labor intensive, but worth it. It makes way more than 1 9x13 pan. I made 1 9x13 and 1 9x9 pans. I still had a little filling left. Also, go easy on the chicken bouillon in the white sauce, the sauce came out a little salty. Next time I will cut down a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LTLBITZ"
},
"reviewBody": "This was very tasty!!! The changes that I made was that I subbed ground beef with ground turkey and added turkey italian sausage. Excellent recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25300/manicotti-alla-romana/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25300/manicotti-alla-romana/",
"name": "Manicotti Alla Romana"
}
}
]
}
}
, "about": [
]
}
]