				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Maple Turkey Brine"
,"datePublished": "2020-03-05T00:08:26.000-05:00"
,"dateModified": "2022-11-15T23:12:35.000-05:00"
,"author": [
{"@type": "Person"
,"name": "US92"
,"url": "https://www.allrecipes.com/cook/5561899"
}
]
,"description": "This dark sweet brine, enriched with maple syrup and whiskey, can be used on any kind of poultry and pork. It gives a sweet, maple flavor to meats."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bvUZOYPowYMqVZ_9_jC5aH6sAt8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5961920-maple-turkey-brine-Derick-Owens-4x3-1-750410a3868749dd9e034a60eefcca92.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Maple Turkey Brine"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "60"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "180 kcal"
,"carbohydrateContent": "37 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"sodiumContent": "4337 mg"
,"sugarContent": "34 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"4 quarts water, divided",
"2 cups dark brown sugar",
"1 cup soy sauce",
"1 cup maple syrup",
"0.75 cup sea salt",
"8 cloves whole garlic cloves, peeled",
"6 bay leaves",
"3 large fresh thyme sprigs",
"2 teaspoons whole black peppercorns",
"1 cup sour mash whiskey" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place 2 quarts of water in a large pot over medium heat, and stir in brown sugar, soy sauce, maple syrup, sea salt, garlic cloves, bay leaves, thyme sprigs, peppercorns, and whiskey. Stir to dissolve brown sugar and salt; bring to a boil. Remove from heat, and stir in remaining 2 quarts of water. Allow brine to cool completely before using."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie White"
},
"reviewBody": "By far the best Thanksgiving turkey I have ever tasted when I used this brine. I made it for my fiancé's family (over 15 people) and it was a huge hit. The turkey was extremely moist and very flavorful. When cooking for many people, some will always be hard to please, but this seemed to hit a home run with everyone! Will definitely be using it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was terrific. Never have I had a more flavorful or moist turkey. Try it, you'll like it.\nOf course, didn't have sour mash whiskey on hand, so substituted Irish whiskey. Probably didn't make much difference, the maple syrup is the dominant flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrkopsian"
},
"reviewBody": "I've made this as my first Thanksgiving turkey ever and it was such a huge hit that I've been in charge of the turkey every year since. This year will make year 5 and everyone is still raving about how good it is...even the people (including me) who typically don't even like turkey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "honeybeahoney"
},
"reviewBody": "not satisfied"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sassysouthernprincess"
},
"reviewBody": "I used this brine to test out smoking a turkey for the first time on my BGE. I will definitely use it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAJ Daddio The Wretched*1"
},
"reviewBody": "Smelled less than pleasing, but the bird came out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babymurr"
},
"reviewBody": "Great brine! Turkey was super moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Di Popelka"
},
"reviewBody": "I subbed a generous tablespoon of dry thyme for fresh, and we used Apple Crown Royal for the whiskey. Holy cow, was this good! (And in the Nesco roaster at 400*, the 12-pound turkey was falling apart done in just over an hour!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Great recipe. I also added bbq sauce, pickle juice and Worcestershire"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lifeforcek"
},
"reviewBody": "My whole family agrees... the Thanksgiving turkeys I've brined using this recipe have been the BEST anyone has ever had! Juicy and delicious!! \n\nI must admit, I had my doubts the first time I combined all of the ingredients. The \"unique\" smell of the brine had me questioning what local restaurants were going to be open... just in case LOL.\n\nI am happy to say that my senses were deceived and a new tradition was born. I hope it's one that will carry on for generations :)\n\nThank you for sharing this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amandap224"
},
"reviewBody": "It was sooooo good. By far the most flavorful brine yet! I couldn't get my husband and daughter to stop eating the skin lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyl"
},
"reviewBody": "We have made this brine 2x, once with light brown sugar(because I didn't have dark brown sugar) we left the turkey in for 2 days and the put the turkey on the grill with indirect heat for 2 1/2 hours. \nEach time I have loved the white meat and usually I won't touch it. The flavors and how moist it is amazing. My whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric"
},
"reviewBody": "This was excellent. It left the turkey moist and delicious. None of us could actually taste the ingredients, I'd hoped that more of the maple bourbon might have come through. But we all noted that it was one of the tastiest birds we've had in years. I will certainly use it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Daniel Dutton"
},
"reviewBody": "Wasn’t impressed at all. Too much sugar caused the turkey skin to burn. And the flavor of the meat wasn’t “maple”. In fact, it wasn’t much of anything beyond normal turkey (almost as though I hadn’t even brined. Not at all worth the time/money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Walker"
},
"reviewBody": "I have made this brine for my Thanksgiving Turkey since 2014. My brother and I competed last year - he smoked his turkey and I did my brine for 48 hours. I won! I don’t use the whiskey, so I can say it tastes fabulous even without it! The key is to plan ahead - make the brine the weekend before Thanksgiving so it has time to cool. Then soak your turkey in it for at minimum 24 hours. I always add a cup of the brine to the bottom of the roasting pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derick Owens"
},
"reviewBody": "Love this! I use Red Stag by Jim Beam Black Cherry Whiskey...Is Amazing! Cooked on the gas grill!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beatrice"
},
"reviewBody": "Delicious! This brine worked very well. I will definitely use it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon McNally"
},
"reviewBody": "This is hands down the best brine I've used for my Thanksgiving turkey. Be forewarned, the prep is nearly unbearable. As soon as the bourbon hits the brine, your house will smell like the aftermath of a frat party. My family nearly revolted. But the taste is incredible. I smoked my turkey over cherry wood, and the result was beyond a doubt the best Thanksgiving main course anyone in the family had ever had. I prepared my brine a day ahead, to let all the flavors marry, and brined the turkey for about thirteen hours. The flavor was pronounced without being overpowering, and the smoke was a perfect accompaniment. As another commented suggested, place the garlic bulbs and thyme in the cavity while cooking. I will be using this brine again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susy"
},
"reviewBody": "This is my go to recipe for thanksgiving. We brine the whole turkey for 48 hours and then put it on the smoker! Fabulous!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stevi Lynn Biehl"
},
"reviewBody": "I use this brine recipe every year for Christmas and thanksgiving turkey! My picky family loves it! It’s easy to make and makes for a delicious, moist turkey! However, I do not use sour mash whiskey, I use a Canadian whiskey. I also add a little extra whiskey and maple syrup just for extra flavor. Also, I only use 1/4 cup of sea salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorranda"
},
"reviewBody": "This is the Best Brine ever!! This is my go to recipe for turkey and chicken. We usually let soak for 24-48 hrs! Then smoke away. My hubby will rinse off bird before smoking though. It’s a smidge salty if you don’t rinse. I sometimes add more maple syrup if I want it a little bit sweeter. I recommend trying this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "I’ve been making this brine for years now. I make a few changes, but I stick pretty close to this recipe. I don’t add the soy sauce because I place a basket weave of bacon over the top of the turkey half way through the smoking process. I use Jameson whiskey and it give a nice flavor. As I stated above, I smoke the turkey for about 5 hours, basking it orange juice. Has been a hit every year and I’ve had to buy bigger turkeys every year so I can have some leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronald Driscoll"
},
"reviewBody": "i made this 2 years in a row. I did add lemon and cinnamon sticks to this adds a little flavor. Juicy and moist use a oil less fryer to cook the turkey in. First year did a 28 pond bird, this year doing a 14 pound bird. Last year everyone who tasted it said its the best turkey they have ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Brym"
},
"reviewBody": "This brine wins over the hearts of my family every year! I would suggest using Jim Beam Maple whiskey in lieu of sour mash/inexpensive. The flavor this whiskey adds is phenomenal, not to mention tastes delicious cold by itself :). Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Smith"
},
"reviewBody": "Amazing brine, use it for turkey and whole chickens. I usually don't have the whisky around so I've made it without- very delicious and doesn't smell terrible when you make it. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arne or Lisa"
},
"reviewBody": "I followed the recipe to the T. Everybody loved it. I also was a little nervous prior to making it. But it ended up being a hit. I am currently making it again for New Year's Day. Can't wait. My sister-in-law also asked for the recipe and she made it and it was also a hit. Highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillp"
},
"reviewBody": "Made this for Thanksgiving two years in a row. Came out juicy and tender. I did not include the garlic and it had plenty of flavor.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raul Ortega"
},
"reviewBody": "Very juicy and flavorful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ippygal"
},
"reviewBody": "Turkey turned out wonderfully moist, flavorful and tender. I will definitely use this recipe again. Our Thanksgiving guests raved about the turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "Made this for Thanksgiving 2015. It was beautiful and delicious! Definitely on this year's menu"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "batgrrl"
},
"reviewBody": "Favorite way to do the turkey and also pork tenderloin! i've used this brine for 3 turkey dinners and everyone just loves how tender and flavourful the turkey turns out! i just prep the brine in an 18Q stock pot and keep it in there for about 72 hrs in the fridge. I've roasted it twice in an electric turkey roaster which makes for quicker roasting time! I did a 15lb turkey, patted it dry and pushed fresh sage leaves under the skin and rubbed unsalted butter all over the turkey. Then start roasting at 450 degrees for 10/- 15 mins and turn down temperature to 325 degrees . According to a turkey site, a 15lb turkey (stuffed) turkey would take 4h 18min but with the turkey roaster it was ready in 3H 25min! Turned off roaster and let it rest in there for an hour before carving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Portia Dail"
},
"reviewBody": "Made this for thanksgiving and needless to say it was the best and the more moist turkey I've made of course my husband did the grilling ,but it is still being talked about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent"
},
"reviewBody": "I have made this brine 3 times now. Over the years I have tried many brines but this one is now my favorite. The favors penetrate the meat nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Bidelman"
},
"reviewBody": "this was the BEST brine I have tried and will be using it again. its easy to make, tho the smell is something else when first making it. my family kept questioning me if it would be good or not. need less to say everyone LOVED it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "Wow! The only change was using only 1/2 a cup of whiskey. I made a turkey breast for Thanksgiving and used this brine overnight. I received several comments that it was the best turkey they'd ever had and I have to agree. Even the sandwiches the next day were super juicy. I believe Thanksgiving dinner is way to much fuss for the payoff, but if I ever have to cook another turkey I'll be using this again because it was the best part of the meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "So incredibly good, I can't believe I haven't tried it before! The only change I'll make later is to add maple concentrate when making turkey, and maybe put some apple slices in the cavity for more fruity flavor. That said, it was the moistest turkey I've ever eaten, and I WILL make it again - often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SoftballUmpire"
},
"reviewBody": "I like the idea of brining, though I have never tried it; living on a farm and having two children that needed diversionary contributory activity we had syringes available and used them to inject our turkeys with various beverages. French Columbard white wine by Franzia was one o out favorites but is no longer available in 5l box. Blitz Weinhard's Yakima Red beer was another well liked flavoring. The thought of brining had never crossed our minds. It will be tried at some time, thanks for the idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I usually dry brine my turkeys but this year for Thanksgiving I wanted to attempt something different and let me just saw, wow. Amazing flavour throughout the entire bird! My only variance is that I added some maple extract, just to really let the maple flavour shine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SimpleMom"
},
"reviewBody": "It was delicious. You could really taste the maple syrup. The turkey was very moist. I made the brine on Tuesday night and cooled over night. I put the turkey in a home depot bucket with the brine on Wednesday morning and let soakk for about 24 hours. I highly reccomend this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Waterloo_Jason"
},
"reviewBody": "I had never brined a turkey prior to trying this recipe. I used to inject the bird with marinade or herbed butter to regulate the moisture. No longer. I could not believe the difference brining made in producing such a moist, flavourful turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Stephens"
},
"reviewBody": "I have been wanting to try this recipe as brining is the way to go for roast turkey. This was absolutely excellent and kept the turkey extra moist despite me slightly over cooking. Didn't change a thing and followed it exactly unlike many brine recipes. This recipe is a true keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Budman"
},
"reviewBody": "Tried it for thanksgiving 2014. Added 2 oranges and 2 lemons quartered. It was great. Best turkey ever. Not only very juicy and flavorful, but looked fantastic. The brine smells terrible but sure was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy N Lori Dixon"
},
"reviewBody": "The best and most moist Turkey we have ever had. We will use this every year!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah "
},
"reviewBody": "Best brine ever! I've made turkey with this brine several times and now I've started adding a couple tablespoons of liquid smoke and a couple teaspoons maple flavor extract to kick it up a few notches. Bake it with the maple glazed turkey recipe from this site and I have had so many people say that it's the best turkey they've ever had. I even have people offer to pay me to make their turkey for them! I quadruple the recipe and brine 2 birds at a time in a cooler checking the ice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LITTLEWPGVIKING"
},
"reviewBody": "Wowser!! A hit. Best thing about it is the terrific colouring it gives to the cooked turkey. Looked like it was perfectly done after two hours. Through tin foil on top to manage. Very moist - many comments from our guests. Should have planned better to brine longer to get full taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Webigail"
},
"reviewBody": "I rated this recipe last year about this time and still love it, I just wanted to add to the review. This year I actually had a nice big 5 gallon bucket from Lowes with a lid to Brine it in for two whole days before putting it in my new convection oven. I made a twenty pound turkey. I used some of the brine to baste the turkey, but not much about a cup. I substituted the brown sugar for a brown sugar I made with stevia instead, so basically molasses and stevia in the raw. I did double the recipe though since I needed more than original recipe called for with such a large turkey. This Brine is super delicious though. For those of you using a brine for the first time, make sure you rinse the brine off before cooking/baking otherwise the salt will overwhelm you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JesseO"
},
"reviewBody": "This is my favorite and only way I will roast a turkey or chicken now! It leaves the meat so moist! I know it may have a bad smell but it will make the best Thanksgiving Bird you have ever had! The very first time I ever roasted a bird I used this recipe and everyone raved about how amazing it was and how well I did! easy for cooking beginners as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "This is the only way we cook our turkeys now!!! Brine and cowboy charcoal!!! Nothing but rave reviews from our family and friends!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "malice32"
},
"reviewBody": "I used this brine for my Thanksgiving turkey this year and it made the most delicious bird I've ever tasted! The color was incredible, too. The maple flavor wasn't as strong as I would have liked, but the bird was so tender and juicy it didn't matter. If you're going to brine, this is the way to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystalv1olet"
},
"reviewBody": "This will be the brine that I use from now on. It was excellent. I put it together the Tuesday night before Thanksgiving so that it could chill over night and I could start brining the turkey on Wednesday. I did a taste test after it was simmering for several minutes and decided to up the maple syrup to 2 cups instead of 1 because I wanted more of a maple flavor. With this addition, it was perfect for my taste. The finished turkey turned out neither too sweet nor too salty and so moist. I cooked a small turkey - just under 11 lbs. and the amount of brine this reciped yielded was perfect for that. You might want to consider doubling the recipe if you are doing a large turkey. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Nail"
},
"reviewBody": "This is a great brine, the soy sauce gives the turkey a lovely rich color and the turkey was very juicy. I put the garlic cloves in the cavity for cooking and people were fighting for them! For smaller birds, use a shorter time in the brine to keep it from being too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Provost"
},
"reviewBody": "i was so nervous about this brine- my husband chose the recipe, and when it was hot it smelled AWFUL! i let it cool, and it smelled a little better, but just a little. i made just a turkey breast (though it was huge!), so i brined it about 12 hrs, then roasted it with butter and maple syrup glaze (martha stewart has a good recipe). my husband's fave holiday is thanksgiving- he took me aside to say it was by far the best turkey he's ever had. not bad for the vegetarian chef!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/219475/maple-turkey-brine/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15901/meat-and-poultry/turkey/brine/",
"name": "Brine"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/219475/maple-turkey-brine/",
"name": "Maple Turkey Brine"
}
}
]
}
}
, "about": [
]
}
]