				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Marshmallow Popcorn Balls"
,"datePublished": "2000-01-24T18:27:33.000-05:00"
,"dateModified": "2019-04-02T02:40:33.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kory H"
,"url": "https://www.allrecipes.com/cook/4086"
}
]
,"description": "These are very easy popcorn balls to make. The marshmallows make them similar to crispy rice cereal bars that are so popular. Made with marshmallows, these are sweet, crispy, and chewy. Everyone&#39;s favorite combination!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/E4_Qy-4Drat8aH2InMApbK-oE-s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/531282-82bbe4fe6db648c2bc366b1696eaf303.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Marshmallow Popcorn Balls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "213"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "237 kcal"
,"carbohydrateContent": "35 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "87 mg"
,"sugarContent": "18 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"0.5 cup unpopped popcorn",
"6 tablespoons butter",
"5 cups miniature marshmallows" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Grease a 9x13 inch baking dish. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Add vegetable oil to a 4 quart saucepan, and heat over high heat. When oil is hot, add popping corn. Keep pan moving constantly. When corn stops popping, remove from heat. Put popcorn in prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Melt butter In a medium saucepan over low heat. Stir in marshmallows and cook until melted, stirring constantly. Pour marshmallow mixture over popcorn and mix with spoon to coat evenly."
} ,{
"@type": "HowToStep"
,"text": "Let mixture cool slightly. Smear butter on your hands or spray with non-stick cooking spray. Mix popcorn with your hands so that it is evenly coated."
} ,{
"@type": "HowToStep"
,"text": "Form popcorn into 8 balls."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssblueeyes"
},
"reviewBody": "Love this recipe. I added some candied fruit and vanilla for additional flavour. Next time I would add extra marshmallow, probably 2 cups extra"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really wasn't sure if marshmallows were used in popcorn balls, so this recipe was wonderful! I just finished cleaning up and I had sticky everywhere, but I don't mind, as long as they taste good, that's what matters! I didn't put anything other than popcorn and food coloring. I did venture from your recipe, I made about 4 times the recipe of the liquid to two parts popcorn. I'm selling them. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brian McDaniel"
},
"reviewBody": "great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Harlan Shields"
},
"reviewBody": "I followed “Dung Beetle’s suggestion and added 1/4 cup of vanilla and used 16 cups of lightly buttered microwave popcorn. I mixed mini m&amp;m’s and Reese’s pieces in some of them. They were fantastic either way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shelly Tomassini"
},
"reviewBody": "Oh my goodness. What a mess. Proportions were so off"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Srwinter6"
},
"reviewBody": "Yummy popcorn balls! Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smart car"
},
"reviewBody": "These popcorn balls Are the perfect sweetness. They taste delicious and are very easy to make! They are one of the delicious highlights for a party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Sheering Brandt"
},
"reviewBody": "Turned out great. We added some orange food coloring and 2Tbsp of peanut butter and they still turned out perfect! Great for a class Halloween party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Heiselmann"
},
"reviewBody": "Super easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dorothy Conner"
},
"reviewBody": "I added m&amp;m when mixing at end when it's a little cooler. YUm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "No need to look for another popcorn recipe: this is it! The only thing I did differently was to add a good pinch of salt to the freshly-popped popcorn. We also added some orange food coloring to the marshmallow mix. These are going to be a big hit at my kids' library group next week. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bet Bug"
},
"reviewBody": "Great recipe, quick &amp; easy to make. As previous reviewers have noted, don't try to stir the marshmallow into the popcorn in the 9x12 pan, use a large deep bowl. I also added some m&amp;ms as I was forming the popcorn balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnaLucia"
},
"reviewBody": "I think that this a great easy and quick snack to make if you don't have a lot of time. One bad thing that happened was that it was too sticky but after it cooled down it was great. A thing that we added were a little bit of sprinkles. This added a little color and some taste. Over all this was a great snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "It tasted like stale rice krispy treats. This recipe served its purpose for me though. I needed to make easy popcorn balls for my preschool class as a part of a thematic unit. This was certainly easy. I made one change which was to use air popped popcorn since that's what I have here. I don't know if that is why it had the texture it had. Anyhow, my preschoolers won't be the wiser. They will just enjoy a sweet treat while we read Elhert's Snowballs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrookeCooks"
},
"reviewBody": "Added candy corns for Halloween"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNCC"
},
"reviewBody": "These are simple and tasty - we added a bit of salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tmangirl"
},
"reviewBody": "This is a great easy way to make the popcorn ball kids and adults love alike! I have been making popcorn balls for many years per request because most folks tell me they just cannot get them to stick together. This recipe works every time and is so easy! I usually add candy corn to mine just to give them the autumn look but good any time! I have shared this recipe with many over the past year, folks cannot believe how simple. Don't get me wrong the old fashion recipe with the sugar and water is great too, but this one take less than half the time and never fails! ( for beginners, you add the candy corn at the end when you are making them into balls :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "Add a small packet of jello to flavor it. Soooo easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "entikryst"
},
"reviewBody": "Tip: Use an Air Popper. Using unsalted sweet cream butter lets you control the amount of salt you add to your mixture. Let your final mixture cool in the bowl that you air popped into. Just wipe it with a paper towel and spray with nonstick cooking spray."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy2013"
},
"reviewBody": "Very easy to make and tastes awesome , I melted caramel and it drizzled over them.. Family loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbrowneyes64"
},
"reviewBody": "Wonderful snack! I made no changes to this recipe, only added to it! I mixed a handful of unsalted pretzels and a handful of chopped walnuts over popcorn and then stirred in the melted (unsalted) buttery marshmallow! Formed into serving size balls and stored in zip lock bag for a quick no sodium snack!! Def. will be keeping these on hand for now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamaralynn"
},
"reviewBody": "My mom made these as a kid and I always loved the chewy texture... like Rice Krispies but with popcorn. I looked for years and years for her popcorn ball recipe, but came up empty handed... until now :)\n\nThank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "j doschadis"
},
"reviewBody": "Much softer than jello popcorn balls, but more difficult to form into a ball and not as tasty I thought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momster"
},
"reviewBody": "My son won a huge thing of marshmallows so we made 3 batches of these with 3 variations. First we made it just as the recipe said &amp; those were great. We made one the same but with 1 c brown sugar added to the butter before the marshmallows. The third &amp; favorite was adding 2oz unsweetened chocolate with the butter then adding craisins with the popcorn. These are very chocolatey &amp; the craisins go great with it.\nThank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Frances Bell"
},
"reviewBody": "This was okay. I like the flavor, but I didn't feel the marshmallow goo was able to be incorporated thoroughly. But the popcorn did hold together as balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie R"
},
"reviewBody": "I just made this to try to salvage a disastrous attempt at making caramel popcorn. Added some white chocolate melts and it turned out amazing. Thank you for saving the day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jgarbitt"
},
"reviewBody": "This recipe was not good. I've made these kind of popcorn balls before. and there is way too much butter in the marshmallow mixture. I even lowered it to 4 tbsp and still too much. i'd go with only 2 tablespoons otherwise it will be a mess that refuses to stick together! I ended up having to press mixture into a pan and cool in the fridge to cut up into squares..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tb-SMSU"
},
"reviewBody": "I had never made popcorn balls before and this recipe looked like a very easy recipe to follow. Plus, I had all the ingredients in the house so I decided that I would give it a try. They turned out very well. The recipe was very concise and direct. There was nothing to misinterpret. I did notice that the mixture would stick a lot to my hands when making the balls. The recipe said to put butter on your hands to keep from sticking. I had to keep reapplying the butter because it would stick too much. However, it didn’t seem like the mixture stuck together because I had to pack them together just to stay. I used many different types of popcorn that I had left over from the popcorn bar we had at my wedding. I used buttered popcorn, kettle corn, and cinnamon-flavored popcorn. I would have to say that the best one was definitely the kettle corn. I would suggest that everyone try it with kettle corn. I also tried to add m&amp;ms to the mixture with the buttered popcorn; however, that just made the chocolate melt which made the balls less sticky and they fell apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mrsbebe"
},
"reviewBody": "Made this and I found them to be kinda bland. They didn't taste as sweet as I expected them to be. I even added white chocolate m&amp;ms and still didn't help the flavor much. They were also really hard to bind together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jena-licous"
},
"reviewBody": "Reduced the butter in half, added vanilla beans...amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "buettner"
},
"reviewBody": "Yes, I have tried them. They don't stay together that good, but they look delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mv_shark"
},
"reviewBody": "Delicious!! Added crushed candy canes and a touch of salt. Wrapped in cello they were perfect holiday treat (party favor, token gift, etc.). YUM, YUM, YUM!\n\nMinor tweaks: I used 2 TBSP oil to cook popcorn. (BTW, this makes 4 QT so do use a 4QT pan.) I reduced to 5 TBSP butter (more than krispie treat recipe but less than this recipe) and used full 10 oz bag of regular size marshmallows (approx 40 marshmallows, fairly sure this is equivalent to minis called for in this recipe). Also added 1/3-1/2 tsp salt and 1/3-1/2 cup candy cane pieces. YUM! Candy canes, of course, were for the holiday season and salt added the salty-sweet contrast we wanted. I mixed in the largest bowl I own then shaped into balls onto wax paper. Spray or butter the bowl and your hands. This stuff is sticky!! \n\nSecret tricks: Melt butter and marshmallows slowly on LOW heat and stir constantly so they have no chance to burn. Also, add 2 tsp milk into melted marshmallows, a tip I picked up on a rice krispie treat recipe here on allrecipes. Makes it all extra creamy. YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brandy colorado"
},
"reviewBody": "Didn't feel like measuring so used half sick butter, 2 bags mini marshmallows, 2 bags microwave popcorn. Melted butter then added the marshmallows and melted (added a couple shakes of raspberry flavored jello)then dumped in the bags of popcorn. Oiled my hands with Pam, rolled into balls...10 min. Total!!! So stinken good :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VeggieWoman"
},
"reviewBody": "Marshmallow fluff was easy, but much more sticky. Having a bowl of water on hand to dip sticky hands in was absolutely key!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "A very quick and yummy twist on the traditional popcorn ball recipe. Thank you for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pengworm"
},
"reviewBody": "This has become my family's go to quick snack recipe. It's also fairly cheap as far as snack food recipes go. We try to always keep some popcorn and marshmallows in the house for this treat. It's also good adding peanut butter or brown sugar too.\nThanks so much for sharing this and giving my family a new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annabelle10"
},
"reviewBody": "good! took another reviewers suggestion and added 1/2 c. brown sugar to the mix. also added food coloring to color mine. they didn't set up as well (harden) like other popcorn balls I've made (they were soft, which I love, but almost too soft)...but some could be related to our weather here right now--very humid/hot...not sure. still VERY yummy!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C-Ducharme"
},
"reviewBody": "I've made these before, but like to add 1/2 a package of unsweetened koolaid crystals to the marshmallows and no extra sugar. Kids like the colour and flavour. Adding all sorts of different chewy candies as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Shaw"
},
"reviewBody": "Fun to make with kids. We made them during the holidays &amp; called them snowballs. I added pretzel pieces &amp; candied pecans to the popcorn &amp; that was delicious. Make sure to use fresh marshmallows or they will come out kind of hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "I use microwave popcorn and add dark or milk chocolate mini chips to this recipe to make it even easier and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VictoriaP"
},
"reviewBody": "Honestly its THEY MOST FUN making these! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BLyn"
},
"reviewBody": "I air popped the popcorn and used 3/4 cup instead of 1/2 cup. I added a package of orange jello, and it reminded me of a creamcicle. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imcrystal1"
},
"reviewBody": "These were great and the kids loved them! I made 50 of them for my kids classes, I wrapped them in red saran wrap and tied with a green boy for christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Kisses"
},
"reviewBody": "I add brown sugar to mine but these are by far the best. My family has made them for years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "This was the first popcorn ball I ever made. I learned to make this with a small box of jello stirred in, my memory seems to think it was either strawberry or cherry because it was bright red. It's foolproof. It's a lot like krispie treats, you really can't mess this up and it's great for little hands who want to make something in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "familyof5"
},
"reviewBody": "We used 2 bags of Vicks popcorn and 1 big bag of marshmallows. We also added in cut up Hot Tamales candy and added to the mix. Out of this world!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naschott"
},
"reviewBody": "These are delicious! We added a few red hots for the perfect touch of color and added flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookie_cooker"
},
"reviewBody": "Easiest recipe ever especially if you use microwave popcorn and melt the butter &amp; marshmallows in a big microwave safe bowl. I used the holiday gingerbreadman marshmallows with a splash of vanilla and cinnamon. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mdb"
},
"reviewBody": "great for a sweet craving. added chopped up lindt milk chocolate bar and can't eat it without now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Matthews"
},
"reviewBody": "They were a big hit with family and friends on halloween! I added a few Reese' Pieces candies to be festive. I also popped my own popcorn in my Whirley Pop with some olive oil and sea salt. What a yummy treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal J Calhoun"
},
"reviewBody": "This is a great recipes and has a wonderful flovor! I added reese pieces to the mix and gave them a peanutbutter flovor which was awesome! My son loves them very much and can not wait to give them to his class for Halloween!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jig"
},
"reviewBody": "We loved these. We made them in the microwave so they were quick and easy. The kiddos and I made them green for Halloween and then they decorated them to look like goblins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TxCat"
},
"reviewBody": "WOW!! So easy to make.. Daughter and I loved em'! I used microwave popcorn instead and added 1 tsp. of Vanilla extract to the mallow mixture and it was just wonderful.. not too sweet either! Will use again! Thanks ;o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Thurston"
},
"reviewBody": "These are really great and easy to make. I also used microwave butter lite popcorn and I also use a microwave to melt the marshmallows. Less sugar, less marshmallows and it all is easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Peters-Koen "
},
"reviewBody": "totally yummy and totally easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eforeffort"
},
"reviewBody": "I used to make these when I was young so I was looking for a recipe-couldn't quite remember how we did it-we always scrubbed the kitchen sink, filled the drain with foil and did the mixing in the sink for easy cleanup. Works great as I doubled this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeT"
},
"reviewBody": "We made these this afternoon with leftover popcorn and they turned out great! We added 24 small caramels as well and they were chewy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is very easy and the best one I have made! The popcorn balls are soft, not hard. I just added a little salt and 1/2 tsp. vanilla to the melted marshmallow/butter mixture. I really like this recipe because there is no added corn syrup or sugar! This recipe is no sweeter than rice crispy bars. My whole family loves these! I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Singer6"
},
"reviewBody": "We though these would taste more like rice rispy treats but the just didn't. They were ok but way too sweet. Maybe a little vanilla would help. We won't make these again. Too sweet and greasy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "13thBlackCat"
},
"reviewBody": "Sooo good! Had to make a few quick subs due to lack of proper ingredients, but these were very tasty. I used Jiffy Pop and marshmallow fluff instead (note: marshmallow fluff is quicker than melting marshmallows).\n\n1 package of popped Jiffy Pop, 1 jar of marshmallow fluff, 3 tbsp butter and 1 1/2 tsp vanilla. As some others have suggested, I mixed in a large bowl and then pressed into the cake pan and cut into squares. This stuff is addicting!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjgonzo"
},
"reviewBody": "I made these for a party and had some older kids help shape them in balls. I had them wet their hands with water instead of butter. It worked perfectly, less mess. \n\nI also added 1 tsp of brown vanilla and ended up making a 2nd batch... the vanilla didnt taste well. I am not sure if the vanilla went rancid from the heat since I poured it directly into the pan with the butter and marshmallows. \n\nI also used 1 bag of microwave popcorn, Simply Salted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darthotto"
},
"reviewBody": "Good. I looked in my pantry and decided I didnt just want popcorn, so I added 2 T more butter and 2 cups more marshmallow with 1t of mexican vanilla, then added about 2 cups of rice cereal and a handful of shredded coconut. Also mixed in sprinkles. Turned out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hatwoman20"
},
"reviewBody": "Excelent, a little green food color in the marshmallow satisfied my four year olds request for green popcorn! Very easy to make, taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika Carlo Yacobucci"
},
"reviewBody": "soooo good! I made with a bag of large marshmallows,(I didn't have mini) 2 bags of microwave popcorn with the 6tbs of butter. I pressed it into a 9X13 pan and cut into squares."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjketark"
},
"reviewBody": "Really good, really cheap and really easy! what more do you want? Followed others' suggestions and added 2tbsp brown sugar with melting butter and vanilla. also added flax meal for some modicum of nutrition. My one tip is to just wet your hands with water rather than using spray oil or butter - water actually worked better for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gswoody"
},
"reviewBody": "These were easy. I did alter the recipe for ease and with what I had on hand. I used microwave popcorn. I just popped one or two bags and put that in a greased 9x13 dish. You could probably just use a big mixing bowl too. I used light butter and melted some heart-shaped strawberry flavored marshmallows. Poured this over the top of the popcorn and sprayed cooking spray on my hands and rolled into balls. I thought they tasted good, like marshmallow treats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Creston"
},
"reviewBody": "WOW! Delicious! We made the popcorn treats with store boughten popcorn and still used the same mixture as the original recipe and they turned out wonderful. Easy, fast and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "hotpotatoe"
},
"reviewBody": "This recipe was very easy and quick. But, the taste was sort of bland. I used no butter microwave popcorn. My young child liked it in bits and pieces. Next time I would add more butter and salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Griffin"
},
"reviewBody": "Easy and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe seemed really simple but when I tried it the balls wouldn't stay together and then when we finally got them to stay together and tasted the final product it wasn't tasty at all. We followed the directions exactly by the way and I made these with a group of people and all of them agreed on how clumsily they went together and how the taste wasn't good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Benjamin"
},
"reviewBody": "These were AWESOME -- quick, easy, and very tasty. I made them for a Hallowe'en party and added red &amp; yellow food coloring to make them orange. They were a HIT. So much easier than the traditional method with corn syrup, etc. Thanks for posting this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicca90"
},
"reviewBody": "great recipe!! i had strawberry flavored jumbo marshmallows leftover so i used four of them instead and it worked excellent! loved these popcorn balls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "milkthistle"
},
"reviewBody": "These were so easy! Took about 10 minutes to make and boy do they taste fantastic; I couldn't stop eating them! I went with lightly buttered microwaveable popcorn to make it even easier, and I also added about 1/4 to 1/2 cup of brown sugar to the marshmallow mix to make it more carmel flavored. On my second batch, I made them with marshmallow cream because my boyfriend is vegetarian and marshmallows have gelatin. I then added some orange food coloring to the sauce. After tossing it all together, I added some choc chips for halloween. A+ recipe! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oldcars"
},
"reviewBody": "My grandsons love these, I add 1/2 cup of peanut butter into the sauce pan after the marshmallows are melted. If you like peanut butter, you'll like them this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wbferrell"
},
"reviewBody": "I've never made such an easy popcorn ball recipe. I did add the 1/2 c. of brown sugar and threw in a few M&amp;M's. The kids helped make them into balls and it wasn't even that messy! Yum! Yum! The marshmallows are the secret ingrediant that I wish I would have known about a long time ago!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin L."
},
"reviewBody": "Very easy! Added 1/2 C brown sugar as others recommended and M&amp;Ms. Need to add candies after almost completely cooled or they melt when forming into balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msumissa"
},
"reviewBody": "These are just like the recipe my mom had growing up. We decorate the outside with 10 cinnimin candies and tie with a red bow and hang on the Christmas tree. Thanks for helping me pass down a family favorite to my kids!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Taulbee"
},
"reviewBody": "Fantastic! I did half a batch and added probably about 1/4 to 1/2 cup of brown sugar for more flavor. My whole family ate them up and asked for more!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melody"
},
"reviewBody": "These were easy to make and my kids liked them, but they were too sweet for me. Also a very sticky mess to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPA"
},
"reviewBody": "Easy &amp; delicious! Don't forget to take the unpopped kernels out before u combine the popcorn w/the marshmallows. Its hard to fish them out of sticky marshmallow otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy Mae"
},
"reviewBody": "The only change I made was to air pop my popcorn and used Kraft strawberry marshmallow's....yum, yum....and sticky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryn Courtney Whitehurst"
},
"reviewBody": "These were so fun to make!! I have made it twice, once following the recipe wich turned out great. The second I tried to use marshmellow fluff and it did not turn out at all. It would not stick together. I also tried to add coloring with food coloring, but I think the culprit was the fluff. I ended up with a bowl of loose marshmello covered popcorn. I guess this would work nicely if you wanted to add nuts and make something that resembles cracker jacks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Fun Recipe! I changed it a bit because of the ingredients I had. I used chocolate cheerios, semi-sweet mini chocolate chips, and made half the marshmallow mixture. I poured the mixture (which I made in the microwave by the way) over the cheerios, mixed it up, greased my hands and rolled the balls. Then I rolled the balls in the chocolate chips. These were so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah McCambridge"
},
"reviewBody": "Simple, delicious, easy and fun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENED"
},
"reviewBody": "Yummy and gooey popcorn balls! I sort my popcorn after it pops to get rid of kernels and partially popped corn that can wreck your teeth. That makes the balls much more enjoyable to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "courtneyann"
},
"reviewBody": "This is a great recipe! But make sure that you have a lid on when you are popping the popcorn or it will go everywhere. We did this recipe with movie theater popcorn out of a bag so we had to clean the kernels by rinsing them with a lot of hot water to remove the butter. Then we dried off the kernels and added them to a pan. Big marshmallows also work, as long as you use 5 cups. It was easy, but it took longer than the required time since we did not have plain popcorn kernels. Otherwise, this was an awesome party recipe(:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VJusczak"
},
"reviewBody": "5 stars just the way they are!! so easy! quick dessert that the kids can help make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Harvey Woiccak"
},
"reviewBody": "Loved these! they were very easy, If you can make rice crispy treats, you can make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shellzy741"
},
"reviewBody": "This was so good! I never thought about using marshmallows instead of the usual vinegar and corn syrup. The best part was that it essentially only has 2 ingredients: popcorn and marshmallows."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather R"
},
"reviewBody": "These were really good. My 10-yr-old daughter helped. They were super sweet and yummy - just what you expect a popcorn ball to taste like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Paternoster"
},
"reviewBody": "Loved them, I haven't made popcorn balls in forever and my husband isn't a huge caramel fan so I thought I would give these a shot. We all liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lara"
},
"reviewBody": "They were fine. I brought the balls to a Halloween party and they were eaten all up. But, I missed the caramel flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erinruns"
},
"reviewBody": "Great recipe, makes way more than 8 though, unless really huge. I popped the popcorn without oil in a paper bag in the microwave while I did the marshmallow and butter on the stove- if I had popped more than a 1/2 cup popcorn I could have easily made more balls, because the marshmallow/butter mix makes a lot. I butter my ands and dormed into balls and let set in greased muffin pan, got 16+ nice size ones. Since its Halloween, we also chopped up reese pieces and formed it into some, delish! Definitely will use this again at other holidays with other candies added depending on the special day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nerdymom"
},
"reviewBody": "Very easy recipe, but the balls are very hard to form. Had to have my spouse keep spraying my hands with oil. Also it doesn't have that classic taste of a popcorn ball. Still, a good recipe for someone who doesn't want to fool with a more complex process."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bellydancer"
},
"reviewBody": "The kids thought these were good. I prefer more of a crunchy popcorn ball, these were chewy. I probably wouldn't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Trixie33"
},
"reviewBody": "I would rate this ZERO stars, but I had to pick at least 1....... I don't know what I did wrong!? I used 2 bags of micro Popcorn, 1 bag of mini marshmallows, and butter. I got a gooey mess that didn't want to form. I even tried to put into 9x13 pan, no luck! After 2 hours I tried popping another bag of corn thinking I had too much of the mix, that didn't work either. Disappointed due to all the great reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "N Oster"
},
"reviewBody": "Quick &amp; easy. I used 2 bags of microwave kettle corn, added 1tsp vanilla &amp; food coloring to make them orange for Halloween. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn11234"
},
"reviewBody": "The kids and I made these SO fast this morning and we added some multi colored \"sprinkle balls\" to them which was fun for the kiddos to feel a bit more involved! Would make these again for sure! YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mummy335"
},
"reviewBody": "These were very easy to make brought me back to my childhood have not had them again till today! they are very good with brown sugar also."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19154/marshmallow-popcorn-balls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/759/desserts/candy/popcorn-candy/",
"name": "Popcorn Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/966/desserts/candy/popcorn-candy/popcorn-balls/",
"name": "Popcorn Ball Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19154/marshmallow-popcorn-balls/",
"name": "Marshmallow Popcorn Balls"
}
}
]
}
}
, "about": [
]
}
]