				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mary&#39;s Sugar Cookies"
,"datePublished": "2020-06-18T23:05:06.000-04:00"
,"dateModified": "2022-07-14T17:38:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Pat"
,"url": "https://www.allrecipes.com/cook/24327277"
}
]
,"description": "This is an old fashioned sugar cookie with a hit of almond flavor. Cut into your favorite shapes with cookie cutters and sprinkle with colored sugar for special occasions."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/LI2mP-xYGyM11iKpGCZRj35PfoA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4790880-47342c4a4981450dbaf98b7e9dd897d8.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mary&#39;s Sugar Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "226"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "126 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "23 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "88 mg"
,"sugarContent": "8 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup butter, softened",
"1.5 cups sifted confectioners' sugar",
"1 large egg",
"1 teaspoon vanilla extract",
"0.5 teaspoon almond extract",
"2.5 cups all-purpose flour",
"1 teaspoon baking soda",
"1 teaspoon cream of tartar",
"0.25 cup granulated sugar for decoration" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, cream together the butter and confectioners&#39; sugar until smooth. Beat in the egg and stir in the vanilla and almond extract. Combine the flour, baking soda and cream of tartar; blend into the creamed mixture. Cover and chill for at least two hours."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Divide the dough into two parts. On a lightly floured surface, roll each piece of the dough out to 3/16 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto greased cookie sheets. Sprinkle cookies with plain or colored granulated sugar."
} ,{
"@type": "HowToStep"
,"text": "Bake for 8 minutes in the preheated oven, until lightly browned. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT175M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Why do you think my cookies are so fragile? They all break. The flavor is outstanding tho."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I grew up making these cookies with my mom. I love the distinct taste that the almond and cream of tartar adds. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making this recipe for over 30 years and it is the best. It isn't too sweet so it is a great cookie to frost for Christmas cookies. Light and crisp. TIP- Roll out your dough between parchment before putting in fridge! Save time and makes it so much easier when you are ready, especially with kids helping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha"
},
"reviewBody": "This has been my favorite sugar cookie for 40 years. I roll it very thin and it bakes nice and crisp. It is also absolutely delicious. It is easy to work with and I could not be more thrilled to find this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynda"
},
"reviewBody": "I’d give this more stars if I could. It’s absolutely the best cookie I’ve ever eaten. I didn’t refrigerate on the second batch and it was still divine. You will be asked to make more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deana Buelow"
},
"reviewBody": "I just realized I don’t think I’ve ever rated these! I’ve used this recipe for years (this exact one from this site lol) these are seriously the most amazing sugar cookies! Buttery with a hint of almond flavoring and so soft they melt in your mouth. If yours are coming out bland and tough to work with I’d double check that you didn’t miss or accidentally double an ingredient. I’ve never had to alter these to get perfect cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "medejong"
},
"reviewBody": "Super easy to make and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darmstro67"
},
"reviewBody": "These are delicious \nMade as per recipe \nFrosted with buttercream icing and sprinkles \nTender inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Brown"
},
"reviewBody": "The best! I have been using this recipe for years and it never fails. I do, however, omit most of the vanilla extract and substitute it with more almond extract - they turn out so delicious this way! Oh, and watch the baking time, it usually goes a lot faster than what is suggested!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi"
},
"reviewBody": "I have been making these cookies since I found the recipe in the Betty Crocker cookbook I received as an engagement present in 1967. The best sugar cookies. After refrigerating them for 2 hours I let them sit for a few minutes before rolling. I made them last night for Valentines Day and it made 50 good size hearts. Brought them to the bowling alley tonight and everyone loved them. They never fail. Love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Zapala-Park"
},
"reviewBody": "I've made this recipe too many to count. Got a Betty Crocker Cookbook over 40 years ago and that's when I started making them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mar"
},
"reviewBody": "Easy to make, look and taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgk"
},
"reviewBody": "Exactly what I was looking for...will make again very soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "manella"
},
"reviewBody": "Nice and easy to make, i did not add the almond extract, used all vanilla. The cook time for me was 10 minutes. I sprinkled Lavender Sugar on them. They turned out good and they freeze well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Tooth"
},
"reviewBody": "I too have been making these cookies for over 45 years. These are my favorite sugar cookies! The almond extract adds a great flavor and they turn out tender, flaky and slightly crunchy. Sometimes I frost the cookies and top with sugar sprinkles and other times I just sprinkle the cookies with sugar before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juanita Elliott"
},
"reviewBody": "Our family has made these special sugar cookies for years..we always frost them and they are THE\nXmas cookie for us!! Don't make them too thin, and they will melt in your mouth. :-) i always make a double batch at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aileen Reyes"
},
"reviewBody": "I followed the recepie exactly. The only thing I did was added one tablespoon of flour for high altitude. They came out yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Brierley Mortensen"
},
"reviewBody": "This is my all time favorite sugar cookie recipe! I first found this recipe in my old \"Betty Crocker's New Dinner for Two\" cookbook. I roll them when I want cutouts. The rest of the time I roll them into balls, roll them in sugar and press with a fork like I do my peanut butter cookies, they look great on a cookie plate together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hailey Hendryx"
},
"reviewBody": "Thanks for the recipie I will for sure try this. one question though, why does the dough have to be refridgerated for 2 hours?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Sullivan"
},
"reviewBody": "This is the recipe I grew up with. I have been making them for over 40 years. No other sugar cookie can compare. My parents like them thin and crispy, but I prefer them thicker and soft. Yes, the dough is delicate, but even the broken cookies taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mezzofortissimo"
},
"reviewBody": "Differences from the traditional sugar cookie: A bit lighter and flakier... not quite as cakey, if you will.\n\nI had this recipe in my cookbook for years, but because I grew up using granulated sugar, I wouldn't use this one. A few decades later, it turns out to be my favorite recipe! Ha! (No kidding... Betty Crocker's 1991 cookbook has the exact same recipe.) \n\nI made one batch with butter, one with margarine, and one half butter half coconut oil. All turned out splendidly, though the margarine one seemed the best consistency. \n\nI did not adjust the baking time and temp. I am at 7000 feet, fyi, but leaving the cookie on the sheet afterwards ensured it finished cooking, so they were perfectly done on both the air bake sheets and regular sheets. 8 minutes was perfect even for the giant heart cookies as big as a whole sheet, and perfect for the smaller cookies too.\n\nThe cookie is so good, I actually prefer it without frosting to mask it's texture and flavor. The kids put oodles of frosting and sprinkles though, and my 12 yr old can't tell the difference between this or any of the sugar cookies we've made in the past."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Tiagha"
},
"reviewBody": "I liked it a bit but when I bit into it, the amount of time they told us seemed a bit too short. Everyone else loved them so I guess it could just be me. That's why I'll rate it a 4 star recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debs55"
},
"reviewBody": "Very good cookie! Really liked the almond flavoring. The only reason I gave it a 4 instead of a 5 was because the cookies spread quite a bit while baking. After the first batch spread, I cooled pan and cookies before putting in oven. They didn't spread as much but still a bit too much for me. I will make these again but maybe use a tad more flour. Thanks for an excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Russell"
},
"reviewBody": "delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shannon Roberts"
},
"reviewBody": "These taste wonderful, and are just delightful little cookies. HOWEVER I was looking for a sugar cookie to decorate with my kids for Christmas, and these are NOT it. They don't hold their shape well at all. Also you will need a lot of flour for rolling these out. The dough is quite delicate and breaks easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdrecipes"
},
"reviewBody": "These had the flavor I was looking for and they were more tender than my family recipe (that I'd lost). I added 1 tsp salt and twice the amount of vanilla and omitted the almond flavoring only because I was out of it. Will definitely use this recipe in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathleencramer"
},
"reviewBody": "I've made this several times now. I roll it thicker than the recipe calls. The flavor is just delicious! Big hit at our house. Note, it is not SUPER good at keeping its shape. I haven't found one that will keep its shape and taste fantastic at the same time..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Salsa"
},
"reviewBody": "This was my first time to make cookies and they turned out lovely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charbswims"
},
"reviewBody": "I had read reviews complaining about how plain the cookies are but they are actually perfect sugar cookies as the icing is so super-sweet you don't want the cookie to be. I omitted the almond extract as I don't like it but otherwise, they're great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise McAskill"
},
"reviewBody": "I have been making this sugar cookie recipe for a few years now. It is my absolute favorite. I give them away for Christmas to my closest friends and family and they rave about them. I frost mine with Royal frosting and decorate with various colored sprinkles and sugars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erinc"
},
"reviewBody": "Instead of almond, I used anise extract. I also added 1/4 cup of milk to the wet ingredients and 1/2 cup more flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I was very disappointed in the texture. - soooo dry. I put lots of icing on them so as not to waste them but that didn't help much. Nice almond flavor but couldn't get past the dryness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Chabot"
},
"reviewBody": "I followed the recipe exactly and the mixture was too dry and crumbly and could not be rolled out. Maybe another egg would have helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "I made these for valentines day and they were great! I divided the dough in four and kept them refrigerated until I needed them as the dough softens up very fast. On my cookie stone they took 9 minutes to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I have made this cookie for over 50 years and it is the best recipe ever! Everyone who eats them asks for the recipe. I won't even try another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSEMOM"
},
"reviewBody": "These are amazing. They turned out perfectly. I'd say these are my favorite cookie I've ever made. I don't care for chocolate! Or cookies really. But I bought a new \"Dove\" cookie cutter so I was motivated! I sprinkled some sugar sprinkles on some of them, turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Bishop"
},
"reviewBody": "Good cookie and flavor was not too over bearing. I refrigerated the dough over night because I ran out of time to roll them out. I was afraid it was going to be too hard and dried to make a good cookie, but after it warmed a little bit I was able to roll it out. The cookie was not too soft it fell apart or to hard. I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roze214"
},
"reviewBody": "I've made this recipe the past few years for my annual Christmas sugar cookie decorating party. They are absolutely delicious and everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovedecember16"
},
"reviewBody": "This is the first time that I have wrote a review on here. I had to give this recipe a 5 star rating ! The edges were crisp and the cookie tasted like perfection !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hands down, this is our favorite sugar cookie recipe. We always leave out the almond extract though. For variety, sometimes we put one TB of orange zest in the dough. Thanks so much for posting the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrystalcleer"
},
"reviewBody": "I made a batch yesterday and it was exactly what I was looking for. I usually make a thin crispy cut out and decorate with colored sugars. My husband was crying for a \"real\" cut out with frosting this year. So, I was looking for a recipe that was not too thin and crispy and that was not too thick and chewy, something right in between. This recipe completely fits the bill! After making the dough, I flattened it out with my palms and wrapped in plastic and chilled for an hour. My fridge runs super cold, so when I pulled the dough out, it was def. too hard to work with. Just cut the flattened dough in half and let it warm up a little before rolling. I had absolutely no issues with flaking, cracking or stickiness. I use a rolling cloth with a dusting of flour and use a rolling sock on my roller. Works perfectly. You do need to roll a little thicker than usual, and I only baked the cookies for about a 6 minutes. You do not want them to brown at all. I also use parchment instead of spray, I let the cookies sit for a minute to stabilize before moving to a wire rack. easy peasy, they moved perfectly. These cookies are a little crispy on the outside, but tender on the inside and taste delish!! I frosted with a standard buttercream that hardens on the surface but stays melt in your mouth inside. YUM!! I used standard size Christmas cutters and it made 60 cookies. Excellent and exactly, exactly what I was looking for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALGAUTHOR"
},
"reviewBody": "We never make any sugar cookies but these, and they always get rave reviews! Be sure to use unsalted butter...salted butter significantly changes the taste, in my opinion, and margarine causes the cookies to be too soft and spread out too much in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gordon"
},
"reviewBody": "It worked out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "superbbmom"
},
"reviewBody": "Great cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marykevinaz"
},
"reviewBody": "I tried this because I was out of granulated sugar but had powdered sugar. The cookies are good. They're definitely not the best sugar cookies I've ever had. But I am partial to cookies that have a small amount of dairy in them, such as cream cheese or sour cream. They were a tiny bit difficult to roll out. I had to add a little extra flour when rolling them. I would make this again in a pinch though. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "THE BEST SUGAR COOKIE I EVER HAD!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caiti"
},
"reviewBody": "I absolutely detest making sugar cookies because I just don't like dealing with the mess, but these actually turned out pretty well. The only thing that I would criticize is that they tended to get much larger than I am used to with cookies, so the shapes I had used to cut them got pretty distorted. However, they did taste awesome, which is what really counts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KNEWBRIDE"
},
"reviewBody": "Not very good. Overly sweet. Very difficult to manage the dough. I think we'll keep looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KimmieP"
},
"reviewBody": "A very good basic sugar cookie for rolling and cookie cutters. Had to omit the almond extract cause I didn't have it on hand and it still turned out good, a mild sweet cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephy"
},
"reviewBody": "Awesome! Cook 7 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "I tried a couple of different sugar cookie recipes this year. This one was really good and the dough was really easy to work with - the cookies baked really well and were easy to handle and had a good texture. The only complaint I have is that the cookies tasted a little bit bland to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DJ"
},
"reviewBody": "maybe I beat the butter and sugar to much. My cookies turned out more like shortbread than sugar cookie. I wanted a softer cookie but they were harder than i expected and i did not over bake them.but i noticed about a week later after they had been sitting on my counter for a while they improved in taste and softness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "allmy4animals"
},
"reviewBody": "They tasted great but I had alot of sticking to the rolling pin. I ended up pushing the dough with the palm of my hand. I made the recipe twice and still had trouble rolling the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cynthia Melcher"
},
"reviewBody": "This was horrible!! threw it in the trash!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "I love this recipe. I have used it since the 70's. It is the one I used with my children and now will use it to make cutout cookies with my grandchildren."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiffany10000"
},
"reviewBody": "This is the recipe our family has been using for 40 years. It's not Christmas until we have at least one batch of trees, bells and stars. They're not overly sweet, but perfect once they're iced and decorated with sprinkles!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I've been making these cookies for years. They are the family favorite for cut out cookies. I love the vanilla/almond flavor combo. I got the recipe from the Betty Crocker Cooky Book printed in the mid 1960's. I add 1/2 tsp salt and leave out the baking soda and cream of tartar so they won't change shape. I've also found it easier to divide the dough and chill it for about 15 minutes, roll each half out between sheets of parchment paper and re-chill it for about an hour. It makes cutting out the cookies easier and you can remove the excess then bake them right on the parchment paper to prevent sticking and over browning the underside. I re-chill the excess dough and start the process again when I have time. It's stays good for up to 3 days in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJBC7"
},
"reviewBody": "This recipe was perfect- not too sweet and just tender enough to pass off as a shortbread. Note: I used self raising flour ( by mistake) and rolled between sheets of saran wrap. Veyr very forgiving dough as long as you chill thoroughly before and in between uses. This is a keeper. I made easily 120 mini christmas cookies for school. Will be making a second batch today. This will take nicely to a glaze icing and some colored sugar sprinkles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Powell"
},
"reviewBody": "Very easy to make. Delicious with frosting from this site. My three year old daughter helped me make these and they were easy to make. She really enjoyed helping her mama use cookie cutters. To roll them out I put them between two wax papers cause they do stick to the rolling pin. All in all a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TracyB"
},
"reviewBody": "Good recipe for taste. Versatile as well - I can see adding other flavor extracts in place of the almond (coconut, raspberry, etc). Once the dough chills, you do need to let it warm up slightly so that it's pliable to roll. I cut out my cookies then put them into the freezer until just before baking so that they keep their shape better. If you bake them when they're room temperature, they will spread out quite a bit and lose their shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie62"
},
"reviewBody": "My new favorite! The almond extract makes these cookies! I doubled the recipe and added an extra cup of flour, perfect flavor, nicely sweet. The kids *loved* the dough. I did manage to make car cookies for our derby car race tomorrow. I did refrigerate the dough for a couple of hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kellyblack"
},
"reviewBody": "I followed the recipe perfectly, then let it chill overnight. The consistency of the dough didn't change at all and it was impossible to roll out and use a cookie cutter, which was what the instructions say it will do and what I needed it to do. Not sure if it's the copious amounts of butter or some other factor, but this recipe bombed. Try a different one and save yourself ingredients and time. Sorry, Mary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeBeeN"
},
"reviewBody": "SCORE!!! I had stopped making sugar cookies a few years ago because I found them to be overly sweet or bland. I was cooking with children and I wanted them to cut out cookies and decorate them, so I found this to be the best rated sugar cookie recipe and decided to give it a go, not expecting to really like them. Everyone, including myself, loved them. They are just as most reviewers said, light, crisp without being crunchy, and the hint of almond takes the taste over the top. I followed the recipe, weighing the sugar (6 oz) and flour (10.6 oz) instead of measuring it. I did not sift the sugar and the only change I made was to add about a 1/4 teaspoon of salt to the dry ingredients. I recommend dividing the dough in half before you put it in the refrigerator instead of waiting until you are about to roll the dough out. This makes it easier to work quickly with the dough while it is still firm and cool. Sugar cookies will definitely be back on my holiday baking list this Christmas, now that I've got the perfect recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Alison07"
},
"reviewBody": "Terrible to cut out! I even chilled the dough over night. It was soft and sticky. I did follow the recipe with no substitutions. I have tried many sugar cookie recipes and this one was the worst for cut out cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "LOVE THIS RECIPE! \nEvery time I make this recipe; all who partake tell me it's the best sugar cookie they have ever had! I think the frosting helps to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Frederick"
},
"reviewBody": "These cookies were somewhat crumbly and dry. I used a simple glaze to sweeten them up, but on their own they weren't very good. I won't make them again, which surprised me because of the ratings. Very bland cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "candlechick"
},
"reviewBody": "I used this recipe for sugar cookie cut-outs. Since the photos shows cut-outs, I thought this recipe would work well. I chilled the dough for 2 hours, as directed. The dough was extremely sticky when I tried to roll it out. Forget trying to do cut-outs with this recipe. Good tasting cookies, but recommend another recipe for cut-outs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "dough was far too sticky for cutouts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Barb Banbury"
},
"reviewBody": "These were only ok (we still ate them of course, they are cookies afterall!). But I felt like they weren't all that great by themselves and really relied on the frosting to make them yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARCTICAMY"
},
"reviewBody": "the flavor is excellent, the texture when making the dough is very good. My kids cut out several shapes with cookie cutters. While they were baking, they spread and puffed a little so it wasnt a precise shape like the cookie cutter, but it was still recognizable. We then decorated them with icing. Overall, a good tasting cookie and a good time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "libra_2581"
},
"reviewBody": "great recipe, Love the use of confectioners sugar instead of reg sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackiet785"
},
"reviewBody": "This christmas was my first year using this recipe, but I can tell you it will be a tradtion from here on out! The dough makes the perfect amount of cookies and not to mention how awesome they taste! This is definitely coming back for the holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother Ann"
},
"reviewBody": "As a sugar cookie I rate this a 5. For how much fun we had making and decorating, I'd give it a 10! The recipe was easy, rolled out nicely and baked up nice and soft. To give them even a bigger hint of almond I added almond extract to the icing I put on them. My grown kids and I made these with 3 small children who had never decorated Christmas cookies before. This recipe helped to make some very good memories for some very special children!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Bonaventura"
},
"reviewBody": "A wonderful recipe! I had to make a couple changes due to food allergies at our house. Took out the almond extract and put a bit more vanilla in and took out the egg and substituted it with a 1/4 of plain nonfat yogurt. This is a really nice Buttery and sugary mix. Easy to work dough. So pleased with our xmas cutouts this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katie Jones"
},
"reviewBody": "As I was mixing the ingredents listed I began to fear that it would not make the amount stated (5 dozen/60 cookies). I was correct. It made about half that. After I sealed it in an airtight container to chill the dough. I left it in there for 2 hours as stated on the recipe. When I went to get the chilled dough out of the bowl it was very hard and dry. I worked it on the counter and brought it to room temperater. It was MUCH easier to work with at that point. The dough was still very dry and cracked a lot as I rolled it out. Also, instead of greasing the baking sheets I used parchment paper (it cuts out a few calories). That worked just find. However, since I had to bring the dough to room temperature I also had to adjust the baking time. 6 minutes was perfect. Once baked I was still not too happy. There was a bland flavor to the cookies. \r\n\r\nAfter all that I have decided to use another recipe. :( Thanks for trying though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scusmemiss"
},
"reviewBody": "Excellent cookie! These came out perfectly! I had to bake them for about 10 minutes but they came out wonderful! I split the dough in two and refrigerated it for about 1 hour and then rolled it between 2 pieces of wax paper. This technique was AWESOME! No floury mess and the dough stayed soft!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Hunt Mohr"
},
"reviewBody": "The best sugar cookie recipe ever. I won a blue ribbon for these cookies at the state fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Elizabeth"
},
"reviewBody": "I baked the recommend 8 mins at 375 and the cookies came out quite dry. Perhaps a minute or so shorter bake time and they would have been just right. Good flavor though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meg_in_quebec"
},
"reviewBody": "I had NEVER before baked from scratch, and after reading through many recipes and reviews, chose Mary's sugar cookies for my first experiment. I read through a lot of the feedback, which was really helpful. The cookies turned out PERFECTLY, and I was even making \"Q\" and \"C\" cookies for some of my loved ones. No cracking, no real difficulty working the dough at all. NOTE: I did roll the dough out between two sheets of waxed paper and THEN put the rolled out dough back into the fridge for a few minutes. Cut out the cookies quickly, while the dough is still good and cold, and it was a breeze! The taste was exactly what I was looking for, classic sugar cookie goodness. I even passed some around to our neighbors. Mary's sugar cookies made this no-bake girl feel like Betty Crocker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TamelaT"
},
"reviewBody": "I am not a novice in the cookie department but this recipe was a fail. I tried it twice. Once as is on the recipe and once using some tips from other reviewers. Both times the cookies were dry and crumbly and not very tasty. Maybe this is a recipe that should be noted as being one to use for icing? because putting the normal sugar on it wasn't enough to make them taste anything other than bland. I wanted them to be good. Especially using the almond extract (which I LOVE LOVE). Sorry to all the ones who thought this was awesome. This recipe most definitely wasn't it for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Moore"
},
"reviewBody": "This is a really great recipe. I have made them a few times. The last time I used this recipe, I used it as a base for the mint chocolate chip cookies on this site from betty crocker. I didn't want to use store bought sugar cookie dough for that recipe so I used this. Turned out really great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ginny Bowers"
},
"reviewBody": "Great cookies! I ended up adding a tiny bit of water because the dough was too dry. I also followed another recommendation and cooked them 6 min at 350 degrees. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "Family favorite for Christmas cut outs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "r-me_grl"
},
"reviewBody": "These were my Aunt Margie's signature cookies and the only one I liked, until I discovered homemade Oreos. They are still my all time favorites. Hers were always bigger, fluffier and softer. I prefer mine harder and crunchier, but my family doesn't. Just can't duplicate them like she made them, but they are still incredible to me. I was so happy that the site had the recipe. I had misplaced my copy for awhile. These are the absolute best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lakegirl"
},
"reviewBody": "I have been making these cookies for 40 years. Yes, the dough is a little difficult to handle and it tends to crack, but you won't find a better sugar cookie. It is not Christmas in my daughter's house until a plate of these arrive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sarhod"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "These are good, but not the best. I usually use the Best Rolled Sugar Cookie recipe from this site, but chose this one this time. I followed the instructions, but the dough did crack a little when rolling. After baking for the specified time, I had a few cookies completely break after removing them from the pan. The flavor is terrific (I do love almond flavoring), so I wish I had had better luck this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This was one of the best sugar recipes I have ever made and I have made many over the years. The cookies are so good, no icing is really needed. Light and crisp cookie. Thanks so much for sharing! This is now a regular cookie in our home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliette"
},
"reviewBody": "Made this recipe for years and watched it deteriate over time. Problem: I was using the same jar of cream of tarter for the last 6 years. Buy some fresh cream of tarter everyone!!!!! and if you don't have almond extract remove a 1/2 of the flour and replace it with a 1/2 cup of Red Mill Almond flour (or grind your own almonds in a food processor). The almond flour gives it just the slightest meaty kind of a texture but the cookies are delicate (with or without the almond flour) and these are not good for shipping to Iraq or Afganistan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizanoel21"
},
"reviewBody": "My office loved these for Halloween! Will definately make again and again! Note: I found it easier to roll out straight from the fridge as opposed to letting it sit. Plus I had to use lots of flour cause it was a bit sticky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuLu"
},
"reviewBody": "I too have been using this recipe for most of my cooking lifetime. it is from Betty Crocker's Cooky Book - 1978. It has become my signature cookie since everyone loves it. QUESTION - I wanted to make it into a chocolate version and I'm not sure what adding cocoa powder would do to the consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hockeymom"
},
"reviewBody": "I have tried many sugar cookie recipes and this is the only one I have liked. My kids absolutely loved this recipe. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CTKlovescooking"
},
"reviewBody": "wonderful cookie!!! Tasted great, and was very easy to roll out and bake. This is now my favorite cutout cookie recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MsMay"
},
"reviewBody": "I've used this recipe for 20+ years. It NEVER fails! I use a cream cheese frosting for decorating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoodster"
},
"reviewBody": "This is a family favorite so much I make almost 1000 of these each Christmas. We have a system and my daughter is planning on keeping the tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doctor H"
},
"reviewBody": "These cookies turned out just perfectly! I followed the recipe exactly except I didn't have any almond extract so just for fun put in a spoonful of Frangelico hazelnut liqueur! I made the dough and chilled it in the refrigerator, wrapped in plastic wrap, for 2 days until I finally had a chance to roll them out with the kids. I took the dough out to let it soften for just a few minutes and the cookies still rolled out just fine even though the dough spent extra time in the refrigerator. For the icing, I used the Allrecipe \"Sugar Cookie Icing\", which was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Candler Travelstead"
},
"reviewBody": "This is the best tasting sugar cookie I have ever eaten!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anne"
},
"reviewBody": "The cream of tartar in this is a great improvement over the usual floury taste of sugar cookies, and the texture is great (but like others have noted, these are more fragile than traditional sugar cookies). I roll the dough out between two sheets of parchment paper while it's just slightly cool to help hold the dough together, then put it back in the fridge on the cutting board for a few minutes before cutting out the cookies. Because of the almond extract, these are even good without decorating. Thanks to Pat for posting this recipe; it was used by the mother of my childhood friend, and I didn't think I'd find it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lara"
},
"reviewBody": "I have been making these cookies for the past 3-4 years. Over the years, I have tried other sugar cookie recipes and they have all proven one thing to me...don't change a good thing!! This cookie recipe is simply the best and the hint of almond flavour gives it a little something special."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23750/marys-sugar-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
"name": "Sugar Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23750/marys-sugar-cookies/",
"name": "Mary&#39;s Sugar Cookies"
}
}
]
}
}
, "about": [
]
}
]