				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Maryland Crab Cakes III"
,"datePublished": "2000-01-03T13:24:37.000-05:00"
,"dateModified": "2022-07-14T16:34:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jeff Hemerly"
,"url": "https://www.allrecipes.com/cook/24324138"
}
]
,"description": "Spicy crab cakes made with onion, celery, and brown mustard. Broiled to a golden brown."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bGFBkIkoQY_KUixffLVI6HovM2Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/33682-568fa21eb839484ba92774729a79112d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Maryland Crab Cakes III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "239"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "409 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "71 mg"
,"fiberContent": "1 g"
,"proteinContent": "19 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "820 mg"
,"sugarContent": "1 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.125 cups crushed saltine crackers",
"1 cup mayonnaise",
"1 teaspoon prepared brown mustard",
"0.25 cup chopped onion",
"1 stalk celery, chopped",
"1 teaspoon Old Bay Seasoning TM",
"1 pound crabmeat" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven on broiler setting. Lightly grease a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, mix together crushed saltine crackers, mayonnaise, brown mustard, onion, celery, and Old Bay seasoning. Gently stir in the crabmeat. Shape into 6 patties. Place on prepared baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Broil crab cakes 8 to 10 minutes on each side, or until golden brown."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenniearrinton"
},
"reviewBody": "We LOVED it! I used canned crab, reduced the mayo to 1/2 cup, added one egg, 1T worcestershire, increased the Old Bay to 2T and used 1T ground mustard vs. dijon. The yield was 8 large cakes that were as beautiful as they were delicious when they came out of the oven! I will post a pic next time which will be very soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "I have been making this recipe for several years and always receive rave reviews from guests. For the"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Gerry Wilson"
},
"reviewBody": "LUMP MEAT IS BEST! BLUE CRAB!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zhane"
},
"reviewBody": "substituted a few things but came out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J Packal"
},
"reviewBody": "Good recipe but I made a few changes -\n\nuse 1 1/2 lbs of lump crab meat\nno onions and a little bit of chopped sweet pepper in its place\n1/2 cup crushed saltines\n1/2 cup plain bread crumbs (plus a little extra)\n2 eggs\ndry mustard instead of brown mustard (cause I didn't have any)\nextra old bay"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MDG500"
},
"reviewBody": "These were so easy and really excellent. Not greasy like the kind you get in restaurants. Needed a little more mayo than called for. I mixed the ingredients with my hands because spoon or fork just left big clumps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRKDVM"
},
"reviewBody": "Really good!! I didn't have saltines so I used bread crumbs and substituted a small amount of corn meal for some of the bread crumbs. Also added a wee bit of cayenne pepper because I like things a little spicy. Definitely a do again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Charles Vansteel"
},
"reviewBody": "It was good but I expected better in the taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doc"
},
"reviewBody": "Great flavor, I am keeping this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Simons"
},
"reviewBody": "Cut the mayo in half and added 2 eggs and some Worcestershire sauce. Also, used half saltines and half bread crumbs. Broiled for about 7-8 minutes till golden brown. YUMMY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Doria"
},
"reviewBody": "Made this with the following changes/substitutions: 1/2 cup of crab meat, a generous 1/4 cup of vegan mayo (egg allergy in the house) and swapped the celery for red bell peppers. I just halved all the spices, onion and the rest of the ingredients to make half the original recipe. It made 6 small/medium cakes which was perfect for our family with 2 adults and 2 young children. My SUPER picky 5 year old inhaled his whole crab cake and younger brother tried a few bites (first tastes of crab) and the two adults had two nice sized cakes to eat. The flavor was great! They were super quick to make and to cook (broiled for about 5-6 minutes since they were smaller). I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Wilkinson St George"
},
"reviewBody": "These are absolutely delicious! In addition to the celery and onion, I add about 1/4 cup finely minced green bell pepper for extra flavor &amp; crunch!\n\nI serve them up by a portion of two or three cakes. I pour a generous portion of my doctored up thin brown gravy. Here's what I do:\n\nI take a packet of cheap plain brown gravy, following the instructions on the packet. To the gravy I add a couple of fat palms full of green peppercorns (sold by the jar in water). Make sure you strain the water off in a fine mesh sieve before adding to the grave, else the gravy becomes too thin.\n\nPlate them up with a serving of Fettuccine with Roasted Garlic Alfredo and a Cheddar-Garlic Biscuit like they serve at Red Lobster (you can find the recipe all over the internet for these). The combined flavors are like a party in your mouth! You can make about 16 cakes with this recipe. You can freeze or refrigerate the leftovers. If you freeze them, reheat by putting them on the tray of your toaster oven set to 350. Cook for 4 minutes per side. They retain their crunchy coating when reheated this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "Great as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pladiluv"
},
"reviewBody": "They taste very good but the first batch scrambled the second stayed together. Maybe I need some ingredient to keep it together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CWEST16"
},
"reviewBody": "I have made this recipe a few times. I am not from Maryland, but I do like crab cakes. The last couple times I have roasted a couple jalapeños and chopped them up. This adds a little kick. But these are really good with or without the jalapeños."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dmilosevich"
},
"reviewBody": "This was so easy to make and was delicious. I didn't have saltines so I used the generic equivalent of Carrs water crackers. Broiling them made them nice and crispy on the outside, and they held together nicely. I made them a bit smaller and thicker so I yielded 10 cakes. This will definitely be a regular meal at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emilyd617"
},
"reviewBody": "Great recipe! I made them tonight and my husband was really impressed bc this was my first time making crab cakes. I followed the reviews and did 1/2 cup mayo and 1 egg instead of 1 cup mayo. I also refrigerated the mixture for about 1//2 hour before making the crab cakes and they were super easy to mold and shape without falling apart. Next time I'm going to try and make them a little bigger, but this is a great and simple crab cake. We live in MD so we get a lot of good crab cakes at restaurants and both agreed that these were better then most restaurants serve! Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ttgaymasaba"
},
"reviewBody": "Did add an egg due to clump falling apart also instead of saltines I used Ritz garlic crackers. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed's Kitchen"
},
"reviewBody": "First time making crab cakes. Everyone loved them. I used the club crackers and canned crab and should have added some bread crumbs to firm them up. You learn from trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "late4supper"
},
"reviewBody": "As someone who's lived (and eaten crab cakes) in Maryland most of my life, I can assure you that this crab cake recipe is the real deal. I've used this recipe about 5 times and have found that the cakes seem to stay together a little better if you dice the celery into small pieces rather than chop them. I also kick up the Old Bay by 1/2 teaspoon because Maryland is all about Old Bay seasoning. Use fresh back fin crab meat from Maryland, Virginia, or Delaware if it's available in your area. Serve with saltine crackers and cole slaw and a cold glass of beer. Thanks for posting this Maryland tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cuss10"
},
"reviewBody": "I prefer to use oyster crackers or stale bread instead of saltines. I use less mayo (as I am allergic to egg) and the smallest possible amount of oil to keep these together. I find backfin meat to be the best crab cake meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LuckyMom"
},
"reviewBody": "I made these for my husband tonight and he loved them. The only reason I did not give 5 stars is because I changed the recipe a bit. I used just regular prepared mustard instead of the brown mustard, I also did not have the celery so I didn't put that in. For the seasonings I substituted red pepper flakes, cayenne pepper, paprika and hot mustard powder and some garlic salt in place of the old bay seasoning, I also added an egg to help it stick. Finally I used imitation crab meat instead of regular crab simply because I didn't have any regular crab, and I fried them instead of broiling. I must admit that the spices added a little bit of a kick but not so much to make it too hot to handle and my husband and I like spicy foods however the kick was mostly in the after taste. We dipped them in ranch dressing. Needless to say they were a hit, I will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "flaglady"
},
"reviewBody": "Wow, sorry, that's way too much crackers and mayo for me. I had a hard time with this. I'll find a different recipe. Sorry Jeff! I like just a little mayo and a little bread crumbs with an egg to hold together. Keeps the cakes nice and fluffy and lumpy! Can somebody tell me if some of the pics are so dark that the cakes look burned and flat or is it my computer screen?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johanna De Boer"
},
"reviewBody": "Wow!\nSo easy to make...and I followed some alt suggestions as posted by previous reviews...breadcrumbs and the use of eggs.\nJeff has given us a fantastic recipe that I will definitely make again and again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeachRedHead"
},
"reviewBody": "Good stuff! My wife loves crab cakes... she comes from a non-seafood family but she got hooked on crabcakes at a lovely restaurant on our honeymoon. This recipe is as close as I found to those crabcakes yet. She's not quite rolling her eyes back in her head and sighing with luxurious exuberance when she tastes these... but it's close. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KBlockowitz"
},
"reviewBody": "I was able to make these for a large dinner party because they were so easy to broil in the oven. Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "I took the idea from other reviewers to cut the mayo in half and add two eggs. I also pan fried them. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Thomason Arnold"
},
"reviewBody": "It was just OK, but easy to make. IF I make it again, I will follow some of the other reviews suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PINKXG1RL"
},
"reviewBody": "these were just ok.... i used green onions, halved the mayo and added an egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Goff Tripp"
},
"reviewBody": "Seriously good recipe! Just by reading it I thought it might be a tad bland. Perfect seasonings for such an easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Beth Martin"
},
"reviewBody": "Super easy, as good as any you can buy! I used a combination of ritz and saltines. Need to watch the broiler cause easy to burn. New Favorite recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tperry1234"
},
"reviewBody": "Very tasty, but too salty. Maybe I will try panko bread crumbs next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "columbusiiii"
},
"reviewBody": "DON'T USE SALTINES!!! We just made them and they are way to salty. We are however intrigued and will make them again soon. Minus the killer salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "We really liked these! I halved the recipe and used wheat saltines. I served these as a side dish to the seafood enchillada recipe from this site. I will be making these again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Love it! I used round crackers instead. It was the only thing on hand. I fixed it with Amatricana. It went together perfect. You can look the recipe up on here too. I will be making this again.. maybe for guess! Thanks for sharing this with us!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kilikena"
},
"reviewBody": "This was a great base recipe to work from as we did not have all of the ingredients but made it work with what we did have and they turned out awesome! Instead of crackers we used panko breadcrumbs, used 1/2 mayo, added 2 eggs, added dried parsley and Italian seasoning. I sauteed them with some EVOO and they were fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRGRIFFITH02"
},
"reviewBody": "I needed to use canned crabmeat (3 cans = 18oz) and had to adjust a bit for that, but I combined the main recipe with suggestions from an earlier review. Hubby said fresh crab would have tasted better, but canned was still very tasty. Also, I am allergic to eggs, but my Vegenaise tastes just like mayo and the kids even liked these. 1/2 C Vegenaise, 1 1/4 C regular bread crumbs, and 1 1/2 tsp of Old Bay are the changes I made - I will be adding this to my recipe box and this one's going in the monthly rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LFeeley"
},
"reviewBody": "Excellent! These taste even better the next day when reheated, so I remember this recipe when I need to prepare things ahead for entertaining. Also the first time I made the recipe I used Ritz Crackers and that gave them a nice buttery taste. Either cracker works well. As a rule, I prefer to reduce the mayonnaise to 3/4 or 1/2 cup and they are not as mushy. GREAT and EASY recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "everythingfresh"
},
"reviewBody": "This is the best recipe among the crab cakes I've tried. Easy and delish. I make small cakes when preparing a nosh buffet and people love them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rainy"
},
"reviewBody": "They were too bready for my liking...if i ordered these out I would have sent them back. I did take some advice for other reviews added a egg and cut back on mayo...still not a fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hckygrl"
},
"reviewBody": "I made the changes (decreased mayo to 1/2 cup, added 2 eggs; changed 1t to 1T on old bay seasoning and I omitted the mustard).....they were great!!! Better than the restaurants!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADFerris"
},
"reviewBody": "I really wanted to give this recipe 5 stars, because I've finally gotten the \"base\" recipe that I needed to make the crabcakes that I love so dearly... as do my fellow Baltimorian neighbors. Unfortunately I agree with the other reviewers that some tweaking is definitely needed. I agree on halving the mayo and adding a couple of eggs. I've played with this recipe a good deal and while they seem a bit wetter, the final product is considerably better in both flavor and texture. I would also HIGHLY recommend measuring your Old Bay with T rather than t. Granted, I'm in MD where Old Bay is more popular than salt and pepper, but while I don't measure, I've got to be around 2T and I've gotten nothing but compliments. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wilemon"
},
"reviewBody": "I made these by the recipe and they were pretty good but not great. I am going to make these again using an egg for binding and add tablespoon by tablespoon of however much mayo is needed. I am going to omit the celery and add roasted red bell pepper. I will use Panko bread crumbs instead of the saltines; will also coat with the Panko and fry them instead of broiling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmae2323"
},
"reviewBody": "mixed saltines and breadcrumbs about half and half...delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Definitely took me longer than 20 minutes to darken enough but other than that pretty good. I threw in some green onions and used a little less crab meat. The patties had some trouble sticking together, not really sure how to solve that though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "justinhowell"
},
"reviewBody": "Good recipe, add a tsp of worchestershire and top each crab cake with a healthy dose of Old Bay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rebekah"
},
"reviewBody": "These were great and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boscaboo"
},
"reviewBody": "YUMMY AND EASY!!! The only changes I thought made were to decrease the mayo to 1/2c, 2 eggs - But I re-read the ingreds, and I added 1T of old bay, (yikes) and then I added another 1/2T!!! But, both of the kids (10&amp;12) and my hubby LOVED them. I don't think it/I ruined them in anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NANCYLOUISEB"
},
"reviewBody": "I increased Old Bay Seasoning to 1 1/2 tsp. Added 1 tsp parsley for color and seasoning. I refigerated the mixture for a few hours before shaping. I also put them together about 8 hours ahead of time and they were great. I cut them out using a cookie cutter as I wanted them to look professional and they did. I baked them at 350 degrees until hot and cooked through. Then I put them on a low broil setting for 2 minutes on each side to make them a golden brown. I served them with crab cake sauce from this site. The one submitted by sal. This was all delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wayne Lunsford"
},
"reviewBody": "Good taste, but a bit too oily for me. Also had trouble keeping the patty together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jhmjmom"
},
"reviewBody": "This recipe has made me a legend among my family and friends. Living on the Eastern Shore, you HAVE to know how to make good crab cakes. I only make these with fresh, jumbo lump crab meat (at $25-30 a pound!) and only for special occasions. I use Ritz crackers. There is just enough good stuff to hold them together without compromising the taste of all that yummy crab. My husband won't order them in a restaurant anymore. THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sgawron"
},
"reviewBody": "This recipe is a big hit in our family and with friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Paradis"
},
"reviewBody": "Outstanding! We were on the OBX sound side and caught our own crabs. I left out the celery and added about a 1/2 lb of crab than what the recipe calls for. I also used dijon mustard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GEORGIASHOME"
},
"reviewBody": "I find that when I broil them they get too dry. Baking them on 350 until golden brown is perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "angela"
},
"reviewBody": "These are very good. I cut the mayo in half and added an egg instead, they stayed together well. For the crab meat, I used all fresh crab- 1/2 lb lump crabmeat and 1/2 lb claw meat. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azrefugee"
},
"reviewBody": "Excellent recipe! I used stone ground crackers instead of saltines and had to increase the quantity a little but since we don't like our food very salty these came out perfect. I served them was a tomato bisque also found on this site and they were perfect on the first cold snowy day in Colorado."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I LIKE FOOD"
},
"reviewBody": "Absolutely wonderful! I chopped the onion and celery very finely and cut the mayo in half as suggested. My husband thought they were perfect. They could have been a little more moist for me (I will try sauteing in butter and/or adding eggs next time), but are still some of the best crab cakes I've ever had...and I'm VERY picky about my crab cakes. I was surprised that such simple ingredients (esp the saltines) worked so well. No mealy or grainy taste. On top of it, they're better than and at least half the price of what we would have paid in a restaurant! I will DEFINITELY make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VJOHNSON"
},
"reviewBody": "Fantastic! I substituted half the mayo for 2 eggs as suggested. I was at a friend's house when I made them and had no Old Bay Seasoning on hand so I improvised with as many as the spices used in Old Bay as I could (minus the cadmium, celery salt &amp; ginger). My friend was out of bread crumbs so I just used the saltines. I added a tiny amount of Miracle Whip to cut the saltines and I lightly sauteed in butter-WONDERFUL!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Audra Schell Ganiear"
},
"reviewBody": "Tried this recipe which I found to be a bit bland and soggy. Depending on your taste for more zest - you may like to substitute dijon mustard. Also, I ALWAYS use panko crumbs now as they are so much lighter and crispier (found in the Asian food section at the market). Bought fresh crab from the store and made the following adjustments on the next round. I also added a bit of lemon juice, soy sauce, and hot sauce for flavor. Mix all of the wet ingredients together first then carefully mix in crab so that it doesn't break into small pieces. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UGAdawg"
},
"reviewBody": "We are very picky when it comes to our crab and these are perfect! Chill mixture and use ice cream scoop, cookie scoop or 1/4 cup measure to form a perfect cake! I used buttery crackers instead of saltines - definitely more flavor. Used only half cup of mayo but added an egg. I get a dozen 1/4 cup cakes from 1 lb of premium lump crab meat. Great for entertaining ~ $1 crab cakes but they taste like a million...you can make them earlier in the day and then just pop them in the oven when you're ready!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Grieb Bair"
},
"reviewBody": "We made these just as the recipe states and they turned out wonderful! We prepped/shaped them earlier in the day since we had a very busy evening and then broiled them for a quick dinner. So delicious! Next time I'll add more Old Bay because that's what we like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Joy"
},
"reviewBody": "AFTER READING ALL THE REVIEWS: I tried this several recommended ways, and this seems to be the key to a happy crowd for us.. 1) changing mayo amount to 1/2C or it turns out to be very greasy to us. 2) add chopped green onion and red pepper (eyeball amount) esp since most our friends aren't onion fans 3) add 1/8C parsley 4) 1.5t Old Bay Seasoning, and lastly I followed the advice of putting a dash of Worcestershire's and lemon juice. What a hit this was. If you use the broiler instead of frying on med-high ...please check them often as they should not dark in color as some have shown but a golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. McEvoy"
},
"reviewBody": "My family loves this recipe! I followed it exactly, and the crab cakes turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lighthouse7"
},
"reviewBody": "Bottom line: This is a bullet proof recipe, simple and elegant. We used fresh crab meat from Crisfield MD, the alleged crab capital of the universe. Can be modified in different ways for different tastes, but basically, it's the best we've tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bevi"
},
"reviewBody": "I love crab cakes. I made these last night and had to put them into the freezer to stop eating them. I love this recipe.I added old bay and a dsah of cayenne! This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "ABSOLUTELY AMAZING! I made these last night - but I didnt have real lump crab. I had to use the imitation crab, because I just couldnt wait to try this. I know that for purists that might be a mortal sin, but it turned out FANTASTIC. My guy said \"it's the best thing I have ever eaten in my life\" Now I have to go out and get the real lump crab - which will probably curl his hair :) and get me flowers :) Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rez"
},
"reviewBody": "Followed the recipe and they are awesome!! Have eaten them over and over. Will serve to company. For the saltine crackers I used whole wheat. 4 cans of jumbo lump crab meat make a pound of crab meat. Made 7 LARGE cakes. Does not need sauce but would be nice for company. Sprayed them with pam and flipped at 10 minutes broiled an additional 5 minutes on a middle rack. I don't like them as dark as in the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BAJANCHEF"
},
"reviewBody": "Yummy! I used this recipe combined with the one on the side of a 1 lb can of crab. So I ended up using 1 cup of breadcrumbs,1 whole egg and one egg white.I used the lite Mayo as well. Old Bay is not available where I am so I used another brand of seafood seasoning then added a little salt,onion powder,parsley and some black pepper.I baked them at 375 for about 30 minutes,flipping them after the first 20 mins. Mine didn't break apart at all and I ended up with 9 medium cakes.But very nice and full of flavour especially after they sat for a while and soaked up the flavours. I also made a sauce of mayonnaise,dijon mustard,hot sauce,worcestershire sauce and seafood seasoning which complemented the cakes so well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Marckwordt- Lowery"
},
"reviewBody": "Great flavor. I followed the recipe exactly, and had difficultly with the first flip of the cakes (as they were falling apart and sticking to the spatula). After removing from the oven when done, I let them stand for a few minutes and then hads no difficulty removing patties. Served them over pasta with a bit of parmesean, basil, olive oil, and crushed pepper--fiance loved it. I will most certainly make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "YUMYUMYUMYUMYUM!!!!!!!!!!!!!!!!!!\ncrab cake HEAVEN!!!!!\nyum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denice"
},
"reviewBody": "I love, love, love this recipe! Due to allergies, I have to use imitation carbmeat &amp; this has been the only recipe that adapts well to the change. My kids LOVE \"the crabbie patties\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CRANKERCHICK"
},
"reviewBody": "I used this recipe for making crab cakes for the first time. I use less mayo (probably half as much), a little mustard, and substitute breadcrumbs for the saltines. I also saute the onion and celery in a bit of butter (don't like biting into crunchy veggies crab cake). If you have time, definitely let the shaped cakes settle in the refrigerator for some time. It helps to keep the cakes together, especially if you are using less mayo. This is very good and the only way I make crab cakes. I do broil on low instead of high because I noticed the first time that the tops of cakes started to burn before they were heated throughout."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill"
},
"reviewBody": "My wife and I have used this recipe many times. I add more Old Bay Seasoning than the recipe calls for. It is one of our favorite dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin H"
},
"reviewBody": "This is a great recipe! Like others, I added a few of my own ideas. I added a little cajun seasoning &amp; cayenne, and I increased the amount of mustard. I sauteed in a very small amount of olive oil, then I put them on a broiled portabello mushroom, sprinkled with a little parmesan, and my husband went through the roof."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chendric"
},
"reviewBody": "These were excellent. I think I followed the recipe almost exactly except that I probably used fewer crackers than the recipe asked for because I didn't want to open another sleeve. They still turned out great! I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lifetrooper"
},
"reviewBody": ""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy Chaney"
},
"reviewBody": "This is just okay. I prefer to use 1-2 tablespoons of soft breadcrumb, much less may and one egg to bind it together. I do not like the onion. Also, you should shop for fresh not canned meat, preferebly lump blue crab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JerryFLA"
},
"reviewBody": "I thought I had a good crabcake recipe, with not much but saltines, egg, and some spices mixed with the crab meat then fried. But this recipe is much better, IMHO. \n\nI had to substitute Club Crackers for Saltines, which made the dish a little sweeter than I would have liked. I think with saltines it will be great. \n\nAnd next time I might add just a bit more mayo, since I love it so much. And after that, i might mix in some some melted butter with the crab, because it's, well, butter.\n\n\nI used Phillip's Backfin, in the can. \nI may have set the pan too close to the broiler, since they started to overbrown at about 6 minutes. So keep an eye on them while broiling. \n\nThis is a definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Memphislady"
},
"reviewBody": "I am from New Orleans and this is not the sort of recipe that I am used to with sea food, but I had about two cups of left over crab meat and thought I would try it. I was blown away. The crab flavor is not lost in overpowering spices. With the addition of an egg, per some of the reviews, what we had was a firm, tender, succulent delicay. My teenaged kids went nuts over them. Next time, it wont be to use up left overs that I make these. Fit for company, for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Earnest"
},
"reviewBody": "The cooking time under the broiler was way too long. I set my timer for the first side and about halfway through they were already black. The flavor under the burnt outer layer was ok, but nothing exciting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "Excellent flavor but I had a problem with them falling apart when flipping them. Someone suggested that I fry them 1st then bake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harmony"
},
"reviewBody": "Yummy. The tip about using a 1/4 cup measuring cup to form the patties is very helpful. I also used 2 eggs and 1/2 cup mayo and refridgerated the patties for 1 hour. Cooked them on a pancake griddle and topped with some mango salsa and they were gobbled up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Pedigo Skaggs"
},
"reviewBody": "This was amazing! It tasted just like the real thing. Mine came out just a tad burned, so I'll broil a little less next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brooke Elizabeth"
},
"reviewBody": "I followed the recipe exactly, I even used $12 lb Maryland crab!--but it did not turn out. The cakes fell apart and, even after baking, did not stay together. I'm really not sure why... I followed the directions exactly. They still tasted pretty good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "I made these for Valentines day and they were a huge hit with my very picky husband. I cute the mayo in 1/2 and used one egg. They held together great and tasted awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MandaPanda1331"
},
"reviewBody": "Amazing crab cakes! My husband is a huge seafood lover and he loved these. He said that they were the best he has ever had - at home or at a restaurant. My husband claims he added a bit more brown mustard to give it a bit more spicy taste, but he loved it just as much. We will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the advice of other reviews and reduced the mayo to 1/2 cup and then added an egg. They came out really dry and really bland. I even added cayenne pepper,lemon zest and green onions. I think I prefer my crab cakes pan fried and dredged in bread crumbs instead. It seemed like a waste of crab for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURARICE"
},
"reviewBody": "My husband is from MD and I make these every few months. They are delicious. You have to be careful when turning them b/c mine have had a tendancy to break apart. Using two spatulas to turn has helped and also allowing them to get pretty crispy before turning them. Enjoy!\nThanks for the recipe,\nLaura"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefsazy"
},
"reviewBody": "Wonderful!!! I have tried several recipes trying to please my husband who has wonderful memories of Maryland crab cakes. This finally did it!!! As others, I cut mayo in half and added 2 eggs plus 1/4 cup red pepper. Thanks for the recipe!!! Note: These are very nice accompanied by \"Crab Cake Sauce\" also available on allrecipes.com, submitted by Joan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Mihu"
},
"reviewBody": "I love this recipe. I use a little less mayo and replace it with honey. Honey adds sweetness and brings out the sweetness of the crab. I also use less old bay and always broil these. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reah1125"
},
"reviewBody": "Loved this recipe! \n\nI made it for our family's New Years Eve dinner. They received rave reviews! I made just a few changes based on a combination of what the other reviewers said. I reduced mayo to 1/2 cup and used 2 eggs. I added a green onion, fresh parsley and a little bit of cayenne pepper. I did half saltine crumbs and half bread crumbs. I also put a little bit of butter on the pan when cooking. I served the cakes with a dollop of lime-cilantro mayo sauce and a garnish of lemon slices. They were so good! Will definitely use this recipe again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JUSTCYN"
},
"reviewBody": "I have never made crab cakes but have wanted to try them for eons. Being a crab cake virgin, I am not sure the experience satisfied as much as I anticipated it would though. I scaled this recipe for 4 and still had enough for 6 good-sized cakes. I made this ingredient-wise to a tee except I used crushed Oyster / Chowder crackers. (They are just like Saltines except little and round to float in soups and such.) I had some expensive claw crabmeat and wanted to stretch the 1 lb. can to make another recipe for the Holidays. When scaled the recipe called for 11 ounces (nearly ¾ of the lb). I used only half of it (8 oz. or so) AND when I crushed up my crackers I had more of those than the scaled recipe needed too. So less crabmeat and more filler crackers but the patties held together well with the same amount of mayo. I liked this being a broiled recipe too. I did put a little butter on top to broil. I found that they did fall apart if you try to flip them before they are really brown on top. Giving them plenty of time to crisp and firm up on the first side aided in turning them immensely. Probably a good recipe but personally I think cold crab salads and spreads bring out the flavor of the meat better. Hot cooked crab suits me better in hunks with drawn butter or perhaps in a fancy cheese rarebit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FROMMICHIGAN"
},
"reviewBody": "I used 1/2 the mayo and added 2 eggs. These tasted great and did not fall apart while baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "barbran"
},
"reviewBody": "The crab cakes were ok but pretty blah. I followed others' advice anc cut down on the saltines by using club crackers and adding a little cayenne and some diced red bell pepper with a little dab o buter on top, and also an additional egg for cohesiveness. Also used extra Old Bay seasning. We ate them ( they were not horrible ) but had two extra and tossed them out as no one --including me--was interested. I later found a recipe for 'spicy crab cakes' which is wonderful and has the taste we desire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Ballinger Januchowski"
},
"reviewBody": "Perfecto! I used other reviewer's suggestions and used 1/2 the mayo and egg. I also used green onion. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mr. Jackson"
},
"reviewBody": "We enjoyed this recipe. All of the adults who tried it agreed that there was \"something\" missing in the flavor department. I used lowfat mayonaise because that was all that I had. That may have been the reason why it wasn't quite as flavorful as we would have liked. I followed the advice of another reviewer of this recipe by using a 1/4 cup measuring cup to portion the crab cake mixture and it was a great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell"
},
"reviewBody": "Very very GOOD!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thistle53597"
},
"reviewBody": "Fabulous! Great that they were broiled, not pan fried. I substituted an egg for 1/2 of the mayo and they turned out fab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I followed the recs to reduce mayo to 1/2c and use half bread crumbs and have crackers. I didn't have Old Bay so I substituted a mixured of 'cinamon, ginger, nutmeg, salt, peper, creole seasoning, garlic, red pepper and paprika' I think it was close enough. I enjoyed the cakes and will make them again but I did find that 1/2 pat of butter on top made them just a little tastier and moist"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21475/maryland-crab-cakes-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1238/appetizers-and-snacks/seafood/crab/",
"name": "Crab"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1240/appetizers-and-snacks/seafood/crab/crab-cakes/",
"name": "Crab Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21475/maryland-crab-cakes-iii/",
"name": "Maryland Crab Cakes III"
}
}
]
}
}
, "about": [
]
}
]