				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mary&#39;s Gone Crackers® Copycat"
,"datePublished": "2019-04-03T23:59:39.000-04:00"
,"dateModified": "2022-01-14T11:50:41.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cazuela"
,"url": "https://www.allrecipes.com/cook/cazuela"
}
]
,"description": "Homemade gluten-free crackers just like Mary&#39;s Gone Crackers® crackers are easy to make using quinoa, brown rice, and plenty of seeds."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wLVVJL7xlTR8WteZAN1iRdqktWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8921569-38a7ce8a32f24531bb34ecc1eb7dadca.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mary&#39;s Gone Crackers® Copycat"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "25"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "126 kcal"
,"carbohydrateContent": "15 g"
,"fiberContent": "4 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "108 mg"
,"sugarContent": "0 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup cooked brown rice",
"1 cup cooked quinoa",
"2 teaspoons tamari (gluten-free soy sauce)",
"1 tablespoon water, or as needed",
"0.25 cup chia seeds",
"0.25 cup sesame seeds",
"0.25 cup flax seeds",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. Cut a small square out of a separate sheet of parchment paper and oil 1 side; set aside."
} ,{
"@type": "HowToStep"
,"text": "Blend brown rice, quinoa, and tamari in a food processor, adding water if mixture is too dry, until a dough starts to form. Add chia seeds, sesame seeds, flax seeds, and salt; pulse until dough is a sticky ball."
} ,{
"@type": "HowToStep"
,"text": "Roll small pieces of dough into 1/2-inch balls and arrange at least 2 1/2 inches apart on the prepared baking sheet. Place the oiled square of parchment paper, oil-side down, onto a dough ball. Flatten the dough ball into a very thin 2-inch-wide disk by pressing the top of a small jar onto the parchment square. Repeat with remaining dough balls."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until edges of crackers begin to brown, 10 to 12 minutes. Transfer crackers to a wire rack. Place the rack onto the baking sheet and return to oven."
} ,{
"@type": "HowToStep"
,"text": "Bake until crackers are dry and crisp, 2 to 3 minutes more."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ted6869"
},
"reviewBody": "Nothing here is what is in the Mary gone crackers. Shame on you posting this trash"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "High Topper"
},
"reviewBody": "Thank you for this recipe. I’ve made it several times and found the proportions work for different grains and seeds. I have used one cup of quinoa each time, but instead of brown rice I’ve use oat groats and barley successfully also. You can also double the amount of seeds in the recipe and it will come out just fine, just crunchier. For the seeds I’ve used hemp, pumpkin, buckwheat, and teff — all work well. Lastly, I bake them in the oven for 10 to 15 minutes and then finish them in the dehydrator on high overnight to get them extra crispy without additional browning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love these! I would add more soy sauce/tamari next time, 1-2 tsp more, and plenty of salt. I did a generous couple pinches and still needed more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpauligirl"
},
"reviewBody": "First time making these, and they turned out wonderful! I'm not crazy about quinoa, so used all brown rice, plus sunflower seeds, toasted sesame seeds, pepitas, and flax seeds. I treated this like rolling out masa for tortillas, so I placed a round of dough between plastic (like a thicker kind such as produce bags), and that worked out really well for rolling it out thin. Took a greased and floured pizza cutter to the crackers once I transferred it to the cookie sheet with parchment. Watch the baking time -- mine ran longer, maybe because I added a bit too much water. Better than store bought!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ccgramm"
},
"reviewBody": "Great! This brand cracker is the only one that didn't spike blood sugar for me. Your recipe is genius. How did you figure out Mary's uses cooked whole grain, not Flour?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lroberson9900"
},
"reviewBody": "So I'm giving this 5 stars because I like the idea. I love Mary's Gone Crackers so I thought I'd try this. I added pumpkin seeds and sunflower seeds because that's what's in the ones I've been buying. I added extra rice and quinoa but apparently not enough to make it all stick together. Kitchen looks like a bomb went off in it. Next time I'll stick to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RLHSnacker"
},
"reviewBody": "This is the second time I've made these. The dough comes together easily and they taste better than the store bought crackers (IMHO!). Tried baking them at a higher temp as one person suggested but that made the edges too brown, almost burned since the edges on my dough seem to turn out thinner than the middle. Just pulled those off (and ate them) and cooked the middle a little longer. Next time I will cut off the thinner edges of the dough to ensure a more even thickness of the rolled out dough. Then I'll reroll the cutoff portion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookin'"
},
"reviewBody": "I didn't want to waste time making tiny 1/2 inch balls, so for the first tray I made 1\"+ size balls or 24 crackers.\nFor the 2nd tray I simply rolled out the dough on a silicone baking mat, transferred the mat onto the cookie sheet, and scored the dough into rough squares with a fluted cutting wheel (gentler to the mat).\nAlthough the flavor is better than the commercial original version, I don't care for the tamari flavor so next time I won't use it, and will season with salt and herbs/spices.\nI also don't like quite so many seeds in them so next time I'll reduce the seeds. Think I'll also toast the sesame seeds before using them; maybe then I'll like the full amount called for.\nThis recipe is a good way to use up leftover rice and quinoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MBO"
},
"reviewBody": "Very easy! I’ll add some herbs next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thepickledgarlic"
},
"reviewBody": "Loved recipe. I used silicone baking sheets and rubber gloves to make small balls then flatten directly on sheet to avoid anything sticking. Flipped them and cooked a bit longer. Perfectly crisp. Also you can add water at any point if it dries out. I also tried rolling it on Silpat to cut squares. Works all ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Johnson"
},
"reviewBody": "Easy to make. I added a little oil when mixing and sprinkled with TJ Everything but the Bagel seasoning. Used smallest scooper to form balls and flattened. Baked on parchment using convection setting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Crackers taste great. I will add more seasonings next time. For my oven I had to cook at 400 degrees for 25-30 minutes. Next time I will try to make a roll and slice and bake. Making little balls is tedious. Otherwise, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Lasswell"
},
"reviewBody": "Easy, delicious, flexible!!! Yay! I just put everything in the processor at once and it worked great. I cooked 10 min, flipped with the greased parchment, cut into crackers with pizza cutter, and cooked 10 more minutes. I didn't roll it out very evenly so some cooked more quickly than others. Just took those out, started devouring them, and put the rest back in for a few. Thanks for this recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Lee"
},
"reviewBody": "Great recipe! It's nice and simple and turned out great! I ended up just baking mine for 20 minutes, rotating halfway and they turned out nice and crispy. I personally found the flax to be annoying to work with so I'd likely reduce the amount next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "I don't know how this compares to the original, but boy, I love these! Gotta be careful or I'll eat them all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Wilkerson"
},
"reviewBody": "I just finished tasting my first batch--FANTASTIC! I used lite soy sauce and did roll the dough out between oiled layers of parchment, then cut it with a pizza wheel before baking, as suggested by some of the other reviewers here. They're nutty, they have a nice crunch, and will go great with a nice bowl of soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "njmom"
},
"reviewBody": "wow - these turned out good! a little salty, but that was my fault. i should have tasted before baking. i used some trader joe's everything bagel seasoning, somehow i had 3 bottles of it .\ni think they came out better than the boxed crackers. easy peasy to make too. i will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slackgeek"
},
"reviewBody": "These are great! I had added them to my favorites a couple of months ago as I love Mary's Gone Crackers and was looking for a less expensive alternative. I completely forgot to make them until I was scrolling through my favorites last night and came across them again. I followed the recipe exactly except I added a tablespoon or two of pepitas (raw pumpkin seeds) in addition to the rest of the seeds. This is so versatile, I want to make several different flavors! I did make the mistake of trying to use grease foil instead of parchment because I did not have any parchment. They stuck pretty badly, but I was able to peel them off anyway. I used wax paper trickled with water to squish down the balls. Originally had planned on making a full sheet and cutting them with a pizza cutter, glad I didn't because it would have been impossible. Lesson learned: if you don't have parchment, best to stick them straight to the cookie sheet. Mine did not come out super crispy even in the second go around in the oven, but they are still so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sorenson32"
},
"reviewBody": "I loved these. Similar to another reviewer, I rolled these out rather than dropping them in balls. I also added extra soy sauce. I am about to make another batch trying some new flavors. This is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Clarke-Giberson"
},
"reviewBody": "Fabulous, easy, quick. I didn't bother with the balls and the squishing with greased parchment. I just rolled the whole mess between two sheets of greased parchment and scored it with a pizza cutter (also greased). \n\nWill make again with different combinations of ingredients!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel DePaoli"
},
"reviewBody": "This recipe is awesome! \nI recommend making a quarter batch so you don't overwhelm your food processor because the dough is VERY sticky! \n\nI have started to experiment with different spice flavoring combinations like Rosemary and Garlic, adding nutritional yeast, and even a little goat cheddar. Every batch comes out better than the last."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/242058/marys-gone-crackers-copycat/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
"name": "Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16212/appetizers-and-snacks/snacks/crackers/",
"name": "Cracker Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/242058/marys-gone-crackers-copycat/",
"name": "Mary&#39;s Gone Crackers® Copycat"
}
}
]
}
}
, "about": [
]
}
]