				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Meat Filled Manicotti"
,"datePublished": "1999-10-23T12:42:44.000-04:00"
,"dateModified": "2022-07-14T18:06:36.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Steph"
,"url": "https://www.allrecipes.com/cook/4249"
}
]
,"description": "A pleasing blend of ground beef, cottage cheese, mozzarella, Parmesan, egg whites and dried oregano is stuffed into large tubes of cooked manicotti in this satisfying baked dish. Blanket the stuffed pasta with spaghetti sauce, top with cheese and bake."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/sagci7fur7SO7W4Nz8gxYmOito4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/338958-03d401091af24ee7a4567de7e4346f90.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Meat Filled Manicotti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "231"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "668 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "104 mg"
,"fiberContent": "5 g"
,"proteinContent": "40 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "1249 mg"
,"sugarContent": "15 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (8 ounce) package manicotti pasta",
"1 pound lean ground beef",
"1.5 cups cottage cheese",
"2 cups shredded mozzarella cheese",
"0.5 cup grated Parmesan cheese",
"2 egg whites",
"0.5 teaspoon dried oregano",
"1 (32 ounce) jar spaghetti sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain and cool. Reserve."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, in a large skillet brown beef on medium heat. Drain and cool."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine beef, cottage cheese, 1 cup mozzarella cheese, Parmesan cheese, egg whites and oregano. Mix well. Stuff shells with mixture."
} ,{
"@type": "HowToStep"
,"text": "Lightly grease a 9x13 inch baking dish. Pour enough spaghetti sauce in dish to cover the bottom. Place stuffed noodles in the dish. Cover with spaghetti sauce and top with the remaining 1 cup mozzarella cheese. Bake in preheated oven for 50 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy-Dru Flowers"
},
"reviewBody": "This came out great! Very filling as well. I served it with garlic bread, a perfect match."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mikiepen"
},
"reviewBody": "Recipe was good. I found that my Italian Mother's measuring is best for ALL recipes. That means \"MORE \" of everything, not a lot more, but MORE!!! GOOD LUCK AND GREAT EATING!! MANGIA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mhz021455"
},
"reviewBody": "My meat filled manicotti dish came out well. I added mushrooms to the topping sauce. The directions were clear and easy to follow. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dixgwood"
},
"reviewBody": "I made this last night for supper and it turned out great! I took the advice on cooking the noodles for half the time on the box which made filling them much easier. I waited to put the mozerella cheese on until the last 5 minutes. Only used used half cup cottage cheese and used the Italian Blend cheese instead. The only thing I would add is is a layer of spinach on top otherwise it's a great idea for supper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "I made this with ricotta instead of cottage cheese and because I have a small family I used half a pound of Italian sausage for the sauce and half for the filling turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie C"
},
"reviewBody": "Made from the recipe, the past was overcooked, the filling is bland and there wasn't enough sauce. Next time I will shorten the time the pasta is cooked, use onions and garlic with the filling and try sweet Italian sausage instead of ground beef to give the filling more flavor. I'll also use a jar and a half of sauce. Real Italian food is much more flavorful than this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Klassen"
},
"reviewBody": "Added ricotta cheese and sour cream because I used dry cottage cheese\nAdded garlic\nAdded basil\nAdded salt and pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Rose"
},
"reviewBody": "I have made this recipe as is and it was pretty good. I do not cook my pasta before hand, I fill the noodles, put them in the pan and add a half a can of water over the noodles and sauce. They're perfectly cooked when the dish is done. This time I made it with part beef and part hot Italian sausage, it was good as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chad Lynch"
},
"reviewBody": "Hard to fill but good eating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I made it with Italian sausage, so so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julius David Gaudet Jr."
},
"reviewBody": "Had to add some salt and fresh ground black pepper to the meat stuffing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Rae"
},
"reviewBody": "I made this and immediately made a couple changes. First I use mild Italian sausage and because the sauce was already Italian I just added some onion peppers and mushrooms I like to oven fry some eggplant and Warm Italian bread with plenty of garlic and butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mr. drinky"
},
"reviewBody": "5 stars with changes. I added a little hot Italian sausage to the beef. 2 whole eggs instead of just the whites. 3 Tbsp of tomatoe paste to the mix as well. I also added both minced onion and celery to the meat. Along with a clove of minced garlic. Like others, I half boiled my noodles. Sprinkled the top with a little grated parmesan with the mozzarella. Baked covered for an hour , remove cover and a quick broil to brown up the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie the GREAT"
},
"reviewBody": "next time I will be more sauce, it was a little dry. tried both ricotta and cottage cheese. ricotta held together better, but cottage cheese was creamer. I also added spinach and loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joanna Pielsticker"
},
"reviewBody": "This is the first recipe I have used that the meat is cooked before filling the manicotti. It was very good. Although I did do a few tweaks of my own. Nothing major, made my own sauce and a little extra meat. I topped it with some shredded cheese and Parmesan. It was very tasty. I will add it to my cook often list!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MaryD"
},
"reviewBody": "Made according to recipe. It was good, but didn't \"wow\" anyone. Will go with lasagna next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Noll"
},
"reviewBody": "No changes and yes I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeb Baker"
},
"reviewBody": "I and my daughter made a double recepie. \n\nThe family flipped out over how good it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy L. Petersen"
},
"reviewBody": "I just finished eating this recipe. Excellent!!! Will be making it this way from now on. Cheese and meat mixture is SO much better than sauce and meat mixture. I used 90% lean ground beef and ground turkey (50/50 mixture). Also, I used that Kraft shreaded mozz cheese with cream cheese in it.. EXCELLENT !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cari Fischer"
},
"reviewBody": "Thank you for sharing this - we LOVE this recipe - it has replaced lasagna at our house! I use the whole eggs (we love yolks), sub 1/4 beef for sausage, add a couple of tablespoons of fresh parsley, a medium onion sauteed, a Tb of each garlic and onion powder, and black pepper to the mixture --- tonight we tried the italian blend shredded cheese in lieu of mozzarella and it was a good switch. I also par boil the noodles based on the reviews &amp; cover with tin foil until the last 15 min. Thank you again - you're a star for sharing this with the world!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Little"
},
"reviewBody": "Sooooo good. Cottage cheese is a must as it is more moist than ricotta. If you made it with ricotta now make it again with the cottage cheese. I made homemade pasta lasagna sheets and used them for a manicotti roll-up. Much easier than stuffing tubes and makes the pasta delicate and light. Thank you for this incredibly tasty dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob in West St Paul"
},
"reviewBody": "I am trying to start cooking more often, and don't really have a lot of experience with anything but the most basic dishes. This one looked a bit complicated for someone of my skill level, but I tried it anyway. I couldn't find manicotti shells, so I substituted cannelloni instead. Other than that everything went according to plan, and it turned out really well. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "Made this as stated in recipe &amp; it was a big \"hit\" with my family! Left overs were delicious also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linda b"
},
"reviewBody": "Very nice results. I filled the noodles uncooked. I topped it with a white sauce - like Alfredo sauce then covered that win tomato sauce and left it overnight. This added moisture and flavour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Neligh Umatum Vandersommen"
},
"reviewBody": "I have never made manicotti before so I looked at the tips and ratings first. I substituted ricotta cheese instead of the cottage cheese, added parm and jack cheese too. I loved it. thanks for the basic recipe! its a new fave in the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NormD"
},
"reviewBody": "I used Italian sausage instead of ground beef. It was delicious. I think it could use more sauce than called for in the recipe, too. I'll probably double it, next time. Overall, I think this is a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julio"
},
"reviewBody": "No changes made. Came out great. Will definitely repeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelea"
},
"reviewBody": "Definitely use a pastry (ziploc) bag to fill the shells! Makes the job much cleaner and easier!!May as well use the whole 2 cup container of cottage cheese too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "I made this recipe with cottage cheese and without, (some family members don't like cottage cheese)and stuffed it into my fresh made pasta and it was mouth watering. thanks so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WV Cooks"
},
"reviewBody": "I made it and added garlic, black and red pepper to the beef, plus a bit more sauce than the recipe called for (for reheating). Turned out great and will make it again. Is there a reason I can't add the yolks?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra Rivera VanHorn"
},
"reviewBody": "I made just as in recipe, and it was delicious. I decided to stick with cottage cheese because I am not super fond of ricotta's grittiness, and I am so glad I did. The only thing I would try different next time is to cook meat with onions &amp;/or peppers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie Duke"
},
"reviewBody": "The recipe was great! I just substituted the cottage cheese for ricotta. My picky little ones would have even given it 10 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cochinkeeper"
},
"reviewBody": "so delicious!! The only thing I changed was ,I used ricotta instead of cottage cheese . And added onion to the ground beef. This is easily my family's new favorite !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAZSIL"
},
"reviewBody": "Wonderful! Made a double batch and froze 1/2. Used Stephanie's Freezer Spaghetti Sauce from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vaughn's Vittles"
},
"reviewBody": "The changes that I made were to season the ground beef. You can also substitute ground beef with chopped button mushrooms if you do not use red meat making sure to season the mushrooms with Italian seasoning sauteed in a little olive oil. If you spray the foil lightly with your favorite oil, you do not have to worry about the cheese sticking. I use ricotta cheese in place of cottage cheese, because this is usually what I have on hand. I also use jumbo shells for easy stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron N Rhonda Lewis"
},
"reviewBody": "AMAZING! my daughter doesn't like any kind of pasta but I used a recipe I found on All Recipes to make my own noodles and they were absolutely Amazing....Manicotti Shells is the title of the recipe I used.... 5 STAR for me and my FAMILY!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AC14836"
},
"reviewBody": "I felt like the filling tasted a bit plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tayler Jones"
},
"reviewBody": "I made this recipe for my family and they absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avendesora"
},
"reviewBody": "This was excellent! Followed the recipe exactly, and I and my husband love how it tasted. Like others have posted, I used ziplock bag with the corner cut off for stuffing the manicotti. I will definitely be making this again - thanks for a simple yet delicious meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LYNNINMA"
},
"reviewBody": "Good basic recipe but I needed to make some changes to make it more authentic. Specifically: Added one small chopped onion and 2 cloves minced garlic and sautéed with the meat; used whole milk ricotta instead of cottage cheese and subbed one whole egg for the whites; and added dried basil also to the meat mixture as well as a pinch of nutmeg when mixing into the cheeses. Baked as directed. They were delicious served with a green salad and garlic toast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "Simple and easy. I went with a few revisions after reading reviews.. first I used ricotta instead of cottage cheese.. then I did as some others suggested and did NOT boil the noodles first, and also just used 1 whole egg instead of the egg whites. I just used a plain \"traditional\" jar of spaghetti sauce. I will try this again and use a different sauce, or add more herbs to a plain sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I love this recipe, but stuff jumbo shells instead (way easier). My boyfriend and I prefer it with Alfredo sauce instead of tomato, never any leftovers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlyn R."
},
"reviewBody": "I haven't ever made manicotti before, but I made this one and another plain cheese recipe last night. Both were AMAZING and super simple to follow! The only thing I did different was sub ricotta for the cottage - not a fan of cottage cheese, and it is wonderful! Is a huge hit at my house and will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Campbell"
},
"reviewBody": "Used hot sausage and ground beef. Added onion and garlic, and used ricotta...hard to please my meat and taters guy, but, he was pleased! He even helped me stuff the shells....lol Thanks for posting! goes in my rotation for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayelle"
},
"reviewBody": "I followed this recipe close except I used whole eggs instead of the egg whites and seasoned the meat with garlic pepper. I would encourage everyone to spruce up the meat mixture to your liking. My kids LOVED this. It tastes like lasagna. Also, I took the tip from a reviewer on a different manicotti recipe and used it here. It WORKED and I WOULD NOT lie about it: Do NOT boil the manicotti first. You do NOT need to cook it first. It's easier to stuff it uncooked (I used a pastry bag). Put 1 cup of sauce on the bottom of 13x9 pan. Arrange stuffed manicotti on top of sauce. Add 3/4 cup of water to remaining sauce in the jar, put the lid on it and shake to mix. Pour over the top and sprinkle with cheese. Cover the pan TIGHTLY with foil and bake for 45 minutes. Carefully remove foil (watch out for hot steam), and continue baking for 15+ minutes until cheese is bubbly. The pasta will be cooked perfectly. I can't imagine precooking the pasta......it would be mushy. Don't be afraid of the cottage cheese. It has more flavor and isn't as dry as nasty ricotta:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Goza"
},
"reviewBody": "Very good recipe. I did add garlic powder and season salt to the meat mixture. And 1/2 a small onion finely diced and sautéed with the ground beef. Also didn't use egg whites. One side note. Before you put into the oven cover with foil or the manicotti will dry out on the edges. Uncover the last 15 minutes to let cheese brown. Filling would also be great in lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marjorie Bransfield"
},
"reviewBody": "This was a great recipe. The mixture is alot so I suggest that you make two dishes of it and freeze one for a later date. I would also recommend adding an extra cup of sauce for moisture. All in all it was very good and everyone enjoyed dinner tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I added more spices, Italian seasoning, garlic to meat while cooking, froze half without sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Rader"
},
"reviewBody": "I used this filling for jumbo shells and thought it was fabulous! Instead of 2 egg whites I used 1 egg and added garlic salt. Otherwise, I followed the recipe exactly. I followed previous reviewers suggestions to smash the hamburger very fine and not to leave large chunks. I would strongly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jwsykes"
},
"reviewBody": "almost the best italian dish we've had. and we.ve ate plenty. added some onion and garlic and pepper flacks to the meat. excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparrow"
},
"reviewBody": "Made this last night, it came out very yummy. I subbed ricotta for cottage cheese because thats what i had on hand. Overall i enjoyed the dish. i seasoned the meat with garlic, basil salt and pepper, didnt have any oregano. next time i think i will add some chopped onion when i cook the meat for additional flavor. it was easy to make, just took a while in the oven. nice dish if you're having a few people over, i got 13 shells out of it. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ACOTERILLO"
},
"reviewBody": "Fun to make. Takes a while. Aboslute HIT in the house! Definitly try this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingInSeattle"
},
"reviewBody": "Made with homemade noodles from this site and america's test kitchen manicotti sauce. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SPRYTE112"
},
"reviewBody": "Not bad, but not spectacular either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianna"
},
"reviewBody": "Great recipe... However, a little too heavy, so I customized - I used turkey and low fat ricotta and mozzarella. Served with a light side salad, and turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire Wang"
},
"reviewBody": "Amazing! This was my first time making manicotti and it turned out fantabulously. Instead of boiling the manicotti, I boiled water, placed manicotti in, and took it off the stove to make it easier to stuff. I just stuffed it with my fingers; it was very easy. I also used mild Italian sausage in place of beef which gave it a nice flavor. All in all, a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Staloch"
},
"reviewBody": "Turned out pretty good! I did add some mushrooms and spinach to the filling because I had some on hand that I needed to use up. A little difficult to stuff the shells, but other than that I liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lois"
},
"reviewBody": "I use sweet italian turkey sausage instead of beef and no boil barilla lasagne noodles. If you soak them in hot water for 5 minutes they are soft enough to fill and roll - it's way less messy than stuffing shells..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ellen Gibson Morris"
},
"reviewBody": "This turned out very well for me. For the most part I stuck to the recipe, but I did use ricotta instead of cottage cheese, and added 1 egg, garlic powder and onion powder to the cheese/beef mixture. I used a ziploc bag to fill the tubes of manicotti, which I cooked only 5 minutes, then rinsed in cool water. They were easier to fill that way, but it's important to fry out the burger (or sausage) and make sure there are no largish chunks of meat, because the finer you fry it out, the easier it will be to use a ziploc or pastry bag to fill the tubes. The amount of cheese/beef mixture came out just about right for the manicotti. I liked the amount of a 14 oz. jar of sauce, since I'm not such a great sauce fan, but I rinsed the jar with about 1/4 cup of water, which I added to the pan to make sure the manicotti finished cooking (it did). I topped it with mozzarella and grated Parmigiano Reggiano, then covered it nice and tight with foil and baked it for about 45 minutes. I didn't have any trouble with the cheese on top burning! I guess my top tips are frying out the meat as fine as possible, lining the pan and covering it with non-stick foil, and after you fry out the meat, turn it into a colander and rinse it with cool water to cool off the meat and rinse off any fat. (Don't forget to let it strain to get rid of the water.) That way it won't be hot and melt any of the cheese, and the filling will be easy to handle. It was delicious and there were no leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Wow! Tasted great! I only boiled the pasta for 5 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelso"
},
"reviewBody": "This is a huge hit! I added a few extra things, for one, a little sauce in with the meat towards the end along with garlic, minced onion, italian season vs Oregano (didn't have any) and the classic S&amp;P. We're huge garlic lovers, and I add over seasonings to all my hamburger so what can I say. We also got the whole bottom spaghetti sauce, top alfredo from another recipe here, works perfectly here! I agree that the trick is to only cook the noodles until they are slightly cooked, they'll cook the rest of the way in the oven. Though I filled mine with a spoon, the pastry bags didn't work for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Corabee"
},
"reviewBody": "Very Good! I did what other reviewers suggested and used onion and garlic with the meat, also substituted ricotta. Most importantly, I used half ground beef, HALF MILD ITALIAN SAUSAGE, and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizzy"
},
"reviewBody": "Delicious recipe! Easy to make and results in a wonderful dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy Freed Meyer"
},
"reviewBody": "Followed the recipe, it tasted good but it was bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "themrs720"
},
"reviewBody": "Delicious! I used Ricotta (didn't have cottage cheese on hand). But I know for a fact cottage cheese is wonderful in Italian dishes. This is a little time consuming, but can be made up in advance-which is a positive. Will add seasoning to the meat next time. Other than that, awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "poor mike"
},
"reviewBody": "WOW, why only 4 stars? step 2 you gotta season the beef ,i did season salt,1/2 tbls of smashed garlic, pepper, italian spice,thats me, but you gotta hit it with something.and yes more cheese! as for cooking the noodles, they got 5 min. at a full boil then ice cube and water dip they were still firm and could easaly be spoon filled,and yes top with cheese 10 min before end.....good luck"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jubilou"
},
"reviewBody": "Yummy! I used ricotta instead of cottage cheese. \nFor the filling, I used the egg whites and cheeses with ground beef, mushrooms, red onions, and spinach. I also added minced garlic, onion powder, black pepper, chili powder, oregano and basil. I mixed my leftover \"stuffing\" with the remainder of the spaghetti sauce and poured it over the manicotti, baked for 40 min, then added shredded mozzarella and shredded parmesan in the final 8-10 min. \nIt was beautiful and delicious! Will make again, probably for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RFclipse"
},
"reviewBody": "."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pphanith"
},
"reviewBody": "this was easy and yummy! I used ricotta cheese instead of cottage cheese like some of the users said and I also used Parsley, oregano, and italian seasoning....lets just say it was a hit! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alwaysgameforsomethingnew"
},
"reviewBody": "Very good! I took the advice of another reviewer and only cooked the pasta halfway.. made it very easy to stuff. I also added a little of the spaghetti sauce to the meat mixture to keep it moist. Will definatly be saving this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very, very good. Great recipe, just as it is! I love this! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merana123"
},
"reviewBody": "Very, very good. Great recipe, just as it is! I love this! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This is a regular in our household. It's super easy to make and we always have enough for leftovers the next day. I follow the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aof53"
},
"reviewBody": "This was my first time making a manicotti dish. Cooking the manicotti was the trickiest part. I didn't let the noodles even boil and only let it warm for five minutes. This recipe was very good. I doubled the shredded cheese because in my house there is no such thing as too much cheese. Next time I will take the advice of other reviewers and add some Italian seasonings to give it more pizazz. This is definitely a new favorite in my household!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Randy Larsen"
},
"reviewBody": "I won't rate this recipe because I haven't tried it yet. I make a similar recipe that includes a 16oz can of Spinach... Just an option some may like to try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "This was fun to make and tasty. I used jumbo shells cuz I had them in the pantry and I added salt and pepper to the meat/cheese mixture. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith"
},
"reviewBody": "Very good meal, but made a few changes suggested by others. Added mushrooms,garlic, italian sausage, and pesto to mix. Very good. Two of them were pretty filling. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KitchenMama88"
},
"reviewBody": "These were pretty good. My whole family enjoyed them. And I made them exactly as stated. I think with a few personal adjustments this could be a 5 star recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal Williams"
},
"reviewBody": "This dish was very easy to prepare. I made it as instructed but instead of 1 lb ground beef i used 1/2 lb beef and 1/2 lb ground Italian sausage and added onion and minced garlic! The combination of both meats were SO GOOD!! I will def save this one for later. Also I found that the cottage cheese was a little \"loose\" so i will try ricotta cheese the next time! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Rovang"
},
"reviewBody": "A good recipe. Excellent advice to put the cheese mixture into a plastic bag and cut the corner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msshahied"
},
"reviewBody": "My boyfriend and I made this \"together\" since we're in a long distance relationship and it was GREAT! Both of our first times making it and it was good. The only problem was stuffing them (a bit tedious, but worth it) and the noddles breaking. I think another reviewer mentioned not cooking them all the way through to prevent them from breaking so that might be a good idea. If you're a big fan of cheese, you might want to add a bit more also (which I'll do next time around because I just didn't think there was enough; but this was just a personal preference of mine). Moy boyfriends' turned out good too according to him."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "becky"
},
"reviewBody": "I like lasange better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pop"
},
"reviewBody": "My family love it,Thanks for sharing it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Andrea"
},
"reviewBody": "Very good, exactly as i expected, could be spiced up more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "terry"
},
"reviewBody": "Just made it today for the first time and it was very good!! thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marina"
},
"reviewBody": "this was amazing, I also used ricotta instead of cottage cheese. I also found that just soaking the noodles in boiling water for 15 minutes and then running them under cold water made it easier for stuffing them. My whole family loved them, and there wasnt even any leftovers!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "incredibly incompetent"
},
"reviewBody": "pretty good manicotti. I did make a few changes: used ricotta cheese instead of cottage cheese and 1/2 cup more. I also added a few 1/2 tsp of some different seasonings. The reason I took off a star is because I did make changes. In addition I would also leave the mozzarella off of the top until about 5-10 mins before it is done. This way the cheese will be melted but not burned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth Reye"
},
"reviewBody": "The taste was good, granted, but I followed the recipe exactly, and both my husband and I found the filling to be a bit dry. I'm sure some of that was my poor stuffing skills, but there was an element of moisture lacking - I will add extra cottage cheese for that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis"
},
"reviewBody": "Trying to stuff this manicotti always is my downfall. It tastes great even though the noodles are often torn for me. I love this recipe! I add Alpine Touch (only from Montana) and a bit of garlic. I also add a bit more spaghetti sauce. Thanks for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystina"
},
"reviewBody": "Excellent, added spinach, peppers, onions and garlic. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "I made this exactly as indicated and found the dish a little bland - too much meat and not enough flavor. I like the idea of using sausage and/or spinach. I'll probably use ricotta instead of cottage cheese. The suggestion to boil the shells for half the time worked great. They were easy to fill and finished cooking in the oven. I'll definitely be tweating this one a little bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "This really is wonderful! Followed jonkim92 suggestions and no one knew the ricottta was in it. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This is a fantastic recipe! I made only a couple of changes...substituted ricotta for the cottage cheese and mixed just a little bit of the spaghetti sauce in with the filling mixture. Don't worry if someone doesn't like ricotta or cottage cheese...blended in, it only adds flavor. My husband, that doesn't like ricotta or cottage cheese, didn't even notice that it was in there. I see that many reviewers are commenting on the difficulty of stuffing the manicotti. My grandmother always said that the best kitchen tool is your hands. I found this to be especially true with this recipe. Just hold the noodle in one hand and plug the end with your fingers and stuff it with the other - not rocket science! You can get them really full this way too. Make a full dish of this one - don't half the recipe because the leftovers are awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinRN"
},
"reviewBody": "Made with one change - used mild italian sausage instead of ground beef... Excellent!!!! My guests had 3rds! Will without a doubt be making again. Great meal to serve when you're having company since you can make all of it ahead of time, clean up before they arrive and just put in the oven an hour before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dana"
},
"reviewBody": "Followed recipe, just doubled. I did add onion per other recommendation, but still found it quite bland. was very surprised especially with all that cheese. will try again as good meal for a group and have to feed 7 kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foodie Family"
},
"reviewBody": "good recipe subed ricotta cheese for cottage cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon J."
},
"reviewBody": "The recipe looked really good, but didn't do well with my taste buds. The kids loved it, so I gave it 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Amsden"
},
"reviewBody": "As writen, I have to give this a 4....maybe even a 3.5. I was specifically looking for a manicotti recipe that used cottage cheese since I'm not fond of ricotta. This was good base, but to really get that exceptional taste I'm looking for I will be doing a lot of tweaking. Right off the cuff, I added onion, garlic, and basil. These ingredients seemed to really be missing. Next time, I also plan to cut the beef in half. The biggest problem I had with the recipe is that it was too beefy. A little beef adds interest, a whole pound overwhelmed the flavor so that I could scarcely taste anything else. I also plan to add spinach and mushrooms just for fun. I think I can turn this into a 5 star recipe after a couple more tries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy N."
},
"reviewBody": "Easy to do with great results. You can adapt it to fit what you have in the cupboard/freezer. I sauted onion and garlic and used italian sausage. I did have to add more sauce."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15222/meat-filled-manicotti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16767/world-cuisine/european/italian/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1794/world-cuisine/european/italian/main-dishes/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15222/meat-filled-manicotti/",
"name": "Meat Filled Manicotti"
}
}
]
}
}
, "about": [
]
}
]