				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mexican Whole Wheat Flour Tortillas"
,"datePublished": "2019-04-03T23:30:34.000-04:00"
,"dateModified": "2019-04-03T23:30:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Claudia Elena Sanchez Quintero"
,"url": "https://www.allrecipes.com/cook/24322285"
}
]
,"description": "Mexican tortillas perfect for fajitas, quesadillas, Mexican pizzas, burritos, nachos. They freeze well. Just stuff them with anything you may have on hand! I learned this from watching my mom in Mexico."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/y1zKPhumV_tmCPTFs03jDDgJAGM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16238-7b3b5b5f07d24947bbcf9d725b1f3038.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mexican Whole Wheat Flour Tortillas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "369"
}
,"cookTime": "PT1M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "179 kcal"
,"carbohydrateContent": "27 g"
,"fiberContent": "4 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "261 mg"
,"sugarContent": "0 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"4 cups whole wheat bread flour",
"0.5 cup shortening",
"2 teaspoons salt",
"1.5 cups boiling water",
"all-purpose flour for rolling" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, stir together 1 cup all-purpose flour, the whole wheat flour, and salt. Rub in the shortening by hand until the mixture is the texture of oatmeal. Make a well in the center, and pour in the boiling water. Mix with a fork until all of the water is evenly incorporated. Sprinkle with a bit of additional flour, and knead until the dough does not stick to your fingers. The dough should be smooth."
} ,{
"@type": "HowToStep"
,"text": "Make balls the size of golf balls, about 2 ounces each. Place them on a tray, and cover with a cloth. Let stand for at least 1 hour, or up to 8 hours."
} ,{
"@type": "HowToStep"
,"text": "Heat a griddle or large frying pan over high heat. On a lightly floured surface, roll out a tortilla to your preferred thinness. Fry one at a time. Place on the griddle for 10 seconds, as soon as you see a bubble on the top, flip the tortilla over. Let it cook for about 30 seconds, then flip and cook the other side for another 30 seconds. Roll out the next tortilla while you wait for that one to cook. Repeat until all of the balls have been cooked. Tortillas can be refrigerated or frozen."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT96M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Juree Yi"
},
"reviewBody": "Tortilla came out really bad. I don't know what I did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karyn Andrea"
},
"reviewBody": "Like bricks. Too much gluten with no leavening agent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bevontheroad"
},
"reviewBody": "Incredibly dry and when rolling it out the ends just crumble and split. The center was so elastic it just kept bouncing back. I let the dough sit for 1 hour with a towel and in a grocery bag and it still formed a hard crust that I couldn't knead back in easily. I even added more shortening and water then what was called for. Had to throw it out. I'll stick to a 1/2 and 1/2 ratio of wheat and white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy"
},
"reviewBody": "Only change I made was the serving - from 18 to 9 - Best I ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jami Griffiths"
},
"reviewBody": "used olive oil as some suggested, used mixer with dough hook and rested, turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chiliwily"
},
"reviewBody": "Very easy and tasty! I had never made them before and am surprised at how easy they are to make. I used butter instead of shortening. The picky kids gobbled them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katie"
},
"reviewBody": "I made these with ghee. Other than that, made exactly as written. Very good. A bit bland, but pretty much what I expect for a whole wheat tortilla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maloren12"
},
"reviewBody": "Really good. They taste WAY better than store bought! I will be making these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Lukovszki"
},
"reviewBody": "Great recipe! Have made them a couple times now, and both times very easy. The only change I make is to sub coconut oil for the shortening. I also put the cooked tortillas in a ziploc bag as soon as I take them out of the frying pan (I use a non-stick pan and the burner set on \"2\"). This helps keep them moist and pliable. Very comparable to bought ones without all the chemicals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hollisroberts"
},
"reviewBody": "I'm not sure what happened. I followed it exactly and got HARD unusable dough. It was not elastic the way tortilla dough should be. I've made tortillas several times very successfully and couldn't believe I had to throw it all out. I just can't imagine what went wrong. I think next time I'll try oil instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiamondGirl amanecer"
},
"reviewBody": "This recipe makes very good tortillas. I used about 1/3 cup olive oil as a shortening and less salt. You could roll out this dough very thin without tearing, the taste is wonderful too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber or Cameron Jaeger"
},
"reviewBody": "Excellent recipe! I had NEVER even attempted tortillas before. My first try resulted in a good tasting flat bread, but it wasn't a tortilla. My second try was great though! I LOVE these tortillas. I see no reason to ever buy from a store again, my husband helps me whip these up and we divide them up and freeze some so they last us quite a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are so easy and so good!!! I used a cup of lard (and added a pinch of baking soda per reviewers recommendations), everything else according to the recipe. Rubbing the lard into the flour mixture took me a little while, but it was nice and relaxing and felt good to my fingers. When kneading, I didn't need to add any flour at all--no sticking whatsoever! I just kept kneading until the dough was nice and pliable and smooth. Rolling them out took exactly the right amount of time for the tortilla in the pan to be ready to flip, then I counted 30 seconds, it was done, and on we went. Thank you so much for posting this INCLUDING your notes at the end!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "qayaqgirl"
},
"reviewBody": "I used unrefined coconut oil for recipe. They are that much better than store bought (in fact I ate one plain which I would NEVER do with a store bought) but a lot of work for rolling out. My edges were really crinkly- not sure if that was due to type of shortening or....? Would try next time with olive oil maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Robison"
},
"reviewBody": "I used olive oil instead of the shortening and added 1/2 tsp baking soda. Perfect! They roll out so easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valorie"
},
"reviewBody": "Made these using oil. My husband liked them, I thought they were oily. Will try again using lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SimplyHolly"
},
"reviewBody": "Easy recipe, I followed the directions exactly and they mixed up perfect! The only reason I didn't give it a 5 star recipe is because of the salt taste (which I'll adjust next time) and the fact that they just didn't have as good of a taste as I was hoping for. I'll make them again with the adjustment to the salt and if that fixed the taste then I'll change it to a 5 star rating!\n\nAs a side note for those who experience problems with the rolling part, I'll offer a couple of suggestions. First, look up what a French rolling pin is and get one of those and throw out your traditional rolling pin because you'll never go back! I also roll them out between sheets of waxed paper and was able to get them nice and thin without them sticking to anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EJLasko"
},
"reviewBody": "Have never liked the flavor of store bought tortillas, and was excited to find this wonderful recipe for homemade ones! The recipe was easy to follow, using olive oil instead of shortening and, after letting them \"rest\" awhile, easily rolled them out and cooked them up in a very hot fry pan (no oil), not too long (about 30 seconds each side) so they were nice and soft. The flavor is fabulous and so much better than store bought!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melindey"
},
"reviewBody": "Great recipe. I followed as directed and the dough came out soft and the tortillas where easy to roll. Thanks for this wonderful and healthier alternative to a household favorite. A KEEPER!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne G."
},
"reviewBody": "Really great. The only thing was that I needed substantially more water than the recipe called for - I probably added another 1/2 - 3/4 cup extra. After that though - really delicious. I was able to roll them out really thin, which was great. I used an olive oil spray to spray the frying pan, and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "I really like this recipe. Like other reviewers, I substituted olive oil for shortening and used all wheat flour. Also covered with moist paper towel while dough was resting. \r\n\r\nMy hesitation in making these is that I LOVE the uncooked Tortilla Land tortillas that you can buy at Sam's Club and Costco because I love being able to make them fresh when I'm ready to eat them. So, when I made these I set several dough balls aside and did not cook them. I rolled them out, laid them on top of each other, placed them flat in a gallon size ziplock bag, and stored them in the refrigerator. Then when I wanted to use a tortilla I cooked it at that point. I'm happy to report that it worked perfectly...just like Tortilla Land. The rolled out tortilla dough was easy to pull apart and cooked great. I used them within a couple days, so I don't know how long they will keep, but I'm thrilled!\r\n\r\nNext time I make these, I think I'll try putting herbs in the dough. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jettset"
},
"reviewBody": "oh my goodness! this was EXCELLENT!!! we used them as wraps for sandwiches and they were so soft and chewy and moist! my only suggestion is to add just a wee bit more salt and to use butter instead of shortening. crisco or any hydrogenated oil gives me the heebeegeebees! if i'm going to eat fat, i'm going to eat REAL fat...not fat made in a factory! overall, an EXCELLENT healthier tortilla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Peprmintappl"
},
"reviewBody": "I tried this recipe two times. Once with olive oil once with shortening. Both times the dough came out incredibly dry and so very difficult to knead. I don't know what happened. I followed the instructions. I chalked it up to the wheat flour I guess. I too was looking for a healthier tortilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristina"
},
"reviewBody": "Good flavor. I increased the balls to 4oz and still only got about 8\" tortillas, but I may not have rolled them thin enough. 2oz of dough rolled out to about 4\", perfect for taco shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naturemama"
},
"reviewBody": "Great recipe! But definitely read through the reviews. Mine were delish, but came out a little crispy on the edges. I am thinking I didn't incorporate the shortening well enough before adding the water. Also, Whole Foods carries organic all-vegetable shortening. (no trans!) Just remember tortillas take practice, but don't be afraid to give it a try! Very worth your effort. (I also made these completely whole wheat, no white flour.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jottomadai"
},
"reviewBody": "Great tasting and healthy, fairly simple to make. Didn't even crumble like the ones my mom used to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elisabeth Thomas"
},
"reviewBody": "Surprisingly soft and tasty for a recipe with such a high ratio of wheat to white flour! I will make these again, albeit with a bit less salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Very good tortillas...the only thing I changed was I used olive oil in place of the shortening, just to make it healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Eichelberger"
},
"reviewBody": "I have used this recipe several times. It's easy &amp; always turns out great! Freezes well. My family prefers these home made shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wanderer"
},
"reviewBody": "In a country without tortillas, this is a lifesaver. I followed another reviewers advice and used olive oil and half the salt. I let the dough rest an hour and a half and used my heated press, and they turned out super. Guilt-free wraps and burritos!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evilchicken"
},
"reviewBody": "easy and delicious just as written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "totalofseven"
},
"reviewBody": "Homemade whole wheat tortillas have become a mainstay in my home, thanks in part to this excellent recipe! I use canola oil instead of shortening (although I would like to try it with shortening sometime), but otherwise I follow the recipe exactly. Some reviewers mentioned that these are labour-intensive-- problem solved by making 6-9 at a time. I spend 10 minutes preparing the dough an hour ahead of time and 10-15 minutes rolling and frying at dinner time. It's super easy! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "imtassiethatsme"
},
"reviewBody": "Fast &amp; easy! I've never made my own shells before. Can't figure out why now! These were really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dinerdiva"
},
"reviewBody": "An excellent recipe and so easy to make! The only substitutions I made were to replace the shortening with canola oil and a little less salt (just my personal tastes). We will never eat store-bought tortillas again. Thank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rural chef"
},
"reviewBody": "This recipe makes great tortillas! I would give it 5 stars, but I used olive oil in place of the shortening. I also used all white whole wheat flour. The tortillas were delicious. I don't think I can go back to store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "This recipe is fantastic! I used canola oil instead of shortening and that worked just fine. During the kneading process, I did add a bit more oil to help bind the dough. Overall, it was a bit of work but so worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "chinabaker"
},
"reviewBody": "I used a little over 1/2 cup of olive oil instead of shortening and followed the instructions carefully. DRY DRY DRY! I stopped trying to roll them out and fry them...My advice: *if* you want to try this recipe, take some of the previous suggestions and make half of the recipe first to see if it'll work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristim"
},
"reviewBody": "5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lola87"
},
"reviewBody": "These were fairly easy to make for me even though it was my first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Cutone"
},
"reviewBody": "Great recipe! I follow the recipe exactly. I love to make breakfast burritos with these by mixing together 1 lb sausage with about 5 eggs (scrambled). I just wrap 'em up into the burrito, then wrap 'em again in plastic wrap, and pop 'em in the freezer! They can be microwaved good as fresh in less than a minute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bigmommablack"
},
"reviewBody": "I made these for Chicken Fajitas. This is a great basic recipe but I did notice that my dough was a little dry and crumbly after incorporating the boiling water. I just added a little more water than the recipe called for and that seemed to help it. I used all King Arthur's Whole Wheat Unbleached White Flour and 1/2c Canola Oil and 1/4c Olive Oil. I also used a small saucer to measure perfectly round tortillas. They tasted SO good my son couldn't get enough of them. Will DEFINITELY make this recipe again. It was surprisingly easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadySparkle"
},
"reviewBody": "I made these last year. Loved them. Started making all our bread and got \"off\" tortillas. Bought a pkg. from the store. . .tasteless. . .Made these again today. Not buying them anymore. These have a great taste and they're really not all that hard to make. I don't use a press. I prefer them rolled very thin (they puff up when they \"bake\" on the griddle). Very good recipe! Thank you! You could add more flavor to your tortillas, if you wish, by adding onion powder, garlic, etc. I didn't even need to flour my counter today, so none of that \"burnt flour\" taste on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Stone"
},
"reviewBody": "These are excellent tortillas. I substituted bread flour for the white flour (because we are trying to stay away from white flour) and used butter for the shortening. I don't know if it was using bread flour or the fact that I live in the desert, but I found I needed an extra quarter cup or so of water. I also found that the tortillas were difficult to roll out, using only ½ cup shortening. The taste is great, so I will be making these again. Next time I will use at least ¾ cup of butter. (I got the idea for butter from a tortilla recipe on the Mexconnect.com site, which is really good if you add another cup of flour). We live in El Paso, with a majority Hispanic population, and we have discovered that the best tortillas we've every had are rolled very thin. One nice thing about this recipe is that even when you roll the dough out thin enough to be transparent, it still lifts off the pastry mat easily. Also, I did not need to use any flour during the rolling process.\n\nHave made them a second time, this time using ¾ cup of shortening, and they rolled out very easily. This time I substituted mesquite flour for the white flour, and they turned out even better (if that's possible). The mesquite adds a sweetness with a hint of vanilla, which is wonderful. The first time I made these I made balls about 1.75 ounces; this time I tried the recommended 2 ounce size. The smaller ones are much easier to handle, especially when rolled very thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "this is a very easy recipe to make ,mine yeailed 28 small /medium tortilas . the taste was excellent I will never buy store bought again also they are much more healthy then the store bought ones . I will freaze half and keep half out .thankyou for sharing your moms recipe ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Substitute low fat butter instead of shortening and only use 1 tsp of salt. I waited 30 mins for the dough instead of min. 1hr and they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliebug1637"
},
"reviewBody": "This recipe is great! I used all whole wheat flour (5 cups) and replaced the shortening with softened butter. The recipe makes a lot so I put them in the freezer and take them out as I need them. Perfect system. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene R"
},
"reviewBody": "Delish. Made with fresh ground flour and only used 4 cups and it turned out great. The family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chriscoop"
},
"reviewBody": "These turned out great! To make it healthier I used all fresh ground whole wheat flour and substituted coconut oil for the shortening. Used all the same proportions as the recipe. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DIG"
},
"reviewBody": "they are quite good...I made a third of a batch (6)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Goodson McDermott Knight"
},
"reviewBody": "These were terrific! I used expeller expressed coconut oil (no flavor)as my oil. I have a tortilla press so these came out not only perfect shaped but delicious! As they get done, I stack them in an open ziplock bag laying on its side (they can touch) so the steam continues to do its magic as I finish the batch. then store them in same bag. YUM YUM YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fd"
},
"reviewBody": "I love them, the kids love them. I use only hwole wheat flour and do not add salt since the filling is usually salty. I make them all the time even though it is time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn Leaves"
},
"reviewBody": "I rated this based on my changes. I found this dough super easy to work with. I let it rest for an hour because I had phone calls to make anyway. I used half and half all purpose and whole wheat flours and olive oil in place of shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nattyzor"
},
"reviewBody": "Perfect tortillas first try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Storey"
},
"reviewBody": "These were very easy and tasty. I used olive oil instead of shortening and they came out very well. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Good, but a little dry and crumbly. I think it needed more Crisco. I used self rising flour and left out the salt. I scaled this down and it worked out fine. I had my black iron skillet over med-hi heat and it took these about 1 min per side to bubble. The water does not have to be boiling just hot from the tap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SooperLowa"
},
"reviewBody": "Wow-loved it! I went with 2C whole wheat flour and 3C all purpose and I used 3/4C olive oil. We ate fajitas and it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kissimmeeimfrench"
},
"reviewBody": "This recipe creates perfect tortillas. I have never had any better. Though I did need to add more fat than called for (about 20-30% more).\nA note: I've waited and not waited the hour and did not find a significant difference to avoid this recipe when in a rush; so don't worry if you don't have the time to wait around an hour!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greenthumb0027"
},
"reviewBody": "I recently moved away from Texas and was really missing the taste of homemade tortillas. These tortillas taste fantastic and are very simple to make. I use butter instead of lard, and they still turn out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nettie H."
},
"reviewBody": "Great recipe, I used 1/4 cup olive oil and 1/4 cup shortening. But did anyone else about die getting them rolled out! I am having a new found admiration for whoever rolls out enough us these on a daily basis for a large family. My wrists are tired! Is there some secret to do this without a struggle??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGDAVE"
},
"reviewBody": "Yummy. The trick is, you have to use very hot water for the dough. This way you you won't have to use any flour later to roll it out (the more flour the harder it would be). You can easily make it as thin as you wish. Definitely a keeper receipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meeky"
},
"reviewBody": "first time making flout tortillas... used 3/4c olive oil... will try adding 2t baking powder. Dough was a little on the dry side. Easier than I thought and I will try again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannon"
},
"reviewBody": "These are awesome and easy to make! I made them successfully the first time I tried them and I generally mess recipes up the first three times I try them!! There is an art to perfecting the temperature, haha! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Just finished making these tortillas. I ate one plain right after cooking and it was delicious. I made mine as the recipe stated but I added fresh herbs, chopped rosemary and thyme, to the flour mixture. I had to add a tablespoon or so extra water to the dough to get a good texture and I also layered the cooked tortillas between damp paper towel b/c the edges seemed to get a little dry as they cooled. They cooked very nicely and I loved that they were made with olive oil. I can't wait for lunch tomorrow for the true test. I am sure I will enjoy my wrap. Will surely make these again and experiment with other additions. Thanks for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mountainmama"
},
"reviewBody": "total failure. tasted like plain wheat flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "total failure. tasted like plain wheat flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gitano"
},
"reviewBody": "You definitely need to play with the ingredient amounts to come up with a nice, pliable dough....the first couple I tried to roll into a ball were on the dry side, so I added a tich more water and needed the dough some more....I got 18 small-ish size tortillas out of the batch using a golf ball size. I took some reviewers advice and used Olive Oil in place of shortening (healthier). Also added 2 heaping tablespoons of ground flax seed for a boost of nutrition. Overall, great recipe, as I said, just need to tweak it to your liking and consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kumquatgirl"
},
"reviewBody": "EXCELLENT. I was able to roll these out super thin and they tasted fantastic. I've never had a whole wheat tortilla from the store, and now I know I never need to try one! Next time I'll experiment with olive oil and perhaps slightly less salt. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Holley"
},
"reviewBody": "Use this recipe every week! Perfect! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsByrd"
},
"reviewBody": "These worked out perfectly! I used no shortening only olive oil. These are perfect for lunch wraps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katia Ivanova"
},
"reviewBody": "Great recipe, although i made a few changes, just to make it a bit healthier. Well i divided everything in half, cause i don't need that many tortillas. Then i substituted all-purpose flour with wheat germs and shortening with the same amount of olive oil (i think u might use less) and as i only make quesadillas i put less salt. And tortillas were perfect! easy to fold (not like it is sometimes with whole grain flour) with hearty taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AMIEECH"
},
"reviewBody": "I live in a country where you can't get flour tortillas and I have tried another recipe that turned out well, but the dough was SO elastic that it took forever to roll them out. For these I subbed oil for the shortening and they turned out well, SO easy to roll out! I also put them straight from the pan into a plastic bag with a towel inside to keep them from drying out. We ate them for several days and will definitely make again next time I make a pot of refried beans! I didn't love them enough to make them when we move back to the US, though, because I am in love with those \"bake your own\" tortilla dough circles at Costco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Cerino"
},
"reviewBody": "Omitted the all purpose flour. Added sazon and garlic powder. I had to make a second batch. They cook marvelously on a flat cast iron griddle. If you cook them for 3 minutes per side, they make a cracker type bread. Ate it with curried cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlh"
},
"reviewBody": "Even though I couldn't find my rolling pin and used a wine bottle, these turned out fantastically. Followed the recipe exactly and my husband and teenage son both requested that I never again buy tortillas in the store. Thank you so much for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JaNell Hansen"
},
"reviewBody": "This is my first attempt at making homemade tortillas and they didn't turn out like I thought they would. They turned out tough and dry and would only bubble up when I brushed them with Crisco while they were cooking. Not sure what I did wrong-maybe a kneaded the dough too much. I did let them rest for 2 hours. I will probably try this recipe again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sigrid"
},
"reviewBody": "This recipe is sooo good and easy! I changed it a little bit by using all whole wheat flour and palm/coconut shortening. Family and friends are always wanting me to make more! I think that the boiling water is the real key here, causing it to be elastic and very easy to roll out and handle. Although they are very good even the 3rd day, ours are always gone before then :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakengrace"
},
"reviewBody": "you will REALLY want to try this with a 1/2 batch first and then make it your own. it is a great base recipe. I made a double batch, and prob came out with 50 med/sm tortillas...plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "connie"
},
"reviewBody": "I've tried a few tortilla recipes with whole wheat before and never was satisfied... but I made these last week and they came out awesome. I didn't have shortening on hand, so I used vegetable oil instead. Very pilable even after a few hours being placed in a dish towel. I used them to make some beef, potato &amp; cheese burritos for my brothers and they they held up so well, none of them cracked, ripped or split while I assembled them. This is a keeper recipe for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tommie Martinez"
},
"reviewBody": "I've made these a couple of times. I do add a pinch of baking powder and have also tried olive oil. They've actually came out pretty good. This was a great starting point for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Country girl"
},
"reviewBody": "This recipe is so good!! I use only this recipe for tortillas now. Just make sure the tortilla balls don't split apart. If this happens it's because you need more shortning. I subsutute 3/4 C. of vegtable oil instead of shortning and it makes it easy to mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whole_foods_mom"
},
"reviewBody": "I have a tortilla press, so I modified: instead of 1 1/2 c water, I used about 2 c to make a softer dough. I also added 2 t garlic powder, 2 t chili powder, and 1/2 t cayenne pepper. A great recipe overall!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Piper"
},
"reviewBody": "This recipe was exactly what I was looking for. I used olive oil instead of shortening/lard, and it turned out great! I made soft taco's with these tortillas, they were the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pooch656"
},
"reviewBody": "Really yummy tortillas, way nicer than the supermarket ones. I didn't have whole wheat bread flour so I sieved some normal stuff (I don't like too much of the bran). The golf ball sized ones were a little small so I made a few big ones as well, they were quite troublesome to roll even with a tortilla press but they eventually got there, probably just needed more resting time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "edorathy"
},
"reviewBody": "these were not as tender as i was expecting, i will try a recipe i found that has baking powder and see if that makes a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krisser73"
},
"reviewBody": "I love this recipe! It's so simple and yummy! My favorite is the all white flour one, I've tried with the whole wheat flour and that's pretty good, but we prefer white flour tortillas. I tried it with veg/olive oil and they were ok, but again we prefer the taste of the shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Em"
},
"reviewBody": "These were way too dry and hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NIVES123"
},
"reviewBody": "used all whole wheat flour (maybe a tablespoon or two less) because ww absorbs more moisture. also replaced shortening with EVOO. Excellent recipe, never thought tortillas is that easy to make. i didn't have to use any flour to roll out the dough since my silicone mat and rolling pin are well \"seasoned\" - everytime i clean the pin or mat, i only used wet paper towel so like my wok, don't have to worry about things sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJ Harlow"
},
"reviewBody": "Sometimes technique makes all the difference. I made a different recipe that I found in Taste of Home magazine, same ingredients different directions. The first 2 came out like huge round crackers. This recipe saved the rest of the batch by providing the proper technique to make wonderfully soft and fluffy tortillas. Thanks for sharing the recipe and your mom's technique Claudia!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "After trying this recipe several times, I finally got the perfect tortillas by making these changes: I used a pancake griddle to cook them. That way it was evenly cooked with no brown spots. I used all Olive oil, that I mixed with the hot water before adding to the flour (Much easier than rubbing the shortening in the flour and then adding the water!) Add a few more tablespoons of water than the recipe calls for and it will be easier to roll out. (But don't add too much otherwise it will become very sticky) Also the tortillas tasted better when I cooked the tortillas immediately after preparing the dough (no need to let the dough sits for hours - it drys out!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan S"
},
"reviewBody": "This was my first attempt at making tortillas. I think I need to work on it more ;) I did think they tasted great, especially fresh, but mine turned out blackened in spots. I burned the first two at high heat, turned it down to halfway between medium and medium-low for the rest of the batch, and that worked better. There's probably a trick to this I'm not aware of..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melisa Creemer"
},
"reviewBody": "I thought these were hard to roll out, they kept breaking. I am going to try more white flour next time to hopefully make them more pliable. They tasted great and worked for the tacos I made them for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DANA COLE"
},
"reviewBody": "SO easy and SO good! I needed tortillas for fish tacos and these were so worth NOT driving to the store. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUZZANNA"
},
"reviewBody": "I cut the recipe in half and made 10 large tortillas. I used olive oil instead of shortening, and I increased the amount of water because the dough was very dry. After forming the dough into balls, I let it sit for about 1/2 hour. The dough was very easy to work with and not sticky at all, and I was able to roll the tortillas paper thin. They fried up beautifully. Thanks for the great recipe: I'm going to use it often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LilMama84"
},
"reviewBody": "These came out perfectly! I used Earth Balance vegan buttery spread instead of shortening. My husband was very impressed! I'll definitely be making these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justina Schneeweis"
},
"reviewBody": "I cannot beleive whole wheat tortillas can taste this good. So tender and flavorful. Roll them thinner than you think they should be and don't be afraid to keep them well floured when rolling. Cook them fast over high heat; you made need to enlist an extra pair of hands to roll and cook at the same time, but it goes much faster than you expect. I thought this task would be much more burdensome, but it was so easy I can't beleive I haven't been making my own tortillas all along."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb. B"
},
"reviewBody": "Great recipe. I used coconut oil instead of shortening and they came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JuniperLady"
},
"reviewBody": "I have used this recipe twice - with fabulous results. I never knew that wheat tortillas were so easy, although I am not surprised that they are so tasty when they are warm! All bread is wonderful that way. I don't know if I will only ever make my own from now on, but they sure are cheap, easy enough, and tasty enough - and I will always be able to have tortillas without going to the store! Recipe note: I find the hour rest utterly unnecessary. I am not certain what flaw in my finished product could be removed by waiting longer than the 20-30 minutes I tend to wait."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "outsidethebun"
},
"reviewBody": "Love it! I use canola oil and use half white flour. Much better then store bought! The kids love to help and make their own. DEFINITELY let it rest 4 hrs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "senkyb"
},
"reviewBody": "didnt sick together and the one i didnt get to roll it out it just split and when it didnt crack it was really hard and didnt roll after i cooked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth"
},
"reviewBody": "Amazing! I used canola oil in place of the shortening and regular ww flour in place of the ww bread flour. They turned out so good!!! Just ate two for lunch with chopped tomatoes &amp; avocado inside. YUM! Will never buy store ww tortillas again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/46790/mexican-whole-wheat-flour-tortillas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15855/bread/quick-bread/tortillas/",
"name": "Tortilla Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/46790/mexican-whole-wheat-flour-tortillas/",
"name": "Mexican Whole Wheat Flour Tortillas"
}
}
]
}
}
, "about": [
]
}
]