				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mexican Paella with Cauliflower Rice"
,"datePublished": "2016-11-23T01:34:22.000-05:00"
,"dateModified": "2022-11-06T08:24:57.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Diana71"
,"url": "https://www.allrecipes.com/cook/diana71"
}
]
,"description": "This Mexican-inspired paella with chorizo, tomatoes, tilapia, saffron, and cauliflower rice is rich in flavor and makes a beautiful presentation."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZKxhf1gf5Uj2MnPO3wDXm-8BroM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4258894-50d9afcc2ae04b16a4d7af6863feb4ae.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mexican Paella with Cauliflower Rice"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "27"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "368 kcal"
,"carbohydrateContent": "12 g"
,"cholesterolContent": "74 mg"
,"fiberContent": "3 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1244 mg"
,"sugarContent": "5 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound chorizo sausage",
"1 skinless, boneless chicken breast, chopped",
"3 cups cauliflower rice, divided",
"1 medium onion, diced",
"1 large yellow or orange bell pepper, seeded and chopped",
"1 pinch salt",
"ground black pepper to taste",
"3 cloves garlic, finely minced",
"1 (14.5 ounce) can Hunt's® Diced Tomatoes",
"2 large bay leaves",
"1.5 teaspoons fresh thyme leaves",
"0.5 teaspoon crushed saffron threads",
"0.5 teaspoon dried basil",
"0.5 cup water",
"2 tablespoons tomato paste",
"2 cubes chicken bouillon",
"1 cup frozen peas",
"3 frozen tilapia fillets" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place a paella pan over medium-high heat. Add chorizo and cook, stirring to break up any chunks, until browned and crumbly, about 5 minutes. Add chicken; cook and stir until no longer pink in the center and the juices run clear. Transfer chicken and sausage to a plate, leaving drippings in the pan."
} ,{
"@type": "HowToStep"
,"text": "Reduce the heat to medium and add 2 cups of cauliflower rice. Cook and stir until cauliflower is browned slightly, about 5 minutes. Add onion, bell pepper, salt, and pepper. Stir in garlic and cook until fragrant, about 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour canned tomatoes into the pan. Add bay leaves, thyme, saffron, and basil; mix well. Return sausage and chicken back to the pan. Stir in water, tomato paste, and bouillon until well combined. Bring to a boil, then reduce the heat to medium-low, cover, and simmer for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove the lid and fold in peas and remaining 1 cup cauliflower rice. Place frozen tilapia fillets on top of paella mixture; cover and steam for another 10 minutes. Remove the lid and check for doneness. Gently break apart fillets with a wooden spoon and stir to incorporate chunks of fish into paella."
} ,{
"@type": "HowToStep"
,"text": "Place the paella pan in the center of the table and serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! Followed the recipe except omitted saffron and tomato paste because I didn’t have it on hand. Didn’t make a difference as far as I could tell. It was gobbled up! Clean plates all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "I liked it. Some changes though. I forgot peas so I used corn. No saffron threads as I couldn’t find them. Chorizo sausage might not have been the right kind because it didn’t breakup. All in all I enjoyed it. Still waiting for my husband’s thumbs up or down."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMS"
},
"reviewBody": "Very good! The recipe doesn’t specify what to do with the chicken, so assuming bite size pieces, it turned out well. Next time will try shrimp instead of tilapia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Tackett"
},
"reviewBody": "First time using Cauliflower rice. I hope everything else I use it in turns out this good! Made it true to the recipe, except for the saffron. Tumeric and Cummin, I think, give it much better flavor. Used spicy Chorizo sausage, so may tone that down a bit next time, but otherwise this is definitely a new favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "123GRIZ"
},
"reviewBody": "Wow! This is great! I made more work and will streamline next time by buying riced cauliflower and fish rather than raw shrimp. Didn’t have saffron so substituted as others commented. Ended up adding some badia sazon because i was light on the sausage and spices. Not next time. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Bragg"
},
"reviewBody": "This is an excellent dish! So healthy and really tasty. I used shrimp instead of fish this time but otherwise followed the recipe. Great left over as well. Try it! You will not be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssstome"
},
"reviewBody": "Absolutely delicious!! Husband loved it with the cauliflower and he was very skeptical at first. Flavor and simple. This one will go into our rotation for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Pellerin Schaaf"
},
"reviewBody": "This has become a staple in our menu rotation. I use store bought cauliflower rice. For variety, I use a combination of 2 different seafoods with the chicken and pork, depending on my leftover situation. It makes enough for dinner and then lunch leftovers for the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo22Babes"
},
"reviewBody": "Fabulous recipe. A bit of prep but so worth it. The five adults eating at our table last night were almost silent. Just eating!! We all loved it. Followed the recipe except for tilapia - had catfish. I was worried it would be too strong a flavor, but it was delish. Don't know that I'll use anything else!! And I will be making this often. Used my food processor with the cheese grater wheel to make \"rice\" super easy and quick. The addition of the cauliflower at different times makes such a great contrast. Thanks for a great addition to our low carb plan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Chisholm"
},
"reviewBody": "shrimp replaced tilapia and we had cauliflower &amp; sweet potato rice... so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VB Leghorn"
},
"reviewBody": "My daughter and her boyfriend are picky eaters, and I needed something for Christmas brunch. This recipe was perfect. I started by cooking Italian sausage, chicken and shrimp in a large frying pan with chopped onion and garlic. I added the rest of the ingredients along with the spices into the pan, stirring long enough to heat through. Transferred everything into a slow cooker and cooked for 8 hours. The shrimp pretty much dissolved and the sausage took on a strange texture. If I were to make it again, I’d follow the instructions to see if the texture of the meat was different, but it was still a big hit with the kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kbadal89"
},
"reviewBody": "Great idea! I just used spicy sausage and frozen tilapia. Turned out great. Smelled wonderful. Frozen cauliflower rice was the easy way to go"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2cookSC"
},
"reviewBody": "This recipe is amazing! We are new to using “riced cauliflower “ due to a doctors recent recommendation based on our daughter’s blood sugar levels. My husband, daughter and my 25 year old son LOVED this. I found “riced cauliflower” in the produce section at our local Publix. A huge timesaver versus ricing it yourself! Additionally, I would not substitute anything for the chorizo. It adds a delicious warmth to the dish that I don’t think you would find with any other substitution. The two things I changed were based on previous reviews. 1) Used turmeric and cumin instead of saffron because we didn’t have saffron. (Saffron is quite expensive, so they both seemed like a reasonable substitute and they added a wonderful flavor) 2) Used frozen shrimp instead of tilapia. (Tilapia is a mild and tender white fish that I didn’t think would hold up in this heavily spiced and meat filled dish). Another fish alternative may be swordfish or snapper as they are both a little more substantial. Everything else was the same. The estimated prep time may be a little “shy” but this would not keep me from making it again. I served it with a green salad and a nice red wine. The portion suggestion is accurate and I think that depending on your level of “spice” in your food...those measurements can be adjusted. My husband insisted we make this again. Thanks for a GREAT recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Macey"
},
"reviewBody": "This was a great dish. I used 2 of the small Mexican Chorizo sausages, sliced yellow squash for peas, and fire roasted diced tomatoes with garlic and a large can of whole tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "My family loved it. I used instant brown rice instead of cauliflower rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joel Clark"
},
"reviewBody": "I used shrimp instead of fish and also used my smoked chicken sausage and smoked chicken leg quarters. It was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Helga"
},
"reviewBody": "I followed it but added shrimp instead of fish and did not add enough sausage it was very good and my company said the same. Would certainly serve it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Doyle"
},
"reviewBody": "we will make it again. might boost the spices, we like lots of flavor :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ScoutCR"
},
"reviewBody": "I love Paella and had to stop eating rice because of Diabetes. Made this dish and it was delicious. I didn’t have saffron so I used the cumin and thyme without the saffron. I added some Sirirachs for some kick! Also I used sea bass filets. It turned out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shann"
},
"reviewBody": "We really enjoyed this dish. We didn’t have saffron so substituted a bit of turmeric and cumin. Definite worth a repeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "This totally works. Using cauliflower instead of rice is right in so many ways. The kids will eat it because they have absolutely no clue that it's cauliflower, low glycemic count, healthy as all get out, and sooo much easier than a rice paella...and it's delicious. You still get that rice like texture thanks to the method of adding the last cup of cauliflower at the end. The tomatoes leave it moist but not soupy. We served ours with corn tortillas and ate it as tacos. I had to leave out the tilapia and subbed shrimp. I cut up the chicken into bite-sized pieces before cooking. Lastly, three cups of riced cauliflower was about one small head-including the stalk and leaves. (It was neither a hassle nor messy). Thank you for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duboo"
},
"reviewBody": "Wonderful! Super easy to make and healthy besides. Because of family preferences I subbed out the tilapia for shrimp. Other than that I followed the recipe as written. I already passed this recipe along to my niece who is gluten intolerant. Thanks for a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kat92"
},
"reviewBody": "Loved this recipe. Pro tip - Trader Joe's has frozen riced cauliflower. An easy recipe just got even easier!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LenMoore"
},
"reviewBody": "Shredding cauliflower is extremely messy and I was unhappy to begin with. But this dish is surprisingly delicious. I used honey garlic pepperoni, instead of chorizo. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana71"
},
"reviewBody": "Such an easy one-pot meal...faux carbs (via cauliflower rice) and everything. Also makes a beautiful presentation!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/256305/mexican-paella-with-cauliflower-rice/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
"name": "Trusted Brands: Recipes and Tips"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16239/trusted-brands-recipes-and-tips/hunts/",
"name": "Hunt's"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/256305/mexican-paella-with-cauliflower-rice/",
"name": "Mexican Paella with Cauliflower Rice"
}
}
]
}
}
, "about": [
]
}
]