				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mexican Style Cornbread"
,"datePublished": "1998-07-30T01:22:21.000-04:00"
,"dateModified": "2022-09-22T15:15:32.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lynn Gibson"
,"url": "https://www.allrecipes.com/cook/24326064"
}
]
,"description": "This Mexican cornbread made with creamed corn, cheese, onion, and jalapeño peppers is delicious. A melted Cheddar crust tops makes it irresistible!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UfCJY95jXg133z3ETLCvvqi1a3A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4520358-e87db69414bc4f338ebb6c0aca33c18a.jpg",
"height": 998,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mexican Style Cornbread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "248"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "240 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "21 mg"
,"fiberContent": "2 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "480 mg"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 eggs",
"1 cup buttermilk",
"0.25 cup corn oil",
"1.5 cups shredded Cheddar cheese, divided",
"1 (8 ounce) can cream-style corn",
"1 large onion, chopped",
"2 fresh jalapeno peppers, seeded and minced",
"1 cup cornmeal",
"0.5 cup all-purpose flour",
"2 teaspoons baking powder",
"0.5 teaspoon baking soda",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square pan or a cast iron skillet."
} ,{
"@type": "HowToStep"
,"text": "Beat eggs in a small bowl; mix in buttermilk and corn oil. Stir in 1 cup shredded cheese, creamed corn, onion, and jalapeños."
} ,{
"@type": "HowToStep"
,"text": "Whisk cornmeal, flour, baking powder, baking soda, and salt together in a large bowl; stir in egg mixture until combined. Pour batter into the prepared pan; sprinkle remaining 1/2 cup cheese on top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until top is golden brown and a toothpick inserted in the center comes out clean, about 30 to 35 minutes."
} ]
,"recipeYield": ["9"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe worked out well. It smells good and looks good. I made it for a luncheon tomorrow so I will let you know how well it was liked. If it tastes as good as it smells it should be awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crystal henderson"
},
"reviewBody": "Instead of 1/2 cup of flour I used 3/4 cup. I changed the oil to bacon dripping for more flavor and I had to increase cooking time 20 more minutes. I would make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added roasted red peppers and 1/2 sugar! Yummy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grannychef"
},
"reviewBody": "I really like the flavor of this cornbread. It was very wet and came out not completely cooked all the way through even after testing it. I will make it again but add more flour, at least double the amount of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent Mexican cornbread muffins...I made them in my pampered chef brownie pan. Makes 12."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Far too much onion and somewhat bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby Lewis"
},
"reviewBody": "GREAT! I had a recipe years ago and could not find it and then I found this one today! I made it and it was fantastic! I accidentally put all the cheese inside the mixture and none on top but was still amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Montgomery"
},
"reviewBody": "I only used one jalapeno, and didn't put the onions in, for my mother's sake.\nShe's 80 and she liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "liz"
},
"reviewBody": "The recipe needs tweaking. It was too wet. At 35, &amp; 40 minutes, it was still not set. I think it either needed less liquid, or 1 more egg, or more flour. Even after I thought it was set, the very bottom we slightly wet.\nAlso, the onion was not that soft, as to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "This is really good as written. I will be making this again and again. I put about a tablespoon of bacon grease in a 10” cast iron skillet while preheating the oven and added the batter to the hot skillet. This makes a nice crunchy crust. I can’t even imagine adding sugar as some suggested. This is meant to be a savory cornbread...no place for sugar in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "agent99"
},
"reviewBody": "Used half the onions and sauteed them. Didn't have jalapeno, so I used one serrrano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Bolton"
},
"reviewBody": "This is my go to cornbread muffins. Easy and moist. I sweat the onions and green peppers if I have the time. My wife asks for these all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIRANDAUR"
},
"reviewBody": "I sauteed the onions first and used jarred jalapenos and kernel corn because it's what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Awesome. The whole family chowed down on this cornbread. I did add one more jalapeño and left seeds in, but nothing else needed to be change. This recipe will be used many more times in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "unstrung"
},
"reviewBody": "added less jalepeno, didn't add the onion, didn't have buttermilk so I used half low fat sour cream and half milk. \nIt was good, may add more jalepeno and use a cast iron pan next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Wonderful recipe! Moist inside, slightly crispy crust of cheese &amp; slightly sweet with a lil kick! Perfect for pairing with Hoppin' John, Chili, etc. Turns out a beautiful golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Whitlock"
},
"reviewBody": "Made absolutely no changes. This is absolutely delicious. Moist. I was worried about the jalapeño peppers making it too spicy. I was wrong. Just enough flavor. Made this as a side with beef and spinach enchiladas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patricia Farrow Boshardy"
},
"reviewBody": "Lower fat and sodium alterations: saute onion and sweet red pepper till onion opaque (not brown), added small can green chilis, use no salt added canned creamed corn, add 2 tsp Tony Cachere's Creole seasoning and five or so twists of fresh black pepper mill. Don't add the salt, there's enough provided by the canned green chili and creole seasoning, plus the spice makes up for the lower salt content and its usually served with salty ham and collards or chili. Lower fat: skip the grated cheddar, instead dot the top of the batter in the pan with rectangles of sliced sharp cheddar (like little tombstones) and you get little pocket of melty cheddar in every scoop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrowe2"
},
"reviewBody": "So simple, so delicious! I only added 2 ingredients, 1 tbsp sugar and 1 tbsp cayenne. I did substitute butter for the oil. My oven required 10 minutes more, but the extra time was well worth the result. My new favorite to go with the Hellfire Chili."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vclackey"
},
"reviewBody": "Excellent recipe...I did change it a little though. I made a double batch and baked for 40 minutes since it was in a 9 x 11 glass dish. I did not use flour but all cornmeal mix since I don’t care for a cake like cornbread. Baked up golden brown with the added cheese on top! Taking it to a family dinner. I will update later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Dacierno"
},
"reviewBody": "We loved this recipe but made a couple of changes. Did not add onions b/c son hates them. Added 2 T. of sugar. Very moist and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "budmanpsl"
},
"reviewBody": "Make it just like it says, great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Norm Vilmer"
},
"reviewBody": "Couple of change: instead of one large onion, I used 1/2 a small white onion; I used only 1 jalapeño. Instead of dry ingredients, I used a box of Jiffy. I was able to find 8oz cans of non-gmo creamed corn. Let cool 20 minutes in pan before cutting.\n\nCame out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "Sorry, but disregard my good review. This looked great and smelled delicious, but had no taste. I followed to recipe exactly. I had two other people taste it to be sure and they agreed. A double batch in the trash. I guess it is a matter of your own taste buds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This is so good. I make it as written only I use 2 tablespoons of jarred diced jalapeño peppers with a little of the juice. I used an 8\" x 8\" square pan the first time I made it and a cast iron skillet the second time. The cast iron skillet is better, the outside is nice and crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pcushenan"
},
"reviewBody": "Yum! Don't need to change a thing in this recipe. The cornbread is flavorful and melts in my mouth. I had to use kernel corn, since I had no creamed corn in my pantry, and it was still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Webb"
},
"reviewBody": "It was a smash hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ron Rotthaus"
},
"reviewBody": "I made it just as the recipe called for, but I would leave out the onion altogether and use a 13x9 pan to allow it to firm up better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeesBurger"
},
"reviewBody": "I've been making this recipe for years. It is one of my standbys. It goes well with chili or as a main dish for breakfast.\n\nI make the recipe as is or with whatever I have on hand, such as canned green chilis, roasted bell peppers, jalapeño pepper jack cheese. The only other change i make is that i cook it for an hour so that it is not mushy on the bottom.\n\nTo reheat it for breakfast, I put squares of cornbread in a skillet and fry each side, with or without butter in the skillet, till it is lightly brown. it tastes great either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Gross"
},
"reviewBody": "I love this recipe! Whenever I make it I use Jiffy corn muffins mix in place of the dryer ingredients and I cook up a pound of hamburger meat and add it in to the mix. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jim"
},
"reviewBody": "Taste/flavor was not too bad. But the consistency was way too moist, and crumbly. Had to eat with a spoon. If I try again will reduce to one egg and less cheese, onion, and corn to firm up consistency. But thanks for Recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray Sibley"
},
"reviewBody": "Long ago, my mother made Mexican cornbread. Since this was before the internet, she had found the recipe in a magazine or newspaper. I have been looking for a recipe that was like what she had made, and this is the closest to what she made that I have found, and so I am very happy. I don't think the recipe that she used had onions, and so I didn't use onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jazzzame"
},
"reviewBody": "This was excellent! The only thing I changed was to saute the onions and jalapenos, and I added about 1/3 cup of sugar. Oh, and it took about 45 min to bake in an 8x8 pan. It was perfect! I couldn't stay away from it! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tishprint"
},
"reviewBody": "Only used one jalapeño, other than that followed it to the letter. Best cornbread recipe ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jean66"
},
"reviewBody": "I did have to substitute butter for the corn oil. This came out very moist and delicious. I think this would be great to serve with chili. I did have to cook for an extra 5 mins to get this to be cooked all the way. I used a medium yellow onion - i think the key to not having too much onion is to be sure to chopped very fine so that it adds flavor but you are not biting into huge chunks of onion.\n\nTo serve as a sweet bread with brunch, I made again with an extra 1/2 cup sugar and using candied jalapenos (which are quite hot and a little sweet) and this was a solid 5 star - maybe six."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Irene Y"
},
"reviewBody": "I made some changes due to ingredients on hand and preferences: unsweetened applesauce instead of oil, added two tablespoons sugar, added 2 minced chipotle peppers, used mozza instead of cheddar, didn't use onion. Tasty and moist, but upon tasting I think the sugar was not needed (I had added it thinking it would offset the peppers, but it was not spicy at all--just a hint of a zing). Baked for full 35 minutes in cast iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I made it with minimal changes: I used more jalapenos (four in all) and added 1/4 cup sugar. And instead of greasing the pan I melted 3 Tbs. butter in it before adding the batter. I had to bake it longer, for about 45 minutes, but the results were delicious - moist, peppery, cheesy and just a little bit sweet, with a nice brown crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momof2Geex"
},
"reviewBody": "This was great and everyone in the family commented on it. I made it like I usually make my cornbread in an iron skillet, but used these ingredients. Family is still raving about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erinspice"
},
"reviewBody": "So, so moist. I cooked mine in a 10 inch cast iron skillet, and should have left it in the entire 35 minutes. It was delicious. I'll be adding a tablespoon of sugar and increasing the salt by 50% next time I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "It was delicious! I used stoneground yellow meal, but my family loves that course texture. The flavor can't be beat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lara Raich"
},
"reviewBody": "Eh... this came out pretty heavy and a little wet, after cooking it for 40 minutes. Needs more flavor - addt'l salt and some sugar maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "I thought this was delicious but my family really does like at least minimal amount of sugar in their cornbread, so I guess I'll stick to those. I poured the batter into the pan then added chopped jalapeno over the top of half for those that don't do spicy in my family. Yummy cornbread IMO!\nUPDATE 5/29/17 Made this again, but left out the onions and my husband ate 4 pieces! Loved it even without the sugar :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gerald McLawhorn"
},
"reviewBody": "I added 2 halbanero peppers to it to kick up the flavor. Very nice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celena Freeman"
},
"reviewBody": "This is similar to a recipe my family had used for years. I used this one as a guide because I misplaced my handwritten recipes during a recent long distance move. We add 1 lb of cooked, seasoned ground beef and bake one hour to ensure the middle is not wet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Rickenbach Maulick"
},
"reviewBody": "I followed a few others and used pickled Jalapenos, didn't put the cheese on top and added 2-3 Tablespoons of honey. Everyone enjoyed it. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea D."
},
"reviewBody": "Would absolutely make again! A few of the changes I made: \nalmond milk instead of buttermilk, just 1/2 an onion, about 1/2 cup cheese, (mixed into batter only) canned mild chilies instead of jalapeño, then baked in my buttered cast iron skillet for about 40 minutes. Try it served with sliced avocado!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn"
},
"reviewBody": "I have another recipe for Mexican corn bread but this one is much better. Rather than using fresh peppers I use canned and get the very hot. This recipe is much more moist than the one from Food Net Work. I will throw that one away and keep this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dashby"
},
"reviewBody": "Only thing I did different was add 2 cups Mexican Mix shredded cheese. We like cheesy cornbread. It is my go to cornbread recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cappy"
},
"reviewBody": "I didn't have fresh jalapeño so I used pickled \"hot\" instead. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillanncpa"
},
"reviewBody": "This was great. Definitely mix the cheese in and don't put it on top. I will add some sugar next time to sweeten it up a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Priscilla Edmondson"
},
"reviewBody": "This is super simple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glen"
},
"reviewBody": "I added about 1/4 cup of my roasted Poblano's and I also made my own cream corn which is much better than canned from the store. . I got rave reviews from all who tasted it! Made it again with Anaheims, awesome receipt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bj"
},
"reviewBody": "Have made this basic Jalapeno Cornbread for years. Always A big hit with everyone. Very moist due to the cream style corn and cheese.. I add a little sweetness, with 3 Tbs sugar or honey.\nIf you have some in family that cant tolerate the spice/heat, poor half of the batter into baking dish before adding the jalapeno peppers. Be sure to Identify the hot/spicy side. Top it with slices of pepper. That way everyone is happy and no one gets a surprise ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Rena Mullenix"
},
"reviewBody": "Made this loved it my family loved it love the taste and texture will be making more so good....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "foodcritic"
},
"reviewBody": "This is a very good mexican cornbread recipe. But, I have trouble with every mexican cornbread recipe being too mushy. I think it's my fault, perhaps my oven is different, or the sea level thing? But, the next day, it was sooo much better! A friend suggested that I change from creamed corn to the sweet kernel corn drained. I will try that. She also suggested to add pepper flakes too, for more spice, as we would like it a bit hotter. So, I will try again. Otherwise, it has the right flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny Sprouse"
},
"reviewBody": "I will make this again for sure. I made a pot of beans and ham and didn’t have any Marie Callender’s, so I found this and we enjoyed it as much or better (also most cooks have all the ingredients in stock - no trip to the store)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam Edwards"
},
"reviewBody": "I made this for the first time tonight and loved it! I will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pets4pam"
},
"reviewBody": "Moist and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Moist and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "Delicious! Made it exactly as written in a cast iron skillet. Moist and flavorful. I recommend mincing the jalapeno and onions or sauteeing them first so they won't be crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Djeidik Dunlop"
},
"reviewBody": "Great recipe! Very tasty, and the spice level is adjustable if you remove the seeds or leave some in! Mine seemed to take waaaay longer to cook though (but I think I have my oven to blame!) It was very moist when it came out of the oven, but still tasted great a day later once it \"firmed up\" a bit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "I added canned green chilies sine I did not have jalapeños on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "madrye"
},
"reviewBody": "This recipe is missing some sugar. When I looked at the ingredients it seemed like it would be a nice, moist cornbread with a kick and it was. However, when I started making it I was curious as to why there was no sugar at all. I do not like sweet cornbreads, but a little sugar is needed. With some sugar, this would have been 5 stars. It is moist and has a nice zing with two jalapenos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOLOBABY"
},
"reviewBody": "This was delicious! Only thing was I had to bake it longer as it took a lot longer for the center to set. I did use an 8 inch square glass dish and it still took about 20 minutes longer to bake. Moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StevenandMaggie McClain"
},
"reviewBody": "I used this recipe for my tamale casserole and it worked very well. I did use a can of chopped green chilis instead of the onion &amp; jalapeno due to time constraints but I don't believe that changed the integrity of the recipe enough for it to not be rated as is. Thank you for this lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "novachili"
},
"reviewBody": "The cornbread had moisture going for it. However I made this recipe to the T and it was too savory for my taste. I think the onions and amount of cheese overwhelmed the cornbread flavor I enjoy. Next time I'll look for something simpler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen e"
},
"reviewBody": "Amazing!!! I used the modified recipe suggested and they turned out great. Super flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "I made this to go with our chili last night. I found it very dry. I ended up crumbling it into my chili so that it wouldn't go to waste. Not something I'd make again. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle DeCou"
},
"reviewBody": "Very moist and delicious, I added a little adobo instead of salt. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "This needs to be in a 9X13 pan 8X8 is way to small."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jammers"
},
"reviewBody": "Best cornbread ever, in my opinion. I will make it again...and again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scootersandi"
},
"reviewBody": "I think this would be 5 stars as is, but I made some changes. I have a parrot that loves cornbread, but shouldn't have onion, so I left it out. I added 1 can well-drained Rotel, used coconut oil/not corn oil, yogurt/not buttermilk, coarse corn meal, bread flour &amp; pickled jalapenos. It is fantastic! So moist! Next time I'll use a 9\"x 9\" pan, as I don't want it so thick (2\" in the 8\"x 8\"). I want to be able to fit the crispy cheese on top in my mouth with the rest of the bite..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "gives plain old corn bread a great new taste. would recommend it to everyone that likes a little heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeppyB"
},
"reviewBody": "Delicious!! I always use the hot jalapeño peppers that are pickled not fresh and substitute milk with a splash of vinegar to make my own buttermilk. The cook time on my oven is 50 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Roberts"
},
"reviewBody": "Added 1tablespoon sugar and 1 teaspoon cayenne, omitted cheese from top and used chopped green onions. Baked as muffins. Flavorful, moist and lovely texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ChuckE"
},
"reviewBody": "Easy to prepare but was not what I expected. Followed recipe to the letter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizette McKinley"
},
"reviewBody": "I made this cornbread to accompany my three bean chili at a chili cook off. Folks loved it. In fact, I had to make a separate batch for two of my friends. Very very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "libbyslabelx3"
},
"reviewBody": "Made it exactly as directed and it took waaaaaay over 35 minutes to finish. I would make it again but add an extra 10 minutes at least and I would probably not remove the seed/veins from the jalapenos because it could have used a bit more kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debs Sickmueller"
},
"reviewBody": "Just needs a 1/2 cup sugar for sweetness &amp; 4 pc of bacon &amp; the grease... and bobs your uncle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beatrice"
},
"reviewBody": "Made this recipe and it is tried and true. always turns out perfect and everybody can't get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elle"
},
"reviewBody": "Pretty darn good recipe. I added a full 14oz creamed corn after realizing it only called for an 8oz. Because I like mine sweet, added 1/2c sugar. Sliced fresh jalapenos which were crunchy after cooking which worked great because it was added to a bowl beans and ham. Good dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "Nice moist cornbread. Just the way my hubby likes it! I can not buy buttermilk in Ecuador so I used plain yogurt and it came out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhondap"
},
"reviewBody": "I didn't put a onion in it, but the jalapeño was a must! I baked it in an iron skillet on 450 degrees.\nWonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like it but halfed the onion amount and I will make it with some brown sugar or maybe some honey needs a tad bit of sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hardee"
},
"reviewBody": "Very tasty but it was more like very thick pudding than bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rob & Kara's Nana"
},
"reviewBody": "Very dense(my family did not like the consistency)and quite bland even though I used two whole fresh jalapenos, I will stick with my basic cornbread and honey butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "runzwitsizrs"
},
"reviewBody": "Gave this 5 stars because it is delicious! The only changes I made were that I used about 2 1/2 Tbsp chopped jalepenos from a jar, (not fresh),and increased the corn meal to 1 1/2c. (only because I had just a little tiny bit of cornmeal left, and I wanted to use it up.) Therefore, I increased the creamed corn to 1 1/2c (to make up the extra moisture from the additional corn meal) and, as others had suggested, I mixed all the cheddar into the batter at once. I baked this in a greased 9X9 pan for 30 mins. Served it with honey butter and a bowl of chili. Mama happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Moore"
},
"reviewBody": "After reading reviews I used half the corn liquid and added 4 green onions. It does take about 55 mins to cook but is well worth it. I'm giving the recipe to my kids. Can't wait to serve it at the family reunion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StyleGal"
},
"reviewBody": "Made this for my husband and two of his friends... They LOVED it, ate the whole skillet in one sitting! We're currently in the UK and I couldn't find buttermilk so I used 1tbsp of vinegar in a 1 cup measure, filled the rest of the cup with milk, let sit for a couple minutes before using. Also couldn't find creamed corn, so I used some frozen corn instead. Finally found cornmeal here under the label \"maize meal\" in a health food store... A finer grain than polenta, which is like yellow corn meal and also found in health food stores here. Well worth the trouble! Simple to make, everyone loved it! Very moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbug"
},
"reviewBody": "I loved this cornbread! It smelled so delicious cooking and was very most and yummy. The only thing I changed was that I used coconut oil instead of corn oil and dehydrated onions instead of fresh. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tina_bo_bina75"
},
"reviewBody": "My family really enjoyed this. It was good, but I felt it was just missing something, and I can't put my finger on what it is. I would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susie"
},
"reviewBody": "Wow. Just had this with vegetable soup. It was great! susie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bilchuk"
},
"reviewBody": "Great recipe. My mods: upped to 3/4 flour to give a little more body. Added small can of green chilis and two chopped sarrento peppers. Definitely seed the jalapenos to get flavor without too much heat. Added a little garlic. I used both a can of (no salt added) kernal corn and a can of (no salt added) cream-style. Need to bake about 45-50 minutes to get nice crust on top. Also I recommend using the coarsest cornmeal you can get; I used polenta meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patty Cakes"
},
"reviewBody": "This was really good!! I only gave it 4 stars cuz I subbed part of the flour for mesquite flour. This gave it a nice smokey taste and brown color. I forgot to add the peppers &amp; the cheese. It was T G DAY and had way too much stuff going on in the kitchen. To be honest with you, I think I will heat it up in the morning and put pancake syrup on it!! Happy Thanksgiving! ! Thanks Lynn, loved this!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanah Phillips"
},
"reviewBody": "Fantastic recipe!!! I added chorizo to mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Manny"
},
"reviewBody": "A very good cornbread but it was lacking something. I think sugar.\nI used a little more cheese than recommended and I left the seeds in the jalapenos. I cooked it a good ten minutes longer than the recipe calls for and it still came out surprisingly moist, but not under-cooked so I guess that's just the way it's supposed to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony Goff"
},
"reviewBody": "This is good cornbread. It is dense and flavorful with plenty of moistness. I got numerous compliments on it and there were no left overs. It is not sweet so if you like a sweet cornbread just add some sugar as others have recommended. I used a 4 oz. can of roasted jalapenos that I diced up instead of 2 fresh ones since I didn't have any fresh jalapenos in stock. It was not hot. It was flavorful and moist but really no heat. I would have liked a little more heat for my tastes. I don't know if the fresh jalapenos make it very hot but if you want a tasty mild version I can vouch for the Ortega roasted jalapenos in a 4 oz. can."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Raye Ann"
},
"reviewBody": "I'd say 1 cup of onion is sufficient for this recipe. I speak from personal experience. That said, I have another cornbread recipe that I rather than this one. Thanks though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jollysgirl"
},
"reviewBody": "Absolutely delicious! Moist and cheesy : ) I accidentally poured all 1 and 1/2 cups of cheese into the mixture, and it was still amazing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/6802/mexican-style-cornbread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/342/bread/quick-bread/cornbread/",
"name": "Cornbread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/6802/mexican-style-cornbread/",
"name": "Mexican Style Cornbread"
}
}
]
}
}
, "about": [
]
}
]