				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Million Dollar Fudge"
,"datePublished": "1999-03-13T18:10:38.000-05:00"
,"dateModified": "2022-07-14T15:52:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BETHJ1"
,"url": "https://www.allrecipes.com/cook/146751"
}
]
,"description": "I have had this recipe for years; it makes an especially creamy fudge. Store in a tin box."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/pIFC3iKHzRtnmbftAt5qpSARRbM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/55196-8b7302c79f0d4c0cb6cc8c3128e90cbc.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Million Dollar Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "236"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "206 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "18 mg"
,"sugarContent": "29 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"4.5 cups white sugar",
"1 pinch salt",
"2 tablespoons butter",
"1 (12 fluid ounce) can evaporated milk",
"2 cups chopped nuts",
"1 (12 ounce) package semisweet chocolate chips",
"12 (1 ounce) squares German sweet chocolate",
"2 cups marshmallow creme" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Butter two 9x9 inch baking pans and set aside."
} ,{
"@type": "HowToStep"
,"text": "Place chocolate chips, German chocolate, marshmallow creme, and nuts into a large mixing bowl. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a 4 quart saucepan, combine sugar, salt, butter, and evaporated milk. Stir over low heat until the sugar dissolves. Bring to a boil, and cook for 6 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour boiling syrup over ingredients in bowl, beat until all chocolate is melted. Pour into prepared pans. Let stand a few hours before cutting."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve been making this recipe for over 50 years it was passed down from my grandmother. My dad loves it. I make it for him every Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gale E"
},
"reviewBody": "I have double checked everything made it per instructions and it sugared instantly. I was careful with the sugar to keep crystals away from mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dnaber"
},
"reviewBody": "Every grocery was out of marshmellow cream. So I substituted 32 jet-puffed large marshmellows and 1/4 cup corn syrup. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "earllbenton"
},
"reviewBody": "Can I give this recipe over 5 stars? I would if I could. I’m a man—-but, I can read and follow directions if I have to and did, Wow this fudge is creamy. My wife and I aren’t so chocolate Lovers, so I just used one package of milk chocolate chips—-Perfect! I used a thermometer and needed to use 9 minutes of full boil time, but burner wasn’t as high maybe as it could have been, so waited to 236 temp and poured it in the mixing bowl, used a big ole stand mixer with paddle and about 2-1/2 minutes later, in the pan. Wife really liked it and made up for trashing another old time recipe for fudge that was hard as a hockey puck! This fudge was easy, did I admit that, and I will use this recipe again, it’s great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharonras"
},
"reviewBody": "This is the best fudge I have ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina Guthery"
},
"reviewBody": "Followed recipe as written. Turned out great. Definitely a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Patricia Territo"
},
"reviewBody": "This was the worst experience in the kitchen! Horrible recipe and fudge. I made it based on reviews but I'm convinced after two attempts that the recipe is not worth the effort. If you are like me you probably invested in really good chocolate which was wasted. First attempt the sugar NEVER dissolved no matter how long I tried. Then I found out that stiring that mixture while cooking actually crystalized the sugar and it has to be disgarded. The recipe said STIR!!! The second attempt same thing even without stiring. Now that I researched good fudge I'm convinced I was not the problem and the recipe is Not very good! The final product proved worthless!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina Palin"
},
"reviewBody": "My grandma used to make this every Christmas. This is the second time I've made it since she passed away.\n A 7 oz tub of marshmallow cream equals 2 cups.\nIf you use a water bath, or double boiler method to melt the chocolates, it's easier to stir. This is an EXTREMELY thick fudge, so unless you have an actual industrial mixer with a dough hook, you're better off hand mixing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diamondgirl0410"
},
"reviewBody": "Followed the instructions to prepare but poured into a buttered 9 x 13. Turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Buono Webber"
},
"reviewBody": "Very creamy loved by all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kate Defelice"
},
"reviewBody": "The fact that it didn’t harden kinda sucked because I made it for the holiday and brought it with me to my daughter’s . Embarrassing! From now on, I will try out recipes on myself first!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JKnight"
},
"reviewBody": "Best fudge I’ve ever made. So creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "Amazing Fudge. Just like I remembered making with my grandma. Do remember to dissolve the sugar completely on low heat ( it can take 10-20 mins ) and then turn up the heat and stir constantly and boil 6 mins as it states. Perfect !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUNISIANSWIFE"
},
"reviewBody": "I loved the creaminess of this so much! this will be my 'go-to' from now on. I've tried many different recipes over the years with mixed results. The texture of this was perfect. *If you rub a little butter around the sides of your pan, sugar crystals won't form. This is important so you won't get graininess. *don't rush it. Candy can't be rushed. a bare medium heat is as high as you want it. *A straight edge type stirring utensil works best. I have a roux paddle that I use but a pancake turner also would work well, since you want to be sure that none sticks to the bottom. *make sure that you do not start timing it for 6 minutes until it comes to a roiling boil. You want the bubbles to be present over the entire surface. I usually use a candy thermometer but decided just to do the water test and right at 6 minutes, it was a soft-ball stage using this method. Perfect. I always line the pan with lightly buttered foil, as it just makes it easier to lift it out and flip it over onto a cutting board to cut. The foil comes right off. I couldn't see the sense of pouring the very hot liquid onto the chocolate, so just dumped the chocolate/marshmallow cream into the hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heathermarie8"
},
"reviewBody": "Wonderful! As others have suggested, you have to make sure the mixture gets to soft ball stage to ensure the sugar mixture gets fully dissolved, or you will have some issues of texture and it not setting up correctly. I use a candy thermometer and take this off the heat when it reaches soft ball, and add to the chocolate mixture. I did use shortening as I was out of real butter. Turned out beautifully! LOVE this recipe, thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aries 7"
},
"reviewBody": "I will never make any other version but this one. Made it exactly is the recipe says. Didn't change a thing. Even before I added the bubble to the chocolate, I knew it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maggie"
},
"reviewBody": "It's nice and creamy but just too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kookaburra"
},
"reviewBody": "At last! A fool proof fudge recipe that tastes great. This one is easy to prepare and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "No changes and yes, I will make it again. This is the best, creamy fudge I have ever tasted. There is nothing worse than gritty fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "Easy and great!! Never sure about the \"boil.\" Full, rolling boil, or what and then when to start the timing. Turned out great though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUEASTY"
},
"reviewBody": "superb recipe and so yummy!! I made this today exactly as written. I had no problems and it turned out creamy and very smooth, melts in your mouth so good - just boil 6 minutes -- it didn't take long to reach that stage = used walnuts as I have my own tree. I use 1 block of german chocolate- its 4 oz and rumbage around in my pantry draw for some other chocolate to add. the bars come in small bars now semi sweet chips are fine taste great.... I did cut recipe down to 1/2 ,which is 1 pan 9 by 9 - its plenty for us and makes a lot - this is a great recipe and I will be making again --"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bertis Box"
},
"reviewBody": "I tried this recipe ,,,, I was challenged because I’ve never made fudge before. I made it for some co workers and Bingo! They loved it! My husband loved it as well,, it’s a great recepie .\nJust remember to take your time melting all of the sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'gal"
},
"reviewBody": "I made this fudge as stated and it came out creamy with a rich, full bodied flavor. I made this for hubby and he liked it but prefers a fudge with more of a milk chocolate flavor. For this reason I may not make it again. It did get eaten though! When first pouring it into the pan after cooking I thought it was too soft, but after cooling it hardened just right and kept its shape after cutting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey Elliott"
},
"reviewBody": "It took forever to dissolve the sugar but it was worth it. GREAT FUDGE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Ethington"
},
"reviewBody": "Very creamy, delicious. The best fudge I have ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahR"
},
"reviewBody": "My mother gave me this recipe almost 50 years ago. It is exactly the same, right down to the instructions and the 6 min cooking time... According to my mom (still with us at 95 years old) this is Maime Eisenhower's fudge recipe. She used pecans in the original recipe. How my mother got it I never asked. My family has been making this for over half a century. Enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pulleyfg"
},
"reviewBody": "I've been making fudge since 1980.Yes I line my pan with non-stick foil. Leave on each end of the pan foil to just pick up. This fudge was called Fantasy Fudge I still make it during Christmas.My calls for only 3 cups of sugar.A few changes but still the same good fudge! Fran From Spain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making fudge since 1980.Yes I line my pan with non-stick foil. Leave on each end of the pan foil to just pick up. This fudge was called Fantasy Fudge I still make it during Christmas.My calls for only 3 cups of sugar.A few changes but still the same good fudge! Fran From Spain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maria Pronsati-Marker"
},
"reviewBody": "Creamy and delicious. A bit sweet for my liking; so the 4 stars. Here's my best advice for making fudge--Use a candy thermometer and take it to the soft ball stage. DO NOT just try and time this. Depending on your heat setting it will change. Try to make sure the sugar is completely dissolved before boiling. Cook on a lower temp until when placed between your fingers, you can no longer feel the grains of sugar. If you use the thermometer, you should have perfect fudge every time. I made over 20lbs of various fudges for Christmas presents and they have all come out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stella"
},
"reviewBody": "Definitely a winner! While it's a matter of personal preference, I find it easier to use a candy thermometer to boil to the soft ball stage than to try to time it for six minutes, since I'm typically uncertain as to when to start the timer. I've made this recipe successfully several times, though I've forgotten to add the vanilla extract a couple of times. With or without vanilla, the fudge is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sitfan"
},
"reviewBody": "I have made this recipe many times and I always get compliments. If you want dark chocolate fudge, just change the type of chocolate. I use 4 squares of bittersweet and 8 squares of semisweet, then cut the sugar to 4 cups and it's still just as creamy and yummy as you'd want. DON'T boil the mixture until all the sugar is dissolved, stir continuously over low-med heat. This usually takes a while so be patient. I have never had this fudge turn out grainy. If it's grainy, then you didn't wait long enough for the sugar to dissolve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pacific NW chick"
},
"reviewBody": "First time fudge maker but having gone through many, many batches in childhood my expectation bar was high. This was super simple to make and a very forgiving recipe! I decided to make it special by mixing up my chocolate varieties and think that definitely helps. Terrific base fudge recipe that sets up perfectly. Lining the pan with parchment definitely helps turn this out easier!\n\nI am going to whip up a second batch in peanut butter flavor. I think if you use sweeter chocolate (like I did with adding milk chocolate for instance) you *might* want to cut the 4 1/2 cups to 4 cups sugar. It is rich and sweet and very dense so you can't eat too much! Perfect for holidays. Thanks to the poster and reviewers with their tweaks and steps too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeffandcari"
},
"reviewBody": "Fantastic and seems to forgive mistakes - I wanted to make 2 different flavors of fudge (traditional chocolate fudge, and a white-chocolate peanut butter fudge), so I eye-balled all of the chocolate measurements, and then poured about half the boiling syrup to make one flavor, and the other approximate half of the boiling syrup into the other bowl for the other flavor. It's about 30 minutes post-pour and they have set up nicely and have everything I hope for in a fudge! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Hawotte"
},
"reviewBody": "Excellent recipe. Creamy but sets up well, very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "workingmom"
},
"reviewBody": "Awesome fudge, and a great base to make other chocolate versions. I've never been able to get fudge out right, and this one worked perfect! The tip of starting out on a low flame and allowing the sugar to dissolve before boil was a great suggetion and took about 17-20 minutes. We can't get enough and thanks for posting!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnuttall"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "m"
},
"reviewBody": "it turned out dry\n\nwhat happened?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanMcD"
},
"reviewBody": "This fudge is wonderful,it has a rich chocolate taste and is nice and creamy. No problems making it at all. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "This is outrageously delicious fudge. The best fudge ever, and I have made plenty of it. I would say, don't change a thing and it will be perfect. I will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trixie_stardust73"
},
"reviewBody": "Has potential and definitely less room to mess it up than the old fashioned fudge recipe I've been using. I did cook it to the soft ball stage using a thermometer and it did set up fast. Next time I would cut the chocolate up into smaller pieces so it melts faster when stirring it at the end. I think I would also seek out better quality chocolate. The final texture is great but it sort of just tastes like chocolate chips to me. I think I'll avoid the grocery store chocolate next time and get something better quality. I imagine then it will be divine. I'll also add a tsp. of vanilla next time I make it. Definitely has potential! I'll continue to play with the recipe a bit to get it where I like it but the texture is great, which is a good first step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Delicious......easy, since I'm a first timer. Thanks to all the reviews ahead of me as far as cooking very slow until it boils and then timing for 6 minutes. I did pour into bowl with the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Newtocooking"
},
"reviewBody": "First of all my Partners a chef and my mother bakes from scratch so I have pretty high standards and this was fantastic!! I can screw up buscuits from a can so if I can do this anyone can!!! Glad to read so many helpful comments and tips...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momthesaint"
},
"reviewBody": "Delicious! I left out the nuts...personal preference. I also used the smaller tubs of marshmallow fluff and simply used 2 whole small tubs-instead of the intended \"2 cups marsh. creme\". ALSO, this is the most important... I stirred the out of the mixture to melt the 4 1/2 cups sugar into the wet mix. I literally stood at the stove for 20 mins, by my timer. I know this makes a difference. I have had grainy fudge, no one likes grainy fudge. I gave every couple in my family a small amount of fudge for Christmas, and everyone loved it! It's creamier than I remember my Nana's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "I've been making this fudge for 40 years. It always turns out great but it was the best ever this year. I usually cooked the milk/sugar mixture in the middle of the \"medium\" area on the stove knob. This year I cooked it at the high end of the \"medium\" area &amp; the fudge came out a little sturdier. It was still creamy but a little firmer. My version of this recipe says to stir the fudge until it starts to stiffen &amp; by that time all the marshmallow fluff is fully incorporated...no swirls like in the photo. My sister made this fudge but used only 4 cups of sugar &amp; she said it came out just fine. I have often given this fudge as a gift at Christmas &amp; normally generous people suddenly get very stingy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sulli3"
},
"reviewBody": "This was a big hit. If you are really quick you can spoon it into cupcake papers before it starts to set up and make cute little mini-fudges to give to neighbors and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GaJanie"
},
"reviewBody": "If your fudge is grainy it means there was at least one sugar crystal in the mix that did not dissolve. It starts a chain reaction and turns other sugars back to crystals. To keep that from happening cook your liquid slowly and spoon the hot liquid on the sides of the pan while its cooking until you are sure all sugar crystals clinging to the side of the pan have been washed down into the liquid where they will dissolve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tnorrell"
},
"reviewBody": "This is a nice and easy recipe. Turned out great the first time I tried it. Very smooth and creamy. Keep in refrigerator or fudge will get soft. Serve chilled is the best way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a fantastic fudge recipe and I have used this recipe for 40 years (it used to be called Martha Washington Fudge). However, I really don't understand the complexity of the directions wanting you to pour the scalding syrup over the chips and in two pans no less. As soon as that 6 minutes of boiling stops, take it off the flame, incorporate the marshmallow creme and then throw in all the chocolate and stir to melt it all. This fudge sets up quickly as soon as the chocolate hits and the more you mess with it the less attractive it gets (it gets dull). I always use a 9x13 pan and I grease it lightly with butter. Note:dark chocolate chips work beautifully for a richer fudge and sometimes don't use the nuts. I make a pan of plain and a pound of nut and divide it up for Christmas gifts. Note the basic recipe makes a little more than 6 generous pounds of fudge. I always make it for a charity event we have where food is auctioned off and often have people bid up to $25 a pound."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarmckee"
},
"reviewBody": "This was the first time making fudge at all. It was very easy and Yummy! I can not wait to share with the kids and friends! Very creamy, I did put mine in the fridge after letting it sit for about 4 hrs and it was not as mushy...I will use this from now on thank you!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keshia"
},
"reviewBody": "Great Recipe!!! So super easy to do even for beginners. I added marshmallows to mine to make it like a rocky road and drizzled white chocolate on top and was to die for! The original recipie is great on its own as well!! Thanks for making my christmas a little sweter BETHJ1!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandymae3386"
},
"reviewBody": "This fudge turns out GREAT!! everyone loves it at work and at home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish8418"
},
"reviewBody": "I make this every year for christmas gifts. it's decadent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bighusky"
},
"reviewBody": "It was my first attempt at fudge and the best i've ever had. I used milk chocolate instead of semi sweet (sorry bethj1!) and it is creamy and smooth and GONE! Oh yes Missy left a review which saved my butt, thank you Missy. Her advise to melt the sugar on low heat first and then start the 6min boil (yes I'm a newb) was a life saver. Enjoyed it ! Thanks bethj1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "courthj"
},
"reviewBody": "I am a rookie fudge maker and this recipe was awesome. I followed the recipe to a tee and all my coworkers loved it. It had great texture and now I can get creative and add different things to it like peanut butter and more nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terptiff"
},
"reviewBody": "This is my favorite fudge! In a pinch, I used 2 bags of chocolate chips and 2 cups of mini marshmallows, and it still came out great. A great tip for cutting: use a plastic knife, the fudge doesn't stick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandiJ"
},
"reviewBody": "this recipe has been a tradition in my family since before i was born. If you like nuts in your fudge add 3/4 cup chopped pecans or walnuts before pouring into pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My3Girls"
},
"reviewBody": "It took two tries to get this right but it was worth it! The first time I tried to half the recipe and overcooked the sugar. I added the sweetened condensed milk as someone else suggested and was able to save it. Attempt 2: PERFECT! I did use a candy thermometer to reach the soft ball stage which took closers to 8 minutes, as another recipe of mine suggests. It set up beautifully. It has a great consistancy, flavor and texture. I used parchment paper (I'm a lazy cleaner). It easily lifted out of the pan and was super simple to cut with a pastry knife. TIP: When measuring marshmellow, run your measuring cup under hot water before using it. The marshmellow will slide out easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Eva N"
},
"reviewBody": "It was OK but not great. Mine set up fine but wasn't as creamy as my old stand by fudge recipe. You have to make SURE that your sugar is dissolved. If you don't it will be grainy. I will keep searching. Or just go back to mine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Cournoyer Twombly"
},
"reviewBody": "I'm notorious for making soupy fudge, but this came out flawless. Gave a ton away at the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~Sara Ann~"
},
"reviewBody": "The BEST fudge recipe I have come across!! I made this fudge for Christmas gifts, and put it in Christmas Tins. They came out absolutely amazing, and everyone was complimenting me on them and even made requests for them next year! One batch, I added small Marshmallows to make it into \"Rocky Road\" fudge, and some with and without nuts. No matter what you do to these, they turn out GREAT!! I threw away all of my old fudge recipes after finding this one. Thank you for sharing this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "This fudge was excellent! It was very easy and turned out great. I made it for my boyfriend and also some friends and they all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime Whitney"
},
"reviewBody": "This is what my mom used to make. It's a family classic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joelle"
},
"reviewBody": "A bit too sweet for my taste but received many compliments from others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harmony"
},
"reviewBody": "First time I've made fudge and it turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy"
},
"reviewBody": "I made this fudge last year and then again this year. It is really good, and even my stepdad who has eaten old fashioned homemade fudge loves it. I noticed that some people have had trouble with it not setting up. I have never had that problem with any of the 4 batches I have made. You have to make sure you dissolve the sugar over low head BEFORE you begin to boil it for 6 min. The dissolving stage may take some time, I think it took me about 20 min today. Use your finger to touch some of the mixture on a spoon to test for grainyness. If you feel grains, continue stirring to dissolve. Also, someone said you need 12tablespoons of butter, that is not true at all. I would think adding more butter would make it take longer to set up. It takes about 2.5-3 hours to set up. I put it in the refrigerator to set up, then it stays hard at room temperature. Also, a hint for measuring the 2 cups of marshmallow creme, just use a 7oz jar. It's about 2 cups. That will save you from the sticky mess. Hope this helps a little for those who had poor luck with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dwest"
},
"reviewBody": "This recipe is fantastic, it has an amazing texture. I wasn't 100% satisfied with the taste, so I altered the recipe just slightly, not wanting to ruin the texture in any way. Instead of 12 oz of German sweet chocolate, I used 8 oz and therefore 16 oz of semisweet chocolate, then added 2 teaspoons of vanilla, it was exactly what I was hoping for tastewise. This will be my chocolate fudge recipe from now on, I don't think my family would have it any other way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PONTIACGIRL71"
},
"reviewBody": "I don't typically like chocolate fudge but loved this! I made two batches, one as written and the second using Hersey's special dark chocolate chips in place of the German chocolate and omitting the nuts. I prefered it without the nuts and the chips version was just as good. I cooked the recipe on the second lowest setting on my stovetop for about 10 - 15 minutes, bringing it to a rolling boil. I had the Fluff and chocolate ready in my Kitchen Aid mixer, added the hot syrup and mixed on the lowest setting until well blended. This fudge is so creamy and tasty, it turned out perfect both times and will be a new addition to my recipe collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lalalanono"
},
"reviewBody": "Last year, I tested this and two other fudge recipes and this was the WINNER! Everyone loved this recipe the most - TY for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveMexiFood"
},
"reviewBody": "Brought it to work and it was gone in a couple of hours. The ingredients with the sugar, evap milk, butter tasted just like sweetened condensed milk. The fudge reminded me of frosting. It was pretty good, but I don't think it is my all time favorite recipe of fudge, but pretty close:) Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rtarantino"
},
"reviewBody": "Worth all of the hard work! I made this recipe while a friend made a much simpler fudge recipe and this fudge was MUCH better! I did put the fudge in the fridge overnight before I cut and served it and it was much easier to cut. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CARRIEZ"
},
"reviewBody": "NOT simple. Mine tasted great but did not set up. I couldnt serve it. I belileve I know what I did wrong. I also do not believe I will make this again. It is too temperamental."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derrick Moore"
},
"reviewBody": "Wonderful. This was my first time making fudge and it turned out perfectly. I live in Upstate NY and I drink a wine called Sweet Rosie. This fudge and the wine go perfectly together. Excellent fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dodi Thomas Mawer"
},
"reviewBody": "Not a bad recipe. I will definately make this again. I used a candy thermometer also and stopped at just over soft ball stage. The only downfall was I had to keep it in the fridge or it would turn all soft and mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Excellent and very easy to make!!! This was the first time I ever tried to make fudge and it came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Delicious! I used to make Kraft's Fantasy Fudge at Christmas with my mom every year, until they changed the recipe on the marshmallow cream jar. I Have been looking for a similar recipe for years. I decided to try this one, and even though it's a bit more expensive due to the German Chocolate, it's worth it because it was delicious and had exactly the consistency that I wanted. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kbloughlin"
},
"reviewBody": "Best Fudge I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "did not get hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mich"
},
"reviewBody": "So good, so easy and we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonbendell"
},
"reviewBody": "I've never made fudge before and some of the negative reviews had me nervous that it wouldn't turn out. But I followed the ingredients and instructions precisely rather than making any changes on my first attempt and it turned out PERFECTLY. Awesome and creamy. Some said it was too sweet but I think it tastes like fudge is supposed to: SWEET! Thanks for this awesome recipe! I will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ajefferi"
},
"reviewBody": "WHOA! TONS of sugar in this. I didn't even put in the full amount and it was still way too much. Easy and decent recipe, good flavor but WOW. None of my family could have more than one piece at a time. Less than half of them got eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dee"
},
"reviewBody": "There is a MISPRINT in the recipe. It should be 12 Tablespoons butter!!!!!\nIt will be very grainy it you use only 2"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meg Fox"
},
"reviewBody": "My brother-in-law loves fudge, to the point that it is what he asks for every year for Christmas. I decided to bite the bullet this year and make some for him. This recipe was very easy to follow and he loved it. He said it was the best homemade fudge he had ever eaten - so I think that means it was real good. I wanted to make sure that it was stiff enough to last the car ride to my parent's house on Christmas. I decided that I would follow some of the advice of other reviewers and cook it a little longer. I didn't have a candy thermometer, and I tried to the do the soft ball test, but that wasn't working either, so I just let it cook for about 12 minutes and it turned out perfect - not mushy and not stiff. I also stirred it with my whisk the whole time it cooked and had no problems with consistency. Great recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rawan"
},
"reviewBody": "it's very tasty, however, it's too soft, even if you refrigerate it for hours, it would feel hard on top but i couldn't even pick it up, we ate it by fork, again,it is very tasty but way too soft.. any advice on what to do? may be i should have greased the pan more, but the softness? I followed the exact recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Justina Schneeweis"
},
"reviewBody": "Over all this recipe was super easy for some one with NO candy experience at all. The texture of the fudge is almost perfect, I just did'nt get the glossiness, it didn't really pour into the pan, I sort of had to push it out, almost like a very soft dough. But it is still delicious. Next time I will use something other than semi-sweet chips, I never liked their flavor and the fudge tastes mainly like them. 5 stars for a well built easy to follow base recipe, less 1 for flavor, could be better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnyfinn"
},
"reviewBody": "Great fudge, and practically dummy proof! I made it once as written, and once with peanut butter instead of walnuts. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "This was really good fudge, very creamy. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom of six"
},
"reviewBody": "This recipe is a keeper!!!\n\nThis is the first time I've made fudge and it turned out great! I only used 4 cups of sugar, to cut down on the sweetness. It is pretty sweet, but isn't that how fudge is supposed to be? \n\nSome people said that it turned out gritty (sugar didn't dissolve). It needs to be cooked slowly UNTIL the sugar dissolves, then brought to a boil before pouring into the chocolate mixture. I kept taste testing it until the sugar was dissolved. \n\nOne suggestion I have would be to spoon out the marshmellow cream in small amounts to separate it. That would help it melt faster. The chocolate melted very fast for me, but I had to stir and smash the marshmallow cream against the side of the bowl to get it too melt. \n\nThis fudge is excellent, and I might try it next time with a dark unsweetened chocolate in place of the German. I think you can play around with different types of chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirltalia"
},
"reviewBody": "This fudge turned out amazing! For my first attempt at fudge I was very impressed! I made sure to completely dissolve the sugar, and there was no graininess whatsoever in the final product. It was extremely smooth and creamy. I think as far as lumpiness goes, make sure the marshmallow creme is from a new jar and isn't old... cause stiff marshmallow doesn't melt so easy and could create lumps. The only thing I changed was that I didn't add nuts. And I threw some rainbow sprinkles on it to make it a little prettier.\n\nI love this recipe and am looking forward to making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BELINDAJK"
},
"reviewBody": "Might be me and not the recipe, but I had a really hard time with it. I did the evaporated milk/sugar/salt/butter cook twice. \n\nThe first time I was using a large broad pot. It took half an hour to start boiling. I saw another reviewer had written that you should get it to soft ball stage on your thermometer if you have one to make sure it doesn't come out mushy. Well, an hour later it still wasn't at soft ball and it wasn't looking too good. It was scorched in places and lumpy and I knew it couldn't be right. So I didn't pour it over the stuff in the bowl. I decided to try again. \n\nThis time I used a smaller pot. But it was taking even longer to boil. After 38 minutes, I turned the heat to medium even though other reviewers say again and again not to do this. I was exasperated though and needed to get on with my life. \n\nIt boiled after a few minutes, but once again, it was taking forever to get to soft ball stage. Since the original recipe just says to cook it 6 minutes and it was starting to seem like it was scorching, I decided to pull it off the heat at 220 degrees, about 10 minutes after it started boiling. \n\nThe flavor is very good and it is creamy, not grainy, but it's mushy. Maybe I should have held out for the soft ball stage. \n\nA lot of people have had very good luck with this so it's probably my stove, which is a relic from the early 70s, that isn't giving reliable heat or something. I'm thinking I won't try this one again. I have other fudge recipes that give me r"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLCarignan"
},
"reviewBody": "My husband loves this fudge. I didn't use nuts because I don't personally like nuts, but in retrospect I should have because I am giving some to my co-workers and the nuts would have given the fudge a nice texture. It's very rich and very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSIESKI"
},
"reviewBody": "First batch was grainy. But I made a major mistake! I used sweetened condensed milk rather than evaporated milk. For those of you experienced cooks, this must seem ridiculous. But for me, the cans look the same and were in the same area of the grocery store. So - before I threw in the towel, I bought EVAPORATED milk and tried again (I didn't use the German chocolate for the second batch as it was so expensive - next time I will!). This batch is creamy and delicious, and the recipe really is easy. I will make again! Don't give up! Check your ingredients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "Amazing and creamy. I cooked it for 8 minutes (starting from the point where it was at a hard boil.\nFor those of you finding it grainy, you probably aren't cooking it over the low heat for long enough. It needs to be cooked over low heat for a good 20 minutes before you bring it up to a boil. I stirred constantly throughout boiling and the sugar dissolving. It was quite a bit of work, but the end result is spectacular.\n\n2017: use a big pot to cook! It froths up. Also marshmallows and corn syrup can be microwaved to make fluff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rethea"
},
"reviewBody": "Loved, loved, loved this recipe. It was easy to make and is excellent tasting. I don't ever need another fudge recipe. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Okay, long story short, I overcooked the syrup mixture and the fudge turned out dry. I was about to toss it when I decided to experiment with trying to fix it. I cut/crumbled the dry fudge into a plastic mixing bowl and added one 14oz can sweetened condensed milk (NOT EVAPORATED MILK) and microwaved until warm, about 45 seconds. Then I stirred, and stirred and stirred until it looked creamy and smooth. Poured it into a 9x13 pan and held my breath. I can not believe that this actually worked. The end result is pretty good, though I believe some of the chocolatyness was lost in the rescue attempt, the texture is great. Beats throwing it out. I have made this recipe before as per the directions and it is a good one, just don't overcook the syrup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hubmonkey"
},
"reviewBody": "this was the best fudge I have ever tasted. I followed the recipie exactly and it turned out wonderful! I hope to make the fudge again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "The fudge tasted amazing, and this was the very first time I tried to make fudge. The only problem I had was the fudge was a little too soft when handling it. I was looking to get something that was a little firmer but with the same texture this fudge had in your mouth. If anyone knows any tips on how to firm up the fudge a bit, I would welcome all advice! \n\nI also boiled the sugar mixture for an extra 2 min (I live at over 6000 feet in elevation, I always cook things a few minutes longer), and I used milk chocolate instead of the German chocolate. However, I will use the German chocolate next time as the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LHWHIZ1"
},
"reviewBody": "I followed the recipe exactly but the fudge did not set up. It was very difficult to get it out of the pan and I had to keep it in the refrigerator. The flavor is pretty good, but it is too messy. There are better recipes out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Seidenspinner Durjan"
},
"reviewBody": "So easy, So good! Followed the recipe to the letter...but added mini marshmallows to the soft fudge at the end ...AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook24"
},
"reviewBody": "One word: MARVELOUS!\nI added 2 tsp. cinnamon to one pan, and made Mexican Chocolate fudge, which everyone loved as much as the plain fudge.\nJust plain delicious!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9436/million-dollar-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
"name": "Fudge Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17151/desserts/candy/fudge/chocolate/",
"name": "Chocolate"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9436/million-dollar-fudge/",
"name": "Million Dollar Fudge"
}
}
]
}
}
, "about": [
]
}
]