				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Million-Dollar Spaghetti"
,"datePublished": "2020-02-06T20:09:51.000-05:00"
,"dateModified": "2022-05-18T10:39:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Coqui30"
,"url": "https://www.allrecipes.com/cook/1864604"
}
]
,"description": "This million dollar spaghetti is an easy-to-make hearty casserole with layers of buttery pasta and homemade beef sauce baked until creamy and cheesy."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/L8JRHhrmhZ5Vxc3BIHbEScmhFm4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/232227-million-dollar-spaghetti-3669712555cc481fad2e537ff873ca0b.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6129802141001",
"description": "This spaghetti casserole tastes like a million bucks!",
"duration": "PT3M1S",
"name": "Million Dollar Spaghetti ",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ff933cd3-6a87-4d69-bbca-3bde333351d4/a3a8a8ce-c0d3-4f26-8857-e90fc56bceea/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:34:16.928-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Million-Dollar Spaghetti"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "337"
}
,"cookTime": "PT65M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "618 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "136 mg"
,"fiberContent": "2 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "24 g"
,"sodiumContent": "721 mg"
,"sugarContent": "6 g"
,"fatContent": "42 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (8 ounce) package spaghetti",
"1 pound lean ground beef",
"1 (16 ounce) jar spaghetti sauce",
"0.5 cup butter, sliced - divided",
"1 (8 ounce) container cottage cheese",
"1 (8 ounce) package cream cheese, softened",
"0.25 cup sour cream",
"1 (8 ounce) package shredded sharp Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in boiling water until cooked through but firm to the bite, about 12 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer to a bowl and mix in spaghetti sauce."
} ,{
"@type": "HowToStep"
,"text": "Place 1/2 of the butter slices into the bottom of a 9x13-inch casserole dish. Spread 1/2 of the spaghetti into the dish."
} ,{
"@type": "HowToStep"
,"text": "Mix cottage cheese, cream cheese, and sour cream together in a bowl; spread mixture over spaghetti. Cover with remaining spaghetti and top with remaining slices of butter."
} ,{
"@type": "HowToStep"
,"text": "Pour ground beef mixture over spaghetti and spread in an even layer."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/L8JRHhrmhZ5Vxc3BIHbEScmhFm4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/232227-million-dollar-spaghetti-3669712555cc481fad2e537ff873ca0b.jpg"
}
]
,"text": "Bake in the preheated oven for 30 minutes. Spread Cheddar cheese on top and continue baking until cheese has melted and is lightly browned, about 15 minutes more."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not crazy about this version. I'd prefer to use Ricotta cheese instead of Amer cottage cheese.... And for last topping I'd like Mozzarella/Parmesan mixture or just Mozzarella. This version seems too *Americanized*.... cheddar topping reminds me of an American Cheeseburger instead of an Italian dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Comstock"
},
"reviewBody": "Excellent and super easy! I added black olives and mushrooms to mine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very similar to a one-layered lasagna, but instead of béchamel sauce, it’s an Alfredo-sauce. It’s annoying eating semi-dry spaghetti, when it could’ve been nice and moist with lasagna sheets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Dean"
},
"reviewBody": "I only used butter to oil the bottom of casserole dish, and I used a bigger jar of spaghetti sauce, other than that I followed directions. It was really good! My daughter who hates spaghetti, actually ate it and liked it! I will make it again in the future. Thanks for the great idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rjpsep1980"
},
"reviewBody": "I made a few exceptions to this recipe, cutting down on the butter and omitting the cream cheese. It turned out 'ok' and there was a lot of liquid in the bottom of the casserole. I'll keep searching for 'the best' spaghetti casserole"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Trusty"
},
"reviewBody": "Very good! I could’ve used slightly less cream cheese but I used recipe as was. Really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy's Collections"
},
"reviewBody": "Delish! Because I am watching calories and fat, I used low fat sour cream and cream cheese, fat free cottage cheese, eliminated the cheddar cheese, and got it down to 392 calories per serving. Would have been less with 90% ground beef, but 85% was on sale, so I used that. As some reviewers complained that it was bland/needed aromatics, I sautéed 5 oz onion and a poblano pepper with the ground beef, and added salt, pepper, Italian seasoning, and garlic powder. I didn't layer but mixed it all together. Because everything was hot, it only needed 20 minutes in the oven to become bubbly. It was plenty saucy. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Really, really liked this! Followed exactly except I was out of spaghetti noodles so I used angel hair instead. Felt it could have used more sauce - especially to the ratio of cheese and noodles; maybe pour some spaghetti sauce on the bottom of the pan? Then layer? Overall, very tasty meal! Reminiscent of my younger years! Thanks Coqui30!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merle Bowers"
},
"reviewBody": "I modified a bit, but it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for our Mother/Daughters dinner. It was a big hit with all of us. My daughters kept saying how much they liked it and reminding me to send them the recipe. We all definitely be making it again. We have a carry home policy with our meals. My daughters divide up the leftovers and carry them home to share with their family. They leave me enough for one or two meals. The next time I make it I will double the recipe, so there will be more leftover for them. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzycooks79"
},
"reviewBody": "Yummy recipe. I needed something different and this turned out great. Will definitely make again. I didn't change anything. Followed exactly 💯"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "6252valmartin"
},
"reviewBody": "I would not call it million dollar spaghetti. Not a fan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "garney"
},
"reviewBody": "What a wonderful change of taste. I really like this and so did my husband. We are always trying new things. This was a great change. We were thinking about changing up to chicken and mushrooms. Thank you for the recipe. Will cook this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "It was delicious! Fast and easy for those less than perfect days! Also shame on those reviewers with their Italian grandmothers and homemade sauce. If you don’t want to make a recipe because you don’t think it’s up to your standards, then you should keep your mean, rude and petty reviews to yourself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Welty"
},
"reviewBody": "My Italian husband said it was some of the best (non homemade) pasta dishes he has eaten, he loved the creaminess of the cream cheese and cottage cheese mixture. He went back for seconds! I did brown my meat with onion and garlic and added some Italian seasoning to taste. I also added salt and pepper. Then followed the rest of the recipe using penne pasta I had on hand. I also topped with the cheddar cheese as directed… this was a quick and easy busy day dinner… thank you for sharing… and for the negative reviewers not all dishes have to be old school Italian and this dish had you made probably would have earned more than 1 star! I will keep this in my cook book for a great easy delicious busy night go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmorc"
},
"reviewBody": "The family LOVED this!!! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bernard mcintyre"
},
"reviewBody": "Do not cook the spaghetti first, do the sauce and meat then the cheese preparation. Cook spaghetti to ala dente. The dish as shown had water in the bottom of the dish, which is a no-no. To prevent this, and you do not know how to properly cook a sauce and reduce it properly. Dice a small eggplant into quarter-inch pieces and add to the cooking sauce, sans meat. (this takes care of your water problem) Add meat when eggplant is not apparent. Then layer as you wish but do not top with cheddar, that is a big no-no as well. Use gruyere, Parmesean Reggiano/Pecorino Romano, and bake until cheese is melted and brown. Ok, Ok, if you want to throw a little cheddar on top, do so, but very lightly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Russ"
},
"reviewBody": "cottage cheese? omg just NO! use ricotta or feta sheesh🙄 uses Italian cheeses also mozzarella asiago romano etc"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Stepleton-Hitt"
},
"reviewBody": "I will make my homemade sauce with Italian sausage. Instead of cottage cheese, I’ll use ricotta. Also, I will use grated Italian cheese like mozzarella, provolone, Parmesan. I’ve never cooked an Italian dish with cheddar cheese, and I’m Italian. As others have said, you need onions, garlic, and Italian herbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shea MacLaren"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Orth"
},
"reviewBody": "This is amazing! Tonight I made it with Italian sausage. I have made it three times. Great for leftovers too. Also a very simple dish to prepare. I even make it in the afternoon and just pop into the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bellerophon"
},
"reviewBody": "There's a lot of blandness baked into this recipe. Needs some aromatics... Onions, garlic. Some Italian herbs are absolutely essential! Ricotta is a big improvement over cottage cheese. Less butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Randy Jackson"
},
"reviewBody": "I think half of the cream cheese and 2 T. of butter for noodles is sufficient, because otherwise it will taste too heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe! However, like many users, I tweaked it a bit. I used 1.5 lb. of ground meat and added 1 medium onion, 1 tsp chopped garlic, and 1 tsp red pepper flakes while browning. I also layered the pasta, cheese-mixture, and meat sauce (like a lasagna). Finally, I topped it with mozzarella, provolone, and parmesan - my family loves cheese! Very good. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alice Kruse"
},
"reviewBody": "This was good, but maybe not \"a million bucks\" good. It definitely had lasagna vibes, but was much less attractive when served. Per suggestions, I used only about half the butter and baked it covered for the first 30 minutes. My family did not think it was dry, but you may want to serve extra sauce on the side. I might cut down the cream cheese, or leave it out next time, as it made the center extremely creamy. It was nice for a change, but I don't think my regular lasagna recipe is in any danger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was off the chain.. I did alter a couple ingredients , my package of ground beef was larger than a pound. I seasoned the ground beef to my liking while browning it. Added more season to the sauce after adding to the beef. The cottage cheese, sour cream, and cream cheese mixture added a great depth of flavor. I did increase all the portions a bit as my casserole was large. Definitely a do again. Don't count the calories on this one..Comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "geneackerman"
},
"reviewBody": "Very bland with the sour cream and cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassymama1973"
},
"reviewBody": "Very easy, very quick, very tasty! It's a hit with the family. I made a few changes for our preferences, like whole milk mozzarella instead of cheddar. I also seasoned the creamy layer with Italian seasonings, garlic and fresh Parmasan. I layered some provolone under the meat and sauce layer as well. I served it with garlic bread and a Wedge salad. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Thuno"
},
"reviewBody": "Made it as directed. It was very bland. to creamy and I wouldn't make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Day"
},
"reviewBody": "It was great the entire family (even the picky one) said this was a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "normakasinger1"
},
"reviewBody": "It was awesome! I didn’t have cottage cheese so used Ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coloradocarolinas"
},
"reviewBody": "I used shells because I had a surplus of medium shells. I read the reviews and many complained of not enough sauce and no flavor. So I browned my meat with onion, garlic and celery. I added a pound of sausage and another bottle of sauce. I mixed the butter with the scrapings of the sauce and I put that as my foundation. I made a ricotta mixture as for lasagna and I poured it over the noodles using a cake spatula to kind of spread it around and work it in I topped with sauce then put the other noodles on top dalloping with the remaining ricotta mixture. I tried to make holes for the sauce to penetrate through the noodles. I put foil on top and baked 40 minutes I added fresh mushrooms and olives and mozzarella at the end and baked uncovered for an additional 10 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Stephens Laker"
},
"reviewBody": "My first time trying this recipe, easy and simple to make. I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pyl1528"
},
"reviewBody": "Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "Tasted great! Lots of pasta and cheese but not enough shrimp. I would suggest adding at least a half pound more shrimp. I also added crushed red pepper flakes for some kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kat"
},
"reviewBody": "Good recipe but it was very rich. I did not use butter other than greasing the pan I didn’t think it was needed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nathann O'Connor"
},
"reviewBody": "This was delicious. It's great if you can read the recipe, make and try as directed, and review without your modifications. The internet really lets anyone comment on anything, regardless of their intelligence. It's depressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Havis"
},
"reviewBody": "This is delicious. As good if not better then lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I made it as per the recipe and was disappointed that it had so little flavor. Definitely needs some seasonings. Not an Italian dish. Very rich and creamy. Tastes like melted cream cheese. Husband didn't like it. Perhaps it will taste better warmed over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rene"
},
"reviewBody": "Very tasty but needed more tomatoes and more spices. Half the cream cheese would have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Chavez"
},
"reviewBody": "Baked Ziti is pretty much what we would call this.. I prefer using ricotta cheese over the cottage cheese… and add Parmesan and an egg to the cheese mixture also with mozzarella in it and backed on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "handymam"
},
"reviewBody": "I made it with ricotta and mozzarella. Never ever with cheddar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Duckworth"
},
"reviewBody": "I love this recipe! It's been around for many years so I prepare it probably 4 or 5 times a year. I love Italian food, but this dish is totally American and it's wonderful. I have noticed that so many people say that this is way too much butter, maybe it is if you a totally unrestrained eater and eat for 8! \nSince there is only two of us eating what I cook these days I do cut the recipe in half, but I have noticed that there is never quite enough for that second meal so my husband usually has it for lunch. Maybe I should start doubling up?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ahhhfreakout"
},
"reviewBody": "I followed the recipe as-is with no modifications or substitutions and was disappointed with the result as I wanted (and expected) to like this more. The dish ended up tasting like a spaghetti bolognaise with an insane amount of cheese in it that ultimately ended up diluting the flavour way too much. Perhaps with a lot less of the cream cheese/cottage cheese/sour cream layer and a reduction or omission of the butter, it would have more flavour. As it is though, plain old spaghetti sauce with mince has a lot more taste so I’ll not be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hofe"
},
"reviewBody": "Loved it! Used a whole pound of spaghetti and mozzarella on top! Only uses about 1 tablespoon of butter for pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Risueno"
},
"reviewBody": "Great Recipe…. It is also very customizable…. I found it to be a lot, since it’s just my wife and I. I found it freezes well. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aurelia Williams"
},
"reviewBody": "Family favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Roop"
},
"reviewBody": "This is a great recipe (with very minor changes)! I add Italian seasonings and garlic to the cheese mixture then I add the hot noodles to the cheese mixture to start the melting process. Then, I layer it up just like lasagna. I do cover the first 30-40 minutes of baking, otherwise it get crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Ryan"
},
"reviewBody": "It was sensational! I wouldn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natania Pechthalt"
},
"reviewBody": "This was delicious!!!! We even added some fine grated parmesan on top. Totally worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Bartel"
},
"reviewBody": "Very delicious. Only change I made was to use 1/2 lb Italian sausage and 1/2 lb of ground beef. I think the sausage added the seasoning it needed. It was creamy and tasty, perhaps could use a tad more pasta, but it was fine as is too. I will definitely be keeping this in my rotation. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "marilyn"
},
"reviewBody": "I made this tonight to exact direction for 4 servings. It was just awful. An almost sour, cheesy flavor. Could not taste the beef, sauce or pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmanuelle Hutchinson"
},
"reviewBody": "We all understand how this dish got its name!! Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karalee Ballard"
},
"reviewBody": "It was really good. Will probably use mozzarella or Mexican blend of cheese next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Mart"
},
"reviewBody": "Wonderful just as is, although I did think of sprinkling the top with crumbled bacon. Unique combination of cheeses for this dish. Makes a lot, so good for a large family, so so great for a single. I would rate it a 4"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Robinson"
},
"reviewBody": "Fantastic recipe just the way it is\n good for leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Forgot to put in my review I added onion ,green pepper , and garlic powder when I sautéed ground beef , but honey let me tell you I loved the butter and all the cream cheese, cottage cheese and sour cream. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaLa"
},
"reviewBody": "Very good recipe. I didn’t have cottage cheese so I added Mozzarella cheese and Parmesan cheese. I made my own spaghetti sauce and added a can of diced tomatoes, onions and garlic along with lots of different spices, red wine and seasoning. I melted butter in the bottom of the pan but I didn’t add more butter to the layers. I think it would have been dry without the diced tomatoes in my homemade spaghetti sauce. And I’m glad I didn’t add more butter because I don’t use pre-shredded packaged cheese. I buy blocks and shred or grate it myself. Shredded packaged cheese is lightly coated with flour to keep it from sticking together. Block cheese gets oily when it melts. Too much oil is not very appetizing to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "I made this two weeks ago following the recipe. It was delicious everyone is begging me to make it again tonight. This is the ultimate spaghetti, no more just meat, spaghetti sauce, and spaghetti in this house.\nMike"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tycook62"
},
"reviewBody": "I made it according to recipe. Word for word. No changes. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a great recipe! I loved the way it turned out! One of the things that I did different was adding more spaghetti sauce...I used 1 1/2 cup to stir into the spaghetti noodles instead of a half and I also used extra in the meat sauce and I am so glad I did because it turned out great!! Also I used Italian mix cheese. This recipe doesn’t need any changes but one thing that I would change would be adding a bit more hamburger..probably a half of a lb. This recipe is so good and my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taylor"
},
"reviewBody": "was great recipe but either need to increase pasta amount or cut the sauce and cheese\n\nI also used ricotta instead cottage cheese added parmesan and mozzarella cheese to mix"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "Yummy! with lots of cheese. Seasoned ground beef with salt, pepper &amp; hot pepper flakes. Added seasonings to cheese filling - garlic &amp; onion salt, oregano &amp; Italian blend. Skipped the butter, instead lined the bottom of dish with (plain) spaghetti sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hmiller721"
},
"reviewBody": "This is definitely a family fave! Such a good meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJB"
},
"reviewBody": "I followed the directions. I made no changes and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UtahSusie"
},
"reviewBody": "A fabulous, but extremely rich, dish. Easy to make, but lots of cleanup if you lay out the ingredients ahead of time. I changed only one thing: I used half ground beef and half mild Italian sausage for a richer flavor. But the all- ground beef version is great, too. It also freezes extremely well, and tastes freshly made when reheated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rhonda Sharee"
},
"reviewBody": "I didn't really care for it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAVENIA BROWN"
},
"reviewBody": "I seasoned the meat with a little bit of seasoned salt, added onion and green peppers. I used Prego Italian Garlic and Saugage sauce. Delicious. The family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I did not change the cream cheese mixture as that is what drew me to this recipe. I did add 1/2 pound spicy Italian sausage, one green onion, clove of garlic, can of mushrooms, Italian seasoning and garlic powder to hamburger mixture as it looked really boring as listed. Used Ragu spaghetti sauce. Topped with half white cheddar and half sharp cheddar cheese. Also halved the butter. This was a super rich, calorie packed, yummy casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Blake"
},
"reviewBody": "I followed the recipe exactly. It was ok but nothing special. It’s a bit more effort than the reward. Won’t make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Culinaromancer"
},
"reviewBody": "Delicious and simple! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Made it as the recipe was written. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AJW"
},
"reviewBody": "Heavy gut bomb. couldnt eat much of it it was too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenbosma"
},
"reviewBody": "I found this to be wonderful. I made a few changes. I used butter flavored Pam in replace of the butter. I also used Low Fat, Cottage Cheese, Sour Cream and Cream Cheese. I think this is one of those recipes you can make your own. Season the meat, add mushrooms if you like that kind of stuff. I am making again, actually making today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clift Alexander"
},
"reviewBody": "I will make this recipe again but I will add more of the meat sauce!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wandaful"
},
"reviewBody": "This is too good, too comforting and great for a crowd. Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenny215"
},
"reviewBody": "I made this exactly by the recipe and it was amazing! The picture I took was before the cheese topping but you can see the distinct layers. Very easy but would be impressive for a gathering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Messner Hilewsky"
},
"reviewBody": "I halved the recipe for the two of us. I think it needed more noodles and more marinara. the white center was too much. loved the flavor tho. will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelley Gerdes Keller"
},
"reviewBody": "This was AMAZING!!! I did however read other reviews and omitted the butter entirely except for greasing the pan. I also added 1 Tablespoon of Italian seasoning and 1 teaspoon of minced garlic to the cheese mixture as also suggested. I substituted ricotta cheese for cottage cheese only because thats what I had on hand. There were mixed reviews about cheddar or mozzarella on top so I did half on one and half on the other. Both were great but I probably preferred mozzarella just because it tasted more normal! I will definitely make this when friends come over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "traci"
},
"reviewBody": "This was loved by all for sure. I did leave out the whipping cream but didn't miss it. A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dalegodfrey"
},
"reviewBody": "very good I wanted to try it when done I did not take a picture just sliced out a piece onto a dish to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Michals Young"
},
"reviewBody": "This is an awesome recipe, but I followed another review about changes. Butter, cut in half, almost double the amount of sauce and repeated layers. High calorie spaghetti is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bohncollector"
},
"reviewBody": "One of the most tasty casseroles. There's only the 2 of us so I froze half. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andres Figueroa"
},
"reviewBody": "My family loved it! Next time ill try shredded chicken with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "I made for a company dinner. I used \"supergreen\" noodles which lessened the carbs. It was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Windemon"
},
"reviewBody": "I added mushrooms. I don’t want to get burnt out, so I’ll wait a while. But I will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Krissy V"
},
"reviewBody": "1/4 liked this dish. It was way too rich and the only thing I could really taste was cream cheese. Hopefully I can cut the leftovers with more spaghetti sauce and mix it all together to get my kids to eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boone K"
},
"reviewBody": "I have to laugh at the lady who swapped mozzarella for the sharp cheddar and completely omitted the butter, and then complains about it being dry and bland. Her critique should say “I changed your recipe and didn’t like what I created, I can’t comment on this recipe since I didn’t make it.”\nI actually did make the recipe as written and the entire family loves it. It is currently in full rotation of regular recipes we make. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica "
},
"reviewBody": "I love this BUT I made a lot of changes. I use spaghetti squash instead of noodles. I use about 1.5# of ground beef or a mixture of beef and sausage of o have it. I add onions and fresh garlic. I also toss my Spaghetti squash I'm the butter instead of putting pads of butter in it. I use 1 and a half jars of spaghetti sauce and top with Italian shredded cheese and sprinkle with Italian seasoning then bake. This is a favorite, but we had to make lots of substitutions to get it to our liking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill McDowell"
},
"reviewBody": "I made it with half italian sausage and beef. I also added fresh mushrooms to the top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Steve Mann"
},
"reviewBody": "I did not use the cottage cheese. That brought back bad memories of Jr. High school cafeteria lasagna. I spent a few extra coin and bought ricotta cheese. The spaghetti was a good idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adam Schriefer"
},
"reviewBody": "LOVE THIS SO MUCH! Super unhealthy, but Oh. So. Good! I use 16oz of shredded cheddar because there just isn't quiet enough cheese already in this recipe. I also use about a jar and a half of pasta sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen1960"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Atiat Lamptey"
},
"reviewBody": "I haven't made any changes as of yet, but I had some ideas...but this one my family LOVED!!! \nIt was very well received!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nessja"
},
"reviewBody": "So easy and so amazingly yummy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chantay Cuffee"
},
"reviewBody": "I've made this twice and its absolutely delicious. The 1st time I made it exactly as the recipe called and it was great as is. the second time I added ground Italian sausage and an Italian cheese blend. I layered it like lasagna and its equally as good as good. Its my favorite baked spaghetti dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jomama"
},
"reviewBody": "ABSOLUTELY THE BEST SPAGHETTI I HAVE HAD AND MADE.\nTHE CREAM CHEESE IS WHAT I FEEL MAKES IT EXCEPTIONAL.\nMILLION DOLLAR CAUGHT MY EYE AND I AGREE THAT IT IS JUST THAT. JOMAMA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sammy Mazz"
},
"reviewBody": "JJ Said WOW, this is the best spaghetti I've ever had in my life! I have to agree. I usually don't like Italian dishes, except for pizza every now and then ,but this recipe is fabulous. While I was putting it together ( made it exactly as written) I thought this is going to be pretty bland tasting, I used the cheapest store brand spag. sauce, with no added flavor., and store brand spag. noodles. This was very flavorful and I especially liked the textures. The only bad thing tonight is JJ and I didn't have anyone to share this with, but don't worry, I will be making this again soon. Jj won't let me forget this recipe! Thank you to Coqui30 For our fabulous meal, and thanks for sharing."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232227/million-dollar-spaghetti/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/505/main-dish/pasta/spaghetti/",
"name": "Spaghetti"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17815/main-dish/pasta/spaghetti/baked/",
"name": "Baked"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232227/million-dollar-spaghetti/",
"name": "Million-Dollar Spaghetti"
}
}
]
}
}
, "about": [
]
}
]