				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Minestrone Soup"
,"datePublished": "1999-10-15T18:50:50.000-04:00"
,"dateModified": "2023-02-21T06:35:36.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Maryanne"
,"url": "https://www.allrecipes.com/cook/24326489"
}
]
,"description": "This Minestrone soup recipe uses vegetable stock for the base and adds beans, orzo, corn, zucchini, cabbage, potatoes, and carrots for a hearty meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zBc8BzAoz2yyDTj5ChCVAa4-CG8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/449163-a876afc8448041bca9b91c1c61f34013.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Minestrone Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "113"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "399 kcal"
,"carbohydrateContent": "81 g"
,"fiberContent": "18 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "382 mg"
,"sugarContent": "13 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"4 cups vegetable stock",
"2 (14.5 ounce) cans stewed tomatoes",
"1 large potato, cubed",
"1 onion, chopped",
"2 stalks celery, chopped",
"2 carrots, chopped",
"1 large head cabbage, finely chopped",
"2 tablespoons Italian seasoning",
"1 (15 ounce) can kidney beans",
"3 cups fresh corn kernels",
"1 large zucchini, sliced",
"1 cup uncooked orzo pasta",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large soup pot, combine vegetable stock, undrained tomatoes, potato, onion, celery, carrot, cabbage, and Italian seasoning. Bring to a boil and reduce heat. Simmer for about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in beans, corn, zucchini, and pasta; simmer for 10 to 15 more minutes until the vegetables are tender. Season with salt and pepper."
} ]
,"recipeYield": ["9"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna "
},
"reviewBody": "I used this recipe as a base for my usual recipe. I thought it was excellent! I used diced tomatoes, fresh green beans, celery, white onion, carrots, kosher salt, pepper, Italian herbs, vegetable broth.\n(I did not use cabbage, or beans suggested. I think they may have absorbed the juices everyone is looking for.) Also any soup needs to cook longer then an hour to absorb flavor you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grace"
},
"reviewBody": "I am Italian and thought this recipe was excellent..Used orecchiette pasta as my grandmother used to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Waterknave"
},
"reviewBody": "turned out pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth McLaughlin"
},
"reviewBody": "Love this soup! But I made the following adjustments: double the broth and half the cabbage. I’ve made this several times. I’ve changed up the beans and pasta, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "I thought this was awful. Definitely not a minestrone soup more like vegetables in water! I agree with some other commenters that if you have to adjust a recipe drastically, why follow that recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "I’ve made this recipe many times. I think it calls for way too much cabbage. In fact I reduce the amount of most of the vegetables and the pasta and I might add one or two additional fresh vegetables, whatever I have on hand, such as green beans or mushrooms. The soup is very thick. Sometimes I have to add more liquid when I serve it as leftovers. I also cut the amount of Italian seasoning by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia Clagett"
},
"reviewBody": "Made I it in a slow cooker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weehopper"
},
"reviewBody": "Added macaroni shells. Probably should have used bow ties, as the shells tend to get mushy if the soup is left to sit for any length of time. Other than that, it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqueline Smith"
},
"reviewBody": "Very hearty soup! It’s a bit too spicy for me, as I used fire roasted canned tomatoes with green chili’s. Will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Cloutier"
},
"reviewBody": "I used half vegetable stock and half beef stock. Cut back on cabbage and added italian sausage and minced garlic. We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna Kay Michaels"
},
"reviewBody": "This was delicious! and of course I made changes!!! That's the beauty of minestrone soup! I used fresh tomatoes so needed a little more juice. I added 1, 14 oz can of red enchilada sauce. I think the Italian Seasoning can be scaled back a bit too. I also added garlic powder--who doesn't put garlic in everything!?!? LOL Also, recipe calls for orzo, but I don't think that is what is pictured. I used Casarecce noodles and they cooked just fine but got a little lost in the soup, next time I'll use a little firmer noodle. An easy soup to make entirely ORGANIC!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paola Santiago"
},
"reviewBody": "Wow ! this recipe was delicious! i made my own version using half chicken stock and the rest vegetable. i seasoned with garlic powder, salt and pepper. i added shredded chicken ans also added broccoli. Also i replaced the cabbage with bok choy. Instead of Orzo i replaced it with bowtie pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NANTAISC"
},
"reviewBody": "Great recipe! Would make adjustments to our tastes next time. It does make more like a stew than a soup. Definitely need more broth/ tomato to balance but overall great flavor! Very similar to what you would order at a restaurant. Liked the cannelloni beans over the kidney beans and we used bok choy instead of head cabbage. Would certainly reccomend and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missjules1168"
},
"reviewBody": "Very good recipe- everyone in my family loved it! I used this as a base recipe &amp; subbed what I had on hand: northern beans, italian diced tomatoes (2 cans), I sauteed 2 large crushed garlic cloves, carrots, celery &amp; onions. I added a bay leaf to broth (combined 2 cubes veggie bouillon &amp; 2 cubes beef bouillon + 4c. water) I added elbow noodles at the end, and I did not add corn or zucchini. Slow cooked all day...yummo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PittsburghersLuv2eat"
},
"reviewBody": "5 stars but I did make a few tweeks...used 8 cups chicken stock &amp; 3 cans Italian stewed tomatoes w/juice (wanted left overs). Used about 3 c shredded cabbage (will use 1 1/2 c next time). Also added 1 Tbs dried parsley &amp; 1/2 Tbsp garlic powder. Used cannelli beans in place of kidney. This turned out to be a great hearty soup. Will add fresh spinach next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Frederique"
},
"reviewBody": "The proportions are wrong... Too much veggies for the amount of broth... I omitted the pasta..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ymagine29"
},
"reviewBody": "I added sausage and hamburger meat to make it a little more hearty for my family. I seem to be surrounded by carnivores here at home. They loved it and I had no complaints. Adding to my list of favorite recipes. Quick and easy to follow. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bgowen"
},
"reviewBody": "The ingredient portions are all wrong. To much stuff. Would use elbow pasta and diced tomatoes next time. Will try another more classic recipe. The picture is not of the soup that you make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonzukit"
},
"reviewBody": "This is absolutely delicious! I used a cup of dried beans, boiled for 10 minutes, left for 2 hours then cooked as normal. I love the cabbage idea. Everyone was bickering over seconds! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GBloomfield"
},
"reviewBody": "Wish I would have read all the reviews instead of just looking at the stars. Pretty much anyone who had any success with this recipe did not follow the recipe. I did not find this to be like a traditional minestrone at all. I halved the cabbage and corn and still had to double the water to make it at all like a soup. The flavor was boring. There is no way I will ever make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "graphixcreator"
},
"reviewBody": "I will make it again! Very tasty, but i would use less cabbage maybe half of all the vegetables to make is soupy.\nThe seasoning was marvelous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy A"
},
"reviewBody": "I would definitely make it again. I used some cut up chicken and chicken boullion and a can of fire roasted diced tomatoes with garlic, oregano and basil. I did not add zucchini or potato because I had none on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Podell Chapin"
},
"reviewBody": "I made this soup and it was very good. I do agree with other about these changes; 1. only put 1/2 of the veggies; 2. add more vegetable stock than what the recipe calls for... about another 2 cups. Let the soup simmer for longer than 15 minutes and don't be shy about adding spices. Also, I added some tomato sauce to make the tomato flavor richer. i also used macaroni elbows instead of orzo. It was good and filling. I served mine in small sour dough bread bowls. I wish the soup itself had been heartier. Good for the first time. Will try other recipes to see if those are better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "moniquee"
},
"reviewBody": "It was ok but I probably won't be making this again. There was not enough liquid for all these veggies. The flavor seemed off- there was no garlic or fresh herbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AllStarSloth"
},
"reviewBody": "Followed the recipe, came out like more of a very wet salad then a soup. Needs less cabbage/more broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Fleming Sandy"
},
"reviewBody": "This soup turned out amazing! However, I would warn you to have a large pot. I ended up having to transfer the from one pot to another. I also made some spicy Italian sausage on the side and my husband sliced it and added to his bowl and said it was amazing. Served it when toast and enjoy the leftovers the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Robert"
},
"reviewBody": "it was really easy to make,I used garbanzo beans as well as the other beans. only used half the cabbage, but added a few more carrots in the place of. smelled good while it was cooking. at the end I used a few pre-made meatballs as the family has got to have their meat. everything basically was fresh.I will probably make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristineenderle"
},
"reviewBody": "Easy! Ready in a flash. I left out the corn (that seemed weird to include) and cabbage (also odd) and added more thyme, basil, marjoram. Otherwise followed the recipe. I'd make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kristina123"
},
"reviewBody": "You definitely need more vegetable stock!! People wouldn't even know it was a soup unless you told them. I added a ton of basil and garlic and it was still a little bland. I used kale instated of cabbage, and next time I would do with out the potatoes, I just didn't like it with the flavors with the rest"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chef PaPa"
},
"reviewBody": "I followed this recipe to the letter and it was a disaster. There was way too much cabbage! It sucked up all of the broth and I ended up having to scramble and add water and tomato sauce and spices etc to make more broth. It ended up edible but not great. Next time I'll add the cabbage last along with the pasta and use twice as much stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzi"
},
"reviewBody": "It does need more liquid but very extra good taste. I love to cook soup this is a winner just add liquid of your choice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy"
},
"reviewBody": "This is an awesome recipe. I did substitute\na few ingredients though, and added some extra items,\nalong with the other ingredients. Instead of the cabbage,\nI added a small turnip,a small rutabegga, portion of leek, \nparsley, and dill, two cups of water along with the vegtable\nbroth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Rose Stumphf"
},
"reviewBody": "Excellent even though I used macaroni instead of orzo and I forgot to pick up a zucchini. Also I used canned corn instead of fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KPlace"
},
"reviewBody": "Loved this! A rich &amp; hearty soup that, as did many others, we tailored to our individual tastes and in accordance with what we had on hand. Omitted corn &amp; cabbage; used a can black beans &amp; a can great northern beans (drained &amp; rinsed). Also, small shell pasta instead of the orzo. Also, a can of crushed tomatoes &amp; a can of stewed tomatoes. The recipe does need far more broth or liquid than called for &amp; it is more of a stew than a soup - which suited us just fine. We thought the seasoning of 2 T Italian Seasoning was perfect for our tastes. It does make a LOT ... and we are looking forward to the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hubster"
},
"reviewBody": "This is a tasty soup that is open to your creative side. Venture from the original with almost any kind of veggie drawer resident. I used elbow macaroni on my first round which really absorbed the liquid. Have fun with this, it will be delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Fenton"
},
"reviewBody": "The over all recipe was good but instead of 4 cups of vegetable broth I used 8. I didn't use cabbage as I'm not fond of that veggie I used spinach instead. I also cooked the soup quite a bit longer then the recipe states. \n\nI'm adding this and my substitutes to my regular recipes so we can have this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hmnevill"
},
"reviewBody": "Can't give it 5 stars because I used what I had on hand and didn't follow the recipe as written. But it's a solid recipe, and my variation was delicious. I didn't have zucchini, potatoes, or corn. I used napa cabbage and elbow macaroni. I used more stock than the recipe called for to make it more of a soup, and I added a little olive oil at the start to saute the garlic, onions, celery, and carrots (that would make it less healthy - the addition of oil). I added about 1/4 cup red wine to the stock to make it a little heartier. My son gave it thumbs up, ate 3 bowls, and didn't notice there was no meat (yay!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jlmsienes"
},
"reviewBody": "I made the mistake of not reading the reviews before cooking this. It was nothing like minestrone and if I have to make huge alterations in order for it to be ver good, as most reviews did, then what's the point of a recipe? My husband will eat almost anything and loves leftovers--he actually tossed this one out and felt bad that I spent so much time on it when it wasn't worth the bother. This is not minestrone soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Senite"
},
"reviewBody": "This was an OK meal for me. I would make it again and give it another chance but with some changes. Definitely more broth because like some other people have said it turns out to be more of a stew than soup. Kidney beans need to boil separately as they took forever to cook and ruined everything else like the pasta and potatoes as they overcooked. The pasta needs to be put in the very last 10 minutes of cooking because it became so mushy at the end. And I added garlic but I think the onion and garlic should be fried separately a little before putting in the stock and the rest of the vegetables. oh I also left out the cabbage and corn, it was too much for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gale Lederer Sayers"
},
"reviewBody": "Delicious &amp; loaded with veggies. I took the advise of some other reviews &amp; added an extra 15 oz can of stewed tomatoes &amp; vegetable stock. I omitted the corn &amp; only did 1/2 head of cabbage. This is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jguillory"
},
"reviewBody": "best sangia ever, better than any resteraunt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anne377"
},
"reviewBody": "Good soup. Need to cook the cabbage at least 20 minutes longer than recipe calls for. Skipped the orzo since we had beans, potatoes and some nice, crusty bread to soak up the sauce. Would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Munoz"
},
"reviewBody": "awesome!!! made this for myself after a getting over stomach virus... it was super easy, super yummy and hit the spot:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "souplover Sue"
},
"reviewBody": "Outstanding! This is a wonderful soup. No cabbage, celery, corn. I subed the stewed tomatos with a can of diced tomatos and added diced potato. Next time I will get all the ingrediants and make it, I'm sure it'll only be better! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Delicious....I doubled it for a crowd. To original recipe, add 6 cans of chicken broth to make it more like soup instead of stewlike. I browned 3 chopped garlic cloves and onion in 1 TB of olive oil and added. Did not double the cabbage. Added 3 TB. of Italian seasoning and 1 garbanzo beans and 1 kidney beans when doubling. Exchanged canned green beans instead of the corn. Used spiral wheel type pasta for fun instead of orzo. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gigirig"
},
"reviewBody": "This recipe is just ok. I made it for lunch for 40 women. First of all, it took way too long for the vegetables to cook in the liquid. I would recommend cooking them beforehand in a skillet then adding them later. I am not sure if it is the vegetable broth or not but the soup tastes a bit bland. I am not sure if switching to chicken broth would be better. I did add ground turkey to the soup to add a bit of flavor. That did help.. I'm not sure if I will make this again considering there are probably a ton of other minestrone recipes to try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joecheung"
},
"reviewBody": "taste awesome but need change I changed to 16 cups of chicken stock cut the cabbage in half boil lot of ox tail in a separate pot with lot of salt and ginger powder for 10 mins, than discard the liquid and move the tail to pot. simmer the soup for 1 hour long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenm"
},
"reviewBody": "Healthy, but too much cabbage. As someone else mentioned, I needed to add extra liquid to make it soupy enough. It was reasonably tasty, but I'm not likely to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amdftw"
},
"reviewBody": "It was very good, but next time I think I will let it simmer in a crockpot for the day to make the veggies softer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuziandBear"
},
"reviewBody": "This is one of the best things I have made on here. It is soooo easy, soooo nutritious and sooooo delicious. I loved the cabbage. My kids and husband devoured this. Here are the changes I made.... I used two cans of canned corn and didn't drain it because the other reviews said this isn't soupy enough. I also used Garbanzo beans because that is what I had and what I like best and didn't drain them. I used a very small cabbage as the reviewers said their was too much. I skipped the salt and topped with Parmesean cheese! YUM! Next time I will either skip the orzo as it provides empty calories or I will add barley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kwill"
},
"reviewBody": "I loved this soup...I cut up a package of honey garlic bratwursts and browned them first to add som meat to it, (husband and kids are big meat fans)and then added the rest of the ingredients. It was nice and thick. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "awilder"
},
"reviewBody": "I really enjoyed this soup! Like others, I found that it was more like a stew and I would add much more broth, less cabbage, a little chicken bullion(sp?) and more seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie G"
},
"reviewBody": "Great soup, not at all like my husband's experience with minestrone. We also add whatever leftover meat or spicy sausage we have on hand to the serving bowl. Makes enough for several meals for two. Tolerates substitutions well. I didn't have orzo, so I used Quinoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracee Workman"
},
"reviewBody": "Great place to start if you read the reviews! I also added extra beef broth, and cooked pasta seperate and added to each bowl instead of the pot. Worked really well. As with any soup,added my favorite veggies, left out ones I don't like. Turned out really well. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "becky troy"
},
"reviewBody": "I read the other reviews so was prepared for the lack of liquid, I used 2 extra cups of broth, and half the cabbage. I put in 3 garlic cloves for more flavor, and doubled the seasoning. It still was very dry and lacked flavor. Healthy though, but everyone just sort of picked at it and the huge pot of it just sat in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci-in-Cali"
},
"reviewBody": "I used Swansons reduced sodium chicken broth and added some hot Italian sausages to add more flavor and also to entice my hubby and boys to eat this... I cut back the cabbage to 1 cup but it was still pretty thick so I added about 4 more cups of broth. I left out the corn and added about 1 cup of kale I also used the small shell pasta instead of orzo. This was really good! *** (I tried to fine dice all my ingredients because I wanted this to look more like a soup than a stew, being careful not to overcook the veggies.)***"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy M."
},
"reviewBody": "Really great recipe for soup. I added a lot more liquid. I actually used 10 cups of water and added vegetable stock bullion cubes to it, about 6 or so. Omitted the cabbage, as I've never had it that way. I also used baby red potatoes, and instead of onions I used onion powder. I also added chick peas/garbanzo beans, and rotini pasta. Super! I had so much I took some to my neighbor and she said it was the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammie McConnell"
},
"reviewBody": "I loved this recipie! I followed the recipie loosley, varying the veggies a bit, but loved it. It is a thick soup and great with some fresh grated cheese on top. This is the first minestrone my husband will eat wothout complaining!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosie"
},
"reviewBody": "This was really easy to make and very flavorful. It was a hit at my italian themed dinner party!\n\nI made a few alterations:\n\nI used half a head of cabbage and I chopped it loosely instead of shredding it. I'm used to bigger pieces of cabbage in the minestrone. I used shells for the pasta and double the potatoes. I also omitted the onion &amp; corn.\n\nI added garlic to the recipe. My first step was putting a couple tablespoons of olive oil to the stew pot, then sauteeing a couple cloves of minced garlic with the italian seasonings for a minute or so. Then I carried on with the recipe as written.\n\nI'm going to be eating leftovers for days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sisterfunkhaus"
},
"reviewBody": "This is a wonderful VEGETARIAN recipe. It's great if you are a meat eater and want to add meat/meat broh, but it is nice to find a good recipe geared towards vegetarians.I don't really \"get\" why on every meatless recipe, people feel the need to suggest adding it. Vegetarians are allowed to have recipes too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANNE92C"
},
"reviewBody": "Very thick and a little too much seasonsing, but that is my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin"
},
"reviewBody": "This soup was great as-is. It was very full and hearty. My only suggestion would be to add some meat with a bit of flavor, like italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa mccarty"
},
"reviewBody": "Easy to make, and my whole family loves it! Makes great leftover lunch the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Very good - added some garlic, used white beans instead of kidney beans. Needed more broth than listed so just added as needed. Topped each serving with a sprinkle of freshly grated Romano cheese - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmah"
},
"reviewBody": "Excellent &amp; Easy!!!!! Definitely a \"repeater\"..........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRICKS2721"
},
"reviewBody": "I used 2 cups veggie broth and 2 cups of beef. Need more broth though. Used a pkg of frozen mixed veggies, turned out greta. Would get rid of potato. No cabbage cause my family doesn't like. My daughter said it was better the Campbell select! Will make again and again! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRICKS2721"
},
"reviewBody": "I used 2 cups veggie broth and 2 cups of beef. Need more broth though. Used a pkg of frozen mixed veggies, turned out greta. Would get rid of potato. No cabbage cause my family doesn't like. My daughter said it was better the Campbell select! Will make again and again! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghan Ely"
},
"reviewBody": "One of my favorites! Makes quite a bit so be ready to freeze your leftovers! Extremely hearty and tastes great! I used canned corn (draining it first!) and replaced the orzo with a cup and a half of whole wheat rottini. This recipe can be altered to your tastes very easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hardrockgirl"
},
"reviewBody": "Use half the cabbage, add 2-3 extra cups of broth, also about 1 tsp. garlic powder and you have one heck of a tasty soup! This makes a lot of soup, and is also tasty warmed up the nexy day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitch Sr"
},
"reviewBody": "THE SOUP WAS EXCELLANT - CAN'T WAIT TO HAVE IT AGAIN"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOMMYOFPEPPER"
},
"reviewBody": "great tastes but need adjustments on amounts of cabbage etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This soup cooks up quick and will feed a crowd. The fresh ingredients give this soup wonderful flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The soup was delicious but it was very thick, not a lot of broth. I had to add more stock. Next time I will use much less cabbage as I think it made the soup a too thick. Also it needed a couple different spices such as basil and garlic. But in the end it is a great fall soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LRIGREM"
},
"reviewBody": "I think this is a very good soup. I used shell pasta, and it needed to cook for longer to be done (20-30 minutes), &amp; I made a few subs (less carrots, 1/2 the zucchini &amp; a LOT less cabbage) &amp; found the subs worked perfect. NOTE: It was very thick even though I left out a lot of veggies, so unless you're planning for more of a stew, have extra broth on hand in case. Thanks for an easy recipe that was yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VeggieGirl"
},
"reviewBody": "very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made this soup and as we speak I am eating it. Best I have ever had, and my husband was veary happy as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JKBAUER"
},
"reviewBody": "yum! I left out the cabbage and it turned out really well. Needs a little bit of extra spices though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "classic minestrone, I changed the stewed tomatoes to whole cooked tomatoes amd hand crushed them. also used elbo maccaroni, and used garbonzo beans insted of kidney beans--next time I will presoak the beans, as they were a little chewy, and add the pasta last as it tends to dissintegrate after cooking long enough to make all the veggies as soft as I like( I also made about 34 quarts, so cooking time will be a little skewed) All in all everyone liked it , even my 16 year old who hates everything(including her parents)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious. However, I only added 1/2 the amount of cabbage since the soup was already so thick!! The amount of water that should be added was a bit unclear (canfuls). But a wonderful soup. I also used wholewheat pasta instead of white and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MLKUSHNER"
},
"reviewBody": "I thought the taste was okay, but there were too many vegetables in it. It sucked up all the juice and the soup was more of a mush. I am sure I will make it again, only leave out a lot of the cabbage and cut down on some of the amounts of vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I can't believe how easy it was to make yet really good and filling. I added extra tomato paste and sauce to make it thicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really enjoyed this healthy meal. It was more like a stew. I ended up using half of the veggies and an extra can of tomato's and half the orzo and it worked out really well. Very good meal for vegetarians or if your on a diet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Could the ingredient amounts be off? I needed to add a significant amount of additional liquid to make this the consistency of soup. In addition to the liquid that was called for, I added 2-8 oz. cans of tomato sauce and at least 4 cups of additional broth. I refigerated it overnight and by the next day the flavors had mingled nicely and the flavor was much better. I think I'll use less cabbage next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The flavor was quite good but I found that it was more like a stew then a soup. I would omit some of the cabbage and not so much corn the next time. My husband said it needed more of a meaty flavor, and he didn't like it at all."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14118/minestrone-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17038/soups-stews-and-chili/soup/vegetable-soup/minestrone/",
"name": "Minestrone"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14118/minestrone-soup/",
"name": "Minestrone Soup"
}
}
]
}
}
, "about": [
]
}
]