				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mini Sweet Potato Pies"
,"datePublished": "2020-06-18T23:11:23.000-04:00"
,"dateModified": "2020-06-18T23:11:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "NCANNIS"
,"url": "https://www.allrecipes.com/cook/1162218"
}
]
,"description": "Cute, bite-sized, mini sweet potato pies. Always a winner for the holidays and easy enough to make! Great for holiday dinner parties or sweet appetizers!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Yyr6URGvcIhzxoLGn2HjYt5ELgk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3077834-6ae13ce4feea43058c30a7b3da71ed2c.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mini Sweet Potato Pies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "62"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "69 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "58 mg"
,"sugarContent": "5 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.75 pound sweet potato, peeled and diced",
"1 (9 inch) refrigerated pie crust",
"0.75 cup evaporated skim milk",
"2 egg whites",
"0.25 cup white sugar",
"2 tablespoons brown sugar",
"0.75 teaspoon ground cinnamon",
"0.125 teaspoon ground nutmeg",
"0.125 teaspoon ground cloves",
"0.25 cup halved cranberries" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place sweet potato in a saucepan with just enough water to cover. Bring to a boil; cook until fork-tender, about 5 minutes. Drain and mash potatoes with a fork or potato masher."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Divide pie crust into 24 small balls. Press them into the cups of two 12-cup mini muffin pans to make tartlet shells. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Spoon sweet potato into a blender or food processor. Add evaporated milk, egg whites, white sugar, brown sugar, cinnamon, nutmeg, and cloves. Purée until smooth. Spoon about 1 tablespoon filling into each tart shell."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into a tart comes out clean, about 10 minutes. Cool in the pans over a wire rack. Garnish each tart with a cranberry half before serving."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "These are great! Someone else wrote about not balling up the pie crust and I agree. I wish I laid them out in little squares and just adjusted where needed. That would have saved a lot of time. I did add an extra 5 minutes to my cook time. Topped with cool whip and nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mmmcandice"
},
"reviewBody": "Only used 1 lbs can of yams and didnt add as much milk but everything else I kept the same. Took 2 pie crust instead of one. It's a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Crystal Hagie"
},
"reviewBody": "OK but not a huge fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mandy Campbell"
},
"reviewBody": "These turned out perfect! My son really enjoyed them. I did have to substitute ginger for one ingredient I didn't have. Everyone liked them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Great recipe! Doubled all ingredients except white sugar. Used 1/4 cup white sugar. We try to cut down sugar when possible. It was little hard to divide pie shell into enough pieces that were big enough to make nice cup in the muffin pan so I ended up using 3 shells for 48 mini pies. Had filling left over but no more shells so baked it like a custard. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fred smith"
},
"reviewBody": "No"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Cordova"
},
"reviewBody": "I loved making this with my daughter! It was a super easy recipe and the tarts were so light and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baking mom of 5"
},
"reviewBody": "They came out great! Didn't put marshmallows on top, though. Will make again, and will make with pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mon Amie"
},
"reviewBody": "I should have cooked the crust a little bit first. I am not a fan of cloves so I used a smidge of Allspice instead. Next time I will make them prettier. They are best served warm and even better on the second day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shree"
},
"reviewBody": "Baked these in JUMBO muffin tin. I sprayed some cooking spray into muffin tin. I cut my pie crusts into 4 quadrants and wasn't very careful about putting them in the muffin cups. Filled them about 3/4ths full of sweet potato mixture and baked about 30 minutes. Topped with marshmallows and put under broiler about 5 minutes. They were terrific!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YVega78"
},
"reviewBody": "Portion Control! Made these little pies for the first time this Thanksgiving and they were a hit! I did bake the potatoes instead of boiling, and used a round cookie cutter to make the shape for the muffin tins instead of rolling the pie crust dough into balls. Added a little flour, maple syrup, and vanilla to the mixture as well. Using 2 large sweet potatoes I had just enough for 18 regular sized muffin tins. These were awesome! And I can't wait to make other pie recipes in muffin tins! Just genius!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "newcook1"
},
"reviewBody": "Add more sweet potato\r\nCook pastry 5 min before filling, cook 10 min, broil to brown marshmallows. \r\n1 sheet pastry = 1mini muffin pan = 24pies\r\n4 adults 2 kids ate 16"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie Krueger"
},
"reviewBody": "Instead of placing a half of cranberry on each pie I put 1 tsp. of cranberry relish on each pie then I added the 4 mini marshmallow. I then put it back in the oven to brown the marshmallow. So good it was the hit of the party.\nCrazmom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MichiLovesToCook"
},
"reviewBody": "This is a perfect treat! We couldn't stop eating them! I made a few small changes: I had already baked sweet potatoes, so I used those. I also threw in half a ripe banana, used a whole jumbo egg, allspice instead of cloves, and didn't ball the dough as previously suggested. I did have to use 2 pie crusts. I used a full sized muffin tin and the batch made 12 perfect sized pies. I will definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "These were very good. I made them to include in holiday treats to giveaway. After my pie crust was used up though, there was enough filling left to make 3 servings of custard. I just put it in glass prep bowls and microwaved for 1 minute on high. Next time I will go into a second crust to make more mini pies. I put a sweetened dried cranberry atop each pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOLIANNE"
},
"reviewBody": "This is a great recipe. My 11 y/o daughter made these for Thanksgiving and they were a hit! We had to hide them so everyone would be able to have at least one. As other people mentioned we adjusted the spices to our liking, but no other changes. Thank you for sharing. This is definately a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashleynelson603"
},
"reviewBody": "I found this recipe last year, a few weeks before Thanksgiving, and i THANK GOD that i did!!!! My family wanted to go to Ft.Myers last year to visit an aunt.. so when i tried the recipe a few weeks before as a \"rough draft\" they were immediately a hit!!!! I have now been placed in charge of the desserts for many years to come.. i ended up having to bake just over 100 of these bad boys in order for them to survive the trip to Ft. Myers AND still have enough for the family up there.. when i was questioned this year about it.. all my family said was \"YOU BETTER MAKE THOSE MINI PIES, THEY'RE DELICIOUS\". Hands down the best recipe i have ever found.. made them for my work as well and i'm now getting special orders (i refuse to give this recipe out) it's my best kept secret!!! :) absolutely love the recipe, fast easy and delicious!!! If i could give it more stars i would!!!!\n\nUPDATE: 10/19/2014 Thanksgiving is right around the corner, i'm still in charge of desserts (which totally freaking rocks) still making these pies but now instead of making them \"mini\" i've been using the same recipe and just making it a whole pie :) still a huge hit with everyone, and a lot less work!!! :D absolutely love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Joy Moritz"
},
"reviewBody": "These were cute but bland in taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IcanDoThisTrish"
},
"reviewBody": "Love this recipe! I made regular muffin-sized tarts and easily made 24 of them. I also used the canned sweet potatoes (2), drained and pureed. We ate a dozen of them and the other dozen are for a potluck tomorrow. I topped them with a simple Marshmallow Buttercream--perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ollie Bergantim"
},
"reviewBody": "I thought these little tarts were OK but the measurements are WAY off!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jewlyrose"
},
"reviewBody": "These were a big hit at Thanksgiving. I used a little less sugar and a dash of flour (as suggested by another reviewer) because the sweet potatoes are very sweet on their own. I made a few with pecans, a few with marshmallows on top, and of course plain ones, and we couldn't decide which we liked best. They even re-heated nicely in the microwave (the few that were leftover). I made them in regular size muffin pans in foil cups (it took almost two pie crusts), 10 mins covered plus ten mins uncovered. Marvelous! These are a new regular at our Thanksgiving dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "masterofcooks"
},
"reviewBody": "i love potato pies!!! yum!!! &gt;3"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Mercedes"
},
"reviewBody": "Simple and Delish!!!!! Cute presentation too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEETA"
},
"reviewBody": "I made these for a potluck recently. I took another reviewer's advice and used a round cookie cutter to cut out the dough. It made it very easy. I also added a little flour, dash of vanilla and some maple syrup. Everyone loved them! there were gone in 10 minutes. I had enough filling to make 48 tartlets. I would but back on the cloves next time. A little strong for me but that is just my taste. I will make these every holiday season from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TTaylorTulsa"
},
"reviewBody": "These were delicious and so simple to make! Didn't change a single thing with the ingredients. Mine were in the oven a little longer than the recipe recommended and there was enough filling to make 48 minis. Piped whipped cream on top. Lovedlovedloved. Will definitely make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amom2go2004"
},
"reviewBody": "These were very tasty. I added a bit of maple syrup also to help bind and had alot of batter left over also. with this I grabbed reg sized cupake tins and made larger versions of the minitins. Yummy. Also found that I it was quick if I rolled the balls and flatten in hand first,then when placed in the ,minitins they were much easier to manuver"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kbvoyer"
},
"reviewBody": "These were really good but I had to cook them longer in order to cook the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHIP1UP"
},
"reviewBody": "These were great. The family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AfroShique"
},
"reviewBody": "The measurements were way off, I had so much left. I gave it a 3 star because of the measurements and even though I found them to be o.k, my husband didn't like them at all and he's the one I was mainly making them for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmckier"
},
"reviewBody": "Wonderful recipe. I made 120 for a large dinner at our school and they were a big hit. Tip - boil the potatoes whole with skins on unitl tender. When they are cool enoung to handle, the skins come off easily with a butter knife - much easier than peeling and dicing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "Great to bring to a party! Be sure to have the recipe handy - they will be asking for it! Very easy - my only problem was I wasn't sure on the quantity of potato - 2 cups? I used 1 1/2 medium sweet potatoes and it made a double batch. I also used soy milk instead of evaporated milk and it worked fine. LOVE the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary h."
},
"reviewBody": "Tasty little tarts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leigh"
},
"reviewBody": "YUMMY! These were a HUGE hit and I have made them 5 times now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nxt-iron-chef"
},
"reviewBody": "kool"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CO"
},
"reviewBody": "This recipe is really easy! I changed these a bit to make them appetizers instead of dessert. . . I didn't add the white sugar, nutmeg, or cloves. Instead I put cinnamon, cumin, salt, pepper, and sour cream. Everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emi"
},
"reviewBody": "WOOOOOW! these were so so so delish! sweet potato pie is my boyfriend's favorite, and this recipe blew him away- he couldn't believe i made it! ... a few changes i made:\n\ninstead of usind mini muffin tins, i used regular sized silicone muffin bake pans. make sure if you're using silicone, you put the pans on a baking sheet for more even cooking.the recipe yielded 12 pies this way, and there was about a cup of filling left over. \n\n \nInstead of puree-ing the sweet potato mixture in a blender, i hand whisked the ingredients together, and it came out great!\n\ni will definitely make this again for thanksgiving celebrations tomorrow and this weekend! \n\nTRY IT, YOU WONT BE SORRY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pati"
},
"reviewBody": "I normally don't like sweet potato pie but I thought they would be fun for the kids. I made a batch for Thanksgiving and figured they would be enough, boy was I wrong! They were so delicious I had to make three more batches since my family ate half of the first batch while they were cooling and they were so easy to make. We put some whipped cream on top when we served them and everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misschief"
},
"reviewBody": "Made these last night and turned out great. I used a basic pie crust recipe and regular size muffin pans and had about 18 mini pies, which could have easily been 24 if i had any dough left. The kids, 5, 7 and 9, loved them and so did I. Very easy and delicious, especially with a little whipped cream on top. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jarod"
},
"reviewBody": "One word to sum this up: Simple. My son loves these and you should have seen his face when I told him what he was eating wasn't Pumkin pie! It was, as they say, \"priceless\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KatieTries2Cook"
},
"reviewBody": "these were very good. I could eat like 50 of them by my self! One thing I will do differently next time - since i'm using premade, already flat rolled out dough - is to just tear off pieces of pie crust and loosly drop them into the cups, rather than roll it into a ball, then try and smooch and fit the ball into the cup. It over works the dough to ball it up first and then reform it to the cups, not to mention time consuming and frustrating. So just tear off a piece that looks about right and fit it in, and then touch up around the edges with extra dough if you need to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LEUCANTHEMUM17"
},
"reviewBody": "I love this recipe. I've made it a few times now, and every time it's been amazing. I don't have any way to measure the amount of pounds of sweet potatoes I'm using, so I always eyeball it based on texture. I also add some black pepper to even out the sweetness, and a splash of vanilla. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina"
},
"reviewBody": "Absolutely delicious! My kids loved them. Even my son, who normally will not touch sweet potatoes, gobbled these up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Butternut squash"
},
"reviewBody": "If you're looking for an easy, tasty and festive appetizer for the holidays, look no further. For the pie crust, I used pre-made pie shells. I used a circle cookie cutter to cut out the mini pie shells and just formed them into the mini muffin tin. F.Y.I. plenty of batter left to make extra apps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Surbeck Carossino"
},
"reviewBody": "Exellent and fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PD"
},
"reviewBody": "I made these for Thanksgiving and they are tasty little pies. I do think the measurements are way off though! I had enough batter to make 60 pies! I used the mini-muffin pan and used four frozen pie crusts to line the pans. You could easily half this recipe and have more than enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "OMG the kids loved it! They loved the idea of cute mini pies just for them. They rushed around me to help make them. And they couldn't wait for them to be ready. One trick I used was putting the mini cupcake wrappers in the tray first (I was afraid they'd get stuck to the trays). These were gone so fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RCORBIN"
},
"reviewBody": "I tried this recipe for the first time on 11/23/04. I wanted to try it before Thanksgiving and if it turned out right, I would have this instead of sweet potatoe pie. I really like it! It's great for portion control. The only thing I did was add a little flour and maple syrup to the mix in the blended. It seemed to hold together better. You should try this recipe, it's great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good recipe, quick to make. Had extra filling left over though."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76821/mini-sweet-potato-pies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/822/desserts/pies/sweet-potato-pie/",
"name": "Sweet Potato Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76821/mini-sweet-potato-pies/",
"name": "Mini Sweet Potato Pies"
}
}
]
}
}
, "about": [
]
}
]