				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mini Sweet Potato Samosas"
,"datePublished": "2020-06-18T23:27:37.000-04:00"
,"dateModified": "2022-01-04T08:12:29.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "These attractive little samosas of curried sweet potatoes make a nice appetizer or cocktail party hors d&#39;oeuvre!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dpdCjxUpZ-gbEYNrMPHhWWiEP94=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/33360-37780837084b4a4c8ebad341c1bf65b0.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mini Sweet Potato Samosas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "27"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "169 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "7 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "332 mg"
,"sugarContent": "2 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 sweet potato, peeled and diced",
"1 teaspoon butter",
"1 tablespoon milk",
"1 tablespoon dry onion soup mix",
"curry powder to taste",
"20 wonton wrappers",
"sesame oil for brushing" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Simmer sweet potatoes with a little water until very soft. Drain, and mash with butter, milk, onion soup mix, and curry powder."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place about 1 teaspoon of the sweet potato mixture into the center of each wonton wrapper. Brush two adjacent edges of wrapper with water, fold into a triangle, and press the edges together to seal. Brush both sides with sesame oil. Place the samosas on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 10 minutes, then turn over, and bake for 5 minutes more."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aleias"
},
"reviewBody": "I made these for New Years Eve, and they were a big hit! I changed a couple of things... I omitted the onion soup packet and instead used extra curry, a dash of cinnamon, and a dash of onion powder. I served it with apple jelly that I heated on the stove and added some curry powder to it. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ranisp"
},
"reviewBody": "So good, so easy. This is a great appetizer. I actually am making them as an appetizer for Thanksgiving to add a little spice to the menu. I may try adding peas into the next batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ltokarchuk"
},
"reviewBody": "Easy and quite good. I used hot chili curry paste approximately 3 table spoons and served with mango chutney and it added a kick of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bakerchic"
},
"reviewBody": "Really quite good! I used a regular potato as I don't like sweet potato. Added salt, pepper, curry to taste. Also fried up onions and garlic in oil and then added it as one reviewer suggested. They crisped up quite nicely and my husband ate almost the whole plate! This one's a keeper, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally"
},
"reviewBody": "Great with mango chutney!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ann horton"
},
"reviewBody": "I used baked sweet potato, sauteed onion and garlic, crumbled bacon, Parmesan cheese, a little cumin and a little curry for the filling which was great. I didn' t how the won-ton shells cooked up - the taste was great but they were a bit mushy even though I cooked them extra time trying to get them to crisp up a bit. Maybe using olive oil instead of sesame oil made the difference. I sprinkled the top with freshly grated Parmesan cheese. The two dipping sauces I used were soy sauce and the mustard/wine mix. They went over well at the party, though. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "pattyward555"
},
"reviewBody": "Not good:("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Miller-Clark"
},
"reviewBody": "I added chives, apples and garlic. I also served with a spicy peach chutney........simply amazing. It is a great base recipe that you could do lots of variations with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucyford"
},
"reviewBody": "These were amazing! I followed the recipe exactly with the exception of adding a handful of pressed garlic into the water when the sweet potatoes were simmering, which were later mashed in. I was surprised at the beautiful color they got in the oven...I thought I would end up pan frying them, but they were perfect. Can't wait to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LilMama84"
},
"reviewBody": "These disappeared quickly! I made extra filling (I knew I'd be tasting it the whole time!) and added some cumin and ginger, and mixed in some defrosted frozen peas. I also used olive oil instead of sesame oil since that's what I had. I'll definitely be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sobi"
},
"reviewBody": "These were great! I used the filling as directed (I had no problem using the onion soup mix...it was a quick and flavorful addition!) but I did use my own home-made samosa dough and deep fried them at 350 degrees. Really great dipped in a yogurt sauce and chutney."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hethlie"
},
"reviewBody": "As we are not huge sweet potato fans, I also added 1 medium potato (cooked in the same fashion as the sweet potato). Adding in a little sauted onion, and the whole filling tasted similar to onion bhajis. Served with a quick homemade apple cranberry chutney and it was a big hit! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shang"
},
"reviewBody": "Loved it! I took amazonkris' advice and sauteed the onions and garlic- it was fantastic. I also used a ginger soy dip which my guests thought was the perfect compliment to the samosas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amazonkris"
},
"reviewBody": "This is really a 5-star potential recipe, I just didn't like the use of the onion mix. I took that out and instead I sauteed onions with garlic, and put the cumin &amp; curry powder in with that along with some turmeric, then added that into mash with the sweet potatoes. I used 3 dipping sauces as everyone likes a something different: mango chutney, soy sauce, and a healthy Dijon yogourt-based dressing made by Bolthouse farms (I think someone has suggested cutting dijon mustard with white wine and that sounds lovely as well)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDAANA"
},
"reviewBody": "YUM! What a great idea. I had 1/2 a packet of wonton wrappers left and found this recipe...we had it for dinner! SO YUMMY. I added Garam masala spice as well as a little onion powder to the sweet potato puree. It was REALLY easy to put together and we dipped in plum sauce and hosin sauce. Will definiately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smeyr"
},
"reviewBody": "A great recipe for left-over mashed sweet potatoes. I added 1 tsp of Garam Marsala (Indian Spice blend) in place of the curry. And added a dash of cayenne pepper and cumin. The sweetness and spice was a wonderful combination. Next time I will brush the outside of each with a little oil so they will crisp a little better. And I did put them under the broiler to get them a little more brown. I served them with Plum sauce for dipping. A really great recipe, thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bcakes"
},
"reviewBody": "My friend and I made these as part of our Indian Feast night. We couldn't find wonton wrappers at my local grocery store (they ran out), so we bought spring roll/ egg roll wrappers, which are thicker and bigger. We doubled the filling recipe and used water to seal instead. Everything else we followed. Baking egg roll wrappers were just not possible...the powder stayed on the samosas. The wrapper was chewy for the most part, the corners were crispy. We finally had to fry them to get that crispy outside. Very good when crispy. Not too happy about the oil though. The filling is a winner though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Billie"
},
"reviewBody": "I love samosas and being Indian I can make samosas. When I saw this recipe, I thought this was be great. It wasn't. I don't think sweet potatoes mesh well with the curry. I did save some of the sweet potato and mixed it with brown sugar and cinnamon and made mini samosas with it. That came out really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "These were the star of my 7 course meal! I left out the onion soup mix, added more Indian spices (turmeric, garam masala) and a little more butter, and the filling was amazing. \n\nI brushed the outside with sesame oil as well so they'd get really crispy.\n\nCan't thank you enough for this recipe! It was just so good. I served it with homemade plum sauce (recipe on here) and it was a serious crowd-pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "k861084"
},
"reviewBody": "I added sauted onion and garlic and I left out the onion packet mix (too easy and not creative enough). I added in a just a little tumeric and curry powder and baked them a bit longer than called for, for extra crunchiness. Lastly, I served them with three little bowls of sauces... dijon thinned with white wine, spicy BBQ sauce, and soy sauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annie2102"
},
"reviewBody": "This recipe was so easy to make and so tasty - great for people who like a tasty curry rather than a really hot spicy one! I made up the sweet potato mixture the night before to save time, then just did the samosas and baked in the oven on the night. Baking was healthier, but probably didn't crisp them up quite as much as frying would have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xezandria"
},
"reviewBody": "These little guys were awesome! I ended up putting a few tablespoons of brown sugar into the mix, then brushing butter on the outside and sprinkling sugar on them before they cooked. I served these for dessert and they were a total hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Very good and easy. I sauted diced onion, garlic, olive oil, cumin, and curry poweder and mixed that into the mashed sweet potatoes. Samosas were better with a tablespoon of filling.\nAdded chutney and a ginger mango sauce for dipping options."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/135900/mini-sweet-potato-samosas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17807/appetizers-and-snacks/tapas/",
"name": "Tapas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/135900/mini-sweet-potato-samosas/",
"name": "Mini Sweet Potato Samosas"
}
}
]
}
}
, "about": [
]
}
]