				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mint Jelly"
,"datePublished": "2020-06-18T23:08:31.000-04:00"
,"dateModified": "2022-10-12T16:23:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "HYACINTH"
,"url": "https://www.allrecipes.com/cook/495736"
}
]
,"description": "This mint jelly for lamb is simple to make on the stovetop with fresh mint, sugar, and pectin for a bright, flavorful condiment served with lamb."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/H-4EujqvsktYARRQhnJ-NWxQO0s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/37100-d3694c3a62504b9982809d327d20288f.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mint Jelly"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "53"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "86 kcal"
,"carbohydrateContent": "22 g"
,"fiberContent": "0 g"
,"sodiumContent": "1 mg"
,"sugarContent": "22 g"
,"servingSize": "4 1/2-pint jars"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1.5 cups packed fresh mint leaves and stems",
"2.25 cups boiling water",
"2 tablespoons lemon juice",
"1 drop green food color",
"3.5 cups white sugar",
"3 fluid ounces liquid pectin" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Rinse off mint leaves and stems; place them into a medium saucepan. Crush with a potato masher or the bottom of a jar or glass. Add boiling water; cover and let stand for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Strain mint mixture; measure out 1 2/3 cups mint and return to the saucepan. Stir in lemon juice and food coloring. Mix in sugar and place the pan over high heat. Bring to a boil, stirring constantly. Stir in pectin; boil mixture for 1 minute, stirring constantly. Remove from heat and skim foam off the top using a large metal spoon. Transfer mixture to hot, sterile jars and seal."
} ,{
"@type": "HowToStep"
,"text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring water to a full boil, cover the pot, and process for 10 minutes."
} ]
,"recipeYield": ["32"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Lussier Harrington"
},
"reviewBody": "Great recipe and it Taste so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yira Mystic"
},
"reviewBody": "The only thing i had to change was i didn't have food coloring so i used cake frosting coloring..... I assume not much difference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laura Sanchez"
},
"reviewBody": "Pectin measurement should have stated 3 oz vs 1/2 (6 ounces). This was first attempt at jelly. It didn’t set up thanks to the wording of instructions. Lesson learned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Merry Buckhout"
},
"reviewBody": "I read this recipe probably 20 times, ended up trying to boil sugar as it basically tells you to drain all the boiling liquid. Worst written recipe ever. Do you want stems in your jelly? Please follow someone else’s recipe and save yourself a lot of grief"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Piper2012"
},
"reviewBody": "This is the Certo recipe - except not well written. Should say to pour 1 2/3 cup of the mint INFUSION (the water that you have strained the mint out of). Not 1 2/3 cups of mint. Also, uses 1 pouch of certo (so, 3oz total). Good recipe, as it is EXACTLY the same as the one included in the Certo pack. But poorly written in this case."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jude Figueroa"
},
"reviewBody": "Definitely a good recipe, way to much sugar for my taste so 2 cups instead of the 3 1/2. Also did 2 tsps instead of 2 tbsps Of lemon juice. Super easy recipe and definitely will be making more. I also used fresh chocolate mint for this recipe. My family and I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina Buckley"
},
"reviewBody": "I will make this again. It set well with 2 cups of “mint sauce”. Hate to waste a 1/3 of a cup of anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Taylor"
},
"reviewBody": "It is delicious and yes I'll make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Zoe Emiko"
},
"reviewBody": "I've made mint jelly for years but always trying new recipes to see if I can find an improvement. This was not it. This came out with such a weak overly sweet flavor. Normally I use 3.5 cups mint ( chopped &amp; crushed) to 2.5 cups water, 2 cups sugar, 2 drops green food coloring and the 3 oz liquid pectin. It comes out really minty without being overpowering &amp; not that blast of overpowering sweetness. I want to taste the mint more than the sugar. The process I use for making it is the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "The instructions were not clear!\n1/2 (6oz)... I used 3oz on my first batch. I should have used 6oz.. \n Pour the liquid mint not the mint (I figured that one out). \n\nThe final product was tasty but I do have one batch of mint syrup because of the unclear instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catherinanna"
},
"reviewBody": "I really liked this recipe! It was not as minty as I had expected and is quite sweet but it is delicious! Can go with things other than lamb as a result - we used it with crackers and cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Turned out really well! Added a couple extra drops of food coloring, and the jars came out beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Holbrook"
},
"reviewBody": "I’m glad I read the reviews, I would not have noticed the weird phrasing. I’m pretty sure I did correctly and now I’m just waiting for it to set up.\nI did add a little more food coloring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Great recipe. I strained a couple of times to try to make it clear. It worked well and the jelly looks great. It will be a wonderful addition to Christmas gift baskets. Next time I'll try the pineapple option!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boone"
},
"reviewBody": "This is a great recipe, but I, too, had trouble with the jelly not setting up - probably my fault since I tried combining 2 recipes. BUT, after the jelly was refrigerated for 2 days and still looked like a thin sauce, I put it back in the pot and brought it back to a boil, testing periodically in a bowl (placed in ice) to see if it was setting up. After the jelly boiled for about 10 minutes, it was ready to remove and put back in the jars, perfectly set up. BTW, I separated into 2 batches and added a chopped (with seeds) Serrano pepper to one batch, cooking the jelly with the Serrano - did not remove pulp or seeds. It turned out really well, not very spicy but with a slight kick. My husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryM"
},
"reviewBody": "I used apple mint for this recipe. We ate it on biscuits this morning and it is delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker Nana"
},
"reviewBody": "I made a half recipe , used 1tablespoon of lemon juice, and only 1 cup of sugar. I mixed my pectin powder in with the sugar,brought the mint water to boiling , stirred the sugar into the boiling liquid .When it returned to a rolling boil ,I timed it for one minute. Took it off the burner added 1/2 teaspoon of calcium water. Stirred it up and it jelled perfectly. It is just the right amount of sweetness. My husband really likes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Rogers"
},
"reviewBody": "My mint water was more of a yellow brown. When I put green food coloring in it turned army green. So the next time I put blue food coloring in and it came out a beautiful green."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harv & Carolyn van Tol"
},
"reviewBody": "Deeeelish! Very fresh tasting and yummy... I skipped the fake green - and it may not be as bright, but it's still pretty in the jar - and incredibly tasty. Makes quite a lot - so I put the extra into 125ml jars and canned it for later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jo"
},
"reviewBody": "Tried this recipe twice. Increased the pectin 2nd time and it still failed. This must be a master chef recipe :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ernursjen"
},
"reviewBody": "I'm a little upset that the 3 oz liquid pectin didn't set the jelly very well. It was a little too soft. So next time, I will either cook it down longer or use the 6oz of liquid pectin. Other than that, flavor is good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mountain grandma"
},
"reviewBody": "Be sure to use liquid pectin. I've used this recipe several times and it has always turned out great, except for the time I used Ball Classic pectin instead of the Certo liquid I usually use. The batch with the Ball not only didn't gel properly (more like a thick syrup than jelly), it had a nasty looking brown residue in the bottom. I contacted Ball about this and they're not surprised, even though there is nothing on the jar to indicate not to use it in mint jelly. Just thought I'd put a warning so others don't make the same mistake. Happy canning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carnivalcookie"
},
"reviewBody": "I decided that since I had an abundance of mint in my garden it might be a good chance to see if I could make this. Recipe was very simple, not hard to follow, and turned out great. Only thing I did a little different was to add more green food coloring . The first batch was kind of pale, but did not affect the flavor. Very happy and will be making more this year since half of my stash was used for Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I decided that since I had an abundance of mint in my garden it might be a good chance to see if I could make this. Recipe was very simple, not hard to follow, and turned out great. Only thing I did a little different was to add more green food coloring . The first batch was kind of pale, but did not affect the flavor. Very happy and will be making more this year since half of my stash was used for Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Skylar's Mom"
},
"reviewBody": "I started making this recipe but I felt that steeping the mint for only 10 minutes did not yield a minty enough base to my taste buds. I ended up steeping for about an hour. I also omitted the food coloring, why add artificial dyes to a dish that is beautiful just the way it is? My main complaint is that the author forgot to include how much head-space to leave when filling the jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toocold00"
},
"reviewBody": "My first attempt at jelly making, and it turned out excellent! I doubled the recipe as I had an abundance of mint on hand, and it doubled well. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mariehass"
},
"reviewBody": "Easy recipe and tastes lovely. I omitted the green food coloring in case any of my potential guests have allergies to the dye."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHORTCUTCOOK"
},
"reviewBody": "Ok although I have no idea what to do with them except give them away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kataloha"
},
"reviewBody": "The first time I tried this recipe, I reduced the sugar because of some of the comments I read, the jelly was too sweet. However, the jelly never set right. The second time I tried it, I followed the recipe it to a T. At the end, my jelly was still really runny. Disappointed, I talked to a friend of mine who's mother makes jelly all the time. She told me to wait a few days before I throw it out because sometimes it takes that to congeal. I am glad I waited. I had four beautiful bottles of jelly. And, I made one more batch! BTW, I kept my runny jelly and use it as syrup for tea or on pancakes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Harasin"
},
"reviewBody": "This is a great recipe. I don't strain the mint. I finely chop the mint and just leave it in. I love it that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VeraB"
},
"reviewBody": "This recipe worked as written, no problems. The instructions were clear. For me, in Canada, I needed 85 ml of pectin (the metric conversion gives 85 g which is how some suppliers label theirs). This will yield 11-12 125 ml jars. I use 3 drops of colouring just to get a little more punch to the green. The flavour is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judi Sarcinello Williams"
},
"reviewBody": "easy to make-I didn't use the food coloring, it just looks too fake, the natural color was a pale yellowish. What a great way to use up all of the spearmint in my herb garden. Making a second batch tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Kehm Lockey"
},
"reviewBody": "Excellent taste. I've gotten considerable compliments on this jelly. I add about 3 drops of food coloring to make it a bit darker green but otherwise, no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frenchie"
},
"reviewBody": "Yummy! This is just about the same recipe as they have at the National Center for Home Food Preservation. I cut the sugar down a little so it wasn't too sweet. Yes, do make sure you have ALL your \"ducks in a row\" before you start heating anything - plan ahead. BONUS: Since 2 Tbsp. of lemon juice was just about one lemon, there was a little leftover. There was leftover mint juice, too - so I added the mint juice and lemon juice to a pot of iced green tea I had made. Delish! Mint-mania at our house. Between the jelly &amp; the tea, I knew something good would come out of our surprise mint patch (our mower broke and the lawn was HIDEOUSLY overgrown!) When life breaks your mower, make mint jelly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Khandra Sears"
},
"reviewBody": "This was my first time making a jelly and this recipe was really simple. I did use brown instead of white sugar though and I only used 2 cups but it was still too sweet for me. I do like the flavor though and will definitely try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sniper242"
},
"reviewBody": "Good recipe. However I used ruby red grapefruit instead of the oranges because I like the tart taste of kumquats and the grapefruit added to the wonderful taste. Not too sweet or too tart. Set up pretty well but I will probably use pectin next time due to the slight runny consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcleto"
},
"reviewBody": "Very easy to make. Set real nice. Loved it in filling for cookies. Made another batch with pineapple mint and used pinapple juice instead of water that was a delite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "memdun"
},
"reviewBody": "Recipie was easy to make and understand. I used chocolate mint leaves instead of regular mint leaves. The flavor was different than any other jellies I've had. I'd recommend not using exotic mint plants if you make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian E Nahodil"
},
"reviewBody": "This is my developed and published recipe. Though this person is publishing it as her own it is not. I am flattered however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PeacockPanda"
},
"reviewBody": "I haven't had too many mint jellies but I could hardly taste the mint. Tastes great in general, but a little more mint flavor would be better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "First kick at the \"Jelly\" can and it turned out great. I got a little experimental on the second batch and used pineapple juice instead of water. It is a nice compliment to the mint (especially since I used pineapple mint) and works great if using the jelly as either a condiment on pork/chicken/lamb or as a spread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pdlrofdrms"
},
"reviewBody": "Well I am a novice at mint jelly. Never even had it before. Therefore this recipe gets 5 stars from me! Super easy. Set up nice. Had a great minty sweetness to it. I actually started on the mint jelly mission before I found this recipe. So when I read only a cup and a half of mint I got worried. Because I just put a bunch of mint in a pot boiled it and then strained out three times the recipe amount and tripled the recipe. Made 12 pints. Good luck! I am not an experienced canner so I think if I can do it you can do it. : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mgtenney"
},
"reviewBody": "Jelly set up, and turned out good. It adds a hint of mint. Warning almost too sweet and minty if you glob it on, so use sparingly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chamomille"
},
"reviewBody": "I love mint Jelly, but it turned out pale yellow-green and far too sweet. Flavour was all wrong too. (Maybe because we only had spearmint.) It set up nicely, but all in all, won't make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Napalmnatty"
},
"reviewBody": "Turned out runny and way too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mommacat"
},
"reviewBody": "I tried this recipe yesterday.I grow my own mint, went out and cut it, washed it and folowed the drections tothe letter. It did not set up as it should have. It i a bit on the runny side. I dumped it. I have no idea what happened. Mommacat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Krebs-Clark"
},
"reviewBody": "This recipe was so easy and came out perfect! I followed the recipe just as it says and had great results. Looks beautiful in the jars. Will make wonderful additions to my Christmas gift baskets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "As this was my first attempt of \"jelly making\" I found the recipe easy to follow, but the end product to be on the sweet side. Maybe 2 cups of sugar should be used or 3 1/2 tablespoon of lemon juice. The choice is yours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As a first time maker of mint jelly, I was very pleased to find that this recipe was quick, simple, and made delicious jelly. I used 3oz of pectin and had no problems with it setting. My only suggestion is that if you use Scotch Mint you may want to use a few more drops of dye--I found that 3 were just enough to turn it from brownish-yellow to a nice shade of pale green.\n\nThanks for the recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/43399/mint-jelly/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
"name": "Jams and Jellies Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/43399/mint-jelly/",
"name": "Mint Jelly"
}
}
]
}
}
, "about": [
]
}
]