				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mississippi Mud Pie II"
,"datePublished": "1998-11-24T12:14:32.000-05:00"
,"dateModified": "2022-07-14T18:09:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tracy"
,"url": "https://www.allrecipes.com/cook/24329028"
}
]
,"description": "This creamy, chocolaty pie has a walnut crust."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/qjtF1U6gUjrk5AEAZFjPK4tYdGM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4622399-608c0481e83f48e597962f4be3c3de54.jpg",
"height": 2000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mississippi Mud Pie II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "49"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "378 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "58 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "391 mg"
,"sugarContent": "24 g"
,"fatContent": "25 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup chopped walnuts",
"0.5 cup all-purpose flour",
"0.5 cup butter, softened",
"2 (3.9 ounce) packages instant chocolate pudding mix",
"2 cups cold milk",
"1 (8 ounce) package cream cheese, softened",
"1 cup confectioners' sugar",
"0.5 cup heavy whipping cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, combine walnuts and flour. Mix well, then stir in softened butter or margarine. Stir until ingredients are combined and mixture forms a ball. Press into bottom of a 9x13 inch pan. Bake in preheated oven for 20 minutes, until golden brown. Remove and cool."
} ,{
"@type": "HowToStep"
,"text": "Place pudding mix in a medium bowl and whisk in milk. Mix until smooth. Allow to set up for 5 minutes then spread on top of cooled crust."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl whip cream cheese until fluffy. Beat in confectioner&#39;s sugar until mixture is smooth. In a separate bowl, whip cream until soft peaks form, then fold into cream cheese mixture. Spread over pudding layer. Chill before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggianne "
},
"reviewBody": "This is also known as Chocolate Lust and have been around for years. I tried this recipe as stated but found that the crust amount would only cover about 2/3 of my pan 9 x 13 so I made half a batch more of Christ. Most other recipes of this are as follows: 1 1/2 c. flour\n2 sticks butter (room temperature)\n3/4 c. pecans, chopped or walnuts\nAlso on the chocolate pudding, it was way too thick more like a paste when I did it as his recipe calls for sour before I put it on the crust I add about another half cup of milk to it and whipped it in. Then it was just right. To top it off I stepped in a little bit of cocoa powder on top along with cookies and cream sauce and shaved chocolate. This turned out great, after the modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Rose Hills"
},
"reviewBody": "This is the quintessential potluck dessert! Super delicious and flexible - change up the pudding layer pretty much however you like. I actually mixed a large chocolate with a small vanilla pudding. I used 2 cups of pecans, ground in the food processor for the base, and doubled the whipped cream for the topping (I used a 9x13 baking dish). I also added a very thin layer of caramel dipping sauce on top of the pudding layer. So rich and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie C."
},
"reviewBody": "This was a super easy delicious dessert. From the walnut crust to the cream cheese whipped topping, it was enjoyed by all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "Fam loved it. I LT was very easy to make- and I used some short cuts. Diamond makes a premade walnut pie crust. Check! Cool whips blends easily into cream cheese- but it’s not as sweet as you think. Add 2 T of powdered sugar. Check! Save 1/4 of the cool whip to top the pie. Top with chocolate morsels. Check! I’ll make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikkib"
},
"reviewBody": "Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlena R Meedom"
},
"reviewBody": "This is very similar to my grandmothers recipie which called for either pecans or walnuts in the crust, mixing cream cheese with cool whip and a second layer of butterscotch pie filling and the cool whip / cream cheese mixture. This is so darn tasty and rich, so yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy Hearn Decker"
},
"reviewBody": "The shortbread crust should have 1 1/2 cups of flour, not 1/2. Otherwise, this recipe is similar to the one I've used for years, and I use Cool Whip. Always a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Hennes"
},
"reviewBody": "My family LOVED this pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Moran-Hurst"
},
"reviewBody": "Love this, been making it for years. I lost my copy and was so glad to find it on here. We use peanuts and cool whip. Can always change it up a bit. My family eats it faster than i can make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "james d"
},
"reviewBody": "This is the exact recipe ive been looking for since i was 14, and im 34 now. Thank. You ms. Tracy for this recipe. A woman from mississippi introduced me to this pie as a teen and the recipe got lost when we moved. Again thanks because this is rich in flavor and should be shared with the world"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Bennett"
},
"reviewBody": "My mom has been making this for me for years, it's one of my favorite desserts...she calls it \"Chocolate Delight\". I can not stay out of it when she makes it! It's always my request for my birthday. I'm 36 and she still wants to cook for me...it's a Southern thing I guess. Anyway, you can not go wrong with this, a bit of a pain to make but well worth it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GreeneyesMarilyn"
},
"reviewBody": "I made this &amp; used toasted (chopped) Pecans! It was delicious! Understatement! Everyone loved it &amp; wanted the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni Jefferson"
},
"reviewBody": "This recipe has been in my family for years and my cousins finally let me know where I could find it for my self. I will say make sure the butter is soft but not melted it blends better, and don't make the crust too thick. You might have to increase the portions at least by half to fit the 9x13 pan. Also to me the walnuts were too overpowering and kind of bitter. I redid the recipe with pecan pieces and I liked it a lot more as well as my family. Also this was my first time using heavy whipping cream and it takes a while to get it whipped up, definitely use a blender. I might use regular whip cream next time and see if I like it better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shurlz"
},
"reviewBody": "I am rating this recipe so low because the measurements for the crust are off! I followed this recipe to the \"T\" on three different occasions and each time the crust did not come out right. The consistency is off and it's not enough dough to cover a 9x13 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Firefly9"
},
"reviewBody": "tasted sooo good. i had problems with the crust, maybe i didn't let it cool long enough? the white layer wasn't as fluffy as i remember it being, but over all....scrumptious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Love this! I did have to bake the pastry portion a little longer than suggested though. I used a tub of cool whip instead of the whipping cream and added a little vanilla extract to the mixture. I sprinkled pecans and chocolate chips on top. Will make this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shellalees"
},
"reviewBody": "The comment by the picture say pie pan and the directions say 9X13. If you do this with a 9X13 I would double the recipe. I plan to do that and use 2 layers of pudding next time. My family enjoyed sprinkling choc. chips on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOYCE_NIELSEN"
},
"reviewBody": "I made this for Thanksgiving in lieu of French Silk pie. Everyone LOVED it! Following other reviewers' leads, I kept the whipping cream cold...maybe too cold. I popped it into the freezer while the crust was baking and promptly forgot about it. It was half frozen when I removed it, but it melted quickly and whipped well. This is a new family fav!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JENELLEBELLE"
},
"reviewBody": "This was just okay. A little bland. I probably will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Serenity2991"
},
"reviewBody": "Just make sure you read the directions carefully and follow them exactly. If you don't want the walnuts, be sure to double the dough recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doristam"
},
"reviewBody": "Great! Except i used a graham cracker crust, a springform, and no nuts. i folded half the whipped cream into the cream cheese. then i did crust--&gt;pudding--&gt;cream cheese--&gt;pudding--&gt;rest of whipped cream. you chill it really good like over night plus some, then it'll pop out good from the springform if you run a hot knife around the edges. i made a mistake on the pudding on mine tho, i followed the pudding box recipe for pudding and not the pie recipe (which uses less milk) but it was totally fine. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christine Williams Tucker"
},
"reviewBody": "the filling is great but in the directions it says to press into a 9x13 and there is no way there is enough dough. so i went to cooks.com and used a crust recipe for mississippi mud pie then came back and used this filling recpe. still it is too thin, a local steak house serves this dessert and it is thick so next time i make this i will use the other crust recipe i found which uses 1 3/4 cup flour, 1 cup pecans and i\\1 stick of melted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Melissa Still"
},
"reviewBody": "We used a gram crust. This pie turned out absolutely gorgeous and was a huge Thanksgiving hit! This is THE BESET MUD PIE ever, top with whip cream and mini chocolate chips. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SARRAHS"
},
"reviewBody": "This was pretty good! I loved the whipped cream/cream cheese topping. The crust was a bit overpowering though, and did not seem to mix well with the chocolate flavor. I might try a different nut next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev511"
},
"reviewBody": "I need a sugar free dessert for this weekend for an event, so I modified this and made it tonight as a trial run. It is probably the best sugar free dessert I have ever made.. here's what I did: I used sugar free instant pudding and instead of conf sugar I used sucralose granular (Splenda) Since the cream cheese and splenda was a little \"thick\" w/o conf sugar consistancy I added some extra whipped cream to the mixture. I also had to use a little extra flour in the crust to get the right consistancy and I did not have walnuts, so used pecans instead. It was DELICIOUS! If you like to try to lighten up desserts as we do, try this modified version and I am sure you will love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich"
},
"reviewBody": "We didn't even make this right and it was still fabulous! We used a 9\" graham cracker crust from the pantry. Without the chocolate pudding, we threw banana and lemon pudding together. If you're looking for something high in calories and low in food value, this is IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jbryantjd"
},
"reviewBody": "The best variation I have had is to not use the walnut crust and to use crushed chips ahoy chocolate cookies instead! YUM YUM!! THE BEST"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Speckle"
},
"reviewBody": "I made this last night for my daughter, she had tasted a mud pie at her grandmother's at a Thanksgiving event and was raving about it. So, I got on here to find a good recipe. It was WONDERFUL!! She doesn't like the nuts on the bottom, but I LOVED IT!! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ada christine"
},
"reviewBody": "I brought this to work and the whole thing disappeared. Since I can't get the right kind of instant pudding here, I made the pudding my self and it turned out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss"
},
"reviewBody": "This was a very easy recipe and oh..so..delicious.I had a little trouble with the heavy whipping cream because if you don't keep it cold enough, it will begin to churn. It looks similiar to spoiled milk when it does. So with that, I did have to start over. I followed the recipe pretty close, other than on top of the cream cheese layer I sprinkled chopped walnuts. On top of that added a layer of cool whip, along with more walnuts sprinkled on top. My family tore this pie up. The next time I make this, I think I'll make two. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ThreebyFiver"
},
"reviewBody": "Yum! Next time I will have to remember to spray the pan, as the \"crust\" stuck to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hope Hutchens"
},
"reviewBody": "I just Substitute pecans for the walnuts. You can't lose with this one. People will be licking the pan! Very rich but delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CARLYNSMOMMY"
},
"reviewBody": "This was just \"so so\". It was not a big hit. I think maybe one person tried it. I won't be making this again. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPEARFISHER"
},
"reviewBody": "Most excellent and very easy to make. Highly recommend this one. I didn't/wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsey Wolnowski"
},
"reviewBody": "I made this recipe last summer, and just came accross it again this afternoon while looking for somthing to make for dessert tonight. It is a really good recipe. The only things I change, are I use about 3/4 cup of flour instead of the 1/2 the recipe calles for. And, I use almonds instead of walnuts. (not much of a walnut fan) Good stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FOSTERKR"
},
"reviewBody": "This recipe was pretty easy, and yummy. If you are inexperienced with whipping cream (as I was) make sure that you buy unpasteurized, unhomogenized whipping cream. It is easier to whip than pasteurized or pasteurized &amp; homogenized. Try to make sure the cream is very cold when you start to whip it, and keep it as cold as possible while whipping it. When it is too warm it churns (like making butter) instead of whips. Good luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ONELOT"
},
"reviewBody": "yum yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wayne12182"
},
"reviewBody": "Very good and very easy. Also very creamy. Still, I feel something wasn't quite right with it. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We made this at work for a co-worker's birthday. It was extremely easy. It was a huge hit - everyone liked it. Considering the ingredients it was quite light. Really great for summer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nickolas"
},
"reviewBody": "This is the real Mississippi Mud Pie I know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipie it's quick and easy.My mom calls this a 4 layer pie and makes a variation on it instead of walnuts she uses pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used to make this with my grandmother when I was a kid. I love it. But we used cool whip insted of the whipping cream, and made the chocolate layer into 2 layers, under and over the cream cheese one, then added coolwhip on top. So rich."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15879/mississippi-mud-pie-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17640/desserts/pies/slab-pie/",
"name": "Slab Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15879/mississippi-mud-pie-ii/",
"name": "Mississippi Mud Pie II"
}
}
]
}
}
, "about": [
]
}
]