				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mock Mincemeat Pie"
,"datePublished": "2020-06-18T23:33:09.000-04:00"
,"dateModified": "2020-06-18T23:33:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jane Buck"
,"url": "https://www.allrecipes.com/cook/2083422"
}
]
,"description": "A medley of apples, raisins, orange zest, apple and orange juices are simmered in this family version of mincemeat. Make the filling in advance and refrigerate until ready to use, or bake immediately in a double-crust pie. If desired, stir 1 to 2 tablespoons of brandy into the filling to enrich the flavors."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lkd6i-37byQuxWscxzkutL2bCgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/56817-a71993dd56954c62b333ed56bfc223c7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mock Mincemeat Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "24"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "429 kcal"
,"carbohydrateContent": "73 g"
,"fiberContent": "4 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "248 mg"
,"sugarContent": "45 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 cups seedless raisins",
"4 Granny Smith apples - peeled, cored and sliced",
"1 tablespoon orange zest",
"0.33333334326744 cup orange juice",
"0.5 cup apple cider",
"0.75 cup white sugar",
"0.5 teaspoon ground cinnamon",
"0.5 teaspoon ground cloves",
"2 soda crackers, finely crushed",
"1 pastry for a 9 inch double crust pie" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Stir the raisins, apples, orange zest, orange juice, and apple cider together in a pan. Simmer over medium heat, stirring occasionally, until apples are very soft, about 20 minutes. Stir in the sugar, cinnamon, cloves, and soda crackers until well blended. Refrigerate until ready to use, or pour apple mixture into the prepared pie crust. Top with the second crust. Pinch and crimp edges to seal the crusts. Pierce the top crust in several places with a fork."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and bake until top is golden brown, about 30 minutes more. Cool before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betz"
},
"reviewBody": "This has been my standard recipe for years, and it never fails to please. As other reviewers have said, it is a flexible recipe. I now typically make it gluten free: omit the soda crackers, then puree some of the the cooked liquid with an extra half cup or so of raisins: this also makes a nice dark colored base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Snare"
},
"reviewBody": "Made as is except for soaking the raisins in 2T of dark rum before cooking...the pie was delicious! This would also be great warm over vanilla ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joodz999"
},
"reviewBody": "This was an awesome version of mock mince meat pie. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Jo Hamilton"
},
"reviewBody": "I don't like raisins so I subbed craisins. This was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emily"
},
"reviewBody": "Yes, made many changes, due to unavailability of ingredients while traveling. Used brown sugar rather than white (less than specified; the only spice on hand was cinnamon, but I had some garam masala (Indian spice mix) which includes a number of friendly flavors, so threw in a spoonful of that. No apple cider, so splashed a bit of malt vinegar in to compensate. Walnuts, raisins, granny smith apples orange zest (no juice), a couple of spoonfuls of pear conserve for good measure--got rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WSchultz"
},
"reviewBody": "I made it as per recipe with only two changes. I substituted 2 Tbs cornstarch for the soda crackers and used a store bought gluten free pie crust. My wife is on a gluten free diet and cannot have the soda crackers. The pie came out great. Almost forgot to add the brandy but got it in before I put the top on the pie. Would like to make again but substitute 3/4 cup dried cranberries for half the raisins and add 1/4 cup chopped walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "random gourmet"
},
"reviewBody": "I've made this for two years at Christmas Eve dinners. This recipe is quite flexible. I added dried apricots, candied walnuts, and dried cherries and substituted spiced rum (a healthy splash more than suggested); then added a second crust lattice style. Brush the lattice top with a little heavy cream and butter and after baking, what a nice presentation. If you cook down the liquid and sugar a bit, the texture is a little more hearty and shows off the fruits. Follow baking time as suggested. Thanks so much for a lovely dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dallas mom"
},
"reviewBody": "I added 2 tbsps of Marsala (no rum on hand) as others hinted; also used about 2 c of golden raisins. I cooked it all in a crockpot for a couple hours, stirring once an hour or so. I did add 2 tbsps of cornstarch mixed into 1/3 c cold water in the last 20 min to thicken (didn't have crackers on hand). Cooled, stored in mason jars in frig for a week before making pie. The filling cold is some kind of awesome by itself. I could see heating and spooning over ice cream or pound cake. It has -- to me -- a pleasing citrus bite. I'll be making it as gifts next year for my \"have everything\" friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Paine"
},
"reviewBody": "I LOVE this pie! I use 5 Honeycrisp apples and 2 Grannysmith, large apples. It makes a nice deep dish pie. Delicious, easy, and beautiful, and tastes like memories! I grew up having mince pie. My son also loves it now, and we have to have this every Thanksgiving. Thank you for an amazing recipe! Oh, I do chop the apples smaller, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WVRedCookin'"
},
"reviewBody": "Made this for Thanksgiving as a request. This pie turned out perfect! I mixed currants, raisins and golden raisins. I also crushed about 6 crackers instead of 2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holy Cannoli"
},
"reviewBody": "Looking for a 'from scratch' recipe and this was just perfect. I added 1/2 chopped nuts, vanilla, a few extra crushed saltines, and a splash of Captain Morgan. Absolutely amazing. So happy I found this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KateShaw"
},
"reviewBody": "Delicious although I may use one fewer apple next time and a few more raisins. I added 1/2 c walnuts and used dark spiced rum instead of brandy. I made mine into tarts instead of one pie and had some left over. I'm tempted to eat it out of the pot with a big spoon. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjlyn"
},
"reviewBody": "I have never baked a pie from scratch before (myself, that is!) a good friend of mine has a birthday within a day of Thanksgiving, and her favorite pie is Mock Mincemeat; so as a gift, I thought I'd take a stab at it. I never got so many compliments on my baking! EVERYONE loved it! I don't like pie, so I can't personally say I loved it, but I did love the compliments!! I will save this recipe and use it for many years to come! Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Benjamin"
},
"reviewBody": "This recipe is perfect as written -- an exact replica of the mincemeat pie my mom used to make. I didn't think anyone else in the family would like it, but it was the first pie to go at our last get-together. LOVE it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ambrosia"
},
"reviewBody": "Dad loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boonepharm"
},
"reviewBody": "First attempt making a mince pie for several mince lovers for Thanksgiving. Got two thumbs up! I'll take their word for it, since I don't have any room to try it after eating all my favorite pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mark Logan"
},
"reviewBody": "This was just OK, IMO. It didn't quite have the taste I was after. I'll keep looking for a good mincemeat pie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TIARAJOY"
},
"reviewBody": "My mom always served store-bought mock mincemeat pie during the holidays and I always wanted to make my own. Loved the recipe and had great reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Baldwin Spooner"
},
"reviewBody": "I made this for my grandfather and HE loved it..Almost ate the entire thing himself!! I have never been a big fan on Mincemeat pie.. but this one is awesome. the only alteration i made was I put a 1/2 shot of rum in the mixture just to zig things up.. came out great!! will definately make this again..Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BN61079"
},
"reviewBody": "I'd never had mincemeat before. Made it as directed, with apples we had just picked. Had a lot of liquid, so along with the saltines, I stirred in some cornstarch I had dissolved in OJ. That kept the cut pieces from being too runny when we served it at room temperature. I had made a lattice-top. The taste was not orangey as I thought it would be considering the juice and zest, and I even added a tbs of grand mariner to the stovetop mixture. The taste of cloves was a bit overpowering for me, but my husband really enjoyed it. Would make it again with less cloves, and maybe add nutmeg and vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Ann"
},
"reviewBody": "I am surprised to see that so few people have reviewed or tried this recipe. I love mincemeat pie and this recipe is far superior to anything you could buy in a store or by using jarred mincemeat. I made exactly as written and it came out perfect. The smell of the apples and cinnamon and cloves cooking is out of this world. The orange juice and apple cider add a lot to the pie. Made it at Christmas and again in Feb. Wonderful recipe- 5 stars Peggy Ann"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess"
},
"reviewBody": "Loved it! I did need to add a about 1/2 cup more apple cider during the stovetop time or it would've dried out. I didn't have any rum left it out completely. Cooked it as a two crust pie. I have one son who is a big mincemeat (minus the meat) pie fan and so I always make one for him at holiday gatherings. He inhaled it and took the rest home with him! Will definitely make again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mirelle B"
},
"reviewBody": "This was amazing! My English husband said it was even better than his Mum's! I substituted lemon zest for the orange zest and added some walnuts for a bit more texture and 2 tablespoons of dark rum - I didn't have brandy.\nKudos! It was D-lish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Buck"
},
"reviewBody": "Truly an awesome pie.It is moist and the apples are in equal dominance with the raisens in flavor with a hint of orange and good old fashioned spices!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/153026/mock-mincemeat-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12949/desserts/pies/fruit-pies/mincemeat-pie/",
"name": "Mincemeat Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/153026/mock-mincemeat-pie/",
"name": "Mock Mincemeat Pie"
}
}
]
}
}
, "about": [
]
}
]