				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mock Angel Food Cake"
,"datePublished": "1998-07-25T12:12:08.000-04:00"
,"dateModified": "2022-07-14T15:57:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Melissa Busse"
,"url": "https://www.allrecipes.com/cook/24326601"
}
]
,"description": "This is an angel food cake for a sheet cake. My grandma used to use this when she had a bakery. I have never had a problem with it. It is so easy to do."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DytXEMJd_mfj2xGTfFGKch_4nCI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/462044-29bd63a2b202470ca182f2c705e34715.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mock Angel Food Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "55"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "575 kcal"
,"carbohydrateContent": "132 g"
,"fiberContent": "1 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "850 mg"
,"sugarContent": "81 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"4.5 cups cake flour",
"4 cups white sugar",
"2 teaspoons salt",
"2 cups boiling water",
"16 egg whites",
"2 tablespoons baking powder",
"2 teaspoons cream of tartar",
"2 teaspoons vanilla extract",
"1 teaspoon almond extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Sift cake flour, sugar, and salt three times then stir in the boiling water. Let cool."
} ,{
"@type": "HowToStep"
,"text": "Beat egg whites, cream of tartar, baking powder, vanilla and almond flavorings until stiff peaks form. Fold into the flour mixture and pour batter into one ungreased 12x18 inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 35 minutes. Cool cake inverted in pan, laying a tea towel underneath the cake to absorb the steam. Frost as desired once the cake is cooled."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deena"
},
"reviewBody": "I made this for my daughters birthday. I did not change anything; followed the recipe as is. Everyone loved it! It tastes just like angel food cake. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I made half of the recipe and got a 6”, &amp; 8” round and a couple of cupcakes. I will definitely make this again using it for a tiered wedding cake. I had a hard time waiting for the Cake to cool so I could see it and it was beautiful! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeisethRanch"
},
"reviewBody": "Excellent! I had all these fresh strawberries and needed a cake to go with them. This is my favorite type of cake and I will normally order it from one of my friends who make it at home. I didn't have time to do that so I looked for a recipe and decided to attempt it myself. It is amazing! After reading some reviews that had less than 5 star feedback, I can only guess there was an error in one of their steps or ingredients. Make sure you let your first step ingredients cool. Make sure your eggs achieve a meringue texture. I learned at an early age to have your egg whites at room temperature or put them in a glass bowl floating in a bowl of warm water. An electric whisk Works Wonders with the bowl tilted to the side to achieve maximum air when whipping. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GLSM"
},
"reviewBody": "I will not be making this again. Came out rubbery even though I followed all the instructions exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ML"
},
"reviewBody": "I have a question, what makes this a \"Mock\" angel food cake? It seems to have the same basic ingredients that I see for most of the non-Mock recipes except for the hot water mixing with the flour and the other dry things. I am actually wondering what that does for the recipe because I never heard of that procedure for a cake like this before. Just curious.\nOh they would not let me post this without a star rating even though I am only asking questions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aidan"
},
"reviewBody": "it was one of the best cake I have ever made but it took a little over 2 hours of whipping egg yolks but it was well worth it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xLaurieClarkex"
},
"reviewBody": "Excellent recipe! Worked very well for a sheet cake! Can be used with a heating core(craft stores, cake supply shops) if you really want tobemsure it rises tall"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bankonthat"
},
"reviewBody": "I made this just exactly how it called for except I did do just half the recipe. I loved the way it turned out and how easy it was. Yes it was a little tougher than a real angel food cake, but oh so easy. I put leftovers in a trifle and it turned out so yummy. I defiantly will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lawyer Who Shoulda Been A Chef"
},
"reviewBody": "It turned out a sticky gooey mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Schifano"
},
"reviewBody": "Love this recipe it's easy to make I halfed the ingredient"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snickers9584"
},
"reviewBody": "I'm shocked to have found this recipe. This is the identical cake recipe my grandma used for peanut cake or also known as \"Blarney Stones\" ..cut into squares, frost all sides with a thin white frosting and roll in crushed peanuts. Try this cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cookiebaker"
},
"reviewBody": "Terribly dense and chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RuggerDucky"
},
"reviewBody": "Made this tonight. Was a little weirded out reading the recipe, but read the reviews and gave it a whirl. This will now be my go to cake for strawberry shortcake!\n\nA few tips: \n\n1. split the eggs and ingredients in half before whisking. I've got the big kitchenaid stand mixer and once they started whipping up quickly overfilled my bowl.\n\n2. Don't leave the tea towel under too long. Sticky. \n\n3. Sift the full three times. You'll understand after the third sift, even while your hand is cramping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "junglejane1969"
},
"reviewBody": "Love this recipe! I have made it many times and my family loves it! Tastes awesome frosted with the \"Wedding Cake Frosting\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana M. Wiebe"
},
"reviewBody": "I halved the recipe and made a 9x13. I only had all purpose flour, used 2 cups and it was still a bit too floury, need to try it again with cake flour. Other than that, it was really easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "This was awesome, the mixture was a bit strange, however it turned out super. Very large recipe. Will cut it in half next time. My son wants this for his birthday. LOVE IT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dmoroni"
},
"reviewBody": "Cake baked and cooling..smells great...have not tasted as of yet (still cooling)...I made a 1/2 batch to sample this cake, going by the calulation chart.My cake only rised to about 1.5 inches?? is this right? or perhaps someone know why. All help/answers welcomed :) thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Looneylady"
},
"reviewBody": "Makes an awesome strawberry shortcake! Just top with fresh whipped cream and fresh fruit. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "loricakes"
},
"reviewBody": "I was excited to try this, but I just didn't enjoy it. Way too dense for my liking and the taste was just ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CharlotteC"
},
"reviewBody": "I have been making this recipe for several years now and it always turns out perfect! I do whip up the egg white mixture in 2 batches because I can't fit all puffed up 16 eggs in my mixer at one time. I think a trick for keeping it really moist is to make sure that you cool the cake upside down on a tea towel; that seems to trap in the moisture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Just challah"
},
"reviewBody": "I made this for church and it was a big hit. Topped with strawberries and whipped cream. Denser than store bought but better flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ILIKECAKES"
},
"reviewBody": "I also got this same recipe from a grandma--she swears you have to freeze the cake for a least a week so it's more tender--work for me!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rita"
},
"reviewBody": "Followed the recipe, but found it a bit stiff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kavalik"
},
"reviewBody": "This cake is so yummy! If you don't like angel food/spongy cake, this is not the recipe for you. For us angel food cake lovers, it's great! I read all of the reviews before making it and cut the recipe in half (I use a casserole dish to make my sheet cakes). My dish is dark glass, so I cooked it at 400 degrees for 20 minutes and this was perfect (I may take it out a minute or two earlier next time, but 15 was not enough). The cake rose like it should and I think those that may have had trouble with it rising probably either greased their pan, used a non-stick pan or did not beat the egg mixture long enough for it to peak. I added a whipped cream cheese icing to the cake and put strawberries and blueberries on top - WOW! Can't wait to serve it for our 4th of July cookout tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison M."
},
"reviewBody": "This cake is awesome! I wanted a denser angel food cake for a strawberry shortcake and this really fit the bill. It was so easy to make and everyone loved the taste! Made exactly as the recipe states. No substitutions needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie"
},
"reviewBody": "Could have been a little lighter, but that may be because I deflated the egg whites a little when I folded them into the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moksen"
},
"reviewBody": "This is the best cake ever. I made this for my daughter's first bday. Everyone asked me for the recipe. Takes a little while to make, but make sure to follow the recipe exactly. I loved the texture and topped it with a whipped cream frosting and strawberries. Wish I could eat this every day!!! Also, this is a huge recipe, halved still makes a very larg cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HYDEEJ"
},
"reviewBody": "Great Recipe. My fiends son is alergic to dairy and this was wonderful. I used it in my Wilton Winnie the Pooh Pan, and frosted it just like I usually do I was a hit. I also used it in a Pan to make little lady bug and butterfly cakes for a tea party and even the kids who thought they did not like cake loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kwill"
},
"reviewBody": "I did not care for this recipe. It was very heavy, very dense, and too chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Super easy, turned out perfectly! Great recipe, I'd love to try it for a wedding cake. A 12x18-inch pan makes about 54 servings, though NOT 10! (cut 2\"x2\")"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "llheim"
},
"reviewBody": "This recipe was great for making petit fours. Following the advice of others, I halved the recipe then baked it in a 1x18x12 baking sheet (lined on the bottom with waxed paper) and cut it into rectangles with an electric knife (cookie cutters didn't work). Be careful not to over bake--it becomes slightly rubbery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gally"
},
"reviewBody": "I made this as a sheet cake and it came out of the pan just fine. I rolled it, using a lemon filling from allrecipes and it was an absolute hit. \nHowever, the rolled cake MUST sit for at least 6 hours so the cake absorbs the filling's moisture - it IS a dense cake and will be chewy if you cut into it too soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nwyrbby"
},
"reviewBody": "Was perfect! Made half a recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "graciaann"
},
"reviewBody": "Very good. More dense than the usual angel food cake. I actually only made one fourth of the recipe in an 8x8 pan. Turned out great for a smaller amount of people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Deslauriers"
},
"reviewBody": "I use this recipe all the time for wedding cakes when requested. This is not an angel food cake it is a MOCK angel food cake, thus it is heavier almost sponge like. This recipe will fill what we call a 1/2 sheet cake pan and will serve 40-58 depending on how large your portions are. Half this for standard 13x9 pan. This is the best recipe for Mock angel food cake I have found. TRY IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charity"
},
"reviewBody": "This cake turned out very well. I didn't have any cream of tartar so I added 4 tsp of lemon juice instead - it probably could have used 6 tsp though. I didn't bother with sifting my dry ingredients, I just used my hand mixer on a very low speed for a few minutes to combine and get out any clumps. Next time I will definitely only make a half batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've always had success making angel food cakes from scratch, but not this time! I used this recipe cuz I wanted to make a cake roll with glazed strawberries and whipped cream. Followed the recipe to a T and the cake came out of the pan in pieces and had the texture of a heavy sponge. Thank goodness for the Brits who came up with Trifle -- I ended up making it instead and saved the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kel dn"
},
"reviewBody": "me and my 10 year old sister tried out this recipie for my other sisters birthday. we spent the whole morning in the kitchen making the batter. it turned out very thick. we ended up having enough better for two 9by13 inch pans, how we dont no. nevertheless we liked this cake which is fairly easy. it is moist and thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I drove to three different grocery stores today looking for an angel food sheetcake.. and it turns out it was MUCH easier to make one with this recipe. It was amazingly easy to make and came out wonderfully. After reading the other reviews that said the recipe made a LOT of cake, I decided to halve everything and use a 9x13 pan. It worked perfectly, and I would definitely recommend this to anyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle"
},
"reviewBody": "I scaled this to half using 2 cups of all purpose flour and put it in a jelly roll size pan lined with parchment paper (to make it easy to remove from the pan). I read another similar recipe that cooked at 400 degrees and since several reviwers said the cooking time indicated wasn't enough, I used the higer temperature. For my smaller batch, 15 minutes at 400 degrees worked perfectly. This is the oddest recipe ever but it really works, though you'll have your doubts when pouring boiling water into the flour mixture. The cake is just a bit heavier than traditional angel food, but that was good for my purposes, I wanted to make a rolled cake. I turned the very warm cake onto a tea towel dusted with powdered sugar and rolled it up till cool, then unrolled and filled with lemon filling. Frosted with whipped cream it was a very light and tasty dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3BadBoxers"
},
"reviewBody": "I halved this recipe and used a 9x12 pan and it was more than enough for 8-10 servings. Since I used a dark metal pan, I baked at 345 for 25-30 minutes - the recipe is quite easy - 1st time I've had an angel food cake turn out. The recipe is a little heavier than most angel food cakes, but perfect for a shortcake. I didn't have cake flour, so I used (in the 1/2 recipe) 2 cups all purpose flour and 1/4 cup cornstarch to substitute and it was just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TARA LYON"
},
"reviewBody": "This cake is good, but I have made it 3 times now and every time it takes a good 30 minutes extra cooking time before it is cooked all the way through. Also, it serves way more than 10 people! Tastes great though, especially iced with whipping cream and trimmed with fresh strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good. Will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KT_003"
},
"reviewBody": "Rather heavy, unlike most boxed angel food cakes. It was almost impossible to separate the all the yolks and whites. After I was done making it it tasted quite nice though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Suggestions: pan size should be 12x18x2inches\r\nbaking time could possibly be a litle longer. Also be sure to use a really lge bowl for the flour sugar mixture.Kitchen Aid mixer bowl was too small. My family really loves this cake and I make lemon curd and always have egg whites to use up.I serve smaller size than suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LESBESQUET"
},
"reviewBody": "Great cake. I had trouble with the size of the recipe fitting my bowls! I had to bake it in 2 9\"x13\" pans. From now on, I'll make 1/2 the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've never had a sheet cake come out so level. Frosted with an Almond Butter Cream Frosting...It's the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Almost as easy as making an angel food cake from a mix, but so much tastier!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7868/mock-angel-food-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/399/desserts/cakes/white-cake/",
"name": "White Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7868/mock-angel-food-cake/",
"name": "Mock Angel Food Cake"
}
}
]
}
}
, "about": [
]
}
]