				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Moist Lemon Poppy Seed Cake"
,"datePublished": "1999-03-16T10:33:03.000-05:00"
,"dateModified": "2022-08-04T10:01:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MARBALET"
,"url": "https://www.allrecipes.com/cook/39277"
}
]
,"description": "This is a delicious moist poppy seed cake recipe that&#39;s so tasty you&#39;ll want to double the recipe. It freezes well and is great for gift giving!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/woTz35Mr74BLINuf8im3Chp0Lzs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/35289-7b1c02fb9a164f4aa444726f7af41d05.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Moist Lemon Poppy Seed Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.2",
"ratingCount": "48"
}
,"cookTime": "PT75M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "447 kcal"
,"carbohydrateContent": "55 g"
,"cholesterolContent": "131 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "227 mg"
,"sugarContent": "32 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.25 cups cake flour",
"1.125 cups white sugar",
"1 teaspoon salt",
"1.5 tablespoons lemon zest",
"4.5 tablespoons poppy seeds",
"1.333 cups unsalted butter, softened",
"5 eggs",
"0.75 cup white sugar",
"0.75 cup lemon juice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan."
} ,{
"@type": "HowToStep"
,"text": "Sift together flour, 1 1/8 cup white sugar, and salt. Mix in lemon peel, poppy seeds, and butter. Beat in eggs, one at a time, beating well after each addition. Pour batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 1 hour and 15 minutes, or until a toothpick inserted in the center comes out clean."
} ,{
"@type": "HowToStep"
,"text": "In a saucepan over low heat; cook and stir 3/4 cup white sugar and lemon juice together until sugar is dissolved. Let cool to just warm or to room temperature."
} ,{
"@type": "HowToStep"
,"text": "Remove cake from the oven and place the pan on a wire rack. Place a cookie sheet underneath the rack. Prick the top of cake several times with a toothpick. Brush top of cake with warm or room temperature syrup, allowing lots of syrup to run down and soak into the sides and bottom of cake. Cool slightly in the pan before removing cake to a wire rack to cool completely. When completely cooled, wrap cake in foil or plastic wrap and let cake rest at least one day before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ericsan"
},
"reviewBody": "I followed the directions to a T and ended up with a brick that was overcooked and dry on the outside with an uncooked goopy core. Very disappointing. Will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Racine Ellen Bombard"
},
"reviewBody": "This was dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kiki"
},
"reviewBody": "There's not enough lemon flavor at all. It tastes oily and dense. I wasn't getting any of the lemon flavor. Big disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrystal"
},
"reviewBody": "This is my sons favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "alpal"
},
"reviewBody": "I added 3/4 tsp baking powder and 1/4 tsp baking soda. I also added lemon juice to the cake batter as it was so stiff I could barely mix it. It turned out nicely, very moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patrick Shreve"
},
"reviewBody": "Forgot salt. also added 2 tbsp of whole milk. and sprinkled some sugar on top. VERY GOOD!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "PatLl4evr"
},
"reviewBody": "I put half of the lemon juice recipe an it was super sour around the edge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "oliviatyler"
},
"reviewBody": "It was quite dense and not as moist as I had hoped. I actually liked that it was tart (especially when you add the lemon sauce over top). Perhaps a fix to make it moister would have been good but it was still pretty good. I also took it out of the oven 20 minutes before the recipe called and it would have been burnt to a crisp it I hadn't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sue Fluhr"
},
"reviewBody": "The lemon \"glaze\" is way too tart, and the cake is dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gloe"
},
"reviewBody": "Very lemony delicious would make it many times I did not have butter milk so I made my own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "spapsdorf"
},
"reviewBody": "I didn't find it moist nor did the picture represent what the cake looked like. Mine, too, burned and ended up turning down the oven to 320 to finish it off - about the last 25 mins. It's dense and in my opinion dry. I was looking for a moist and fluffy lemon cake and this didn't work for me. I followed the recipe exactly as written and even invested in cake flour and blended one egg at a time. Moving on..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Aloha52153"
},
"reviewBody": "The cake came out gummy and thic. It's way too heavy; there's no baking powder to make it rise. I was very disappointed in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "j123jam"
},
"reviewBody": "This turned out very dense, and not in a rich buttery way. the top and sides were pretty good because they absorbed most of the lemon+sugar syrup, but the center was bland and dry. Nobody at my office could eat more than half a slice. There are much better lemon poppyseed pound cakes out there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Bisharat"
},
"reviewBody": "It was good yet I would probably do a little less lemon syrup at the end.......other then that yes i would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Violet"
},
"reviewBody": "so nice and easy to make, big hit with my guests. Also a great birthday cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TamaraJean1018"
},
"reviewBody": "This recipe was simple to follow.\nThe finished product was easy to work with for muffin pans.\n\nAfter the first batch I did make a few changes because it was not lemony enough for me personally, but the flavor was just fine.\n\nI made the recipe to serve 12 people and I was able to make 2 ½ dozen beautiful muffins.\nMy changes made it more lemony/sour and I loved it!\n\nI added about 2 TBS of lemon juice with pulp and about ½ TBS of extra lemon Zest to the mix and I only added ½ the recommended poppy seeds.\nWith the syrup part of the recipe I added the pulp and added the left over butter from the mix recipe. (About 2tbs)\nThis made it easier for me to work with for the muffins since it was thicker.\n\nWhile baking during the last 10 minutes I brushed the syrup on the muffins without poking them.\nI brushed them at 10 minutes, 5 minutes and then when they came out of the oven.\nWhen all was done I “dunked the muffins” both top and bottom into the leftover syrup and then lightly sprinkled a pinch of sugar over the top.\nThe Kids loved them.\nJust be warned if you follow my modifications they are tart.\n\nOn a side note: I used Wilton 6 cup King Size Muffin Pan and a number 12 Ice Cream Scoop. (You can find this at any of your restraint supply shops, they are must have)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ndm726"
},
"reviewBody": "The syrup made the cake a bit sour. I have to add a liberal sprinkling of powdered sugar to each slice to make it more palatable. Didn't notice the the recipe note beforehand that cake is supposed to sit a day before serving. Took a bite right after I took it out of the pan and it was awful. Improved within 2 hours, and was much better the next day. Next time I think I'll use maybe half as much syrup. Not sure why other reviewers think cake was too dry...mine was practically soggy before the syrup fully set in, and has stayed very moist.\r\n\r\nI used fresh lemon for the juice and zest because my mom said it would taste better/stronger (I had originally planned on using bottled juice and substituting something for the zest)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jo3865"
},
"reviewBody": "Not moist and we ended up pouring out butter which was bubbling over the pan. Taste wise....no one enjoyed it. Very difficult to mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "brandynleah"
},
"reviewBody": "This recipe has a good base, but could use some tweaking. I made this once following the exact directions and I ended up with a difficult to mix batter and a burnt cake.\nI would cream the butter, eggs and sugar together first. Add some lemon juice to the batter. Also, ditch the syrup topping, it's too bitter. And please, if you're making this, don't bake it for and hour and 15 minutes. I baked mine for 55 minutes and it was still too long.\nSorry for all the negativity, but I gotta be honest! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "This was the driest cake I have even tasted. I thought there was something strange about this recipe when I filled the pan with the batter---it was too thick and I thought it needed more \"moisture\" (ie. milk, oil etc.)---five eggs? I definitely would't recommend this \"moist\" lemon poppy seed cake to anyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lilacwine808"
},
"reviewBody": "The directions aren't quite right for this cake. See \"Delicious Moist Poppy Seed Cake\" on this site for the same recipe but with complete directions. Looks to be by the same person too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Gosbell"
},
"reviewBody": "This is the BEST cake I have had for a long time. I absolutely luv orange poppyseed cake, one of my fave's, but only because store bought versions are never lemon!! (why is this?) I went by the recipe simply because I do not bake very often and have never attempted a cake like this. I had to go and buy a loaf tin! I shared with family and friends and everyone agreed it is scrummy!! I will definitely make it again. The only thing I will do differently is make holes in the middle of the cake bigger for more syrup to get in. The lemony syrup seeped into sides and the top/bottom of cake fine, but the middle missed out a tad. I kept some of this cake in the freezer too and cut and ate it straight away. Tried toasting a piece as suggested too - also delicious. As you can tell, this cake completely won me over!! YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beau Burriola"
},
"reviewBody": "I find this recipe to be a tad bland. I've followed the recipe exactly and I understand folks have many different types of palates, but this one just didn't hit it for me. I like the idea very much, though, since I've always liked lemon poppy seed bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "2kooks"
},
"reviewBody": "i may have baked this cake too long-- 40 mins in a bundt pan-- but it was incredibly dry and not really that flavourful. (i had even added some almond extract). i ended up turning the cake over and reglazing the bottom with more lemon syrup so it was palatable. very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fera"
},
"reviewBody": "I am not a fan of lemon cake, but made this for a friend, this was the best lemon poppy seed cake I have ever eaten. It was moist, delicious, awesome. The friend I made it for and I thought it was perfect, but some other ppl who tried it thought it was too lemony, so you could cut the top glaze to 1/2 sugar and lemon juice. Overall it was GREAT.... will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jesssica"
},
"reviewBody": "I altered the recipe for cupcakes. Made a little bit more syrup and they were amazing! They were moist and perfect, everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AllyG"
},
"reviewBody": "I gave this recipe one star because this is not the cake I thought it was. I was expecting more apparantly. I thought it was dense and dry. I was hoping for a moist rich lemon cake and it was absolutey not that! If you are looking for a cake do not try this as it was more like bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "This cake is really delicious and lemony - we're actually using a version of it as a wedding cake! Some modifications I used to make this a really pretty cake: double the lemon zest, don't use the syrup at all, but instead make an icing from confectioners sugar, lemon juice and milk (I used soy milk) and pour it on the cooled cake. Then you can sprinkle flower petals on it for a beautiful Easter or wedding cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zivatony"
},
"reviewBody": "Fab recipe - thanks so much for sharing it! One of those 'will never fail you' recipes - if you don't have enough poppy seeds, lemon peel, lemon juice etc, it will still come out fine. I have made this many many times and have never once had a problem with it. No it's not gonna win a cake competition any time soon but as a stand alone timeless classic it works just fine.\n\nIf you want to make them as muffins fill 14 muffin paper cases with the above measures and bake at 200 degrees Celcius for about 20 mins for fluffy light muffins. Then I make a lemon drizzle type topping out of icing sugar and the juice of 3 lemons which gives extra flavour &amp; keeps them moist for a couple of days. The cases can sometimes end up a little greasy so I like to wait to they've cooled then pop them inside another case when offering to friends etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Loretta Campbell"
},
"reviewBody": "Was not impressed with the flavor nor the texture. Was looking for something for light and airy. Did not have a very lemony flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beatrice"
},
"reviewBody": "Very delicious recipe!!! My hubby and toddler keeps asking me to do it more often. once you start doing it twice or so, it gets so quick and easy (like 10 min to prep)... good stuff!!! thnks so much for this amazingly delicious recipe!!!! YUM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maximillianna"
},
"reviewBody": "What's the actual meaning of the lemon juice that needed to be combined with sugar, if you please? Is it the real juice from lemon or the sweetened juice?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa123"
},
"reviewBody": "I love this recipe! The result is a very dense, moist, and somewhat tart cake. It's exactly what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gia Wright"
},
"reviewBody": "I love this cake and so do the people at my husbands job. Every time he has a carry-in, they ask him if I can make this cake for their dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "This was exactly the lemon poppy seed cake I've been looking for. I like the pound cake texture, never had a light fluffy lemon poppy seed cake, just pound cake textured. I used the lemon juice from the lemon I zested and the rest bottled. Next time I will use all fresh squeezed. I also only used 4 eggs because we use jumbo. You definitely have to wrap this, refrigerate and rotate so the syrup works it's way through the entire loaf. I put this out at work and it was gone in the blink of an eye. Thank you for a classic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good taste but I prefer a lighter, fluffier texture. This definitely has the consistency of a pound cake--thick. I think that the lemon syrup can be omitted as well. Does not add much to the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good cake but thought it could use some work. My husband and I found it to be a bit too lemony. With so many eggs, I should have known before making it that it would be like a pound cake in taste and texture. Next time I make this I will skip the lemon zest and lemon syrup and just use almond extract. I thought the syrup made it a little mushy in texture instead of moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I over baked mine a bit too long, darn it, but it was still very good. I will make in again and use it as my all time favorite lemon poppyseed cake. Thank you."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8164/moist-lemon-poppy-seed-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
"name": "Lemon Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8164/moist-lemon-poppy-seed-cake/",
"name": "Moist Lemon Poppy Seed Cake"
}
}
]
}
}
, "about": [
]
}
]