				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Moist, Tender Spice Cake"
,"datePublished": "2020-03-04T23:58:55.000-05:00"
,"dateModified": "2022-10-07T14:07:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "USA WEEKEND columnist Pam Anderson"
}
]
,"description": "This delicious homemade spice cake recipe includes ginger, cinnamon, nutmeg, allspice, and cloves. It&#39;s perfect for a picnic or a party!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/v0vqw_nS3Vs1bpUkxOyKPDrUdN0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2752654-157e1954df8a437ab5f56197ad646a58.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Moist, Tender Spice Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "206"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "275 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "67 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "222 mg"
,"sugarContent": "19 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.5 cups bleached all-purpose flour",
"0.25 cup cornstarch",
"4 teaspoons baking powder",
"2 teaspoons ground ginger",
"1 teaspoon ground cinnamon",
"0.5 teaspoon ground nutmeg",
"0.5 teaspoon ground allspice",
"0.5 teaspoon ground cloves",
"0.5 teaspoon salt",
"1 cup milk",
"3 large eggs",
"2 teaspoons vanilla extract",
"1 cup unsalted butter, softened until easily spreadable",
"2 cups dark brown sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Adjust the oven rack to the middle position; preheat the oven to 350 degrees F (175 degrees C). Grease and lightly flour a metal or disposable foil 9x13-inch pan."
} ,{
"@type": "HowToStep"
,"text": "Whisk flour, cornstarch, baking powder, ginger, cinnamon, nutmeg, allspice, cloves, and salt in a large bowl. Mix milk, eggs, and vanilla extract in a 2-cup measuring cup."
} ,{
"@type": "HowToStep"
,"text": "Beat softened butter into flour mixture in a large bowl with an electric mixer, first on low, then medium, until mixture forms pebble-sized pieces. Add about 1/3 of the milk mixture and beat on low until smooth. Add remaining milk mixture in two stages; beat on medium speed until batter is just smooth. Add brown sugar; beat until just incorporated, about 30 seconds. Pour batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes. Cool briefly on a wire rack, then run a table knife around the edges to loosen. Invert carefully onto a serving plate or cooling rack. Let cool completely."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like the recipe but doubled the amount of allspice and every spice on the list I added a little less ginger. My taste is such that the actual batter is less important to make a spice cake which is actually very spicy. Some people in my family thought the cake had too much spice but friends asked for thirds. I also added two tablespoons of molasses to the batter. You could add nuts if you like but the majority agreed this was better without nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I didn’t have a tray big enough so I ended up quartering all the ingredients. It was the tastiest spice cake I’ve ever had. The texture was like banana bread, with the perfect density and moistness. 10/10 will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lisa Hoffman"
},
"reviewBody": "the brown sugar does not mix well,, a big brown messy lumpy mess"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janice"
},
"reviewBody": "So dry, dense and not much flavor even with all the spices. Had high hopes. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "4khjqkssjt"
},
"reviewBody": "I followed the recipe exactly and it was the driest cake I have ever made. I was so disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jehrica Marini"
},
"reviewBody": "Scrumptious! Fall blessings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Unfortunately the cake was very dry and tasteless. I baked in a Bundt pan at 350 for 60 min vs the 75 that was suggested by another reviewer. Obviously this was even too long. Not sure if I’ll try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "Made this as a covid birthday cake since all the ingredients were basic so we didn’t have to go to the store. It was delicious!!! It’s been my birthday cake for two years now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maj Thibbs"
},
"reviewBody": "This is an amazing recipe. After reading the comments I made some slight adjustments. I too used the creaming method and I added two tbsp of olive oil. I topped it up with a coffee buttercream. Divine. My only criticism is that the ginger overpowered the other spices. Next time I will put less or increase the others. Overall this is a really great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Franny"
},
"reviewBody": "Very dry. Did not like at all. Won’t make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Whitney"
},
"reviewBody": "This cake tastes good but the texture and airyness of the cake is completely wrong. You will get a brick of thick dry as heck cake that while it tastes like the spice mix and is good, the ingredients surrounding it are not what you need for a cake. There is an unholy amount of cornstarch involved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Schultz"
},
"reviewBody": "In my Bundt pan it need 10 more minutes. I don’t own a mixer so it was a total old skool mix job. I will be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Fisher"
},
"reviewBody": "Delicious! I followed the other reviews for the order of mixing since they follow another cake recipe I got from my mother in law. Cream the butter and sugar. Add the other wet ingredients one at a time and mix well. Sift the dry ingredients and then add to wet mixture a little at a time. Next time I will also separate egg yolks so I can save the whites, beat them until form and then fold in once everything else is mixed well and see how that does. Very hearty cake. I made a basic buttercream frosting for it and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracee Okrainec"
},
"reviewBody": "I did cut this recipe in half, but it came out more like a quick bread than a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "(R.H.P)"
},
"reviewBody": "Very flavorful! What a wonderful change from boring old cake mixes.The lack of sweetness is also a welcome change. It isn't that it's not sweet it just doesn't reply on sugar to carry it. Trust me there are enough flavors going on in here and 2 cups of brown sugar are fine. The only exceptions I made were that I used goat's milk and I doubled the recipe. Oh, and I made a cream cheese and apple butter icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae Lovvorn"
},
"reviewBody": "This was a great recipe! Really flavorful. We had some yogurt whey to use up, so I replaced the milk with that, which worked great. Also made a glaze with melted orange ginger marmalade to pour over the top. This was yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SG"
},
"reviewBody": "It is not moist or tender, I am very disappointed with recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karebear"
},
"reviewBody": "Tasteless and hard as a brick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Salome"
},
"reviewBody": "Liked the cake, great blend of spices. Very unusual way of mixing which has to be changed to the traditional cream butter and sugar etc. When you add the milk mix to the flour it becomes glue and sticks to the beaters. It ran all the way up into the housing and I am sure the hand mixer is broken. Used two pans and added raisins to one because I like raisins. Frosted with a cooked carmel icing, YUM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YayYay"
},
"reviewBody": "I’ve made this recipe twice, both times with whole wheat flour. Seeing the negative comments about the method, the first time I followed typical cake-baking instructions and creamed the butter, sugar and eggs, etc., before adding the dry ingredients.\n\nToday, baking for just the two of us, I decided to follow the instructions as printed, with two exceptions: I used whole wheat flour and reduced the sugar by 1/2 cup.\n\nThe cake turned out amazing. Oh-my-goodness good. Perhaps because the sugar is added at the very last and barely mixed in, the cake develops a thin, delightful caramelized crust. Frosting or glazing not needed! Inside, the cake is tender and moist, the spices well-blended and popping on the taste buds.\n\nI will make this cake again, and, just for fun, try your method on other cakes. I’m thinking a lemon cake would be wonderful with that touch of caramelization on the top.\n\nThank you for a terrific recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kitchendiva"
},
"reviewBody": "The flavor is spot on. But even though I followed the recipe the cake still seemed dry and crumbly. I may play with it some as spice cake is a favorite and everyone liked the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "resy"
},
"reviewBody": "Perfect. It's hard to find a non applesauce spice cake recipe. Simple and quick. Turned out lovely"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cyle Davis"
},
"reviewBody": "I was very excited to make this cake. Im practicing for my boyfriends birthday next month and wanted to move away from the normal chocolate or vanilla cake. \nI think a spice cake will be great but I think I'm having some issues with this recipe. \nI followed all the steps but think I might of messed up somewhere. The taste of the cake is good but it came out dry. And even before baking it the batter seemed kind of thick to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "My family's favorite cake. Top with homemade butter cream frosting and cut small pieces - it's very rich. We omit the cloves (we don't like them) to no ill effect.\n\nThere is actually a reason for adding the ingredients in the order written. Adding the butter to the flour creates a tender, velvety crumb. It's a two-stage method used to create less gluten and thus a more tender, albeit denser, cake. If you are not following the instructions in the recipe, you are cheating yourself of all this cake can be. Remember that baking is chemistry, and you will get different results with different methods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eve Tebbets"
},
"reviewBody": "So good! We didn’t have the allspice so we substituted with slightly more spices to make up. We also topped ours with homemade whipped cream cheese icing! Delicious! Definitely recommend for the holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Cox-Benzine"
},
"reviewBody": "This cake is amazing. I baked it in a bundt pan &amp; topped it with a maple glaze after it was baked. I also substituted maple extract for vanilla extract in the batter. It was a huge hit with my family. I will definitely keep this as my go to spice cake recipe...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "m00n1130"
},
"reviewBody": "Taste was a little, very moist, but heavy. Don’t think it’s a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin Riti"
},
"reviewBody": "It was good, the taste was very good, but a little dry. I didn't realise how high it had risen, so cake was thick and should have added more icing. I'd make it again, but maybe add an extra egg to make it moist?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kit Willihnganz"
},
"reviewBody": "I made this cake in a rush and ignored the strange assembly instructions. I baked it in a bundt pan and poured a quick lemon glaze on top. Everyone loved it. The lemon was a perfect addition. My only complaint is that it was slightly too fluffy. I'm not sure what caused that, but I'm sure I'll make this cake again anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BILLYBOY35"
},
"reviewBody": "When, my 90 year old well traveled friend called and left a message that it’s the best spice cake she’s ever had, my heart swelled. I served it with good quality vanilla ice cream, although the cake can easily stand alone. Has kept well, and I think was better the second day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "This was delicious! Followed recipe exactly but didn’t add any mix ins of fruit or nuts. Frosted w a half batch of cream cheese frosting. Hubby has cancer and had a craving for spice cake. He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BumbleBee"
},
"reviewBody": "Dry. Even with cake strips around pans, the centers weren’t cooking well and the edges were crusting. Very very dry. There are better recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie S"
},
"reviewBody": "Due to the reviews who said that the cake was dense, even though many said it was moist, I did some things to make it more moist, such as use the egg yolk only for one egg and added may 1/4 cup sour cream. I also made it gluten-free and used gluten-free all purpose flour and added 1 tsp of xantham gum. It turned out amazing! My relatives had no idea it was gluten-free! I added a penuche frosting which is how my grandmother used to top this cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather13"
},
"reviewBody": "I have been seeking a homemade spice cake recipe to try to get away from a box mix. I tried this one, cupcake form, and thought it was tasty but a smidge sweet as I top with a homemade cream cheese icing. I will make again, and perhaps reduce the sugar in the mix. I'd like to taste more spice, less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Samantha Franceschi"
},
"reviewBody": "A little dense but tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steffina Pickett"
},
"reviewBody": "Turn out perfect, I trust all your recipes[ LOVE IT]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ianthe V."
},
"reviewBody": "I've made this twice now and both times I halved the recipe for a smaller cake. I creamed the butter and sugar together first to make the process easier and the second time around I only added 1 egg + 1 egg yolk for a denser cake. I really do like the flavors in this but I think it needs a little extra \"oomph\"--I added some ground cardamom and almond slivers the second time I made it and it came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colie CanDo"
},
"reviewBody": "Very moist. I followed the instructions but I did add plumped golden raisins for sweetness. Love this one. I baked in a glass dish and kept it in there for refrigerating later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "misroscoe"
},
"reviewBody": "Not bad. I think the corn starch made it a bit dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill"
},
"reviewBody": "I made this for my wife's birthday. I used fresh ground wheat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith DeLorenzo"
},
"reviewBody": "Very good blend of spices for this cake. I split this recipe in half and used 2 eggs. I baked this at 350 for an hour and it was done perfectly. Since I only made half the recipe, I poured it into a Bundt cake pan. It tore a little when I dropped it out of the pan onto a plate. It was more moist than the other spice cakes I've made from this site. During baking, my house smelled like the holiday season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Reece"
},
"reviewBody": "This is my all time favourite recipe I use all time since found it on here and now every family member loves it especially my grandchildren, if only I can find a low sugar icing for it though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Dann"
},
"reviewBody": "Used the spices in this to \"help\" a boxed cake mix and OMG we loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nick the baker"
},
"reviewBody": "The recipe may be good but 40 minutes is not enough time, and my oven is spot om om temperature. When I opened the oven after 40 minutes to test the bake with a toothpick the cake fell. It was far from done in the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Islay Lamb"
},
"reviewBody": "This was the method my mother used to make a lot of \"one-bowl\" cakes. Moist &amp; delicious, lovely with an afternoon cup of coffee or tea. I added 3/4 cup of chopped toasted walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "This cake has an excellent spice flavor, but I thought it was on the dry and crumbly side. I added a cup of plumped raisins that enhanced the flavor. I iced it with vanilla buttercream, which helped to make it more moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mommaofmany"
},
"reviewBody": "Simple recipe that cooked up perfectly. I just dusted it with powdered sugar and it was wonderful. Everyone at church thought it delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vintage American Male"
},
"reviewBody": "While the flavor of this cake is wonderful, and had a nice delicate crumb, I find it to be quite dry in texture. I baked it 5 minutes less than the time called for, as it tested done. I suspected this cake would be dry while I was preparing it, due to only using butter as a fat in the ingredients. I will make it again, but I will try adding 1/2 cup oil with the butter. I may also try using applesauce to give it more moisture. Otherwise I like the flavor, nice and spicy! Great with maple frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krpm"
},
"reviewBody": "Really good! Nice and moist, great flavor. I followed the recipe exactly. I put a thin layer of caramel frosting on top, which was good; but I agree that it would be delicious without frosting too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PCox58"
},
"reviewBody": "Best cake I've baked in a very long time! I will keep it handy. I agree with other comments: cream the butter, sugar, eggs, vanilla; add dry ingredients alternatively with milk. Also check for doneness after 30-35 min. We topped ours with a warm vanilla sauce over warm cake.. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynful"
},
"reviewBody": "I made it just as described and it turned out great. I wish it were more moist though and I think the addition of raisins would be wonderful. My only failing was trying to cook it in a bundt pan but it fell apart when taking it out. I'd definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ana Rae"
},
"reviewBody": "I made it exactly as directed and it came out dry. Flavor was good but by day 2 it was almost too dry except for icing on it. I will remake and try adding some oil or applesauce to improve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peg"
},
"reviewBody": "Pretty good cake! I never made a spice cake before, and I was pretty pleased how it turned out, especially because I made it with gluten-free flour. Better the day it's baked than left over, but I would credit the g-f flour for that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Sekel"
},
"reviewBody": "I made this recipe last weekend. I basically put all the wet ingredients in 1 bowl, the dry ingredients in a second bowl. Slowly added the dry to the wet and it turned out beautifully. Walnuts are an option with this recipe but remember, spice cake isn't for everyone. Loved this recipe. Adding it to my recipe cards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MicheleB"
},
"reviewBody": "This cake is so easy to make. So delish.....the spices are just perfect. Didn't have any problem adding the brown sugar like some other reviewers had. I also didn't have dark brown sugar, only light brown sugar on hand. Now this cake was wonderfully soft and moist when it came out of the oven, couldn't wait to take a small piece of It! ( my friend tasted it and her eyes rolled back in a food-satisfying omg )! I made a homemade cream cheese frosting for it. Well you have to refridgerate cream cheese frosting. The cake became \"heavy\" like. I do not know why. You don't really need to frost it, it's good without frosting. Next time no frosting no fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dora"
},
"reviewBody": "I made this cake twice in one day--although I used spray Pam on the Bundt pan, the first cake was partly stuck in the pan so that one was for me and my husband. The second cake came out perfectly. I followed the directions except I creamed the butter and sugar before adding the wet ingredients and then added everything to the dry ingredients. Although this cake smelled great while baking, it came out pretty dry even though I baked it for 60 minutes at 350 degrees. My husband liked it and I will help eat it but it was not the best spice cake I have made and eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Shaw Lapish"
},
"reviewBody": "This is my go-to potluck recipe! It is a huge hit every time, and it's super easy to get right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "Super easy and amazing taste. Very moist the first day. Seemed to dry quickly. Though it wasn't around in my kitchen for a but three days. My husband and daughter loved this cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "moonstruckgirl"
},
"reviewBody": "The flavor was good but the cake texture was dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Thilver"
},
"reviewBody": "Dense, chalky, dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Schnackenberg Odier"
},
"reviewBody": "Delicious cake. I wouldn't change a thing about this recipe; it's perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SugarHigh"
},
"reviewBody": "I'm not sure how I feel about this recipe. I like it, but I don't think I would call it a cake, it's much too dense. It's more like a muffin or loaf recipe. The spices are alright. I prefer more of a kick in my stuff so perhaps I might use some candied ginger or cracked black pepper next time I make it. It definitely needs something inside or on top of it. Although my family loved this, we all agreed that it was lacking. \n\nI feel like diced plums, dates, or raisins and nuts could work well in this recipe, maybe even slices of apple. Or some kind of glaze on top. I might try adding a little applesauce to moisten it up next time, too. Overall, I think it could be a good recipe to adapt for other uses, just not a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "It was boring and had no taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "weliz"
},
"reviewBody": "Hmmm. I wanted to love this. Despite other reviews I made it exactly as written just to see. It was ok. Decent flavor, but I was really craving a moist texture. As written, this was more like a dry muffin than a moist cake. Not bad, but I'll keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "laceyworks"
},
"reviewBody": "I reduced the servings to 4, omitted the cloves and used a whole egg. I baked it in 2 - 3x5 mini loaf tins for approximately 30-35 minutes. I creamed the butter &amp; sugar then added the egg &amp; vanilla. Combined the dry ingredients then alternated adding dry ingredients &amp; milk to the butter/sugar/egg mixture. To measure my flour I spooned it into my measuring cup then leveled it off. The cake was very moist! I didn't think it had a very distinct spice flavor, my husband liked it though. I used a Brown Butter Brown Sugar Frosting, which pairs really well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cynthia"
},
"reviewBody": "This was my first attempt at a spice cake. I combined the ingredients the \"traditional way\" as per other reviewers. I also added some walnuts and topped it with powdered sugar. Oh my gosh, it was delicious. Thank you very much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "Fell 3 out of 5 times"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lizajane"
},
"reviewBody": "I made this cake twice in one day. First time I followed the recipe exactly except I forget to add the baking powder to the dry ingredients, so I added it to the completed batter. \nAfter that one finished baking, I made another and this time read the reviews. I followed the standard cake formula this time (cream, then alternate wet and dry) and adjusted the spices a touch (1 1/2 t. ginger, scant 1/2 t. nutmeg, rounded 1/2 t. allspice.) I didn't add the applesauce because it seemed plenty moist. \nBoth had the scratch cake texture with a significant crumb, although the second was finer. I never take a 9 x 13 cake out of the pan, so I didn't get the cracking that others did.\nI topped both cakes with one recipe of Scrumptious Penuche Frosting (from this site). \nI prefer the standard preparation method. As written was innovative, but like other reviewers, I got pockets of brown sugar. Because that one had already been relegated for home consumption, that didn't bother me much. Both cakes had a slight depression in the center, possibly from checking doneness too early (although at the listed time.) The spice mix of the first cake mellowed overnight, so I am not certain it needed changing.\nTasty cake. I won't get rid of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linlyrobin "
},
"reviewBody": "I decided too make it an upsidedown cake, I had canned pears and peaches...melted 1stick butter, added one cup dark brown sugar, poured that mixture into the pan lined up the fruit in that put the cake on top...bake, no frosting but a nice sweet topper. I'll put a picture up later. Whipped cream on top...yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "This is a keeper. I have tried a lot of scratch spice cakes but this is the best. It's a moist, dense cake and with cream cheese frosting it's delightful. I only make half a recipe for the two of us, in a 9x9 pan and bake about 30 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sophie"
},
"reviewBody": "Cooked it in a round releasable cake tin- when I went to release the cake it split up the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AuntE"
},
"reviewBody": "Yummy flavor, def. opportunities to increase the spice flavor. I did add a little extra of all spices. Moist cake, cooking time is right on. I made cream cheese frosting and it was a perfect compliment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy R"
},
"reviewBody": "This cake got rave reviews from all of our dinner guests - used the exact recipe amounts as stated but followed a more traditional method for combining them. I baked for 45 minutes in a bundt pan and it turned out perfectly! A delicious thin crunchy crust and very soft in the middle. Loved the spice combination! I served it dusted with powdered sugar and topped with fresh whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Michael Shea"
},
"reviewBody": "This was such a hit at a barbeque picnic I went to a couple of weeks ago. My friends could not stop reacting in ecstasy! LOL! Many said it was the best cake they've ever had. I was extremely impressed as well. I did tweak it a bit; I added a 1/2 cup of applesauce like some commenters did, and used the traditional creaming method for cakes. I also added some cardamom; I have a huge jar of it and need to use it! I also used Earth Balance spread instead of butter(me and a friend have issues with dairy).I frosted it with a maple buttercream, also using Earth Balance and real maple syrup, and sprinkled it with chopped pecans. YUM! In fact a couple of friends demanded I make it for Thanksgiving. 'Oh twist my arm\"....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer McMorrow"
},
"reviewBody": "I made this cake as cupcakes and it turned out great! My differences: doubled cinnamon, allspice and nutmeg; did not use ginger or cloves. I used the usual creaming method when mixing. They came out nice and moist and held together really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "wendee"
},
"reviewBody": "Not so moist. I made this twice as I thought I must have messed up the first time. Both times the batter was very thick and did not pour into the pan..it was close to cookie dough not cake batter. Tasted good but very dry and crumbly. Maybe the wet to dry ratios.need.adjusting. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tony Salazar"
},
"reviewBody": "This turned out to be one of the worst cakes I've ever made. It was too easy to over-beat the batter, which caused it to not rise. And adding in the brown sugar last led to pockets where the sugar stuck together and created brown sugar craters. I wasn't crazy about the flavor, either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MeganVictoria"
},
"reviewBody": "Please add applesauce and make it two eggs instead of three! The original recipe is very DRY!!! The taste is amazing and goes very well with cream cheese frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "colleen"
},
"reviewBody": "There is one problem with this cake....its the corn starch....I have no idea what the purpose of corn starch serves...this is why the cake turns out so dry..I omitted the corn starch..I also used 1/2 cup of butter and a 1/2 cup of oil... I used 2 tsp of baking powder and 1 tsp of baking soda.. And of course mix all the wet ingredients but not the milk, then the dry ingredients.... alternating adding the dry ingredients to the wet ingredients with the milk..with these changes this cake is a 5 star!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Murielle"
},
"reviewBody": "Smells in my kitchen are amazing.\nI used organic in bleached flour\nIt's taking at least 15 min more to bake\nBut by the look and smell my family will be raving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "W001324"
},
"reviewBody": "Really good spice cake. I baked it in a bundt pan and drizzled lemon confectioners icing on it for my brother's BD. I also followed my usual cake mixing steps; less complicated and less dishes than the way recommended in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Olive"
},
"reviewBody": "I would cut down on the ginger and the nutmeg if I were to make this again. It was just too strong of a spice flavor for my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosanne"
},
"reviewBody": "This is great even better with nuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "New Jersey"
},
"reviewBody": "Anything but moist\nThe combination of spices in this cake was good but nut not up to the level needed for pronounced spice flavors and aromas. When making a 'spice' cake, we don't want to think timid. We want bold flavors.\nSo this recipe fell short in the flavor category. \nSecondly, although we followed the recipe to the letter, the cake did not come out moist. If we were to try this again, we would replace the butter with vegetable oil to try improving the inherent moisture level. \nAs one other reviewed pointed out, the method for combining the ingredients was contrary to most traditional 'cream the butter and sugar' as the foundation for mixing additional ingredients. Not sure if the mixing method the author proposed contributed to the lack of moisture or if that is attributed to using butter as the only fat in the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candice Ring"
},
"reviewBody": "This was very good, and very easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kayla"
},
"reviewBody": "I think the flavor and the moistness were quite good, but I did add 3c shredded apples. I made this recipe after studying for several hours- so I was more than a little lazy. I mixed the wet and dry ingredients per instructions, beat in the butter til it was barely mixed, and then dumped in all wet ingredients at once. When that was barely mixed I added all the apples and sugar. noms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goonessa"
},
"reviewBody": "This was a huge hit. Made two cakes for a birthday and almost all of it was gone. Would like it a little more moist for my preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dvargas76"
},
"reviewBody": "This recipe was absolutely perfect the way it was. I did not try the alterations suggested by other reviewers and so glad that I didn't. The cake was absolutely perfect the way it was and only needed a dusting of confectioner's sugar to complete it. The cake reminds me very much of old fashioned ginger cake that we make at Rocky Mount, TN Living History Museum. Sure, alterations would probably go very well with it, but sometimes simplicity takes the cake. Punny intended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "Weirdest recipe ever. I knew it didn't seem right to do the steps in the order listed but I followed the recipe to a T. The batter was so thick it made my mixer smoke and I followed the steps adding 1/3 at a time. Anyways the flavor is GREAT. The only reason I am giving it 3 stars, but the cake came out a crumbly mess and was done after only 33 minutes. I won't use this recipe again but I will make note of the spices used. Hoping the frosting holds the cake together enough to eat it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "eilwabbit"
},
"reviewBody": "This recipe needed a lot of alteration to make it work. Chiefly, it was far too dry as batter. I added 2/3 cup of sour cream for moisture retention and an extra half cup of half-and-half cream (totaling 1.5 cups half and half, instead of milk). I baked it at 325F instead of 350 and lined my baking tins fully (sides and bottom) with parchment/greaseproof paper. If you are baking this in one pan, 350 is far too hot unless you cover it for most of the baking time. It will catch the edges far before the middle bakes through. If you are using two 9\" pans, it seems to work better, but still, 325 was safer rather than 350. The sides were well baked before the center was, even at a lower temperature. 3 tsp of baking soda was more than enough; it started to taste metallic, so I didn't go up to 4. \n\nAlso, don't wait until the last minute to mix your brown sugar; you need the agitation to remove any clumps of sugar and that will make the flour glutenous (tough and dry) if you wait until the last step. Cream the sugar with the butter until it lightens in color (whiped air into it) so there is air in your batter for a good rise and even bubble pockets. The directions on this recipe are the \"biscuit\" method of mixing, which yields crumbly baked goods with large air pockets and dense clusters. \n\nWith 50% more liquid and 2/3c sour cream, it was about as moist as a box mix ever is. I can understand why this would have gone crumbly if you followed the directions exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amy Ravenscraft"
},
"reviewBody": "The name of this cake lies ... this was THE most dry cake I have ever eaten. The spice mix was good, but it was so dry that it just crumbled. Aside from the odd way of combining the ingredients, there is way to much flour, cornstarch, and baking powder. If I were to make this again, which I won't I would only use 2 cups of flour, no corn starch and half the amount of baking powder. The batter is stiff and the cake doesn't rise much. I gave an extra star for the spice mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GMSx2"
},
"reviewBody": "This cake came out flat and barely spiced, disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gizo101"
},
"reviewBody": "Very delicious and moist cake. I like the fact that it's plain so you could touch it up if you want. The way of mixing the ingredients is strange but it works and it makes lovely results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LexL"
},
"reviewBody": "This spice cake is delicious &amp; moist! Yeah the method is unconventional so I ignored it &amp; used the traditional cake method. But that's no reason to down rate the recipe, especially if you know ahead of time that you're just going to make it your way &amp; not the way that's stated. I can't speak for others, but when I search for a recipe it is because I wish to find a combination of ingredients &amp; the amount of those ingredients so I can make something that tastes good. I made this as listed for a 2 layer birthday cake for someone who requested a spice cake, as it is her favorite. She loved it so I was happy. Plus, I loved it too when I had a piece. The only thing I would do different next time is use less ginger but that's b/c I'm not crazy about ginger. And next time is tomorrow when I make this for a birthday cake for my sister."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "schai3"
},
"reviewBody": "I ended up throwing out the entire cake. I am an intermediate level baker- so I did cream the butter and sugar together with the egg mixture but the cake was so dry, I was not able to get it out of the pan in one piece. The spice combination was quite lovely but the batter mixture is very dense and the final product tastes more like flour than the spices. I used a 9x13- there is way too much batter for just one 9x13. If I were to make this cake again (which I probably will not) I would reduce the flour by 1/2 cup and use a bundt pan for baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KO33"
},
"reviewBody": "I added the applesauce and kept the dry/wet ingredients separate until the end, as recommended in the reviews, and the cake was moist and not crumbly. HOWEVER, I did expect more of a light and fluffy spice cake, which is not what this is. The cake must have weighed 5 lbs when it was done! It is a dense, dense, dense cake, and the heaviness of it takes away from any flavor. I would not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa"
},
"reviewBody": "Awesome recipe! didn't made any changes at all. Tasty, fluffy yummy cake, my daughter used it for a baptism cake....we all went speechless. Thanks for the recipe!."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "This was a GREAT recipe! After reading the ingredients (especially noting the amount of cornstarch) and a few of the reviews complaining that this was a dry cake I added an extra 1/4 - 1/3C of milk. I made cupcakes, I baked them for 21 minutes and they were SO GOOD! I filled them with caramel and topped them with cream cheese frosting and a little bit of brown sugar. everyone went nuts for these - i will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eurekamarika"
},
"reviewBody": "I made this exactly as directed and it turned out great! I would definitely add nuts next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76964/moist-tender-spice-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/396/desserts/cakes/spice-cake/",
"name": "Spice Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76964/moist-tender-spice-cake/",
"name": "Moist, Tender Spice Cake"
}
}
]
}
}
, "about": [
]
}
]