				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "&#39;Momma Made Em&#39; Chicken and Sausage Gumbo"
,"datePublished": "2018-06-08T09:54:00.000-04:00"
,"dateModified": "2022-10-20T01:19:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BelleTeteRouge"
,"url": "https://www.allrecipes.com/cook/1093474"
}
]
,"description": "Chicken, sausage, and okra gumbo made from scratch the old-school way, with a deep, rich roux and plenty of time for simmering."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YrL0EyuXt9sNby_byW-58Hie-c8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1658100-momma-made-em-chicken-and-sausage-gumbo-Nikki-Mose-4x3-1-766f36faf277408da3d87610658ab1b7.jpg",
"height": 600,
"width": 800
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "&#39;Momma Made Em&#39; Chicken and Sausage Gumbo"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "50"
}
,"cookTime": "PT195M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "437 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "67 mg"
,"fiberContent": "3 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "835 mg"
,"sugarContent": "3 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (3 pound) whole chicken",
"0.5 cup all-purpose flour",
"0.5 cup vegetable oil",
"1 (10 ounce) package frozen chopped onions",
"1 (10 ounce) package frozen green bell peppers",
"5 stalks celery, finely chopped",
"1 tablespoon Cajun seasoning (such as Tony Chachere's), or to taste",
"2 whole bay leaves",
"1 (28 ounce) can diced tomatoes",
"1 pound fully-cooked smoked beef sausage (such as Hillshire Farm®), sliced",
"1 (10 ounce) package frozen sliced okra",
"salt and black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot partially with lightly salted water, and place the chicken in the pot. Bring to a boil, reduce the heat to a simmer, and cook the chicken until the meat is no longer pink and the juices run clear, about 1 hour. Remove the chicken from the broth, and crack open the carcass to allow the chicken to cool. Reserve the chicken broth. After the chicken has cooled enough to handle, pick the meat from the bones, and set aside."
} ,{
"@type": "HowToStep"
,"text": "While the chicken is simmering, make a roux by whisking together the flour and vegetable oil in a large, heavy saucepan over medium-low heat. Cook and stir the mixture, watching constantly to avoid burning, until the roux is a rich chocolate brown color, 20 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "As soon as the roux has reached the desired color, stir in the onions, bell peppers, celery, Cajun seasoning, and bay leaves, and simmer, stirring occasionally, until the vegetables are tender, about 45 minutes. Pour in the reserved chicken broth, diced tomatoes, and beef sausage, and simmer, stirring occasionally, until the mixture has thickened, about 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Mix in the reserved chicken meat and okra, bring back to a simmer, and cook, stirring occasionally, until the okra is tender and the flavors have blended, 30 to 40 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT235M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Louiselouise"
},
"reviewBody": "I added a little bit more ingredients for flavor but it taste great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ4OSU"
},
"reviewBody": "Good recipe. I did add some extra spice and hot sauce, but that's because we like spicy food. I also added some shrimp in the last few mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamela Westfield"
},
"reviewBody": "I been making this for years and put a little extra on my recipe this time and loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephie"
},
"reviewBody": "I cooked this with fresh ingredients instead of frozen. I used approx. 5 tomatoes, 1 onion, 1 bell pepper, 1 large chicken breast, 1 package of Veron Andouille sausage, and 1 pound of fresh okra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HotSpicyCrab"
},
"reviewBody": "Truly easy, excellent flavor infusion. I had to force myself to freeze at least two contains because this dish became the only thing my spirit craved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Ramsdell"
},
"reviewBody": "This is my current favorite recipe! I have made it 7 times in the last 2 months. I skipped the bell peppers the first few times(and it was fine) but then tried the recipe as written and it was oh so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Savage"
},
"reviewBody": "I admit I am a Northerner and don't have a whole lot of experience with gumbo, but I found this recipe delicious. I didn't have time to make it a day ahead, and I'm sure it will be even better tomorrow. I am thankful this recipe does not call for file powder. I have no idea what that is and I can't get it locally. Okra will grow up here, and the only place I can get it is in my garden. I used all fresh veggies this time, but I am looking forward to being able to use the okra I am putting up in the freezer. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bonnie L Parker Bailey"
},
"reviewBody": "I made it as the recipe says, I should have cut the cajun spice in half ~ too much for me .... really great though it tasted great until I over spiced it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Msvin"
},
"reviewBody": "This is my go-to recipe. The first few times I made it, I made it exactly as written, but now I change it up (always referring to this recipe as a guide for amounts). I use bacon grease or butter in the roux, and I vary the meats. The recipe calls for a total of four pounds of meat, so I usually use two pounds of chicken, a pound of Eckrich smoked sausage, and a pound of shrimp. Sometimes, after Thanksgiving I make it with the leftover ham, leftover turkey, and shrimp. I always use frozen veggies (Kroger sells mirepoix and sliced okra) unless I have fresh ones that need to be used. I usually make my own broth with a whole chicken or bone-in chicken breasts, but if I’m in a hurry or feeling lazy, I use a rotisserie chicken and canned broth. It’s always good, no matter how I vary it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Doby"
},
"reviewBody": "Good gumbo recipe! Think they meant 3 pounds of chicken meat from whole chicken, can't really find a 3 pound whole chicken. Substituted home made Elk sausage for Andouille and it worked great. Will use slightly more roux next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Taylor"
},
"reviewBody": "This recipe is wonderful just the wonderful just the way it is. I am from Louisiana where gumbo is a cultural norm as a food eaten and learned from generation to generation. Of course it does not matter where you are from you will do things a little different so be mindful and rate fairly not because where you are from everything has to be fresh. The frozen okra works great in this recipe. I am a big fan of this one and will use it more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHAWKINS2001"
},
"reviewBody": "This was a really good gumbo. My family loved it. I will definitely make it again. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksmith"
},
"reviewBody": "Great recipe! I love your later posting to \"use what you got and don't burn the roux and it will be all good\". Life lesson, I think. \nTo cut down on the cooking time, I would suggest sweating the trinity first. My method was to cook the sausage in a little butter, then add the bell pepper, celery, onion and garlic and cook until soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joyousfreee"
},
"reviewBody": "You can't \"simmer\" veggies in roux for 45 minutes without adding liquid. I made some common sense corrections to this recipe, and used fresh everything except for frozen okra, and we liked it that way. My spices (I never use pre-mixed): 1/2 tsp each thyme, paprika, cayenne pepper, black pepper; 1 tsp oregano; 1 Tbsp. chopped garlic; 2 Tbsp. Worcestershire sauce. I made the roux from butter, and it was done to my liking in 20 minutes (a little darker than chocolate milk). Thanks for posting this recipe, it was a very good base to start with!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EmmLee"
},
"reviewBody": "Very good base recipe for gumbo. I always make mine with shrimp, chicken and andouille - and ALWAYS sliced okra. I use chicken thighs to make my broth, and add my family's homemade blackening seasoning. Since I use shrimp (you can also add crab meat or oysters or crawfish), I also add Old Bay seasoning to taste. BIG TIP: definitely cook the roux until it's either the color of milk chocolate, or at least a deep reddish brown. If you see black flakes in it, it's burnt and you have to start over. Also, it's really important to cook the gumbo for at least a half-hour after adding the okra, so it loses that slimy/stringy aspect that makes a lot of people dislike it. Also, LOVE that you didn't add file powder to a recipe with okra. I see this a lot and YUCK!!! But I do know some that like to sprinkle a bit on top for flavor before eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BelleTeteRouge"
},
"reviewBody": "All, I do not know how to edit the recipe, but please use whatever sausage you like. Personally, I am not a huge fan of Andouille (even though it is more authentic) so I use my favorite. Thank you all for your reviews and comments! Everything on this recipe can be to taste. I now have to use fresh onion, celery &amp; bell pepper because I cannot find it frozen here in Dallas. Just work with what you have, make sure to not burn the roux and it should all be good! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmmoureau24"
},
"reviewBody": "Made just how recipe said and turned out great!! Definately going into my rotation from now on! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scavenger86"
},
"reviewBody": "Extremely tasty, plus it can feed an army, especially when served over rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBINBRADY"
},
"reviewBody": "This was delicious and easy. Great served over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is for GLORIA. You used a rotisserie chicken, fine, but you have to READ the instructions and remember you were supposed to cook raw chicken ia a lot of WATER that became the BROTH for your gumbo, not a little can of broth. You always add veggies to the ROUX to brown first in making gumbo, THEN you add the 2 quarts or so of broth you were supposed to cook the chicken in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gfspencer"
},
"reviewBody": "This is for GLORIA. You used a rotisserie chicken, fine, but you have to READ the instructions and remember you were supposed to cook raw chicken ia a lot of WATER that became the BROTH for your gumbo, not a little can of broth. You always add veggies to the ROUX to brown first in making gumbo, THEN you add the 2 quarts or so of broth you were supposed to cook the chicken in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "raginhoops"
},
"reviewBody": "Ok, \none can use canola oil as well as butter to make the roux. pre cut the onions, celery, bell peppers. At the magic moment that the roux looks like a dark peanut butter, add the onions to cool it quickly and stop it from burning. carmelize then add the rest of the trinity. add water after this is cooked a bit then add the chicken. OUr family cooks the chicken with the bones to add more flavor. We also crack an egg for each person into the end of the cooking or serve the gumbo with rice and potatoe salad in the gumbo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suellen"
},
"reviewBody": "ONLY one word for this AWESOME Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cyndy Blackledge Bauers"
},
"reviewBody": "This was a great base recipe for gumbo. The beauty of making gumbo is that you can make it all your own. I PERSONALLY would NEVER make gumbo with anything other than andoullie sausage and if you want to serve some really authentic gumbo try serving over potato salad instead of rice. The tomato's are strictly for a creole style gumbo and NOT a cajun gumbo so I never use them either. Have fun and experiment with things. It's hard to mess up gumbo when you have a great roux."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeniwebster"
},
"reviewBody": "So good. I used jalapeno sausage and fresh okra. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MangoTango"
},
"reviewBody": "Oooh, yum! I miss gumbo and jambalaya here in Mozambique, but I am able to find most of these ingred. here (except I brought my own cajun seas. from the U.S.) so I made this and even the locals who are helping us here love this. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan G. Hamilton"
},
"reviewBody": "Beutiful recipe for a Gumbo beginner or someone short on time! Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jullum"
},
"reviewBody": "I loved this, though the rest of the family (3 kids and husband) not so enthusiastic. I loved the flavor. Actually didn't use the chicken. Used all fresh vegetables. Next time I might actually leave out the sausage - I thought it was great without it and don't need the calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joshua F"
},
"reviewBody": "Just made this today. I uploaded a photo, great recipe. i subbed for fresh veggies, plus some tabasco and thyme. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenvan"
},
"reviewBody": "Oh yum, yum, yum yum! It took quite a while to make, but is very yummy! Here are my changes: First I chopped the sausage and cooked it in a skillet, reserving the grease in a measuring cup. I then cooked the chopped peppers, onions, and celery in the same pan until soft, the placed in a separate bowl. Next I cooked bacon to render the fat and poured the fat into the measuring cup until it reached 1/2. After removing the bacon, I poured back into the skillet the grease and flour and cooked to make roux for 20 minutes. While that was cooking, I cooked 8 chicken thighs in a stock pot with one small can of chicken broth. I removed the thighs when done, then cut them into pieces and put with the sausage and vegie mixture. When the roux was ready, I poured the chicken broth into the roux and stirred, then added the meat and vegie mixture. I added Zateran's creole seasoning to taste. I did not have the okra, so I added one can of red beans and a bit of corn for color. Stir well and serve!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleen"
},
"reviewBody": "OH MY GOODNESS! This is yummy and I don't even really like gumbo. I used all fresh veggies - the okra came from a friend's garden. I didn't put in the tomatoes because my son won't touch it then. Substituted a rotisserie chicken and added garlic, a tablespoon of Worcheshire, a squirt of tabasco and some thyme. Yep, this is a do over!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ktorrado"
},
"reviewBody": "Awesome dish. I changed it a little bit. First, I only used fresh vegetables, including the tomatoes. I used chicken breast and turkey sausage. I also added a little bit of sherry. It was excellent!!! Thanks for the recipe, I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TashaM"
},
"reviewBody": "This was so easy to make and tasted great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosebud"
},
"reviewBody": "This was great!!!! It takes time and you have to be patient when making the roux, but it is well worth it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "My husband thought this was very good! For convenience, I used a rotisserie chicken with chicken broth. The only real changes I made was in step 3. Adding the vegetables to the roux without any liquid did not make sense to me. It was too dry so I added a can of chicken broth and let it simmer. However, I don't know why everything could not just be dumped into the pot and let simmer together. Good flavor. Next time, I will use bacon grease instead of oil for more flavor and certainly fresh vegetables when in season. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "seejayman420"
},
"reviewBody": "Made this dish tonite, but added shrimp, and andoullie sausage and had to add some extra hot sauce to make it authentic like down south spice. Very good recipe though, thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sunny D Shines"
},
"reviewBody": "Down in South Louisiana we do tings a lil dif'rent Sha! We NEVER use a prepared creole or cajun seasoning mix. We ONLY use Andouille sausage &amp; to make the roux we use bacon fat or butter NOT oil. Our TRINITY veggies are always fresh, NOT FROZEN, and a CAST IRON DUTCH OVEN is a MUST to cook in. Dar ya go Sha, try it dis way n you will dance!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathy b. in the house"
},
"reviewBody": "Very yummy. I skipped the chicken and used grilled spicy chicken sausage and fresh okra and tomatoes from my garden. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gary"
},
"reviewBody": "Good gumbo recipe. I used fresh veggies and my own seasonings (cayenne, oregano, thyme, etc.). I also recommend using andouille sausage and searing it in a pan before adding it to the pot. Also, saute the okra to \"de-slime\" before adding to the pot. Lastly, making it a day in advance is a great idea for any gumbo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "matthan"
},
"reviewBody": "I saw no one had reviewed this and just had to give credit where credit is due. THIS IS SOOOOOO GOOOOOOD!! made it last night, didn't have any onions (oops) so i had to use onion powder. also subbed creole seasoning and cayenne for cajun seasoning. Doesn't really take very long (as gumbo goes) so thats a plus. my wife is from the south (US)and said it was as good as any she had ever had. Maybe she was just being nice, but still, 5 stars, man."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/200618/momma-made-em-chicken-and-sausage-gumbo/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
"name": "Gumbo Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/200618/momma-made-em-chicken-and-sausage-gumbo/",
"name": "&#39;Momma Made Em&#39; Chicken and Sausage Gumbo"
}
}
]
}
}
, "about": [
]
}
]