				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mom&#39;s Turkey Sausage Patties"
,"datePublished": "2019-04-02T02:46:53.000-04:00"
,"dateModified": "2022-09-22T13:04:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ms A"
,"url": "https://www.allrecipes.com/cook/1171778"
}
]
,"description": "This easy recipe for turkey sausage patties adds ground ginger, sage, and cayenne pepper to make breakfast extra tasty. Great with pancakes and eggs!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/kW_Jwi2HYAN-8gXv4vrMrh2k6lI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7776192-3ce7c2d6d41547a096f295f84a10d668.jpg",
"height": 1504,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mom&#39;s Turkey Sausage Patties"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "403"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "169 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "84 mg"
,"fiberContent": "0 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "500 mg"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 pounds ground turkey",
"1.5 teaspoons ground black pepper",
"1.5 teaspoons salt",
"1 teaspoon dried sage",
"0.75 teaspoon ground ginger",
"0.25 teaspoon cayenne pepper",
"nonstick cooking spray" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix ground turkey, black pepper, salt, sage, ginger, and cayenne pepper together in a large bowl until well blended. Form mixture into 8 equal-sized patties."
} ,{
"@type": "HowToStep"
,"text": "Heat a skillet over medium-high heat; coat with nonstick spray."
} ,{
"@type": "HowToStep"
,"text": "Add patties and fry until browned on both sides and no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "Loved it! Add applesauce for more moisture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lenochka14"
},
"reviewBody": "Mixed in a bit of leftover ground pork to cut through the dryness of the turkey. So great!! Very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carli"
},
"reviewBody": "This was really good! But next time, I'll add the maple syrup as one reviewer suggested and I'll lessen the Cayenne Pepper bc my stomach doesn't like spicy foods. But overall this recipe is good. One reviewer said hers turned out dry. I think she over mixed it and don't press the meat too hard. Mix but massage lightly. I will make more of this sausages! Yay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAMMABELLE"
},
"reviewBody": "Doubled the spices except for salt which I increased to just 2 teaspoons. We love it. Used it for the Tater Tot Breakfast Casserole, on this site. Came out delicious. The extra was made into patties, vacuumed and frozen. This is safe for our child on ketogenic diet. He loved it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaC108"
},
"reviewBody": "This is a tasty recipe. I used fresh grated ginger and added a bit of nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunruh"
},
"reviewBody": "Easy and delicious! Like others I double the spices and the sausage was perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "This was a great base recipe. As others suggested, I did increase the amount of seasonings, except the salt. I love sage so I added almost a tablespoon of it. I grated one half of an apple for additional moisture, and also added some red pepper flakes for spice es’s. It is incredibly juicy and a little e kick of heat. I made 3 oz. patties, partially cooked them (since the meat had already been frozen and defrosted) and froze them on a cookie sheet. Put frozen patties in freezer bag and you have sausage patties for a quick breakfast or dinner. I plan on finishing some on the grill in place of hamburger patties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billybobtx"
},
"reviewBody": "I made the recipe using 1 lb. of ground 85% turkey. Turkey breast would be too dry. With the exception of the salt I doubled the spices (because of 1lb turkey) and added thyme and regular syrup. Instead of cayenne I added red pepper flakes. Very nice. Very good flavors. I will freeze the left over six patties having three with fried egg. Nice touch is that the sausage flavors add to the egg when fried in the same canola oil. I followed one persons recommendation and premixed the spices in a bowl. I think the flavors melded better that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie"
},
"reviewBody": "Great and so easy! I doubled the sage and would decrease the salt next time by 1/3. I used paprika instead of cayenne and accidentally doubled it (since I was doing a half recipe but used 1/4 tsp)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gabby7901"
},
"reviewBody": "Tastes NOTHING like sausage. I'm going to make biscuits and gravy, and add double the spices to the meat again before making gravy to hopefully get a resemblance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "I was in the mood for sausage this morning. My husband and I are avoiding the nitrites in processed meat but I remembered seeing this recipe in an email fromAllrecipes. This was very easy to put together. I keep ground turkey in the freezer, and all ingredients were standard in my cabinet. I did have the heat a tad high at first (6 out of 10 on an electric stove) so the outsides browned too fast, had to cut into every patty to get the inside to cook after I turned the heat down to 4. I would say the flavor was a bit milder than commercial sausage though with more “heat;” my husband said they had normal flavor and no heat - but he had dumped hot salsa all over his eggs! I am definitely keeping this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Lyvers"
},
"reviewBody": "Great recipe! I would have never thought to use ground ginger in this. I too doubled the spices which added so much flavor but I will have to cut back on the cayenne next time as my boyfriend is a little sensitive to the kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Indigo Iindigo"
},
"reviewBody": "Wonderful although I like my sausage a little on the sage-y side and I added a little garlic and onion powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Bergman"
},
"reviewBody": "Great recipe! I didn’t have ground ginger but I did have fresh. I highly recommend using ground turkey that has a bit of dark meat so they don’t dry out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahni Campbell"
},
"reviewBody": "I doubled the spices and added extra fennel. Very spicey"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Golden"
},
"reviewBody": "Delish! I’ll admit, I didn’t measure any seasonings but I’m pretty good at eye balling. I used 1 package of ground turkey and the called-for spices, thus doubling the spices in proportion to the turkey. For the ginger, I get fresh ginger and peel it, then throw it in the freezer. It’s then easy to shred while frozen! Using fresh makes such a huge difference. I used dried sage, and wish I would have done a bit more, and skipped the cayenne as my daughter is incredibly sensitive to spice. We’re having it for dinner, topped with a homemade cranberry sauce (1 bag fresh cranberries and 1 can frozen apple juice concentrate, simmered until cranberries are just able to be squeezed into bursting). Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lakisha Gilbert"
},
"reviewBody": "Used recipe with 1 pound of chicken, 1 teaspoon of salt, and added one small apple (finely chopped by food processor) to add sweetness and moisture. SO GOOD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teena702"
},
"reviewBody": "This is a great recipe. Tastes so good! I followed all ingredients listed. I did add a touch more of all ingredients. My kids love it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth ***"
},
"reviewBody": "the spice combination was spot on; never would have thought of it myself, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Based on the comments, I used the same amount of ingredients on only 1 lb of turkey and I added a half Tablespoon of maple syrup. They were fantastic! Taste just like sausage and maybe a tad spicier, but wonderful all the same. Good recipe to have on file for when you have guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Molina"
},
"reviewBody": "I substituted Vege-sal instead of plain salt and also added chopped green onions. Came out delicious. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MINDYMELT"
},
"reviewBody": "Excellent flavor. I’ll be using this as a ground sausage for the breakfast pizza recipe on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiboiya"
},
"reviewBody": "Four stars for doubling recipe.\nI've been using this recipe for a few years now. I've also tried using ground pork and ground beef.\nVery good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Misty Livingston"
},
"reviewBody": "I recently was diagnosed with diabetes and have to get real about changing my diet. By replacing my regular pork sausage with turkey there are 229 less calories and 18 less grams of fat!!! Store bought turkey sausage still has trans fats, chemical preservatives, and very high sodium though. So I was so happy to find this recipe to make the sausage at home and get rid of all those unhealthy things! I wish I had known how to do this years ago because the end result actually tasted better and was less greasy than most store bought sausage I've had! The only thing we will do different next time is be sure to choose a coarse grind of turkey. The kind we got left it with a mushy texture on the inside even though the outside crisped beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terri"
},
"reviewBody": "For a turkey sausage I really like it alot. For the ground turkey I used 1 lb 99% and 1 lb 93%. It was a little bit dry for my husband and son but my dil and I liked it the way it was. Great flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ltopka"
},
"reviewBody": "I took other reviewers’ advice and doubled the spices. Glad I did. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn Hurd"
},
"reviewBody": "Yummy we love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angie-b"
},
"reviewBody": "Very good! Doubled the spices, as others suggested. It helps to put a little oil on your hands before forming the patties"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Curtis"
},
"reviewBody": "Absolutely delicious! I used half turkey and half chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used 1lb. Lean ground turkey and coconut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ke2shu7"
},
"reviewBody": "I used 1lb. Lean ground turkey and coconut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dentoncook"
},
"reviewBody": "My go to!!!! I make meatballs and bake them. I can eat them for breakfast or use for dinner. I usually add marjoram and use a small amount of red pepper flakes instead of the cayenne. I don’t like them too hot. If I am going for Italian flavor I add Italian seasoning and fennel. You can freeze them to cook later, or cook them then freeze. Always great to have in hand!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "These were surprisingly good!! I go through many reviews before I convince myself to make anything! I was a little unsure about the ginger, but it was definitely needed! I’m sooooo excited to have found a healthier alternative to store bought sausage. I made mine with ground chicken! Definitely make sure to double the spices. Not sure how good it would have been if I didn’t! This will be added to my “favorites”!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "I don’t like sausage but I like these! They were a little spicy for me so next time I’ll cut back on the cayenne a little. And I love that I know exactly what’s in it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Davenport Macumber"
},
"reviewBody": "At the suggestion of several other reviewers, I doubled the seasoning. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "EROCK101"
},
"reviewBody": "Lackluster, but healthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "slowcooker"
},
"reviewBody": "The spice combination worked well with the 1.2 lbs of ground turkey that I had on hand. I added about a tablespoon of milk before cooking in the pan with the lid on to preserve moisture based on previous reviews. My picky son and husband liked it alot. Only gave 4 stars because the spices would likely be insufficient with 2 lbs of ground turkey. Will definitely be a regular in my home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Singleton"
},
"reviewBody": "These turkey sausages were scrumptious dee-lee-umptious!!\nI've tried different recipes using an abundance of ingredients, this was simple and tasty. I added a little maple syrup and kicked up the cayenne pepper a notch.\nThis is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NoxLumos"
},
"reviewBody": "Great recipe! I took Divinehealth7’s advice and doubled the spice, but I didn’t have maple syrup so I used brown sugar instead. Amazing! \n\nFor those having issues with dryness, I steer away from the ground turkey breast (all white meat and dry) and I get ground turkey that has both dark meat and white meat. Good luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonja Grothe"
},
"reviewBody": "I made this to put in another recipe that I didn't have sausage for. So, it was mixed in with other ingredients. Thought it tasted ok in that dish. Not sure how it stands up on its own. Will have to make again, and eat plain to see if it good by itself and how authentic of a sausage taste it has plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Piratebird"
},
"reviewBody": "I will definitely make this again with modifications, mostly because I love to create different flavors. This recipe is a great base which is surprising because there are just a few spices. My substitutions include the addition of coconut oil, replacing the salt with McCormick bruschetta seasoning, and using chopped fresh sage.\n\nIt's a great idea to form patties and to freeze the sausages because they are really best eaten when freshly cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Venus Childs"
},
"reviewBody": "I made mine with medium hot pepper flakes before, but today I will double the ingredients including the cayenne. We like extra kick! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacksmom42"
},
"reviewBody": "I've made this three times now, following the recipe exactly. Both my husband and I like it better than any store-bought sausage we've found. It's great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Miller"
},
"reviewBody": "I’ve made this at least five times now and it’s a solid, basic recipe with room to play. Some of the variations or tweaks I’ve made include: add about a 1/4 teaspoon each of garlic and onion powder and a teaspoon of maple sugar or maple syrup too (though you have to cook on a lower temperature or steam first when cooking as the sugar caramelizes quickly) . I usually add some grated apple too for extra moisture, flavor and fiber. It’s help the sausage stay juicy but the recipe is really delicious as written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy McBee Miller"
},
"reviewBody": "Very moist and flavorful. I cut the recipe in half and it was too salty for my taste, so I will use less in the future. I enjoy spicy sausage and used red pepper flakes which I left at full measure for the halved recipe. Thank you for sharing. I'm making more today. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Gager Firster"
},
"reviewBody": "Delicious! I'll never buy store sausage again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Msjenita08"
},
"reviewBody": "Made this the other day for work week lunches. I didn't have sage but had the Italian blend. Came out fine and I did \"eye ball\" the ingredients since it was 1lb of meat. I pair it with string beans, brown sugar baked beans, and velveeta shells and cheese. It reminds me of my favorite liver sausage (real dark sausage). Perfect for gravy biscuits and this as a sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "I don't often write reviews, but...Wow, this recipe is fantastic!! I took the advice of fellow reviewers and doubled the spices and also added in one teaspoon of crushed fennel seeds. This turkey sausage is highly recommended!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannie Powers"
},
"reviewBody": "Delicious and so simple to make. I used 93% lean ground turkey. Really tastes like breakfast sausage but we enjoyed it for dinner. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mima46"
},
"reviewBody": "I left out the salt, but added about a teaspoon of Mrs. Dash."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keyana Graves Claiborne"
},
"reviewBody": "Hands down, this is an awesome recipe. I will be making this again. I only used 1 lb of ground turkey instead of 2 but made no other substitutions. My family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sinda Parkins"
},
"reviewBody": "Made this recipe and it was delicious!!! Will make it again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sensiblesue"
},
"reviewBody": "I tried this recipe on a whim. and I am beyond excited I did. This was the best breakfast sausage I've eaten in a while. I love McDonald's sausage biscuits, but I won't be buying those high fat, high calorie biscuits. This sausage does not taste at all like it was made from turkey. It is a real winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susannah Kim"
},
"reviewBody": "So glad to have found this recipe so that I don't have to add maple syrup or bread crumbs anymore. Added garlic and onion per others' suggestion and it came out really well. I used a 1/3 cup measuring cup so that the patties would come out evenly. I'll need to flatten the patties more next time though as some of the slightly thicker patties were still pink in the middle, while others were well done. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Doubled the recipe on seasoning. excellent taste!! \nOh, also added a little applesauce to the recipe to make texture a little more tender. YUMMMM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hard to beat this recipe- I added a smidge more sage, otherwise as published. On a toasted english muffin with an egg- beats the convenience store hands down! This is a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aisha's Kitchen"
},
"reviewBody": "Great recipe, the kids with no changes needed. My kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "musicalbean"
},
"reviewBody": "This was a great and simple recipe. I did find it a little dry so I added 1tbsp of breadcrumbs lightly moistened with milk and one egg white for the lb of turkey I cooked up and it was amazing. Thanks for the great recipe will be making it again !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HeresDeb"
},
"reviewBody": "I thought they tasted good, but they didn't fool my family for one second into thinking these were sausage. So if that's what you're going for, it won't work. If you're looking for a healthy substitute and willing to have a milder, drier (less greasy), denser sausage, then this tastes fine. I probably wouldn't make it again, and try to cut fat another way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Swinney"
},
"reviewBody": "Amazing! I read the reviews and doubled the spices, less the salt and pepper. Very good! My husband and I prefer the natural food store sausage but the price can be hard to deal with and this is a great substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BudgetMama"
},
"reviewBody": "The first time, I made this recipe as written. My family loved it! The flavor was really good and I would give it 4 stars as is. I wanted it to taste more like pork sausage, though, so the second time around, I added 1/2 teaspoon of fennel and 1/2 teaspoon of red pepper flakes (I ground both with a pestle and mortar). I also made it the night before. The spices and flavors seemed to come together more letting it sit overnight. I flattened the patties when I formed them and cooked them over medium heat to prevent overcooking. I also put a little butter in my pan to add a little more flavor. I was thrilled with the end result! Great recipe - thanks for submitting it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Anne Cutler"
},
"reviewBody": "I made this as is except that i omitted the cayenne (due to my audience...). Still a delicious flavor and took just a few minutes to stir up and get on the stovetop. Thanks, this is just what I needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marisa R."
},
"reviewBody": "I took the advice of other reviewers and doubled all the spices except for the salt. It was great! However, next time I won't double the black pepper too. BUT there will be a next time! I also baked the sausage at 350 for about 20 minutes instead of frying. Yum! Thanks for sharing this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cindi"
},
"reviewBody": "I mixed this the original way but I thought it lacked spices so I doubled them in my next batch with 1 cup of cinnamon applesauce. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LAYDEEBUG"
},
"reviewBody": "It's got a nice kick! The texture is a little dry, I'd make it again with a different brand of ground turkey (I used Jeannie O in a 16oz tube)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rmonzon"
},
"reviewBody": "Very easy to make and delicious! Great as breakfast sausage patties, but also great for lunch or dinner as a protein with your pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nalahab Rawchaa"
},
"reviewBody": "I usually go through scores of reviews and accept the most common changes as law. There was no time today! So i did it as is....except i didnt have any ginger, and i didnt feel like getting a teaspoon....so i eyed the measurements. But they were REALLY good! My new go to. I wish id frozen some. They didnt stretch over a family of six as far as id like...but two dont eat eggs, and only three ate toast. But yes! Five stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonna Austin"
},
"reviewBody": "Outstanding! Just what I was looking for, thank you so much for this recipe... Made it for sausage and gravy and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nonna Austin"
},
"reviewBody": "Outstanding! Just what I was looking for, thank you so much for this recipe... Made it for sausage and gravy and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrspaws"
},
"reviewBody": "I love this recipe. I don't make patties, though. I cook the seasoned meat as ground and use it in Asian style lettuce wraps or 'egg roll in a bowl' recipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scefenia"
},
"reviewBody": "I didn't have ginger so I used nutmeg instead. The sausage came out really great. No more buying packaged turkey sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bridget Manning"
},
"reviewBody": "I made it with one lb of turkey and used the spices as state.. ( A hint to u all, if u want to do a tester take a small bite, put in your microwave or fry if have time, and taste it.) I used the micro. Found had to add 1/2 tsp each more of sage and ginger. But found the cayenne pepper to much would cut it back to 1/4 tsp. Also, like others I added a tbl spoon of syrup. I would make it again my husband liked it. I made it for him but with more spices and less cayenne like I said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "Honestly, I was skeptical about this tasting like turkey sausage but it did. Will definately make again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britninpride"
},
"reviewBody": "I just made this today after Kroger had their ground turkey on sale..but like everybody else I doubled the seasoning..I didn't have any sage so I use a tsp of rosemary and thyme and loved it (I'm not a fan of sage anyway.. I mix them and patted them out and using parchment paper put them in the freezer to have for breakfast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DasRach"
},
"reviewBody": "Very tasty! I doubled the spices as others suggested, omitted the cayenne (since my little ones would be eating it), and added a generous drizzle of maple syrup. The end result was just a *tad* gingery for my taste, but my picky five-year-old ate three patties and asked for seconds before even touching his pancakes, so that's a win! Next time I may do 1 1/4 tsp ginger instead of doubling it. Thanks for a yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Harper"
},
"reviewBody": "I doubled the seasonings as others suggested. I also added 1 grated apple (with out peel) and it was moist and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debbi P."
},
"reviewBody": "The flavor was good, hence the rating, but the sausage was too dry. I really don't care for turkey and thought this might be a good way to use it as when on sale is very economical."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula McClanahan"
},
"reviewBody": "Having to be on a restrictive diet for health reasons led me to looking for recipes like this. This recipe is delicious! I doubled the spices except for salt and it was perfect. My husband was really happy when I had him taste test one of the patties. He said it tasted better than the store bought kind. Will use this from here on! Love that we can make it to our taste and we know what ingredients are in it! Loved the kick of the cayenne! Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PFunkyCookie"
},
"reviewBody": "I Love this Recipe! I like it a lot more flavorful so I double up on the seasoning and add a little olive oil for moisture. Especially if I'm freezing it by batches. \n\nI once added garlic powder and I didn't like the change of flavor. This is perfect like it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wetherbee71"
},
"reviewBody": "I can't believe this was homemade, easy to make and tasted like regular sausage!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emalee Burkhart Pope"
},
"reviewBody": "My family loved this. I have made this a couple of times, never making the patties. It is the best turkey sausage I have tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mocha3"
},
"reviewBody": "This recipe was delish!! For dinner, my boys and I made this sausage along with pancakes. It was a very nice change. Like just about everyone else, I used one pound of ground turkey and doubled the ingredients except for the pepper. Next time, I'll leave out the cheyenne pepper and when I want a little spice I'll add crushed red pepper. Oh, I also added maple syrup. We really couldn't taste it so I won't add it again. I buy a lot ground turkey for multiple dishes; this has been added to the list! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "novicecook"
},
"reviewBody": "This has a pretty good flavor. Not the most delicious sausage I've ever eaten, but it will do. I've made it several times and I have noticed that I like it much better as an addition to another recipe, like quiche, instead of as a stand alone meat. My husband is a die hard sausage fan and feels the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nbrown_09"
},
"reviewBody": "I echo some of the other comments about doubling the seasoning. I used the same seasoning as the recipe but for only 1 lb of ground turkey. Also used 93/7 as the 99/1 turkey comes out too dry most of the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I thought this recipe was okay, but it didn't quite live up to the 5-star reviews for me. Right off I will say that I didn't use the full amount of salt (1 tsp instead of 1-1/2 tsp) b/c my husband is on a low salt diet. Somehow these were both spicy and a bit bland. Any ideas how to spark up the taste without more salt?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie O'Leary"
},
"reviewBody": "OMG!!! I had a recipe for do-it-yourself Turkey Sausage, but it's being thrown away today and replaced with THIS one! The blend of flavors is OUTSTANDING, and with the addition of a little Maple Syrup (I used 3 Tbsp.), the spicy-sweet taste is simply Heaven-sent! My only changes: I doubled all the spices except the Black Pepper (I used 2 tsp.), browned the patties in Vegetable Oil, and added the Maple Syrup mentioned above. Forget the freezer case: treat yourself to these delicious homemade breakfast sausages. Thank You, Mrs. A, for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikem"
},
"reviewBody": "I wanted to make turkey sausage with my new grinding attachment. I didn't have any ground turkey but I had a box of Bubba Turkey burgers. I wanted a breakfast sausage. I ground up the burgers that the only other ingredient was rosemary extract. To this recipe I added 2 tsp brown sugar, 1/2 tsp sweet paprika, 1/2 tsp ground ancho chili powder. I am not a ground turkey person, but this transformed the turkey into something edible. I will make this again with ground turkey or even grind my own using light and dark meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Brindley"
},
"reviewBody": "Very good! I didn't have the ginger and will make again with that. Added red pepper flakes to spice it up to my taste. Otherwise per recipe. Much better than grisly store bought breakfast sausage and only 96 cal per pattie according to my recipe calorie counter. I used 1.5# of 7% fat ground turkey, made 10 patties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SWRDPRINCESS"
},
"reviewBody": "I added some ingredients from a different recipe because I didn't use the salt. I added 1 1/2 teaspoons ground thyme and 1/2 teaspoon dried marjoram. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rdcolnar"
},
"reviewBody": "Didn't have cayenne pepper so I used little smoked paprika and chili powder. Turned out great and I'll definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian"
},
"reviewBody": "Fantastic and yes add more spices if you like it zestier. I even season the turkey when I bring it home and freeze the individual patties to make just the amount I need. You can even thaw out in the fridge the night before to speed up cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pbrooks77"
},
"reviewBody": "This is exactly what I've been looking for since I have some diet restrictions. As others did I only used 1 pound of ground turkey and cut the salt in half otherwise used the rest of the ingredients as stated. Try this as a meatloaf too...add one egg and a half to 1 cup of rolled oats. Bake in oven at 350 for 35 to 40 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noura Al-Hadhrami"
},
"reviewBody": "Wow this recipe is the best. I made it last night and added a few things to it. I added grated onion and carrots, chopped up parsley and mint leaves. I doubled the seasoning.I can't describe the look on my husband's face when he tried it. he did not believe that I made it from scratch. simple to make yet very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Great recipe. I've made this twice now. The first time I doubled the spices and it was too much pepper. The next time I doubled the spices except for the pepper and it was perfect for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PaperCraftLadyonEtsy"
},
"reviewBody": "I don't care much for ground meat, especially turkey but my husband insists that we should be eating that instead of ground beef. When we have turkey burgers, I am always trying to spruce up my one patty in order to make it edible for me. So, I was interested in trying these turkey sausage patties. It was a safe enough chance to take for my husband, too, because he loves pork and venison sausage.\n\nI read about a dozen reviews and it seemed more than not, folks thought the spices should be doubled. I was using only 1-1/4# ground turkey instead of 2# so I felt safe in leaving the spices pretty much as-is, which was a little less than doubling. I did only use 1/2 the salt, however per many suggestions, and substituted about 1/2 the cayenne pepper for crushed pepper. I added 1/2 teasp of garlic powder and about a TBLSP of EVOO.\n\nI actually liked it and my husband loved it! Finally, a way for me to enjoy ground turkey! When I make it again for breakfast, I think I will try adding the maple syrup as another person did because my husband loves maple venison sausage and Egg McGriddles! \n\nThank you for sharing this recipe! Now, off to Pin it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keshene"
},
"reviewBody": "Cool recipe. After I fried them in the stove top I put them in the oven to broil for about 5 min to get the edges a bit crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deliliah"
},
"reviewBody": "Don't know what I did wrong but mine turned out really dry. And didn't brown up very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "OneSpunCookie"
},
"reviewBody": "I made these camping and thought they were just OK, but a year later, people are still telling me how good the turkey sausage patties were that I made camping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sunny Girl"
},
"reviewBody": "By adding sage, soy sauce, cayenne and black pepper, to my standard turkey burger recipe with ground mushroom, and soy beans in equal amount of ground turkey makes a very tasty hamburger. For sausage patteis, decrease the amount of soy beans to eliminate a grainy texture in the cooked sausage pattie. I'm thinking of adding ground flax or chia seeds."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/77747/moms-turkey-sausage-patties/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/693/meat-and-poultry/turkey/ground/",
"name": "Ground Turkey Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/77747/moms-turkey-sausage-patties/",
"name": "Mom&#39;s Turkey Sausage Patties"
}
}
]
}
}
, "about": [
]
}
]