				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mom&#39;s Nova Scotia Seafood Chowder"
,"datePublished": "2019-04-02T02:58:42.000-04:00"
,"dateModified": "2019-04-02T02:58:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ashley_86"
,"url": "https://www.allrecipes.com/cook/4737056"
}
]
,"description": "This creamy potato and seafood chowder is loaded with shrimp, clams, and salmon. Serve on a cold evening with a big chunk of crusty bread."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/EcB7D5iCtZ9OGaaoXkQEma5Mlww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7529823-524db5cdfb27490ca9c1cae61ba65a76.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mom&#39;s Nova Scotia Seafood Chowder"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "79"
}
,"cookTime": "PT65M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "525 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "202 mg"
,"fiberContent": "2 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "23 g"
,"sodiumContent": "325 mg"
,"sugarContent": "2 g"
,"fatContent": "38 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 large onions, diced",
"3 carrots, sliced",
"7 potatoes, cubed",
"1 pound salmon, cut into chunks",
"1 pound cod, cut into chunks",
"1 pound scallops",
"1 pound shrimp, peeled and deveined",
"6 ounces cooked lobster meat, shredded",
"1 (6 ounce) can crabmeat, drained and flaked",
"2 (6.5 ounce) cans chopped clams, drained",
"4.25 cups heavy whipping cream",
"2 cups half-and-half",
"1.5 cups butter, cut into chunks",
"salt and ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot halfway with lightly salted water; bring to a boil. Add onions and carrots; cook until slightly tender, 10 minutes. Add potatoes; cook until tender, 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in salmon, cod, scallops, shrimp, lobster, and crab; cook over medium heat until salmon and cod are firm but chunks are still slightly translucent in the center, about 10 minutes. Drain half the water from the pot and add clams, heavy cream, and half-and-half. Place butter chunks atop the soup; season with salt and black pepper. Cover and simmer, stirring occasionally, until salmon and cod are fully cooked and flake easily with a fork, about 30 minutes."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stan Hayden"
},
"reviewBody": "Easy to make and very tasty. I also put baby clams just for a little extra contrast. I love clams. We make this for Christmas Eve meals before church. Nevers makes it into another meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best chowder recipe I’ve come across! Amazing and delicious! It’s perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shanelyons15"
},
"reviewBody": "I love this recipe. I've been using it for years. I add bacon to mine who doesn't like bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "earth me"
},
"reviewBody": "This is delicious. The only change I made was adding a couple cloves of garlic and omitting the lobster... since lobster here is crazy expensive. Even without the lobster it was great! I serve it up in bread bowls"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "numad"
},
"reviewBody": "This was delicious! Similar to what we’ve had at the Rope Loft in Chester, NS (This is high praise.)\nA very slight modification: Before adding the cream, I drained and saved almost all the broth, added the cream mixture and then added a little broth back in. That way, I was sure it wouldn’t be too watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott from The Valley "
},
"reviewBody": "That’s quite a pot of chowder. I cut it in half and still plenty to go around. Per other suggestions and previous experience I did add some finely chopped bacon and some curry powder (I recall my mother doing this back in Nova Scotia and she made deadly chowders). Didn’t have all the fish mentioned but it sounds like a “go with what you have on hand” recipe so wasn’t concerned. It can get pretty expensive if you include everything (especially the lobster). Great basic chowder recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beccafly"
},
"reviewBody": "So, I love seafood. When I found this recipe, I thought it would either be really delicious or really disgusting. It's an expensive bet but I was not disappointed. This soup/stew/chowder is the bomb. Just make sure you drain enough water and put the seafood in order of how long it needs to cook. So good, freezes well, slammin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Quinn Graham"
},
"reviewBody": "Similar to mine (also from the East-coast) but with the following revisions: I start with bacon - cube and cook it in the pot, add onions and then seafood stock and white wine - just enough to barely cover the potatoes and carrots. Once the potatoes and carrots are 2/3 cooked add seafood according to cook time so that nothing is over cooked. Lobster, clams, mussels, white fish (I find salmon far too over powering), shrimp, sea scallops, snow or King crab - whatever seafood you like. When seafood is just about done add heavy cream, butter, salt &amp; pepper to taste and some fresh thyme and curry powder. Fold in and reduce heat to low. Enjoy with buttermilk biscuits. Finish off with strawberry shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Wyse"
},
"reviewBody": "I used light cream and thickened with a bit of corn starch. I also used, corn and other fish, like octopus and squid as I didn't have crab or lobster. It turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Vaughan"
},
"reviewBody": "Turned out good. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRSM"
},
"reviewBody": "Easy, delicious recipe. I had everything except the lobster unfortunately. I also used chicken broth instead of water and only drained about 1/2 off at the end. I also only used 2 sticks of butter ( 1 cup ) and it was great! Thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Anne Green"
},
"reviewBody": "Great chowder. I didn’t add salmon but used shrimp scallops clams oysters crab and bacon. It Was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ittybitty81"
},
"reviewBody": "Just like I’m makes !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Mayer"
},
"reviewBody": "This is an amazing recipe as is, everyone in my house loved it (including a very picky 9 year old). I'm making it for the 3rd time today. I now alter the recipe slightly: use chicken or vegetable stock instead of water to boil up the onions and potatoes. Use only just enough to cover them so that there is not too much liquid making the chowder thin. To thicken, I peel a white potatoe and puree it in the blender till smooth. Add the potatoe puree to the soup and it'll thicken up beautifully without altering the taste (use more than 1 potatoe if making a large amount). Generally, I add: haddock, scallops, lobster, crab, shrimp and canned baby clams to my seafood chowder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Uhl"
},
"reviewBody": "Absolutely delicious! I have been trying to find a recipe similar to our local seafood restaurant and this is even better. I only made half the recipe luckily as I don’t have a pot large enough for the full version. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazzyforjesus"
},
"reviewBody": "Made this tonight, it was so delicious!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace"
},
"reviewBody": "Mmm so good. Have made this recipe several times. First time I followed the recipe exactly. The other times I made it I did alter it taking into account some of the other reviewsers suggestions. The following changes I made were to add celery with the carrots and onions. I used half fish stock with the water. I didn't use any salmon or crab instead I double up the lobster and used haddock. Lastly I added garlic powder and old bay seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nadine VanMale"
},
"reviewBody": "I made this but I used leftover Salmon instead of raw.....I also added Old Bay spice and dill weed. Made for a delicious flavor combo!!! Enjoy!!!\nVery easy recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaBear"
},
"reviewBody": "Awesome! I’m also a Maritimer, (grew up in New Brunswick) &amp; have several relatives that were Fishermen, lobster fishermen from St. Andrews, &amp; serveral fishermen from the Miramachi. This recipe is VERY similar to my Grandmother’s recipe that I still use today. (With a few minor changes) We use canned milk &amp; whole milk, (I use 2% on both to cut down a bit on fat) &amp; we use haddock or sole, no salmon. (Nannie HATED salmon...lol) We also use the liquid from the canned clams, as well as some fresh parsley &amp; chives, &amp; a tiny bit of Seasoning Salt &amp; Mrs. Dash. For meat we use Haddock (or sole), Lobster, Shrimp, (usually cooked shrimp as it’s easier) Scallops, &amp; canned clams. Occasionally she would add canned crab meat, but only if she happened to have it. For veggies, we add a few stalks of finely chopped celery, a few carrots, shredded, &amp; of course, potatoes &amp; onions, and LOTS of butter! lol (The butter adds that really creamy texture &amp; just makes it taste AMAZING.) Yes, it’s a VERY expensive dish to make, &amp; not great for the waistline, which is why we only had it maybe 2 or 3 times a year, as a treat. I only make it once or twice a year, usually at Christmas. Back home, where we had better &amp; cheaper access to fresh fish, you could make it a bit more often, but still only a few times a year. It’s meant as a treat type of meal, not in your usual meal plan. But OH what a treat it is! SO yummy! You can also really make this dish your own by adding the types of seafood YOU like. And,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel G"
},
"reviewBody": "A little bland and watery. A like a chowder that is a little thicker. The base recipe is good. Added some additional spices and a flour slurry to thicken it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Deamer Sell"
},
"reviewBody": "My family loves this stew!! Even my daughter, who has a dairy allergy, enjoys it with Almond milk and Fleischman's unsalted margarine (dairy-free)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Anthony Reid"
},
"reviewBody": "Traveled to New Brunswick this fall and had lunch in little Town Called Alma. I have since searched for a seafood Chowder as delicious as the one we had there. This is it absolutely Delicious now I just need to find a recipe for the buns! Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Greene"
},
"reviewBody": "This was absolutely delicious! I didn't put all of the fish in, just salmon, scallps and baby clams from a can. I added frozen corn and some red pepper flakes. My husband RAVED about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I went to visit my son in Alberta and made this chowder for him and some friends. They said it was the best chowder they have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Frye"
},
"reviewBody": "Excellent!!! Thanks for the great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adair"
},
"reviewBody": "We loved it! I made it healthier by substituting greek yogurt for 1/2 of the cream and all of the half and half. In addition, I reduced the butter by 1/2. I also substituted garlic salt for the salt,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeathJoy"
},
"reviewBody": "I didn't use as much butter and I only used half and half cream instead of both types of cream. I also added some of the juice from the canned clams for a bit of extra seafood flavor. Then I added thyme and nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Super easy and certainly pleased my New Brunswick clan. I switched the creams - less heavy cream more half and half - plenty rich enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Wilson"
},
"reviewBody": "It's the best one I've found yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Rosario"
},
"reviewBody": "I made this on a Sunday afternoon for our family dinner. I have to say it was pretty easy. I loved making this recipe. I made half of the a amount of ingredients. I had a smaller crowd and did not need a 20 serving pot of soup. Everyone enjoyed and gave me compliments on the recipe. I recommend to try this recipe if you are interested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linnipoo"
},
"reviewBody": "I omitted the salmon but left the remainder of the recipe the same. Thought it was very good and rich. Enjoyed it immensely. The reason I omitted the salmon was because I felt it was too overpowering a flavor for the rest of the fish in this chowder. It wasn't what I was looking for. What I made was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allen"
},
"reviewBody": "My wife and I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannie"
},
"reviewBody": "Love it! The butter.takes it over the top Being a Cape Bretoner it tastes like my childhood\nJeannie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SeafoodLover"
},
"reviewBody": "Chowder was less flavorful than anticipated. I didn't care for how runny the soup was, and was looking for a recipe that was more thick and creamy. I wouldn't make this again as I bought all fresh ingredients and it just wasn't worth the $$$ for mediocre."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Woodhen"
},
"reviewBody": "First time I made this I halved the recipe, but we loved it so much that the second time I made this I made the full recipe and froze the leftovers so we can have this whenever the urge hits. The original recipe, while good was too bland for our taste, so the second time I added several ribs of thinly sliced celery with the onions and carrots and added 3 heaping tablespoons of Old Bay Seasoning with the seafood. Fabulous. Thanks, Mom!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen Kelly"
},
"reviewBody": "This recipe is a keeper! Been making it for years and pretty much follow it to a T; delicious every time!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CruellaDeVille"
},
"reviewBody": "I do the \"throw er' in\" method. Doesn't mateer what fillets you have, or wether you have crab or lobster, I use shrimp, mussles, scallops. Whatever I find on sale, Save it up and make 'er! Use your taste buds. It is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TruckTruckGoose"
},
"reviewBody": "Ridiculously good! I substituted crawfish tails for the lobster and added a few stalks of chopped celery. Topped off each bowl with some sea salt, black pepper and cayenne pepper. This will definitely be a regular dish during the winter months in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JudyB"
},
"reviewBody": "I added corn and bacon. Excellent recipe. Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverachi"
},
"reviewBody": "Outstanding! I use 2 lbs of of all the seafood plus 2 qt of heavy cream and 2 qt of half &amp; half in a 16 qt stock pot. I make this every Christmas Eve for our family. Let it sit overnight in the fridge and it is so so delicious the next day. Thank goodness I live in Maine on the ocean where seafood is cheap...lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Parker"
},
"reviewBody": "I always load my Chowder with any type of fresh fish... lots of lobster and scallops! I like to add lemon and dill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Jones Thomas"
},
"reviewBody": "Very delicious. I tweaked it a bit to my liking using less water \nand adding clam juice. I also removed the veggies before adding\nthe seafood and puree'd them with the heavy cream and half &amp; half\nbecause I love a more smooth and creamy texture. My family really\nenjoyed it. Will definitely make again very soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Bognanni"
},
"reviewBody": "it is a bit pricy to make i elim. the lobster doubled up on the crab to save a bit it was still real good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! I did lighten it up considerably by using Almond Milk instead of all the heavy cream and half &amp; half. I also added some Old Bay seasoning and only half the butter called for. This is just due to my personal preference. And I know chowder purists would disagree, but personally, I would much rather sacrifice a bit of richness to save all the fat and calories. Due to using the Almond Milk, I did need to thicken it a bit with corn starch, but it truly was scrumptious and a real keeper!! Next time, I think I will throw in some corn and some celery - yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "keeper"
},
"reviewBody": "its very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jena6968"
},
"reviewBody": "Was so GOOD!! Thanks for the fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Sorensen"
},
"reviewBody": "All I can say is...GOD BLESS NOVA SCOTIA!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KMARTELL"
},
"reviewBody": "My wife and I were searching for a Seafood Chowder base when we (independently) came across this one. It's an awesome starting point, but we did tweak it a bit along the way. We added a stalk celery, sliced; approximately 1/2 tablespoon of cayenne pepper (we like it spicy); and some mussels.! We also used a bit of Flour/Water mixture for thickening. It was delicious, and will certainly be made again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Sanborn"
},
"reviewBody": "This was a huge hit. We used ingredients that were available and it was really tasty. Read comments, but stuck to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This was the best soup! I used catfish that my husband had caught instead of the tilapia (you could really use anything) I also added some Cajun seasoning and some old bay. I put the veggies and potatoes in a pot with 1 carton of chicken broth instead of the water and cooked until soft. So I just kept all of the chicken broth instead of dumping out half a pan of water, then added the rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "apolloinottawa"
},
"reviewBody": "Wife is from Pictou County, NS and loves her seafood chowder...I'm from the west coast and inherently love seafood as well...this recipe is the best out of the three I've tried...must admit that I cut down on the heavy cream and half and half, added a bit more water with some cornstarch to give it a thicker, smoother texture...heavenly...thanks for sharing this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sekiu12"
},
"reviewBody": "\"Best chowder you've made so far.\" touted my husband. Loved how creamy it was. Added parsley, garlic powder, and corn. Also added bacon as another reviewer suggested. I didn't have all of the seafood but even with razor clams, oysters, and small shrimp, was still yummy. Can't wait to try it with fresh salmon, cod and crab."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delilah3"
},
"reviewBody": "Loved this chowder. I added a little spice though.. Onion powder, garlic powder, paprika, cayenne and tarragon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mislis66"
},
"reviewBody": "I loved this recipe. It is so flexible we add the seafood we love and a fresh bun and this is supper with my husband and I fighting for leftovers the next day. Thank you so much for posting Mom love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Narcis"
},
"reviewBody": "I loved this recipe. AS the writer said throw'er in...I used all the ingredients i had....no lobster or clams...but had sole and prawns...\nI especially loved this recipe for its ease of use and flexibility. I didn't skimp on the butter either...YUMM!!!! It doesn't need any changes. It is fabulous as it is. Nice though that you can make it your own. It is a great starting off point for many a yummy soup/chowder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leasa"
},
"reviewBody": "I made this exactly as the recipe called for. It is an expensive dish to make here. I found that you really need to measure the liquids out, as it was too 'liquidy' even after I drained off the water. The cooking time was a bit too long also. I love seafood chowder and even though this was good, I've had much better. Are you sure there's no thickening? After supper, I did drain off again half the liquid and I'm sure it will be much better now. I know you saiud your measures are 'approximate' but even so....we had to 'fish' for the seafood in the liquid. I've also noticed in your picture there is corn, the recipe never called for corn...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody Ann Cox"
},
"reviewBody": "Simply amazing!!!! Thanks Mom!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joel"
},
"reviewBody": "I'm making seafood chowder for the second time now. The first batch was AWESOME!! and I loosely followed this recipe. I loved the recipe's commitment to the, \"throw 'er in the pot!\" philosophy. I subbed 1/2 &amp; 1/2 cream for whole cream. I omitted Salmon, and being on the Canadian prairie, I had to use a combination of fresh, frozen, and even canned, products. Luckily fresh is available, but at a cost.\nThis is a great recipe for delicious seafood chowder. I'm looking forward to this second pot. mmmm mmmm mmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ans391"
},
"reviewBody": "This is so good. I omitted the scallops and the crab out of preference. Will use a fish other than cod next time. Added a little fresh lemon juice and cajun seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kemilla"
},
"reviewBody": "This is very similar to the recipe my mother makes (also east-coaster). She doesn't use crab but essentially subsitutes the amount of crab for more lobster. She also only uses haddock not cod and salmon and only uses 10% cream. Additionally, she uses cold water shrimp and puts them in with the veggies to cook. Finally, she adds a pinch or two of curry powder!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "englotgg"
},
"reviewBody": "Wow! So rich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mountie86*"
},
"reviewBody": "Totally Awesome!!! Hit with everyone in the house. My son asked why I have never made this in his life time before, HA. Improvised a little; oysters instead of scallops/clams; purple onions, celery and corn for color; used condensed milk for the half-n-half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lolabelle65"
},
"reviewBody": "delish! took the fat content down a whack by using milk and half and half. still great. even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray"
},
"reviewBody": "Wow, and more wow. I only made half, but this has to be one of the best chowders I ever tasted and made. Next time though, I will add more salmon for the simple reason I like salmon."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228991/moms-nova-scotia-seafood-chowder/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/174/soups-stews-and-chili/chowders/",
"name": "Chowders"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14772/soups-stews-and-chili/chowders/fish-chowder/",
"name": "Fish Chowder Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228991/moms-nova-scotia-seafood-chowder/",
"name": "Mom&#39;s Nova Scotia Seafood Chowder"
}
}
]
}
}
, "about": [
]
}
]