				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mom&#39;s Sponge Cake"
,"datePublished": "2020-06-19T00:06:18.000-04:00"
,"dateModified": "2023-01-29T17:37:03.000-05:00"
,"author": [
{"@type": "Person"
,"name": "LOONEYPROFESSOR"
,"url": "https://www.allrecipes.com/cook/1273145"
}
]
,"description": "This quick and easy sponge sheet cake made with hot milk has a light and delicate texture. It makes a great base for berry shortcakes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/c7zxA_nXO1LXBcbkKZ5jxS4x8TM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3632104-moms-sponge-cake-lutzflcat-4x3-1-ff0f497e406248dfb6fc667d5bfec63a.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mom&#39;s Sponge Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "55"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "275 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "74 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "238 mg"
,"sugarContent": "35 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"4 large eggs",
"2 cups white sugar",
"2 cups all-purpose flour",
"2 teaspoons baking powder",
"0.5 teaspoon salt",
"1 cup milk",
"0.25 cup unsalted butter, cut into pieces",
"2 teaspoons vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Beat eggs in a stand mixer fitted with the whisk attachment on high speed until thick and lemon-colored, about 3 minutes. Gradually add sugar, beating until mixture is thick, about 5 minutes. Fold flour, baking powder, and salt into the batter by hand."
} ,{
"@type": "HowToStep"
,"text": "Microwave milk in a microwave-safe bowl until it begins to bubble, about 1 minute. Add butter and stir until melted. Stir in vanilla."
} ,{
"@type": "HowToStep"
,"text": "Pour hot milk mixture into the batter; blend on low speed until well combined and smooth. Pour into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Ward"
},
"reviewBody": "Made it as per the recipe and it came out great. Topped it with strawberries and whipped cream and the whole family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Wilkins"
},
"reviewBody": "Excellent recipe! I read through all the reviews and made the careful decision to ease up on the sugar a bit, but not too much, as sugar lends specific characteristics to a recipe besides sweetness. I wanted a 'plain' sponge to use as layers in tiramisu. I doubled the ingredients as I needed a sheet the size of 2 - 9x13 pans (a 'hotel' pan). It came out so great! I would like to add here the way I mixed it. I did use my Kitchenaid mixer to first whip the eggs, then gradually added the sugar (as instructed, with the time instructed). However, I did choose to add the flour/baking powder/salt very gradually into the mixer, as it was mixing on low (as opposed to folding by hand). Then added the warm milk/butter/vanilla, pouring slowly into the Kitchenaid bowl while on low speed. Then took the bowl off the mixer, and used a hand whisk to carefully scrape along the bottom of the bowl, where there was a small amount of thicker batter. Then carefully used whisk to blend thoroughly. thank you so much for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker101"
},
"reviewBody": "Very nice. Spongy, not one bit rubbery. Used melted marshmallows on top instead of frosting. Would recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "areejthemarketeer"
},
"reviewBody": "I just added a bit of more vanilla extract for the taste, probably 2 teaspoons and i beated a little longer, the taste is good and recipe is really easy to follow, very quick!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Stewart"
},
"reviewBody": "Second time making it, directions are easy to follow and cake turned out beautifully. Served with fresh strawberries and whipped cream. Delicious for leftovers as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Thompson"
},
"reviewBody": "Excellent base for raspberry shortcake, but cut sugar to 1 cup based on other reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "This is a quick and easy sponge cake and is tasty. It was delicious with my sweetened blueberry/strawberry mix and whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahmad Subeh's Marble Runs"
},
"reviewBody": "Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "Oh my stars and garters! This is an awesome sponge cake. I only substituted one ingredient. I used one Tsp of Lemon flavoring for the vanilla. It was perfect with our strawberries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jogr"
},
"reviewBody": "This is a perfect, fluffy sponge cake recipe. I followed the recipe except to reduce the sugar to 1.5 cups.. personal preference. I think it would be too sweet with 2 cups of sugar. I will try with just one cup of sugar next time, and load it with some delicious whipped cream and berries. Simple and delicious.. just the way I like em’."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I was having trouble locating the Sponge Cake recipe that my mother used to make for my birthday. This is it. Delicious. Perfect for Strawberry Short Cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Since it's my first time to make this cake, I cut the recipe in half. I read the reviews and made it with only 1/2 of the sugar and beat the eggs longer than instructed. I remember watching a baking show and they said that you'll know if the eggs are \"ready\" if you can write a number 8 on the batter and it doesn't disappear. The cake tasted really good especially with less sugar. Will make the full batch next time. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ale"
},
"reviewBody": "I followed the instructions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "It smells amazing. Made it for our 4th of July dinner. Cant wait to try it. \n\nI did reduce the sugar by 1/2 cup since the strawberries will be sweetened as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francis Paquet"
},
"reviewBody": "made it and used a blueberry coulis in thte middle and strawberry coulis for the top. whipped cream and fresh strawberries to keep the coulis on the top. placed it in the freezer for 2.5 hours. Absolutely marvelous! Our 10 guests could not stop complementing me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Brooking Denmon"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Nowakowski Chisholm"
},
"reviewBody": "Fabulous cake! I was a little worried that the batter was too thin and it took about 35 minutes to bake, but it turned out wonderful! Sweet, but not too sweet. Great texture. This was my first time making a sponge cake, so I wasn’t sure what to expect. It turned out similar to an angel food cake, but the taste and texture was so much better! We topped ours with sliced strawberries and whipped cream. It was a big hit. Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grdngrl"
},
"reviewBody": "Delicious! Nice spongy texture. Perfect for strawberry shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SassyBookworm"
},
"reviewBody": "Excellent results. I reduced the sugar as another review suggested and baked in 2, 9 inch pans. This is what the pre-packaged shortcake is trying to be. Easy to make, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jjespencer"
},
"reviewBody": "Excellent results. I reduced the sugar as another review suggested and baked in 2, 9 inch pans. This is what the pre-packaged shortcake is trying to be. Easy to make, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coronafox"
},
"reviewBody": "I followed the recipe to the T ! Came out wonderful. The cake was moist and spongie. Just the right amount of sweetness. I realized the trick was to beat the eggs and sugar for at least 10min. I baked in 2, 8in cake pans. Sliced the cakes in half and put strawberries in middle and top. Sliced beautiful and they popped right out the pan holding their shape. This is a keeper. Never buying store bought sponge cake again. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben Harris"
},
"reviewBody": "A great recipe, made it a bunch of times. Super versatile but a little sweet, I would add less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn M.M."
},
"reviewBody": "I made a half batch for 6 servings and it came out to a full 9x6 glass pan, so more like 8 servings and super spongy and really easy to make. Done in 40 minutes and left me time to prep my berries. Excited to share this recipe with my friends for a summer treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shollia"
},
"reviewBody": "I made this yesterday. I used cake flour instead of all purpose b/c I wanted to use it up.\nThis cake definitely lived up to the \"sponge\" name.\nIt was delicious and super simple to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATiE"
},
"reviewBody": "I topped it with a mango/papaya/rum sauce I concocted for my boyfriend’s birthday. He is from Guatemala and a popular dessert there is borracho sponge cake. It was a crowd favorite at the party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara J Wright"
},
"reviewBody": "I made this today. After reading the reviews, I used 1/2 cup less sugar. i followed the directions otherwise, baking it about 30 minutes, which probably could have been cut down a minute or two. It rose beautifully and came out golden brown. Taste wise, it was light, fluffy, and plenty sweet with sugared berries and whipped cream. Next time I make it, I may add more vanilla because I just love vanilla. There will be a next time because I can see having this with any kind of berry or fruit, or with chocolate or caramel sauce, or anything you want to top it with. This recipe is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the best sponge cake I have tasted. I have tried several recipes this year. People mean different things when they say sponge cake. This is like a store bought angel food cake but MUCH better. Very light, spongy and flavorful. I did bake it quite a bit longer. I baked it until the edges started pulling away from the sides of the pan. Since oven temps vary, I always go by the edges of the cake. I really appreciate the detailed instructions as far as how long to beat or microwave ingredients because I think that's made all the difference. King Arthur Flour has great instructional web pages on baking matters like properly creaming butter and so on. It's taught me allot of simple baking techniques that have made a big difference. I'm going to use this recipe for trifle and strawberry shortcake. It's really good plain with coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lummi7"
},
"reviewBody": "This was super simple and turned out great. I used a scan 1+1/2 cups sugar and I did whisk together the flour and other dry ingredients. It rose beautifully. Thanks for a really good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "if your eggs aren't whipping add the baking powder to them, it acts like cream of tartar would in a meringue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Smith"
},
"reviewBody": "I followed the directions pretty closely, but I added a teaspoon of almond extract (I was just in the mood). This cake came out WONDERFULLY moist and delicious. I made it to go with strawberries and cream. I only got to eat a couple of pieces though, because my husband scarfed it down over three days. He didn’t even add the toppings because he loved it plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cukor"
},
"reviewBody": "Kids loved it! Very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Gabourie"
},
"reviewBody": "I made this last night for strawberry shortcake and it turned out awesome, even with one error on my part and a substituted ingredient...thus 5 stars for a forgiving recipe.\n\nFirst, I replaced the vanilla extract with a tablespoon of honey (no vanilla onhand).\n\nSecond, I forgot to warm the milk and poured it in cold. Oops.\n\nWell, the end result was a perfect sponge cake with strawberries AND eaten plain later. In fact, it was perfect by itself. \n\nThank you for the recipe and I plan to play with more vanilla substitutes (like fresh lemon)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marianne L"
},
"reviewBody": "I followed the direction to a T...I like the flavor, cake itself did rise inside the oven...took it out and flipped on a cooling rack and came out flat and dense. Will recycle to cakepops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JillBean"
},
"reviewBody": "I loved this recipe! All the ingredients already on hand. It was a little sweet for my taste, but my husband loved it. I would probably try a bit of lemon in the batter as well next time. I needed something quickly for fresh strawberries and vanilla ice cream. Superb!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna D"
},
"reviewBody": "Loved it works great for strawberry shortcake!! Or plain..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dinkytink"
},
"reviewBody": "This was so perfect! It was light in texture but rich in flavor. I made it for a small dinner, so be forwarned, if you don't adjust the servings, you get a LOT of cake. It was a tad sweet for me so I may reduce the sugar next time by 1/4 cup. Otherwise, this was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMILEYCOOKS"
},
"reviewBody": "After the first bite my husband exclaimed, \"This is the best shortcake I have EVER had!\" I think it was a hit! I love how light and moist this shortcake is. It is rather sweet so I might reduce that a little but, wow, soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jsue"
},
"reviewBody": "I made this recipe just as instructed but there seems to be a problem with the cooking time. I have a convection oven, which usually cooks a little faster, but this time the cake was not done. I cooked it the 30 minutes as instructed and then cooked it an additional 10 minutes. I put the toothpick in and it came out clean, but somewhat wet? First time I've made it I thought - ok! It was not ok. After sitting for 15 minutes the cake fell and I could tell it still was not done in the center. So disappointed! Also, the photo provided shows circle cakes? These instructions said a 9x13\" pan - which I did?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita"
},
"reviewBody": "Delicious cake though too sweet using 2 cups sugar. I used just over 1 cup and it was great. Made individual trifles with whipped cream, pudding, and strawberries. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Oakrunner"
},
"reviewBody": "Excellent sponge cake for strawberry shortcake! We reduced the sugar to 1 1/2 cup, and it was sweet enough. I may even reduce it to just one cup next time! With sweet berries and sweet cream you don't need a super sweet sponge cake! Delicious thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melli G"
},
"reviewBody": "I followed the recipe and method. Cake came out so soft and bouncy. I would definitely make again. I posted a pic of an empty plate with crumbs... me and my family devoured the whole lot and that was the best pic I could take!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Hamilton"
},
"reviewBody": "Moist and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nightingale"
},
"reviewBody": "Loved it! Since I'm allergic to milk, soy, and eggs. I replaced the milk with almond milk, and eggs with flax seeds+water mixed together and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickygloz"
},
"reviewBody": "Delicious! First time I made sponge cake. It is yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "memorie"
},
"reviewBody": "THE BOMB MADE AS IS, PERFECT. LIGHT AND FLUFFY. WAS DELIGHTFULLY SURPRISED. DIDN'T EVEN USE THE STRAWBERRIES I MADE TO GO WITH, DIDN'T NEED THEM. CAN'T WAIT TO MAKE AGAIN. THANK YOU LOONEYPROFESSOR FOR SHARING, EVER SO GRATEFUL PS SO MANY POSSIBILITIES!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackmda"
},
"reviewBody": "So sweet and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helene"
},
"reviewBody": "Will definitely be making this again for all sorts of fruit desserts! Light and fluffy and so easy to make! I baked mine in a cookie sheet to have thinner pieces! Was a huge hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "I didn't change a thing. Perfect for strawberry shortcake. Will make it instead of the one I have used for years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I love this simple recipe! It makes a wonderful spongecake to use in making Trifle. My DD requests it every year for her birthday for 2 years now. A family tradition! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "6.4.16 This was the perfect choice for strawberry shortcake. In an effort to get calories down, I used skim milk and Truvia® Baking Blend in place of sugar, and it still turned out awesome! If you want your butter to melt quickly in the microwaved milk, I’d recommend cutting it into small pieces or grating it. For a nicer presentation, I cut into rounds using a biscuit cutter. The texture is light, almost fluffy, it had just the right amount of sweetness, and it soaked up the juice beautifully. As soon as peaches come into season (very soon), this will be made again. I scaled the recipe down to 6 servings, used an 8x6x2 baking dish, and ended up with six round cakes that split horizontally were just about perfect for layering berries in the center. I’ve always made the biscuit-type shortcake, but this just might become my go-to recipe for shortcake. LOONEYPROFESSOR thanks sharing Mom's recipe, it's a winner!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/246765/moms-sponge-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17095/desserts/cakes/sponge-cake/",
"name": "Sponge Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/246765/moms-sponge-cake/",
"name": "Mom&#39;s Sponge Cake"
}
}
]
}
}
, "about": [
]
}
]