				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Monkey Bread Made Easy"
,"datePublished": "2020-06-18T23:42:05.000-04:00"
,"dateModified": "2022-12-03T14:32:24.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Kathleen"
,"url": "https://www.allrecipes.com/cook/kathleen"
}
]
,"description": "Baking monkey bread in individual muffin cups cuts down baking time and evens out the portion sizes. It&#39;s a fast and easy treat that kids love, made with refrigerated biscuit dough, brown sugar, and cinnamon."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/j09wmkeAb1uwH62ZD2HzKcNW7sg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/467760-monkey-bread-made-easy-1gdcowgrl-gone-1x1-1-d7f9d7bd738e499697baf731346d396d.jpg",
"height": 1000,
"width": 1000
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6302329947001",
"description": "No more mushy centers! Perfectly portioned monkey bread in half the time.\n\n",
"duration": "PT51S",
"name": "Monkey Bread Made Easy",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/11/12/467760-monkey-bread-made-easy-1gdcowgrl-gone-1x1-1.jpg",
"uploadDate": "2022-04-04T02:57:56.329-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Monkey Bread Made Easy"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "97"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "403 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "618 mg"
,"sugarContent": "36 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"cooking spray",
"1 tablespoon ground cinnamon",
"0.75 cup white sugar",
"2 (7.5 ounce) packages refrigerated biscuit dough",
"0.5 cup butter",
"0.5 cup brown sugar",
"1 tablespoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C). Spray 8 muffin cups with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "In a bowl, stir together 1 tablespoon of cinnamon and the white sugar until evenly blended. Remove the biscuits from the packages, and cut into quarters. Drop a few biscuit pieces at a time into the sugar mixture, and coat thoroughly. Distribute the coated biscuit pieces among the prepared muffin tins (4 to 5 pieces per cup)."
} ,{
"@type": "HowToStep"
,"text": "Place butter, brown sugar, and the remaining 1 tablespoon cinnamon in a microwave-safe glass or ceramic bowl, and microwave a few seconds until the butter has melted. Stir to blend, and drizzle about 2 tablespoons of the butter mixture over each cup."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/j09wmkeAb1uwH62ZD2HzKcNW7sg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/467760-monkey-bread-made-easy-1gdcowgrl-gone-1x1-1-d7f9d7bd738e499697baf731346d396d.jpg"
}
]
,"text": "Bake in the preheated oven until the tops of the muffins are crispy and brown, about 20 minutes. Allow to cool for about 10 minutes before removing from pan."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aleesa"
},
"reviewBody": "I used my giant 6 section muffin tin with two 10 ounce cans of non flaky layered biscuits. put parchment paper on cookie sheet under muffin tin for sweetness overflow . I used a little less sugar and cinnamon and added chopped pecans. They cooked perfectly in about 24 minutes at 350 degrees putting a sheet of foil over top at last 3 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Singleton Talbert"
},
"reviewBody": "I had to make a small change. I made these in my toaster oven and had to use a mini cup pan (couldn't find my regular cup pan). I placed 3 biscuit pieces in the cups and cooked for 15 minutes instead of 20. I also waited until they came out of the oven to put the glaze on because of the small pan. Turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "I am currently making this with my kid. We are doubling the recipe and using a bundt pan. I am giving this 5 startls because it is a fun and easy recipe. I refuse to give less than 5 stars when I modify a recipe and neither should you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Therese Jackson"
},
"reviewBody": "These were delicious! I incorporated several of the suggestions: used a cookie sheet w/foil to collect drippings; reduced sugar and cinnamon amounts because it didn’t need it; reduced oven temp to 350 and baked them for 18 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Garda"
},
"reviewBody": "easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krissy Knox"
},
"reviewBody": "It was fantastic. The best Monkey Bread I’ve ever eaten. But I made several changes. After reading others suggestions that these might burn, I cooked them on 325 degrees (for 30 minutes). I also first put them in cupcake liners, and filled each liner with 8 balls (pieces). I ripped each precooked biscuit into 4 pieces, so I needed both tubes of biscuits, of course. I put 8 biscuit balls (pieces) in each cupcake liner without spraying the liners; it worked out well because none of the monkey bread biscuits stuck to the liners! I put the monkey bread in the oven without the butter/brown sugar/cinnamon mixture on top. That’s because some cooks were saying they got hard monkey bread if they did that. So instead, about 15 minutes into the cooking time, I put a little bit of the mixture on. I returned them to the oven and cooked them for 15 more minutes. When I removed them from the oven, I poured the remainder of the sauce over the monkey bread muffins. I removed the monkey bread to a plate after about 5 minutes to cool them, so the glaze wouldn’t get hard and make the monkey bread hard. After a few minutes my husband, a friend, and I ate some. We removed our liners and pulled our monkey bread apart. It was the best monkey bread I’ve ever eaten in my life! And I could never make monkey bread before! Mine has always been hard as a rock. By the way, several hours later it’s even better! I’ll definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Billy Rosas Ramirez"
},
"reviewBody": "We give it four stars. The recipe could use some cinnamon. We used pumpkin spice instead of apple spice and it came out very good, so we highly recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JChico"
},
"reviewBody": "I use the large biscuits, get 8, bubbles over, only cook for 12 min. And I love them! Recipes can vary, that's part of cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie"
},
"reviewBody": "5 stars for how easy these are to make. 4 stars for flavor. I think next time I'll add chopped nuts and maybe more cinnamon. Perhaps cloves, orange flavoring, &amp;/or a little icing. I used Grands. Cut each in 8 and used all 8 pieces for each standard size muffin cup. Used well greased teflon pans. Baked at 325 for 20 min in a convection oven. After each cooled about 5 min, I twisted each easily in its spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "Super easy, love the individual portion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberlina Rodriguez"
},
"reviewBody": "mmm... so good! And very, very easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia Weaver"
},
"reviewBody": "This is very good so I gave 5 stars. My husband said \"This is darn good monkey bread.\" However, it did set off the fire alarm. 2 Tbsp per cup is way too much butter mixture. I didn't even put all 2 tbsp and it still boiled over. When she says to put 4-5 pcs in each cup, that's if you use the Grands Pillsbury biscuits. It was done in 16 minutes and was actually saved by the bell. Any longer would've burned it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pat_ama"
},
"reviewBody": "Good flavor but 20 min. for a bundt pan is not enough time since is still raw in the middle!! Needs at least 10 more minutes...believe me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jesspet"
},
"reviewBody": "These were easy and delicious. I halved the recipe, used cupcake liners and cut the biscuits into 6 pieces each. I got 6 \"muffins\" out of one can of biscuits. I also added walnuts. I lowered the temp to 375 and they cooked for about 15 minutes. I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChicaInBlue"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "Call me crazy but I just had to add a little \"healthy\" to my recipe. I added 1 tablespoon of golden flax seed to the sugar mix. No one noticed! They loved it ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Charmin"
},
"reviewBody": "The tops burned, but overall it was an average recipe that would work better in a bunt pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Pierce"
},
"reviewBody": "Omg so delicious and simple! Big hit with the grands!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Donald"
},
"reviewBody": "Made this for my kiddo. He loved it and I should of doubled, if not tripled the recipe. Easy, quick, and enjoyable!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AZRealtyMom"
},
"reviewBody": "Disappointed! They came out hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ldavido"
},
"reviewBody": "1/2 of each sugar mixture, jumbo muffin tin, bake time shorter (did 18 this time, maybe try 16?)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jennyk"
},
"reviewBody": "Rock hard even after 15 minutes. Only a burnt butter taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna Licht"
},
"reviewBody": "So good! My only problem was that my biscuit dough grew a LOT and the gooey sauce spilled all over! But that was probably my fault for filling the muffin tins too high. They still turned out absolutely delicious though, and I'll definitely be making them again! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABP1522"
},
"reviewBody": "This was simple &amp; delicious! Perfect for Christmas breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cgm"
},
"reviewBody": "so yummy. Did make a few changes: I did not use white sugar only brown and I used frozen buns, defrosted and cut into quarters. Put 1 bun (4pieces) in greased muffin tin and let them rise for a couple hours. Baked @350 for 20min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin Miethke Eastin"
},
"reviewBody": "I would do 15 minutes next time. 19 minutes burned the tops. And it made 12 cups, not 8! Very good and super easy!!! Kids love em"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pauline07"
},
"reviewBody": "Made this for Brunch one lazy summer morning and it tasted great! Sweet with a light crunch on the surface of the bread and a soft biscuity center. Thanks for the recipe! Tastes great in the morning with a class of milk and some berries. \n\nNotes: \n\n-I added a scoop of vanilla protein powder into the cinnamon-sugar mixture to make it a bit more filling. It added an awesome vanilla taste and I'd definitely do that again.\n\n- This recipe makes a lot more than estimated. I halved the recipe and ended up with nine. The cinnamon sugar mixture-- ok, I'll admit, adding the scoop of protein powder probably increased the leftovers by a lot, but you will get more than you bargained for. This is best for mornings when you've got company. Half the baking time, too-- I saw that advice in another review and good thing I kept checking, otherwise they would have burnt. \n\n- I used raw sugar for both the brown sugar and the white sugar as a substitution-- we had no other sugar around the house. It did fine. In fact I used the same sugar-cinnamon-protein powder mixture that I did for the coating of the biscuits in the butter mix, which cut down on my leftovers in that respect. \n\n- I think next time I'll add some shredded carrots into the middle of these-- I didn't think about it this time but I think it would have tasted pretty good. \n\nAwesome recipe that I highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Thomas"
},
"reviewBody": "They were amazing! I just put the sauce on afterwards. Delicious :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buffyable"
},
"reviewBody": "This recipe was super easy and my kids lived it with extra spray butter after they came out of the oven! Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanseab"
},
"reviewBody": "We loved this easy recipe! I tried to use my Apple slicer to cut the biscuits up but, it didn't work. I think it was too dull. So, I used scissors and cut the biscuits in half then in thirds. The kids loved helping and they went crazy for them. The only thing I did different was bake at 350 for 16-18 mins and add toasted walnuts. I watched these babies like a hawk because I was worried they would burn. I made them in a mini Bundt cake pan and the rest in a cupcake pan. I must say that they were adorable as mini Bundt cakes. \nThe sticky butter goo was the best part so, next time I will make a half batch more. So, cute and yummy! And it's true there was no uncooked middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justme"
},
"reviewBody": "Jarod and William got up this morning and made this they had a lot of fun!! They made a mess but if you lay everything out on a cookie sheet when doing it the mess is contained to the cookie sheet and is not all over your cabinets!! Very easy clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "4everbaking"
},
"reviewBody": "Great idea using muffin tins. If you are a cinnamon lover you can increase the cinnamon a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Fast and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "The recipe is very easy. I used a home made baking powder biscuit mix rather than store bought. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madeline"
},
"reviewBody": "Loved this recipe. I cut the ingredients in half because I live alone. Turned out amazing and shared with my neighbor. I also turned the oven down to 350 degrees as suggested and only baked them for 10 mins. Simply delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H. Myers"
},
"reviewBody": "The kids loved this recipe! I baked at 375 for 20 minutes. For a glaze, I microwaved a jar of cream cheese frosting for about 30 seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Crystal12345"
},
"reviewBody": "400 degrees for 20 minutes and you will have charcoal! I checked on them at 14 minutes and they were barely salvageable. I wish I would have read the reviews like I usually do. Next time I will go with 350 and check after 10 minutes. I am giving a low rating because the temperature and time are so off, but I am sure the flavor is good if not burned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LisaMC"
},
"reviewBody": "I'm just not sure. I cut the recipe in half because there are only two of us. It was not special tasty. Will try another Monkey Bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katrinaajensen"
},
"reviewBody": "Made this recipe this morning and I loved it even more than regular Monkey Bread! I used one 16oz pkg of Grands which worked perfectly. \n\nI think it is easier for the monkey bread to cook evenly in the small portions than in the regular large monkey bread pan. \n\nEven my little brother, a monkey bread connoiseur, gave the stamp of approval"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Just fed my trash can a pan of monkey bricks. If you try this, use a 350 degree oven and place 7-8 pieces per muffin. I'm back to making them in a taco salad baking tin. The smaller pan keeps them moist and I've never had the mushy centers that were mentioned in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Just fed my trash can a pan of monkey bricks. If you try this, use a 350 degree oven and place 7-8 pieces per muffin. I'm back to making them in a taco salad baking tin. The smaller pan keeps them moist and I've never had the mushy centers that were mentioned in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Ross"
},
"reviewBody": "delicious and easy. Used the tip of a previous reviewer to use my apple slicer, which made prep super easy. This gave me 7 small pieces. I also put the sugar and cinnamon mixture in a zip top bag for easy coating. I used a cupcake tin since I don't have the larger muffin tin. I just need to adjust my baking temp and time. These were gobbled up, especially when dipped into the Cinnamon Bun Icing recipe by 'asilmarie.'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MooLaMoo"
},
"reviewBody": "This monkey bread is fantastic and so simple the only thing I do differently is I add chopped walnuts. After reading all the reviews one thing that is not clarified is what size muffin pan are you using. I have a muffin pan that holds 6 rather large muffins and I have a cupcake pan that holds 12 muffins/cupcakes. My point is it depends on which pan you use as to how many pieces you put in each cup and what length of time in the oven. So 8-10 pieces vs. 4-5 pieces would depend on what size muffin pan you use. In any case I do agree the oven temp should be 350 degrees, not 400 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "muddyh2os"
},
"reviewBody": "I don't know if my rating should count since I modified the recipe but here's what I did:\nI used apple pie spice instead of cinnamon. I placed 4 pieces the spice coated dough into the muffin cup then added a tablespoon of apple pie filling &amp; topped with a couple more pieces of dough before adding the butter mixture (also made w/apple pie spice).\nThe result was great &amp; well loved. My sister-in-law already requested it for Christmas breakfast! One \"muffin\" was very filling! This is one recipe I will make again &amp; again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rakuzen"
},
"reviewBody": "Delicious! A super kid-friendly recipe, too. My 7-year-old brother helped make it all, the only thing I had to do was supervise and help get the ingredients. My only problem was the cook time; at 17 minutes it was already burning. I would definitely make this again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomT"
},
"reviewBody": "Great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaraB"
},
"reviewBody": "I think there is some confusion with the recipe. There's a review out there where the creator says there's a typo and to put 8-10 pieces in a cup. I think a lot of people missed that and got burnt results because they only used 5 pieces. I used 10 pieces in each and it seemed just a bit too much. I highly suggest making 10 muffins with 8 pieces. As others have mentioned, the sugar-cinnamon mixture is way too much and there's a lot left over. Half it, at least. I cooked it at 400 degrees, but started to get nervous and turned it down to 350 degrees for the last 8 minutes. They didn't burn and were a great success. They did bubble over in the oven, though, and they were a bit too big, but they were loved by all. I might try mixing in other things in the future - orange peel, craisins, pecans, maybe chocolate chips..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissMeliss"
},
"reviewBody": "Love the idea of making this in muffin tins - I don't know why I never thought of that before! The only slight problem I had was that the muffins all kind of fell apart once I took them out of the tins - I'm wondering if this was because I cooked them for a few minutes less than the original recipe indicates. Fortunately, I wasn't making them for any sort of formal occasion, and they sure tasted great, even if they were all in pieces!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarlasKitchen"
},
"reviewBody": "Very good, I decreased the cooktime a little but it just depends on your oven. Glad to be done with mushy centers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlotte"
},
"reviewBody": "I made these this morning and followed the directions, but they burned on top before the 20 minutes were up. They also spilled out and made a mess in my oven. The ones that did not burn were delicious. I don't know whether to just shorten the cooking time, or lower the temp. for the next time. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NICOLE1019"
},
"reviewBody": "Delicious and so easy to make. GREAT suggestion to whomever said, \"Put some aluminum foil beneath your pan in the oven.\" It'll save you from a sticky gooey clean-up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1gdcowgrl gone"
},
"reviewBody": "I want to say 4 and half stars...they turned out almost perfect for me. Firstly, I thought I was feeding an army so I used 3 tubes of the really big biscuits! I just upped the amounts of everything else by a little bit ( I eyeball a lot of ingredients.) Made my own brown sugar by adding some molasses to the white sugar and threw in some crushed pecans in about half the batch. Thanks for such a great recipe, Kat! Usually when I make monkey bread in the budnt pan I end up with uncooked dough. That didn't happen with these. :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDA in STL"
},
"reviewBody": "We make monkey bread for Christmas morning and this is the first time we did it in the individual muffin tins. It was SO much better! It baked faster and each \"serving\" was crisp and gooey - way better way to make it. We'll be doing it this way every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "breebe13"
},
"reviewBody": "This recipe was alright if you turned down the oven to 350 degrees F and cut the cooking time in half. The first batch I made was extremely burnt. Also this recipe makes 16 servings with 5 pieces in every cup and you only need about a 1/2 cup or less of sugar and a 1/2 tablespoon cinnamon for the biscuit pieces to be coated in. Using 3/4 cup sugar and 1 tablespoon of cinnamon is a waste because you end up with a lot left over, almost as much as you started with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Piggyluver~!"
},
"reviewBody": "This was very good~! I have tons of extras, and i made this with a cinnimon frosting. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mstammi"
},
"reviewBody": "These were pretty good and easy to make. Kids loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3BOYSMAMA"
},
"reviewBody": "FANTASTIC! Both tasty and super easy. I only had a can of Grands buttermilk biscuits so I cut them into eighths. Following the advice of a previous poster, I used the entire muffin tin and they fit just right. Also baked at 350 for about 13-14 minutes. My 15 year old son said he thought he and I could probably finish off the whole batch before hubby gets home....tempting! Thanks so much for sharing a great new addition to my recipe file."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "Love these!!! I added a drizzle of vanilla glaze to the tops of these and they were just perfect for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KEDY"
},
"reviewBody": "Some of the portions are off in this recipe, and as another reviewer stated, they need to be baked at a lower temperature for a shorter time to avoid burning and hardening. I used the whole pan of muffin cups: 12, because there were too many pieces to fit into only 8 muffin cups. Also, next time I'll cut the white sugar to 1/3 cup. I used 1/2 cup and it was still too much. Therefore, I cut that cinnamon in half. These are still delicious. Just need some tweaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sopes"
},
"reviewBody": "This was sooo easy to make, but I followed the directions to a T, and when I checked them after about 17 minutes they were black. I know my oven is right on, so I will have to try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "composter"
},
"reviewBody": "Quick and easy-great at a bar-b-q."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaay"
},
"reviewBody": "OMG so yummy! Super easy, but I had a bit of technically difficulty with mine. I won't let that affect the rating because they were so delicious. I love almost anything with cinnamon and sugar, so these are right up my alley. These should be a HUGE hit with anyone who likes cinnamon rolls. I can totally see myself making these in the future and drizzling a vanilla glaze over them when serving. The issues I had were that I couldn't find 7.5oz packages of biscuits so I bought 1 package of 16.4oz biscuits. Since it was a little bit larger amount I made 9 portions. But the biscuits were Pillsbury Grands, which I think filled the muffin tins a bit too full. The biscuits definitely should be regular size NOT Grands because I poured the butter mixture over the biscuit pieces and while baking some of the sauce bubbled out and into the oven (and I still had a bit of the sauce left over that wouldn't fit in the pans.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindaLou"
},
"reviewBody": "One thing I don't like about some Monkey Bread recipes is that they are too greasy w/butter, so I halved the butter, brown and cinnamon and it worked fine. I couldn't find regular bisquits, only the Grands, so I used crescent rolls and they did the trick. I made these for dessert and they were just right. I might even add pecans next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VASSHE"
},
"reviewBody": "These are very good when you bake them at 350 for 10-12 min. Baking them for 20 min. at 400 is way to long and way to hot, it burns the sugar and makes the bread to hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crumblingcookie"
},
"reviewBody": "We LOVED, LOVED, LOVED this...soooo easy ans soooo good.... I did make extra butter and sugar sauce to drizzle over the top after baking and cooling... YUM...!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Pike"
},
"reviewBody": "OK; this may sound crazy, but I decided to try making these for a dinner side dish and instead of making them sweet, I used garlic and not cinnamin/sugar with the buter. My family went crazy for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pstock"
},
"reviewBody": "Good flavor. Butter, brown sugar and cinnamon mix turned rock hard upon cooling. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey17x"
},
"reviewBody": "Yummy, Never heard of monkey bread before and I wanted to make cinnamon buns so this was perfect! I like that it pulls apart in different little pieces. I didn't have pre made biscuit dough so I made my own and it turned out great, thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherbear1"
},
"reviewBody": "These were much simpler than my mothers recipe. Very good for being such a quick thing to throw together. Also one thing we usually do with our monkey bread is after removing the pan from the oven, let it cool about 5 minutes and then run a knife around the edges of each muffin cup to loosen them, then flip the tray upside down on a baking sheet and let it set a minute for the gooey-cinnamon topping to go down on the top of the muffins. Then remove the tray."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bj's Ellie"
},
"reviewBody": "These were so good and so simple to make. They came out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Dressler"
},
"reviewBody": "I make this with cupcake liners and put a scoop of apple pie filling in bottom then roll the dough in sugar cinnamon and apple pie spice....then I add the brown sugar and butter over the top. My grandsons love this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cleomobile"
},
"reviewBody": "DEE-LISH! This just looked so good when it came out of the oven I couldn't wait for it to cool! It was so yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AGHartfelder"
},
"reviewBody": "I made a half portion of this recipe, because it was only for my husband and myself. It turned out perfect. Went great with a nice cup of afternoon coffee. It's really easy to make, but oh so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is great! i love the muffin tin idea, it bakes so much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PEARLIE5"
},
"reviewBody": "this is great! i love the muffin tin idea, it bakes so much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I used a homemade bread recipe (Portuguese Sweet Bread I) but followed the recipe exact otherwise. My family fell in love with this all over again. It was nice to have perfectly done monkey bread and no raw spots. Thanks. NOTE: Kathleen is exactly right. Spray the heck out of your muffin tins or you'll have a mess on your hands."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "This is my recipe- 2 things: Cooking spray is missing from the ingredient list and you will spoon about 2 TBS of the butter/brown sugar mixture over each muffin. The original recipe was also edited- you should fill each muffin cup until full (8-10 pieces) of biscuits, not the 4-5 pieces as listed here. Enjoy!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214153/monkey-bread-made-easy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/346/bread/pastries/",
"name": "Pastries"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/354/bread/pastries/monkey-bread/",
"name": "Monkey Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214153/monkey-bread-made-easy/",
"name": "Monkey Bread Made Easy"
}
}
]
}
}
, "about": [
]
}
]