				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Monkey Bread with a Twist"
,"datePublished": "2020-06-18T23:27:11.000-04:00"
,"dateModified": "2020-06-18T23:27:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Linda"
,"url": "https://www.allrecipes.com/cook/2248046"
}
]
,"description": "This monkey bread uses chopped apple to add a unique spin on the family favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/VhZCXqZTF4jddqNTuBE8MK3WTXo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1655244-53cf174b725a4cb0bdf9d2200551a0fe.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Monkey Bread with a Twist"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "102"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "385 kcal"
,"carbohydrateContent": "59 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "756 mg"
,"sugarContent": "33 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup white sugar",
"2 teaspoons ground cinnamon",
"3 (12 ounce) cans refrigerated biscuits, separated and cut into quarters",
"3 apples, peeled, cored, and chopped",
"0.5 cup margarine",
"1 cup packed brown sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an oven to 350 degrees F (175 degrees C). Grease a tube pan."
} ,{
"@type": "HowToStep"
,"text": "Combine the sugar and cinnamon together in a large sealable plastic bag; add the biscuit dough in batches of 6 to 8 pieces and shake to coat. Alternate layers of the chopped apple and the coated dough pieces in the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Melt the margarine in a small saucepan over medium heat; stir the brown sugar into the melted margarine. Bring to a boil; cook at a boil for 1 minute, remove from heat, and pour over the apple and biscuit layers."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until cooked through, about 35 minutes. Allow the bread to cool in the pan for 10 minutes before turning out onto a plate to serve."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindawah"
},
"reviewBody": "I thought it was great! Everyone loved it. It was my first time making Monkey Bread and it was easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Mia"
},
"reviewBody": "We made this Christmas morning. It's quick to put together, not too long to bake. The hardest part is letting it set before turning out to eat it up. Pretty darn sweet, definitely appreciated the soft apples in it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcella"
},
"reviewBody": "my family loved the addition of apples"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Kotchan"
},
"reviewBody": "This was really tasty and pretty easy to make. I cut back the sugar a little to accommodate my own tastes, but otherwise it's a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Morse-Wendt"
},
"reviewBody": "Cover with foil after 15 minutes. Half in 8x8 pan might be more reasonable for 2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathy"
},
"reviewBody": "This was really good and gooey. I did as other suggested and only used a half cup of white sugar. This was such an easy recipe to make. Much easier than using the frozen bread dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LindseyS"
},
"reviewBody": "GREAT RECIPE! What a great way to wake up the family! I followed this recipe pretty much to the T. Except... I don't buy margarine, so I used butter instead and I added chopped pecans to the apple layers. As some of the reviews stated, there was cinnamon/sugar left over. I had about 1/4 cup remaining, so i just topped that off with the brown sugar, (3/4 cup) instead of tossing yummy cinnamon/sugar. Thank you so much for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee Bakes"
},
"reviewBody": "This is so delicious!!! I did add vanilla to the brown sugar and butter after I removed it from the heat. I also made my own biscuit dough which there is a super easy and quick recipe on allrecipes! I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terryleav"
},
"reviewBody": "I only made 1/3 recipe in a loaf pan. My grandkids loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JW"
},
"reviewBody": "Made it for Christmas morning and it disappeared in a flash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roberta Wilder"
},
"reviewBody": "Tastes great, but the suggested cook time of 35 minutes was not near enough. Dough was still raw in the middle. Had to put it in a shallow cake pan and cook it another 30 minutes to get all the dough cooked, at a lower temperature, 325 convection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "Love this recipe. Very simple but I did make a couple of changes. First off, I use only 2 cans of biscuits as it cooks much better. When using 3 cans it is usually still too doughy in the middle. Also, instead of using fresh apples, I use a can of apple pie filling and layer it between each round of biscuits. And as other reviewers have mentioned, I did cover it with Reynold's Wrap after the first 15 minutes to keep it moist while baking.\n\nOne word of warning though: when in a hurry and reaching for a bottle of ground cinnamon, do not grab ground red pepper by mistake! It was definitely an eye-opening experience."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Pelzel"
},
"reviewBody": "I added some pecans to the bottom of the pan and replaced the margarine with butter. I ended up cooking it an extra 5 minutes (40 minutes total) with foil on top after the first 15 minutes. It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rondi"
},
"reviewBody": "I added almost twice as many apples which was a little to many. I also only had 1 16 oz can of biscuits. This turned out very well and having tonight with a scoop of vanilla ice cream! It is delicious, I had to sample it????! Would definitely make again with 5 apples instead of 6 and also do 2 12 oz cans of biscuits but this is delicious ??! Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Phillips-Bailey"
},
"reviewBody": "I added pecans and a few raisins. I didn't have regular biscuits so I used 1 can of cinnamon rolls and 1 can of crescent rolls. Wonderfully, sweet, sticky and yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Murray"
},
"reviewBody": "This was amazing! We love apple pie, so this was a great option for us. next time we will cut the recipe down in thirds and use a loaf pan. the whole recipe makes more thank we can eat in a week....but what a treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicole"
},
"reviewBody": "Delicious! Only difference I did was using 2 apples and a tsp vanilla to the brown sugar butter sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erinwise87"
},
"reviewBody": "Used butter instead of margarine, 2 apples instead of 1, and it was a huge hit at our Christmas Eve brunch!! Had a few people ask me for the recipe afterwards and said it was the best thing they had eaten all weekend. Next time I'm going to add pecans. Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darbaker"
},
"reviewBody": "This is delicious! I had one 16.3 oz biscuit roll so cut white sugar to 1/2 cup, 1 tsp cinnamon, used one large Late Melrose apple. Heated 1/4 c butter &amp; 1/2 c. brown sugar. Sprinkled chopped hazelnuts on top. Baked for 40 minutes in a bread pan. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chilibowl"
},
"reviewBody": "I must admit I didn't have a bundt pan. I used my cast iron pot and put a steel can in the middle. Then I placed the ingredients around the can as directed. The flavor was really tasty but the bread didn't cook as well as I would have liked. Everybody that ate it were very happy with the taste. I will do it again but with the proper pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanclaners"
},
"reviewBody": "This recipe turned out great! I made it for brunch, and everyone loved it. It was funny! You would have thought it was gourmet they were raving about it so much. I think next time I would add toasted pecans to the caramel sauce. Also, I've had trouble with Monkey Bread baking properly in tube and bundt pans, so I made this in a 13 x 9 pan, and it baked perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Could have been delicious but cooked the time listed and it was completely raw on inside. Probably needed to cook about 55 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Ritter Sykes"
},
"reviewBody": "This is the closest recipe I've come across to the Monkey Bread I've been making for a decade or more now. To simplify prep, I cut up canned cinnamon rolls and skip tossing in cin/sugar mix. In addition to two large Honeycrisp apples, I always throw in a handful or two of golden raisins. They plump up deliciously and add so much flavor. Loosely cover with foil halfway through baking and drizzle the icing from the rolls after flipping from bundt pan for the perfect finish. House favorite from all ages!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy Clark Vales"
},
"reviewBody": "I love this! It is super easy to make and the apples make a great addition! Made it exactly as written, but used a bundt pan...it came out of the pan with no problem. Follow other notes and cover with foil near the end to keep from getting to crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adzac"
},
"reviewBody": "I used bread dough for this recipe and it was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Lorio"
},
"reviewBody": "KIDS LOVED IT!!! YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelrazzle"
},
"reviewBody": "I have been making this recipe for my family for a few years now. I don't add the apples since I have some picky kiddos, but I'm sure they make it even better. It cooks up perfectly in 35 min and tastes great. One daughter had monkey bread at camp and said that mine was so much better. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sevenpaws"
},
"reviewBody": "Used butter instead of margarine. Pineapples instead of apples since our apples were out. Seriously beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roseanne"
},
"reviewBody": "I have been drooling over these monkey bread recipes forever and I am glad I finally tried this one. So easy and Delicious! I added pecans for a delicious crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Walnock Bitting"
},
"reviewBody": "Very moist. I got loads of compliments when I made this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SuzieQ"
},
"reviewBody": "Perhaps it has been too many years since I have made this recipe but when my husband said he was hungry for it I stumbled upon this recipe. I thought the apples would make a nice addition so would try.\r\nI used a tube pan which I am assuming is an angle food cake pan. DO NOT USE anything other than a bundt pan. Even after having a cookie sheet under my tube pan I have a sticky mess on the floor of my oven. And like another viewer mentioned, after 35 minutes the biscuits on the bottom were still raw. I know it's a good recipe and I will try the addition of apples again but using a different pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Cupedro-Miyashiro"
},
"reviewBody": "Turned out perfect! Only used 2 cans of Grands biscuits. Filled up the entire large bundt pan. Very sweet but a big hit! Gone instantly!????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Carleton"
},
"reviewBody": "Made this to accompany a breakfast casserole for a large group of people. They loved it! I used two Granny Smith Apples and added raisins and pecans. Baked it my bundt pan five minutes longer than directed, on convection. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alyssatuchel"
},
"reviewBody": "I baked the apples before I added the biscuits just to make sure they would be soft enough. I tosses them with alittle cinnamon and sugar and a small amount of apple juice. Baked at 350 for 10 min. Then I followed the recipe listed above. I had to take my loaf out 3 min before 35 min... Because my biscuits rose too much, the apples and sugar poured out of my pan and burned at the bottom of the oven! Atleast I know the smoke alarm is still working! Lol. Overall, great addition to our Easter brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "RA's Recipes"
},
"reviewBody": "By the time I chopped the apples and nuts, cut the biscuits and then shook them, and then arranged by layers, I had spent close to 45 mins. When I tipped onto the plate, the bottom was raw. So I put back in and cooked another 15 mins, but was still raw, so added another 15 mins. It is still raw throughout so I'm done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Foister"
},
"reviewBody": "tried this recipe with my girlfriend it was awesome and great hit did it just like some people reviewed if you want us recipe that's quick and easy and great for the holidays try this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Turtle"
},
"reviewBody": "I don't have a bundt pan, and it's only my husband and I eating it, so I shrunk the recipe down a bit, using two cans of biscuits and halving all the other ingredients. I baked it all in a loaf pan and it turned out heavenly. It's very rich and sweet, but that is exactly what I was going for when I decided to make monkey bread. The tartness of the apples is a great addition. It didn't cook all the way through in the middle, but that is probably because my loaf pan was full to the top. Even the undercooked part is super tasty (plus, it probably would've cooked through if I'd only used 1.5 cans of biscuits). I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "This was so scrumptious! The entire family loved it. I did use unsalted butter instead of margarine and it turned out great. I also covered with foil after 15 minutes. Tastes even better with a scoop of vanilla ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Venosh"
},
"reviewBody": "family loved the \"twist\" with the apples. This will be my go to recipe for monkey bread from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "This was delicious! Everyone seemed to love it, even though I should have baked it for longer than the 35 minutes as stated. Will make again. Next time, leave room at the top of the pan as it rose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CanCanGirl5"
},
"reviewBody": "Great Results! I used fresh store bought pizza dough balls (I already had 2 on hand) instead of canned biscuits. I did not have apples but I did add a half cup chopped pecans and a teaspoon of vanilla flavoring to the syrup mixture AFTER IT COOLED. So delicious. I will be making this for the SuperBowl party :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "davelyn d"
},
"reviewBody": "I had one small granny smith apple (lunch box size) and I chopped it up to add after I had added the biscuits into the bundt pan. Loved it!! I did 3/4 of the butter and 3/4 of the brown sugar instead of it all. It worked perfectly. For Fall, I added some nutmeg and cloves to the cinnamon/sugar mix and it was a wonderful flavor addition!\nI read to cover with aluminum foil and that definitely was a wonderful suggestion!\nAlready ready to make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Gardner"
},
"reviewBody": "this was a huge hit. i was a little leery of using apples since we have always loved our monkey bread plain .. but it was a great touch. will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonicole2013"
},
"reviewBody": "I love this recipe!! I end up making it for everyone's birthdays, its soo much better than cake. I add walnuts and pecans and drizzle a cream cheese icing on it and its amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ATTITUDE65"
},
"reviewBody": "Very delicious recipe. My whole family loved it. I served it with sliced bananas on top and a scoop of vanilla ice cream. So yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSDAVIS21"
},
"reviewBody": "Very good, the apples were a nice addition! Maybe next time I will try peaches ! Thanks for the idea of switching the recipe up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rubee"
},
"reviewBody": "I have never seen refrigerated biscuits here in Aust. So I have to make the dough from scratch following the rest of the recipe and it is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BBecker"
},
"reviewBody": "Overall this was very good there was a problem with the edges being over done and the center being underdone but other than that it was very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "This was so very tasty. You can really play around with the ingredients (to taste). My family loved it. Super easy, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UTOPIA122"
},
"reviewBody": "Awesome recipe! Great recipe to make with your kids. Not only do my girls love shaking the bag, this is like their favorite breakfast. The apples really make the recipe. Try pumpkin pie spice instead of cinnamon for something just a little bit different. This is really a hit at our house!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindysue514"
},
"reviewBody": "I made recipe as directed and it was amazing! The second time I made it, I threw in some raisins and my tastebuds exploded with excitement! Great recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "We love Monkey Bread - I've made this again and again for years now and it's just superb. My daughter's band and classmates always ask for it! Not to mention the neighbor when they find out I've made it. Never any left overs. If you don't have refrigerator biscuits and dont want to go to the store, use baking mix, follow the insructions for biscuits and just pull off pieces of the dough - and proceed as usual. You can also use other fruits - and berries although if you do, brown sugar doesnt necessarily go with some fruit and berries, but white sugar always does - also, try adding a bit of vanilla to your liquid when mixing the dough (if using baking mix) or to the melted margarine (we use butter though) another thing I thought I'd mentin is that the cinnamon sugar does seem to be more than needed, but in my house, it goes into it's own little container and we use the leftovers for toast, or oatmeal or even the next monkey bread :) Wonderful recipe and versatile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Princess Whitney Rachel Crider"
},
"reviewBody": "this is the basis for any future recipe of monkey bread, but i made this to the tee (cept made my own biscuits, cuz i didn't have any premade) and it was quite too sweet. i loved the idea of apples, but next time i will add a LOT more apples. also, please clarify next time NOT to coat apples with the cinamon/sugar mix. because, at first i thought you were not supposed to, then i wound up with WAY too much of the mixture, so i was like, \"well, maybe they wanted you to coat them too..?\" so i made two seperate things, one with coated apples one with the apples NOT coated. one with them coated was WWAAAAAAYYY too sweet. so future reference to ANYONE: do NOT coat the apples in sugar/cinamon!! otherwise, i loved the apples. next time, probly will double or triple apple amount and leave everything else alone. also, i think it was a complete waSTE to make that much sugar cinamon, if you barely even use HALF of it!!?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alberta Rose"
},
"reviewBody": "I added this to a brunch buffet, specifically for the kids, but it was popular with everyone. I would recommend cutting down on the sugar/cinnamon mixture as it makes more than necessary, otherwise change nothing. I took the hint from another reviewer and covered loosely with foil near the end of baking. A great addition would be chopped walnuts or pecans if allergies aren't a problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smitty"
},
"reviewBody": "This was AWESOME - have made it 3 times in the past week! I cut up my apples (right off my tree) and put them in the sauce, which gave them a chance to cook a little before baking. I also put my monkey bread in a jelly roll pan, baked the same amount of time, covered them for the last half of the time and everything turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy camper"
},
"reviewBody": "This was the best monkey bread I have ever had. Very moist and full of flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Katya"
},
"reviewBody": "We've tried many different monkey bread recipes and this one is a keeper! I know what I'm making when the kids come home from college! The apples really make this special and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christy sitek"
},
"reviewBody": "delicious, I only used one apple, and it was still great. I had one extra can of biscuits so I experimented with the leftover cin/sugar mixture. I made just like the recipe but used maraschino cherries halved and also poured a little juice into mixture..very tasty. Will use this recipe again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookin4Boys"
},
"reviewBody": "loved this with the fruit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bberte"
},
"reviewBody": "I love the addition of apples!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loves to cook"
},
"reviewBody": "I made this for my very pregnant sister who is obsessed with apples. Being someone who is not a fan of cooked apples, I was surprised at how anxious I was for this to come out of the oven. It turned out delicious ! Thank you for sharing such a great recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dynamic Angel"
},
"reviewBody": "Very delicious recipe. Recommended for family gathers. I just did it with a little twist by putting a few quarters and a bit of apples in muffin tins and drizzling some of the cinnamon topping on each. It gave the family and friends their own mini loaf to try. It turned out mmmmm good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DentalCook"
},
"reviewBody": "Excellent! The only changes I made was to use slightly less biscuits (30 oz vs the called for 36oz), 2 Granny Smith apples, added a little nutmeg, a little vanilla and Smart Balance. The changes I made were to avoid the problem of having it boil over. I used a Bundt pan and had no issues with it burning my oven. \n\nSeriously, this was DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TEESA2YOU"
},
"reviewBody": "Yummy,easy,fun to make with the kiddos. I used 1/2 cup of sugar and a little over 2 tsp of cinnamon. Which was plenty to coat the biscuits. No need to use a whole cup. This was there was no waste. I only had 2 apples on hand and that was fine. I also took a tip from other reviewers and covered it with foil while baking. We made these Christmas morning! And my house smells wonderful. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy and delicious! I added chopped walnuts too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie T."
},
"reviewBody": "Easy and delicious! I added chopped walnuts too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rmjoyner4635"
},
"reviewBody": "This recipe is so simple yet delicious!!! I loved the apples ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "footballgrl16"
},
"reviewBody": "My husband loves regular monkey bread, i love apples, so we decided to give this a try. I thought it was pretty good, but my husband didn't much care for it. I did cheat and use Musselman's chunky applesauce, and it worked great and I only had to cook for the regular amount of time (20 min). I also added about 1/2 c chopped walnuts, and we both agreed that this was a much needed and positive change to regular monkey bread as well. If you make this for 3, like I do, I use 1 can of biscuits and a loaf pan. I also usually cut up the biscuits into small pieces with kitchen shears, then coat with cinnamon and sugar and stir, followed by only 1/4 c of brown sugar and top with the 1/2 c melted butter and a little extra sugar. This makes it crisper than boiling the butter and brown sugar, if you prefer it that way. My biscuits said to cook at 400 for 15-20 min. It was a nice change from the regular, but I will stick to the plain recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "egoogs"
},
"reviewBody": "This was delicious! A huge hit with the party I brought it to - lots of people asking for the recipe. Be careful not to stack the biscuits too high - the middles ones had a little trouble cooking, but it turned out great :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky E"
},
"reviewBody": "This was an excellent way to change up monkey bread! The apples definitely added a welcome tart taste. I did not use exact measurements with this recipe but it's the kind that you can't mess up too badly by estimating. Whenever I make a baked caramel dish I add a half cup or so of cream to the caramel mixture to make the caramel soft instead of super sticky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Yummy! I used 2 apples (Braeburn and Granny Smith), butter because I was out of margarine, but followed the rest of the recipe as written. I don't have a smooth tube pan, so I sprayed my fluted bundt cake pan with butter flavored Pam and it turned out very pretty. This was so incredibly tasty! I did follow two other reviews and laid a sheet of foil over the top after 15 minutes of baking to prevent hardening and I placed a large foil covered cookie sheet underneath to prevent a mess on my oven floor if it bubbled over (which it did just a tad bit). Next time I will use 3 apples and margarine, but I'm sure it will be just as fantastic as it was this morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "lll"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie Lynne Nearing Roth"
},
"reviewBody": "This had very good flavor. Make sure to put something under it so you don't make a mess out of your oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flower Girl"
},
"reviewBody": "Made this for Mother's Day brunch. Everyone loved it. The sweet taste and cinnamon apples were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TTV78"
},
"reviewBody": "Perfect! We love this cinnamony apple goodness for a weekend breakfast! The apples are a great addition to monkey bread. I also like to add chopped walnuts or pecans. Since it's just the two of us, I halve the recipe and bake in an 8x8 square pan and that works out great! Thank you for the yummy recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrookeB"
},
"reviewBody": "very good just like the recipe says!! Made no changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "I loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jo Moeller"
},
"reviewBody": "I made this recipe but layered chopped pecans with the apples. Loved this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Graham"
},
"reviewBody": "OUTSTANDING! The only change I made to this recipe was that I only used 2 apples. The next time I make this recipe, I will only use 1/2 cup of white sugar with 2 TBSP of cinnamon as I had a lot of waste, but I really like the cinnamon flavor. This is a Keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kay"
},
"reviewBody": "This was REALLY good. Would be great for a brunch or Christmas breakfast. My only suggestion would be after about 15 mins in oven you might should cover with aluminum foil to prevent the edges from overcooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcjewell"
},
"reviewBody": "My husband loves this! I added a simple cream cheese glaze on top, but it didnt really need it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri"
},
"reviewBody": "This was good! I took this to a work lunch and everyone really liked it. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chef x"
},
"reviewBody": "a very interesting taste apple and cinnimen were classic flavors and it all worked well"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/133719/monkey-bread-with-a-twist/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/346/bread/pastries/",
"name": "Pastries"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/354/bread/pastries/monkey-bread/",
"name": "Monkey Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/133719/monkey-bread-with-a-twist/",
"name": "Monkey Bread with a Twist"
}
}
]
}
}
, "about": [
]
}
]