				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Movie Star Popcorn"
,"datePublished": "2018-06-08T09:49:17.000-04:00"
,"dateModified": "2018-06-08T09:49:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kali Doogarsingh"
,"url": "https://www.allrecipes.com/cook/2419979"
}
]
,"description": "Make popcorn the old fashioned way -- on the stove top!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/F3f8djrEx9VSxEMgw6etSHmZxe0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7059414-0c12eb1ec06e4ce5b9a79cb7061bd0c0.jpg",
"height": 1499,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6322317877112",
"description": "",
"duration": "PT28S",
"name": "How to Make Stovetop Popcorn",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/b8b476c7-4e9f-4607-af2c-281652070c79/b32e4484-dacb-44bb-987c-d1c87501cedb/1280x720/match/image.jpg",
"uploadDate": "2023-03-17T15:18:52.976-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Movie Star Popcorn"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "197"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "187 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "12 mg"
,"fiberContent": "3 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "266 mg"
,"sugarContent": "0 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
, "recipeCategory": ["Snack"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"3 tablespoons peanut oil",
"2 tablespoons butter",
"0.5 cup unpopped popcorn",
"0.5 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the oil in a 2 to 3 quart saucepan or pot with a lid set over medium-high heat. Pour in popcorn kernels and sprinkle enough salt to lightly cover the layer of kernels. Remember, you can always add more salt later. Add the butter to the pot and cover with the lid."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/F3f8djrEx9VSxEMgw6etSHmZxe0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7059414-0c12eb1ec06e4ce5b9a79cb7061bd0c0.jpg"
}
]
,"text": "As soon as the kernels start to pop, shake the pan back and forth across the burner constantly until the popping slows down. As soon as the pops are about 2 seconds apart, remove from the heat and pour into a serving bowl. Taste, and season with additional salt if desired."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnny Lade"
},
"reviewBody": "I saw the recipe, and it seemed so easy. I had to go to the dollar store and get the paper lunch bags. I bought the corn online and used a teaspoon of peanut oil. I put the corn and oil in a paper bag and added some salt. I set the microwave at 2 minutes. The corn was still popping after 2 minutes so I added 30 seconds. I took the bag out of the microwave and gave it a shake. I took a taste and it seemed to need something so I added some butter. Voila, it was like going to the show. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Harder"
},
"reviewBody": "I used pork lard in place of the oil, since i butcher and render our own pork, and the corn, then when it began to pop, i added the butter. I saw the butter start to foam up and it was taking a long time for the corn to begin to pop again, but i continued to shake it vigorously, and it all popped and it is simple amazing. Why didn't i learn this forty years ago when my kids were little?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen McDaniel"
},
"reviewBody": "Just like at movie theater, can't be it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mackenzie Bigley"
},
"reviewBody": "Try adding some pepper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buckwheat Queen"
},
"reviewBody": "I absolutely love this recipe. I make it all the time. I have started melting the butter in the microwave first. I use Sriracha salt, spicy oil, lime butter. Great method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia Hsieh"
},
"reviewBody": "used slightly over 1 tablespoon coconut oil and 2 tablespoons butter. can probably cut back a bit as it was a bit on the greasier side but it actually really does taste like movie theatre popcorn when I was a kid. I'm kind of afraid to find out what they're actually making the popcorn with now :(. I think probably 1/2 to 3/4 tablespoon coconut oil will be enough. and yes heating oils will create trans fat so it's best to use a saturated fat oil which is more heat tolerant. giant jar of coconut oil from Costco for cheap."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillian Shelffo"
},
"reviewBody": "I just did the oil for the perfect oil to popcorn ratio! It worked, just a little dry for my taste. Will use again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shelley Mahady"
},
"reviewBody": "Why are people giving 5 star reviews when they didn’t follow the recipe as written? I did, and ended up with burnt (as in black) butter on all the popcorn. Next time I’d add butter at the start of the popping maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JetLuvs2Bake"
},
"reviewBody": "OMG! Best popcorn ever! When I first tried it I kept wanting more! Thank you so much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ach.lee.x"
},
"reviewBody": "Look no further! This is the only recipe you’ll ever need to make popcorn. I used two tablespoons of both coconut oil and butter, placed in pot on medium-high heat. I placed 5 kernels in the pot, with some salt , and waited until they popped and then put in the remaining 1/2 cup in. Shake, shake, shake until pops are 2 seconds apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "The perfect pop!\nI have never used this method of adding butter/salt before the kernels pop.\nI used grapeseed oil, threw 3 kernels in, once popped added butter/salt and rest. \nEven my hubs who isn't a huge popcorn guy liked the balance of flavors. Great snack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "This is my new favorite way to make popcorn. Not even close to being low calorie, but it tastes way better than what I was making with my air popper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MAT"
},
"reviewBody": "I think using an air popper it's the best way to make popcorn. Add your salt and butter after the corn is popped"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flip"
},
"reviewBody": "I always make mine this way! Nothing is better! I only use blue popcorn and cook It in a whirley pop, it is much crunchier and tastier than the funny name brand! Hoosier Hill Farms Persian Blue from Amazon has worked best for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandraDcuisine"
},
"reviewBody": "So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kslighthouse"
},
"reviewBody": "Followed the recipe according to directions. My popcorn burned and the house stunk will stick with the recipe I usually use. Ended up throwing it out and opening the windows to air out the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathy Ulrich"
},
"reviewBody": "Thought the butter didn't help this. I make it in a heavy pot with oil and seasoned salt. I thought the butter would be good but I didn't taste it. I guess I just like it melted and poured on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eduwiges"
},
"reviewBody": "Great and simple. My brand of popcorn didn't pop very big, but the taste is really good. Hardly any kernels left un popped. Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Loehr"
},
"reviewBody": "This beats 'waving popcorn, and buying pre-made, hands down! Adding the butter &amp; salt during the cooking is so much easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki M."
},
"reviewBody": "I tried this recipe when our microwave was on the blink. We didn't have peanut oil so I used coconut oil and we have been using it ever since!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valerie7455"
},
"reviewBody": "I made it according to the recipe, and it was wonderful! I'll definitely be making this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blendabenda"
},
"reviewBody": "I've been making my own popcorn for years. The best pot to use is a wok with a glass lid. I may make it exactly as this recipe goes, or with canola oil rather then peanut oil, and I may add Italian seasoning, grated or shredded Parmesan cheese, or any of a number of other herbs or spices, or just as is. One of my favorite things to add after the popcorn has popped is fresh ground black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Fielding"
},
"reviewBody": "I've made this but used Piave cheese shaved over it, and just a smidge of salt - Piave is stronger, and salty so that's just a matter of taste - a very decadent party snack. Also I prefer to used authentic popped corn, rather than microwave bagged popcorn. Another trick to make it special is to pop the corn in coconut oil. MMM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GlenQuagmire"
},
"reviewBody": "Try using some leftover bacon grease instead of the vege oil to pop your corn ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie"
},
"reviewBody": "Delicious and easy! I wanted to try this now and didn't have canola oil or butter on hand. I used vegetable oil and margarine instead, it was fluffy, crunchy, buttery and delicious, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIZ&#9829;"
},
"reviewBody": "It really isn't that hard to make popcorn the old fashioned way. Definitely worth it if you like the taste of movie theater or carnival style popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elvira Silva"
},
"reviewBody": "Super goooood! and easy to prepare, I also used a whirley whirl and olive oil instead because I did't have peanut oil. Thanks sumitter for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cherealove"
},
"reviewBody": "It was okay, I will definitely make again, needed more butter and salt in it. But a easy way to get started thanks for that.;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy Carroll"
},
"reviewBody": "Basically good but with some variations: Start with three kernels. When they pop, pour in the rest. Leave the lid slightly ajar to let moisture out and make popcorn crisper. You don't need to shake the pan. Use Popcorn salt or pickling salt (extremely fine). Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Decker"
},
"reviewBody": "i always cook popcorn on the stovetop.. and i have a popcorn maker designed for use over open fires when we go camping! the best way to stop it from scorching is to have a little water in a nearby sink and just put it in the water long enough to cool it down a little.. but dont leave it long enough to cool off the popcorn.... it has to be hot! thinking of buying one of those whirly pots.. not sure if they work as well as they say though.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "olguint"
},
"reviewBody": "Love this recipe! Changes made based on other reviews: I used coconut oil (adds a sweet clean taste, not oily), keep the pan moving (reduces burning), put in 3 kernels with oil (when they pop, you know the oil is hot enough and you can put in the rest), and add butter at the same time as the rest of the kernels. Sea salt to finish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KRICKYR"
},
"reviewBody": "It's nice to know what's in your popcorn, you know? I have yet to use peanut oil--I use vegetable oil instead. The butter adds a great flavor. And talk about inexpensive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Soderstrom"
},
"reviewBody": "I grew up in the 60's loving popcorn on the stove and pizzas in the oven. All the new gadgets they come up with these days takes all the fun and flavor our of everything. Thank you for sharing your recipe with us, it was awesome tasting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzicat"
},
"reviewBody": "Im so glad to see this recipe. Younger cooks may not even be aware that one could make popcorn any other way than putting a bag in a microwave. And it is SO much better this way - definitely more FUN - and without the nasty chemical tastes (and smells) that I notice when Im forced to eat nuked popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucylove"
},
"reviewBody": "I made this tonight for an \"Oldest Recipe in your Recipe Box\" challenge. I used exact ingredients called for, including cheap bagged popcorn, not a premium brand, that I've had for about 3 months, and tonight it came out better than when I used my old stovetop recipe when it was fresh. I let the oil come to almost smoking before adding the other ingredients and had no problems with burning butter as some others did. The finished corn had a slightly darker golden color than if the butter is added after popping, but the taste was perfect. I did follow one reviewer's advice and vented the steam 3 times while popping. I think this helped keep the corn tender. I used a 5-qt. stockpot as 1/2 cup seemed like a lot of corn for a 3 qt. pan. I think the larger bottom surface was a good thing, too. I only had 24 (I counted them) un-popped kernels. That measured out to 1 teaspoon, better than any other method I've ever tried. This recipe gave me much better results than the microwave popcorn recipe I tried. Hubs and I both really liked it, and this is going right into my \"Easy Favorites\" folder to be my standard popcorn recipe from now on. Thanks for sharing this easy, delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BloomofSparks"
},
"reviewBody": "this is the only way to make popcorn the way the pilgrems did"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa"
},
"reviewBody": "This is an excellent base recipe. You can substitute almost any oil in place of peanut oil. I've used olive oil, coconut oil, vegetable oil, toasted sesame oil, etc. I always have extra virgin olive oil on hand, so that's the oil I usually end up using. I use whipped butter, white kernels, and then sprinkle some grated parmesan cheese on the popcorn once it's finished popping. Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyler's Mom"
},
"reviewBody": "This was SO good! I used smart oil instead of peanut oil since my son has a peanut allergy and it was delicious! Reminds me of the popcorn we ate as kids since my dad always made popcorn this way. So much better than microwave popcorn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denice"
},
"reviewBody": "Since going to the movie theater for the first time, my 3 yr old has been a popcorn nut. I remember my mom used to make popcorn this way when I was a kid so finally decided to do it the old fashioned way for my son. He LOVED it. Thanks for sharing and allowing me to share a childhood memory with my son of great popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "Growing up this is the only way I ever had popcorn at home. I don't think I'll ever eat microwave popcorn again! I did make one small change, I used cannola oil instead of peanut because I didn't have the peanut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Well, I tried it and the popped corn didn't get as light and puffed as when I used only oil in the pan. The butter turned a little burnt before the popping was done too. I will stick to popping the corn in oil only-then melting butter and tossing it into the popped corn with the salt a bit at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdicaArethusa"
},
"reviewBody": "Very good and easy. I think next time I'll use coconut oil, though, because it has a milder flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roke"
},
"reviewBody": "This is great recipe using coconut oil. Kadwell should do some research on coconut oil and will find out just how healthy it is :) To make this even more healthful use sea salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "magickmoon"
},
"reviewBody": "Ymmmmmie old fashioned popcorn. I use ready packaged for stovetop or radiant heater type of popcorn cooker rather than microwave from Harlanfairbanks. They use coconut oil and seasoned popcorn salt, as as much or as little of the oil/ salt as you wish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janisko"
},
"reviewBody": "Who woulda thunk it? LOL Using half butter and half coconut oil was amazing. And like another reviewer mentioned... coconut oil is no longer considered unhealthy and is in fact the healthiest of oils (do use organic). I used the 3-kernel system and when they popped I added the balance. It really does work well to have the fat properly heated. We topped ours with a good sprinkle of caramel pecan topping from Fireworks Popcorn in Wisconsin. They have amazing toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "Homemade popcorn is SO much better than microwave!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Callison"
},
"reviewBody": "You can also use virgin Coconut oil---it gives the popcorn an outstanding flavor without adding alot of salt or other seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whipnet"
},
"reviewBody": "Almost perfect recipe. But use coconut oil instead and will be perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyn"
},
"reviewBody": "I agree with the reviewer who questions why anyone would eat microwave popcorn when it is so easy to make great, much healthier stove-top popcorn. All one has to do is read the ingredients on the microwave junk to know that it cannot be good for you. This recipe was wonderful. I have tried it twice so far; I like to add different flavors. Once I did it with chili powder and it was delicious. Another time we used parmesan cheese. You can do a lot with flavoring. And I definitely like using a little real butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leigh Sheppard"
},
"reviewBody": "I highly recommend using coconut oil for several reasons. 1) You can get away with using only 2 TBSP oil to 1/2cup of popcorn, 2)it has a much higher smoke point than vegetable oil, 3)it makes wonderful tasting popcorn. 4)its being \"unhealthy\" is a myth. Just Google it and draw your own conclusions. I gave the recipe only 4 stars because 3 TBSP of oil is 50% more oil than you really need for 1/2 cup of popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Right. Will be selling the air popper on ebay post haste. How yummy was THAT? I won't make popcorn any other way from now on. This is really the safest, healthiest way and super easy. I followed the advice of a reviewer who said she added four tablespoons of butter and only one tablespoon of oil (I used canola). I really like buttery popcorn but I think I'll cut the butter back next time to three tablespoons because it was really rich/buttery with four tablespoons. I used \"I Can't Believe it's not butter\" stick butter straight from the fridge. I have an induction cooktop so I didn't really do the shaking thing as induction requires direct magnetic reaction to the bottom of your pot in order to heat well/evenly. It came out great. One tip: I sprayed the bottom and sides of the pan with cooking spray and nothing stuck. Yeeeeee-haw!! Fresh, safe popcorn. Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Gallagher"
},
"reviewBody": "Wonderful! I made it with Coconut Oil rather than peanut oil, and sprinkled it with Nutritional Yeast before serving. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SOUTHERN TRANSPLANT"
},
"reviewBody": "Have been making it this way for quite awhile now--very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A Saciuk"
},
"reviewBody": "This is one of the first things I learned how to make on my own and I've got the scar between my forehead from a freshly popped kernel to prove it! A couple of notes: Don't lift the lid until your popcorn is mostly popped - if you let out the steam it doesn't pop as well. As well, my husband and daughter love flavored popcorn. I found it best to add flavorings after the popcorn has been lightly coated with butter. We've tried microwave, air popped and stovetop popcorn with and without butter, and this seems to be the best method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raynorra"
},
"reviewBody": "Absolutely love this popcorn - it's fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lverratti"
},
"reviewBody": "great popcorn could use a little more butter though!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gwenbru"
},
"reviewBody": "I love popcorn with butter, but it's so greasy that I can't eat much of it. This recipe gives the popcorn a nice butter flavor and just enough salt to make it perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CupcakePolly"
},
"reviewBody": "wow. I just made this and wow great flavor. I sub margerine for the butter and vegetable oil for the peanut oil. Definately will be using this recipe when i make popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K-nutt"
},
"reviewBody": "Delicious! I love over the stove popcorn but always had the problem of soggy popcorn from adding butter after its popped. Never thought to add before it popped. Great butter flavor and not soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey"
},
"reviewBody": "My mom always made us stove top popcorn and therefore that's how I've always made it too. I've never been a big fan of buttered popcorn because it just makes it too mushy and there's normally waaaaaay too much of it. I have to say though that adding the butter to the pan is fantastc and you can adjust the amount to your own liking!!! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tanya Belt"
},
"reviewBody": "Nostalgic? yes. Better than microwave? Debatable. This did taste similar to the oil popped version of my childhood, but if opting for a non-microwaved version for health reasons, I suggest air popped. This tasted heavy and oily to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gopintos"
},
"reviewBody": "My dad, who has been gone for a number of years, use to make this almost every night. I lived at home for 18 years, and never once asked him how he did it. Thank you for the memories. What a treat to find this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Isabella Bashir"
},
"reviewBody": "I use a mixture of peanut and coconut oil. Gives it a nice sweet flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "iluvpastry"
},
"reviewBody": "Medium high heat is too high, the butter burned. Will stick to the old fashioned tried and true way to pop corn, this was a hot mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Smith"
},
"reviewBody": "It is good, but I like to use olive oil even better than the vegetable oil. I use this while we were camping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Parentsch"
},
"reviewBody": "I make popcorn with olive oil and add butter. Adding butter to the pot before popping is an interesting alternative. Olive oil is healthy and imparts a great buttery flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RCRENFRO"
},
"reviewBody": "the best, altho I like using olive oil instead, gives it an exciting flavor, butter too and salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBY"
},
"reviewBody": "I don't know why anyone would use vegetable oil, or shortening. We use coconut oil here. OTH This is a pretty cool recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1st Lady"
},
"reviewBody": "I love popcorn this way, I don't even do micro popcorn anymore. I even sneak it into the movie theater. This is just right for my new healthy lifestyle. Sometimes I just use spray butter for flavor. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bensmom"
},
"reviewBody": "Ican't stand microwave popcorn. I've used a whirly pop popper for years. It's great! Another variation that I make often is to add about 1/2 cup of sugar to the oil just before adding the corn. Makes a sweet carmel corn-like taste. I then add salt to it after pouring the popped corn into a bowl. I love sweer and salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheoah"
},
"reviewBody": "Very easy to make and wonderful to eat. I love popcorn and the simpler the better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "House of Aqua"
},
"reviewBody": "I agree with the recipe submitter about the artificial ingredients in microwave popcorn, not to mention the use of radiation oven to cook it. I prefer to good ole' stovetop way. I use plain white seeds and olive oil. I sprinkle a bit of salt and some fresh cracked pepper. I even make this to take to the movie theatre with me. It makes a light snack for anytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHERYLSKITCHEN"
},
"reviewBody": "Excellent! I'd never thought home made popcorn could taste so wonderful and far better than microwave types. I've used vegetable oil since this is what I've had on hand, but I'll have to try it with the peanut oil sometime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ama2lla"
},
"reviewBody": "This was made easily! First time making popcorn, and I thought it was going to turn out wrong but I was wrong. I used this to make caramel corn, so I did not add the butter or salt, which is why it is rated on 4 stars. Don't forget to constantly shake pan. Also, tilt the lid slightly so popcorn doesn't come out tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "This has become a family favorite! My family chooses this over chips or other snacks on a regular basis! I skip the butter because it always seemed to burn in my Stir Crazy popper. I also use olive oil &amp; sea salt. Thanks for the excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This is the popcorn of my childhood. So clean and simple and delicious. In case you're wondering, it's worth the extra work versus microwave popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Jam"
},
"reviewBody": "Very easy, worked great. I used coconut oil (saturated fats that come from plant sources are OK) and did the 3 kernel first method. Once it was almost all popped, I dumped out all of the popcorn into a brown paper bag and set the pot with unpopped kernels back over the stove until they had popped too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karensue"
},
"reviewBody": "Peanut oil is better than canola but coconut oil is by far the best tasting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kacy Shaw Snyder"
},
"reviewBody": "Too salty. Do NOT use 1/2 tsp salt!! Mine kind of burned too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Colleen Wisniewski"
},
"reviewBody": "We were all a little disappointed with this version of \"stove-top\" popcorn, as my kids call it. I found the salt almost burning on the bottom of the pan. The oil &amp; butter combo was less heat tolerant than my usual peanut oil. All in all, I will stick with my version of \"Stove-Top\" and add the butter &amp; salt just before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KB"
},
"reviewBody": "This is a fun recipe to make w/the kids! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Did not turn out the way I expected :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erimess"
},
"reviewBody": "Can't figure out the big deal. First, I grew up making popcorn in a pan like this, and still do it all the time. An air popper is dry and microwave is full of trans fat and such. I also have put the butter into the pan for a long time, when I use butter. Except I agree with the person who said if you stick the butter in with the oil immediately, it just burns and doesn't work. You have to wait until it starts popping -- have it on like a knife ready to go. Wait until it's just getting a good pop going, but no longer or it won't melt right. Open the lid enough to get the knife through and just scrap it on the side and let it slide down. If it hasn't popped too much, it'll melt as it pops. Too soon and it burns, or just cools it down so it stops popping. Too late and it doesn't really melt. It can take a little practice to get it perfect. I've done this for years. (Though I don't have peanut oil around. And I absolutely will put more salt on anyway cause I'm unfortunately a salt-aholic.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bookworm"
},
"reviewBody": "This is good stuff. There's no reason to subject yourself to all the chemicals in microwave popcorn. I heated two TBLS cococut oil, and then added a few kernels. When those popped, I added the rest of the popcorn as well as the salt and butter, let it sit until the popping started, then shook the pan (with lid on) until it was done. Dump it immediately into a bowl so it doesn't burn and add any additional seasonings to taste. Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BriBoy Chicago"
},
"reviewBody": "Perfect blend of butter and salt, I make every weekend and put on a netflix, set a big bowl of movie star popcorn on the coffee table with a stack of soup bowls... and never have to dump out leftover popcorn! the whole gang loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa C"
},
"reviewBody": "My mom taught me that you have to vent the popcorn a little. Just lift the lid every so often, or keep it cocked open just a tiny bit. I also empty the popcorn into a paper grocery bag and sprinkle a bit of salt and shake to distribute the salt evenly. pour out into a large bowl. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Baricat"
},
"reviewBody": "Surprisingly when you consider all the stellar reviews, I was not impressed. It tastes like popcorn made by any other method (though the microwave variety contains that processed, fake-butter taste) at home. Because of the temperature the oil reaches, the butter molecules begin to burn, and the kernels were dotted with dark brown. I made both with vegetable oil and with coconut oil as suggested by another reviewer, and noted very little difference, if any, in taste. It's not bad in any way, just OK, but definitely nothing special."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soup Loving Nicole"
},
"reviewBody": "This is a classic and is great! I did sprinkle a little black pepper on it (something I've always loved) but this is just a personal preference and the recipe is great as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vampixen"
},
"reviewBody": "My Sons Loved this..Thank you so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bitsybites"
},
"reviewBody": "I made this last night, while watching the Oscars with my family. DELICIOUS. Worked very well in my electric popper. I used 2 TBSP of sunflower oil instead of the peanut oil, and coarse sea salt. Needed just a pinch more salt once popped but nothing else. It will be our \"go to\" popcorn recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maxmom06"
},
"reviewBody": "This is great popcorn! I used olive oil due to a peanut allergy. Also used fine popcorn salt, no extra needed. So easy to add the butter before popping. No soggy popcorn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marushka"
},
"reviewBody": "This is the best popcorn i have ever had. The grandkids agree!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coopwith3"
},
"reviewBody": "This is the way my mom always made popcorn..even when the microwave popcorn came out. Orville Redenbacher's popped the lid off of our pot! I usually use an air popper for movie night. Thanks for the recipe..I LOVE popcorn!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timothy Brown"
},
"reviewBody": "all is perfect but do agree with the sugestion of coconut oil it does pop best but can be a bit expensive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suz"
},
"reviewBody": "This is how popcorn was made before microwaves, air poppers, and the old fashioned popper you plugged in and put butter in the top. I also remember having a special pan just for popcorn cooking. That was the best. Thanks for the memory and the snack for tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy V"
},
"reviewBody": "I never caught on to the microwave popcorn craze. I have my heavy-duty popcorn pan that I have used well over 40 years now. I use olive oil to pop in and a little real butter to top with. The flavor is great and healthier than most."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jstrong1008"
},
"reviewBody": "This is pretty much the same way I make mine, but I no longer waste my taste buds on yellow popping corn. ALWAYS use white- you will *never go back! White kernels make the popcorn much fluffier and the hull is much smaller and thus not as hard. This is also safer if you are going to feed it to toddlers- less of a choking hazard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KELARJIAN"
},
"reviewBody": "Great! Olive oil works well too and you don't really need the butter IF you use a high quality extra virgin olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Smallwood"
},
"reviewBody": "I LOVE, LOVE, LOVE popcorn!!! I make mine this way every single night in my WhirlyPop."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/150711/movie-star-popcorn/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
"name": "Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16051/appetizers-and-snacks/snacks/popcorn/",
"name": "Popcorn Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/150711/movie-star-popcorn/",
"name": "Movie Star Popcorn"
}
}
]
}
}
, "about": [
]
}
]