				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mulligatawny Soup"
,"datePublished": "1999-02-26T01:35:22.000-05:00"
,"dateModified": "2022-08-04T11:47:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lise P"
,"url": "https://www.allrecipes.com/cook/24325419"
}
]
,"description": "This mulligatawny soup recipe combines flavors of chicken, curry, apple, and cream for lovely, Indian-inspired dish — easy to make comfort in a bowl."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/c5rvXd4iW32dqTECe4PNisvQVDQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/804799-33945c287a0d46b4acce8f0247ebf88c.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1932374359001",
"description": "See how to make a creamy Indian-inspired chicken, rice, and curry soup.",
"duration": "PT2M48S",
"name": "Mulligatawny Soup I",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/bec977fc-c14c-4c6a-865f-db786f72c27c/18bf60b5-2624-46e7-ab1d-5b3d2bf1b42a/1280x720/match/image.jpg",
"uploadDate": "2021-07-03T21:40:24.927-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mulligatawny Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "1926"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "223 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "62 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "734 mg"
,"sugarContent": "3 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.5 cup chopped onion",
"2 stalks celery, chopped",
"1 carrot, diced",
"0.25 cup butter",
"1.5 tablespoons all-purpose flour",
"1.5 teaspoons curry powder",
"4 cups chicken broth",
"0.5 apple, cored and chopped",
"0.25 cup white rice",
"1 skinless, boneless chicken breast half - cut into cubes",
"1 pinch dried thyme",
"salt and ground black pepper to taste",
"0.5 cup heavy cream, heated" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a large soup pot over medium heat. Add onions, celery, and carrot and sauté until soft, 5 to 7 minutes. Add flour and curry, and cook 5 more minutes, stirring frequently. Add chicken broth, mix well, and bring to a boil. Reduce heat and simmer for about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add apple, rice, chicken, thyme, salt, and pepper. Simmer until rice is tender, 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/c5rvXd4iW32dqTECe4PNisvQVDQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/804799-33945c287a0d46b4acce8f0247ebf88c.jpg"
}
]
,"text": "Just before serving, stir in hot cream."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinandluvinit!"
},
"reviewBody": "I made this recipe as is, and have made it over and over again. It is simple, and flavorful, and I highly recommend it. If you aren't into curry, or Indian spice flavor profiles then this probably isn't your thing. Otherwise it is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was perfect as written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanie Stienstra"
},
"reviewBody": "Excellent! Turned out exactly as described. I doubled the curry powder based on other reviews, yum! PS, I had leftover roasted chicken breast so I cubed that and added the chicken the last few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ctusamom "
},
"reviewBody": "Delicious! Used a Granny Smith apple might try a sweeter one next time. I brown the chicken pieces before adding to soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ernie"
},
"reviewBody": "Powerfully good! Best soup I’ve ever made. Went by the recipe, but used cooked rotisserie chicken that I added the last 10 minutes of cooking. Wow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "I had never had Mulligatawny soup, but wanted to give it a try. Boy, am I glad I did! This is a wonderful soup, I did forget the cream at the end, but I loved it anyway. This soup will go into the Winter rotation of soups and will be made again and again. This is very similar to another recipe on Simply Recipes, I took their suggestion and cubed the chicken before adding to the pot, along with some of their instructions for cooking the soup. I doubled the curry and could have added more for our tastes. Great soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denali"
},
"reviewBody": "My husband was raised in singapore and apparently was served this growing up. I tried this recipe tonight and he said it was perfect. I used already roasted turkey and pre-cooked quinoa/brown rice packet. Also added a touch of red pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely amazing! Will definitely make this again. The only thing was the servings - mine served two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackhighheels"
},
"reviewBody": "Delicious! Mine wasn't thick as some people have said and as shown in the video. I might try adding extra rice next time, and maybe a little extra flour. I used 1/4 tsp thyme, which was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is absolutely delicious!! I made this recipe and doubled it right up front based upon the prior reviews. I also made a few substitutions based on what I had on hand. I added more curry because my husband loves curry and his Mom made it frequently. Next time I'm going to add potatoes and eliminate rice to make curry served over rice. Try this, you'll love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Chambers Vilbig"
},
"reviewBody": "This soup is wonderful and has a great fragrance and flavor. I didn’t have any curry so I used Garam Masala. It’s a great substitute and is not as peppery as curry. I added some potato with the other veggies just because I had it. I also added a small can of diced green chilies because I love them. I had to add more broth and another tbsp of flour to get the broth ratio just right for my liking. Adding to my soup rotation. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trying2cook"
},
"reviewBody": "This is a delicious soup. It was quite thick for my liking - much more so than the pictures others have posted. Not sure why, but I added 2 additional cups of chicken broth, and problem solved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phil Saunders"
},
"reviewBody": "Built to the recipe and all loved it. Paired with Angie's dinner rolls also delicious. Got a 10 out of 10 from the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary G"
},
"reviewBody": "I made this exactly as stated and was less than impressed-- which was surprising, based on all the 5-star reviews! maybe I need new or different curry? or maybe it's just me. I must add that it was definitely better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lew Wright"
},
"reviewBody": "The yield was modest portions for four adults. Flavors? Excellent!!! Will repeat this recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie Mysinger Krause"
},
"reviewBody": "This was amazing and you’ll definitely want to double the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Heming"
},
"reviewBody": "Delicious! One of our favorites!!! BUT quadruple the recipe! Just doesn’t make enough for how good it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Ceja"
},
"reviewBody": "This is a great tasting soup (and I am not even a huge curry fan)! I do admit I made a few changes and apologize in advance. I tripled all the vegetables and apples since I was trying to use up what I had on hand. I did not add the cream or salt. I don't like cream based soups heated up a few days later. And I eat saltine crackers with salted tops and figure that is enough salt for me. Based the calculations via Weight Watchers this is a 2 point soup per serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Zaretskie"
},
"reviewBody": "Fabulous soup, everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kordiclucroy"
},
"reviewBody": "Very good. Lots of taste with a rich finish. I had to chuckle at someone omitting most of the recipe, down to the pepper, because it's \"too hot\". The name means pepper water. You created something completely different. Why bother commenting?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "49sequoya"
},
"reviewBody": "So good! Added half pint of sliced mushrooms and a cup of fresh chopped spinach to the 30min simmer. Wish I would’ve doubled the recipe, this stuff's not going to last long. Didn’t add the heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan B."
},
"reviewBody": "I used fresh thyme instead of dried, basmati rice for the white rice, and added some ground cayenne per bowl as desired. Ironically I accidently forgot to add the cream and it was still phenomenal. Keeping this one for rotation! Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "addielleyes"
},
"reviewBody": "Yum! Will make again but with half the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fnggskctw8"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HJR"
},
"reviewBody": "Perfect everytime"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Thiel Hardwick"
},
"reviewBody": "Wow! It is rich and delicious even without cream. Great as is but next time will add more rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vane902"
},
"reviewBody": "Not nearly enough spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had some leftover \"chicken and rice\" that I had cooked with some diced tomatoes and onions that I wanted to utilize in a soup. I basically made this soup using the leftover chicken and rice and also added a can of diced tomatoes. I omitted the flour and apple. It was a fabulous soup. I will definitely do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abby"
},
"reviewBody": "I added a little extra curry powder but otherwise followed the recipe exactly. I thought it was a little bland at first and added quite a bit of cayenne pepper to my bowl, which made it taste amazing and brought out the flavors. My boyfriend hates spice and didn’t add the cayenne, and still said it was one of his favorite dishes ever. He actually loved it even more than I did, and he doesn’t usually like Indian food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyssa Julia"
},
"reviewBody": "One of the best recipes out there. I make it all of the time so I figured I could experiment a little. Today I was in a bit of a time crunch so I tried cooking it In the crock pot and it came out so well. If you’re interested in starting this before work and finishing it when you get home, here is how I did it. I threw the uncooked veggies, (raw) chicken and broth all inside the crock pot on low for 8 hours. Then when I got home I threw some butter In a sauce pan and made the roux with all of the spices. I dumped that into the crock pot with rice and the apple to finish the recipe. Add the cream before serving (when the rice is cooked) and bon Appetite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donna"
},
"reviewBody": "1 Tbsp curry powder and 1/2 tsp garam masala. Used 1/3 cup brown rice and simmered for 45 minutes with homemade bone broth. Added apple and 1/4 cup red lentils and simmered for another 15 minutes. Added diced cooked chicken and some milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah"
},
"reviewBody": "Loved this soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Waters"
},
"reviewBody": "This is my first review ever! I had never even heard of this soup but saw it scrolling by and decided to try it. As I always do after following a recipe, I think about how I should tweak it for the next time. The only thing I came up with is that I cut my chicken chunks too big, so next time I will adjust that. It is SO GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ImpoverishedBlonde"
},
"reviewBody": "This was very, very good. Giving it 4 stars because I had to tweak it. I used a half cup of half and half at the end, instead of a cup of heavy cream. I used regular curry instead of the hot stuff, so I wouldn’t want to dilute the soup any more than that. I think, if I did, I wouldn’t taste the curry. If you use regular curry, like I did, I would suggest adding a little heat/pepper. I also used jasmine rice, which I think was a good choice. The almond flavor it has went well with the curry and apples. I added extra apples because that’s one of my favorite parts of this soup. This recipe doesn’t include an ingredient that’s been in the Mulligatawny I’ve had in the past: diced tomatoes. It’s a really tasty addition to the soup. The tomatoes and apples have a nice contrast that works well with the curry. Last, but not least, I made this vegetarian by using Better Than Bouillon Not Chicken Broth Concentrate and Sweet Earth Mindful Chikn. It was great! A very comforting winter dinner. I’ll be saving this in my Favorites folder to make it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muffin Mom N Garlic Girl"
},
"reviewBody": "Perfect as written, I didn't change a thing apart from garnishing with a few mini dollops of plain greek yogurt (and naan bread). Only issue weree it's a bit thick so when you get to the bottom have a bit more broth and cream to rehydrate the leftover \"casserole\" and serving 6 served 3 normal Campbell's cans of condensed soup that you add a can of water to. Will double + next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naos3356"
},
"reviewBody": "Delish!! Good without the cream, but sinfully good with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Dawson"
},
"reviewBody": "This is a great recipe! Many reviewers suggested more curry, so I used 1 1/2 tablespoons. Also used a whole apple and 1/2 cup of rice to make it a little hardier We like spicy, so I added a sprinkle of cayenne pepper too. It was perfect served with warm garlic naan bread. A great meal for a cold night. Will definitely make it again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Merritt"
},
"reviewBody": "This soup is delicious! First time I made it I intentionally omitted the apple because I just couldn’t bring myself to use it lol. I forgot about the cream at the end. My husband devoured it, kept going back to refill his bowl - when I remembered the cream he said “NO, it’s awesome just like this!” I have since made it two more times with no apple and no cream. Today I doubled the recipe because I had family over. No leftovers! One reviewer said it’s even better one or two days later. I don’t think I will ever experience that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cakie"
},
"reviewBody": "This Mulligatawny Soup will now be on the menu in our kitchen from time to time. It is absolutely delicious! Adjusting the amounts or adding ingredients according to your preference is easy and will not ruin this soup at all. I followed the recipe, with the exception of the cream, I added 1/2 cream and 1/2-2% milk. In addition to the rice in the recipe, in a separate pot I made some rice. To serve, I scoop some rice in a bowl and ladled the Mulligatawny over it, and served it with a wonderful winter salad on the side. Heavenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "I made it to the letter except did not add the cream at the end, did not need it!\nDelish to the last friggin drop"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Spencer"
},
"reviewBody": "Really enjoyed this meal, added 1 small potato and cooked a little less time. Other than that it was wonderful as it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asma Bailouni"
},
"reviewBody": "I loved this soup. Yes I agree with the others who suggested to add a bit more of curry powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Byron"
},
"reviewBody": "Black pepper to taste is a mistake. As the name, pepper water, suggests, it should be a major flavor component of this soup. Consequently this recipe is a bit blah. I added a teaspoon of pepper when I made it, and served it with plain yogurt instead of cream. Much more pizazz."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allen Bruce"
},
"reviewBody": "Could use more broth. A lot was absorbed. Chicken came out moist and tender. Soup was very flavorful without being overwhelming. I added peanuts and red pepper flakes. Served with sour cream. Next time I make this great one pot meal will try adding some sweet potato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marahlf"
},
"reviewBody": "Delicious! Hubby and all kids devoured it! I just added as much garam marsala as curry. Then substituted half of the cream with coconut milk. I also added already cooked jasmine rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mfelt"
},
"reviewBody": "Wow! Easy, crowd pleaser. Definitely will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad Livsey"
},
"reviewBody": "GREAT foundation recipe. Easy for personal preference to tweak it North-East-South-and West of center as portrayed here. Thanks much, for the Addition to my Kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie DuPei"
},
"reviewBody": "I doubled the recipe, mixed rice with quinoa, added lentils for more protein, and more broth for the lentils and used a little white wine. My son and I don't love heat, but the curry recommended was just right!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lori"
},
"reviewBody": "I MADE THIS WITH A COUPLE OF CHANGES BASED ON THE REVIEWS I'D READ. I DOUBLED THE RECIPE(GREAT CHOICE!), USED COCONUT OIL IN PLACE OF BUTTER(DID NOT DOUBLE THIS), USED CASSAVA FLOUR IN PLACE OF FLOUR AND DID NOT ADD THE CREAM BEFORE SERVING. MY HUSBAND AND I BOTH LOVED IT AND WENT BACK FOR MORE! WE WILL DEFINITELY BE MAKING THIS AGAIN!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Genoa Horsthuis"
},
"reviewBody": "Such a fantastic soup! Everytime I make it, the family raves and rants about it afterwards. I make a few adjustments such as adding an entire apple 5 min before serving because I dislike the feeling of mushy apples. I also increase the flour to 2 tbsp, as opposed to 1 1/2 tbsp, because I like a slightly thicker soup. Overall, I absolutely love this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lsayer"
},
"reviewBody": "One of our favorite soups. I don’t add the cream. Tried to double the recipe but it doesn’t taste the same so I make two separate batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cinfrea"
},
"reviewBody": "This was absolutely delicious! I added a little more curry &amp; for lack of time, used (1) drained 10 oz can chicken breast and (1) package pre-cooked Basmati rice. Unfortunately, I forgot the whipping cream. It was so good, I can’t imagine how it could be made much better. I agree with another reviewer, you will not be sorry doubling the recipe. I will definitely do so in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scottp"
},
"reviewBody": "This is honestly the best dish of any kind I've ever made and eaten from this app. Don't be intimidated by apples. cut them up really small and they melt into the soup. If food were crack, this is it. Every time I make it I want more. It's just so good! the only thing, and I mean the only thing I'll do in the future is double the rice and the chicken. But as the recipe is, it's outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa N"
},
"reviewBody": "I made this for the first time yesterday and my family and I love it! I doubled the ingredients, but also tripled the chicken because we like lots of chicken. The next time I make this, I’ll use basmati rice instead of regular rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "This soup is wonderful. So quick and easy with ingredients you likely have on hand. However, I didn't have chicken so substituted with shrimp. Delicious! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corndogmcp"
},
"reviewBody": "Tasty soup! I more or less followed the recipe exactly — only grated the apple rather than dicing and used 1% milk rather than cream. It was delicious! Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Domer"
},
"reviewBody": "Excellent!!!! Our family’s first home cooked curry soup and we loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Caraloopy"
},
"reviewBody": "Wow. Just....wow. Followed the recipe almost exactly, but I cooked it too long and the apples and veggies turned to Mush...and it was still Phenomenal. Thank you!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Hultman"
},
"reviewBody": "And I did what makes me crazy when I read reviews....I’m rating this based on the ingredients I used and changes I made. Sorry, Years ago my hubby and I had lunch at a small restaurant that was mainly fondu based, the soup of the day was concoction of leftovers in creamy chicken broth with pineapple chunks (small pieces) with red and green pepper chunks. The chicken was shredded chunks and spiced with curry, cardamom, Tumeric cumin and the red chili flakes. This recipe was just the same! I skipped the flour and apple in this recipe and added the pineapple and spices with some white rice. I added a cup of almond milk to the broth at the end. Tweeking the spices until we got to the right heat for us Thanks for the inspiration"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana Hickman"
},
"reviewBody": "11/13/20 - I think this is my first time making this, felt like a familiar receipe! I doubled the curry since I love this flavor - was great comfort food! Never even noticed the apples in the soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Another soup recipe that is a keeper! I went with a 12 serving portion recipe. Added twice amt of carrots and apple than it called for. Also added 2 cloves garlic. Used half butter and half coconut oil. Think I’ll use half of total amt next time (soup was a bit greasy at end). Also, used coconut cream rather than heavy cream. Tried without at first but the cream adds another great layer. Next time I think I’ll use brown rice instead of white and more chicken, but shredded."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "My family had never tried a Mulligatawny soup but since this was so highly rated I made it. Wow! So good! I didn’t change a thing. I have made it several times now and it all gets gobbled up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rickys Wife"
},
"reviewBody": "This was delicious. Following the advice of other reviewers I doubled the amount of curry powder and used light coconut milk instead of cream. Also used precooked diced chicken breast since that’s what I had. Will add to winter soup rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela K"
},
"reviewBody": "We LOVE this recipe. It’s delectable exactas as written!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seyfurs"
},
"reviewBody": "Doubled, celery, carrots, apple, &amp; chicken and probably whipping cream too. Always use a full container. Added Tbs minced garlic and diced bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JudyM"
},
"reviewBody": "We loved it! My husband misses having mulligatawny soup so when I saw this had to try it. Did make one change - our two adult children hate celery and won’t eat anything containing it. I read that fennel is milder, but a good substitute. It worked! Got a thumbs up across the board! Sorry, no photo. We ate it too fast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Bremner"
},
"reviewBody": "This was very delicious and my family loved it. I also add some muchrooms, all the spices, and ingredients mixed weel together, a very comfort feel, it will be well loved this winter on a snowy evening and it can stand alone, with bread, a full meal. Love whoevr gave the recipeXOXOXO"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sal"
},
"reviewBody": "Amazing. I added an extra tsp of curry and a tsp of turmeric. I also skipped the cream. This will be a go-to recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Canady"
},
"reviewBody": "Delicious! I did double the chicken and the apples as well as added a one inch section of fresh ginger root minced, some fresh garlic, one can of coconut milk a half a teaspoon of cumin, and 1/2 teaspoon of cinnamon. After sauteing the veggies and adding half of the chicken broth I put them in the blender and pureed them, then I added the pureed mixture back to the Soup pot with the rest of the chicken broth, added the coconut milk and additional spices as well as the apples which I minced in the mini chopper. Very good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Di Teets Cramer"
},
"reviewBody": "Delicious. A definite favorite in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theradicaldame"
},
"reviewBody": "This recipe makes a unique and amazing soup. It's very forgiving with tinkering and reheats well thought the week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quiqui Dagle"
},
"reviewBody": "I made a triple batch and used much more curry, chicken, Apple just about everything. My entire family loves when I make this soup. It even won over a non soup person."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni May"
},
"reviewBody": "Holy door busters Batman, this was a delicious soup! Totes making this again. I had to talk myself out of a second serving, it was so yummy. One small change, I would omit the extra salt. I am excited about my leftovers for lunch tomorrow. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigtj"
},
"reviewBody": "Very nice flavor and quite filling. The changes I made were to double the curry powder, use left over roast chicken for the protein. and use half and half instead of heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna G"
},
"reviewBody": "This is my favorite soup, although I do add double ginger, whipping cream and apple, when I cook it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nickbuckdl"
},
"reviewBody": "Use butter, half and half instead. More rice and more curry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Kunze"
},
"reviewBody": "Great recipe! Even my picky kids eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Bamford"
},
"reviewBody": "Made a double batch to share with my neighbour who had not been feeling well. She loved it and so did we. Will make it again. Wondered if I could use Shrimp instead of chicken sometime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Jean Perl"
},
"reviewBody": "Added extra curry powder, and used an entire apple. Substituted chicken thigh for breast as that’s what I had. Will make again. Would substitute chickpeas for chicken as well for vegetarian option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie14"
},
"reviewBody": "Love this soup! I used a little more chicken and rice. We like more of a stew consistency. The curry flavor is so good! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Holifield Jang"
},
"reviewBody": "We can’t get enough of this soup! I always double it. I pretty much make it as written, but I add more rice and a little more curry powder. And I also add a couple of spoonfuls of Green Thai Curry Paste as it gives it a nice flavour and is still not too spicy. I add some half and half at the end instead of heavy cream. It’s delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BCook"
},
"reviewBody": "Definitely became a favorite. Been wanting to make this for a while and forgot for years. I’d recommend doubling the curry and adding some cayenne too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I followed the recipe and my only complaint is I wish I had doubled it!\nAbsolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coradams"
},
"reviewBody": "This is a rare dish that everyone in the family loves! I am definitely this again. Instant comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David Uhlemann"
},
"reviewBody": "I love Indian food. This was not one of my favorites. It seems like part of the recipe is missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alteredartgirl"
},
"reviewBody": "This was great! I doubled the recipe as others recommended. We love to have extra soups in the freezer. I easily quadrupled the curry, used chicken thighs and coconut milk instead of cream. It made for a different type of soup than the normal. Very good. Can’t wait to eat the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra"
},
"reviewBody": "This is a delicious and comforting soup. I did not alter the recipe in any way except that I did forget to add the thyme. Only thing I would do different next time is to make a double batch as we had no let overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patty OVB"
},
"reviewBody": "I’ve had a good Mulligatawny in the past, trying to find the recipe. This one is good, but not what I was looking for. I took note of the comment about not wanting apple chunks in the soup. I had made applesauce yesterday so I knew the apples would soften pretty quickly, so I smashed them against the inside of the pot. The taste was quite good. I tried to follow the recipe without adding more stuff, at least at first. Other recipes, calling for garlic, ginger, Jalapeño, etc. sound more intriguing. The photo is after you add the warmed cream. Will get back as we progress along."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arc"
},
"reviewBody": "Delicious and quite simple to make. I incorporated a few of the tips in other reviews (added finely diced potato, increased curry powder). I doubled the recipe and added 1 C red lentils about 15 minutes before I added the rice, chicken, etc. I also threw in a zucchini and spinach. No cream necessary, though I’m sure it would be delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christa Scopa"
},
"reviewBody": "My boyfriend, who hates vegetables, really liked this soup! I diced the veggies &amp; apple really small and also used 2 tsp curry powder. Great soup! Will be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thane Callender Petzold"
},
"reviewBody": "Prepared exactly as printed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Diraison"
},
"reviewBody": "This was an exceptional soup and super easy to make. I made only 1 change to the recipe - I switched out the cream for 2% evaporated milk. I used yellow curry powder and the soup was creamy smooth with a subtle curry flavour. Next time, and there will be many, I may try it with coconut milk. I'm trying to think of main dishes I can serve this with so I can share it with company! It should be noted in the recipe that the chicken must be cooked before you add it to the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie"
},
"reviewBody": "Made as stated in recipe. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scrubby Johnson"
},
"reviewBody": "Quite good, and I thought that even a day after it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindsey"
},
"reviewBody": "I rarely write reviews but this soup is one of our favorites! I follow the recipe exactly but use half and half to save calories and a little extra curry as well. It definitely goes fast! ?Thank you for the recipe??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette"
},
"reviewBody": "Hearty, delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "waylean"
},
"reviewBody": "Served it at a dinner with friends and everyone liked it, including the kids. Couple tips: go easier on the rice, and heavier on the curry than what is prescribed. (Or more broth, the rice makes it a pudding like texture)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Dares"
},
"reviewBody": "Absolutely delicious!! I used coconut milk at the end too. Definitely will be making this again. So easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "This soup is sooooo good. You’ll be sorry if you don’t double it. I cooked my chicken first so I could shred it, a personal preference and will up the curry next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13087/mulligatawny-soup-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
"name": "Chicken Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13087/mulligatawny-soup-i/",
"name": "Mulligatawny Soup"
}
}
]
}
}
, "about": [
]
}
]