				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mushroom Soup Without Cream"
,"datePublished": "2019-04-02T02:45:41.000-04:00"
,"dateModified": "2022-08-24T13:26:27.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KitKat"
,"url": "https://www.allrecipes.com/cook/30413"
}
]
,"description": "This mushroom soup without cream is made with various mushrooms and vegetables in a light, clear broth seasoned with fresh thyme and green onions."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YR1kaTK3gqPti72leHK7Z33dd0A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2002562-e4b55ddb312343a984f4df5791255250.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mushroom Soup Without Cream"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "232"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "81 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "561 mg"
,"sugarContent": "4 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons butter",
"1 cup peeled and sliced carrots",
"1 cup sliced onions",
"1 cup sliced leeks",
"0.5 cup sliced celery",
"2 pounds sliced fresh brown or white mushrooms",
"1 teaspoon fresh thyme leaves",
"6 cups chicken stock",
"salt and pepper to taste",
"0.5 cup chopped green onion" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a stock pot over medium heat. Add carrots, onions, leeks, and celery. Cook and stir until vegetables are tender but not browned, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in mushrooms and thyme; cook until mushrooms are soft, about 5 minutes. Pour chicken stock into the pot; season with salt and pepper. Cover and simmer over low heat for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Ladle into bowls; serve with green onions sprinkled on top."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made this soup for the first time and changed the recipe a little by caramelizing the mushrooms and leeks before adding to the soup pot. And I did not cook the carrot and celery before adding them in cuz, why? All their beautiful nutritional value cooked right into the broth. All that said, this IS the best mushroom soup I've ever eaten. Definitely make it! You are going to LOVE it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a little garlic powder and brown rice. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myandria"
},
"reviewBody": "As others have posted, I like this as a basic recipe to build upon and change. I did not use leeks; I added yellow carrots and used leftover chicken soup stock. I only had mixed dried mushrooms, so I reconstituted those, strained the broth it made and used some of it as well. I used light olive oil to cook the veggies/mushrooms in instead of butter. A dash of hot sauce in each bowl when served and this became the bowl of soup to help with getting over a cold. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djb"
},
"reviewBody": "This recipe is a good basic start and you can substitute or add to it. I used fennel instead of celery, added some roasted veggie leftovers (summer squash and eggplant, about 1/4 cup each, chopped), some potato flakes ( 1tbs) to thicken it, and pureed it so there were small pieces of mushroom. For added umami, I added a teaspoon of fish sauce, and 1 tbs of Better than Boullion. It's delicious. I rarely do a recipe as written but definitely appreciate knowing the basic ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this exactly as written was a wonderful addition to our homemade hammers with cheese. Wife said it's a keeper. Thanks for aharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "Great flavor and easy to prepare and cook. You can have fun with it as well and add a little olive oil when frying veggies or if you want add some cream, I tried without and with a little cream and delicious either way. Oh and super filling to the belly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deana Bradley"
},
"reviewBody": "We really enjoyed this soup recipe. Very healthy baby t filling. I did add a fresh jalapeño and served over brown rice. I will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindy"
},
"reviewBody": "This is an awesome soup. I made the following changes to accommodate our taste: increased by 1/2 the leeks, carrots, onions and celery; sauteed in olive oil instead of butter; added 8 cups of chicken broth or bone marrow; seasoned with lots of Thyme and Italian seasoning; and served over Orzo pasta instead of rice. Very healthy and vegetarian - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SundanceMom"
},
"reviewBody": "This soup is sooo good. I used portobello mushrooms cause that's what I had, 4 cups beef broth and 2 cups chicken broth, so rich. everything else the same. this is a keeper. thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama"
},
"reviewBody": "This soup is simple and tasty. I used what I had. Didn't measure the carrot (diced one big one), the onion (diced one big one), or the celery (diced one stalk). Diced a 1.5 lb package of mushrooms, rubbed between my hands a large pinch of home dried thyme. Sauteed it all in olive oil for about 10 minutes. Sprinkled 1/2 cup of flour over it all and stirred it around for a couple of minutes till the flour began to stick to the pan, added 4 cups of chicken broth and 2 cups of water. Brought to a boil, then simmered for about 30 min. Salted it at the table. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeeKind"
},
"reviewBody": "Delicious! I used vegetable broth and cauliflower rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was delicious and light! The only thing I added was a touch of ground cayenne. \n\nThank you. \nSN"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe makes a LOT of soup, and good soup! Very flavourful, very healthy. There's a lot of cutting and chopping so I did all that ahead of time (about 2 hours before). The one part about throwing in the mushrooms and cooking for about 5 minutes until they were soft didn't happen that way. It took more like 20 minutes - maybe the instructions intended to say to increase the heat? Don't know but other than that, the recipe worked very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aunt Sue"
},
"reviewBody": "Amazing flavors! Only change I made was to use Shitake mushrooms instead of brown or white because that's what we grow. And since my husband just picked another 3-1/2 pounds this morning, can you guess what's for dinner tonight?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pauline MenorOzoa"
},
"reviewBody": "Very easy and delicious recipe! Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NickiK"
},
"reviewBody": "Excellent recipe. The only change I made: unsalted vegetable stock instead of chicken stock because we had it on hand. The thyme is an inspired herb for this soup, as well. Just enough to give it a hint of the herb. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karendm"
},
"reviewBody": "Used vegetable broth instead of chicken broth and it was great! Was unsure it would be filling as it's not cream based, but it sure was!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NYAnne"
},
"reviewBody": "I love this soup. Once it is cooked I use an immersion blender to puree it. I like the taste better than just eating it as a broth with vegetables in it. I asl add a tiny bit of cayenne to the soup for a slight kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Foulk Oxborrow"
},
"reviewBody": "This is delicious! \nOnly change that I made was to add a bay leaf while simmering.\nI didn't have the leeks and it was still great. I have also substituted olive oil for butter workout any problem. A truly delicious and extremely healthy lunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lmdemmer"
},
"reviewBody": "This is a fantastic recipe. Very quick, easy and flavourful. I added 3 tbsp sherry to suit our tastes and some wild rice to add more substance. Will make again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn Wagner"
},
"reviewBody": "I added star pasta, herbs de Provence and porcini mushroom powder. Plus garlic powder. Delish and light...served with Parmesan chees on top and toast on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth Streeter"
},
"reviewBody": "Great recipe! I’ve added dumplings to mine which made the recipe even more delicious. I also doubled up on mushrooms rather than using leeks and the food was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "trebleclef"
},
"reviewBody": "I started by making this as written except for using mushroom stock instead of chicken stock, but I felt it was too thin at the end. I thickened it just slightly with some cornstarch dissolved in water, then pureed some of it - added more salt and a few sprinkles of red pepper, and finally added about half a can of low fat evaporated milk. With all those changes, it was pretty good, but I'm not sure this will be my go-to mushroom soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chad Jaeger"
},
"reviewBody": "At the end of cooking, I took about half of the soup and blended it. Then I added the other half back to the mix and it came out as a very nice creamy, but chunky soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Caillouette - Bolt"
},
"reviewBody": "Made it exactly as written, I even measured the ingredients (something of a miracle). I stopped by the mushroom farm and got a crate of portobellos but had no cream or milk in the house. I found this recipe, took a chance on it since I had the ingredients on hand and it was GREAT! I wouldn't change a thing, This soup is hearty and flavorful without the cream. The rich and buttery mushroom essence comes through loud and clear. I served it over pasta for the carbs. YUM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "my3boys"
},
"reviewBody": "Fantastic!! Super easy and delightfully delicious. I did recipe as stated. I used my immersion at the end and puréed it a little bit. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingjean"
},
"reviewBody": "The soup is very tasty. Made as is once and is great. Then I just make with whatever I have and eyeball everything. Still fantastic. What’s great is if you make a large batch as is, next day you can add kale or whatever else and it changes the soup’s texture and feels like a totally different soup! Made this a couple times and will continue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookin kitty"
},
"reviewBody": "Very easy and very tasty I used plain white mushrooms the soup was chunky and filling - I used beef broth but I would use chicken broth next time ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kickchick76"
},
"reviewBody": "I LOVE mushrooms and saw the reviews on this recipe was good, so I thought I'd try it out.\n\nI looked at changes others have made - adding garlic when sautéing vegetables. Also, added a bay leaf and parsley.\n\nI made a lot more vegetables because I wanted to have leftovers for the next couple of days, also added the celery leaves. But, I omitted the leeks and green onion.\n\nI also used 4 cups of chicken bone broth, another 4 cups of low sodium chicken stock, and 2 cups of water because I added so much vegetables.\n\nI toasted until lightly brown 1/2 cup of quinoa with butter, garlic, and onions, then added 1 cup of water and boiled until water was evaporated and added the quinoa as well.\n\nMy mom loves it too, she asked for the recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nan"
},
"reviewBody": "Simple ingredients combine to make a light but hearty soup. I took the advice of others and added garlic. I recommend doubling the carrots to add more color. I used homemade chicken stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Novel Cook"
},
"reviewBody": "I added garlic cloves to the sauté which made it extra flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camille DeFord Cox"
},
"reviewBody": "Used homemade chicken bone broth - it was fantastic. Maybe more mushrooms than necessary....... very hearty soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I never make recipes exactly as they are, so keep that in mind as I tell you that this was DELICIOUS!\n\nI used about 1.5 t dried Thyme with only 4 cups of vegetable broth. \n\nI added onion powder and a bay leaf but in retrospect, the additions may not have been necessary if I were more patient. The flavor develops as the vegetables cook down.\n\nI served it with sautéed chicken thighs and parmesan so guests could choose their own additions.\n\nYUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "evenovak"
},
"reviewBody": "I never make recipes exactly as they are, so keep that in mind as I tell you that this was DELICIOUS!\n\nI used about 1.5 t dried Thyme with only 4 cups of vegetable broth. \n\nI added onion powder and a bay leaf but in retrospect, the additions may not have been necessary if I were more patient. The flavor develops as the vegetables cook down.\n\nI served it with sautéed chicken thighs and parmesan so guests could choose their own additions.\n\nYUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tishprint"
},
"reviewBody": "Kept one container out for lactose intolerant friend, then added quart of half and half. Next time I’ll blend half the soup and return to pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "allrecipies"
},
"reviewBody": "I love this recipe. I cooked the carrots, celery, onion, and some garlic cloves a little longer than what the recipe calls for before adding the beef broth. Overall this is healthy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Perez"
},
"reviewBody": "Very good and I tweaked it for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Agnes"
},
"reviewBody": "This soup was surprisingly delicious--the best broth-based mushroom soup I've made. Used lovage in place of celery, added a lot of garlic, because we love garlic in everything. The leeks gave it a lovely, subtle flavor; the carrots a burst of color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberlie"
},
"reviewBody": "Perfect as written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TMPhil"
},
"reviewBody": "I made it with baby bella mushrooms. Being single, I usually make half or less of a recipe I'm trying out. I wish I'd made the whole thing! Rich and savory. Will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mesch"
},
"reviewBody": "I loved it but I halved the recipe and used just yellow onions since I had no leeks. I also added 1/2 c white wine and used dry thyme (1tsp) and added chopped garlic (1tsp). I took about 1/3 of the soup and pureed it in the blender to make it thicker. Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ross Elliot"
},
"reviewBody": "LOVED it. Hummed and hahed about including garlic, and am glad I didn't as this would have dominated the other subtle flavours. didn't have leek to hand so added a bit of red onion, and also added dried porcini and shitake powder just because I had them and treat them as an extra seasoning for many soups. AND (The squeamish can look away now) I added a good pinch of MSG, because I always do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Small"
},
"reviewBody": "This was an easy, quick and tasty soup. I doubled up on the thyme, but otherwise followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrice Luongo"
},
"reviewBody": "my family and friends love this soup. I use vegetable broth so its totally vegetarian. Its hearty and flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PSL3vy"
},
"reviewBody": "We made this soup for dinner using a pound of baby portobello mushrooms and a pound of white mushrooms. It was good but when we added cooked black rice, it got noticeably better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Towarnicki"
},
"reviewBody": "Have made the soup twice now and we love it. Market had a variety pack of mushrooms which I used along with cimmini and white buttons. Used the immersion blender for the creamier version. Will definitely be making this again. It tasted even better the second and third day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CEJONES"
},
"reviewBody": "Excellent! Minor adjustments. Added more carrots/leek/celery. Scrapped corn of one ear and added it. Added a little bit of white wine - maybe a quarter cup. Added 1/4 cup whole wheat orzo pasta .Added a little more chicken broth. Used dry thyme - less than what the recipe called for, and a little bit of fresh ground pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "darlygrace"
},
"reviewBody": "Was easy to make . Good flavor but I did beef broth and threw in some left over roast ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yolisalou"
},
"reviewBody": "This was absolutely delicious! I added orzo just because I had some on hand. It smelled delicious while cooking! I will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carina Bandhauer"
},
"reviewBody": "We puréed it and it was absolutely delicious. In the absence of visible mushrooms even the kids loved it. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Sullivan"
},
"reviewBody": "Very good healthy soup. Like others, I used an emmersion blender to purée a portion to make the soup a bit thicker. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaline G. S. Saud"
},
"reviewBody": "I add garlic and smoked provolone cheese peaces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NANCY"
},
"reviewBody": "Theses my new go-to recipe. I made it three times and the last time VEGAN for a friend. Superb! I added chopped escarole and garnished with chives and scallions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tuck"
},
"reviewBody": "I used dried thyme and it was still great !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fenwickfamily"
},
"reviewBody": "Loved it! Very earthy flavours and packed with goodness! The only changes I made were to add beef broth, and an addition of dried italian seasoning along with the fresh thyme. Delicious :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it! Very earthy flavours and packed with goodness! The only changes I made were to add beef broth, and an addition of dried italian seasoning along with the fresh thyme. Delicious :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Sheppard"
},
"reviewBody": "I had a soup very similar to this at a vegetarian restaurant in the area and LOVED it ! I came home that night and found this recipe , it is super close and with a few tweaks I had found my new favorite soup ! You cannot go wrong with this one !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "In place of the brown or white button mushrooms I had obtained a selection of mushrooms from an Asian food market. I used oyster mushrooms, shiitake mushrooms, and brown beech mushrooms. I also didn't have any celery on hand so I had to leave that out. It turned out to be a great soup. Very tasty, low-fat, and great texture with the Asian mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Preeti"
},
"reviewBody": "This recipe is a keeper! Simple, healthy and delicious soup. I just added garlic and a bit of barley. Perfect as is or alongside a nice sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeaGoddess"
},
"reviewBody": "What a wonderful soup for chilly days! The only things I added were cubed grilled chicken, red pepper flakes and fresh tarragon. I will definitely make this soup again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laney Emerson"
},
"reviewBody": "The basis of the soup was pretty good, however I used only 4 cups of chicken stock. Instead of using leaks, I doubled the onions and put garlic powder in, and a few cloves of garlic. As you can tell I like garlic. I also put multigrain quinoa for some starch, I thought it added a nice touch. For herbs, I add basil, oregano. I am not a big salt person, so I thought the chicken stock was salty enough so I did not add anymore salt. I hope this review helps someone, enjoy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitchendiva"
},
"reviewBody": "I thought I would be the only person eating the soup, so I made half the amount. My sister came by and loved the soup so much she took half of the soup with her. This soup is so good! I will be making this soup twice a month during the fall and winter months."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Jean"
},
"reviewBody": "I had a 10-oz pkg of mushrooms that needed to be used, and I'm glad that I came across this recipe! I halved it and used vegetable broth. I didn't have leeks on hand but did add 1 cup of chopped cabbage. I also added about 1/4 cup of red wine and some garlic powder. I love the rich, earthy flavor of this. It would also work well with beef broth, dried mushrooms, worcestershire sauce and a little barley. I tried some yesterday when I made it, but today it definitely has a better flavor. I also added some chopped rotisserie chicken, and that works very well here. Thanks KitKat. This is a keeper of a recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GREENGABLES"
},
"reviewBody": "A fresh-tasting, light alternative to cream of mushroom soups; thank you for posting this, KitKat. The only change I made was to add a shake of garlic granules; will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Mullin"
},
"reviewBody": "I followed other's suggestions and pureed some of the soup to thicken it and added some garlic. I've made it twice and once added a bit of milk - both ways were tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rita"
},
"reviewBody": "It needs a LOT more flavor. Used Hemp milk to give it a 'base' then added more onions, smoked sea salt &amp; sweet paprika, smoked paprika and more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ines832"
},
"reviewBody": "Really great, easy, and healthy recipe. It was also very delicious. Followed all of the instructions as they were except I also added garlic and did not have any leeks. It was DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jglewis99"
},
"reviewBody": "Good healthy soup. I made it almost exactly as the recipe described, except I added 2 cloves of garlic and a bit of dijon mustard to give it a little kick. I would add more garlic next time and some wild rice or barley to give it more substance. Also I would use fresh thyme instead of dried thyme - I just didn't have any. The dried thyme is not really ideal for soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "Used 8 ozs less mushrooms and only 4 cups of low sodium chicken broth. Put in three shallots instead of leeks. My wife and I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanmcq923"
},
"reviewBody": "This is an excellent soup! It was pricey as the mushroom are expensive - but really worth it. I did follow Chef John's technique of caramelizing the mushrooms to bring out the full flavor and I also added a little crushed garlic. No leeks as I did not have any. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Meigs"
},
"reviewBody": "I was surprised how \"meaty\" the mushrooms made this soup. I added in a bit of leftover chicken sausage, but it really didn't need it. Hubby loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Frost"
},
"reviewBody": "This was amazing. I have been looking for a simple mushroom/vegetable soup without cream for a while. This one was easy and great. Everyone raved at the smell while cooking, and the taste. I can see using this as a base and adding other ingredients. Since this was my first time cooking this soup, I decided to follow the recipe. I wasn't super exact in the measurements, but pretty close. I did follow the cooking instructions. I did not add salt and pepper, and no one else eating it did either. It was perfect as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Mitchell"
},
"reviewBody": "Yum! full of flavor, lite and easy to make. the kitchen smells wonderful while it cooks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga L"
},
"reviewBody": "Awesome soup! Will definitely make again. Added barley to be more filling, and more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2cook32"
},
"reviewBody": "Two thumbs up! I made this one evening to have for lunch as I work from home and I'm always looking for healthy lunch ideas. This totally hit the spot. Just a few things I did different which I don't think really changed the recipe all that much. I halved the recipe since it was just for me. I used one pound of the baby belles and used one dry shiitake soaked in about 1/2 cup of water. I used the soaking water when I added the broth ( which I used homemade chicken stock). The only other change is that I used dry thyme instead of fresh. Next time I think I will use two shiitakes. I will for sure make this again and again as it makes for a great light healthy lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Yada yada yada"
},
"reviewBody": "I had really high hopes for this recipe based on the reviews and it smelled great when it was cooking, but the final product, as written (including option leeks) is bland. After being somewhat unhappy with the end product I made some modifications. Added more thyme, some garlic, 1/4 cup red wine and probably 1 tsp salt and at least 1/2 tsp of pepper. Salt and pepper \"to taste\" always leaves room for interpretation. Considering the chicken broth already in the recipe (used \"Not So Chicken\" broth cubes) there's a lot of salt in this particular pot of soup. I wish I would have loved it like most others, but it wasn't meant to be. I'll be sticking with pub-style chili, great northern bean soup and creamy vegan corn chowder recipes from this site as my go-to soups for the moment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICKE"
},
"reviewBody": "Wow thanks for the yummy recipe. Only thing I did differently was to add one clove of minced garlic when sautéing the onions. I also didn't have any leeks, so added a few extra onions. Delicious !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sara"
},
"reviewBody": "It's a good base. I think it needs a little something to add more flavor. It was kinda bland to me. Maybe garlic or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mike"
},
"reviewBody": "i make this tecipe all the time so easy! very light on calories! i add fresh garlic and dont use leaks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dianepz"
},
"reviewBody": "Very bland as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kendra"
},
"reviewBody": "So good! I had green onions, but not regular/yellow, so I used garlic. The footnote of the recipe mentioned rice, so I used a little more chicken stock, and partway though simmering I added about 1/4 cup rice. With fresh ground pepper to finish, this is awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "This soup recipe has good bones, but for my tastes it required quite a bit of tinkering to make it work for me. What foremost impressed me about this soup is that I could feel good eating it - it is nothing but fresh, lovely ingredients. But it was a bit on the weak side in terms of substance and flavor. Given the submitter gives her permission to modify this to our tastes, I did, in several ways. I don't like carrots, so that was already out. I was a little short on the amount of mushrooms and had no leeks so I filled in with zucchini and fresh baby spinach, (added at the end until just wilted). Finely chopped red bell pepper added both color interest and flavor. I sautéed the vegetables in olive oil and added fresh minced garlic, tho' I would have had no problem using garlic powder if fresh was not available. A good glug of white wine (Pinot Grigio) and a combination of both chicken and beef stock also lent a deeper color and flavor. At this point I was happier, but still something was missing for me. While this soup certainly wasn't a deal breaker without it, adding a little pastina (small soup pasta) completed this for me, making it rich and satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momofunder"
},
"reviewBody": "Not a huge fan of thyme. But a great addition is dill. I have made this several times and change it up some each time. I have added Potato, spinach, beef, wine you can pretty much add in whatever you want. I have added sour cream and milk also to switch it up sometimes. But dill is the major change I like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AR29"
},
"reviewBody": "Saute garlic with the butter.. Sprinkle with parmesan cheese for added flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keebdaisy"
},
"reviewBody": "I like to stick to the recipe the first time and then make changes. So glad I did, this was so good and so easy. I didn't have the \"optional\" leeks but hope next time to add them. I had organic chicken broth and for the mushrooms, I used 1/2lb baby bellas and 1-1/2lb white buttons. At the end I did use a hand mixer to smooth out about half of it. I thought this was very flavorful. Didn't even have to add the rice mix as noted in the footnotes as a possible addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathi Makowski"
},
"reviewBody": "I am a soup lover, and this mushroom soup is outrageously delicious! It was extremely easy to put together, and as mentioned by another reviewer, I added garlic for additional flavour! Prepare to give your taste buds a treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Laurn"
},
"reviewBody": "I love this recipe! I prepare a box of Uncle Bens wild rice and add it at the end! Awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James York"
},
"reviewBody": "When I first made this I was afraid I was going to be disappointed. Not so. I did make a couple of changes. One was to add a couple of cloves of garlic when cooking the vegies then I added 5 tbsp of wonder flour gravy mix to thicken it a bit. Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristoffer"
},
"reviewBody": "Added the garlic as so many reviews suggested, used some dried mushrooms along with the button and portobello ones and went with a veggie broth and olive oil instead of butter. Also added a heaping tablespoon of organic miso paste. Garnished with grated parmesan reggiano. Yummy in my tummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "This might be a great soup for other people but it wasn't my favourite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosemary's Kitchen"
},
"reviewBody": "Tasty and very easy to make! If you want to get around the brothiness, add some milk and a couple of tablespoons of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosemary's Kitchen"
},
"reviewBody": "Tasty and very easy to make! If you want to get around the brothiness, add some milk and a couple of tablespoons of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pittstlrfan"
},
"reviewBody": "Absolutely loved it.....I read the reviews and did tweak it a bit....added 2 cloves garlic when cooking the vegetables, added a few strong dashes of hot sauce, added 1 beef bouillon cube crushed, an extra two cups of chicken broth, 1 1/2 cups rotisserie chicken broken in tiny pieces, and when I was putting the lid on to simmer I added about 2 cups of small shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Copper"
},
"reviewBody": "This is a really good soup for beginners like me who are new to cooking. I used 3 beef bouillon cubes instead of chicken and added about a little less than a 1/2 a palm of celery salt(sub for the reg salt as I had no celery), and 3 cloves of garlic. This recipe is very versatile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rbutter"
},
"reviewBody": "Great soup to enjoy on a cold evening with some type of rolls on the side. I added some cut up chicken breast, shirataki noodles, and one clove minced garlic and it was a hit with everyone in the family! Since I added some extras I cut back on the vegetables some, like no leeks (didn't have any at the store) and less celery and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ballering Kathleen"
},
"reviewBody": "Made for the first time tonight. Added a clove of chopped garlic to the veggies and sautéed them before adding the broth. Also added a cup of wild rice and only pureed part of the soup. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ritarose"
},
"reviewBody": "I wanted a mushroom soup that was lower in calories than the cream of mushroom soups I love so much, decided to give this recipe a go. It had ingredients that I already had on hand, quick to make, and utterly delicious. A friend popped over after it was done so I offered her a bowl. She raved and raved about it and had to get the recipe so she could make it for her family that night. My husband loved it as well! Can't wait to try it on my adult kids, some who have declared their disdain for all things soup. The flavor in this soup is amazingly irresistible! Thank you for posting your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CN"
},
"reviewBody": "I used vegetable broth &amp; olive oil (instead of chicken stock &amp; butter). This is one of the easiest and best soup recipes. Also allergy-friendly, I barely had to alter. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annettegrant76"
},
"reviewBody": "Gorgeous soup, great for me as I hate creamy soups. \r\nI followed the recipe exactly but would add more stock next time. I only used 1lb of mushrooms and that was plenty? Will be making this again and again...."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/59571/mushroom-soup-without-cream/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/59571/mushroom-soup-without-cream/",
"name": "Mushroom Soup Without Cream"
}
}
]
}
}
, "about": [
]
}
]