				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mushy Peas"
,"datePublished": "2018-06-08T09:20:41.000-04:00"
,"dateModified": "2022-12-09T13:54:36.654-05:00"
,"author": [
{"@type": "Person"
,"name": "Stella"
,"url": "https://www.allrecipes.com/cook/24328400"
}
]
,"description": "Mushy peas are a simple and tasty side dish great with any entree, especially fried cod. They add vibrant color and creamy goodness to any plate."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8ZFiJ10IdBONltSKf930FlOrfcg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/232142-0369424451774189ad2c3fb6a41b834d.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6316912263112",
"description": "",
"duration": "PT43S",
"name": "How To Make Mushy Peas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/95fa94e6-58cb-493b-a124-7349db1e64e8/4059d762-a599-4cbf-832e-d0e7e527b3bb/1280x720/match/image.jpg",
"uploadDate": "2023-01-13T15:37:46.912-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mushy Peas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "88"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "132 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "28 mg"
,"fiberContent": "3 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "396 mg"
,"sugarContent": "4 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 (10 ounce) package frozen green peas",
"0.25 cup heavy cream",
"1 tablespoon butter",
"0.5 teaspoon salt",
"0.5 teaspoon freshly ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a shallow pot of lightly salted water to a boil over medium-high heat. Add frozen peas, and cook for 3 minutes, or until tender."
} ,{
"@type": "HowToStep"
,"text": "Drain peas, and transfer to a blender or large food processor. Add cream, butter, salt , and pepper, and process until blended, but still thick with small pieces of peas."
} ,{
"@type": "HowToStep"
,"text": "Adjust seasonings to taste, and serve immediately."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "If you’re looking for a recipe for mashed frozen green peas, you’ve found it. If you’re looking for British mushy peas, this isn’t even close. Frozen, or even freshly shelled, peas have a completely different texture and flavor from dried peas (traditionally marrowfat peas in England, but regular American split peas are fine), which are more bean-like. So, I give no stars because it’s not the dish that it claims to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "info"
},
"reviewBody": "This is about the closest recipe I can find to authentic UK mushy peas, Very simple to make and very tasty too:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sienna"
},
"reviewBody": "The best mushy peas ever! So easy to make! If you don’t have time to soak the marrow fat peas I suggest you use those recipe I had mine with a meat pie ohhhh glorious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natasha David"
},
"reviewBody": "Tasted a little bland. I added some fresh mint leaves and some chilli powder. This definitely elevated the dish. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "6.22.20 ... https://www.allrecipes.com/recipe/50281/mushy-peas-i/ ... I like creamed peas. I do. This is mushy creamed peas, adding more cream. If you're a \"texture\" person, maybe this would get you to eat peas - or your kids to eat peas. If you have a mini-chopper that fits in the dishwasher, it's worth it. 'Kind of pretty in a weird sort of way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Anul65"
},
"reviewBody": "This is NOT how you make mushy peas!! The correct British method is to dissolve bicarb in boiling water, pour over DRIED peas and soak over-night. The following day, drain the peas, place in fresh water to cover the peas, bring to boil then simmer until they turn mushy. Mushy peas have a distinct flavor and any other recipe or method will not produce the distinct flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janny"
},
"reviewBody": "So simple. So delish. Just like the mushy peas I had at the Cross Guns Pub in Bradford on Avon, UK."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Osborne"
},
"reviewBody": "We fell in love with mushy peas while in England. This may not be 100% authentic as some feedback states but it is 100% DELICIOUS!! We loved it so much we bought more peas the next day so we could make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jbean"
},
"reviewBody": "I made fish and chips one night and thought\"hey, maybe I can make mushy peas like I had in Ireland.\" I was really hoping this would work, but it wasn't great. I think it needs to be made with dried split peas. Yes, it is mushy and tastes like peas, so wasn't terrible. But if you're looking for British/Irish mushy peas, this isn't it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iloveit"
},
"reviewBody": "EASY FAST DIFFERENT. Its hard to make different because it is just mashed peas. But it's different, it's fun. I saw Anthony Bourdain have this in Britian so I looked them up. They said try a spoonful without, then drizzle a tiny bit of vinegar over it and try again. Very good with the vinegar. I did not see a recipe that mentioned it so I choose to use Malt vinegar. That is what makes it different. Try it. I just used my immulsion mixer, and did not mash totally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jr Tomlin"
},
"reviewBody": "These may or may not be the best peas ever as a reviewer said, but the are most definitely NOT 'Mushy Peas'."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christmas Queen"
},
"reviewBody": "Neither myself or my husband are huge pea fans, so I made this recipe with a plan \"B\" side dish in mind. It came out so well- there was nothing left of it. I did make a few small changes. I added 2 T. of butter and replaced the heavy cream with sour cream since that's what I had on hand. Thank you for a quick and easy veggie side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Greg&Jenni"
},
"reviewBody": "Very good and still had much of the pea flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Delicious and I don't even like peas! I will be making this again! Thanks for the recipe it's a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ltlkrow"
},
"reviewBody": "Good, true recipe. I use sour cream instead of heavy cream as per Nigela's advice. I sometimes put in a little mint."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "Not bad, but I much prefer my peas unmushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAPTORSHARK"
},
"reviewBody": "Very good! I used this recipe to make my own version of Harry's Tiger Pies. I followed the recipe &amp; added in a bit of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly21602"
},
"reviewBody": "great recipe for when you can't find the traditional peas used in mushy peas. Taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "expatgal"
},
"reviewBody": "As an expat Brit, craving mushy peas, I enjoyed this recipe. Thank you! It did lack something, though. I can remember my grandma boiling up a pot of dried peas, and they were delicious. I guess frozen peas weren't an option in her day. I'll see if I can get a recipe from one of my elderly relatives still in the UK, and post it. Now if anyone out there can tell me how to replicate Fray Bentos Steak and Kidney pies... :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beckyp382"
},
"reviewBody": "Good taste, but awfully rich"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "montanagrizz"
},
"reviewBody": "I have never had this dish before, but I like peas and was making fish and chips, so what the hey!\nI have no experience to compare this recipe with another, but I did find it very tasty and a nice addition to my menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovestohost"
},
"reviewBody": "I'd never had/heard of \"Mushy Peas\" until I stumbled upon them here on AR. I added the recipe to my box and promptly forgot about it. I \"found\" it this week and decided to (finally) give it a whirl. I made the recipe even easier by using a (12oz) bag of Steam Fresh peas, then tossed them in the blender w/the butter, salt, and 1% milk. Super easy and quite yummy, for peas! I have a feeling these will become a last minute side staple at the LTH house. THANKS, Stella!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shoebear"
},
"reviewBody": "These peas look so festive on the plate, really lovely color. I didn't have heavy cream but 2% milk seemed to work well enough in this recipe. Easy to eat too. Hats off to you, Stella!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bubbe"
},
"reviewBody": "i dont really like peas, but used this recipe and added one diced new potato and minced garlic. It was soooo good, I will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "westcoastcook"
},
"reviewBody": "We had mushy peas whilst in England and this recipe tasted better than what we had over there. My husband, who is English, thought they were very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Dome Dunn"
},
"reviewBody": "My kids don't care for peas too much. When I made this, they were fighting over the last little bit! Very simple and GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Yummy! I have never eaten mushy peas before, but I like steamed peas, so I thought I'd give this a whirl. If you can get past the texture (I can see how it might be off-putting...), I think you'll enjoy this dish. If you're like my hubs, you probably won't (he compared this to pre-chewed peas lol!). :) If you like less \"mushy\" peas, reduce your blending time and/or amount of liquid called for. I found that 1/4 c. liquid and a good couple pulses in my blender was spot on (I have a powerful KitchenAid blender). I also found the amount of seasoning to be perfect as is with no need to season to taste afterwards. NOTE: I substituted a bag of \"steamable\" peas (i.e. the variety that you microwave, unopened) and fat-free half-n-half with EXCELLENT results (the latter cut out a LOT of calories!). Thanks for a perfect complement to my fish &amp; chips dinner, Stella! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smith711"
},
"reviewBody": "These were a hit! They looked gross but, were awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "I just made these peas except for steaming them instead of boiling them. After I steamed them I let them simmer in the cream. I added the s/p, butter, and then mashed them in my pot. It really improved the taste of the frozen peas. I liked them, and so did my family. I have made dried peas before and think those have better flavor than frozen, but unless you are trying to master a british recipe I don't think it is necessary to use dried peas. These didn't look or taste \"frozen\" after simmering in the cream. I think the taste improved the longer they simmered, too. I'm glad to have them add variety to my meals as an easy vegetable side. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delish! Yes, you have to like peas... but if you do, you're sure to enjoy this. I used a stick blender, rather than a food processor, which worked just fine, and half-and-half instead of heavy cream. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Utmostrose"
},
"reviewBody": "This is great! Next time I will drain the peas (I used sweet canned) to have a thicker consistency, although a thinner consistency can be used as a soup or a \"gravy\". I added a half teaspoon of wasabi paste and 8 tablespoons sour cream as well as and 4 tablesppons minced garlic (I love my garlic). Hubby likes it too. I didn't have heavy cream, so i made some out of 1/4 cup regular milk and 2 tablespoons butter in addition to the 1 tablespoon butter called for in the original recipe. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "eddico"
},
"reviewBody": "These were okay. Not too exciting, but not untasty. Mine turned out a bit to watery. Be careful to drain well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harriet Green"
},
"reviewBody": "Certainly not traditional Scottish, English or Irish Pub style to serve with fish and chips since they lack the tangy flavour, but they are Peas and they are Mushy so I give this a five. However, best to use dried Marrowfat Peas for colour and flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keri"
},
"reviewBody": "I was looking for a British veggie recipe to serve as part of our Harry Potter birthday dinner today. Some friends on the Recipe Exchange said that Mushy Peas are British, so I went with these. They were pretty good, but I did find that I needed a little extra salt and pepper. I don't have a food processor, so I just mushed the peas up with the back of a slotted spoon. Thanks for rounding out our Harry Potter birthday dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy Guillotte"
},
"reviewBody": "I liked the mushy peas and liked saying it, but no one else in my family liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wiser1"
},
"reviewBody": "MMMMM... MUSHY PEAS!!! I JUST LOVE SAYING MUSHY PEAS... THESE WERE GREAT- TASTED LIKE THE ONES WE EAT AT OUR FAVORITE IRISH PUB!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jute"
},
"reviewBody": "Excellent recipes, never had them before, but needed them for a English dinner I was making; guest who had them in England before loved them, so give this recipe a try, very simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pumpkin girl"
},
"reviewBody": "Perfectly delicious! I love mushy peas with my fish n chips at the pub, but had never thought of making them at home, now I think I'll make them all the time, they're so good and easy to make! I made this and mashed potatoes with veg gravy to accompany the lentil loaf recipe - my husband and i were in heaven! I did use just my regular low fat milk instead of the heavy cream and wasn't bothered by it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jhoppee"
},
"reviewBody": "Perfect! What a great way to eat a vegetable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruben Zuniga"
},
"reviewBody": "Had as a side for Roast Beef and Yorkshire Pudding. Stellar! Really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scrap"
},
"reviewBody": "Just made some to go with my saturday morning fry-up. Great stuff with kippers! 5 stars,Stella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "migsy"
},
"reviewBody": "I was actually pleasantly surprised by the taste. I only made them on a lark, after joking about them with an English friend of mine, especially since they don't look all that appetizing. I followed the recipe exactly, and it was so easy. I'll definitely be making them again, and may even try using cream cheese instead of the heavy cream, like someone else suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mrs.Z"
},
"reviewBody": "Peas are always a great side dish, however if you are looking for AUTHENTIC mushy peas, you need to use marrowfat peas and follow the directions. Being from England, i am fussy about my peas and no other peas but marrowfat peas will truly make traditional english mushy peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenniferdori"
},
"reviewBody": "Delicious! I mashed the peas with a potato masher like another reviewer suggested, and they were very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookingMama"
},
"reviewBody": "Not bad. I am not a pea lover, but my husband adores them, so I needed a recipe that I might want to eat too. It was actually pretty good. I think next time I will use less pepper and perhaps add some sauted onions or crispy bacon. However, you got this girl to eat peas, so consider this recipe a success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "irish carfi"
},
"reviewBody": "We really enjoyed these, especially my toddler son. I mashed the peas with a potato masher, and whipped them smooth with the hand mixer. Used half and half and they were a great consistency. I served them with roast chicken and mashed potatoes. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "These were a great and healthy alternative to mashed potatoes. I used light soy milk because I'm lactose intolerant. I also used garlic salt instead of regular. Next time I'll use dried peas as suggested and maybe add a little bit of onion and use fresh garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krista v."
},
"reviewBody": "Yum! Reminds me of the fish and chips dinners I ate in Ireland's and England's cozy pubs. I didn't have cream so I used sour cream and a potato masher. Be sure to heat the cream and warm up the butter before stirring into the peas. Same goes for mashed potatoes..comes out way better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malina Bleeding Heart Morris"
},
"reviewBody": "Wow these are so good! And simple. I used fat-free half and half and they turned out perfectly. I made these with grilled brats and garlic mashed potatoes for Bangers and Mash. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kitchenkelly246"
},
"reviewBody": "I don't eat mushy peas so I didn't have any but they got pretty decent reviews. The only thing was that my mum said they were too mushy which was the fault of my million year old blender (and not the operator!). Decent recipe but nothing to rave about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teatime"
},
"reviewBody": "I agree with Akrotiri's review of 3/10/08. Authentic British Mushy Peas are made from dried split peas, soaked overnight in water with 2 tsp. of baking soda - follow Akrotiri's recipe. They have their own unique taste and lend themselves to additions of butter, half-and-half, mint and/or malt vinegar. Mushy Peas are part of my fond memories of growing up in England years ago. My American born husband found the dried pea recipe \"interesting;\" he preferred the frozen pea recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly S George"
},
"reviewBody": "Surprisingly good. It makes me like peas again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Akrotiri"
},
"reviewBody": "TIP: For authentic mushy peas as served in English/Irish pubs, you never start with canned or frozen peas. This is an easy basic recipe to which you can add seasonings, that I will be bringing to a St Paddy's day party hosted by Irish friends from Dublin: \nSoak dried peas overnight in a large bowl with several cups of water, and 2 tsp. of baking soda. The baking soda is important as that is what makes the peas break down. The next day, drain the peas, add water just to cover, and simmer for 20 mintues. The peas will break up nicely without mashing. Add a little water if needed to bring to the consistency you like. Don't season until the end or it toughens the peas. It's great served with malt vinegar, and you can add mint if desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsD"
},
"reviewBody": "Great. I combined Mushy Peas II recipe with this one and added the green onions and mint. Also, I used my favorite peas \"Le Sueur Very Young Early Peas\" in the silver can. (they are THE best!!) My boyfriend from Ireland liked this recipe very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NCRAN"
},
"reviewBody": "I've made this numerous times and just realized that I never gave this recipe a proper review!! This is a great side dish to have in your back pocket in case you're out of potatoes or you just don't feel like having a carbo-load side dish of rice or something like that.. Even if you don't usually like peas, I would give this a try. I cook a large bag of frozen peas.. drain them realllly well (this is important), dump them into my food processor and add about a 1/4 to 1/2 package of Light Cream Cheese... whiz it all up and make sure to add a generous amount of kosher salt and a grinding of pepper! I will make this again and again.. its a shame I don't have any children, cause I'm sure this would get them to eat their peas.. well it works on my husband ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "These were great. They only reason I gave them a four is because I couldn't seem to get over the thought of mushy peas. But they tasted great. Make sure you serve hot hot hot. They cool very quickly :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vanessajbaca"
},
"reviewBody": "These came out great. I boiled three cloves of garlic with the peas, then mushed them up together, then added fat-free creamer, a spoonful of sour cream, and eyeballed the butter and salt and pepper, and they came out fantastic! The texture was knobbly-smooth and the flavor went perfectly with a pecan-crusted, honey-mustard glazed salmon recipe also found on this site. A great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FOODGU1"
},
"reviewBody": "Pretty good and so easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wildheart6"
},
"reviewBody": "I was a little skeptical at first, but was this really good! My five year old daughter (the picky one) even asked for seconds! My husband enjoyed as well and he won't usually eat any vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahS"
},
"reviewBody": "I first had these in London with fish and chips so I was really happy to see this on allrecipes.\nUnfortunately, I didnt have any cream on hand so I had to use 2% milk and I just couldnt get the same creamy texture (even though I added a little more butter). I ended up adding a little bit of potato to help get a better consistency. Came out tasting great, it was a great accompaniment to the meal I made but its just not the same (as the authentic English kind) without the cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "While both of us like it the taste wasn't much different from actual peas. I did like the consistency so I guess if you want something like that and aren't making potatoes it might be better. Will probably make again. Very very easy. Made with cheddar chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Guzik Fenton"
},
"reviewBody": "Yummy! I have one son that doesn't like peas and now I have a recipie everyone enjoys. I used half and half because I didn't have cream. Thanks this ones a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This was perfect! I've never been a huge fan of peas, don't mind them, but they're not one of my favorites. My fiancee, on the other hand, LOVES peas, so I try to come up with different ways to cook them so that we both like them, and I've finally done it with this recipe. From now on, this is going to be my default peas recipe - super quick, delicious, and easy clean up since I used my immersion blender and \"mushed\" them in the same pan that I cooked them in. Wonderful side dish - I served this with roast beef and Yorkshire pudding for a big, complete meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodie77"
},
"reviewBody": "I have made this recipe twice - once as is and the second time I substituted chicken stock for the heavy cream and added a teaspoon of wasabi powder. Loved both versions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CTbunny"
},
"reviewBody": "This is a quick and delicious recipe! My boyfriend is British and thought they were very good. Not as smooth as mushy peas from an English chip shop, but the flavor is excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "Best peas ever. I did not want mine so pureed, so I just used a hand held potato masher to mush them up with the butter, cream, salt, and pepper and they turned out GREAT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STARKRAZI"
},
"reviewBody": "Not bad, not sure if i should heat up the next time. Served it with salmon and the combination was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLE888"
},
"reviewBody": "My boyfriend and I just returned from the UK and we fell in love with mushy peas while we were over there. I was delighted to find a recipe for them on allrecipes, however I was really skeptical as to how they would taste. These were AWESOME, and tasted just like the mushy peas we enjoyed in England! Thank you so much for this easy, delicious recipe. I served these with traditional fish and chips... fried cod and fried potato strips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MinnieMay9"
},
"reviewBody": "It has a nice peppery flavor without overwhelming the peas."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/50281/mushy-peas-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
"name": "Vegetables"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2018/side-dish/vegetables/green-peas/",
"name": "Green Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/50281/mushy-peas-i/",
"name": "Mushy Peas"
}
}
]
}
}
, "about": [
]
}
]