				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Mushroom and Spinach Ravioli with Chive Butter Sauce"
,"datePublished": "2019-04-03T23:49:15.000-04:00"
,"dateModified": "2019-04-03T23:49:15.000-04:00"
,"author": [
{"@type": "Person"
,"name": "larkspur"
,"url": "https://www.allrecipes.com/cook/3097894"
}
]
,"description": "This homemade ravioli is actually vegetarian, but no one who tries it can tell! The savory filling contains three different cheeses, mushrooms, and spinach. Although it&#39;s a rather time-consuming recipe to prepare, the results are well worth it!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/scdZvNlFKRqZQb-vG_gzdrPe2bM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/433038-3c918df0b6ba4b1bb436a6682cec26c8.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Mushroom and Spinach Ravioli with Chive Butter Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "116"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "371 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "108 mg"
,"fiberContent": "2 g"
,"proteinContent": "14 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "392 mg"
,"sugarContent": "2 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT120M"
,"recipeIngredient": [
"1 teaspoon olive oil",
"1.5 tablespoons water, or more if needed",
"2 eggs",
"2 cups all-purpose flour, or more if needed",
"0.25 teaspoon salt",
"1 teaspoon olive oil",
"1 clove garlic, minced",
"0.5 cup chopped onion",
"1 (8 ounce) package fresh mushrooms, coarsely chopped",
"4 ounces cream cheese, softened",
"0.33333334326744 cup grated Parmesan cheese",
"0.5 cup mozzarella cheese",
"0.5 cup frozen chopped spinach, thawed and drained",
"1 tablespoon chopped fresh chives",
"1 tablespoon chopped fresh parsley",
"0.5 teaspoon ground cayenne pepper",
"salt and ground black pepper to taste",
"1 egg white, beaten",
"3 tablespoons butter",
"1.5 teaspoons chopped fresh chives" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Whisk together 1 teaspoon olive oil, water, and whole eggs in a bowl until evenly blended; set aside. Combine flour and salt in a separate large bowl, and make a well in the center. Pour the egg mixture into the well and stir just until combined. Turn dough out onto a lightly floured surface and knead until smooth, 5 to 10 minutes, adding more flour or water as needed. Wrap dough tightly with plastic wrap, and set aside to rest."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 teaspoon olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion begins to soften, about 2 minutes. Add the mushrooms, and continue cooking and stirring until the vegetables are soft and the liquid has evaporated, about 10 minutes. Remove from heat, and allow to cool."
} ,{
"@type": "HowToStep"
,"text": "Beat cream cheese in a bowl until smooth. Stir in the cooled mushroom mixture, Parmesan cheese, mozzarella cheese, spinach, 1 tablespoon chives, parsley, and cayenne pepper. Season with salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "Roll the pasta dough out to about 1/16 inch thick. Cut 3 to 4-inch circles using a large cookie cutter. Roll each circle out as thin as possible. Working with one circle at a time, brush the pasta lightly with the egg white. Scoop about 1 heaping tablespoon full of the mushroom filling onto the center of the pasta, then cover with a second piece of pasta, pinching the edges to seal. Cut the sealed ravioli with the cookie cutter once more to create a uniform shape. Place the finished ravioli on a floured baking sheet, and repeat the process with the remaining pasta and filling."
} ,{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the ravioli and return to a boil. Cook until the pasta floats to the top, 3 to 4 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "To make sauce: Melt butter in a skillet over high heat, cooking and stirring until browned, 5 to 7 minutes. Stir in 1 1/2 teaspoons chives. Serve over hot ravioli."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sgrams"
},
"reviewBody": "We've been making this recipe for several years. It's our favorite. Takes time but it is sooooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elgie"
},
"reviewBody": "I'm new to homemade ravioli so I made this just as is, but I can see that variations (once familiar with the recipe) are delightfully numerous! Well done! My raviolis - my very first - turned out beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fay"
},
"reviewBody": "First time ever making pasta and it turned out great. Made it with my daughter-in-law and the hubbies loved it! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Rickman"
},
"reviewBody": "The directions were pretty easy to follow and it came out great. I tested it on several friends and they all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Talucci"
},
"reviewBody": "The dough was great and simple. Another review suggested to skip the cayenne, I would too. Next time I’m going to substitute Cinamon for cayenne. I’d also boil for 5-6 minutes , unless you like Aldente."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "It was our first time making homemade ravioli. It took 2-1/2 hrs but was a good activity for a family stuck at home during this pandemic. It tasted great. Made ~20 ravioli. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Loves to Cook"
},
"reviewBody": "This recipe is amazing. Did not change a thing. Delicious browned butter with chives on top. Time consuming only if you dont have the time or truly dont love cooking. I love trying new recipes and love cooking. Thank you AllRecipes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Ellwood"
},
"reviewBody": "Loved this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squirreltwitch"
},
"reviewBody": "I had my doubts in spite of all the rave reviews, but this was so delicious! I used a mix of oyster, shiitake and cremini for this one but (based on personal taste alone) I think in the future I will go with baby Bella and/or cremini. I also made an Alfredo sauce to go with it instead of the chive sauce, and I found that worked beautifully too. Pasta machines are a lifesaver for things like this...I find that rolling my dough out to #6 on my Atlas 150 machine is ideal for ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Sambey"
},
"reviewBody": "This was a little time consuming but worth the effort! Didn't really change a thing and it turned out perfectly. Will certainly be making many times more...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuAnn Padgett"
},
"reviewBody": "This was my first time making pasta of any kind, I had a pasta roller, which made it a lot easier. This ravioli is awesome!! I wasn't so sure about the butter chive sauce, but that was delicious! Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sam"
},
"reviewBody": "Perfect just as it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "H P"
},
"reviewBody": "This is really good as written. The dough turned out great and was easy to do. Easy but time consuming. I have two little ones so I often skip making the noodles and stuff the filling in cooked manicotti instead. It’s also delicious topped with the “amazing sun dried tomato cream sauce” from this website."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Automm Lombardo"
},
"reviewBody": "It took a long time, and a lot of patience, but the final product was super delicious! This was my first time trying to make homemade pasta. The filling was amazing, the cayenne pepper with the chives was the perfect zing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tryingsomethingnew"
},
"reviewBody": "Best ravioli ever! I'll be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angela"
},
"reviewBody": "It was worth the work. Everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oxypery"
},
"reviewBody": "I made them with the pasta dough I prepared the previous day. The dough I made had one stalk of cooked leek in it, so it was not plain pasta. I prepared the stuffing as the recipe is calling for. Then I made a sauce from the leftover stuffing with some half and half and pepper paste (spicy). So delicious! Definitely a keeper recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marysá"
},
"reviewBody": "Definitely worth the extra time making the ravioli. Mine weren't the prettiest but they were certainly delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mak36"
},
"reviewBody": "I just made this and it was extremely good. My husband wanted to eat the whole amount without sharing. We didn't let him. He said it was \"f..... awesome\". \n\nI just made a few very minor changes. First, I didn't use the pasta dough recipe - I went ahead and used my pasta machine and made the dough according to the machine's suggestions. For the filling I used dried parsley instead of fresh, since that's what I had on hand. I also used finely chopped green onions instead of chives. \n\nI scooped the filling with my small Pampered Chef scooper and placed on top of the pasta and then covered it with another piece of pasta after brushing with some egg white, and then cut out with my round cookie cutter. I then tamped the edges down with a fork - came out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Autumn Eckert"
},
"reviewBody": "Really good. I used a different pasta dough recipe but filling was really good. My husband wants them served with some kind of meat though. You must use the fresh chives!! not as good with out them. Also make a double batch if you want leftovers. When you do only use 3/4 c cream cheese. Its a bit over powering. And double garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Florence MacDonald"
},
"reviewBody": "This was a big hit and none of them exploded! This was my first ravioli experience and will not be my last."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cody Mitchell"
},
"reviewBody": "This is a very delicate and delicious recipe for raviloi, as they should be. To many times you go out and order ravioli and it comes drenched in red sauce. This recipe, on the other hand, really allows the filling to shine. I did make a few changes to the recipe though. I used my own pasta dough which is 1 egg per 2 people and enough 00 Italian flour to bring it to the correct consistency, this changes depening on temperature, humidity, and a thousand other variables, so add until it is no longer tacky. ( easiest in a blender or food processor ) I also used ricotta in place of the cream cheese to give a more authentic taste and texture. One last thing is I cut the cayenne in half like another reviewer said. great light pasta dish, easy but a little time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Millis Gardner"
},
"reviewBody": "I modified the recipe based on what I had in the garden. I added 1/4 cup of eggplant and substituted swiss chard for spinach. I also used egg roll wrappers for the pasta. The dish was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LuluGia"
},
"reviewBody": "Review for filling only... Lots of work but very good!!! We had a ravioli making party. Husband responsible for pasta, I made all the fillings.. Made the filling exactly as instructed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fred"
},
"reviewBody": "I made this without a pasta roller, and the dough was definitely very labor intensive. I made the recipe for 8 servings, but I had a hard time keeping the elastic dough at 1/16\", so it ended up being closer to 1/8\". This meant that I ran out of dough before I ran out of filling and was just able to make enough to feed three people. It was tasty though--cheesier than most ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "These were so good. They were super deformed and lumpy-looking but that's the sort of thing that I will be able to do better with more practice. Anyhow, after cooking them I just sauteed them in butter until they got a little crispy on the edges. Even my two year old devoured these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Totoro"
},
"reviewBody": "This was a huge hit! We only made the filling, had our own recipe for the fresh pasta and sauce, but the filling was incredible. The cayenne pepper gave it a little kick, which was delicious. \n\nWe used a ravioli maker, which made things easy and pretty fun. Definitely a new go-to for ravioli recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef"
},
"reviewBody": "Fun! Love making these delicious little packets of deliciousness. My family loved them. It takes a while but it is well worth the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FirefighterChef"
},
"reviewBody": "Best ravioli I have ever had!!!! And I have had a lot of good ravioli! I love food! So easy to make and even easier to eat!!! Gave a plate to a friend who doesn't really like to eat pasta very much and he thought they were awesome!! He put in an order for a batch the next time we make them. Next time I'll make 6 batches and freeze them for separate dinners!!! Great ravioli!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanda26"
},
"reviewBody": "This recipe is perfect. I've tried these ravioli with different sauces and nothing is as good as this sauce. It is pretty rich so I added a little Parmesan and cream to the sauce it's was pretty good. I love this recipe but it's time consuming. Someone told me I could buy ready made pasta to shorten the time. I had a hard time with my ravioli staying together. But it was my first time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOMOFADDY"
},
"reviewBody": "The filling is *fantastic*! 5-stars for the filling! But we really didn't care at all for the dough. I used a pasta machine so was able to get it thin, and a small ravioli mold making them about 1-1/2\" in size. The pasta was quite rubbery and seams were hard and chewy. None of us liked the texture or taste of the pasta. For our 2nd batch I used my MIL's noodle recipe (can be found on this site, Grandma's Butter Noodles) and they turned out perfectly. The filling and butter noodle recipe were delicious. I'll make many times, I'm sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "I loved this recipe! I used whole wheat flour for the pasta, but the filling was exact. I did change the sauce a little; butter, scallions, white wine, chicken stock and milk. It was definitely a labor of delicious love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lommen's"
},
"reviewBody": "Fantastic. We used the kitchen aid pasta roller and placed mounds of the filling on the pasta after a coat of egg wash then top with pasta squeezing air out then using a round like cookie cutter and placing each ravioli on a towel lined sheet pan until ready to boil. use choice of sauce. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannyn"
},
"reviewBody": "I made this Recipe all with out the real cheese. I used Vegan cream cheese, vegan Mozzarella cheese, and Vegan Parmesan. The only thing that wasn't vegan was the Egg's, I didn't think using egg substitute would work. My kids loved it, (teenagers) I made 24 servings and they were gone in two days. I plan on placing this recipe in my rotation. I used the left over filling in wontons, the filling is amazing and it worked well with both recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EatToLive"
},
"reviewBody": "I know this sounds crazy but I actually use this recipe just for the filling as a spinich dip- I omit the mushrooms. It is amazing and have broughten it to some potlucks all with rave reviews. Make it all as stated without the mushrooms then put in a baking dish and bake at 350 for 30-40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lady_V"
},
"reviewBody": "The dough ripped. NOT impressed at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "What'sCookin?"
},
"reviewBody": "I tweaked this recipe as a crepe filling for a post-wedding brunch. Wonderful! Simple additions of using mostly Baby Bellas along with the white mushrooms,a squeeze of fresh lemon juice and grating in some fresh nutmeg and rave reviews followed. I used a basic crepe recipe with fresh grated lemon zest added to the batter. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StarFyre"
},
"reviewBody": "very good. I had extra spinach mushroom mix left over so I just threw it over some pasta. MMMMMmmm. definitely will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Marie Gray"
},
"reviewBody": "I've made this twice now, without a pasta roller btw.. First time as written, and it was very good. 2nd round I used fontina cheese in place of the mazzerella and omg it was amazing. I made a meat sauce along side the butter chive sauce for my meat lover husband, but I loved the butter chive sauce. This is our anniversary dinner from now on. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dbarham"
},
"reviewBody": "The Ravioli tasted great. The only draw back is that this meal took over two hours to make. I added a few tablespoon of water to the dough, I will make it again with an Parmesan sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "I made this for the fourth time today. This time, I quadrupled the filling. That is how much we all love this ravioli. I am still experimenting with making ravioli from scratch, but everytime I make it, one of the fillings I use is this one. We like it with a red sauce, but last night we had it with a little melted butter and salt and pepper. We loved that too. If you like mushrooms, you will love this filling. I do suggest making the filling the day before. Otherwise, it will be a long day of making ravioli. This filling takes a bit longer than the cheese variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "clh1213"
},
"reviewBody": "Takes too long and doesn't taste very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Radcliffe"
},
"reviewBody": "I'm buying a pasta roller. this is an amazing recipe, thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jake and Travis' Mom"
},
"reviewBody": "The flavor of the filling was fantastic, I liked the little kick you get with the cayenne pepper. I am only giving it 4 stars because the dough was a pain to roll out (since I had to do it by hand) and I ended up quitting and getting won ton wrappers because I couldn't get the dough thin enough. I will make this again but not sure if I will attempt to make my own dough the next time around. I also used alfredo sauce instead of the chive butter sauce and it went well with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelbelle40"
},
"reviewBody": "My daughter and I made this for dinner tonight and it was amazing! The only change we made was for fresh spinach instead of frozen. We didn't roll the dough quite thin enough but lesson learned for next time (and there will definitely be a next time). I might try and make the dough a day ahead next time to break the steps up a bit and save time the night of."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShannnonLeigh"
},
"reviewBody": "This recipe makes some of the best ravioli! I only use less than 1/4 of a teaspoon cayenne pepper, otherwise the cayenne pepper overpowers the rest of the flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "A serving for \"6\" only made it to the three of us tonight. This ravioli is flavorful. It's a lot of work, so I probably won't add to my regular meals, but glad I tried it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Nagy Cramer"
},
"reviewBody": "Wonderful dough recipe, I have a pasta roller (hand crank) which made rolling the dough very easy. I adore mushrooms and the filling was so good! I halved the cayenne pepper for the kids and although I would have liked to make the sauce the kids wanted theirs with alfredo (also from allrecipes). I just finished dinner and am stuffed! Thank you larkspur for this wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DawnF"
},
"reviewBody": "Really delicious. This was worth the effort. My son, who isn't a big fan of cooked mushrooms, enjoyed these, too. I didn't make any changes to the recipe, but I cheated by using gyoza dumpling skins (next to the tofu in the grocery store) rather than making fresh pasta. Will definitely make these again. It made 3 adult dinner portions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Simeon Papailias"
},
"reviewBody": "I finish any Browned Butter recipe with grated Greek Myzithra cheese...absolutely to die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tracyleigh"
},
"reviewBody": "Very tasty! Hard to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meagan Prentice"
},
"reviewBody": "OMG! I tried thia recipe today and wow! I truely loved it, It is really good with some extra cheese shredded on top. Will defenitly make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tannerdog"
},
"reviewBody": "Amazing! Over the years I have been trying to find good recipes, this is by far one of the best. I added garlic and more chives to the butter sauce. I also add turkey to to ravioli, which was great, but by itself, the ravioli was still great. I also used some of my mom's red pasta sauce. Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "This is definitely something I'll make again. The filling was delish. It had a unique kick to it thanks to the cayenne pepper. I did not attempt the noodles since I don't have a pasta maker and it would be pretty difficult otherwise. I used eggroll/wonton wrappers. They tasted fine but were pretty thin so I'll either layer them or try the lasagna noodles next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura Ludlow Franklin"
},
"reviewBody": "The mushroom filling was wonderful, but I had a terrible time with the pasta. It took so long to roll out, I eventually gave up. I won't be making this again. You really need a pasta roller. Wish that could have been in the directions as it would have saved a lot of time and headache."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabitha"
},
"reviewBody": "I made these tonight and they turned out ugly. They were so ugly I quickly formulated a plan b just in case. I put dinner on the table and my boyfriend said ugh what is that? The kids looked at it like I got to eat this? Despite the looks they were absolutely delicious. So very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whatsalida"
},
"reviewBody": "These are amazing! I have never had raviolis this good, even in a restaurant, and my family loved them to! The most important thing to know about this recipe, however, is that it is time consuming. Even though I only made half a recipe, it took me, with a little help from my mom, a bit over 3 hours to make them. The filling actually was the quickest part - that only took about an hour - I followed the recipe exactly used fresh herbs from the garden and added in some Thai Basil which I think really completed the flavor. Making the dough itself was pretty quick, although I agree that kneading is absolutely necessary. However, when I rolled it out it I did not put enough flower on the cutting board, and the dough soaked up far more than I expected for being so dry, possibly because I had to roll it so thin. I had to peel each piece off with my nails and that's what took so long. By the time I got to the last pieces, they were dry and cracking. Unfortunately I didn't discover till the end though that a little bit of water on your fingers makes it go much quicker, and rubbing water on the tops will make the dough pliable again. To keep them from breaking I pressed the edges of both sides down with a fork - like you do with a pie. When it was time to cook them, I discovered that they really do take 4 min, even though they will float around 2.5 - I had to throw mine back in for 2 min. None broke. When it was all said and done though, it was well worth it - they were delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Life Tastes Good"
},
"reviewBody": "Made this exactly as stated in the recipe and it was delicious. It was labor intensive - I definitely see a pasta roller in my future! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucky Noodles"
},
"reviewBody": "I didn't change anything and it was really good! A little kick with the cayenne that I'll cut back on next time. I had filling leftover but could have rolled the dough thinner (or dig out my pasta roller attachment for the KA!). We'll have this again, I'd like to try it with an Alfredo sauce next. Stay tuned for an update soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vrushali"
},
"reviewBody": "First time ravioli making for me. The filling is delicious, I didn't measure the mushrooms or the spinach, just eyeballed it. And substituted the cream cheese with feta. I also use half wholemeal and half white flour and added a little extra moisture to balance it out. Lovely soft ravioli was the result. I made my own red sauce to go with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duckiellow"
},
"reviewBody": "LOVE IT!!! I omitted the cayenne pepper since I didn't have any on hand and it was still great. I also used a mix a regular and portabella mushrooms. We served it with a regular marinara sauce, but I think an alfredo would be great as well. Tastes similar to Benvenuto's wild mushroom ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Best ravioli we've ever eaten! We used a pasta machine to roll out dough and a large ravioli cutter. We boiled 4 large ravioli at a time and then put them in a sauté pan with the brown butter sauce to keep warm while we cooked remaining ravioli. Grated fresh pecorino Romano and served the pan at the table. Delicious! We actually made the dough the day before and probably could have also made the filling then. Just bring it to room temperature before filling ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Webigail"
},
"reviewBody": "Great Recipe!!!!!! The Pasta dough is very easy to make and i am first timer to pasta dough, however if you are rolling it out by hand i would recommend a pasta roller, i am a little sore from it, but well worth the effort if you have the time. Also it is totally possible to roll it to 1/16in and thinner. you just need space, patience and flour. :-) The filling is amazing. I used fresh spinach that i cooked with the mushrooms and onions and ended up blending it all in my blender and if you don't have time to wait for the cream cheese to softened, then it really helps, or a food processor. My only issue was with cutting the dough with a cookie cutter, i did not like that and ended up eyeballing it with a pizza cutter. I think i might get a pastry bag when i do this again to fill it faster. Took me a little over three hours to make this and there was enough for 6 with a few leftover. Oh as i was pressed for time at the end i did dumped some spaghetti sauce over it and ran out the door and it was still really great. I didn't use any extra salt or pepper as i forgot that step and the filling was great without the added salt, but i would have preferred a little red pepper if i remembered. As someone else stated, this is a very forgiving recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenhuss"
},
"reviewBody": "Delicious! Followed recipe exactly until the chive butter sauce. I used marinara sauce instead. The flavor of the filling was excellent. Definately worth the time involved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MattOlay V-H"
},
"reviewBody": "Pretty darn good! It taste kinda like the fillings you stuff in the mushrooms with. Even though I used a pasta machine &amp; stamps, it is still time-consuming but I had fun with it. I like the simple sauce as well and my husband prefer his ravioli's slightly golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lraep17"
},
"reviewBody": "This review is for the pasta, though I made a different filling. I used whole wheat flour, because that's what I had on hand. I don't have a pasta roller, and it was difficult to roll the pasta out thinly enough. That said, it cooked well, stayed together and tasted great. We were making food for 5. I doubled the recipe and we had exactly enough (made 5-6 ravioli/ person)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CYARHIA"
},
"reviewBody": "Delicious! We are not vegetarians, so we added some ground beef &amp; sausage...they turned out FANTASTIC! I can't wait to make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Joyce"
},
"reviewBody": "This recipe was delicious! I changed a few things based on what was available to me. I swapped the mozarella for asiago and ate it dry (no chive butter). It was so flavorful I didn't need anything on it. I ended up needing 3 batches of the dough for one batch of filling though, so I was rolling dough all day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkristenus"
},
"reviewBody": "I made these tonight and although I did not use your sauce recipe (didn't think my kids would like it) , these turned out fantastic. My 3, 4, and 5 year old kids did not want to try these at first and after some coaxing, gave two thumbs up. They raved about what a great cook I was. I used the alfredo sauce from this same website but, I will probably use the chive butter sauce next time. Thank you and I will be making these as a side dish for Thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gina"
},
"reviewBody": "WOW!! SO AMAZING! You have got to try this! The butter and chive sauce is simple but SO good! I had to add a little more water to my dough as well. I've made this twice. Once I didn't have cayenne so I used red pepper-still amazing. I also added 1/2 c ricotta cheese once and that was really good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annabelle"
},
"reviewBody": "Absolutely delicious. Dough is perfect. I didn't have all the ingredients for the exact filling so I used 1 package of spinach, no mushrooms, comté instead of parmesan. I served it with a sauce with fresh tomatoes and basil from my garden with some cream. I can't wait to make it again! It takes a little bit of time but it is as fun to make as to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzy261"
},
"reviewBody": "My family loved this recipe. It was time consuming, but when something turns out this wonderful, I don't mind. I think the chive butter is the perfect sauce. Anything else would overpower the flavors of the ravioli.\nAs I have a large family, I doubled the recipe, and ended up with extra filling. We warmed it in a small crock, and used it as a dip with rye chips. It was delicious as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Good EatNZ"
},
"reviewBody": "This is terrific! It is important t get the pasta very thin, and even, but done the way the author instructs, is no fail! The brown butter compliments this superbly -- I would not be tempted to make the sauce any 'fancier' or different -- it is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Passion4food"
},
"reviewBody": "AMAZING recipe. Thanks so much larkspur! This is the first time I made homemade pasta, so I was very proud of myself;) Got a good work out rolling out the dough though haha. I didn't have spinach or chives for the filling but this tasted good regardless. I love the touch of heat from the Cayenne pepper. I ate this with red sauce since I didn't have the chives to make the sauce stated in the recipe. The only thing I did wrong was under cook the ravioli - it started \"floating\" pretty much straight away so I took it out after 2-3 minutes. I should've left them in for another few minutes. I also tried the egg yolk in the middle thing that you see on tv &amp; it worked! yay, nice runny yolk that didn't over cook:D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joe bob 101"
},
"reviewBody": "Delicious! Takes a while to make it all, but well worth it. Had some filling left over so the next day, cooked some macaroni, stirred the filling into the hot macaroni, put some parmesan cheese on top. It was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimz11"
},
"reviewBody": "The ravioli was time consuming to make but well worth it. These were delicious. The only change I made to the recipe was to add some garlic to the butter chive sauce. I'll be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pumpkin"
},
"reviewBody": "A time consuming recipe but totally worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSSPARKLE"
},
"reviewBody": "This is by far the best recipe Ive ever found. Ive never made anything that has tasted so great. It makes a huge mess to make but totally worth it. However, I did change the sauce. I made a Marsala Wine Cream sauce rather than the chive butter sauce. Just awesome. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ellie"
},
"reviewBody": "This just didn't meet my expectations. This could have been better if I had pasta roller to make the dough thinner. I might try it again, using similiar ingredients, but it def. not in my top 10 fav. list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Ercolini"
},
"reviewBody": "The pasta dough came out perfect!! It was super easy and I was hesitant to try this recipe for thanksgiving, but it was a huge hit. The only thing, and I think it says this in the directions already, I did have to add couple tbls of water while kneeding the dough. Definitely kneed dough by hand. I usued 1 1/2c white flour and 1/2 c whole wheat flour. The stuffing was also wonderful. I made a white wine, butter, chive, and panchetta sauce. Thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EACline"
},
"reviewBody": "This ravioli was delicious, but rolling out the dough was totally not worth it. I give it 4 stars for flavor, though! We did use spaghetti sauce instead of the chive butter sauce but that is just personal preference. (Not big butter fans)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Midwife Miriam"
},
"reviewBody": "Oh yeah, delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Absolutely love it! I skipped the mushrooms (hubby won't eat them) and I added chardonnay and lemon juice to the sauce. Came out perfect. I'm making more this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely love it! I skipped the mushrooms (hubby won't eat them) and I added chardonnay and lemon juice to the sauce. Came out perfect. I'm making more this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Shaver"
},
"reviewBody": "Easy to follow. When using regular flour make sure you knead it enough (I did 40 min to be on the safe side). Let it sit for at least 30 min (mine sat 90 min.) Also make sure to roll it super-thin. Also took the suggestion to add spinach (wilted in water). Didn't have regular cheese so added a bit extra parm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "panini goddess"
},
"reviewBody": "This deserves way more than 5 stars! I made this with my dad and it was fairly easy too. The only problem we had was that the pasta dough kept falling apart, but we refrigerated it for about 1/2 an hour and it was perfect. I made a white sauce instead of a butter sauce with my left over parsley and chives, and it was delicious! Even my sister who hates mushrooms loved it! Great recipe, keep up the good work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances"
},
"reviewBody": "Thank you Larkspur for sharing this! I have received many compliments when serving this dish. I don't always serve it with the Chive Butter Sauce, trying to spare my waistline the extra calories occasionally, but no worries the Mushroom and Spinach Ravioli are win, win with lightly saute'd fresh garden veggies and other light sauces too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I wanted to follow the recipe exactly but had to adjust the filling with what I had on hand: frozen wild mushrooms, leek, red &amp; green bell peppers, feta, mozzarella, garlic and parsley. The pasta was perfect. However, I need practice making the raviolis because I couldn´t get as much filling inside without them exploding. The ones that stayed whole after boiling, I tossed them with red sauce and topped with freshly shredded Parmesan. I just love these forgiving recipes. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sopenia"
},
"reviewBody": "I wanted to follow the recipe exactly but had to adjust the filling with what I had on hand: frozen wild mushrooms, leek, red &amp; green bell peppers, feta, mozzarella, garlic and parsley. The pasta was perfect. However, I need practice making the raviolis because I couldn´t get as much filling inside without them exploding. The ones that stayed whole after boiling, I tossed them with red sauce and topped with freshly shredded Parmesan. I just love these forgiving recipes. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kariannz"
},
"reviewBody": "Very yummy! I was already pressed for time not having a ravioli maker and I really didn't feel like making homemade dough so I bought lasagna noodles (the dough kind in the refrigerated section) cut them into squares and stuffed them and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SergeV"
},
"reviewBody": "Excellent recipe! Incredible flavor! My wife and I still talk about how good the raviolis were. With a pasta roller and a ravioli mold, it didn't even take that long. The only thing I added was I blended some spinach to the egg before adding to the flour, which gave the ravioli's a really nice gren color. Next time (and there will definitely be a next time), I think I'll cut back on the cayenne pepper, so I can enjoy the flavor of the filling more. Anyway, kudos on a great recipe!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214718/mushroom-and-spinach-ravioli-with-chive-butter-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
"name": "Pasta by Shape Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16855/pasta-and-noodles/pasta-by-shape/ravioli/",
"name": "Ravioli Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214718/mushroom-and-spinach-ravioli-with-chive-butter-sauce/",
"name": "Mushroom and Spinach Ravioli with Chive Butter Sauce"
}
}
]
}
}
, "about": [
]
}
]