				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "My Own Famous Stuffed Grape Leaves"
,"datePublished": "2000-06-09T17:08:19.000-04:00"
,"dateModified": "2022-10-31T15:43:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Patti Moschonas"
,"url": "https://www.allrecipes.com/cook/24327311"
}
]
,"description": "Grape leaves stuffed with a mixture of rice, fresh herbs, and lemon juice make a delicious appetizer, or serve them with a Greek salad as the main course."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8HhB6jafjtZ0vNYM9dsaeHr029E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4521063-06168f1dc24d4e1ea2753d515bc97e2d.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "My Own Famous Stuffed Grape Leaves"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "129"
}
,"cookTime": "PT75M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "303 kcal"
,"carbohydrateContent": "31 g"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "573 mg"
,"sugarContent": "1 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"1 tablespoon olive oil",
"2 cups uncooked long-grain white rice",
"1 large onion, chopped",
"0.5 cup chopped fresh dill",
"0.5 cup chopped fresh mint leaves",
"2 quarts chicken broth, divided",
"0.75 cup fresh lemon juice, divided",
"60 fresh grape leaves",
"1 cup olive oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat olive oil in a large saucepan over medium-high heat. Add rice, onion, dill, and mint; sauté until onion is soft, about 5 minutes. Pour in 1/2 of the broth, reduce the heat to low, and simmer until rice is almost cooked through, 10 to 15 minutes. Stir in 1/2 of the lemon juice and remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Plunge grape leaves into a deep container of very hot water until soft, about 10 seconds; pat dry."
} ,{
"@type": "HowToStep"
,"text": "Place a grape leaf onto a work surface with the shiny side facing down. Place 1 teaspoon rice mixture on leaf at the stem end; fold both sides in toward the center and roll up from the wide bottom to the top. Place stuffed leaf into a 4-quart pot. Repeat to stuff remaining leaves, packing them into the pot tightly so they don&#39;t open while cooking."
} ,{
"@type": "HowToStep"
,"text": "Drizzle olive oil and remaining lemon juice over leaves, then pour in remaining broth to cover. Cover the pot and simmer for about 1 hour; do not let it boil as the stuffing may burst out of the leaves."
} ,{
"@type": "HowToStep"
,"text": "Remove from the heat, uncover, and let cool for 30 minutes. Transfer to a serving dish and serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jamie Lynn Kitchen"
},
"reviewBody": "It's soup!!! Too much liquid. I followed to the T and the filling was so loose they were impossible to roll. But I did my best n finished the recipe as directed adding even more liquid to the already soupy mixture. The picture it what it looks like as it's now simmering. It tasted good so far so I'm hoping we can at least eat it. Very disappointed DO NOT RECOMMEND."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michele Gumm"
},
"reviewBody": "This is the furthest thing from an authentic grape leave recipe. What garbage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elliemriley"
},
"reviewBody": "I found this recipe on here about 10 years ago. This has been my go-to recipe for dolmas ever since then. Just need to remember to add a tiny bit of salt if you are using low sodium chicken broth. And you should probably cook them a little less because the grape leaves tear easily if cooked too long. Flavor is absolutely perfect! I have had so many compliments about these over the years. My hat is off to the poster of this recipe! Opa!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msmarple1260"
},
"reviewBody": "This was the first time that I have made stuffed grape leaves. Although it was time consuming, I think they are really good. They are still cooking in the broth so I am not sure what I am to do afterwards. There were no clear instructions for that. I am assuming that I drain the broth and leave the grape leaves in tack. Hopefully, they will be okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Miller"
},
"reviewBody": "I have made these many times. Each time I enjoy them more. They are better than any I have had in a restaurant. I love the fact"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "garfield"
},
"reviewBody": "Came out amazing. I added toasted pine nuts and it gave it a great nutty flavour. My 9-year old devoured them up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helga Nina Aas"
},
"reviewBody": "WOW! This was great. It great day after also as my lunch. It has a cooling effect on your inside because of the mint, I suppose. I look forward to make this again. The only thing I would do different is make the rice less cooked in the first stage. I did head the warning but I would be even more cautious next time. Though this did in no way effect my enjoyment of the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Boyce"
},
"reviewBody": "This is an excellent recipe which I will make over and over again. It's uncomplicated and the grape leaves I bought made the job of rolling them up much easier than I've experienced before. We ate them warm, and they were even better cold!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimMills"
},
"reviewBody": "Instead of rolling the rice mixture in the leaves I chopped up the leaves and cooked them with the rice mixture. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieB"
},
"reviewBody": "Wow.. so good! I'm wondering why I don't make my rice like this all the time. I kept sneaking bites in between rolling. Thank you, Pati.... I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gailie"
},
"reviewBody": "I made a half recipe, used a tablespoon of filling for each grape leaf. The taste of the rice mixture was just right, but the grape leaves (Krinos)) we’re very tough, after an hour of simmering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Haas"
},
"reviewBody": "I made this but used vegetable broth to keep it vegetarian. I also made 1/2 the receipe, which made more than I could eat in a week! I used jarred leaves no problems! Would make again when I have someone to share it with!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick B"
},
"reviewBody": "Fantastic recipe! I substituted dried mint and dill (use 1/3 of the amount). I also threw in a few cloves of fresh minced garlic. I've been making these for years, wife said it was the best I've made so far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy5000"
},
"reviewBody": "Fabulous flavor! I have tried many different stuffed grape leaves but this one is the best!. I used vegetable broth instead of chicken but otherwise no change. Do use fresh mint and dill - a necessity. This makes a large amount. I needed 2 jars of grape leaves (to get 60 leaves). Might try half recipe next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cheyenne Schön"
},
"reviewBody": "I would say this is a VERY average recipe for dolmas. These do not have the traditional wonderful tanginess of real dolmas and though mint and dill work well in these, they are missing some sort of spice like Allspice to make them zingy. Maybe I did something wrong, but these were very lackluster the way I made them (I subbed veggie broth instead of chicken, and halved everything, other than that followed exactly)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lupini"
},
"reviewBody": "We like ours with meat and rice....so I only use 1 cup of rice and follow all directions. Then brown ground meat and add to the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Cannon"
},
"reviewBody": "This may draw a little bit of chef – hate, but being a naturally lazy but inventive person I have found an easier way to get the full satisfaction from this kind of recipe. I can't stand the handwork of rolling these little rice and leaf sausages (Veg in our case), so what I have done is get the grape leaves and sliver them with my chefs knife and simmer them in chicken broth. When they reach desired consistency I simply stir them in with the rice mix already prepared and press those into rolls with my Japanese sushi presser. You get all the satisfaction of this fine recipe with less than half the work and time. They are also easier to chew, and lose nothing of the regular flavor. Of course there is some satisfaction into biting into that little leafy tube but trading off a half hour or so of handwork is more than worth it to us. Men out there, please note that with this kind of cooking for a vegetarian wife you can be WELL rewarded. My wife now craves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeremy Alexander"
},
"reviewBody": "First off, it's very bold calling this recipe \"your own\" when it is literally the basic Greek dolmathes that have been around for centuries without any twist at all. Second, this is by far the most bland dolmathes recipe around. No seasonings, no garlic, no crunch from something like pine nuts. It's like you made the recipe your own by taking out half of the ingredients and most of the flavor. Sorry to be harsh, but I don't want people to make these and think this is what dolmathes taste like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "elisabeth will"
},
"reviewBody": "As a German, I admire this taste a lot. Stuffed grape leaves, namely dolma, is a traditional Turkish food. This is absolutely great. To be honest, all Turkish foods are great and this is only one of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Onita"
},
"reviewBody": "This recipe was just the one I was looking for. For the past two days I have been watching on YouTube and reading recipes for stuffed grape leaves that were Greek, Lebanese, Middle Eastern, etc. using everything from lamb, pine nuts, tomatoes, tomato paste, and everything in between. The rice was either short grain, long grain, to the type used in making risotto. What I did glean was that the bottom of the pot used to cook the stuffed grape leaves needs to be covered with something like slices of potatoes, tomatoes, or even left over grape leaves so the ones cooking on top of them would not get burn. Most importantly, after stacking them in the cooking pan, put something heavy on them (i.e., two or three plates that are heat resistant and slightly smaller than the pot). This way they will stay put and not rise. The potatoes and tomatoes can be used as garnishes and eaten with them because they are now imbued with all the cooking goodness. I just can not wait to try this recipe with rice, onions, fresh herbs, olive oil, and lemon juice. One recipe I saw even added lemon zest to the mixture. My mouth is watering just thinking about it. I plan to eat with a Greek salad, romaine lettuce, Greek yogurt, hummus or the traditional cucumber sauce ( starts with a tz...) Thank you a thousand times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Miller"
},
"reviewBody": "I've made these numerous times and they are just fantastic. The taste of the fresh mint and dill really make this recipe a must have. Just finished a batch and I can't wait to taste them. My co-workers love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsy"
},
"reviewBody": "Amazing!! You have to make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee M. Longo"
},
"reviewBody": "I love stuffed grape leaves! This recipe is wonderful. I softened the fresh leaves in the left over chicken broth by bringing it to a boil, putting the leaves in and shutting the flame off till I was ready to fill them. I put several larger leaves on the bottom of my LeCruset pan and several more on the top of the second layer. I simmered them about an hour and only cooked the Carolina rice for 10 minutes. I let it all cool before filling so that made the mixture sticky enough to fill and not mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Golembeski"
},
"reviewBody": "Perfect as is, though I do prefer vegetable broth. One tip to share: Wash, dry and FREEZE the leaves. Freezing tenderizes (by wilting) them - as tender as the canned leaves. You just have to leave them in freezer long enough for them to be completely frozen - it all depends on how large a stack you put it. Defrost completely, separate carefully, and roll 'em up. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richey"
},
"reviewBody": "Perfect. Sometimes I put ground lamb in. I make them for our Feast of the Epiphany at my son's school. They are divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl Paolucci"
},
"reviewBody": "Work out well. Used dried dill added extra onion some garlic, dried basil, and black pepper very yummy.\nUsed extra stuffing in trader joes s sweet n spicy red cherry peppers with assiago cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shifter"
},
"reviewBody": "These are wonderful! The rice stuffing smelled amazing!!! What a great recipe. This was my first time making stuffed grape leaves and it was a fun and delicious experience following this recipe! I added a little olive oil when sautéing my onions and herbs, and forgot to add it at the end, but they still turned out! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daphne Procz-Shorts"
},
"reviewBody": "I gave this recipe four stars for the flavor alone, because it balanced and savory. The mint is just perfect. I would have given five stars, but I have made this recipe a couple of times and had similar issues every time. One is that one cup of olive oil is gratuitous to a fault. I got by with two-thirds of a cup easily, and the flavor did not suffer. The second is that in order for these to reach the correct filling texture, and for the leaves to soften, these rolls must sit at least a day. The first day and for most of the second day, the filling is mushy and the leaves are chewey. Once they sit, however, they mellow, and they are indeed very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cwinter"
},
"reviewBody": "\\We love grape leaves but these were horrid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Schaible"
},
"reviewBody": "Thank you these were awesome. This was my first time making these. I wouldn't change nothing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Montenegro"
},
"reviewBody": "I really enjoyed this recipe. It was very time consuming since it was my first time making it. I prefer to use fresh herbs such as mint, dill, and onions. Sautéing the dill, onion, and mint in olive oil released plenty of aroma and flavor. Dry herbs doesn't bring that out as much. Mixing dry rice with the ingredients spread evenly in the pot. I didn't have chicken broth, so I added 2 cubes of chicken bouillon into the rice after adding water. It smelled amazing while the ingredients were cooking. By the way, I used 1.5 cups of brown rice and two cups of water. I followed the instructions for the grape leaves by draining the majority of the grape leaves and rinsing it thoroughly then putting them in room temperature water for 10 minutes. After my rice was almost cooked, I added some lemon juice, then I let the rice cook completely. Wrapping the rice in grape leaves was a little challenging, though after a few tries, I finally got it. Finally, placing the stuffed leaves into a large pot, added lemon juice and olive oil and simmered with chicken broth. Since I noted earlier that I didn't have chicken broth, I boiled some water added 1 cube of chicken bouillon, poured the chicken broth over the stuffed grape leaves, but I only poured enough to cover the bottom of the pot allowing condensation do the job of cooking. This really prevented the rice from expanding out of the leaves. I let the stuffed grapes leaves cooled down, drizzled some olive oil and sprinkle some more lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hyerground"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spicy mom"
},
"reviewBody": "This is the most authentic recipe I have ever tried. It actually tastes like I am back in Thessaloniki."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ptulip"
},
"reviewBody": "These were a good base for someone trying for the first time.\nMy second try I made modifications used 1/2 pound ground lamb sauteed with (1) medium, 1 small clove garlic cook until meat starts to brown. add 1-1/2 uncooked rice with 2 cups water. cook on low until rice is not quite done and water is evaporated. cool slightly add your lemon, mint then stuff your leaves. I placed them in my electric pressure cooker with (2) cups water and pressure cooked 5 minutes. let pressure release naturally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. Good"
},
"reviewBody": "This was the first time I have ever made grape leaves and they turned out great. This recipe yields a lot of them, so be sure to invite friends over, or plan on some yummy leftovers. I didn't know how to roll them, so I found a video somewhere else online. It wasn't too hard to get the hang of it. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "These are amazing! I've never tried such good grape leaves, not even in restaurants. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "myhubbyisyummy"
},
"reviewBody": "I don't know what I did wrong but sorry. I followed the recipe exactly, but am wondering if it was the grape leaves that ruined it? The ones I used were from a jar and in a brine, so it left a horrible taste on them. I've never had stuffed grape leaves before, so I don't have anything to compare them too, but since I followed the recipe it couldn't have been too far off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JennyBee"
},
"reviewBody": "I made these tonight. I enjoyed them but family thought they were a little too lemony. I only used 1 quart of broth, and dried dill. Next time, it\nI will cut back on lemon juice by about 1/3 cup. Lookin forward to eating them cod tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "syrigerleb"
},
"reviewBody": "Used this recipe to get started and I added ground lamb sauteed with onions, garlic, sweet pepper, pine nuts, splash of red wine, cinnamon, little cayenne to slightly undercooked brown rice and used jarred leaves. Use a glass plate or smaller pot lid to fit inside pot to hold down the dolmas while simmering. Like my Syrian grandma used to make :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "COURTNEY77700"
},
"reviewBody": "I made these exactly as the recipe called. I loved the rice however my leaves were too tough. I used leaves from a jar (not fresh). Also, 1 3/4 hours is not accurate as this is just cooking time not cooling the rice or wrapping the leaves. Plan for 2-2.5 hours. I will try these again however I will boil the leaves prior to wrapping per other recipes instructions. I resisted the urge to Americanize the rice and I am glad as it could easily stand alone as a side dish. I rated it as a 2 because the leaves made it impossible to eat so I waste my time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "swifty&#39;s wifey"
},
"reviewBody": "Took a lot more time than expected!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindseysue"
},
"reviewBody": "My husband and I used to go to a Greek restaurant just for these, but since I tried this recipe we haven't gone since! I added a few chopped sprigs of cilantro in addition to the dill and mint. It worked well with all the other flavors. My husband asks me to make these at least once a week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sohlbie"
},
"reviewBody": "These were amazing! Very similar to the ones served at the salad bar in Whole Foods. I halved the recipe and made about 25. I also made them in a hurry by cooking the rice mixture first in the pressure cooker for 5 minutes, then cooking the stuffed leaves in the pressure cooker for 10 minutes. I went light on the olive oil, about 1/4 cup total for a half recipe and subbed in veggie broth for the chicken. They were perfect topped with a little crumbled feta and a side of tzatziki sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ACherryinFL"
},
"reviewBody": "I loved the rice mixture. I almost preferred eating it alone rather than taking the extra steps to stuff the leaves. I had a lot of leaves that came open and had lots of extra rice because many of my leaves were torn. I don't think I would make these again, I will just buy some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maiseheartsfashion"
},
"reviewBody": "My mother made these this past sunday(easter!).I have a mixed review, b/c 1 or 2 ppl LOVED THEM but everyone else agreed the chicken flavor (from broth) was too strong.We would use veggie next time, but like I said, my Aunt thought they were better than the restaurants while my own mom could barely stand 'em.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gigerbopper"
},
"reviewBody": "I've been meaning to try to make dolma for years but I guess it was kind of intimidating! Turns out it's pretty simple - just time-consuming. I couldn't get my hands on fresh mint so I took a different route with garlic, cumin and allspice. These little guys are addictive and fun to show off!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I was craving dolmas. These weren't quite what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef GourMAY"
},
"reviewBody": "I really enjoyed this recipe and the grape leaves came out very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "roxythegoddess"
},
"reviewBody": "This is a great recipe and I love dolmads, they r delish! However it did take me a very long time to roll them all...considering how awesome they r in restaurants n how widely available they r for purchase, for me living in Vancouver, it is more economical and time saving to buy them already made. But we gobbled them all down really fast! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TDKRAHN"
},
"reviewBody": "A lot of work to roll although the rice stuffing was easy to make. It has quite a strong taste. I know other recipes I looked at mentioned rinsing the leaves in water first to get rid of some of the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kjn24k"
},
"reviewBody": "I loved this recipe. Now I can have grape leaves whenever I want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Good recipe!! I added some garlic to the stuffing along with the dill, and mint leaves. I also add some fresh tomato puree. My mom used to make grape leaves for us when we were kids, this recipe is similar, but with a few minor changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steffanie Stamos"
},
"reviewBody": "Very tasty! Didn't change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carly Urbanski Johnson"
},
"reviewBody": "Wow. These were very time-consuming to make, and they didn't even taste good. The smell when cooking these was awesome, though! \nThe #1 part of the instructions was basically to make soup. Way too much liquid.\nI can't say I've got any inclination to try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "addielleyes"
},
"reviewBody": "Excellent. These are the ones you're looking for. If you don't like them, then you just don't like stuffed grape leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "darthotto"
},
"reviewBody": "Im not sure about this one. Didnt taste like the greek place we love but these were still ok. I used brown rice since that is all we buy, so maybe that makes the difference. This made tons of filling. I bought one jar of leaves($4.99) and made these pretty big. I still had too much filling. Im not sure these were worth the money i spent in leaves. I will have to learn how to can my own grape leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crimsonclovers"
},
"reviewBody": "tasty but allot of effort. The grape leaves are no easy to find at the store, and the folding seems like it would take more practice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "Absolutely delicious! Just like my mom's - except I added some chopped carrots in the saute mixture to add some color and used plain water instead of chicken broth to make these delectable dolmas exactly like my mom's. One important thing I learned from my mom was that if you are using prepackaged grape leaves, they may be REALLY salty so you need to drain and rinse them really well, or soak them in warm water, to get rid of most of the salt, otherwise all you'll taste is the salt. And trust me, it would be a shame to ruin a recipe this good and your entire experience with stuffed grape leaves. Patti, thank you for sharing it. This is a huge keeper for me :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lady_turqoise"
},
"reviewBody": "Absolutely delicious! Just like my mom's - except I added some chopped carrots in the saute mixture to add some color and used plain water instead of chicken broth to make these delectable dolmas exactly like my mom's. One important thing I learned from my mom was that if you are using prepackaged grape leaves, they may be REALLY salty so you need to drain and rinse them really well, or soak them in warm water, to get rid of most of the salt, otherwise all you'll taste is the salt. And trust me, it would be a shame to ruin a recipe this good and your entire experience with stuffed grape leaves. Patti, thank you for sharing it. This is a huge keeper for me :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mirna"
},
"reviewBody": "egyptian"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LemonLush"
},
"reviewBody": "I'm not sure what makes these famous, but at my dinner party the fame didn't last long. These were flavorless and not authentic according to my Greek guests. They were missing a greek lemon sauce, which I knew, but figured without meat, it might work. It didn't. They definitely lack a protein though and really need something like pine nuts or ground meat.. lamb, beef or a combo of both. Some guests thought they were OK, some left them on their plates. I've made lots of good Dolmathes in the past.. should have stuck with what works, but was looking for something lighter as a starter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nickyschumack"
},
"reviewBody": "Excellent recipe. Very simple to make. My friend at a local middle-eastern bakery suggested that I cook the grape leaves with some sort of heavy object on top of them, to keep them from unwrapping, so I placed a porcelain plate on top, and it worked great! I also added a pinch of uncooked red lentils to each grape leaf that I wrapped, and that tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bethany"
},
"reviewBody": "I saw a few reviews that mentioned using multiple grape leaves, instead of just one- bad idea! My advice is to roll them as tight as possible but only use a single leaf. If you have them tight in the pot, one or two holes/ breaks won't make a difference. Also they are better the longer they sit - make them at least a day ahead of serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkathleenm"
},
"reviewBody": "Shocked I could make these and they taste just like the restaurants! I didn't make any adjustments to the recipe, just used much less olive oil. Maybe a 1/4 c. A little time consuming, but very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kgw217"
},
"reviewBody": "these were really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mariamou"
},
"reviewBody": "I am Greek and loved this vegetarian version. Being from Crete, we always use tomato sauce in our Dolmas so I added about 1/2 sm can. I also use Oralando brand grape leaves from a jar. The Kronos brand is way too tough and never use them. I usually simmer mine in a pot with a plate sitting on top of the dolmas to keep them down. Dolmathes are best the next day after they've had a chance to blend flavors. Don't forget to smother some avgolemono sauce on top and a hunk of bread. These are the best! Thanks, Patti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reets"
},
"reviewBody": "If using fresh grape leaves, you will need to select the young leaves (they take less time to cook and are already tender). Be sure to cut off any really tough stems. Otherwise, a jarred version is okay...but these leaves tend to be tougher than fresh ones. Also, try lining the bottom of the pan with slices of fresh or canned tomatoes; this will help reduce the sticking. A fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Good EatNZ"
},
"reviewBody": "This is an excellent recipe. For starters, the rice is awesome on its own! When I made the stuffed grape leaves I added a handful of toasted pine nuts, and that gave it a bit of extra lift."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JBBALUKONIS"
},
"reviewBody": "we used brown rice, a homemade mushroom broth, and dill seed instead bc that is what i had in the house. i didn't measure anything bc i was in a rush and it turned out fantastic. i can imagine that doing it \"right\" would be even better. yum yum yum and thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Duggan"
},
"reviewBody": "This is the secret to dolmades! Whisk the juice of 1-1/2 lemon and 2 egg yolks until combined. While whisking quickly, slowly add 1 cup liquid from dolmades to the lemon-egg yolk mixture. Whisk egg whites until frothy.Add frothed egg whites and combine. Pour mixture over warm dolmades and serve. This will make your dolmades perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Caruso"
},
"reviewBody": "This recipe is fantastic! I added a bit more lemon because I love lemon in everything, but other than that I didn't change a thing. Best recipe around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marljong"
},
"reviewBody": "Splendid and delightful! I added lemon zest, parsley, salt and pepper. Cooked for 3o mins. So lovely! Thanks Patti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WSBLEND"
},
"reviewBody": "I made this almost exactly as directed except that I halved it....and I further reduced the amount of olive oil for the simmering step to 1/4 cup. (Olive oil has 100-150 calories PER TABLESPOON!!!) Anyway...my rice was pretty much done in the first step b/c I had to run an errand in the middle of cooking...still not all of the liquid was absorbed. It was really hard to get the grape leaves out of the jar, I did rinse them as they were incredibly salty. Mine all stayed rolled up with no problem as I packed them in a single layer in a fairly shallow pan. I didn't use quite enough broth in the final simmer step so the tops of the leaves got a tad dried out. Update: I've made this several times now...I like to add 1/2 lb of browned ground lamb to rice after cooking the rice (this is still using half a recipe though). The wrapping goes better if I try to not cram so much inside! These are yummy even when they're cold! Wish I had a recipe for that lemony sauce that is sometimes served with these. When simmering them, I put a plate on top to help weigh things down. Yum-mo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "I brought this to Greek Easter and they were the first thing to go. I even doubled the recipe! Every one loved them. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cherbear"
},
"reviewBody": "This was the first time I ever tried to make grape leaves and they turned out great. I used ground turkey instead of beef to make it a little healthier. I loved the combination of flavors. I made them for my family and they all loved them. The only tricky part is keeping them from falling apart or opening when they are cooking. i would recommend this recipe to anyone. I think its better than a lot off grape leaves I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules1369"
},
"reviewBody": "I was terrified to try this, but they turned out wonderful!!! My husband is super-picky about foods like this (food-snob anyone?!), and he praised me up and down. My 11 yr old even had fun helping me roll the stuffing into the leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Hanes"
},
"reviewBody": "Made these for my Vegan cousin with vegetable broth of course and she LOVED them! Great recipe! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ipeksen"
},
"reviewBody": "Very good recipe, except if you want more authentic flavor, you can add 2 tblsp. of pine nuts while sauteing the rice and onion, and also add add a teaspoon or more to taste of each of ground allspice and cinnamon with the chicken broth. We also add dried golden raisins-about a third of a cup-when we add the liquid and put the fresh herbs for last as they don't need to cook down with the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjj123"
},
"reviewBody": "I MADE STUFED GRAPE LEAVES WITHOUT DILL OR MINT , WHEN I COOK IT I PUT HEAVY PLATE ON TOP TO PREVENT STUFFED LEAVES FROM OPENING , AND I PUT GARLIC PIECES IN BETWEEN LEAVES (ABOUT 2 CLOVES),"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniel den Hoed"
},
"reviewBody": "I used the recipe to make these grape leaves for the first time. I used brown rice instead of white rice. I would just recommend to make sure to undercook your rice since the boiling makes it extra soft as it did mine. I also struggled with rolling them correctly from the directions and did not fully succeed. Even though I used a plate to hold them down when I picked them up at the end several opened up. However, the herbs and spices made them taste great and we ate them all up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I followed this recipe very closely and the stuffed grape leaves weren't exactly like the ones from the greek restaurant, but they were pretty good. I'm going to try some other recipes, but I'll come back to this one if I can't find better. I might use water instead of chicken broth - it left a slight 'chicken and rice' kind of flavor in an otherwise exotic dish. Overall, though, easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leila m"
},
"reviewBody": "YUMMY!! About 5 yrs ago i tasted grape leaves for the 1st time at a very expensive place, last yr. i tried making them from an international cookbook, but it didn't call for the broth, these were awesome, and with grape leaves growing out the wa-zoo in my backyard i am thinking of canning the leaves so i can make this more often, the only thing i would do differently would be to let the fresh leaves soak longer, and cover them with a plate for cooking... excellent 5 stars!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EDDIE"
},
"reviewBody": "MY LATE MOTHER IN-LAW (FROM GREECE) MADE\nTHEM WITH GROUND BEEF, RICE ETC. PLACE A\nDISH ON THEM WHILE THEY COOK. THEN MAKE A\n\"AVGO/LEMENO\" SAUCE(EGG-LEMON)POUR IT OVER WHEN READY TO SERVE. ASK A GREEK HOW TO MAKE THE SAUCE, IT'S A LITTLE WORK\nBUT WORTH IT.ED"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carieannjean"
},
"reviewBody": "I made a batch of these today as an appetizer for an upcoming dinner party. They are not hard to make, just time consuming. I used the tip from another review about placing a plate on top of them (obviously the plate needs to be smaller than the pot in diameter to put pressure) to keep them from \"floating\" and this worked wonderfully! No problems with unrolling. I would make this again and try a ground meat mixure with the rice for a variation. I did not have any mint on hand and they still were great with the lemon/dill flavor. Thanks for a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissGleasonSanchezApostolides"
},
"reviewBody": "Yummy! These work better if you use a glass dish or some sort of weight when cooking them in the final step. It keeps them tighter and prevents any from falling apart. They are traditionally served warm or cold as a snack. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEIDI186"
},
"reviewBody": "This is the first time I've ever tried making grape leaves, and let me tell you, the outcome wasn't pretty. LOL. However, the taste was out of this world. It was the perfect blend of lemon and dill and YUM. I didn't have the mint, but I will definitely make sure I have some next time as I think it would be a wonderful addition. Thanks for such a super recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BELLA232232"
},
"reviewBody": "You want to make sure that you cook these long enough to cook the rice thoroughly: you don't want a crunchy dolma! I served mine with a lemon and mint flavored yogurt sauce (a little lemon juice and a bit of chopped mint), which made them even better. I also used what fresh herbs I had on hand: lemongrass and mint, and they were fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "helodat"
},
"reviewBody": "I felt this recipe turned out a little bland so I added a small amount of salt with the mint and dill and also when adding the chicken broth at the end just before cooking. I also like to add ground beef in mine and my husband prefers it this way as well. It turned out to be a great combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Minda Hannenberg"
},
"reviewBody": "I gave this recipe a 4 rather than a 5 as the rice mixture did not turn out quite as flavorful as in the local deli. Next time I may add more of the mint or dill, and perhaps some toasted pine nuts. However, the method works perfectly if you follow directions exactly; (and yes, it DOES tell you when to add the mint; add it with the dill!) the rolled leaves stay intact if packed closely together in cooking pot. I actually crowded them a little. On the grape leaves; best bet is to buy Mazetta jar of grape leaves, they are quite large and work well. You want the grape leaves pretty tender, so just cook them longer (we cooked ours about 2 hours on a very low simmer) if needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "IMVINTAGE"
},
"reviewBody": "I have never had stuffed grape leaves before, let alone made it so please take my review w/ a grain of salt. I liked the rice mixture but felt it could have benefited from some ground meat. It was the grape leaves I had a problem with. They had kind of a \"wang\" to them &amp; I didn't like the texture. I cut the recipe in half &amp; only stuffed about 8 grape leaves (there was just tow of us). We ate one each &amp; threw the rest away...sorry. I saved the rest of the rice to have as a side dish w/ another meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FOOZALG"
},
"reviewBody": "My first time making stuffed grape leaves, if I had known they could be this easy I would have made them years ago."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHELLMRTN"
},
"reviewBody": "I made this recipe exactly as written and really liked it. But my dinner guests had very mixed reviews. Two loved it, two thought it was OK, and two hated it enough to spit it out. Since I'm writing the review and liked it, I will give it four stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it's the first time i've made stuffed leaves and first time i've cooked somethingwith mint that is not desert and it's great everybody in my family loved it very much thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As a person of Lebanese heritage, I have tasted and cooked many stuffed grapeleaf recipes. Most of them have meat, and I was looking for a vegetarian version. I used a vegetable broth instead of chicken for this recipe. This recipe was OUTSTANDING for flavor. I also added some toasted pine nuts. My one suggestion is to make sure that the rice is undercooked before stuffing. I cooked it to long, and the final cooking time of one hour was to long for the rice. It was kind of mushy. But the flavor and texture (before the last cooking) was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K_ONION"
},
"reviewBody": "Fabulous recipe! A couple of changes: veggie broth instead of chicken, dried herbs (adjusyed quantities), a little parsley, and grape leaves from a jar. It came out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMMANEY"
},
"reviewBody": "these were great!. altho the rolling got abit tedious :P. i made a few changes simply because i didn't have exactly the ingredients on hand. i used instant brown rice which sped up the cook time of the rice mixture. i would simply reduce the amount of moisture to what the box requires for 2 cups. other wise you have to cook the extra moisture out. the brown rice gave it a bit nutty of a flavor which i really enjoyed. also i dont like mint. so i replaced the mint with parsley. i used dry herbs instead of fresh. i truly recommend giving the rolls and extra squeeze, packing them tight as possible in the pot, AND putting a plate on top to help them keep from busting.. really an easy , impressive recipe. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia"
},
"reviewBody": "Perfect!!! The best I have ever had!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EREEDHOLM"
},
"reviewBody": "They are very tasty, but if your not sure what your doing this recipe is a little confusing. It calls for 1/2 cup mint but dosen't tell you when to put it in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a really tasty recipe. If I serve it as a main course, I add 1 lb of ground lamb, a handful of pinenuts or pistachios, a handful of dried cherries or cranberries, and about 2 oz of crumbled feta cheese. The lamb has a considerable amount of fat in it, so you can use half the amount of olive oil or eliminate it altogether. If you like Mediterranean and Middle Eastern Food, you will love this recipe. Don't let the pot get too hot, or your leaves will burst; I use flavorful basmati rice, so I prefer the rice to be fully cooked before stuffing the leaves."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18842/my-own-famous-stuffed-grape-leaves/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17807/appetizers-and-snacks/tapas/",
"name": "Tapas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18842/my-own-famous-stuffed-grape-leaves/",
"name": "My Own Famous Stuffed Grape Leaves"
}
}
]
}
}
, "about": [
]
}
]