				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Nana&#39;s Beef Stroganoff"
,"datePublished": "2019-04-02T02:59:35.000-04:00"
,"dateModified": "2019-04-02T02:59:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lauren Lowther"
,"url": "https://www.allrecipes.com/cook/5917276"
}
]
,"description": "A traditional beef and mushroom Stroganoff with a touch of tomato and white wine is finished with sour cream for a great skillet dish to serve over rice or egg noodles."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BgSMJfliowgRNGOGnGY3wGHZRig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/998764-0c66a8f010e343209f65af94f8b4911c.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Nana&#39;s Beef Stroganoff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "156"
}
,"cookTime": "PT140M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "514 kcal"
,"carbohydrateContent": "14 g"
,"cholesterolContent": "129 mg"
,"fiberContent": "1 g"
,"proteinContent": "35 g"
,"saturatedFatContent": "19 g"
,"sodiumContent": "559 mg"
,"sugarContent": "3 g"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 tablespoon all-purpose flour",
"0.5 teaspoon salt",
"1.5 pounds beef sirloin, cut into 1/4-inch wide strips",
"2 tablespoons butter",
"1 cup mushrooms",
"0.5 cup chopped onion",
"1 clove garlic, crushed",
"2 tablespoons butter",
"3 tablespoons all-purpose flour",
"2 tablespoons tomato paste",
"1.25 cups chilled beef stock",
"1 cup sour cream",
"0.25 cup dry white wine" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Shake 1 tablespoon flour with salt in a large, resealable plastic bag until combined; add beef and shake to coat."
} ,{
"@type": "HowToStep"
,"text": "Melt 2 tablespoons butter in a skillet over medium-high heat. Brown beef in the hot butter, about 3 minutes per side. Stir mushrooms, onion, and garlic into beef; cook and stir until garlic is fragrant, 3 to 4 minutes. Transfer beef and vegetables to a bowl, leaving drippings in skillet."
} ,{
"@type": "HowToStep"
,"text": "Melt 2 more tablespoons butter in skillet over medium heat. Cook and stir 3 tablespoons flour in the hot butter until smooth; stir tomato paste into flour mixture. Whisk beef stock into mixture and cook, stirring constantly, until sauce is thickened and bubbling, about 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Return beef and vegetables to skillet and stir to coat with sauce. Reduce heat to very low and simmer until beef is tender, 2 to 3 hours. The longer it cooks, the more tender the meat will be. Just before serving, stir sour cream and white wine into beef mixture and heat through. Do not boil."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely the best stroganoff I’ve even had. The layers of rich ingredients was glorious. I followed recipe right down to the letter and it was perfect! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelleyblum"
},
"reviewBody": "Beef stroganoff was good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Lemerande"
},
"reviewBody": "Restaurant worthy! Excellent dish. My adult son who never gives out compliments on my dishes couldn’t say enough about it! It’s a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ken_tammy2"
},
"reviewBody": "I’m not a baker so measuring was out, but I stuck to the ingredients &amp; structure of the recipe (other than using Ghee for initial braising of stew meat &amp; adding pepper/garlic-salt to the flour). Simple comfort food at its best… Вкусно!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon S"
},
"reviewBody": "I’d been craving this and it didn’t disappoint! The meat was melt-in-your-mouth and the house smelled wonderful on a cold snowy day. Because I had Greek yogurt, I substituted that for the sour cream and the sauce broke unfortunately, but the taste wasn’t affected. I will definitely make this again; only with sour cream next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Stockton"
},
"reviewBody": "I followed the recipe exactly at the beginning and it was perfect for me, being on a reduced sodium diet. I used fresh mushrooms - a lot of them - But I did find it to be a little bland, so I added some fresh garlic and onion powder to it, and at the end in addition to the sour cream I added melted cream cheese. It was fantastic. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eaf78"
},
"reviewBody": "I did things a little different, as I always do, but this was really good. Will absolutely make this dish again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia Rod"
},
"reviewBody": "It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rachel Huisenga"
},
"reviewBody": "made like the recipe calls and am very disappointed, the tomato paste made it orange now my family will be very picky about this meal..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Welty"
},
"reviewBody": "Made as directed except doubled the mushrooms and I feel 2 hours is too long to cook flavors were good meat was dry, still tender but dry. Thank you for the recipe, will make again will shorten cook time to 30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dvancamp"
},
"reviewBody": "This is a great recipe for Stroganoff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzan R"
},
"reviewBody": "Just like my mom used to make! Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy Wolf"
},
"reviewBody": "This was great! Easy to make, perfect for a chilly winter night and everyone in my family liked it - a miracle!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Starkey"
},
"reviewBody": "Excellent recipe! You don’t have to change a thing. I didn’t have white wine so I did a substitute of 1 cup beef stock and 2 TBSP flour. Wisk the two together nicely( then pour into the beef and veggies while simmering. Then I added the sour cream just before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Soooo good! I used beef stew meat and tomato sauce because that’s what I had on hand and it turned out delicious. Was even better leftover. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pattimc"
},
"reviewBody": "This sauce was good, but needed a little more seasoning. I didn’t have mushrooms and substituted shredded carrots. The carrots were good, but I think I’d add mushrooms and carrots next time. This was overall a great recipe that I will made again with little tweaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margo Whitworth"
},
"reviewBody": "I used Greek plain yogurt instead of sour cream. It was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christine Fotion Bavone"
},
"reviewBody": "My family was not impressed. I think they are used to the traditional white sauce version that I usually make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "Great recipe. My gas range leaves me hanging. I turned the flame as low as I could so the stroganoff would simmer. I just wanted to let it simmer for 2-3 hours to make sure the beef would be tender. I continually had to alternate between off and very low. Really was a pain but the stroganoff was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "8.25.20 First, we really enjoyed this, my husband says that we need to put this on the menu more often. This really was quite easy to make, but there are a few things that I'll do differently in the future. I will first sauté the mushrooms, onions, and garlic (getting some good color on the mushrooms), remove from the skillet, and then brown the meat. Although the mushrooms tasted OK, they had no color, so this is more of an eye appeal issue to me. The tomato paste was a new stroganoff ingredient (at least for me), and it not only lends good flavor, it also gives good color to the sauce. I’ll also cut back the amount of the flour. When it was time to return the beef and veggies to the skillet, there was no way it was going to simmer because the sauce was way too thick, almost like paste. I ended up adding more and more beef broth throughout the remaining cooking process to get the right consistency. Finally, adding the white wine at the end doesn’t make sense to me because there’s no time for the alcohol to cook off. Most likely, I’ll add that after I've browned the meat, using it to deglaze the pan. I used Black Angus sirloin that was on sale this week, so the beef was high quality. As a result, the meat was tender in about half an hour. This recipe is worth tweaking because what was served for dinner last night was sooooo very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daemianraj"
},
"reviewBody": "Followed the recipe except skipped the white wine and substituted actual tomato instead of tomato sauce since I didn’t have it. Turned out great! My daughter who’s 9 says it taste so yummy like ‘beef version of clam chowder’"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Mykel Mayhue"
},
"reviewBody": "I made this at my daughter’s request for her birthday and it was amazing! Make sure to simmer the full amount of time and the meat will be tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stuart Schwartz"
},
"reviewBody": "I added a teaspoon of Gochujang paste to the recipe, giving it a bit of a chile pepper taste. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEMP"
},
"reviewBody": "I made it and it came out great! I didn’t cook it as long as recommended, but it was tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Curry Leppo"
},
"reviewBody": "I made this for dinner using a beef chuck roast that I cut into 1/4” strips, as there was no beef left at the store, due to the COVID-19 pandemic. I had never made beef stroganoff, and this was a little labor intensive, but totally worth it. I did add a little extra beef broth while simmering for 2 hours, just so it wouldn’t stick, and next time I make it I’m going to reduce the sour cream by half, and add heavy cream so it isn’t quite so “sour creamish.” I served it over egg noodles, with a side salad, but it was equally great with leftover mashed potatoes the next day. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abbyz2000"
},
"reviewBody": "I liked this without salt. I also subbed plain Greek yogurt for the sour cream. I used the crock pot instead of skillet and cooked it all afternoon on low."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Kohler"
},
"reviewBody": "I was looking for something to prepare with ingredients that I had on hand. I had one pound of hamburger meat that I wanted to use up so that was my main ingredient. I followed the directions the same as if making with the sirloin. I wasn't sure about sauteing the fresh mushrooms with the meat, but it turned out fine. As others suggested, I left out the wine. I didn't see any need for it. Maybe next time I will add a smidge of wine, but I saw no need to add 1/4 cup. I served with egg noodles. Husband liked it. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronna"
},
"reviewBody": "So good. Sometimes I make it with lean ground beef, and it is also good - a nice switch up for people on a budget. If I have time, I do like to have it simmer for the full 2-3 hours before adding in the sour cream. I serve over egg noodles and garnish with fresh dill. I've had stroganoff in the Stroganoff Palace in Moscow, and this stuff is pretty close."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Kuether Martinson"
},
"reviewBody": "I really liked this minus the sour cream and white wine at the end. My 10 year old daughter rated it 9/10 and my 16 year old son rated it 6/10. Next time I am going to leave out the sour cream and wine. The sauce was better before adding it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina Manzo"
},
"reviewBody": "Wow! really awesome beef stroganof! Absolutely delish! Thank you for sharing this recipe. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Barber"
},
"reviewBody": "I cooked this a little differently from the author. I browned the meat in 3 tbs. butter then put the meat in the slow cooker; cooked the mushrooms separately in 3 tbsp. butter until they were brown (about 5/6 minutes) put on top of the meat in slow cooker. Used large can of little onions, drained and into the slow cooker. Then I made the sauce separately as directed and dumped in slow cooker. Slow cooker on low 5 hours. Added in white wine last 30 minutes. Then dumped in the noodles (half cooked) and let them soak up the sauce for 10 minutes while making bread and salad. Turned off slow cooker and added sour cream at the very end. Put lid back on for 3 minutes to let it warm. Don't clean the pan in between cooking the meat and mushrooms. Just add in the butter at the end and cook the flour for 5 minutes until it's golden then add the tomato paste. Let that get hot, then add the garlic and use half red wine/beef broth to deglaze the pan. All those bits are what gives the dish so much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sallou"
},
"reviewBody": "This took a little longer than I like a week night dinner to take\nBUT it sprang to the top 10 meals in my recipe box.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karachromatic"
},
"reviewBody": "We made this exactly as the recipe was written. It’s a little bland but it isn’t bad. I agree with some others, it needs a little more beef flavor, maybe more beef stock. I’m not sure! I ended up adding a little more salt to my dish when it was done and that helped a little bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Paul W"
},
"reviewBody": "Tasted horrible, not like stroganoff at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vicalee110"
},
"reviewBody": "This was really yummy! Only thing I added was pepper to the flour/salt mixture. Delish! Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yemek Pasta"
},
"reviewBody": "nice recipes bro\n\nhttp://www.yemekpastatarifleri.com"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa Stewart Carraway"
},
"reviewBody": "Husband and I enjoyed it. I’m sure I will fix again, however, due to the prep involved probably won’t fix very often. Also needed some salt and pepper to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannine Klarman Pettas"
},
"reviewBody": "Yummy :) i'd make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie trudell"
},
"reviewBody": "I made this recipe but used ground beef (my husband just had oral surgery and couldn't handle chewy meat) I added a little cinnamon to the meat while I was browning it. My husband loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela T."
},
"reviewBody": "Made Nana’s Beef Stroganoff with all the ingredients as listed, but cooked it in a slightly different sequence and methods as to not overlook the meat. The flavors of the ingredients were amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkpatrick"
},
"reviewBody": "Fairly easy to make and great flavor. Don't skimp on the quality of beef..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Adrienne decerce"
},
"reviewBody": "I made this last night. I followed the recipe mostly. I used the beef stock needed. it still did not have enough beef flavor so next time I will use bullion cubes in addition to the beef stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fred N. Nielson"
},
"reviewBody": "I love Beef Stroganoff and being able to bring the dish to the table quickly, easily and tastefully is a blessing. This may not be the pernultimate Stroganoff recipe but it will be our go to recipe in the future. And FYI Beef Stoganoff was traditionally served over mashed potatoes and is my preferred presentation ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allison Sweeney"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen Watts Daniels"
},
"reviewBody": "This was delicious, but very rich!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Dutton"
},
"reviewBody": "Delicious! Very simple instructions and the result was creamy, savory and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Streit"
},
"reviewBody": "Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Hardy"
},
"reviewBody": "Didn’t make any changes and turned out wonderful will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniel Collins"
},
"reviewBody": "Great dish, cooking time is depending on the beef and how much you're working on the flavors. The cut of Sirloin I bought was ready in 20, but I wanted the garlic and onion to Fuze all of their flavors together. I enjoy a spicier flacor, so I threw in a dried chili pepper into the simmer. I also cut back on the sour cream to a 1/2 cup. I like the savory and the Uma I with a little less bite of the sour cream. All in all, a good basic recipe to make your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifier Massie-Fadler"
},
"reviewBody": "5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenbeezusa"
},
"reviewBody": "Made it exactly as written. Really really delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KB"
},
"reviewBody": "This recipe is pretty much identical to one I received in a recipe cards-of-the-month set, and it is one we have enjoyed for years. The one thing the card mentioned, that I do not see here, is that you can substitute beef boulion for the wine. We make the bouillon two or three times as strong as you would make if you were drinking it, depending on how beefy you want it to be. Being non-drinkers, we do not miss the fermented wine taste. If you want a little tart fruitiness, you can also add a little cider vinegar to the bouillon. It is good either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kati Lynn McDermott"
},
"reviewBody": "I used ground beef only because it was what I had in freezer and I didn’t want to go to the store. This was excellent stroganoff even without the steak. I’ll have to try it w steak next week"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Spectacular!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greekmom2005"
},
"reviewBody": "This recipe please even the pickiest of eaters. This was super simple to make, none of the ingredients were complicated (I had most on hand), and it turned out super tasty. This will be one of my go-to recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jimmy Beans"
},
"reviewBody": "Nana knows how to make a mean beef stroganoff. definitely the best my family has ever tasted!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "I love this recipe. Not only delicious, but the tomato paste adds a beautiful color to the dish that you normally don't get. This is quickly becoming a family tradition in my own family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Atkinson"
},
"reviewBody": "We enjoyed this. At the same time, think we prefer this dish without the tomato past better. Made enough for about 6-8 servings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Turned out great, recommend following suggestions too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alice"
},
"reviewBody": "As I did not have a full cup of sour cream so I topped up the cup with plain Greek yogurt. Also did not add the white wine. The sauce was nice and thick, The meat very tender as I had let it simmer 2 1/2 hours. I did add 1/2 teaspoon of smoked paprika for a little zip. Hubby said it was very tasty. I would make this again without a doubt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PaigeB"
},
"reviewBody": "This dish was incredible. I hate to sound too \"Food Network-y\", but the sauce had an unexpected depth of flavor--so rich and delicious. Sadly, there were no leftovers. Even though there are only 3 of us, each of us went back for seconds.\n*****\nNote: I didn't have tomato paste, so I substituted 5-Tbsp. tomato sauce. I used Sauvignon Blanc, and I used it to deglaze the pan rather than later in the recipe. I used a \"healthy\" bowtie pasta, but I think I'll use unhealthy egg noodles next time. :-D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Molet"
},
"reviewBody": "Love this one. Doesn't even need sour cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Waiting"
},
"reviewBody": "Taste delicious. Takes a bit of time to make, but worth it. I used a tiny bit more wine to compensate for a little extra meat. And another note, I only used 1 1/2 tsp of the red pepper flakes and I'm glad I did, next time I will only use 1 tsp. and I do like spicy, but 1 tsp. would be enough for my taste. Would make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Sailor"
},
"reviewBody": "In my opinion, this is the only stroganoff recipe worth making. It's incredibly easy, you can even make with ground beef, and tomato paste is so yummy in it. And it doesn't use those canned soups! We like it, and I double the onions and garlic and don't use the mushrooms for the kids. Tonight I also added black beans - interesting addition, not bad. Oh, and I used port for the wine ---mmmmmmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susan creighton"
},
"reviewBody": "So delicious!! Two things to add... #1) didn't use wine, just I increased stock and #2) next time I think I'll make smaller slivers of the beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny Hall Plunkett"
},
"reviewBody": "This was amazing! The only \"tweaks\" I made was to use ground beef (because it needed to be used) and chicken broth with a couple of teaspoons of beef bullion granules. Delicious and simple! This recipe is.a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harry Martin"
},
"reviewBody": "Great stroganoff recipe. Used Sprouts organic beef broth instead of stock (great flavor) and sliced very thin leftover medium rare London broil for the meat. Because the meat was already cooked, I threw it into the pan with the mushrooms and onion when those were nearly done. I only simmered for a half-hour and meat was incredibly tender. My partner said it was good, and then corrected himself and said \"very good.\" P.S. I garnished with sliced green onion but parsley would have worked great, too. UPDATE: Had a little trouble with an overpowering tomato sauce taste. Next time I would use just 1 Tbs and go from there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SandyS"
},
"reviewBody": "This was very tasty, but add some paprika and parsley to the sauce. Also, thicken up the sauce before adding the sour cream and wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackdup"
},
"reviewBody": "Just the right amount of tomato paste and sour cream. I added a tablespoon of Worcestershire sauce and topped the finished dish with fresh snipped chives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BECKYW2770"
},
"reviewBody": "Excellent. I didn't use any wine and it still tasted great. I was worried that simmering with sliced mushrooms in there would disintegrate them so I put them in after I blended the meat back in to the sauce, then simmered for an hour. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rhonda Kite"
},
"reviewBody": "There was way too much flour for me. I did use organic wheat flour, maybe that was to 'dense' otherwise nice taste - will try again ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bud"
},
"reviewBody": "Used golden mushroom soup instead of making sauce. Used everything else and it came out very good. Almost a 5 rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta Antonovich"
},
"reviewBody": "Very good stroganoff recipe. The only thing I did differently was add the white wine just before I turned it down to a simmer. Portabella mushrooms stand up well. This is the first review I have ever done. Have used this website often. Sometimes just as a starting point. If I make a LOT of changes I won't rate it because it is not the same recipe. It's not fair to the one who submits it. Rather than listing all your changes, I would suggest you submit as a new recipe ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Edmundson"
},
"reviewBody": "I have never made stroganoff. Even the chef classes I took in the military we never made it so I was a little nervous. I fell back on my training and changed the recipe a little. I used a high end roast that I cut up. Double the recipe because of the amount of meat. Added cracked pepper, cayenne, parsley, extra butter, the juice from the mushrooms, two dashes of oregano, and I didnt have tomato paste so I subbed with stewed tomato juice. I almost forgot, I used 10 spring onions greens included and because I love garlic I doubled it and it didn't drown out the taste of every thing else when mixed together. My grandson is extremely picky as an eater due to Asperger's and his comment was \"there will be leftovers, right?\" i have tried stroganoff several times and never liked it. But this OMG the food of the gods LOL. Just mad that my stomach can't hold much. I am going to freeze several meals to attack at my leisure. Thank you for the recipe absolutely great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Roberson"
},
"reviewBody": "This is so simple but yummy. I did add some spices to the flour before coating the meat paprika, onion powder, garlic powder (omitted the fresh garlic) and the salt and black pepper. After browning the meat and sautéing the onion I put those into a lined crock pot then cooked the flour I used the flour left over from dredging and deglazed the skillet with red wine and added the broth. Didn't have tomato paste so I used ketchup instead. Added it to the crock pot and cooked on low for 2 1/2 hours. It turned out delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lubna"
},
"reviewBody": "Delicious and easy to prepare. Only thing is the sauce turned out too thick so I think I'll either use less flour or more cream at the end. Surely different that than the usual one I used to prepare but equally tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana March Stephens"
},
"reviewBody": "Made exactly as the recipe called for. all of the kids rated it a 4 out of 5 stars but they have pretty high expectations. lol. Personally, I thought it was pretty good andI will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "belongsinthesky"
},
"reviewBody": "Simple and delicious!This recipe is great and it came out wonderful. I was thinking that for next time to add red wine instead of white, and maybe a little balsamic vinegar as someone else suggested. I served it over aborrio rice and it was just perfect on a cold day. The only thing I did was add the white wine to my rue so that the alcohol burns off, it did take about 20 minutes for my sauce to start to bubble, but you can increase the heat a bit more and continue stirring so long as it doesn't boil. I covered it for the 2 hours it was simmering but it was rather watery, so I left it to simmer and reduce without the lid for another 30-45 minutes and it was perfectly creamy! Test for salt, you may need to add a bit to taste. I also loved the sour cream in it but a friend recommended horse radish if you want to give that a try. Over all, wonderful and I will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aprilI"
},
"reviewBody": "I added garlic powder to the four salt mixture as well as salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Schnee"
},
"reviewBody": "This was simply delicious, the only thing I changed was as previous rated was the placement of the wine and addition of a tablespoon of Worcestershire. I deglazed the pan after cooking the meat, I could still taste the back drop of the wine and believe if added in the end would be way to strong of the wine taste. If you don't like the taste of wine I would even leave it out all together, but it did give a zing to the sauce. All in all it was very rich and tasty. It's a thrifty way to stretch a rather expensive steak as I used a couple Tbones, only because I did not have sirloin available this day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois Oijen"
},
"reviewBody": "The sauce was just a little thick so I just added a bit of water.\nAbsolutely wonderful recipe, I will make this my new go to \nrecipe for stroganoff from now on! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Harrold"
},
"reviewBody": "Honest to god it was as if I was propelled back 35+ years! I have been trying to replicate my mothers Stroganoff for years with little success. This recipe has nailed it!! If you have children I highly recommend you double it. My 11 year old &amp; husband went back for 3 helpings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "Made this with chicken instead - awesome!!\nThanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "googirl"
},
"reviewBody": "i used top sirloin, so no need to cook so long and omitted the wine. This was very good, and I will probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "I love this recipe! I changed only a few things that made it a bit more personalized for my family's taste, but this recipe is a great starting point or solid as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danyel"
},
"reviewBody": "I tripled the flour and salt in the first step to properly coat the meat and that left the drippings quite thick so I doubled the butter for both steps and also doubled the mushrooms. I ran out of wine so I used more beef stock instead. Also only let it cook for a little over an hour. It needed quite a bit of pepper at the end but the result was fantastic. I have a simpler, less traditional recipe that I usually use for beef stroganoff but my exceptionally picky husband actually moaned several times while eating this so I guess this is my new recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MBirman"
},
"reviewBody": "This is my husband's favorite meal so I tried this recipe. He said it was good but was more tangy than he is used to and likes. (He likes it more \"mushroomy\".) I THINK it was the wine but not certain. Will look for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hstauff"
},
"reviewBody": "This was really good. I added the wine early on like many of the other reviewers and also added a touch of Penzey's Bavarian Seasoning to give it just a little richer flavor. This spice blend includes crushed brown mustard, rosemary, garlic, thyme, bay leaf and sage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph W."
},
"reviewBody": "This was wonderful. Fairly easy with a nice full flavor. I love stroganoff but hate canned ingredients so this was a great recipe for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "hotinthekitchen"
},
"reviewBody": "This was very tomato-ey to me. I would increase the beef broth and decrease the tomato paste or leave it out all together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee Elliott"
},
"reviewBody": "Lovely recipe! The tomato paste browns the sauce, nicely. Don't be afraid of the sauce browning/sticking to the bottom of the pan. It de-glazes perfectly when you add the sour cream and white wine. Suggestion: use two large portabella mushroom caps chopped into 1 in pieces. They will hold up better for extended cooking. I only cooked this for 45-1 hour before adding the sour cream/wine and serving. It was perfect! Thank you, Nana..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JLeo"
},
"reviewBody": "Good, but something was missing. It needed more of a beef flavor in my opinion and less of the tomato. I added a little bit of paprika to the sauce and extra sour cream. 3 stars for me and 5 stars from the rest of my family. Serve with coleslaw and mashed potatoes :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia"
},
"reviewBody": "I couldn't find my mom's recipe, so I was looking for one that was similar. Found it! This is exactly how I grew up eating stroganoff. Creamy and rich. The white wine really brings out the flavors in the sirloin and mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ina"
},
"reviewBody": "I cheated and used ground beef because I was hungry and didn't want to wait 3 hours. It still turned out well. My entire family cleaned their plates, and that includes my extra special picky eater."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Purl2tog"
},
"reviewBody": "Made exactly as recipe stated and it was delicious!! This will be my go to recipe for stroganoff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "This is a very nice stroganoff. We added the wine to the flour/tomato paste mixture, followed by the broth. Also added a little more water to thin it out a bit while it cooked and a dash of thyme. Nice dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taffy"
},
"reviewBody": "Thank you Lowlo. This was delicious. Very simliar to my Mom's who added dill weed and celery to her recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacy Tindall Spinnato"
},
"reviewBody": "JOEY LIKES THIS ONE! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leaB"
},
"reviewBody": "Get the butcher to run your meat through the tenderizer a few times to break down the fat. This cuts your cooking time to one hour. Also I used Campbells Beef Consomme instead of stock. It is really delish!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230302/nanas-beef-stroganoff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/712/world-cuisine/european/eastern-european/",
"name": "Eastern European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/716/world-cuisine/european/eastern-european/russian/",
"name": "Russian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230302/nanas-beef-stroganoff/",
"name": "Nana&#39;s Beef Stroganoff"
}
}
]
}
}
, "about": [
]
}
]