				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Nana Dot&#39;s Irish Soda Bread"
,"datePublished": "2020-06-18T23:34:43.000-04:00"
,"dateModified": "2023-01-04T15:52:50.000-05:00"
,"author": [
{"@type": "Person"
,"name": "JerzPixelPusher"
,"url": "https://www.allrecipes.com/cook/2386061"
}
]
,"description": "This recipe has been passed down from Ireland for generations. If you like soda bread, this is awesome!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wNYhAxHpNwJJ22AcHqffFMiSUkw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/808106-b1e5c16cf65e4287bc04d91555782848.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Nana Dot&#39;s Irish Soda Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "162"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "122 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "220 mg"
,"sugarContent": "8 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.5 cups all-purpose flour",
"1.5 teaspoons baking soda",
"1 tablespoon baking powder",
"0.5 teaspoon salt",
"3 tablespoons white sugar",
"0.5 cup butter, cut into pieces",
"1 cup raisins",
"0.5 cup currants",
"2 teaspoons caraway seed",
"0.75 cup milk",
"3 tablespoons apple cider vinegar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C). Grease 2 baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Stir together the flour, baking soda, baking powder, salt, and sugar in a large bowl until evenly blended. Cut in the butter using a pastry blender or your hands until the mixture resembles coarse cornmeal. Stir in the raisins, currants, and caraway seeds, then make a well in the center and pour in the milk and vinegar. Stir with a spoon until the dry ingredients are moistened."
} ,{
"@type": "HowToStep"
,"text": "Turn the dough out onto a well floured work surface, and knead gently 8 to 10 times. Divide the dough into two balls, and place onto the prepared baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 15 minutes, then reduce heat to 375 degrees F (190 degrees C), and bake until the top of the bread is golden brown, about 15 minutes more."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dboss101"
},
"reviewBody": "Needed a quick recipe we had one failed bread. Literally last minute. Everyone enjoyed this recipe over the one we’ve been using for years. We don’t like currants so we omitted it. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WCFB"
},
"reviewBody": "Wonderful and easy. No raisin or seeds because I didn’t have them. I salute Nana Dot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EllenB5"
},
"reviewBody": "This was BY FAR the best tasting Irish Soda Bread I've ever had (let alone made). Thank you so much for sharing your family recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie4"
},
"reviewBody": "My husband loved this! It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Turned out great, easy to make and bake. This time I replaced raisins and currants with Craisins from Costco and made my own simple to make Buttermilk ( 3/4 cup milk and 2 &amp; 1/2 tsp lemon juice, stir, set aside buttermilk so it has time curdle a bit. My husband and I love this bread either way! Thank you so much Nana Dot,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "briankane73"
},
"reviewBody": "Pretty easy and tasted great. My batter was pretty wet but it worked out. I baked to 190f internal temp. I substituted Golden raisins for currants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghan"
},
"reviewBody": "I have never made soda bread before, but I will make this recipe again. Excellent taste! It was not overly sweet, and although I wasn’t sure about the raisins I’m glad I put them in because they worked well. As another reviewer mentioned, it is very much like a large biscuit. I did tent with aluminum foil halfway through because it was getting too brown. I baked the full 30 minutes, but next time I will check it for doneness at 25 minutes because the bottom was a bit dark. I didn’t have currants or caraway seeds, so I didn’t use them. I also used bread flour instead of AP. Mine held together just fine when I cut it with bread knife, no crumbling. A winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "giraffe30082"
},
"reviewBody": "Absolutely delicious. Next time I will start with less milk. Had to add extra flour to be able to get it out of the bowl. Used golden raisins and caraway seeds. Didn’t have currants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Elf"
},
"reviewBody": "Absolutely the best Irish soda bread ever! Don’t even look at the other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri McCall Burkham"
},
"reviewBody": "Perfect. Made as is. Don't leave out the currants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neal Biener"
},
"reviewBody": "The only change I made was I used buttermilk cuz I had it on hand. Souring the milk with the vinegar yields the exact same result. This is by far the best soda bread recipe I've encountered in my 40 plus years of baking. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi DeBoer"
},
"reviewBody": "Perfect, great recipe! I like mine a little sweet so I added 1more Tablespoon of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richele"
},
"reviewBody": "The flavor of this bread is outstanding. It is sooooo tender but the only issue I had was it just crumbled when trying to cut it. I have tested many other soda bread recipes and this is the one I’ll continue to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannette"
},
"reviewBody": "Made this instead of my usual Irish soda bread recipe because my buttermilk was old. Only substitution was replacing 1/4 cup of the milk with heavy cream. Very similar texture to a scone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Stetenfeld"
},
"reviewBody": "Flavor was PERFECT. All I did was roll the dough ball in coarse sugar before baking to give it a nice crunch on the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donald Garber"
},
"reviewBody": "Very easy recipe to make, and the final result is delicious! The completed dough during kneading was very sticky, so prepare for that. Using a fan oven, the dough needed a fair amount of time extra baking time, but that could be a factor of the thickness / shape of my loaf. I did not incorporate caraway seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Parawood"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathleen W"
},
"reviewBody": "I halved the recipe because I didn't have enough flour but it turned out wonderful anyway. The loaf it made is small and it baked up more evenly than another Irish Soda Bread recipe I tried. I had some chopped dried dates so I threw in a bit with the raisins. Husband raved about this bread and he is not that big of a bread fan, especially with raisins. It is a wonderful, very easy recipe. Recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenp"
},
"reviewBody": "I’ve been looking for a recipe for Irish soda bread for a long time now. I’m finally happy with this one. Quick, easy and delicious. (Left out the caraway seeds)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lena Stefanese"
},
"reviewBody": "We love it and it was so easy. I didn’t have currents or caraway seeds so I used 1 1/2 cups of raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Norton"
},
"reviewBody": "I have made Irish soda bread before. My previous recipe was heavy. This is light and I love the raisins and currents with the caraway seeds. Reminds me of a scone texture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gradwife79"
},
"reviewBody": "I swapped out the currants for Craisins and omitted the caraway. I have to make a double batch three times. It’s the only time of year I make this and my family goes wild over it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmacle01"
},
"reviewBody": "Nice texture and moist. Good flavor! Will make again. This is a keeper. I made one round loaf instead of two and cooked an extra 5 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Ann Ball"
},
"reviewBody": "I’ve made this recipe quite a few times and everyone loves. We enjoy it at St. Patty’s Day with our corned Beef and Cabbage but we also enjoy it with a nice cup of tea or coffee. Outside of St. Patrick’s Day, I add a variety of dried fruit: blueberries, cherries, cranberries, apricots, and golden raisins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Risko"
},
"reviewBody": "This recipe was very simple to make, and very delightful to eat!!! Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "Fantastic recipe. Great taste. I'll never have to buy buttermilk to make my yearly soda bread again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MariadelaLuz"
},
"reviewBody": "Great! This was my first attempt at soda bread and I will certainly make it again. My rule is to never improvise the first time, I think that the next time I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Hildebrandt"
},
"reviewBody": "I was looking for a Irish Soda Bread recipe that was quick, easy, and made with ingredients I keep on hand, and this was the one. Only exotic ingredient was currants - no one sells them around here. I made do with extra raisins. Also, I am allergic to common wheat, so I used spelt flour. No adjustments needed. Very nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quilted64"
},
"reviewBody": "Made as stated. Will add more caraway seeds next time. It was delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LittleSuzyCreamCheeze"
},
"reviewBody": "The taste is great. However, the texture was not what I am used to for Soda Bread. This one comes out more like a cornbread. I had noticed that the dough was a bit too sticky for what I expected, but since it was my first time using the recipe I left it as directed. Next time I will add a bit more flour and knead it a bit more to get that dense texture I am searching for. Tastes great with a little butter though :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NCF"
},
"reviewBody": "I made this yesterday . I added everything accept the currants , but added more golden raisins . I baked both on a whole Sheet size pan for 15 minutes at 400 degrees then 15 minutes at 350 degrees. They were one of the best Irish soda breads I ever ate. I just had sc"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenQ"
},
"reviewBody": "I made this with my Chinese students. It was easy to make and yummy to eat. We didn't add the currants or caraway seeds. We used the food processor to combine the ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy95409"
},
"reviewBody": "Will definitely make again! Made it the lazy way, with my breadmaker. Substituted golden raisins for raisins and substituted buttermilk for milk. Dumped all ingredients into pan in order as listed on recipe, set breadmaker to mix Dough, removed paddle, scraped down sides of pan, set breadmaker to Bake for 1.25 hrs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ginamarieacker"
},
"reviewBody": "Just made this using my food processor. Only used the 1 cup of raisins (no currants) and no caraway seeds. Otherwise, followed the recipe exactly. It was absolutely delicious. It was quick and easy and served 8 people with a little left over. Yes, the dough was sticky, but I used a little flower and was able to form the two loafs with ease. I've saved this to my book of favorite recipes, it was that good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Stevenson"
},
"reviewBody": "This is my go-to recipe for Irish soda bread. I use 2 cups of fruit, a combination of raisins, craisins &amp; golden raisins. No caraway. I bake the loaves in two 9\" round pans &amp; I brush the loaves with a mixture of melted butter &amp; buttermilk (optional). Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "What's for dinner, mom?"
},
"reviewBody": "This was my first time making this bread and WOW is it a good recipe! It reminds me of what my Irish neighbor used to make. Absolutely on point! I made two batches, one with raisin and the other with mini chocolate chips. I used silicone muffin cups and hit them with a little spray of oil. They slid right out and were perfectly browned. The muffins took 18 minutes in my convection oven at 400. Each batch gave me 22 - 24 muffins. I made these for my daughter to take to work and I am going to have to make two more batches because they are just THAT good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Not sure how other people kneaded this bread since mine was more a quick bread consistency. Orher than that, it was great! Will definitely use raisens and currants from now on. Also, this recipe made 2 6\" loaves = 8 servings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blue Maloney"
},
"reviewBody": "Great tender Crumb and nice yellow color. I used irish butter, plumped the raisins in warm water, and put turbaned sugar on the outside. After shaping it I let the loaf sit for 10 minutes before baking to let the loaf rise a little, like a mini proof. Made a half recipe and came out wonderful! perfect size little loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Simmons"
},
"reviewBody": "I halved the recipe (ended up using about ~3/4 cup butter), used GF flour, buttermilk instead of milk, and only the caraway seeds as a mix-in.....the result was a deliciously salty, buttery and satisfying bread that is worthy of eating year-round!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHILE1"
},
"reviewBody": "I have used this recipe every St. Paddy's day for the last 5 years and it always gets rave reviews! I usually leave out the caraway seed (I think it's too strong of a flavor for a crowd.) When I split it in 2, I put raisins in half and leave the other half plain. I haven't had leftover bread yet! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen_M"
},
"reviewBody": "Wow, this was delicious! I have never made Irish soda bread before and did not know what to expect. I gotta say, going into the oven and while it was baking, it just looked like a big biscuit and I was prepared to be disappointed. But hot out of the oven, my boys dove into it and LOVED it! I will absolutely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lvs2cook"
},
"reviewBody": "I needed a good basic recipe to start from and this hit the mark. I think pretty much everyone adjusts recipes to their taste, so here are my adjustments. It was wonderful, and I will make this again.\n\nI used 3/4 cup (plus a splash extra) buttermilk instead of milk &amp; vinegar. I added an extra Tbsp sugar, 1/4 tsp vanilla and omitted the raisins, currants and caraway seeds.\n\nI formed the dough into two round loaves, cross cut the top and brushed with a mixture of buttermilk &amp; vanilla (when I poured my 1/4 tsp over the measuring cup a little spilled over so I went with it)... Then I sprinkled a little white sugar on the top before baking at 375 for 25 minutes, turned the oven off and allowed the bread to finish baking as the oven cooled slightly (~5 minutes). \n\nAbsolutely delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Madden"
},
"reviewBody": "Good God, Nana Dot knew what she was doing. I figured I'd bring a soda bread to the family dinner on St. Patrick's Day. I've never made one before but this turned out light and tasty and it was not a hassle to make. I didn't see currants at the store so I chopped up some dessert dates (the kind that come ready to eat; very sweet and rather sticky) but other than that didn't change anything. This is about as easy to make as homemade pancakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Great recipe. The taste and texture were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrankFrank"
},
"reviewBody": "Looks just like my grandmother's bread from growing up in Galway, Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "Really easy! No raisins, or not enough? I used chopped dates! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Turco"
},
"reviewBody": "Yes, and it was delicious. Great hit with kids and adults."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Carey"
},
"reviewBody": "Used Namaste Gluten free flour. Had great texture and flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naturesluxuries"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "puellaparvus"
},
"reviewBody": "Love this! I've been using it for years. I use golden raisins because my family doesn't like regular ones. The caraway seed it a must!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this was my first try at irish soda bread and we agree with ~S~ that this reminds us of a yummy buttery biscuit.. we're not partial to sweet so we made it without the raisins/currants and did include the caraway seed.. sliced this up and enjoyed with some vintage dubliner.. very yummy.. ty so much for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "proudmommy924"
},
"reviewBody": "Great recipe. Tastes just like the Irish soda biscuits they used to serve at the Irish pub where I had my Irish step classes. Brought back good memories and a great addition to our Americanized yet family traditional corned beef &amp; cabbage meal !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah “Sarha” Oboda"
},
"reviewBody": "I had trouble getting the dried fruit to stick in the batter, and the baked loaves were a little delicate, but the texture and taste are fantastic! I also needed to add some time to the end of cooking—maybe ten minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Linda M"
},
"reviewBody": "I was really excited to make this soda bread and was so disappointed! It had such a distinct flavor of too much baking powder/soda combination and was actually a bit salty. I followed the directions exactly only varied by omitting the currants and caraway seeds. I'm giving it 1 star because I thought the consistency was good, but not the flavor. Also, I'm not sure what size loaves you're making cause it's not possible to get 2 unless they are only 4-5 inches around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "strwbry2679"
},
"reviewBody": "I love this recipe! My son is has dairy and egg allergy so I used plain soy milk instead of milk. Came out great! Now he will have something to bring to his St Patricks day party at school that everyone can eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShamrockinOntario"
},
"reviewBody": "Excellent flavour! Can also be made into scones if desired. I did have a bit of a more crumbly texture than I wanted...slicing was crumbly and messy. Anyone know what can prevent this as I really would like it to be a bit more 'together'. I did not over-knead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WellConnectedMom"
},
"reviewBody": "Favorite Irish Soda Bread recipe so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennyO2B"
},
"reviewBody": "Wow! This was so easy! Thanks for a great tasting bread! I used my kitchen aid mixer with the dough hook &amp; didn't have to knead at all! So simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "larlarip"
},
"reviewBody": "i replaced milk + vinegar with same amount of fat-free plain yogurt (plus a tiny spoonful more 'cos i think the dough was too dry to stick together completely), and i had made them into 8 small loaves instead of 2 big ones, so i know my version is not the genuine irish soda bread. but it still turned out to be tasty. overall, this recipe is simple, easy, and quick. really worth a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicia"
},
"reviewBody": "Loved this recipe! I had to add a few minutes to the baking time as some others mentioned, but otherwise it was great. The kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NJDiane"
},
"reviewBody": "AWESOME! Easy recipe and so good. I used 1 cup of soaked raisins and 1 scant cup of buttermilk...because I had it on hand . Good thing it made 2, because we gobbled up the first one in no time flat. I will make this again and share with all my friends. Thanks for sharing Nana Dot's delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "panioto"
},
"reviewBody": "This was a great recipe for irish soda bread. I wish it was a little more moist. That was my only complaint but I think that's the nature of soda bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani"
},
"reviewBody": "I have made many recipes from this site and have rated them all, but I have never written a review until now...\n\nThis is the best Irish Soda Bread I have ever had!!\n\nYou will not be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Lyons"
},
"reviewBody": "I made these for my kindergarten classroom last year to celebrate an authentic St. Patrick's day. It was delicious and kid-approved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Menwith Hill'er Back Home !!"
},
"reviewBody": "I could tell this bread was going to be excellent by the beautiful, marshmallow-y feel of the dough!\r\n\r\nI used white flour and all raisins - since I didn't have currants on hand. Also didn't use the caraway seed - we really don't care for them.\r\n\r\nI baked at 400 for 15 minutes, then covered with foil and baked for another 15 minutes at 375.....but at that point - they weren't done - so I baked them uncovered for another 6 minutes... - they still weren't done - so baked, covered for another entire 10 minutes....then were perfect!....must be my oven!\r\n\r\nThe flavor was perfect - not too sweet - not too savory - not too crumbly - if cut with a really sharp steak knife.\r\n\r\nThanks - will always use this recipe!!!!!!!!!!!!!! Yummy-licious!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnChicago"
},
"reviewBody": "A very reliable recipe! I omitted the currants and the caraway seeds. I also added an extra tablespoon of sugar ( a sweet tooth is a major trait in my family). Sometimes I use lemon juice instead of the apple cider vinegar, it adds a very faint lemon taste which my sister really likes. This recipe is definitley a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCFRO"
},
"reviewBody": "I have made this now several times and everyone I share this with absolutely loves it. To cut calories, I use skim milk and sometimes applesauce in place of the butter. Still delicious - just love those family recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niamh Landy"
},
"reviewBody": "Fantastic I made this today and it is lovely very light. Will be adding this to my baking rotation. Thank you Nana Dot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bobbies-girl"
},
"reviewBody": "This bread had a delicious taste but was very crumbly when cut into slices. So we were buttering \"pieces\" rather than a \"slice.\" Maybe that's the nature of the beast, or maybe I did something wrong ... I very rarely bake anything. I'm giving it a 4 only because of the consistency. But the taste was definitely a 5."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lissa Wicked"
},
"reviewBody": "A.M.A.Z.I.N.G. This is very easy to make. It is so yummy that I made 2 loaves for this past St. Patrick's day, and then another 3 loaves since! I love to warm up a slice and spread butter on it. Other than making the 2 tsp of caraway seeds heaping, I don't change a thing. Do not skip the currants or caraway seeds, they help make it delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma Sheila"
},
"reviewBody": "I had given up on finding a great recipe for 'sodie' bread until now. THIS IS THE BEST recipe ever! I did use raw sugar instead of white, added 1/2 tsp vanilla and 1/4 tsp almond extract. Did not have currants and omitted the caraway seed. These round loaves turned out beautifully! ~A big hit! I will make it again for Easter, can't wait to share it! Thanks so much!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KittyKat83"
},
"reviewBody": "Not exactly the Irish soda bread I remember as a kid...I had an Irish friend in school and her mother would always make it, however this is very delicious and easy to make on its own. Currants aren't the easiest thing to find, but I did eventually find them and they are quite delicious in this bread or on their own. This bread also keeps well in the fridge - there was no way I could eat all of it on my own (even when I halved the recipe to get just 1 loaf) however it stayed tasty even after a week had gone by. I will surely make this again in the future :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Fischer"
},
"reviewBody": "This recipe was perfect and absolutely delicious! I used 1C whole wheat flour and 1 1/2C all-purpose flour, but that is the only change I made. I loved the raisins and currants, but the caraway seeds were my favorite part! They add a depth of flavor to this bread that can't be achieved any other way. Please don't leave them out! The texture was perfect, and everyone loved it! This bread will be added to my regular rotation. Thanks for a fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shugaram"
},
"reviewBody": "Huge hit with my family and friends!! The best part is how easy it is and the fact that it's made from things you already have in the kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "paula"
},
"reviewBody": "Not sure what i did wrong but I did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethy"
},
"reviewBody": "Wowwweee! This is just what I was looking for in Irish Soda bread. I've made several others, but they cannot compare to the wonderful crumbly texture of this. I omitted the currants since I didn't have any on hand and used white vinegar instead of the cider. This will become a regular in my house for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wfroment"
},
"reviewBody": "Wow, I used King Arthur Irish Wheat flour, and this tasted like I was back at that little pub I stopped at to eat when I had a stopp over in Dublin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this many times now with raisins and currants, raisins and golden raisins, or Craisins and golden raisins. All delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALIAROLLEY"
},
"reviewBody": "I chose this version of Irish Soda bread because it originated from someones mom. In my opinion those are some of the best tried and true recipes. It was wonderful!!! I did have to bake it a bit longer, about 10 minutes) but over time I'll perfect that part of it too. This recipe is an absolute keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bravessoccer1"
},
"reviewBody": "This soda bread was pretty good. I prefer the bread with sourcream instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "B. Robinson"
},
"reviewBody": "Really good fresh out of the oven. I didn't have caraway seed and subbed raisins for the currants since my hubby doesn't care for currants. I added a 1/2 tsp. of sweet dough flavoring just to see what kind of an effect it would have but would leave it out next time. Overall a great addition to our St. Patty's day meal, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryLou"
},
"reviewBody": "This is the best Irish soda bread recipe!!! I used dried cranberries instead of the currants. Thank you so much for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Hayes Giles"
},
"reviewBody": "This recipe was great! I made this for a St.Patrick's Day party and everyone there loved it. This was the first time I've made Irish soda bread; it reminded me alot of making buttermilk biscuits. My husband said to put it on my \"Make Again\" list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nuonli"
},
"reviewBody": "Excellent! Made it to bring in to work, people kept asking me for my recipe! Quick and easy and tasty. This is going in my permanent recipe book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traveler"
},
"reviewBody": "Made this for a dinner with friends and ate several slices of it before I served them! Yummy! I added dried cherries instead of the currants. Will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bostonminishell"
},
"reviewBody": "FAB-U-LOUS! If you like Irish Soda Bread, this is the bomb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "We loved this with our corned beef and cabbage soup. Couldn't stop eating it. But did need 5 more min to cook. I put foil over it for the last few min so it wouldn't burn outside was done inside needed more time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHEFWARBRICK"
},
"reviewBody": "Made this for St. Patty's - nice texture inside and out. Not dried out at all - and not difficult to make. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emily"
},
"reviewBody": "absolutely amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Marie Sweden"
},
"reviewBody": "My whole family loved the taste of this bread. I also like that you don't have to go out and buy buttermilk just for the recipe. The milk plus vinegar used in the recipe is a perfect substitute. Preparation was fairly simple and we only used raisins (1.5 cups) since that's all we had on hand. As far as baking goes, I found that after just 15 minutes in the oven on 400 the bread was already brown AND crunchy on the outside. So I had to cover it with foil for the remainder of cooking time. And we noticed it was quite crumbly when we cut into it (so on the dry side) but still the taste was delicious! Next time I bake it, will have have to watch it like a hawk to make sure it doesn't brown too much or get too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Springer"
},
"reviewBody": "This is the first time I ever tried to make Irish Soda Bread, but we have some every year, usually store bought. This is THE best soda bread anyone in my family has ever tasted, and my next door neighbor loved the loaf I gave her, too. Didn't use currants, only raisins, simply because no one sells currants around here. Also added 2 teaspoons of cinnamon, and used Splenda instead of sugar. Out of this world good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Yummm..Meeeee!!! I made this for St Patty's day and it was devored by my entire family!!! I left out the raisens and currents b/c my daughter would not have eaten it otherwise. However next time I will make a double batch and put the currants in half and nothing in the other! Super easy!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hollyhocks"
},
"reviewBody": "Very good! I don't care for caraway seeds so I omitted them. I also stirred the vinegar into the milk and let it sit to make a buttermilk (before pouring it in the mix). I've never had Soda bread before but it had the texture just like a scone. It is sweet like a scone too, so if you want more savory, reduce the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iamlvp"
},
"reviewBody": "I've always used a recipe from Epicurious for Irish Soda Bread before trying this one. Now this will be the recipe I use for Irish Soda Bread. The texture and consistency of the bread is wonderful. I didn't have currants so I used cranberries...next time I may try dates as I also have those on hand regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Northern Spie"
},
"reviewBody": "Absolutely perfect. Thank you JerzPixelPusher for sharing this with us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NicoleG"
},
"reviewBody": "Every year on St. Patrick's Day I try to make Irish Soda Bread, and every year I've been disappointed... until I tried this! It's light and buttery. I couldn't care less if it's authentic or not, as long as it tastes good. -Totally ruined my diet when it came out of the oven :)\n\nAlso, I was worried about caraway seeds together with raisens (don't know what a current is), but it works somehow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValMor"
},
"reviewBody": "THis was so easy to make and so tasty. Perfect amount of sweetness from the dried fruit (I only used raisins). As another rater stated the top of mine was very brown after the first 15 minutes so I did tent it with foil for the remaining time. Based on other reviews as well, I left it in the over to about 10 minutes AFTER I the oven off at the specified time just to be sure it cooked all the way through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Lafler"
},
"reviewBody": "I never had Irish Soda Bread before. I decided to make it today. This recipe is great!!! It took minutes to put together and my husband rolled his eyes upon tasting it and said, \"Hmmmm....this is delicious!\" I didn't have currents, but I will definitely get some now...I used caraway seeds and glad I did...Thank you! I will make over and over...."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/161706/nana-dots-irish-soda-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/161706/nana-dots-irish-soda-bread/",
"name": "Nana Dot&#39;s Irish Soda Bread"
}
}
]
}
}
, "about": [
]
}
]