				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Never-Never Ever-Ever Fail Fudge"
,"datePublished": "2020-06-18T23:05:48.000-04:00"
,"dateModified": "2020-06-18T23:05:48.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jackie Boehm"
,"url": "https://www.allrecipes.com/cook/136423"
}
]
,"description": "Evaporated milk and sugar are boiled then combined with marshmallows, chocolate chips, vanilla and walnuts in this easy fudge."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ZwT436PKymgfyuJ1YZnjEsP765g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/861905-154299674e7248a484f0505ee1822ff9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Never-Never Ever-Ever Fail Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "92"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "48 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "23 mg"
,"sugarContent": "8 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.66666668653488 cup evaporated milk",
"1.6666667461395 cups white sugar",
"0.5 teaspoon salt",
"16 large marshmallows",
"1 cup semisweet chocolate chips",
"1 teaspoon vanilla extract",
"0.5 cup chopped walnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium saucepan over medium heat, combine evaporated milk, sugar and salt. Bring to a boil, then remove from heat and stir in marshmallows, chocolate chips, vanilla and nuts until marshmallows are melted. Pour into an 8x8 inch dish. Let cool completely before cutting into squares."
} ]
,"recipeYield": ["64"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "clover"
},
"reviewBody": "I didn't rate this one star because technically my kids will eat anything sweet, but it's really not good. Ignoring the fact that the recipe writer completely forgot the part about stirring the mixture for five minutes after it reaches boiling, there's just so much wrong with this recipe. For starters, the photo shows a nice thick piece of fudge. The recipe itself will make fudge that is maybe half inch tall in an 8 by 8 dish. It's also extremely sweet and overly dry. I have made a lot of candy so I recognized the mistake in the recipe, and I only tried this because I have an overabundance of large marshmallows and wanted to use them up. I assumed the poor reviews were from people who followed the recipe exactly and the fudge didn't set up. I did not realize that even made correctly, it's just crummy fudge.n"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This literally tastes SO bad. I can't even describe the horror of what I tasted! My mouth still feels bad! Don't waste your ingredients on this recipe. If I could rate it 0 stars I would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Piper"
},
"reviewBody": "I did a double batch and it made inch tall pieces in a 9x13 pan, I substituted dark chocolate chips just so it wasn’t too sweet, really like it so far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Benting"
},
"reviewBody": "I've made a lot of fudge recipes over the past 25 years, but they are always hit and miss. I made two batches of this recipe today, and both came out perfect.\n\nLike others, I would clarify or add two notes to the recipe:\n\n1. Heat the liquid on High to bring it to a \"rolling\" boil so the entire surface of the liquid is boiling/foaming, while stirring occasionally. Don't go to the next step until the entire surface is boiling/foaming. It will foam so much that it looks doubled in size.\n2. Once you're there, turn it down to Medium or half heat, or as low as one quarter heat, just so it keeps up the rolling boil, but doesn't foam more than the previous step. Then you need to keep that boiling/foaming going for 5 minutes, no more, no less, all while constantly stirring.\n\nOnce you do those two steps, you continue the recipe and this fudge will be perfect every single time. #1 above is common for candy recipes like this, so many people assume you already know this, but most people don't. I think that's why a lot of people fail on this recipe. Some candy recipes also go so far as having you drop a drop of the liquid in cold water to test if it holds together before stopping the boiling, but 5 minutes should be perfect.\n\nThis recipe was so great, it was setting/hardening as soon as I poured it. Then I just put it on the stove with the fan on high to vent most of the heat, and when it's no longer burning hot, put it in the freezer for 30 minutes and you're good to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Endersby"
},
"reviewBody": "Great fudge"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colorado Sunshine"
},
"reviewBody": "I love that this is a tasty and easy recipe to make. It did not take long either which is a bonus! I think that it will be a Christmas staple in our home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adena Thatcher"
},
"reviewBody": "used Swerve granular sugar substitute and it worked just fine. I did added a little extra sugar and evaporated milk to get the right consistence before It began to boil. do not boil more than 5 minutes while stirring constantly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RKS"
},
"reviewBody": "Tasty and easy to make! I will do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bailey Marie"
},
"reviewBody": "Great recipe! I made it without nuts and it came out beautifully! Texture was nice, but it's sweeter than I like. Next time I will try to use a darker or higher quality chocolate rather than the semisweet chips. I used 190 mini marshmallows per a comment on here"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kmjeffreys"
},
"reviewBody": "I made this. Great taste but did not set up. The recipe says only bring to a boil but I suspect it needs to boil for a few minutes, not just come to a boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Columbier"
},
"reviewBody": "It started to set up in the saucepan, seems to be fine. This stuff is absolutely delicious, hubby and I have overindulged. It was so easy to make, so creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VKARLSBROTEN"
},
"reviewBody": "Mine got hard. I think my marshmallows may have not been the freshest and I just dumped in the chips. Probably should have poured them in slowly and stirred. Not too impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie369"
},
"reviewBody": "The first time I made this it did not turn out well - way too gooey and did not set even after sitting in the refrigerator overnight. Knowing it must have been a cooking error, I looked at the reviews and found out immediately what the problem was: boiling time! After addressing this issue, I have since made several wonderful batches. The fudge is a family favorite!\n\nWhat an interesting lesson in cooking chemistry! Making mistakes can be great fun as it gives one a chance to learn more about the magic of cooking!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gary W"
},
"reviewBody": "Works every time for me. I add a tablespoon of cocoa (after cooking) to make it a little less sweet. It reminds me of my Grandma's \"real\" cooked fudge.\n\nI have tried making \"real\" fudge (as made by my grandmother) cooked with butter, needing a candy thermometer, beating it 'till the mixture turns, etc., many timesand have never succeeded. This fudge is very good, almost but not quite as good as Grandma's. So it gets 4 stars. It's the best I can make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karen Burbidge"
},
"reviewBody": "Followed the recipe to the letter, it didn't set up. When I went back to your web site, then it says to boil for 5 min. You should write it in the directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "I have never made fudge before. The first time I made it, I failed miserably. But I'm persistent. The second time I had success. The only thing I did different was used EVAPORATED milk . The first time I used Condensed milk. It turned into the thick blob and was very hard to stir. So for first timers please use evaporated milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JudiG"
},
"reviewBody": "I wanted to use mini peppermint marshmallows but couldn't find an equivalent to regular marshmallows so I winged it and used 2 cups of mini's. Worked fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "maureen"
},
"reviewBody": "I made this for my first time making fudge, and like others found it didn't set! After reading all reviews it needed the 5 minutes boiling with constantly stirring which I didn't do, I'll try again. Should I be pouring it into a greased or ungreased pan?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daragh"
},
"reviewBody": "Love it and have made it for decades since I was a kid under the name \"Fudge a la Lewis\" after Mrs. Lewis, who was our \"adopted granny\" since we didn't have any on the continent we lived on. (Though she was a rather strict English granny). The thing missing from this version is that you must keep it on the boil 5 minutes and stir all the time!!!!!!!!!\nOnce you have the hang of it you can add all sorts of bits and pieces to it - just do it quickly when you stir them in right at the end after you lift it off the heat. A nice heavy pot helps, too.I made a batch and sprinkled \"skor candy bits\" on top and brought it to work today and EVERYONE LOVED IT!!!!! (cut it up small so even some of the exercisers and dieters chose to try a bit)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwyneth"
},
"reviewBody": "This was really hard to cut. I put it in the freezer until it was firm enough to cut. Other than that, this was amazing. This is more of a frosting than a fudge. I think that if this is added on top of a vanilla cupcake than it was taste delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marion Husler"
},
"reviewBody": "It is important to simmer the fudge for 5 minutes.\nOtherwise, this recipe worked perfectly!\nIt is very forgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Scarbrough"
},
"reviewBody": "I think the mistake that people are making is accidentally substituting condensed milk for the evaporated milk, which will completely ruin the fudge. (It will likely resemble a lava like substance with the condensed milk and the sugar will not dissolve) I hope this is helpful for all those that are frustrated! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzyque"
},
"reviewBody": "I did something wrong. It all went well until I started to pour it out of the pot. It was so stiff that I could hardly get it out. My only thought is that I let it boil too fast. It was at a rolling boil for exactly five minutes. I read the comments that indicated to let it boil for five minutes. Any ideas on what could have made it so stiff. It is much harder than it should be and looks pretty bad. I hate to rate it badly as it is my fault, I'm sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Deneumoustier"
},
"reviewBody": "Very easy and taste great to..Never failed with this recipe. It set almost immediately. Thank You"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I froze this for about a month and it was still amazing. I wanted to make Christmas presents well before finals &amp; added various sweets to the bottom, but no walnuts. I also followed the 5 minutes all of the reviews were calling for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoNell"
},
"reviewBody": "I had some marshmallows leftover from a camping trip that I didn't want to go to waste, so I searched and found this recipe. I didn't have evaporated milk on hand but found a recipe substitution online using 2/3 cup non-fat dry milk mixed with 3/4 cup water. I used it in place of evaporated milk and boiled stirring continuously for five minutes. The fudge came out perfect. It's a little soft but I haven't put it I the refrigerator yet. I will use this recipe again in the future. Thanks for posting it SUNKATTT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anola"
},
"reviewBody": "This is by far the fastest and easiest fudge recipe ever thank you so much for sharing. I had several bags of marshmellows left over from Halloween (popcorn balls), so I had to find something to do with them and came across this recipe and so glad I did. I will never ever make fudge the way my mother and grandmother did again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abby"
},
"reviewBody": "I am giving this recipe 4 stars because it is great tasting fudge. However, I would have given it 5 stars if it had better instructions. The mixture has to be boiled for exactly 5 minutes, stirring with a wisk constantly, and then QUICKLY combined with additional ingredients. Honestly, if my husband hadn't been here to take over the stirring at the last stage, I would have thrown a globby mess in the trash, just like some of the other reviewers. The trick is to get it stirred together quickly and completely before it begins to set. It takes a strong arm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flashsmith"
},
"reviewBody": "This is the best fudge I have ever made! I slowly brought it to a boil and when it started boiling I turned it down so it still boiled but slowly for 5 minutes. Stirred the whole time with a whisk. It is so creamy and smooth we can't stop snacking on it! It set up perfectly. really delicious!! It doesn't have that over powering taste of marshmallow cream. I like that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Georgia Wood"
},
"reviewBody": "I would definitely use the equivilent of mini marshmallows or cut the large ones into pieces. I just finished making this for the first time and had to stir until my arm almost fell off before the marshmallows melted. It has not cooled yet, so I can't say what the outcome will be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Debi"
},
"reviewBody": "I failed at making this never never ever ever fail fudge ! I have a wonderful pan full of gooey syrup !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Early"
},
"reviewBody": "I've never made fudge before, and I've made this twice now with perfect results. My kids love it and of course, so does my husband. I following all the tricks of the reviewers which gave me the confidence to try this. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marge"
},
"reviewBody": "This fudge was easy to prepare, fast and really delicious. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha Bell-Sobotor"
},
"reviewBody": "Just made this for the first time, it's currently in my fridge setting. I boiled the first part for 5 minutes while whisking then took it off the heat and mixed everything into it. Only part I didn't like was the 5 minutes of making sure it didn't burn. Other than that it taste great. Can't wait for it to set!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny_Mac"
},
"reviewBody": "Sounds very good -- except for one thing, and this is just MY taste talking here: if you out walnuts in this fudge, you will ruin it. (I had an unfortunate experience with walnuts when I was young!) I would expect that one could use almost any kind of chopped nuts (hazelnuts, filberts, cashews, peanuts, macadamia nuts, almonds) and wind up with a very tasty fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn Roemen"
},
"reviewBody": "I was given this recipe 50 years ago and it is still my favorite fudge. It was the 1st thing I learned to make on my own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maralina"
},
"reviewBody": "This turned out good! I almost missed the 5 minute boil/stir but caught it in time. I will say though that stirring 16 marshmallows is a good test of your arm endurance! Ouch! You would think this would be cloyingly sweet but instead, tasted like fudge! I feel like such a cheater making it this way but highly suggest giving it a try. Not sure about those that rated it 1-star and says it failed because this is really easy with very few ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sweetserenade"
},
"reviewBody": "I've made this recipe about 20 times and each time you need to tweak it a little bit. It is a great base fudge recipe that you will be able to customize your ingredients depending on flavor and or additions such as nuts and/or chips etc ...The other recipes that use condensed milk are really not fudge ... if you like the taste then fine, but fudge is the melting of sugar and cream or evaporated milk and melted chocolate with a marshmallow creme or even marshmallows. The fudge makers of the candy world use Mazetta and invertase, but that is going too far for such a simple fun snack. Enjoy and be bold, experiment!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marydotes"
},
"reviewBody": "Thank you for posting!! I lost this recipe almost 10 years ago and my kids never forgave me as nothing compared! They love me again!! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "very good basic fudge recipe. boiled and stirred 5 mins. turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathrynewalker"
},
"reviewBody": "very good basic fudge recipe. boiled and stirred 5 mins. turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eabgab"
},
"reviewBody": "I used this recipe tonight, but I used the alternate recipe provided by the second commenter which used mini-marshmallows and a bit more sugar. Also I stirred for 5 mins constantly while it was boiling and it worked perfectly! I never thought I would be able to make fudge! I don't have a candy thermometer so I just didn't think I would be able to but this was soooo easy! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdamShuchter"
},
"reviewBody": "Loved it! Sent it as Christmas gifts last year. I didn't have any problems with it being grainy. I think the key really is being patient and letting it cook long enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clebby"
},
"reviewBody": "Ver easy and delicious! I also tried it with DARK chocolate chips and coconut flavoring and a bit of coconut stirred in at the end. Easiest fudge I ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Zard"
},
"reviewBody": "Personally suffering from Fugdicus failiarus, I've never been able to make fudge, which is particularly embarassing because I'm a pastry chef - that is until now! What a fantastic, easy recipe! Thanks! (Stirring for five minutes is, in fact, the trick)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "willrock2002"
},
"reviewBody": "I Brought it to a boil and let it boil 5 minutes while i stirred it to keep it from burning , but it still is like just thick frosting. I did not care for this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lvchrstnabkr"
},
"reviewBody": "very easy to follow, and turned out GREAT! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Wanda"
},
"reviewBody": "I read the reviews and alterations, thought I would give it a try, but evidently I should've used my tried and true 5 minute fudge recipe. These didn't fully set so now I have 2 pans of delicious tasty chocolate \"smudge\"...will have to look for a use for it as I do not have much time for holiday baking and now I have one less item to take with me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Redvixen"
},
"reviewBody": "This did not set at all,the only thing I did diffrent was use mini marshmellows...Put in the fridge over night and still nothing looks like a pan of mudd :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jujue"
},
"reviewBody": "This was very easy. I read the reviews first...maybe that helped. This is my second attempt at making fudge (1st attempt -someone else's recipe which did not set) and I stirred like crazy. You must keep stirring until it feels like your arm will fall off. I found that while the saucepan was off the heat and I was stirring in the marshmellows it was starting to set. I guess the temperature in the room had something to do with it. So I put it back on the stove (did not turn the heat on) to ensure that all the marshmellows melted. So far so good, just waiting for it to cool completely so I can cut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "HillaryAnne"
},
"reviewBody": "I tried twice and looked at the reviews before hand. I just don't know what I did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glal6909"
},
"reviewBody": "Constant stirring duriong boil and used quality choclate chips and macadamia nuts! This is very good and not such a huge amount result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "Very easy to make and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teri Beall Mercer"
},
"reviewBody": "failed for me. taste good though, tried to savage it into truffles or something. would be best used for drizzle icing I guess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nora"
},
"reviewBody": "When I made the fudge it came out to hard, so me and my friend melted it and covered apples with the melted fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kicius"
},
"reviewBody": "This recipe failed me miserably... The fudge didn't harden at all and I wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarsprite"
},
"reviewBody": "this recipe does require prep. It has been in my family for many generations also. Along with prep and timing try lowering the temp. to low so that you don't scorch or burn the cream mixture. I work for a Large candy company that shall remain nameless and our motto is you have to have patience to make anything good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cat's Recipes"
},
"reviewBody": "Failed!! My bad I didn't read what others said first. My fudge turned out very grainy because I didn't follow the 5 minute boil requirement. Otherwise it would have been really good. Very creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "misty"
},
"reviewBody": "this recipe was great it was very easy the fudge tasted like ordinary fudge i was hoping for something a little more but this was wonderful anyway. a tip is that if you cut the marshmallows into fours then they are easier to melt and your fudge doesn't cool to much before you put it in the pan to cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary"
},
"reviewBody": "I just made this fudge and it turned out great. I followed the advice and cooked it for 5 min. Bring to a boil - turne down to med-high heat and boil while stirring constantly for 5 min. Remove from heat. I used 2 cups of small marshmallows and stirred them in first then added the choc chips. Poured it directly into a buttered 9\" pie place and let cool - put in refrigerator. It set up perfectly. I do think the trick is to cook it for 5 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RecipeRenegade"
},
"reviewBody": "I decided to give this another try, and I actually ended up with fudge that set up. As long as I leave it in the fridge, it stays set up. The milk/sugar mixture began to scald/burn before it boiled, but since the sugar was totally dissolved, that's when I took it off the heat and added the marshmallows. I'll probably use this recipe again. My first attempt ended up tasting good, although it did not set. I had it in the refrigerator overnight, and then in the freezer for awhile. It was a Christmas gift for my brother-in-law, and I only had one shot, so I thought never ever fail fudge would be the recipe to make. Mine failed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Marie"
},
"reviewBody": "if you cant make this recipe then you cant cook... its to easy... if it does not work for you then you did not get it to the right temp. if it does not set for you then you did not get it hot enough...dont blame the recipe because you dont know what your doing... this is a great recipe and so very easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "yvetteski"
},
"reviewBody": "I had no problems with this recipe. This fudge set up well, but it is on the softer side. I followed the advice of other reviewers and boiled and stirred for a full 5 minutes. I cut each marshmallows in fourths to increase speed. I also had everything ready when I began- nut chopped, chips measured, etc. For a candy this isn't a really hard recipe. (I didn't have to break out the candy thermometer!)\n\nMy only complaints are that the fudge is a bit too sweet for my taste and it isn't as creamy as some of my previous attempts. It is also annoying that I have a cup of leftover evaporated milk! When I asked my daughter to try it and give an opinion she asked if it was made with instant cocoa mix as she thought that it tasted like Swiss Miss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "THOM79"
},
"reviewBody": "Delicious! The only problem was it didn't make too many squares. I think next time I'll double or triple the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "donnasue"
},
"reviewBody": "I have tried this for 3rd. time, just now saw the reviews for cooking time, bringing to boil is NOT cooking for 5 minutes! I copied this on 12-01-08 , so just now seeing the reviews. My question, can I redo it , recook it to salvage it? ingredients are expensive! help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jamie Schultze"
},
"reviewBody": "this fudge didn't turn out it was gritty and never set up so it could be cut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BOILERMISH"
},
"reviewBody": "I don't know how you could name this Never-Never Ever-Ever fail fudge, because it's failed me twice. The first time I blamed the chips, I used milk/peanut butter mix and only a full bag (so 1 3/4 cup instead of a full 2 cups). Today I used a full 2 cups of semisweet and it doesn't appear to be setting up right again, 3 hours after the fact it still appears soft. In reading the reviews (I didn't before attempting this since it had high stars) it appears you are missing directions? Isn't that what Allrecipes reviews it for? If there is a specific time the fudge needs to be boiled it would be nice if someone would SPECIFY IT. I'm putting the fudge in the fridge in hopes I didn't waste all that chocolate (I made a double batch for a large group) and won't have to buy something to take instead. If it doesn't set this will be the last time I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Taylor S."
},
"reviewBody": "This fudge isn't nearly as good as i thought it would be. The taste was good but the texture was very, very gritty. It doesn't compare to Ocean City NJ's boardwalk fudge at all. I don't think that I will be making this fudge again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "I wish that I had read the reviews before making this fudge. I tried the recipe twice. I thought the flavor was good but the fudge didn't set up properly. Of course, I followed the recipe to the letter. Now I read that you have to boil and stir for 5 minutes! There should be a change made to the recipe published on this site. I think I will try a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "THEPRINCESS"
},
"reviewBody": "This was a pretty good fudge recipe. I will stick to using the marshmallow cream recipe though. It is much creamier. This dries out if left in the refridgerator, and I have never had that problem with fudge. But Does taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Goldy in Alabama"
},
"reviewBody": "I use a similar recipe with the following slight differences: 1 3/4 cups sugar, dash of salt, 2 1/4 cups of mini marshallows (melt much easier), and 1 1/2 cups of chocolate chips. Boiling for five minutes and stirring constantly is very important. I add the nuts and vanilla after the chocoate and marshmallows are melted. I've had trouble with fudge in the past, so I was thrilled to find an easier way to make it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Boehm"
},
"reviewBody": "I have just made this fudge for the kajillionth time &amp; I still have never had a failure. I'm puzzled by the high failure rate. Altho I was VERY remiss in not specifying the FIVE min. boil &amp; stir. Tx to those who caught that. Todays batch is gift worthy. Good luck to all. Sincerely, Jackie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Stir while boiling for 5 min!!!(very important)and constantly stir!!! I would use mini marshmallows, because they disslove easier(about 192 mini ones equal 16 large ones). I only used 3 large ones and they rest where mini, and it took for ever to get the 3 large ones to disslove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought this recipe was easy and the fudge was delicious. I also made it using one cup of peanut butter in place of the chocolate chips and it turned out wonderfully. I do suggest you let the marshmallows melt before adding in the choc chips and vanilla for best results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have to say when I made this recipe I didn't know you needed to boil the milk, sugar, and salt 5 mins,and I don't think mine boiled for that long. I brought mine to a rolling boil and then removed it from the heat. The only thing I did different from the recipe was I added the marshmallows in first and stirred them until completely melted before adding the chocolate and vanilla. The marshmallows are part of what prevents the sugar from making the fudge grainy. Also, always use a top of the line sugar, such as Domino's brand. Cheap brands, or store brands have a more course grain. Mine turned out great, chocolatey and smooth. I prefer a softer fudge, so this one was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MOMMYCHERYL"
},
"reviewBody": "OK, I tried this twide. It never set up right (better the second time but how many tries is it gonna take??!!) The flavor is great, but it's just a gooey mess. I boiled 5 minutes. The first time, I think I boiled too long or hard. Hmm. I'm very disappointed. I used to make fudge with marshmallow cream that turned out great. But my son is allergic to eggs, so I have to use a recipe with actual marshmallows -- I'd hoped it would work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Hall-Leggett"
},
"reviewBody": "very good fudge, take the advice of an other member and remember to stir for 5 minutes of boiling and I let mine cool in the fridge. I did not use the nuts and they are amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fluffernutter"
},
"reviewBody": "I think this recipe is great, it is easy to make and it tastes good. If you are a chocolate lover like myself and want a quick no fail fudge this is truely it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADORABELLA"
},
"reviewBody": "The key that is missing here is in the preparation. This particular recipe has been in my own family for generations, and it has never failed - providing you follow these particular directions: any seasoned fudge maker will realise those first three ingrediants in the saucepan need to be boiled about five minutes - but no more - and no less. The preparation instructions fail to mention how long it must be boiled. Five minutes is the key. \r\nWhen we allow this fudge to set in our household, we usually refridgerate it until set. Once it has set about an hour or a bit longer, I wouldn't keep it in the fridge permanantly, as it can get hard as a rock if left too long, although some members of my family have left it there and had no major trouble. If you like firmer fudge, leave in the fridge. If you like softer, allow it to set, and then take it out.\r\nGood luck.\r\n*Also, please do not forget, while it is boiling for those five minutes, do not stop stirring!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CLOVERDALE1"
},
"reviewBody": "NEVER AGAIN. I THOUGHT I COULD MAKE THIS WORK EVEN AFTER READING THE OTHER REVIEWS NOT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JARMGFDE"
},
"reviewBody": "If this is your idea of no fail fudge guess again. I tried this twice and both times I followed your instructions to the letter and it FAILED! This fudge is no worth trying out. It tasts terrible, wont set and dont even resemble fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beverly S Ahrens"
},
"reviewBody": "This never-never fail fudge failed. It tastes great, but didn't get firm. Very very soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Terrible fudge!I thought I'd try this to see if I could make a quick batch of fudge, rather than making the traditional beaten stuff. Luckily I have lots of experience with candy. Even after salvaging this (I boiled it again with some extra milk), it is still grainy and tastes pretty bad. Do not use this recipe! My first bad experience on this web site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipes was far too chocolatey, and it didn't set, although I used vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful recipe. I made for the holidays and it turned out a big hit!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24948/never-never-ever-ever-fail-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
"name": "Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
"name": "Nut Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24948/never-never-ever-ever-fail-fudge/",
"name": "Never-Never Ever-Ever Fail Fudge"
}
}
]
}
}
, "about": [
]
}
]