				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "New England Crab Cakes"
,"datePublished": "2000-06-15T12:18:28.000-04:00"
,"dateModified": "2022-07-14T16:28:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jenna T"
,"url": "https://www.allrecipes.com/cook/24324168"
}
]
,"description": "This recipe comes from Maine and is EXCELLENT! These cakes are so yummy they almost melt in your mouth! They&#39;re great served with a seafood pasta salad, boiled potatoes, or fresh steamed veggies."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/mSkc0li89CU3Ry7nmMgm-TDc8OM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1454430-8834968b1f684086a7e4572c256f437b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "New England Crab Cakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "119"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "452 kcal"
,"carbohydrateContent": "27 g"
,"cholesterolContent": "172 mg"
,"fiberContent": "2 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1277 mg"
,"sugarContent": "2 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 pound crabmeat",
"0.5 cup dry bread crumbs",
"1 egg, beaten",
"1 tablespoon mayonnaise",
"1 teaspoon prepared Dijon-style mustard",
"1 teaspoon Worcestershire sauce",
"1 tablespoon Old Bay Seasoning TM",
"2 tablespoons butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium size bowl, combine the bread crumbs and the crab meat. Stir the beaten egg, mayonnaise, mustard, Worcestershire and Old Bay Seasoning. Lightly mix these ingredients being careful not to overwork the crab meat. Form into 8 round, flat crab cakes."
} ,{
"@type": "HowToStep"
,"text": "Heat butter in a skillet over medium heat. Fry the cakes on each side until crusty and golden brown. Serve warm."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayosan"
},
"reviewBody": "I was making Parmesan baked potatoes to go along with the crab cakes and I had cheese left over. So, I added 1/4 cup of freshly shredded Parmesan cheese. I was concerned because they were on wet side I was worried about them falling apart when frying. Therefore, I rolled the cakes into balls and rolled them into a mixture of grated Parmesan cheese and fresh grounded pepper to taste. I didn't want to spend my afternoon cleaning the top of the stove after frying the crab cakes. I placed rolled crab balls on a cookie sheet sprayed them lightly with butter flavored Pam. Then baked at 350 till golden brown. Forming the balls and rolling them in the cheese was an experiment, So I rolled half in the cheese the rest I just rolled and place on cookie sheet. The cheese complimented the crab without over powering them. I will never fry my crab cakes again it's less messy to bake them. Spraying them lightly with the Pam. One can make the crab balls as big or small as desired. My yield is usually 28 balls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Forrest"
},
"reviewBody": "These turned out awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Don't have Old Bay Seasoning so omitted. Made with sumuri. Very tasty and enjoyable"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "COLE01"
},
"reviewBody": "Too salty. Cut the Old Bay by at least half and add spices to make up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori S"
},
"reviewBody": "Exceptionally easy recipe. I have never made crab cakes before and these were really good. I did not have old bay, so I made homemade and it was quite tasty for sure! I used a bit less of the seasoning as I wanted to taste the crab flavor. I will make these again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don C"
},
"reviewBody": "Made with fresh Dungeness crab. This is one of the easiest crab cake recipes I've ever come across. They came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amywcisel"
},
"reviewBody": "Great recipe overall however, I found myself needing to add a little extra seasoning here and there. In general, the crab cakes were very good and my husband definitely enjoyed them along with some lemon aioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rob Ferguson"
},
"reviewBody": "While my daughter loved the crab cakes and said this recipe was a \"Keeper\", I thought the amount of Old Bay was too much. I used fresh crab and would have liked the spice to enhance the crab flavor but for me it overwhelmed it. I will try it again with about 1/2 the Old Bay as called for and add a bit of fresh lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anthony Pegues"
},
"reviewBody": "Made them twice, 1st time, just as the recipe called for...Too much bread, not enough Crab, Bland. Old Bay Seasoning is the key along with another 6oz of crab(1 can) and a touch of Cayenne for a little zip, add some dill to the Aioli and it's a hit!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ncpruitt"
},
"reviewBody": "A little too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phil"
},
"reviewBody": "I come from Cape Cod later moved to Rhode Island and this is almost the same as how we make them, but we always used finely crushed salt free Saltine crackers or oyster crackers in place of the bread crumbs and the Mayo was always 1/4 cup per 1lb of crab meat. I also go easier on the Old Bay Seasoning as 1 tablespoon is pretty overpowering to some. We always served them plain, no tartar sauce, although lots of folks like that. We also had plenty of Franks \"Red Hot\" sauce and cut up lemon wedges, I like mine cold or at least room temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niq"
},
"reviewBody": "I made this tonight for my 11 year wedding anniversary dinner and we loved it! It just might be the best crab cakes I've yet to taste and will definitely make again.\nI had 8 oz of fresh Dungeness leg meat so used just 1/4 Panko bread crumbs but kept the egg, mayo &amp; seasoning amounts the same as listed and let the formed patties sit in the fridge for one hour and pressed some more panko crumbs into the top (just the one side) before frying in duck fat (left over from another dinner, yummmm!) and served with a salad and a batch of the \"easy aoli\" along with ranch and tarter sauce.... it was so soooo delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Goff"
},
"reviewBody": "really easy to put together, a little too much Old Bay for my liking but however, my oldest and my husband ate all but the one I hade. I used a large ice cream size scooper and it made a total of 7 1/2, I ate the half during the morning when I was forming them as a test run. ;-) I could see using less Old Bay and some fresh dill, green onions and pimentos in it the next time. But I can see making these again. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia Patterson-Brennan"
},
"reviewBody": "Taste great! Really easy to make and even pleases the toughest palette."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowflake"
},
"reviewBody": "These came out very well &amp; I've made this recipe many times. The first time I made it, I used refrigerated crab from the seafood counter that was very expensive, like $12 lb. After that I started using canned crab (found near the cans of tuna) &amp; it was much, much better. I make this as written &amp; serve with tarter sauce on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Hudson"
},
"reviewBody": "Super easy and quick. I used half flaked albacore tuna and half canned lump crab meat. Added red bell pepper, onion flakes and used Ritz cracker for the bread crumbs. I also added Panko bread crumbs to the mix and sprinkled some on the patties just before frying. I did add a tad bit more Old Bay seasoning because I really like the taste. They were perfect, very moist. I think the Panko is the secret. Will definitely make again. Corn on cob goes great with them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettysbear"
},
"reviewBody": "Made these yesterday and they were awesome !!!! Definitely a keeper recipe thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CFisher"
},
"reviewBody": "Very tasty, and much simpler to make than I expected. Kids gave me 100 \"Top Chef\" points for this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mkivar68"
},
"reviewBody": "I think the old bay was a little too strong, but ok otherwise. Wasn't a huge hit with my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RachelM"
},
"reviewBody": "Best crab cakes I've ever had! Simple enough that you could really appreciate the crab. I dipped them in panko bread crumbs before frying and the outside was perfectly crispy with great crab flavor inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nrsejessica"
},
"reviewBody": "Soooo good, Im already craving them again!! I added some lemon juice &amp; parm cheese &amp; then formed into cakes &amp; rolled in panko breadcrumbs. That gave it an extra yummy crunch!! So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisamarie"
},
"reviewBody": "These were okay, I wouldn't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MARYLAUREN"
},
"reviewBody": "This my first effort making crabcakes &amp; I followed this recipe as written. I found the crabcakes to be a little bit dry and the Dijon and Old Bay flavors overwhelmed the delicate taste of the crab. I was hoping for more seafood taste. (Used canned crab)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luisa"
},
"reviewBody": "These were great!!! I followed the recipe but did not pan fry. I brushed the top of each cake with melted butter and than cooked them in a 375 degree oven for a total of 16 minutes. So good......thank you Jenna for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie"
},
"reviewBody": "Easy as ever to make and they were delicious! My family loved them. I served them with Remoulade sauce for dipping and they were the Best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "*****, even though this recipe I altered this recipe a bit. This is an amazingly easy, delicious recipe. No worchestshire on hand, so intead used freshly grated parmigiana cheese, fresh lemon juice and hot sauce - the entire family loved the outcome, and that's saying alot (hard to pleaese 5 different taste palates). Will make this again, once son brings home more crab! Hahaha Thank you for sharing this recipe and for making me feel so confident."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "obxnut"
},
"reviewBody": "These crab cakes are as good as it gets. I have several other recipes for crab cakes that are more time consuming to prepare with ingredients that are not necessary. The only change I made was to use 1 tsp. dry mustard instead of dijon and combination butter and canola oil to saute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fortheloveoffood"
},
"reviewBody": "Very good and easy to prepare"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "droach3"
},
"reviewBody": "Absolutely Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinCarrie"
},
"reviewBody": "Delicious! I took the advice of some of the other reviewers and added a little green onion and some Parmesan cheese. Other than that, I followed the directions exactly, and they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Kelley"
},
"reviewBody": "One of the best home made crab cakes I've had. I'm not suggesting it needs any changes, but I made two for different reasons. First, I had no worcestershire sauce so I used a teas of teryaki sauce. This gave it a slight ginger flavor and worked well with the second change: I added some chopped peppers and onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ksosbee"
},
"reviewBody": "Delicious! I've made these twice and received rave reviews both times. My husband loves them! The first time I served them with a dill sauce, the second time with chipotle aioli - much better the second time around! Plus, the second time I used 2 eggs instead of 1 and they stayed together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRLMCOBB"
},
"reviewBody": "I had left over crab from a family crab pickin' and made these last night. This was the first time I have ever made crab cakes at home and they were FABULOUS! I followed the recipe exactly and couldn't have had better at a restaurant. I served them with a dip on the side made with plain yogurt, lemon juice, horseradish, dill, and a little salt. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Carter"
},
"reviewBody": "I tweaked this a little and it ended up being the BEST recipe result I have had! I used 3/4 C bread crumbs (unseasoned wheat bread), 2 tsp Old Bay, then added 1 stalk of celery chopped in small bits, and 1 green onion chopped the same. I used olive oil in the pan to brown these babies after I squished them really well into 6 patties so they didn't fall apart. I made a sauce of lemon juice, plain yogurt, hot sauce and garlic powder for accompanying these awesome cakes. OMG Yummy!!! This is how crab cakes should look and taste!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingrid Alma"
},
"reviewBody": "My first attempt at crab cakes and WOWZER! I am a new crab-fan and this is so great and so easy. A couple of tips I read that really help. 1) If you rinse the crab first, be sure to let it drain WELL before using. 2) Form into a ball first and place this in the frying pan. After it is brown, flip then flatten. These were excellent and will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scarlette"
},
"reviewBody": "Tasty! Next time Ill follow the direcionts exactly- I left out the mayo and I felt I was missing texture and my cakes were having a hard time sticking together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martha"
},
"reviewBody": "Imitation crab meat is too dry in this recipe.....add chopped green onions, creamed corn, add an extra egg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fat-casey"
},
"reviewBody": "they were the best--i added some green onion...had them for a special lunch....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "a Cook who Can't"
},
"reviewBody": "Neither my husband nor I enjoyed these. Still looking for a great crab crake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssh"
},
"reviewBody": "great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "personalchef"
},
"reviewBody": "I liked this recipe because it is about the crab and not about adding pretty fillers and such that distract from the crab flavor. I used crushed Ritz crackers instead of bread crumbs, but otherwise followed the recipe exactly. I recommend refrigerating the pressed crab cakes for an hour before pan frying. The secret to pan frying is to resist the temptation to move the crab cake around after initially set it in the hot skillet. I let the crab cake brown before turning; each cake held together nicely and did not break apart. I held the crab cakes in the oven on low heat until served up with a simple lemon dill sauce on the side. The crab cakes were rich, moist &amp; flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "20747"
},
"reviewBody": "Great recipe, but I changed the recipe to baking the crabcakes and omitting the bread crumbs. Simply delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "These are wonderful. I did make a few changes. I added diced peppers and onions. I used Italian bread crumbs. I doubled the recipe and added 3 eggs instead of 2. I also added a little more old bay! They were yummy! Made 12 cakes! Hubby said I should have added celery. He puts celery in his when he makes them....I forgot! They are good with celery!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karin"
},
"reviewBody": "I refrigerated mixture for about one hour before forming patties (so they would hold together better) They came out really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayde"
},
"reviewBody": "I was in a panic because I had to come up with a recipe for crab cakes in a very short amount of time, so I was so excited when I saw that I already had everything in my fridge and pantry in this recipe. Super convenient and very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "66062"
},
"reviewBody": "added diced green onions and red bell pepper in the mix. Dipped them into panko bread crumbs to ad crunch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "txvtchick"
},
"reviewBody": "This is a delicious recipe and takes maybe a half hour to prepare, tops. I brushed the cakes with olive oil and broiled them instead of frying. Also refrigerated them for a bit before cooking to ensure they would not crumble when I flipped them over in the oven. Other than that, I followed the recipe exactly and they came out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foldmeinthirds"
},
"reviewBody": "I used this recipe for my first attempt at making crab cakes. I'm from Maryland and have had my fair share of crabs and crab cakes... this recipe is great. It's simple and easy to make, yet delicious. Note: I did not have dijon mustard, so I substituted with honey dijon teriyaki sauce. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Star29"
},
"reviewBody": "Very delicious. Especially with a homemade chipotle sauce over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karolyns Korner"
},
"reviewBody": "This recipe was VERY easy and QUICK. I served it as an appetizer for a dinner party that I was having. I altered it a little. I added about 1/4 tsp of fresh lemon juice and I broiled the crab cakes instead of frying them. They were just perfect. I served them with a side of chipolte dipping sauce - YUMMY!! Can't wait to make this recipe again!! Everyone just loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derdre"
},
"reviewBody": "There awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Skinny Cooks Ain't Bad"
},
"reviewBody": "Pretty good. I didn't have dijon mustard (my surprise when I just left the grocery store) so I used regular mustard. My husband can't stand mayonnaise so I always substitute with sourcream (works pretty well). With all things considered we thought these crab cakes were rather tasty. Oh, I also broiled them instead of frying. Sprayed my cookie sheet with butter flavored cooking spray."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmy Cruzado"
},
"reviewBody": "So easy and tasty. I had all the ingredients and made them in no time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChefNan"
},
"reviewBody": "They were good. I added some finely diced sweet onion to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "firefly443"
},
"reviewBody": "We substituted Townhouse crackers for the breadcrumbs. For our first time making crab cakes they were very good. Although not as good as our favorite restaurant (best crab cakes in Maryland) we will be making this again. For the person that thought they weren't flat enough, you should be able to make them as flat or as round as you like when you shape the cakes. They are not going to flatten more when you cook them. They will also hold together better if you refrigerate the cakes before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "I didnt like the way them came out, not flattened out enough. Not sure I would try them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CRUISEM"
},
"reviewBody": "Perfect ~ I followed the recipe as written and they are not only easy to make but delish!! For those who opted to leave out the Old Bay and then leave a lesser rating ... there really is no substitution for Old Bay. If you are going to make crab cakes you really want to include it. I used a whole grain dijon mustard and Mmmmm, Perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Griffin-Capstack"
},
"reviewBody": "Delicious and so easy to make! I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LESLIE30"
},
"reviewBody": "these crab cakes are good but i thought the old bay seasoning tasted a bit strong. i served these for a new year's surf &amp; turf dinner (also making the yummy ginger steak from this website). thanks jenna!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DM"
},
"reviewBody": "These crab cakes have quickly become our favorites! They are DELICIOUS! That's how real crab cakes should taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mpfuzzy"
},
"reviewBody": "i added just alittle bit of fresh lemon juice and used the Japenense style bread crumbs. i love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brakofday"
},
"reviewBody": "Can you say yummm. My hubby and teenage son asked me to make them again tonight (two days in a row?), well ok. Thank you for the recipe. Dawn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEME"
},
"reviewBody": "These were really good! I live nowhere near the coast and haven't had any before but they were great. Come to find out... I didn't have Old Bay so I just used some creole seasoning instead. I also had to add an extra egg so they wouldn't crumble. Thanks for the recipe, I will be using this one for sure again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "C.J. Upjohn"
},
"reviewBody": "Tasty, but I had difficulty keeping the cakes together. They tended to crumble."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris lane"
},
"reviewBody": "Excellent crab cakes and very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "not so good. I had to make my own seasoning because old bay brand is not available here in Canada. I found the seasoning WAY too overpowering and the rest was too bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teri1979"
},
"reviewBody": "These were SO good...I've tried several recipes and my audience is tough...from down the cape, but they LOVED these!! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VALERIE7430"
},
"reviewBody": "These were ok. Granted I used imitation crab so I'm sure they'd be a lot better with the real thing. Although I do prefer maryland style better, these were a good way to try something different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jwallacemiller"
},
"reviewBody": "These are good, but a little thick - make sure you don't use more mustard than the recipe requires."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marlene"
},
"reviewBody": "This is a very good recipe. I used immitation crab meat, which I knew was probably not a good idea but I tried it anyway. Sure enough it was pretty dry, but I bet with canned or real crabmeat the cakes will be just right, so next time I will use that. I also added a little more dijon and a pinch more Old Bay to the mix and broiled them. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRA2085"
},
"reviewBody": "This is one of the best recipies for crab cakes I have ever used! They are truly melt in your mouth TERRIFIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MICHELLE"
},
"reviewBody": "Very easy to make and delicious! I serve mine over rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie, PA"
},
"reviewBody": "I thought these crabcakes were the best. My husband just loved them and he can be a tough critic. I used the seasoned bread crumbs, they were a little salty, may try the plain next time. I would definitely make them for company. These cakes are so easy to make. The canned crab meat is good. I fried them in butter, and we ate them plain, but they would be good with tartar sauce, also. Thank you! A delicious &amp; easy-to-make dinner, I searched with french fries &amp; coleslaw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SUZ830"
},
"reviewBody": "I personally thought they were alittle bland... i added everything just like the recipe called for... not too salty but not flavorful enough... maybe next time i will add more stuff to my liking... maybe some italian bread crumbs would have been better than plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KIRSTIN99"
},
"reviewBody": "This is my staple recipe for crab cakes. I live in Maryland but I like this one better than any other Maryland recipes. I think it is the dijon mustard that makes these cakes really stand out - and I actually use a bit more than the recipe calls for. I usually broil these and that works just as well as frying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IMLIZARD"
},
"reviewBody": "Made these last night and they were without question the best crab cakes I've ever had, hands down! Served for my beau and got rave reviews. I cut back just a little on the Old Bay, made four good sized cakes and broiled them, and were PERFECT! For those who wanted more flavor, try using Italian breadcrumbs. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LADYJ422"
},
"reviewBody": "Made these for Super Bowl Sunday and they went over very well. Tons of compliments. Pretty easy preparation, although I also added some green onion and red bell pepper as suggested by another reviewer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TABLAISE"
},
"reviewBody": "If you don't like too much of a salty flavor, cut back on the Old Bay and add a little dried lemon peel. I made them into bite size cakes and served with tartar sauce as an appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillian Lasher"
},
"reviewBody": "I've been looking for this exact flavor for a few years now! This is it! Now I'll be making crab cakes and stuffing mushrooms with this stuff at the slightest excuse! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DRocka Delicious"
},
"reviewBody": "The recipe doesn't stipulate what type of crab meat is best but I learned the hard way. Fresh crab is important and use the white parts only. I added red bell peppers and green onions and it gave it a kick. Be sure not to over cook the cakes too crispy outside leads to too crispy on the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Quick, Easy, and Tasty. nough said!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FOCUSED ON FOOD"
},
"reviewBody": "This was definitely a great starter recipe. I had never made crab cakes before - and didn't realize it was so easy. I added a bit of green onion to the recipe, as per a previous reviewer's comments, along with a tiny bit of finely chopped red bell pepper. I also had to add more mayonaise to hold the mixture together, as the first batch crumbled apart when cooking. Overall, it was a great recipe and I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time making crab cakes. They turned out good, but I think they need a little more flavor. I think next time I would add some crumbled crackers or more seasoning. These were ok, but something was definitely missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Personally I thought they were ok. However everybody who ate the crabcakes enjoyed them. If you like the flavor of green onions in your crabcakes these aren't the ones for you. I thought the recipe could have used a dominant flavor like green onions. So maybe I'll try it again more to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Diane Lloyd"
},
"reviewBody": "Have had better- sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "All I can say is that these were AWESOME!!!\r\nI used low-fat mayo instead.....I just wish crab meat wasn't so expensive, otherwise I'd make these all of the time!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These crab cakes were great. It was the first time we tried making them at home,\r\nbut they turned out delicious. We will definitely make them again and probably at\r\nsome point for guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! I used 1 lb. lump crab meat along with 1/2 lb. of mixed crab meat , but held the original mix of adders. Also I broiled vs. fried, but the whole family gave it a big thumbs up. Thanks, Jenna!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I thought this was a great recipe. I added a tiny bit of parmesan cheese and a little more crab than the recipe called for and they were awesome!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19491/new-england-crab-cakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/116/appetizers-and-snacks/spicy/",
"name": "Spicy"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19491/new-england-crab-cakes/",
"name": "New England Crab Cakes"
}
}
]
}
}
, "about": [
]
}
]