				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ninety-Minute Cinnamon Rolls"
,"datePublished": "2000-03-15T20:22:20.000-05:00"
,"dateModified": "2022-11-07T14:10:18.000-05:00"
,"author": [
{"@type": "Person"
,"name": "GOOFYDEBBIE"
,"url": "https://www.allrecipes.com/cook/14199"
}
]
,"description": "These homemade cinnamon rolls are made in just 90 minutes with a quick-rising dough that&#39;s simple to make for the perfect kid-friendly sweet treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1YWh_KSnlj94ehno-9DDyxRvZsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4228724-83e914de5a3d44fdb263626e1ed16068.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1934643832001",
"description": "See how to make quick-and-easy cinnamon rolls.",
"duration": "PT6M30S",
"name": "Ninety-Minute Cinnamon Rolls",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/74e55647-c928-4347-87af-170a12ef7e2d/ad18502c-cd96-424f-abd6-819ec5da79a2/1280x720/match/image.jpg",
"uploadDate": "2021-07-06T03:30:37.660-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ninety-Minute Cinnamon Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "2424"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "347 kcal"
,"carbohydrateContent": "55 g"
,"cholesterolContent": "17 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "262 mg"
,"sugarContent": "27 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.75 cup milk",
"0.25 cup margarine, softened",
"3.25 cups all-purpose flour",
"0.25 cup white sugar",
"1 (.25 ounce) package instant yeast",
"0.5 teaspoon salt",
"0.25 cup water",
"1 large egg",
"1 cup brown sugar, packed",
"0.5 cup margarine, softened",
"1 tablespoon ground cinnamon",
"0.5 cup raisins" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat milk in a small saucepan until just hot to touch or a few bubbles form around the edge. Remove from heat and stir in margarine until melted; set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine 2 1/4 cups flour, white sugar, yeast, and salt in a large bowl. Add milk mixture, water, and egg; beat well. Add remaining 1 cup flour, 1/2 cup at a time, stirring well after each addition."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out onto a lightly floured surface and knead until smooth, about 5 minutes. Cover with a damp cloth and let rest for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "While dough is resting, mix together brown sugar, margarine, and cinnamon in a small bowl. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 12-cup muffin pan."
} ,{
"@type": "HowToStep"
,"text": "Roll dough out on a lightly floured surface into a 12x9-inch rectangle. Spread brown sugar mixture over dough; sprinkle with raisins. Roll up dough and pinch seam to seal. Cut into 12 equal rolls and place cut-side up in the prepared muffin cups. Cover and let rise until doubled, about 30 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1YWh_KSnlj94ehno-9DDyxRvZsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4228724-83e914de5a3d44fdb263626e1ed16068.jpg"
}
]
,"text": "Bake in the preheated oven until browned, about 20 minutes. Remove rolls from muffin cups to cool on a wire rack. Serve warm."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "Excellent recipe! I let the dough rise for 1.5 hours then after rolling and cutting I put them in a rectangle pan and let rise another 2 hours, they filled the pan. I also found that 1/4 cup of butter was enough to coat the rolled out dough and 3/4 cup brown sugar was enough as well as only 2 tsp of cinnamon. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good but I use a large flat baking pan instead of a muffin pan because the sugar cinnamon mix bubbles out of the muffin pan and causes the oven to smoke."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy Louis"
},
"reviewBody": "I have used this recipe many times. Sometimes putting my own spin on it. Fantastic recipe 👌"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used real butter and added pecans. I also made a carmel sauce and poured it over the top of the rolls as soon as they came out of the oven. Fantastic very tasty!!😊😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmski2012"
},
"reviewBody": "We loveddd it! I accidentally added double the butter to the dough so I was worried when I realized my mistake, but it turned out great. I made them on a deep cookie sheet baked at 350 for 22 minutes. These were for Christmas breakfast, memories were made and this will be a new tradition, thanks for sharing the recipe! Definitely a new favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hot tea"
},
"reviewBody": "After my third attempt, these came out perfect! I checked the temperature of the milk this time and allowed additional time for rising. Next time I will cook covered for 1/2 time as the tops got pretty well done. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is wonderful. First time making Cinnamon Buns ever and they came out so well. Family has asked me to make them a regular item now. Thank you for this! Very easy , I hand mixed the dough with ease. I should add , I made them in an oblong glass dish , cooked 20 mins ! It cooked evenly,,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T.S. Holt-McGraw "
},
"reviewBody": "Perfect bake - beautiful rise. I added pecans to my drunken raisins to create a gooey center with a bit of that lovely nutty crunch. I used half the brown sugar called for and added a couple tablespoons of Stevia brown sugar to reduce the calories. Also made a simple icing with Swerve confectionery. This morning's easy and fun bake was impulsively prompted by my morning coffee-hour reading of \"Legends &amp; Lattes.\" I could smell the cinnamon rolls coming out of Travis Baldree's words on the pages of the book so I had to go make some. Now my house smells like the setting in the book. Allrecipes dot com is always my go to when I want a hand to hold if I'm cooking/baking something unfamiliar. This was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bev Donnelly"
},
"reviewBody": "I only give this 2 stars, BUT I think the failure was on my part. I didn't use a muffin pan because I was scared off from that by the reviewer who had an oven fire. Soooo, I just put them on a baking sheet with parchment. The filling ran EVERYWHERE, why didn't it occur to me that that would happen??? Also, the dough expanded OUTWARD, not up, and ended up crusty instead of tender and chewy. The filling turned into sheets of candy; thank goodness I put down parchment! In my defense, flimsy as it is, this was my first try at ANYTHING remotely like this. Never tried a yeast dough before, and only one previous attempt at a rolled item (pinwheel cookies, they didn't turn out either!). Anyways, hope your experience turns out better than mine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl F"
},
"reviewBody": "Great buns. Easy to follow. Turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy peezy! I used a Texas sized muffin tin and they plumped up and came out so beautiful! It was a little hot in the kitchen so maybe not perfect spirals but practice makes perfect… thank you for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "This is a lovely, simple recipe. I made 2 batches in 1 day, and the only difference in ingredients was I did one batch with all purpose flour and one batch with bread flour. I have to say- the bread flour knocked it up a notch for sure! Far softer and fluffier! Also- I didn’t have packets of yeast but for those interested- 2&amp;1/4 tsp from a jar equals a packet. Downside- they do take longer to raise than what the recipe states for a truly fluffy roll. And they do dry out fairly fast (all purpose especially) but. If you are going to eat them within a few hours- great go to recipe. I put mine in a rectangle casserole dish bc I’ve tried them years ago (different recipe) in a muffin tin and found that as they raised, the center pushed up and it also makes them a little crusty (like a dinner roll) on the outside and I don’t prefer that. Topped outs with a basic frosting- butter, icing sugar, vanilla, milk. Almost forgot- I used butter not margarine bc I do not ever use margarine for anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CML"
},
"reviewBody": "I’ve always wanted to try making cinnamon rolls from scratch. This recipe was easy to follow and the rolls were delicious! Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgia Baylor"
},
"reviewBody": "I have made these *numerous* times. We love them. I have given them as gifts many times. I have always been given rave reviews when I take them anywhere. One friend I gave them to always gives me back the pan and asks for it to be refilled! I make the cream cheese frosting that one reviewer mentioned (1 1/2 cups powdered sugar, 1/2 cup softened margarine, 2 oz cream cheese, 1/2 teas vanilla, and 1/8 teas salt). I have never had a problem, they have always been beautiful. I put the yeast in with the dry ingredients, I do not proof it. The only thing I do differently is I use butter, not margarine. These are amazing and I'm addicted to making them! They have made me famous among my peers LOL! I would also add that buying quality ingredients is helpful. Don't skimp on the brand of butter or yeast. When I make the cream cheese frosting, I use Kelly Gold Irish Butter. Sure, those ingredients are more expensive, but they are worth it for a better outcome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalya Letyaeva"
},
"reviewBody": "Best Recepie Ever! I use this recipe for about 15 years. Tried other recipes with butter and glaze on, but my family asks only for this one. It's very light version, sense it's made with margarine. I usually bake it in 9x13 baking pan, use all of the filling that is left over on top, makes very nice souce on the bottom of the pan. IN my old LG oven I baked it 375 - 20 min, in my new LG oven which does not have bottom grill, only fan and top grill I had to lower the temp to 350- 20 min so that they would not burn. Also use only 3 cups of bread flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a tad less flour and kneaded it for just three minutes and everyone loves them!!!! they come out great every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Chambers"
},
"reviewBody": "I loved it even though I personally had a difficult time rolling out the dough! It’s been a few years since I’ve made that much dough from scratch, so I guess that means I’ll have to keep making these yummy cinnamon rolls to practices, practice, practice!! (I also doubled the recipe!) I needed to make some Substitutions (which can be found in the “ Tips in the Kitchen” section.) I also have my own handy substitute list here at home, which I keep handy as well. So, I substituted the brown sugar with maple syrup and pure cane sugar, and I substituted the milk with equal ratios of heavy whipping cream to water. I made half of the recipe into mini cinnamon rolls, with a mini muffin tin. Cooking only for 13 minutes and they seem to be just right and not dry! I greased and prepared both a 13x9 and a 9x9 baking pan, covered them up tight and placed in the refrigerator. I will be traveling to my daughter’s house, which is an hour away, so they’ll be the perfect temperate to put in the oven when I arrive! Not sure if my Grandson’s will like them, but I’m sure mom and dad will appreciate the home baked surprise! I also decided to copy the recipe onto recipe cards so I can give them to all my children at Christmas time! I’m hoping to make this a new Family Holiday Tradition! Thank you for the great recipe and for this great app!! I use it at least once a week!! Tina Chambers Corning, CA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Wessman"
},
"reviewBody": "This was delicious and easy. As other reviewers suggested, I made them the night before. Set them out for 30 minutes in the morning and then baked. Perfection. Thanks for the great recipe! (I made them in a 13x9 pan, not in muffin tins)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crustina"
},
"reviewBody": "Soooooooooo good! Followed recipe exactly, turned out perfect. I used Paulas suggested cream cheese icing recipe from the reviews. PERFECT! Wont ever canned cinnamon rolls again. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pendalynb"
},
"reviewBody": "Amazingly delicious! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "These are delicious! Easy to make but do take some time as you need to allow time for the dough to rise. Baked in a greased, 9 X 13 dish instead of the muffin pans and placed a cookie sheet underneath - no problems with drips! Made a glaze with 1 tbsp milk, 1 tbsp margarine or butter, 1 cup of confectioner's sugar, and a dash of vanilla. Added some additional milk to get more of a glaze consistency. Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wowzer"
},
"reviewBody": "Wife said she wanted cinnamon rolls for Christmas breakfast, but not just any cinnamon rolls, she wanted fresh-made-bakery rolls, no canned stuff. I thought it might be nicer to fill the house with fresh baking cinnamon roll scents on Christmas morning then plopping out a box of ones from the local bakery that had been made days earlier. What can I say, I am so glad I came across this recipe. There was doubt on her end that I could pull it off, but I just followed the recipe directly (only sub was a 9x12 pan) and we had a fantastic breakfast with wonderful rolls with an extra large batch of the cream cheese icing others mentioned. Will make again, the missus and the family was very pleased."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "c00kie"
},
"reviewBody": "Wow these are the best cinnamon rolls I have ever had. Made them on Christmas morning. I think this may be a new tradition. I did however place them in rectangular pan instead of muffin tins to keep them moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara "
},
"reviewBody": "They were absolutely amazing!! Super easy and quick! I made them Thanksgiving morning. They were completely devoured! Defiantly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "steve"
},
"reviewBody": "It was fun putting these together, but that's about it. They didn't rise as much as expected even after two hours, but I baked them anyway. I did eat one fresh out of the oven, but the rest became hard quickly and had to be thrown away. Honestly, the taste wasn't even all that good..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chanrenee7"
},
"reviewBody": "Great recipe. I just added icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "8f2z7d998c"
},
"reviewBody": "Yum!!! I made cream cheese frosting and it worked well with these. First time making cinnamon rolls! Such an easy recipe to follow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cperry1208"
},
"reviewBody": "I placed them in a glass baking dish rather than the muffin tin. Came out great! Plan on making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hmorris204"
},
"reviewBody": "I followed the recipe exactly. I was really happy with how they turned out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katyk"
},
"reviewBody": "I have tried cinnamon rolls 500 times if I’ve tried them once. They’ve NEVER turned out. Until today. I’m hooked! I served them with a classic glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Bevington"
},
"reviewBody": "Super good and surprisingly easy! I did them on a baking sheet, but some of them came a little unrolled and lost filling so next time I would definitely use a muffin pan. The taste is phenomenal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "It’s crazy amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kanisha Borden"
},
"reviewBody": "Great recipe! I doubled and froze some for later! They get really big so I was able to make more 12 per batch. I did not need the full amount of flour. I would only change that I put them altogether in on pan. In muffin cups they spill over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa R."
},
"reviewBody": "I only changed a couple things due to logistics. I only had traditional yeast, not instant. So I melted the butter in the microwave, then added the milk, warmed to temp (I had to guess because our Airbnb did not have a thermometer) and added the yeast directly to the mixture with a 1t of sugar to proof for about 10 min. worked fabulously! To anyone having the issue with a sticky dough, you may not have kneaded it enough on a floured board. My dough started sticky but became nice and smooth as I worked it by hand (no mixer). It took 2-3 minutes to get to the smooth texture, and I probably did a total of 5 min. I used a large cookie sheet with parchment paper to place the cut rolls. Because I prepared these at night for the next morning, I covered the prepared rolls with plastic wrap and put in fridge overnight. I pulled them out the next morning, let rolls come to room temp/double in size (basically forgot about them for 3hrs) then baked for 18 min at 375. Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corky4"
},
"reviewBody": "I made three different cinnamon roll recipes today, this was the winner. I took mine out at 21 minutes my oven cooks fast. I also used 3 ounces cream cheese and a stick of butter with a bit of vanilla and sprinkle of salt. Very close to Cinnabon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PSal"
},
"reviewBody": "Easy to assemble and quick to disappear! Family loved these. They will become a Sunday staple at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rami Darawsha"
},
"reviewBody": "Not even joking. One of the best desserts I ever made!! I used an easy icing recipe, but it tastes great without it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dblevindy"
},
"reviewBody": "New to baking but this one was easy and very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Stusse"
},
"reviewBody": "Yum, yum,yum!! I made these for an Easter brunch. My daughter-in-law told me that I have to bring these every time we get together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thatblackkat"
},
"reviewBody": "Super easy recipe that is always a winner!\nI prefer to cut into 12 and bake in a square casserole dish so I can drizzle cream cheese frosting when its warm out the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "Delicious don’t add too much flour, I kneaded last 1/2 c in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Stam"
},
"reviewBody": "I added an extra half tsp of salt and the taste was just right"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan Shepherd"
},
"reviewBody": "These were amazing. I did make them in a 9x12 pan at the suggestion of some reviews. I also made cream cheese icing from an AllRecipes recipe. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misstish"
},
"reviewBody": "I have been wanting to make homemade cinnamon rolls for a while now but was always too intimidated. I came across this recipe and it seemed doable so I decided to give it a shot and I am so glad I did! They were actually quite simple to make and they taste so much better than the frozen ones from the store. My kids love them too! I followed the recipe as written other than using butter instead of margarine (just because I always use butter). I like to make them the night before and put them in the fridge overnight, then pull them out 30-60 minutes before baking—30 is sufficient, 60 gives them a bit of extra rise. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leti"
},
"reviewBody": "So easy! I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle Russell"
},
"reviewBody": "These things are ridiculously easy and superbly delicious!! They never stay around long enough to get cold"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "esperanzado"
},
"reviewBody": "These were very good... definitely needs more cinnamon though, and they baked for 30-35 minutes instead of 20"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BlueyedBaker"
},
"reviewBody": "Love the simple recipe. First time EVER making cinnamon rolls. The only problem I had was the brown sugar filling after baking turned hard.....what can I do to fix that problem"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyous"
},
"reviewBody": "I made these just as the recipe stated and they were so good. The were gone before I even made the frosting to put on top! \nSo easy and so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRN"
},
"reviewBody": "These were very easy and very tasty! We drizzled honey on them and it was a wonderful combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Carter"
},
"reviewBody": "can't wait to try it waiting for them to cool a little. they look so Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nikrey"
},
"reviewBody": "4 stars becuase I didn't follow the recipe exactly \nThis is the best cinnamon roll recipe I've ever made! The instructions were a little confusing on the fat and I realized after I made the dough I used 1/2 c instead of 1/4 c. BEST MISTAKE. The rolls came out large, SUPER fluffy, moist, and delicious. \n\nTweaks:\n1/2 cup softened butter in the batter\nCut into large sections (2inch cuts)\n13x9 glass pan for 25 minutes\n\nI also rose the dough both times on top of warm oven. \n\nSo easy, so yummy, so fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PeggyJ"
},
"reviewBody": "I’ve made this recipe three times, and it’s a hit every time. Here are my modifications. I reduced the brown sugar to 3/4 cup, and increased the cinnamon to 1.5 tablespoons.? As other reviewers, I spread the butter first and then added the cinnamon sugar mixture and topped with 1/2 cup of walnuts. I used a 9 x 13 Pyrex dish, and after allowing them to rise for 30 minutes I covered them with saran wrap and place them in the refrigerator. I took them out 30 minutes prior to baking the next morning, put them in a cool oven, set the temperature for 375. They were ready in 25 minutes. I glazed them with 3/4 cup powdered sugar mixed with 1.5 tablespoons of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANGELICAP925"
},
"reviewBody": "Simple and Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candi"
},
"reviewBody": "Really fast to pull together and tastes great! Instead of mixing the butter, brown sugar and cinnamon together, I spread the butter onto the rolled out dough and then sprinkled the brown sugar-cinnamon mixture over it... then added chopped pecans over it. I also placed the pan into the fridge overnight to proof. Pulled them out to rest on the countertop for one hour in the morning before baking for 25 mins. They had a great rise and looked perfect. A great Christmas morning treat! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vintage American Male"
},
"reviewBody": "Not too bad for a 90 minute cinnamon roll! Will definitely make again.\nI only buy regular active dry yeast, so I just dissolved/proofed it in the warm milk and water for 5 minutes and then proceeded with the recipe. I let it rise an additional 10 minutes to compensate.\nI found the dough could use a touch more sweetness for my taste, so next time I will add 1/3 cup instead of 1/4.\nI also did not mix the brown sugar mixture, but melted the butter and spread it, then sprinkled with the brown sugar cinnamon combo. Baked in 13 X 9 pan.\nEveryone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Webb"
},
"reviewBody": "Awesome! I only had active dry, so I used a 1/4 cup of the milk and butter mixture after it cooled down, then added it to the dry ingredients. Also used chopped pecans and topped with cream cheese icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zazura"
},
"reviewBody": "Delicious!!! I made plain cinnamon ones but topped with cream cheese frosting and sprinkled a handful of raisins on top after baking. This recipe is a keeper! Thanks! The only difference is I used butter instead of margarineand added a little bit more of milk and water while kneading because the dough felt a tad dry. Definitely will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kylee Hoerner"
},
"reviewBody": "This cinnamon roll recipe has become a family tradition on Christmas morning for the last 5-6 years- my kids and husband LOVE them. The recipe really is very quick and tasty! Thank you so much for sharing as it has been apart of our family’s special holiday now and for years to come!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gigi"
},
"reviewBody": "I gave this a 3 because I’m not sure if it was operator error or the recipe but clearly cinnamon rolls should not weigh a ton and lack the taste of sugar. I tried to follow the recipe. Maybe too much flour?? Idk but I won’t be making these again. Added frosting just to get a sweet taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess23"
},
"reviewBody": "It was great I loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moo"
},
"reviewBody": "These were delicious! The first time I made them, I used the muffin cups but the next few times I used a baking pan instead. It is much easier to clean that way, and they cook better. I have seen some bad reviews, but I decided to give it a try, and I am so glad I did. I did cut down on the butter in the sugar mix (I used half) and I think that helped. I don't have much of a sweet tooth and I don't think these are too sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Peasley"
},
"reviewBody": "This is an amazing recipe. My kids love this. I add perhaps a 1/4 cup more flour (depending on the humidity). Other than that I followed it as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Take2Bake"
},
"reviewBody": "My daughter wanted to add cinnamon rolls to our scratch made holiday traditions last year. I found this recipe and because of the time that it said it took to make it was very attracted to it. Plus, it doesn’t require a bread maker, which I don’t have. It was a great recipe, an easy recipe and delicious. Follow the instructions and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jwest732"
},
"reviewBody": "Very good, JUST BE SURE TO NOT USE ALL OF THE FILLING. It’s just too much to use all of it. The brown sugar melted to the bottom of the pan and made the bottom of my rolls hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keelanclough"
},
"reviewBody": "¡Siempre resultan geniales! También son sorprendentemente fáciles de hacer. El helado de queso crema en la parte superior los hace aún mejor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mrjffwilhelm"
},
"reviewBody": "I am use to buying the cinnamon roll tube and bring them home, open up the tube, place the cinnamon rolls in my 9 inch cake pan. I then bake them as directed on the cinnamon roll tube at the correct temperature and the correct time.. And they turn out good. I saw a recipe 90 minute cinnamon rolls on all recipes.com. So I thought I’d give them a try. I followed the directions exactly as they were written. After making the dough and cinnamon mix and rolling everything up, I did cut the cinnamon rolls to one inch each, placed them into my 9 inch cake pan and allowed them to rise for the 30 minutes as directed. I baked my cinnamon rolls in the oven at 375 for 20 minutes.. The came out looking very dark brownbut after being out for 5 minutes, they began to get hard. So I had to put them into a ziplock bag immediately.. I also made another dough with the same cinnamon mixture and after rolling it up, I had cut them into half inch rolls and now baked them at 350° for 17 minutes. The cinnamon rolls came out better (color wise) but still turned hard afterwards. In both instantces the cinnamon carmelized on the bottom if the pan. I would never make this recipe again as it does not work for me. I am just wasting ingredients and I think the yeast dries up the rolls after they come out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerrijohnson"
},
"reviewBody": "Followed recipe exactly and they turned out perfect. Will say I did not get a doubling on the rise. But when baked they this expand and turned out great. So don’t fret if they don’t double on the rise. Family favorite"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PastryDude"
},
"reviewBody": "Easy enough to make (all in the stand mixer). I substituted almond milk and used butter instead of margarine. I also used white sugar and molasses (6.8 oz and 2 tablespoons) instead of brown sugar in the filling. \nThey don't last more than a day and everyone who tries them loves them.\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stcarlson"
},
"reviewBody": "Mine didn’t come out very “pretty” but wow they were so delicious nobody cared! This recipe is a 10."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique"
},
"reviewBody": "Soft and sticky great stuff in 90 mins . yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Westie Mom"
},
"reviewBody": "I had a problem with the cinnamon filling spilling out. Can someone tell me what I did wrong? However I do like the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yvonnedk"
},
"reviewBody": "Delicious and easy cinnamon roll recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "droningbass"
},
"reviewBody": "This was my first adventure in Cinnamon Roll making, and this recipe made things easy! I was a little confused by the recipe listing 3 1/2 cups of flour in the ingredients and only 2 1/2 in the recipe - but I ended up adding about another 1/2 cup of flour to make the dough less sticky while kneading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vicalee110"
},
"reviewBody": "There were great! As one reviewer suggested I made cream cheese frosting to complete them. Easy and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCCOMBSS"
},
"reviewBody": "These turned out so fluffy and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shera F"
},
"reviewBody": "These came out great. I whipped up cream cheese icing to go on top. The crowd went wild."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I Griff"
},
"reviewBody": "Recipe is spot on! I didn't use muffin tings. Didn't use cream cheese, instead used icing sugar and milk for a drizzle. Initially intended to cut the recipe for half yield but accidentally used the full measurements. Good thing i did because 5 were finished within 1 hour of them coming out the oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Bermudez"
},
"reviewBody": "BEST CINNAMON ROLLS EVER!!!! Ever ever!!! I am hugely obsessed with Cinnabon at the mall...and never again. These taste like the ones from the mall just better. So soft and perfectly paired with the icing from here called “The Perfect Cinnamon Roll Icing”. Seriously, they made me so happy!!!!\n\nThe only thing I will try different next time is to put the brown sugar through the food processor use a brown sugar that is not as coarse...because the sugar was still crunchy. Did not affect the taste all. Delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joko"
},
"reviewBody": "These are really great but do need some adjusting. Double the cinnamon, and switch all margarine out for butter. I also made a glaze for these that worked out nicely. Two mandarins fully zested, 1.75 cups powdered sugar, all of the juice from the mandarins, and 1 tsp vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Marie"
},
"reviewBody": "No changes made, well wait, I did add crushed almonds, crushed pecans &amp; raisins, I added them all! This cinnamon rolls recipe will always be a go to for me, they turned out absolutely delicious and on my first attempt! Kudos to this recipe!\n\nSide note: I did use a different icing recipe, it is also here at allspicereceipe.com, titled the perfect cinnamon rolls icing! YUM!!!\n\nI've already eaten two, that's why I didn't give a full picture(12). As you can see, I love the icing, but these are nice size cinnamon rolls so the loaded icing is perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystle Lain"
},
"reviewBody": "Amazing traditional recipe!\nI only had active dry yeast so i did change prep a little bit. I didn't cool off the milk mixture completley, instead to 130 degrees. I also heated up the milk to around the same temperature so my yeast would activate. I also gave it more time to rest and rise. \nTurned out beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sydney"
},
"reviewBody": "Really goo and easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Ernst"
},
"reviewBody": "This is a super easy super awesome recipe - I used butter to grease the tins, but margarine as called for in the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geraldesteban"
},
"reviewBody": "Best recipe. But need to find cream cheese recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Smith"
},
"reviewBody": "This was a really easy and wonderful recipe to follow. I made it the day before and cut up the rolls into 8 pieces, refrigerated them overnight and baked the next morning. Easy least and delicious. Thanks for a wonderful recipe that doesn’t take hours and can be made in advance!!! We are all happy campers!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Westgal"
},
"reviewBody": "Not a raisin person because they are toxic to dogs and my dogs always want a bite, so I used walnuts instead. Nice, easy-to-follow recipe. It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lalaaphi"
},
"reviewBody": "I made it for family and guests and it was a hit! So easy and glad it didn’t call for a bread maker. I too frosted right out of the oven with cream cheese frosting. I used 1/2 TBS additional cinnamon—so gooey and yummy! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Steinbach"
},
"reviewBody": "Just made these this morning. Let me start by saying I CANNOT MAKE YEAST BREADS. Yet these turned out and are amazing!! Followed the recipe exactly. Super easy. Family says they might be even better with frosting but I don't think they need it. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kenace45"
},
"reviewBody": "Made it this morning. Took me two hours though. Not sure if I kneaded it enough but they came out overall delicious. My kids finished them off and left me the end pieces. The one item that needs to be added is an icing. Did not have all the ingredients (cream cheese) to make a more traditional one but did with a cup of confetti sugar and a tablespoon of milk that turned out a little thick but was able to spread on top. Just glad I had enough flour during this pandemic to make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "This is a very good delicious recipe I highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROSALIE P"
},
"reviewBody": "These were so good I made them two days in a row. Both times I used butter instead of margarine and baked them in a 9x11 pan. They took over 2 hours to rise.\nThe first time I thought !the dough was a bit stiff so I cut the flour by 1/4 cup the second time. It made for softer buns but I think I preferred the texture of the stiffer dough. The first time I baked them a few minutes longer and the sugar carmelized more. A nice chewy, gooey texture. \nWhen they came out of the oven, I followed another reviewers advise and covered them with a damp towel for 15 min. Great advise to soften tops.\nI iced them with cream cheese frosting. \nBest eaten within the first day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon V"
},
"reviewBody": "so easy to make and really delicious. Its the first time I have made cinnamon rolls and was so happy I found this recipie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kaylyne wern"
},
"reviewBody": "It was seriously AMAZING!!! I can't believe they turned out so well. The dough was easy to roll and the tutorial made it simple to follow. Thank you so much for this awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RVn and Cookn"
},
"reviewBody": "The dough was very good. I used a regular size muffin pan, per recipe. Too small! Half the batch in a pie plate turned out better. Next time I’m going to use a 9”x12” pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amber"
},
"reviewBody": "delicious and so easy! my hubby loves cinnamon buns, and being it's his bday week I thought I would try and make him some. what a success they were!! I made some quick cream cheese icing to go on top as well. I did make them in a 9x13 instead of a muffin tin, and my baking time was about 30 minutes because of that change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squishY78"
},
"reviewBody": "Really really good! I used cream cheese icing mentioned in first review as well as baked in a pan for 30 min. They couldn’t be better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missie Bone"
},
"reviewBody": "Loved this recipe! Turned out just as I expected. I used chopped walnuts in place of the optional raisins. Also made a simple glaze of powdered sugar, melted butter, vanilla, and water. The family and neighbors said they were some of the best tasting rolls they have had. Try it! You’ll like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Postigo"
},
"reviewBody": "I made these for Mother’s Day and this recipe worked out great! This was my first time making bread and it worked wonderfully. The dough turned out nice and light and the filling was delicious! The only problems were that the dough was slightly dry and needed an extra tablespoon of water and there was not enough filling for me. I topped with icing and my family loved it!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17006/ninety-minute-cinnamon-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17006/ninety-minute-cinnamon-rolls/",
"name": "Ninety-Minute Cinnamon Rolls"
}
}
]
}
}
, "about": [
]
}
]