				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No Bake Lime Mousse Torte"
,"datePublished": "2020-06-18T23:09:28.000-04:00"
,"dateModified": "2022-07-14T17:43:25.000-04:00"
,"author": [
{"@type": "Person"
,"name": "RB1953"
,"url": "https://www.allrecipes.com/cook/700932"
}
]
,"description": "This tart and tangy, no-bake cheesecake is flavored with white chocolate, lime juice, and gingersnap cookies. It is easy and can be made several days ahead. Decorate with dollops of whipped cream, raspberries, and fresh mint leaves, if desired."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/24wWGICud5baIBerqtRxcVjQV7Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3734325-a16ecdbb9e154a78b44fd34b43db00e6.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6021300528001",
"description": "A refreshing tart made of lime and cream with a crumbly ginger cookie bottom. \n",
"duration": "PT1M5S",
"name": "No Bake Lime Mousse Torte ",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/17291fc0-206e-40da-b37d-19f05d6123bf/b39497ed-7f68-44ab-a22f-ccd4beea83b0/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:27:51.855-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No Bake Lime Mousse Torte"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "78"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "669 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "147 mg"
,"fiberContent": "0 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "32 g"
,"sodiumContent": "295 mg"
,"sugarContent": "37 g"
,"fatContent": "52 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"2 cups gingersnap cookie crumbs",
"2 tablespoons white sugar",
"5 tablespoons melted butter",
"1 (.25 ounce) envelope unflavored gelatin",
"0.66666668653488 cup lime juice",
"2.5 cups heavy cream, divided",
"9 ounces white chocolate, chopped",
"3 (8 ounce) packages cream cheese, softened",
"1 cup white sugar",
"2 tablespoons grated lime zest" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine cookie crumbs and sugar in a large bowl. Pour in melted butter, and mix thoroughly. Press into the bottom and one inch up the sides of a 10-inch springform pan."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle the gelatin over the lime juice in a small bowl, and set aside to soften. Bring 1/2 cup of whipping cream to a simmer in a heavy pan. Remove from heat, and pour over the chopped white chocolate. Let soften for two minutes, then whisk until smooth. Mix the gelatin into the warmed chocolate until melted; set aside to cool to room temperature. Beat remaining 2 cups of cream to stiff peaks in a large bowl, and set aside."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/24wWGICud5baIBerqtRxcVjQV7Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3734325-a16ecdbb9e154a78b44fd34b43db00e6.jpg"
}
]
,"text": "Beat the cream cheese with the sugar with an electric mixer until well blended. Slowly blend white chocolate mixture into cream cheese, then mix in lime zest. Fold the whipped cream into the cream cheese mixture, and pour into prepared crust. Cover pan with plastic wrap, and refrigerate overnight."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT525M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Carnahan"
},
"reviewBody": "A friend served this at our book club meeting. It was absolutely wonderful and we all raved about it! Highly recommended - delicious with a creamy, light texture and amazing flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne"
},
"reviewBody": "The whole family loved it. I made it as printed, the one thing I might change is to add a little more butter to the crust and bake it for a few minutes. It is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TEP"
},
"reviewBody": "It was awesome and I'll definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Devlin"
},
"reviewBody": "Great recipe, I have made it twice now, and it was a hit both times. \n\nIf you are thinking of substituting graham cracker crumbs, Don't. The Ginger snaps actually add a snap to the taste. Get really good ones.\n\nI used White chocolate morsels. They come in a 12 ounce package. First time I used exactly 9 ounces of morsels. The second time I threw in some extra morsels. They did not hurt the dish, but it lost a bit of the tangy taste. Next time I'll stick with 9 oz.\n\nI made a bunch of small dishes and passed them to some neighbors. Looking forward to an occasion I can make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rznkane99"
},
"reviewBody": "love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie Coburn"
},
"reviewBody": "It’s delicious! I made mini “cheesecakes” using cupcake liner and tins. It worked great and is easy to share and keep things separate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley D. Goodar"
},
"reviewBody": "This is by far the best desert I've made. It is always a hit. Not too sweet, rich and easy to make. Takes time to put together because of the steps, but is so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniella Martinez"
},
"reviewBody": "loved it! only had one 8oz thing of cream cheese so I 1/3rd the recipe, added a little extra whipped cream, &amp; used the extra creamy kind, then I topped it with coconut &amp; it was bomb! gone in a night!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Riley"
},
"reviewBody": "Absolutely wonderful! Used a 9” instead of 10” so the pieces were higher."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "It tasted just fine but nothing special. I even doubled the crust, added vanilla bean paste and added extra lime juice. I used key limes. To make it special I may have made a whipped cream using midori liqueur. Not sure if there will be a next time for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tatum"
},
"reviewBody": "I made this and expected it to be okay, but everyone that has tried it has said that it is the BEST key lime \"pie\" they've ever had. The creaminess that the heavy whipping cream and white chocolate bring is what makes it stand out, along with deviating from normal pie crust and instead using crushed gingersnap cookies, and a lighter lime taste. Perfect touches! Overall, I love this recipe, and if made correctly is one of the best homemade desserts out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DaniellaH"
},
"reviewBody": "My dad LOVES lime anything and he is very particular in his taste. He loved this and has asked me to make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "made this for Christmas dinner. everyone loved it. would not change a thing. a definite do-over. it was light, and tart and very refreshing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Spence"
},
"reviewBody": "WONDERFUL!!!! It's like a Key Lime pie and a White chocolate cheese cake made a baby! Didn't have 2/3 fresh lime,so used 1/2cup.It was fine. Instead of whipping 2 cups of cream into peaks. I used one container of Cool-whip. No gingersnaps for me so Graham Crackers and sugar with butter for crust. I was told I should sell this to restaurants. Must let it set over night!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christy Cooks"
},
"reviewBody": "My boyfriend gives this an enthusiastic five stars. In my opinion it IS good, just not that good. The texture is very light and creamy making it very easy to eat a large piece. The flavor is very light too, not too sweet and definitely not too lime-y. We added a bit more lime juice (3/4 cup), and I'm very glad we did because the extra tartness was needed. I'm sure it will be a crowd pleaser. One note: when folding in the whipped cream it is best to add one third at first to lighten the batter a bit, then add in the rest. Most professional recipes will tell you to do this so the end result will be as light as possible, without the heavier batter deflating much of the whipped cream. Finally, I think the crust could be improved with baking it a few minutes, then cooling before filling. IF I were to make this again I would add some finely shredded (unsweetened) dessicated coconut into the processor with the ginger snap cookies, similar to the crust in the coconut lime cheesecake with mango coulis, also found on this site, then process till everything was finely ground and pour in the melted butter, processing and scraping down the bowl as necessary. Doubling the crust wouldn't hurt either, because the dessert is very tall. The viewer who mentioned white chocolate with coconut has a great idea, too. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovin it"
},
"reviewBody": "Made this for a dinner party last night, it was awesome. I cut back on the sugar in the whipped cream, and didn't put any sugar in the crust. Made a syrup to drizzle over it by boiling one cup sugar and 1/2 cup of water with lime rind for 1/2 hour, delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "This was a big hit! Agree with another review that one could reduce the cream and white sugar and even increase the lime zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TeaRose"
},
"reviewBody": "I omit the white chocolate (only ingredient I didn't have on hand) and it was still rich and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "santiagooo"
},
"reviewBody": "Love it. I do it all the time, but now i don't put any gelatin, don't need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Halyard"
},
"reviewBody": "This was a hit! Great recipe. I followed it exactly except that I baked the crust at 375 for 7 minutes so that it would hold together better, and it came out light, fluffy, and very awesome flavour :D Was the favourite dessert at my Thanksgiving supper party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pegnjim"
},
"reviewBody": "Great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Robertson Klein"
},
"reviewBody": "I made this for an event at a local business. I used the exact ingredients &amp; made it as directed. I chopped the ginger snap cookies in the food processor, added a slight amount of green food color to give it a hint of color. In garnishing the torte, I piped whipped cream that I had sweetened with confectioner's sugar and beaten to stiff peaks. I used a microplane &amp; this gave the torte fine, flavorful zest. The combination of the ginger snap, lime and chocolate strikes a delicate balance. In addition to piping whipped cream, I added lime slices bordering the circumference of the torte &amp; microplaned white chocolate and additional zest to the top of this beautiful dessert. This received raves &amp; numerous requests for the recipe. Super easy, super impressive, light, flavorful and stunning dessert. I'll use this one again and again. Thank you for a fabulous recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetserenade"
},
"reviewBody": "I made mini cheesecakes with this recipe and they were a perfect end to a great meal. Everyone thought I baked them. I love lime and this fit the bill as far as flavor. I added strawberries for color, but they tasted great with the cakes too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackolive"
},
"reviewBody": "Everyone who has tried this has loved it; some (even chocolate lovers) thought it was the best thing ever. Light and rich and flavorful all at the same time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FNChef"
},
"reviewBody": "Incredibly creamy, tart, and delicious! I cannot begin to tell you the look on people's faces when they enjoy this dessert - I used it as a dessert special in the restaurant where I work, and it's been going over amazingly well. People rave! I use a tad more cream to make it a little lighter. And the only comment I'd make is to chop up the zest if you end up with longer strings...it's unappealing otherwise. I also should say I stuck with graham cracker crumbs, since some people have an aversion to gingersnaps (I personally love them and think they'd go perfectly with this recipe!) I tell people it's like if key lime pie and cheesecake had a baby...that's this dessert. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klineellie"
},
"reviewBody": "I made this for Easter dinner and my whole family loved it. The gingersnap crust was especially cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "551half"
},
"reviewBody": "I made this last night for Easter dessert. It complimented the lasagna perfectly! I made it as written using homemade gingersnaps. (Soft gingersnaps recipe from this site.) This is definitely a new family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Riley G."
},
"reviewBody": "Easy to make. I ran out of Lime Juice and used lemon juice instead. It taste great. I think it tastes a little better than only lemon juice. When I made the whipped cream, instead of folding it in I layered it in the middle of layers of the main mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CALLIKO"
},
"reviewBody": "Twice as good after being frozen, but I honestly thought this was more work than regular cheesecake. It's good for when you don't have time to bake and cool a cheesecake though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSIEBEEME"
},
"reviewBody": "I have made this a dozen or more times in the last few years and people love it! I've taken it to my husband's work functions and now get special requests for it! I have made as many as 12 pies at a time. I use a couple of graham crusts instead of making crust and it speeds up the process. I also use lemon instead of lime as I prefer it, but otherwise follow the recipe/instructions exactly. P.S. This recipe MUST be refrigerated overnight to fully set and be at peak flavor. The first day it just doesn't have the same texture. The second day it literally melts in your mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamlink"
},
"reviewBody": "This is one of the best lime pie's I've ever had and by far the easyest to make, 12 minutes from start to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ackwdw123"
},
"reviewBody": "If you love the richness of cheesecake and the tanginess of lime, this is your new favorite recipe! The ginger snap crust is divine, the filling is so creamy and yummy, there will be no leftovers! I served this at a party and the only person who didn't love it was my sister-in-law who is a cream cheese snob (you know the kind--they only eat cream cheese on bagels, ha!) Otherwise, people gobbled it up and practically were licking their plates! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulette"
},
"reviewBody": "I turned it into a lower calorie version by:\nNot adding sugar to the cookie base, and used only 1 cup cookies rather than 2 c (plenty!). Used only 4 tbs butter. I used 1/2 pint of cream to melt the white chocolate in. With the other half pint I made topping of whipped cream dollops with just a touch of sugar and a dash of vanilla (don't need a topping but it looks pretty). I DID NOT add whipped cream to the mixture at all (totally unnecessary calories!). I also added only a 1/4 cup sugar and 1/4 cup Trulia rather than 1 cup sugar to the cream cheese mixture. Trulia does not have that \"diet\" after taste and it's much healthier for you. I used the low fat cream cheese and cut it down to 2 1/2 8 oz. packages instead of 3. The white chocolate and lime juice gives the flavor and the cream cheese is the texture. You need to let it sit overnight for the rich texture to set in. I dare you to be able to tell this is a lower calories version. My family had no idea and said the texture and taste was like it was purchased from a bakery. I did not use any lime zest (didn't want the texture). It would have been pretty with mint leaves to decorate but since I didn't have any I added some colored dots instead only on the whip cream dollops, but added them all over on one slice just for a better photo presentation. (see photo above). This should be called a key lime cheesecake. It's probably the best I've ever tasted! \"Just the right tartness and not overly sweet\" is what my family said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marli7"
},
"reviewBody": "This recipe is absolutely delicious. I wanted to make it exactly as suggested but I couldn't bring myself to add 3-8oz packages of full fat cream cheese, so I substituted 2 of them with non fat cream cheese. It came out luscious and creamy but firm enough from the gelatin to keep its shape when cut. I kept the butter in the crumbs (note: break up the cookies before processing them if you are using a food processor. Mine almost walked off the counter even after I added the butter because I left them whole) I didn't have a springform pan so I just pressed the crumbs on the bottom and sides of a 13x9 pyrex dish. I thought it might be too small but the mousse mixture filled it up and looked pretty I will definitely make this recipe again but will use all non fat cream cheese and packaged dream whip for the whipping cream. I think if I warm a little fat free evaporated milk, that will do to melt the chips in or I might omit them and add vanilla to the dream whip. Thank you for posting this great dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lv2eat"
},
"reviewBody": "LOVED this! I found it hard to crush the gingersnaps but that was all. DELICIOUS! I made it for a church potluck and I had a gentleman eating off the serving knife!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sstandish"
},
"reviewBody": "Hopefully I can change my rating after I make this.. Anyway, this looks amazing and I can't wait :-) I wanted to ask, to the people that have said they would just leave out the white chocolate - what will you replace it with? 9oz of stuff is a lot to take out of a recipe (one person even upped it 12!), and I can't help but think that it will change the texture/consistency of the dish. I am fairly good at distinguishing mild flavors, such as white chocolate, and would think that this is enough to come through. I think it's meant to add a little something (like a pinch of cayenne in a recipe that calls for chocolate or cinnamon), not be the star. And for those of you that had problems with the lime juice, I hope you weren't using the stuff that you squeeze out of a plastic lime. And, if you were, maybe try using key limes. I know, they're more expensive and tedious to juice - but they sure do pack a punch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lana"
},
"reviewBody": "try this with Lindt white chocolate with coconut! Outrageously good. I made this with this chocolate by mistake one time and have never gone back,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CiociaPaula"
},
"reviewBody": "This is one of my favorite desserts and it should be noted that it originally comes from Bon Appetit, it's called a lime mousse cake (epicurious.com). I've made it dozens of times and it's absolutely wonderful, restaurant-quality. I add a touch of green food coloring to make it look more lime-y."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "A dessert (cheesecake) to serve to any company - the gingersnap crust makes a big difference and marries very well with the lime. Thank you for something wonderful, especially on a hot day!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boudica Birdsong"
},
"reviewBody": "Excellent and easy. None of the flavors are strong...the white chocolate seems to make a rich undertone to the lime. Gingersnap crust was really good. Thanks! It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lilbitspoilt"
},
"reviewBody": "This recipe is great I did make a change to it but still amazing.I used a whipped short bread recipe and added a little bit of lime zest for the crust other than that I went by the recipes and it was a total hit.thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MJ Simmons"
},
"reviewBody": "This was really good. Not as heavy as I was expecting. Some reviewers have said that it should be called No Bake Lime Cheesecake, but that would be a misnomer too, as it is much lighter than you average cheesecake. Make this when you're going to have a crowd because it makes a LOT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Loved everything about this..easy to make-no bake, the flavor was great and really liked the ginger snap crust. Everyone who had it really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoannaV"
},
"reviewBody": "I made this for a church meal and it was universally complimented! Personally I always love cheesecakes that use gingersnap crusts :B The lime flavour is great. The white chocolate can't really be tasted, unless you are great at recognising flavours, but it probably makes the overall flavour what it is - balancing out the lime, etc. The crust formed well, although crumbled when cut. The mousse itself was the perfect texture/consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdventurousSpatula"
},
"reviewBody": "beautiful presentation, delicious and even better frozen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andykw1"
},
"reviewBody": "The texture was smoother than a typical cheesecake. It was very good and easy! I think I will use a bit more lime juice next time though for a more tart taste ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redrumonthewall"
},
"reviewBody": "The recipe is absolutely perfect! I couldn't find the gingersnap cookies, so I used graham crackers instead. Thanks so much! It was delicious both times I made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Wilson"
},
"reviewBody": "Amazing lime flavour, very delicious. In error I used 35% cream instead of whipping cream, and it still worked out very well. I can only imagine how great it would be prepared correctly. Will certainly make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lkpotter"
},
"reviewBody": "This cheesecake has a wonderfully subtle flavour and is so smooth. I have served it many times, even at my church's annual ladies' tea. It was a smashing success!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara"
},
"reviewBody": "This was incredibly good! It took a little work, but it was so worth it! Everyone raved about it at the picnic I took it to. Great summer dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie R."
},
"reviewBody": "This was great! More work than I anticipated with a no-bake cheesecake, but worth it! It has a nice, light texture. I used an extra tablespoon of zest and fresh lime juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tiffscookin"
},
"reviewBody": "OMG! Thanks for sharing this recipe. The gingersnaps made it! My husband asked that next time I double the crust so it would be thicker. And my four year old asked that I not put grass in the pie (the lime zest). It was wonderful. The only thing I changed was to increase the white chocolate to 12 oz and the lime juice to a little more than a cup. Light and refreshing, but I couldn't taste the white chocolate at all, so next time I probably just leave that out. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPACIDY"
},
"reviewBody": "This recipe is great. The only thing I would change is to make the crust a little thicker - the crust is so yummy, I think if it was a little thicker it would be great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Del Mul"
},
"reviewBody": "I followed the recipe exactly and this turned out delicious! It's so light and just the perfect amount of lime flavor. The gingersnap crust makes it even better. Not all of the filling would fit in my 9 in. spring form pan, though. I wasn't complaining about the extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wiley"
},
"reviewBody": "I halved this recipe and used an eight-inch pie tin. I also used lemon instead of lime. This was very refreshing, and incredibly tasty! I did not think it tasted like a cheesecake at all. The cream cheese was not the predominate flavor. However, the white chocolate was very subtle, so I think I might kick that up a notch next time! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LisaMR12"
},
"reviewBody": "I got a similar recipe from epicurious.com, except with shipping cream, not heavy cream. Not much difference. It is very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RECIPEFAN1"
},
"reviewBody": "Woo whoo this is good! A wonderful dessert, lots of subtle flavor throughout, a nice hint of key lime juice. I was dubious the gingersnap cookies might be too strong so I made a graham cracker crust instead - just right. If you're having a few friends for dinner, make a half recipe and put it in a 6\" springform pan. Makes more than enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelli stein"
},
"reviewBody": "This was really good and simple. I made it the night before as recommended. It tastes much more like a cheesecake but it does have the mousse consistancy. My son loves key lime pie and really liked this too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marahlf"
},
"reviewBody": "Delicious!! This is more like a light cheesecake, that's surprisingly rich. May be my new favorite no bake cheesecake recipe! Made this a day ahead of time and followed the recipe exactly. Only problem I had was with the crust falling apart. Typical cheesecake has you bake the crust, I think I'll try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "April Ard Louviere"
},
"reviewBody": "It is good, but I do agree that the taste is that of a cheesecake. The lime flavor is very subtle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinadee"
},
"reviewBody": "There is nothing I would change about this recipe (unless that is if you could wave a magic wand and take out the calories and fat!) I wonder if this recipe would taste okay maybe using a light cream cheese? Thank you for sharing - everyone at the party had to print a copy of this recipe before they left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmccloud"
},
"reviewBody": "I have tried many key lime recipes for my boyfriend- he loved this one! kind of like key lime pie. Definatly double the key lime juice and add slightly more zest. i was making 2- i made 2 crusts, and then realized one batch of filling was enough for 2 cakes. Yum! a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KarenLAnderson"
},
"reviewBody": "Very tasty, and unique! A big hit! Personally, it was a little over my head in assembly, and took 2 hours to get together. But finally turned out and was fabulous! Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abickman1"
},
"reviewBody": "This dessert is wonderful! I brought it to a BBQ and everyone who tried it loved it. I did switch out the whipped heavy cream for cool whip, and used nilla wafers for the crust, but followed everything else to a \"T\". I will definately make this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann Waite"
},
"reviewBody": "Very good and refreshing- not a heavy taste- very light and I didn't even have to bake it!\n2nd time I made it I substited lemon for the lime and that was very good too.\nBe sure to add the zest as it wasn't the same without it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicky C"
},
"reviewBody": "I'm a Culinart Arts student and I made this as a homework assignment and boy oh boy did it go over big! It's very rich and creamy, I just called it a cheesecake and went with it. This also works INCREDIBLY well as a frozen dessert. You do have to let it thaw a little before cutting into it, maybe 10 minutes or so, but it's soooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattiA"
},
"reviewBody": "I've never been much of a dessert maker. No confidence really. But this recipe was so easy and so good, my family was really impressed!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "missmarilynwb"
},
"reviewBody": "This was okay but not worth the expense. None of the flavors were strong enough to come through-not even the chocolate. The texture was nice and it looked pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Persephone"
},
"reviewBody": "This was delicious! I made this for my husband's birthday, particularly because it is waaaay toooooo hot to turn the oven on right now in Southern CA.\nThe texture is light, the ginger snap crust is far better than the typical graham cracker crust, the tanginess is refreshing, and the cheesecake has already disappeared from the fridge. I am very picky about desserts, having worked as a pro baker. THIS IS VERY GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ONE88FAN"
},
"reviewBody": "My family really enjoyed this recipe. The only thing I would change would be the name - I would call it No Bake Lime Cheesecake! Easy to make - the flavors blended perfectly - light, rich dessert that will be made again at my house. Thanks for sharing this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/54684/no-bake-lime-mousse-torte/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
"name": "Cheesecake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14682/desserts/cakes/cheesecake/no-bake-cheesecake/",
"name": "No-Bake Cheesecake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/54684/no-bake-lime-mousse-torte/",
"name": "No Bake Lime Mousse Torte"
}
}
]
}
}
, "about": [
]
}
]