				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No Bake Key Lime Pie"
,"datePublished": "1999-04-14T13:42:09.000-04:00"
,"dateModified": "2022-07-14T17:15:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Shirley"
,"url": "https://www.allrecipes.com/cook/24328280"
}
]
,"description": "Lemonade is brought to a boil on the stove, with lime gelatin, cream cheese, and whipped topping stirred in. This creamy, citrusy filling is poured into a graham cracker crust and slipped into the fridge or the freezer -your choice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ETH1nZ9x_nkTU7pe6qWUBs6aaOM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1060512-35d8d9a287f143a3b493b1444c3401c7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No Bake Key Lime Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "34"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "405 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "0 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "242 mg"
,"sugarContent": "41 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 (12 fluid ounce) can frozen lemonade concentrate",
"0.5 cup water",
"1 (3 ounce) package lime flavored Jell-O® mix",
"1 (8 ounce) package cream cheese, softened",
"1 (8 ounce) container frozen whipped topping, thawed",
"1 (9 inch) pie crust, baked" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the lemonade and the water to boiling. Add the gelatin and the cream cheese and blend well."
} ,{
"@type": "HowToStep"
,"text": "Fold in the non-dairy whipped topping."
} ,{
"@type": "HowToStep"
,"text": "Pour mixture into the pie shell and chill or freeze. It&#39;s a breeze!"
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Wise"
},
"reviewBody": "Delish! No changes 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MollyR_CA"
},
"reviewBody": "I followed the recipe and my pie came out very green in color (just in time for St. Patties Day). It was sweet but a little too limey. Need to practice more, but I think with a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred's Bake Shop"
},
"reviewBody": "Poured the mix into two empty cottage cheese containers and froze. Makes the best, creamy ice cream...ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanda"
},
"reviewBody": "Aawesome!! And very easy to make. My husband loves it and always want it now as a lite treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I made this for Christmas. My mom loves lime. I made a few adjustments after reading the reviews. Mine turned out great and was gobbled up.\nI did fine tune the recipe a little. I used sugar free lime jello and used 12 ounces of made crystal light lemonade. I also used sugar free cool whip. Also used 2 pkgs cream cheese.\nCool liquid before adding to cream cheese, blend with electric mixer, add cool whip and fold. I only used 3/4 of the cool whip. Texture was great and stayed firm. Best to refrigerate overnight, If you like tangy it is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda G"
},
"reviewBody": "I followed the comments of others. I cooled it down first before adding the cream cheese and whipped topping. I also used lime aid and a graham wafer crust instead. It turned out great, but quite tart. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lisa Denning Fowler"
},
"reviewBody": "It would have been nice if the instructions would have told you to cool the gelatin lemonade mixture first, then blend in the cream cheese , then fold in the cool whip...... if you follow the instructions as written this pie will never set up!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Milyhoou"
},
"reviewBody": "Meh. My husband liked it a lot, and it was pretty good, but I'm unlikely to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeAnn Baxtresser"
},
"reviewBody": "Very easy and quick to put together, but it takes a while to make while you wait for things to cool (I made my own graham cracker crust that had to cool before adding the filling. Wait to fold in the whipped topping until the heated jello mixture has cooled to the touch. Wait for the filling to set.)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this came out very good.. it was a little too sweet for me but my parents, bf, and gram all loved it.. i had enough filling to make two pies but then again i was using the store bought premade crusts.. i used tofutti cream cheese and truwhip for the whipped topping as my mom is lactose intolerant and i wanted her to have some too.. bf is already talking about me making this again.. ty for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aliciamarie"
},
"reviewBody": "kids and i loved it, husband said too strong lime taste so next time i would lessen the lemonade and maybe add a package of cream cheese and top with more whip cream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karg"
},
"reviewBody": "I added my cream cheese before it was cool and cool whip after and it turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzybel57"
},
"reviewBody": "The flavour was excellent, the pie was super simple to make. The only thing was my cream cheese went lumpy, I'll use my immersion blender to smooth it out next time. Also I didn't have frozen whipped topping so I used the stuff in a package, I thought I might have problems but it set perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarGar Marchand"
},
"reviewBody": "Yes, I put the filling in small glasses and whip cream on top.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrsAouita"
},
"reviewBody": "This was a nice flavor but make sure you let everything cool before adding the cream cheese and whipped topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I was quite pleased with how this turned out. I did read the reviews prior to making this and I'm happy to say that I did. When I added the cream cheese into the boiling mixture it began to form into little clumps so I quickly attacked them with my immersion blender to smooth them out. I did let the mix cool before adding the whipped topping and it blended well. I use a graham cracker crust and limeade for the pie. I did freeze the pie and it turned out perfect. The first bite will be a little tart but you'll be going back for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "QueenC"
},
"reviewBody": "I waited till the mixture cooled before adding the whipped cream and I also used the whipped cream cheese in the mixture and it turned out fantastic! I also substituted the lemonade for the lime ade and I put it on top of an already cooled cheese cake that I made earlier in the day and put it in the freezer to set and everyone said that it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahML"
},
"reviewBody": "I haven't tried making this yet but I think what I would try, given other people's comments and experience with it not setting up: bring the juice, water and gelatin to a boil, then cool that until it is firm. Once the gelatin mixture is firm, then mix in the cream cheese, followed with folding in the whipped topping. I also think I might make it in a graham cracker or cookie crust instead of the traditional pie shell. (Even though I haven't tried it yet, I'm rating it a 4-star for simplicity.) I'll let you know what happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary C."
},
"reviewBody": "I cooled the jello mix before adding the cool whip. After a couple of hours in fridge, it was still soupy. Also too tart for us. I'm putting in freezer to see if it's better tomorrow. But am afraid I'll end up throwing out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ari"
},
"reviewBody": "This recipe sure left out some steps. You have to cool the jello/limeade mix before adding the cream cheese. I would actually say to use your mixer to whip the softened cream cheese, then gradually add the jello/limeade. I would also leave out at least 4 oz of the limeade concentrate. I'm so mad that I wasted the ingredients. I'm actually going to try to take the filling out and mix in another pkg of cream cheese so that I can eat it, I don't want to throw it away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "muddyh2os"
},
"reviewBody": "I thought that this pie was very tasty but the texture was not what I was hoping for. If you like the whipped yogurt that is Key Lime flavor you'll like this pie. I used limeade, and the juice from 2 freshly squeezed limes and a grahm cracker crust. Good taste and light texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janel"
},
"reviewBody": "Fabulous! This turned out beautifully. As other people had recommended, I waited to add the cream stuff til it had cooled a bit. Also, I froze it to harden it in time, and it turned out great! Thanks for a delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Hakala"
},
"reviewBody": "I made this for Thanksgiving for my husband who loves Key lime pie. He loved it!!!! It will be in our family recipe box forever, thanks so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carey"
},
"reviewBody": "The flavor of this was great! I read the reviews and let the limeade/jell-o/cream cheese mixture cool completely before adding the Cool Whip, but it still didn't firm up in the refrigerator. I made a few \"tester\" mini pies and put them in the fridge and freezer at the same time so I could tell/taste when they were ready. The frozen pie was ready in about 2-3 hours, and was a great texture straight out of the freezer. The refrigerated pie sat all day and overnight, and was barely firm enough to hold its shape but was too goopy...kind of like pudding. I liked it with the limeade but would cut back next time on the concentrate because it was pretty tart (my husband and I liked it but like sour sweets). It's still great right out of the freezer, I'll make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MYSTY1"
},
"reviewBody": "This pie was very good. I Will make this many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SAMCGRAW"
},
"reviewBody": "I have experience making key lime pie but was looking for a no bake version to try. This recipe was terrible ~ or at least following the directions that were listed. I read in other reviews not to add the whip cream until after it cooled, but of course, didn't read this until it was too late. Mine turned out runny with little lumps and I had to put it in the freezer for it to even firm up. Tasted awful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This flavor on this is amazing - a great tangy kick and super sweet - but when I went to serve it the slices immediately \"melted\" on the plates! I did allow the mixture to cool before adding the cool whip like a previous poster sugggested, and it stayed in the fridge for several hours before I tried serving it, but I guess that wasn't enough to fix the problem. We tried freezing the pie for an hour, but even then it was still a bit runny. Everyone loved the taste, though - so I guess I'll just have to serve it frozen solid in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for Easter...it was a huge hit. I did substitute limeade for the lemon and I used a graham cracker crust..it was wonderful. Yes, you do let the mixture of water, lemonade, jello and creamcheese cool before adding the whipped topping. Mine came out firm right out of the frig....thank you so very much. Everyone loved your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I use limeade instead of the lemonade for a very authentic flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DREW810"
},
"reviewBody": "I'm not sure if I made some kind of mistake...but it didn't indicate to let the lemonade mixture cool before adding the cream cheese and whipped topping. My pie just never seemed to set well, stayed kind of runny. Flavor was pretty good but texture was just not right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Mmmmm!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12570/no-bake-key-lime-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
"name": "No-Bake Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12570/no-bake-key-lime-pie/",
"name": "No Bake Key Lime Pie"
}
}
]
}
}
, "about": [
]
}
]