				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No-Fail Bean Pie"
,"datePublished": "2020-06-18T23:43:46.000-04:00"
,"dateModified": "2022-11-30T06:48:12.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Imam Qadriyyah S Mabel-Doroth"
,"url": "https://www.allrecipes.com/cook/446617"
}
]
,"description": "This bean pie is a traditional Muslim recipe made with canned navy beans, evaporated milk, and sugar. It&#39;s similar to pumpkin pie but not as sweet."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/o7--wU1Gh2_ojlTz8RzpCmYXauQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1672943-b803e731de2f4b678906d2923072e6f1.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No-Fail Bean Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "150"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "407 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "71 mg"
,"fiberContent": "4 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "442 mg"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (14.1 ounce) package double-crust pie pastry, thawed",
"2 (15.5 ounce) cans navy beans, rinsed and drained",
"1 (12 fluid ounce) can evaporated milk",
"2.5 cups white sugar",
"0.5 cup butter, melted",
"2 large eggs",
"2 large egg yolks",
"2 tablespoons all-purpose flour",
"2 tablespoons vanilla extract",
"1 teaspoon ground cinnamon",
"1 teaspoon grated nutmeg" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C). Place each pie pastry into a 9-inch pie pan."
} ,{
"@type": "HowToStep"
,"text": "Place navy beans and evaporated milk into a food processor. Add sugar, melted butter, eggs, egg yolks, flour, vanilla, cinnamon, and nutmeg; pulse a few times, then process until smooth, about 1 minute. Pour mixture into the prepared pie crusts."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 15 minutes, then reduce heat to 350 degrees F (175 degrees C) and bake until filling is set and crust is golden brown, about 35 more minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven and let cool for 1 hour before slicing."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I LOVE THIS RECIPE! And so does everyone I serve. I did tweek it a bit! Cutting out half the sugar to start...But to each their own adventures in taste. 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Can't wait to try it thanks for the recipe. I added my little touch to it tho."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great!!!! I used a bag of beans and slightly undercooked / puree them. This gave the puree mixture a little bit of texture that gave the impression of a oatmeal crunch to it. I made my own crust with a lard recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Edwards"
},
"reviewBody": "Love this easy recipe! 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the directions and also took the advice of other users by reducing the sugar content down to two cups replacing white with brown sugar and also using a Graham cracker pie crust.I baked it at 350 for about and hour. Like it says no fail! Just tweak to your liking and taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy to make. Used Rancho Gordo Río Zape beans (hints of chocolate and coffee according to description). Also used half brown sugar and half refined. First tried this pie at O Dinis, East Providence RI. This version is very similar and we will make this again. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this pie so many times that it has become a family staple. Perfect every time the only thing that I did differently was use brown sugar in place of the white sugar and I added ginger 1/8 tsp. This is a winning pie and a holiday staple for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is wonderful. Simple to follow and came out great! I moved from where I could get a bean pie whenever I desired to the south where no one knew what a bean pie was! But now I can make it myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I couldn't find navy jeans so I used Northern beans and rinsed them well. I had batter left over after filling pans so I added flour and made bean pie fritters. Great snack for my flight back home. Not sure how it will taste. Pies are light. I will refrigerate over night and hopefully they will brown. Grew up in the nation of Islam bran pies we're our entamanns. Easy recipe to follow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have had original Bean Pies for 40 years and this recipe is excellent! Taste just like my mother's Bean Pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dyalelah"
},
"reviewBody": "My first time ever and it came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made bean pie and I added a few tweaks but it turned out really good just follow the directions and you should not fail!!!! To get the golden brown color like this I use brown sugar and softened almost melted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ask"
},
"reviewBody": "Very good, Sister. Well done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sjbw100"
},
"reviewBody": "Hi, first thank you for the recipe. I made it using my immersion blender. I would reduce the amount of sugar. Perhaps add 1 cup, taste and add sugar until your personal sweet level is reached. The grated nutmeg is lovely. I thought the 2 tablespoons of vanilla would be too much, but it was perfect. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Christina"
},
"reviewBody": "This is good. I will get a slice once it cools all the way down. The boys didn’t want to wait so theirs were still rather warm. Like most I cut the sugar to 2 cups and also added a dash of clove and ginger. And a teaspoon of almond extract. Don’t think I will use the almond extract next time for this recipe it was a bit overpowering and will use brown sugar instead. Even still it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "I could not taste it myself (due to dairy allergies), but the person for whom I made it just sent me a message saying \"it was delicious\"! I made 2 changes to the recipe. 1) I omitted the nutmeg. 2) I decreased the sugar to 2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sifood"
},
"reviewBody": "Similar to what mom used to make. She added lemon juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "I thought this dish was delicious! I substituted (1) cup of liquid concentrated apple crystals ( you can find in sugar section at Walmart) for sugar. I also used 3 whole eggs, 1 cup of navy beans, a whole stick of butter and added mace to the cinnamon and nutmeg called for in the recipe. I got a chance to taste pie again without processed sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaheedah Abdullah Caradine"
},
"reviewBody": "The pie is good but it's not like Muslims from Asia, Africa or the Middle east eat bean pie. They have never heard of it. They think it's gross to make a desert out of beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Journelle Clark"
},
"reviewBody": "Thank you so much for conducting a trial and error with this bean pie, and being kind enough to share. I followed the recipe for 1 pie, and took the suggestions of a reviewer and put in the oven at 350 for 70 minutes. Came out perfect—crust and all. My 11 yr old daughter and I made it together. Thanks so much. I tried to upload photos but had a hard time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PK1983"
},
"reviewBody": "This was a huge hit for Thanksgiving and I’ve made some skeptics into bean pie lovers. Followed the recipe exactly except cut the sugar by a 1/2 cup per the other reviews. It was delicious! All the little kids in the family love it too. It doesn’t have that darker brown color you normally see when people sell bean pies in the street (maybe those have some dark brown sugar) but the taste is phenomenal. This will be part of or rotation now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S Turpin"
},
"reviewBody": "My husband loves bean my, but I didn't know how to make it...until now! He loved the pie. We had a place in our neighborhood but they closed. I followed some user tips and my own tweaks 2 1/4 cup white sugar and 1 tblsp brown sugar, baked at 350 for 1h 10m. The pies turned out great after they settled. I used a blender to mix the ingredients DONT OVER PULSE. The batter will be a bit loose but will bake up great. The next day they are even better, the color deepens and the flavor is awesome. Who knew you could turn beans into a delicious dessert, gonna add a little whip topping and next time use the egg whites as a little merguie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ketra Thomas"
},
"reviewBody": "This is my very first experience making bean pie!! Someone requested me to make it. I was sooo skeptical!! But when I say that I was pleasantly surprised by this!! It tastes like a cross between a Chess pie and a sweet potato pie. Custard like sweet and flavorful through and through. My 2 year old even asked for 2nds and he is super picky! If he knew Navy Beans were the main ingredient he probably would run! Lol thanks for the experience!! Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam M"
},
"reviewBody": "This was better than awesome. I used light brown sugar and it was so good. Easy to make and I used my Bullet because I don’t have a food processor. I split my ingredients in half using my Bullet. Thank you. Don’t forget vanilla bean ice cream ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Tippy"
},
"reviewBody": "I cut the recipe in half to make one pie and used half brown sugar half white. Superb!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita L Thompson"
},
"reviewBody": "I was craving a bean pie. So I decided to see if Allrecipes had this recipe. To my surprise, it was here. So I decided to make this bean pie from scratch. (I need to work on making pie crusts though.) LOL. I didn't have navy beans so I substituted northern white beans instead. Other than the beans, I stayed with the original recipe. The recipe came out great. Many thanks to the author for putting this recipe together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KyEaria"
},
"reviewBody": "I made mine with dried beans and cooked them on the stove instead of using canned beans. Next time I will need to make sure that I keep my food processor blending for a longer period of time so as to make sure the beans are fully pureed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brian White"
},
"reviewBody": "Taste was interesting, not objectionable, but a little bland or flat. (Beans used in this way aren't as exciting as baked beans with brown sugar &amp; bacon.) Flavor could be enhanced with addition of 1 cup pureed coconut(sweetened) per pie. I cut the recipe in half for one pie, which worked out fine. I'm glad I tried this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobbette Stewart-Thomas"
},
"reviewBody": "It was a little too sweet so I would do 2 1/4 cups of sugar next time. I also added 1 teaspoon of Almond Extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jas White"
},
"reviewBody": "Great recipe! I recommend running the beans through a fine mesh strainer to help remove the skins after purée. Or removing the skins before purée"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smokella B"
},
"reviewBody": "I lost my recipe that my husband's grandma gave me, and this is so close to hers thank you for posting it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "Loved it. Shared it with the men of the family, and some of their friends. They loved it. Of course I added a pinch more of this and that for a little more flavor. I have made them weekly around holiday time and plan to make them again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Palazzo"
},
"reviewBody": "I will definitely make this again, but next time I'm going to try and use a sugar substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Palazzo"
},
"reviewBody": "I will definitely make this again, but next time I'm going to try and use a sugar substitute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jecories Williams"
},
"reviewBody": "I followed the recipe to my personal taste. I like pretty much all my pies sweet except pies with meat or without berries. When I made this I followed the recipe I found but added more vanilla, sugar, butter, and even added brown sugar to the recipe. What I got was so scrumptious before I put it in the oven...I was so excited. Now I have the pie setting and cooling off. I made this pie from scratch. The crust was from flour, brown sugar, and butter. Wow! This crust is so good! I'm excited about this pie. Oh and I soaked the beans over night. Then I got a huge cheesecloth and cover the inside pot with the cloth. I then put the beans in the middle and folded the cheesecloth. I poured water around the inside of the pot and boiled the beans for a few hours. I smashed the beans a few times. Having the cheesecloth prevented the beans from burning and it kept the beans moist. I would recommend using cheesecloth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Salnoor"
},
"reviewBody": "This pie was easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La Reice Williams"
},
"reviewBody": "Absolutely love this bean pie recipe and you are absolutely right, this is a no fail, fool proof recipe, that's why it's my go to when I want to make this for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sister J. Muhammad"
},
"reviewBody": "I've actually used this recipe MULTIPLE times! I love it! It stays true to the \"no fail\" name! It tastes like I bought it straight from the Eat to Live Cafe!! APDTA!! Thank you for this post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent Walker"
},
"reviewBody": "Can out great. I've always wanted to try one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Childress"
},
"reviewBody": "I love this recipe I also added a pinch of Ginger and a touch of lemon extract when it was done I topped it with whipped cream sprinkled it with cinnamon sugar. I have also cut the recipe in half and baking a graham cracker crust and it came out fabulous!! this also works well with Great Northern beans if you use a graham cracker crust make sure to cut the cooking time in half as well and watch closely they cook pretty fast!!!!!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Nicholas"
},
"reviewBody": "I didn't realize I was low on sugar, so I used both white and brown. I also couldn't find Navy beans at whole foods, so I used great white beans. Tasted a little \"beanier\" than if I would have found the correct type, but it was very delicious and reminds me of when my mom was on a nation of Islam kick after my father walked out on us. Weird memory, great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zoe Girl"
},
"reviewBody": "I’ve been following this exact recipe for a while now and it’s always delicious! It’s super easy and fast to make and always tasty. I’ve brought it over to work get togethers and family functions and only good compliments! Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mommy4eva"
},
"reviewBody": "I made this today and it is divine. The only change I made was to substitute 1 cup of dark brown sugar for one of the cups of sugar. I also used a vanilla wafers pie crust. This recipe is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gina"
},
"reviewBody": "Made this for Thanksgiving and my family loved it!! I did substitute 1/2 a cup of sugar for light brown sugar and it was perfect. I will definitely be making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody Binford"
},
"reviewBody": "I followed the recipe and it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat Heeringa"
},
"reviewBody": "Easy to make, it was difficult to find Navy beans so I substituted with cannellini beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jocelyn REM"
},
"reviewBody": "So very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Has Mazlom"
},
"reviewBody": "amazingly easy to make and can't go wrong with the directions. best kind of pie you'll ever have i your life"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The first time I made this recipe was the first time my family had a bean pie! They loved it! My mom took a pie home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Banks"
},
"reviewBody": "I made one pie and didn’t change a thing and it was DELICIOUS!!! My fiancé loved it and said it’s better than the usual sweet potato pie I make. This is going in my personal cookbook and thank you so much for sharing. I wish I could add more stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Singleton"
},
"reviewBody": "This recipe is fantastic. A nice change of pace for dessert, and very easy to make. Will make again for holidays and special occasions when I want to know for sure I’m bringing something different to the dinner table for family get-togethers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Armywife2248"
},
"reviewBody": "My very first time making this recipe and very first time tasting a bean pie!! I followed this recipe almost to a T. I only used 1 3/4 cups of sugar, I used dried great northern beans (let them soak all day), I used a premade graham cracker crust, and I used my vitamix. It was so creamy and sweet and delicious!! Would never be able to tell I used beans, because it does not taste like beans at all. I love the cinnamony taste!! Excellent recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Khadijah Ashanti-Shabazz"
},
"reviewBody": "No Fail Bean Pie. I made no changes and yes, I will make this again, to the T. I loved it and so did my child. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueeNia AsheeMa'at"
},
"reviewBody": "This is my first time I made the Traditional Navy Bean Pie that I was introduced to by the SiStars of the Nation of Islam. I made mine without crust to save myself some calories because I am calorie counting. \n\nThis recipe from allrecipes.com Called \"No Fail Bean Pie\" says that it is 539 calories per serving but I made mine without crust. I save myself 108 calories. 431 for a healthy treat!\n\nThe recipe calls for 2 Tbs of Vanilla - I substituted 1 of those Tbs with 1 Tbs of Maple syrup. I also substituted the canned Navy bean for dried beans which I soaked for a few days. I also made evaporated milk from a powder form.\n\nIt tastes close to what I'm used to in a bean pie. Although, I would like a creamier texture.\n\nI broke the last blender we had right in the middle of making this recipe! .\n\nSo if anyone has a food processor or heavy duty blender that that don't Love anymore I'll Love to have One. PLEASE aaaaand Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Long Island Red"
},
"reviewBody": "Perfect! So easy to make and extremely tasty. My mother requests them regularly. Authentic bean pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T Bizzy"
},
"reviewBody": "The only bean pie recipe i use! I just make slight adjustment by using brown sugar instead of white"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaykay"
},
"reviewBody": "It tasted like the ones that I used to eat in Chicago"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wisdom "
},
"reviewBody": "I love ,love, love, this pie. I made it a lot and can't keep it for more then a hour. You make it your own and thanks to this recipe I don't have to travel to New York to get one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Havad Saghbazarian"
},
"reviewBody": "My favorite pie. Unable some time ago to find any recipe. God Bless you for posting this! I haven't even tried it yet. Looks exactly like what I remember I tried, and seems perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharifa C"
},
"reviewBody": "I made this with 2 cups of sugar and it was awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virna "
},
"reviewBody": "I make this bean pie all the time and everyone LOVES!!! I use almost exact just a little less sugar more nutmeg &amp;cinnamon. I've got so good at it I don't even measure I can \"eyeball work\" ??????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Product Junky"
},
"reviewBody": "This is by no means a bean pie. I grew up eating bean pie after service every Sunday afternoon, purchased directly from the brothers at the Nation of Islam. This pie has minimal flavor, is not dense enough to be bean pie, and unfortunately the recipe makes two pies that I had to toss into the trash. I will keep looking for the actual bean pie recipe or create one myself. This recipe was extremely disappointing given the 5 start rating that it has. What a waste of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rheaniece"
},
"reviewBody": "It tasted amazing. I added about 1 more t cinnamon, 1 t ground cloves, 1 t ground ginger, and I put in brown sugar instead of white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn Hamilton"
},
"reviewBody": "This was really really good. I did replace a cup of regular sugar with brown sugar to get a darker color to the pie. I haven't had bean pie in about 7 years and couldn't find the lady at the mosque who was baking them so I'm ecstatic that now I can bake my own!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taqwa moody"
},
"reviewBody": "The first time I made it-(bean pie)- we used pinto in the bing and it was quite tasty. I've been home now 16 yrs to the day and have yet to find anyone to make it. So in 2011 thanksgiving, I followed your recipe with a tweak on the sugar and surprised all who had the pleasure of tasting. So it is only fitting that I celebrate my sweet 16th year home (without interruption or further adieu), with grilled Cornish hens and Bean pie. Y'ALL BE COOL!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PurplePlus"
},
"reviewBody": "No fail is correct! Even with a few substitutions, this pie is great. I made the following substitutions out of necessity: I used pinto beans instead of navy beans, just over two cups of light brown sugar instead of white, and vanilla bean paste instead of vanilla extract. Everyone asked for 2nds. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LdH"
},
"reviewBody": "Did not make any changes. Love this pie. My grands love it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pro Chef A"
},
"reviewBody": "I just brought it out the oven. It smells great. I haven't tasted it yet but I will update once I have. The difference in the ones that I know from muslims in New Jersey, is that the color is darker. The darker color looks more appealing to me. If anyone has any ideas let me know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bc&hood"
},
"reviewBody": "Made this for my friend who truly loves Bean Pies and I got two thumbs up! I just cut the sugar to 2-cups. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Le-TopTop"
},
"reviewBody": "Advice? Read the comments some are very helpful. This was my first attempt and my pies came out superb! I used only 2 cups of sugar (per the comments) and I cannot rave enough! Awesome recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queen B"
},
"reviewBody": "It was so good, I will use less sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ettennam"
},
"reviewBody": "Very good. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Wolfe"
},
"reviewBody": "To call this a traditional Muslim dish, it might be best to specify the vanilla extract must be alcohol free. That said, I made this as directed and with the frozen pie crusts in the foil pans. I think the bean mixture could have used twice as much time in the food processor (I kept getting bits of bean skin that was texturally distracting) and they got rather dark after the first 15 minutes at 450. I would suggest that you bake in the bottom third of the oven or use a pie shield/foil wrap the crust. The pie has a nice flavor and a very curious texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lphoenix"
},
"reviewBody": "I used condensed milk instead of evaporated and omitted the sugar. Delicious!!! Phoenix"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas"
},
"reviewBody": "They lasted 2 days. I am getting ready to start my new year out with two more of these pies. I used 2 cups of sugar i.o. 2.5cups and I used 1 can of pinto beans and 1 can of white beans and the taste was what I hoped. I do appreciate you sharing your recipee. It was a prayer answered. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Rawls"
},
"reviewBody": "I altered it a bit, I used 1 1/2 cup of granulated sugar with 1/2 cup of brown sugar, I used 4 eggs and baked both pies at 350 degrees for 1 hour (I also had extra filling left. This recipe is absolutely amazing and I've never had bean pie before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nolaummi"
},
"reviewBody": "I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hasana K"
},
"reviewBody": "This was a perfect bean pie. I was raised a Muslim and my mom made bean pie for years. She's elderly now and I wanted to surprise her by making it all on my own. The recipe was an easy follow. I used pre-prepared vegetable shortening crust. The only thing I changed was instead of using canned beans, I used fresh beans from the farmers market, and added an extra teaspoon of vanilla. I will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ruqayyah muhammad"
},
"reviewBody": "I love bean pie. I grew up on it. Then I learned how to make it myself. I use brown sugar instead of white. Almond milk instead on caned. 4 whole eggs. It's always delishious but..... I always get this really shinny film on top after a few hours. Although this doesn't take away from the taste. It does take away the beauty of the pie. How can I get ride of this shinny wet film?....... Pleeeeease."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dymplez_2002"
},
"reviewBody": "It turned out delicious. I only did the 2 cups of sugar also. It taste like the ones from the muslim restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Mitchell"
},
"reviewBody": "I added an extra cup of sugar and tablespoon of vanilla extract the 2nd time I made it, and it tastes more like what I usually get from Mohammed's restaurant (Detroit). Mmmmmmm! I love bean pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia"
},
"reviewBody": "This was a great recipe! I agree with others 2 1/2 cups of sugar is too much. Next time I'll drop a 1/4 or 1/2 cup. I also used a blender after I used a potato masher first. As others have said, they were tan in color but, I turned the oven on 400 for the last 20 mins and they were nice and brown. The next time I will cook on 350 for the hour and ten mins as suggested. One person was correct, after refrigerated over night, they taste better and the color is then the rich brown we're used to. So easy! I will make it again. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion Jackson"
},
"reviewBody": "So yummy! I made this and it came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "January Jackie"
},
"reviewBody": "Delicious and easy-to-use, next time I will use less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "veggiecook@"
},
"reviewBody": "Wow, this is really awesome thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shamaiye crenshaw"
},
"reviewBody": "I grew up eating bean pie so I am a very tough critic. I changed some aspects of the recipe which I will not give away my secrets here (Ha!). I did not have Navy beans but the pinto beans I used worked out great. Thank you for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kwabena Dinizulu"
},
"reviewBody": "Have been following and experimenting with this recipe for a few years now. And have had excellent results. It's ironic, after all these years I'm still introducing people to the Bean Pie. Most have heard of it but not tried it. I'm winning a few new converts. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMMGOOD!"
},
"reviewBody": "Thanks for sharing this delicious recipe! I will definitely make it again. My family loved it! I grew up in Jersey eating bean pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan scalise"
},
"reviewBody": "Wonderful recipe. All who tried it, loved it. I did make a couple of mistakes; I also did not have nutmeg. My food processor has a liquid fill line and the evaporated milk was too much. I forgot to add it later and I forgot to put the flour. I did come out scrumptious but, I will not forget the rest the next time. Just a note this will not be creamy like a pumpkin pie. The texture is like none other and the flavor is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marisa915"
},
"reviewBody": "I made this minus so much sugar. I only used 1 cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mis Vaper"
},
"reviewBody": "Delicious!! I have made this about 10 times now. My husband loves them. I actually use 3 cans of beans now and increse all the other ingredients accordingly because I like my pie crust to be full to the brim. I then also have to ccok it a little longer. We use to get bean pies in the city of Baltimore but we now live an hour away so I was looking to try to make my own and this recipe is perfect. People think a \"bean pie\" does not sound like it would be good and are always pleasanytly surprised when they try it. I usually say it is similar to a sweet potato pie. If you like sweet potato pie you will probably like this recipe. Great with a little whipped cream or cool whip. Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ontonio Payne"
},
"reviewBody": "I made it with black beans and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Drachen Andariel"
},
"reviewBody": "Nice pie. Not to be nit-picky, but this is a traditional African-American muslim bean pie. I would substitute a homemade crust for the ready-made crust to keep with the tradition and roots of this dish. An additional of brown sugar with the white sugar would result in a richer, darker color and taste. Additionally, make sure to use a vanilla extract that does not contain alcohol! Well done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette"
},
"reviewBody": "I use condensed milk instead of evaporated milk. 2 cups of sugar only. My family loves this recipe. Thanks for sharing your recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mizbizc"
},
"reviewBody": "This was my first time attempting to make a bean pie, and it went very well! I made a few adjustments to the recipe as written. I used 1 cup of white sugar and 1.5 cups of dark brown. I only used a half teaspoon of nutmeg. I used 3 teaspoons of vanilla rather than 2. I used 3 eggs and 2 yolks rather than 2 eggs and 2 yolks.I used a blender rather than a food processor. I baked on 350 the entire time rather than switching temps. The recipe makes 2 pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Alyea"
},
"reviewBody": "My boyfriend is allergic to pumpkin so unfortunately I have never been able to introduce him to Pumpkin pie. This tasted similar and he loved it. I took someone else's suggestion and used brown sugar and cut the measurement a bit and it was perfect. Thanks so much for this :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie To Blessed Rollins"
},
"reviewBody": "I make this pie at least once a month. Me and my family love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cut Out the Creativity"
},
"reviewBody": "Fabulous recipe! I shared the bean filling at a shared meal [with no crust]. Looked country-style baked, was light tasting, [I added a cake frosting to appear more dessert like.]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fatiha Jones"
},
"reviewBody": "It looks delicious. I'm gonna make this today."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216354/no-fail-bean-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/79/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216354/no-fail-bean-pie/",
"name": "No-Fail Bean Pie"
}
}
]
}
}
, "about": [
]
}
]