				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No-Noodle Zucchini Lasagna"
,"datePublished": "2019-04-03T23:46:32.000-04:00"
,"dateModified": "2022-05-16T09:42:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jill Welch"
,"url": "https://www.allrecipes.com/cook/1530738"
}
]
,"description": "Zucchini lasagna lets thin slices of its namesake veg stand in for noodles. A homemade meat sauce, fresh herbs, and three cheeses make it irresistible."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/S-SIGHhbeJrh2r9B7eqeH1s3Q5g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6287281-2714d0236bc14e8fbf4c946c99dd5592.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3625627348001",
"description": "See how to make a meaty, veggie-filled lasagna that’s completely gluten-free.",
"duration": "PT4M41S",
"name": "No-Noodle Zucchini Lasagna",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/46205a28-ad2f-476f-b3f3-d0734ed5af64/c68d4f53-c8be-4711-86c3-e2fb48047c7b/1280x720/match/image.jpg",
"uploadDate": "2021-03-02T03:29:33.513-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No-Noodle Zucchini Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "669"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "494 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "118 mg"
,"fiberContent": "6 g"
,"proteinContent": "41 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "2200 mg"
,"sugarContent": "11 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 large zucchini",
"1 tablespoon salt",
"1 pound ground beef",
"1.5 teaspoons ground black pepper",
"1 small green bell pepper, diced",
"1 onion, diced",
"1 (16 ounce) can tomato sauce",
"1 cup tomato paste",
"0.25 cup red wine",
"2 tablespoons chopped fresh basil",
"1 tablespoon chopped fresh oregano",
"3 tablespoons hot water, or as needed",
"1 (15 ounce) container low-fat ricotta cheese",
"1 egg",
"2 tablespoons chopped fresh parsley",
"1 (16 ounce) package frozen chopped spinach, thawed and drained",
"1 pound fresh mushrooms, sliced",
"8 ounces shredded mozzarella cheese",
"8 ounces grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Grease a deep 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Slice zucchini lengthwise into very thin slices. Sprinkle slices lightly with salt; set aside to drain in a colander."
} ,{
"@type": "HowToStep"
,"text": "To prepare the meat sauce, cook ground beef and black pepper in a large skillet over medium-high heat, stirring, for 5 minutes. Add green pepper and onion; cook and stir until meat is no longer pink."
} ,{
"@type": "HowToStep"
,"text": "Stir in tomato sauce, tomato paste, wine, basil, and oregano; add a small amount of hot water if sauce is too thick. Bring to a boil; reduce heat and simmer sauce for about 20 minutes, stirring frequently."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, stir ricotta, egg, and parsley together in a bowl until well combined."
} ,{
"@type": "HowToStep"
,"text": "To assemble lasagna, spread 1/2 of the meat sauce over the bottom of the prepared pan. Layer with 1/2 of the zucchini slices, 1/2 of the ricotta mixture, all of the spinach, followed by all of the mushrooms, then 1/2 of the mozzarella cheese. Repeat by layering in the remaining meat sauce, zucchini slices, ricotta mixture, and mozzarella. Spread Parmesan evenly over the top; cover with foil."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 45 minutes. Remove foil; raise oven temperature to 350 degrees F (175 degrees C), and bake an additional 15 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/S-SIGHhbeJrh2r9B7eqeH1s3Q5g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6287281-2714d0236bc14e8fbf4c946c99dd5592.jpg"
}
]
,"text": "Let lasagna stand 5 minutes before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is one of my all-time favorite recipes that I've been making for quite some time. I love pasta and really don't miss it in this recipe. It has amazing flavor and although it takes some time to put together (don't skip sweating the zucchini!), I don't mind at all. The recipe makes a large pan, it gets better over the next few days and since there are only 2 in my home, I section it and freeze portions I don't eat within the first few days for quick meals. I use fresh spinach instead of frozen and I like to substitute Italian turkey sausage for the beef. Just a really solid recipe that even my picky daughter loves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! Used mushrooms but not spinach. Used a jar of sauce. It was pretty juicy at 45 min of baking, baked addl 30 mins uncovered &amp; it set up after sitting for about 15 mins after out of oven. Even the skeptics in my extended family liked it! It was even better the next day for lunch! Thanks for sharing, I’ve been wanting to try this. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kannala"
},
"reviewBody": "Wonderfully tasty! My whole family loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "This is an awesome recipe. I served it to my friends and they loved it too. It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "I liked the idea of using zucchinis instead of noodles plus the spinach and mushrooms. Next time I will leave out the tomato paste (didn't like the taste it gave and had to add sugar). I added fennel and anise to the meat to give it more of an Italian sausage flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Soo good, even better as left overs next day. Squeeze out every drop of water you can from the zucchini and spinach for less watery result. It does hold together nicely once cooled in the fridge..that's why I say left overs! This is my second time making this..me and my boyfriend love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "This is a total winner of a recipe. Super low in carbs, filling, delicious and a great use of our big zucchinis from the garden. The sauce is incredible and works great with dried oregano and basil. Just reduce by 2/3. Made it twice this summer already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "maria"
},
"reviewBody": "I thought it was very bland. The spinach overpowered the rest of the ingredients in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellybueker"
},
"reviewBody": "My husband said to put this in the rotation! I dried the zucchini in the oven at 350 for ten minutes on a parchment lined cookie sheet then transferred to paper towels while I prepared the casserole. I used a 24 ounce jar of mushroom Prego sauce instead of making sauce. I skipped the bell peppers, herb's,red wine, mushrooms. No water added. Used 2 pound's of beef. Two eggs to the ricotta and added a cup of parmesan to the ricotta. Used 3 cups of mozzarella in the lasagna and a cup of Parmesan to the mozzarella to the top. I baked the entire time at 350. Let sit for ten minutes. No water in the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geneveesubagmailcom"
},
"reviewBody": "Super happy with this recipe. I didn't have any issues with zucchini being under cooked or too much water in the pan. The only changes I made included using one large zucchini instead of 1 and a half, adding spinach and mushrooms, switching over to broil the last 15 minutes, and placing the dish on a cookie sheet while cooking. I might not add the nutmeg next time. Overall, pretty good meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rea407337"
},
"reviewBody": "This was okay. Agree with other reviews, some of the ingredients don't make sense.. especially the spinach. It was definitely different. It could have used a lot more Ricotta and cheese. If I made this again I would use two 30oz of Ricotta and probably double the cheese. The spinach can be left out. I made this with ground chicken, really didn't affect the taste. Mine also wasn't watery? I used all organic ingredients. Also didn't not add the egg at all that just sounds disgusting.. maybe it's just my preference, but no way. They taste and smell like something that came out of someone's rear end. I'm good. Definitely don't leave out the red wine in the sauce whatever you do, it really completes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent! It tastes like lasagna. I used fresh spinach (was out of frozen) mild Italian sausage instead of ground beef and I used a jar of spaghetti sauce in place of the tomato paste, sauce and herbs. Also I doubled the mozzarella cheese. It was a little bit watery but still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkaplan1955"
},
"reviewBody": "I liked the recipe but I added bread crumbs to cover the zucchini and I added Parmesan cheese as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "richard4872"
},
"reviewBody": "Everything turned out good. The only difference for me is I use twice the cheese and I like to use a mozzarella reggiano blend. I also like to roast the onions, peppers, and tomatoes on the grill for a couple of minutes for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nsburnett81"
},
"reviewBody": "Delicious, added 1 teaspoon of garlic powder and couple of pinches of cayenne pepper to the meat sauce. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Pro"
},
"reviewBody": "Prep was a little longer then expected but it turned out great and was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Y"
},
"reviewBody": "This was delicious! I cut and salted my zucchini a few hours ahead of baking and layered them in a colander with paper towels between each layer and I had absolutely no sogginess . I will definitely be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Cable"
},
"reviewBody": "Healthier and yet just as delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1WhiteTiger"
},
"reviewBody": "Great recipe,you don’t even miss the pasta.Since I’ve started making this recipe I never use pasta noodles any longer,plus so much flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed_n_Gail"
},
"reviewBody": "Great comfort food. Very delicious. My changes were dried herbs instead of fresh, three Tbsp crushed garlic, two Tbsp of brown sugar to the meat sauce and I used yellow, red, and orange sweet peppers. I sauteed the mushrooms before adding them and substituted a 24 oz jar of pasta sauce in place of the tomato paste and canned sauce. It took me over an hour to prep everything. At first, I thought this was a pretty spendy recipe. However, when I break it down it was about $2.50 per serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PEGGY221"
},
"reviewBody": "It was ok ... DEFINITELY NEEDS GARLIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Friedrich Estes"
},
"reviewBody": "This was a great recipe! I actually used Italian sausage instead of hamburger meat. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoxxInMI"
},
"reviewBody": "My husband is diabetic, he love traditional lasagna and has never been open to trying anything else. I found this recipe and made it and he loved it. He even said we could do this again. Thank you for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margie Robinson"
},
"reviewBody": "This was amazing! I was making this for a 13 year old so I omitted the spinach and mushrooms and she LOVED this despite her hate for zucchinis."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Lots of great flavor! It took me 50 minutes to prep and assemble, then another hour to cook and let cool; overall almost two hours to get it on the table. Family enjoyed it, too. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenpen"
},
"reviewBody": "This turned out amazing. I followed some other reviewers suggestions and sprinkled the zucchini slices with salt and then bakes for 12min at 350 degrees. Wasn't watery at all. I didn't add water to my sauce and used dairy free cheese and made a dairy free ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "curleegirl"
},
"reviewBody": "Delicious! I added fresh garlic and was very happy with this lo carb lasagna option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerber"
},
"reviewBody": "This was really good! I was pleasantly surprised. I tried to follow as much of the recipe as I could but didn't have all the ingredients, so I was forced to improvise. I was afraid it would turn out all soupy like other reviewers mentioned, mine was perfect. Here are my notes...I used a mandolin for slicing the zucchini, used the 'thick' slicer by mistake but it worked out better, thinner would have made it overcooked/too mushy. I only used a sm can of tomato paste, fresh tomato and a 1/2cup of water for the sauce.(didn't have tomato sauce) Added 1tsp or so of chicken bouillon powder for added flavor. Opted out the peppers (didn't have any), Used fresh spinach and mushrooms. Also didn't have mozzarella cheese, had to use cheddar. Oh, I used paper towel to absorb excess water from the zucchinis before layering. I believe that helped a lot. \nAnyway, even though I didn't have all the ingredients, it was still delicious! My boyfriend who is not a fan of vegetables, gobbled it up. So that's a win!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mritec"
},
"reviewBody": "Delicious! Several words of caution, however. It requires a LOT of prep work/time. Every step is time consuming and no way it will take only 30 minutes. Just being honest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer S"
},
"reviewBody": "Fantastic recipe. \nIn addition I used fresh garlic cloves, cottage cheese instead of ricotta added parmesan cheese to the cottage cheese layer with an extra egg.\n\nI also used in season yellow zucchini, which were longer and less watery than green zucchini."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dino"
},
"reviewBody": "My husband says he doesn't like zucchini, but loved this! It was unbelievable"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yvonne"
},
"reviewBody": "It's better if you saute the zucchini noodle slices first in a little olive oil, garlic and salt. I usually have two fry pans going. Put them aside when just soft with a little browning and they are much more delicious and the lasagna also does not get as watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin McG"
},
"reviewBody": "Fabulous recipe!! Some changes I made: Cooked lasagne in large cast iron pan. Used round cut (on mandolin) instead of long cut for zucchini. Used 4 lg—&gt; medium zucchini. Put all zucchini slices on clean kitchen towels, salted and let sweat for 20 mins then flipped and repeated on opposite side. \nLayering the same as making regular lasagne. Cooked covered, spraying inside of alum foil with cooking spray so fresh mozz slices on top didn’t stick. Total baking time 45 mins, not 30. Used baster to extract all liquid after 20 mins. Returned to oven for final 25 mins. Removed from oven, used baster again to remove excess liquid.Then placed lasagne under broiler uncovered for 5 mins to bubble/brown fresh mozz topping. Let sit, uncovered for 30 mins. Cuts well, serves well, tastes fabulous!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki Robinson Brooks"
},
"reviewBody": "I did not have bell pepper, so omitted that. I also used dried herbs (did not measure), and was out of parsley, so omitted that, as well. I did add garlic. Cooked and drained mushrooms before adding to the dish. Also used fresh spinach that I microwaved for a couple minutes before adding. With these minor changes, this was really good! A little watery, and did boil over and make a mess in the oven, so use a tray underneath."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Charles"
},
"reviewBody": "Delicious...non-Keto family really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimberly"
},
"reviewBody": "It looks and tastes great too....all I did was add 2 lbs of beef instead of 1lb..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray Josupait"
},
"reviewBody": "Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "esbdevlin"
},
"reviewBody": "This recipe is very good. I’ve made it twice now. I make it more vegetarian by using the “Beyond Beef” vegetarian meet. The only thing I would say is it is a little salty, so I briefly rinse off the zucchini slices and pat them dry after they have sweat their juices out. My other comment is that there is no way this takes only 30 minutes prep. It took me at least an hour in prep time with all the slicing and cutting for the ingredients, and then building the lasagna. And by the time I got the whole thing in the oven and the counters cleaned up it was more likely 1 1/2 hours of prep. So maybe I’m slow, but make sure to leave plenty of time if you are entertaining and expecting to serve it at a certain time, just in case."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "the moose"
},
"reviewBody": "Ok I made this. I'm sorry but lasagna noodles are the best part of the lasagna dish, and zucchini is a poor subitute for the noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Hager"
},
"reviewBody": "I made it with ground chicken as that is what was in the house and I must admit I added more mozzarella DELICIOUSNESS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "I loved making this lasagna! Make sure to follow the steps of salting your zucchini slices and letting them sit on towels-what a great, new trick I learned here! Also, I used farmers cheese instead of ricotta, and it’s absolutely scrumptious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Fennema"
},
"reviewBody": "Delicious, will make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ3348"
},
"reviewBody": "This was so very good! I used pork chorizo instead of hamburger to add a little kick. I also eliminated the 1/4 C water based on comments about the wateriness of the recipe. Other than that, I followed the recipe exactly. It was delicious and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassygramma"
},
"reviewBody": "This recipe is excellent! I made it just as written, and found it was excellent as is, but adaptable to changes as well. It makes a large amount (as noodle lasagne does), so we had leftovers three times. It warmed up beautifully and was just as tasty over several days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beverly Berry Kerr"
},
"reviewBody": "Big success! Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Michael"
},
"reviewBody": "Made according to recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "Delicious! I doubled recipe and always increase meat, but used a 50/50 mix of ground beef and sausage. I was tempted to use my own sauce recipe but decided to lean heavily on this one and so glad I did. Such depth of flavor! I omitted mushrooms because I didn’t want too much moisture. Also, I salted the zucchini with garlic salt. Will make again and again and post a pic next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wanda kindell"
},
"reviewBody": "Great recipe! I used leftover spaghetti sauce from a previous meal and roasted the mushrooms and zucchini to eliminate some of the water from the veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol jenkins"
},
"reviewBody": "This came out so great and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Hobson"
},
"reviewBody": "My first time making lasagna. I made two. One with Italian sausage and the other with cauliflour and Portobello. The wateriness didn't bother me. Maybe I'll season the veggie one better next time, but all in all this recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Was delicious but agree with a lot of the other cooks in that I'd make my own sauce by sauteing garlic and onions in oil first; crushed tomatoes in stead of sauce and beef; no green pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelby Bowers"
},
"reviewBody": "Great recipe! I sautéed the onions and bell peppers and used ground turkey instead of beef. I also mixed the ricotta with the spinach and skipped the mushrooms. Use Greek and Italian seasoning and this was the perfect lasagna, you don’t miss the noodles at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen B"
},
"reviewBody": "Awesome recipe! So good! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanda kelly"
},
"reviewBody": "I love this recipe and my family does too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tammy Workman"
},
"reviewBody": "I followed the directions on salting and roasting the zucchini first but still, it turned out like lasagna soup. I used a turkey baster and took out as much of the liquid as I could but still, too watery. Someone said to add rice but that defeats the purpose of making it low carb! Won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OSasha"
},
"reviewBody": "A-M-A-Z-I-N-G!! I will never eat lasagna with noodles again!!! Zucchini is the only way to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leticia Esteve"
},
"reviewBody": "My picky eaters (6 and 4 yr) loved it enough to have seconds and thirds! I skipped the spinach and didn't miss it at all. I also used ground turkey with a bit of chicken bouillon instead of beef. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie "
},
"reviewBody": "This is the second time I have made this and my family loves it! It is such a wholesome and nutritious meal. I like to have it for dinner and then freeze individual pieces to freeze for lunches to take to work and school. I feel good knowing that it is packed with lots of vegetables and protein. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Garza"
},
"reviewBody": "I didn't follow this recipe exactly, I read a few recipes and combined common parts. I should have dried out the zucchini more because it was a bit watery. Overall it came out really good, will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marianne"
},
"reviewBody": "I made it exactly as listed. It was very tasty and filling even though it had no noodles. Hubby liked it too. We had plenty left over which I froze. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Nicol Tritsch"
},
"reviewBody": "Loved this! Perfect for this low-carb family! I did subtract on the mushrooms and spinach, there’s no way my family would have gone for that. . I would, if it was for me! Kids loved the zucchini, bonus for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I loved it. Easy to make. I added a lot of garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I thought this was kind of bland. Salt helped so I'll add some to the meat mixture next time. It's certainly not a bad recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "I thought this was kind of bland. Salt helped so I'll add some to the meat mixture next time. It's certainly not a bad recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline W"
},
"reviewBody": "I will be making this again! I'm allergic to eggs so I just skipped the ricotta mixture and used a bunch of leftover shredded cheeses that I had in my fridge. I skipped the peppers, and I used fresh spinach. It came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoJackets"
},
"reviewBody": "Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "I deleted the red wine and mushrooms. I added 1 lb pork sausage, 2 large carrots and 3 cloves of garlic. Everyone in the family liked it. I would certainly eat it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Mancinelli"
},
"reviewBody": "It was delicious! My husband loved it too. I used ground chicken instead of the ground beef. Did not miss the noodles. I was nervous it might turn out watery; I followed the directions and was happily surprised that it didn't. You will not be disappointed if you try this. I am going to make this without the meat for my vegetarian daughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lissa Bloom Wax"
},
"reviewBody": "Great recipe, I did modify it a little bit. For starters seeing that it was so much prep, I went ahead and doubled it and have placed a 2nd one in my freezer. I also increased the amount of ground beef. It called for 1 pound per recipe and I upped it to 1.5 pounds per recipe. Also, the quantity of zucchini used was way off for me. I sliced mine quite thin and used 9 zucchini between both recipes so 4.5 zucchini’s per recipe (they said to only use 2 per recipe but that wouldn’t work). I precooked my mushrooms and drained the liquid as someone else recommended to reduce the excess amount of liquid. I also used red pepper instead of green to give it a more Italian and less chili taste and finally, I added 1 clove of crushed garlic to each recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KariAZ"
},
"reviewBody": "Delicious. I used Italian sausage rather than ground beef and it was perfect. I baked the zucchini first to eliminate water. Used jarred sauce with mushrooms rather than fresh mushrooms. Skipped the water and added FRESH spinach to the ricotta to reduce moisture. Perfect ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DieBee"
},
"reviewBody": "Dehydrated the zucchini in the oven like another reviewer suggested. Delicious! Even kids liked it. But so. Much. Work!! Took way longer than recipes stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zereta Lingle Sucharski"
},
"reviewBody": "Left out the mushrooms. It was delicious. We will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kone"
},
"reviewBody": "Excellent recipe! I am the only low carber in the house, but my daughter liked this better than regular lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Dignan"
},
"reviewBody": "It’s a keeper!!! So good my new favourite and will be making this more often! Even my 2 year old couldnt get enough of it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missbrett"
},
"reviewBody": "I have made this several times exactly as the recipe states, which is five stars. Lately I have begun to use two pounds of meat, not one. I use a pound of ground beef and a pound of sweet Italian sausage. Also, in the video, she notes that you should pre-cook the mushrooms, which I do. Lastly, I think it could use a bit more ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wanda Tibbs"
},
"reviewBody": "I made it with cottage cheese and used Hunts Pasta sauce instead of tomato sauce. More favor. I also added Parmesan grated cheese mixed with the mozzarella on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "So tasty! Even my toddler enjoyed it-loved him eating all those veggies without even realizing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PatG"
},
"reviewBody": "I made this for my book club. It was delicious! I left out the mushrooms, used 1/2 ground beef and 1/2 Italian sausage. Mmmmm mmmmm good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamra Lynn VandenBerg"
},
"reviewBody": "It was amazing. I cut the zucchini a little thicker and it wasn’t so watery. Great as leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Rushatz"
},
"reviewBody": "This recipe rocks! Very tasty but very messy. Have napkins available"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leeann Denson Guerra"
},
"reviewBody": "Made this tonight for my hubby"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "robfuzz"
},
"reviewBody": "Yummy but watery. I’ll have to dry the zucchini better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Damiani"
},
"reviewBody": "The family loved it. Made a regular one for the grandkids and most liked this version better as it was lighter, less filling but full of flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madina Mehr"
},
"reviewBody": "love this recipe, my kids and hubby loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brent"
},
"reviewBody": "Very good recipe. Enjoy it the next day also"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annio"
},
"reviewBody": "Really good. Didn’t follow exactly but we loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Kaye"
},
"reviewBody": "Definitely add garlic! Forget adding extra water. It won’t need it. If your sauce is too thick, add an additional splash of wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Haley Smith"
},
"reviewBody": "Great concept and I really just wanted some guidelines. I wish I had read these other reviews before cooking, because mine definitely turned out pretty watery and I will be sure to pre-cook the salted zucchini next time. I would also recommend peeling your zucchini first, especially for bigger squash. I used a monster of a zucchini (about 4 inches across and 15 inches long), and the center of the slices got soft, but the peel remained very tough and was almost impossible to bite through in some places. \n\nUsed a store-bought sauce and it still tasted delicious. Overall great concept, I just didn't want to go to the effort of a homemade sauce this time. Still felt nice to get my veggies in with this recipe, and a great use of all the zucchini from my garden!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda O'Malley"
},
"reviewBody": "I did things slightly different...I mixed in the mushrooms with the ground beef, did lighter amounts of spinach and did add garlic! Was sooooo yummy!! Everyone ate it!! Also baked the zucchini instead of salting it, worked PERFECTLY!! Def will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adonz15"
},
"reviewBody": "need 2 large zucs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frances Fraser"
},
"reviewBody": "Good recipe! I added Garlic and Yves Veggie ground instead of meat. tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Summerpls"
},
"reviewBody": "It was good ... lots of work to make. Made it the day before and it turned out okay ... fell apart a bit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZAKKIE"
},
"reviewBody": "I used my homemade sauce, baked the zucchini slices 15 minutes, sauteed the mushrooms first, and ended up adding uncooked lasagna noodles as a layer with the zucchini. Why? It wasn't my intention but I needed a heartier dish for the men in my family that night. Turned out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joedave"
},
"reviewBody": "Real good. I used fresh herbs. Sautéed the mushrooms and drained. Did not salt the zucchini so added sea salt to meat sauce. Took the 9x 13 Pyrex to the max. Plan on 1 plus hours for prep and clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emjohnson"
},
"reviewBody": "Delicious! Didn't use bell pepper because it just didn't sound good to me in this. And didn't want to buy spinach, when I had kale. So sautéed a little kale to substitute, but went light since it's a stronger flavor than spinach. Spiced up the sauce a little to my liking. Very good meal that you can feel better about eating. Thank you for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Gallagher"
},
"reviewBody": "I soaked zucchini slices (I used a mandolin to cut circles) in salted cold water. Worked like a charm- no excess water and made a multi layer of zucchini in the middle: meat, sauce, cheese spinach mixture, zucchini, meat, sauce, cheese mixture. I made the meat separate from the sauce to make sure residual fat was drained. I alway bake my lasagna 2x - once after making and then again on the day I serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynn Z West-Puhle"
},
"reviewBody": "I didn't add spinach and put the mushrooms in the meat sauce with sausage (roasted and sliced thin). The beef I made into meatballs for better flavor, sliced for the sauce. Great hint about salting the zucchini! I probably patted them to soak up the liquid about three times before I wanted to attempt to use them. Now I know it won't be runny. I made the sauce the day before and reduced it so it was good and thick for the lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Prather"
},
"reviewBody": "I will experiment with drying the zuccinni first to see if it is less runny. Also, it tended to be a little more salty than I am used to. It tasted fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "This tasted great! It was even better when the leftovers were warmed up the next day!!! I will pass this recipe on to friends and neighbors."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/172958/no-noodle-zucchini-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16804/main-dish/pasta/lasagna/zucchini-lasagna/",
"name": "Zucchini Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/172958/no-noodle-zucchini-lasagna/",
"name": "No-Noodle Zucchini Lasagna"
}
}
]
}
}
, "about": [
]
}
]