				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No Sour Cream Beef Stroganoff"
,"datePublished": "2018-06-08T09:27:02.000-04:00"
,"dateModified": "2022-01-14T01:16:40.000-05:00"
,"author": [
{"@type": "Person"
,"name": "rachelguerrero1740"
,"url": "https://www.allrecipes.com/cook/703774"
}
]
,"description": "Instead of sour cream, this recipe uses cream of mushroom soup, white wine, flour, and beef broth. Serve with Worcestershire (to add a little zing) over rice or buttered egg noodles."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/2dhy1iWqGFYIVX9jUvTbl-Rymto=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3699203-86946c85478947239ac52cada94f5c58.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No Sour Cream Beef Stroganoff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "121"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "473 kcal"
,"carbohydrateContent": "17 g"
,"cholesterolContent": "111 mg"
,"fiberContent": "2 g"
,"proteinContent": "32 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "963 mg"
,"sugarContent": "4 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 pounds ground beef",
"salt to taste",
"1 tablespoon butter",
"1 (8 ounce) can mushrooms, drained",
"1 onion, chopped",
"1 clove garlic, minced",
"4 tablespoons flour",
"0.5 cup white wine",
"1 (10.5 ounce) can cream of mushroom soup",
"0.5 (10.5 ounce) can beef broth",
"Worcestershire sauce to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Brown ground beef in a large skillet over medium heat. Season with salt. Stir in butter, mushrooms, onion, and garlic; cook until the onions are soft."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl, stir together white wine and flour. Stir into meat, along with mushroom soup and beef broth. Simmer for 10 to 15 minutes, allowing to thicken. (If you need more liquid, stir in additional broth.) Serve seasoned with a dash of Worcestershire sauce."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it for my husband and I without the wine and it was delicious! We had crescent rolls as well. I did NOT buy can mushrooms I added fresh mushrooms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rachel R"
},
"reviewBody": "Used this as a rough guideline for the dish... \nMy first concern was the amount of meat called for. Does anyone keep 1/2 lb packages of ground beef in their freezer? I just used 2 lbs so I didn't have a small amount of beef sitting in the fridge with no purpose. We like meat, a little extra never hurts.\n\nThe second issue I came across, is that the beef would have been way over done and dried out if I browned it first then continued to cook it with the veggies. So I removed the meat from the pan until the veggies were cooked to my liking, then mixed the meat back in.\n\nThird problem... I don't personally know anyone who keeps white wine on hand for cooking. (I know like one person who keeps it in her house for drinking.) I chose this recipe because I didn't have sour cream and was looking for an alternative. After a little research, I decided to substitute milk for the liquid the wine would have added and 2 or 3 tablespoons apple cider vinegar for the slightly sweet \"twang\" I would imagine the wine would have given to the recipe.\n\nFourth problem I faced is that it was instantly too thick after adding the ingredients called for to the pan. Even after using the whole can of beef broth it was pretty thick. And not creamy enough. I ended up adding a little extra milk, and black pepper.\n\nALSO did not add ANY salt, as the soups both have a lot of sodium already.\n\nI ended up being able to fix the dish so it was pretty delicious, but it was much different than the recipe here by the e"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taylor Spencer"
},
"reviewBody": "Made as is. Tatsed great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mari-mita"
},
"reviewBody": "Love this and will make again- I used A1 instead of Worcester sauce since my family does not care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shallay"
},
"reviewBody": "So good! I make ground beef stroganoff regularly from my own recipe. I didn't have any sour cream so searched all over for a recipe that didn't need it. Instead of beef broth I used a packet of beef boullion and a cup of milk. I used fresh instead of canned mushrooms. Otherwise followed recipe. It's delicious and I will try using wine instead of sour cream again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Dunn"
},
"reviewBody": "Added more cream of mushroom and used fresh mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tashia"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "A bit bland. Adding more pepper next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Mac"
},
"reviewBody": "I used 2 lbs of ground beef which I browned and strained first. Then cooked about 14 oz of fresh mushrooms &amp; the chopped onion in butter.\nReduced the flour to 3 T. Used proportionally more of the other ingredients due to the 2 lbs of ground beef. Other reviews found it too \"white\" but cooking the mushrooms generated a nice color for the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BeckaBoo79"
},
"reviewBody": "Not as flavorful as I would like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela Griffith Murenzi"
},
"reviewBody": "Nice recipe and will definitely make it again. I changed a couple things.... I didn't use wine (super expensive where I live), I used beef strips Instead of ground beef, and a cream of mushroom instant packet (which I mixed with water) instead of cream of mushroom soup. Next time I would also use fresh mushrooms, not canned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moppel"
},
"reviewBody": "Let me start off by saying, we just moved and I am very limited on what I have to work with in the kitchen right now, so I had to make changes and improvise. But, this recipe deserves 5 stars because it was the base of our amazing dinner, perfect for those days when you have to work magic to put a meal together. \nThese are the changes I had to make. I had to skip the onion and garlic, I don't have any yet, not even powder. I didn't have white wine or beef broth, so I used chicken broth for both. And lastly, I don't have Worcestershire sauce yet, but I have steak sauce, so I used a splash of that. I served it with buttered egg noodles, and it was awesome. Everyone gobbled it up and asked me to make it again. I do want to try the recipe the way it's written too though. But, if you're in a bind, like me, this recipe is perfect because it allows adjustments with whatever you have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules Bonds"
},
"reviewBody": "so glad I found a decent beef stroganoff recipe with no sour cream. I sauteed onions and garlic in butter/olive oil as another reviewer suggested. next i added 1/2 cup white wine and let it reduce. then I added beef, chicken broth (not crazy about beef broth) cream of mushroom soup, salt, pepper and wostechire sauce. let simmer for 10-15 minutes and adjusted seasoning with a touch more salt, pepper and sauce. i found i didn't need flour to thicken. Very tasty!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Coutry"
},
"reviewBody": "This was great! I made some changes- I used thinly sliced steak instead of beef, only added 8oz beef stock and no cream of mushroom. I put it over zucchini noodles. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Casey"
},
"reviewBody": "I made this last night and had to make some changes due to what I had on hand. Used Marsala wine instead of white (not gonna lie, I had white but I was drinking it lol) won't do that again, I am not a big fan of marsala wine but it turned out ok, I just think it would have been better with the white. I didn't have an onion so I threw in some dehydrated onion, this worked out fine. I ended up using penne pasta instead of the egg noodles and that was fine too. I did use more garlic then called for just because I love garlic. Last I didn't mix the flour with the liquids, I sprinkled it over the meat after browning and cooked it a little more then added all the liquids this way there were no lumps and it thickened up very nice. Overall it turned out pretty good and will definitely make again only for sure using the white wine. This is a quick and easy recipe to make and taste pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brock"
},
"reviewBody": "Followed the recipe to a tee, except used less flour and during the simmer at the end I added green peas, chopped asparagus, sliced jalapeno pepper as I like it spicy, and a shot of sherry. Deeelish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Schwieder"
},
"reviewBody": "I have looked for a recipe for beef stroganoff that my family would like for years. I made this one last night and everyone was going back for more!!! Definitely one I will make again and again! I did not have white wine so I used water instead and it was still great. Thank you, thank you, thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sheiswan"
},
"reviewBody": "This was pretty good. I never use canned mushrooms tho. I have also made it with small meatballs using worchestershire and beef stock to soak the fresh bread for crumbs. It has always been a fav. of my son."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamara Bruce"
},
"reviewBody": "use water instead of wine and flank steak instead of ground. It was very good, my grandkids all loved it......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "Amazing flavor. I left out wine &amp; added more worchestershire &amp; pepper to give it more zip. Family loved it &amp; simple :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rashi"
},
"reviewBody": "Followed recipe exactly..and it was great. Just added cilantro for a garnish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolci C."
},
"reviewBody": "The only I changed was using red wine instead of white!! SO GOOD!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LJ"
},
"reviewBody": "Used this recipe because I didn't have sour cream on hand. I skipped the salt and used 10.5oz of beef broth. I also was a little liberal with the Worcester sauce. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vinjammer"
},
"reviewBody": "Very good sauce and quite tasty. I had some pork cutlets that I cubed in lieu of ground beef. I also added 1/2 t. of Tarragon to enhance the sauce. We both thought is delicious and are looking forward to eating the leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fayth"
},
"reviewBody": "I wanted to try this because I can't have sour cream but love beef stroganoff. I don't keep white wine on hand so I used half a cup of beef broth instead. I also used a whole can of beef broth to add in instead of the half can called for, and garlic salt rather than garlic cloves. Once everything was cooked and mixed together I wasn't so sure about it. It looked too much like hamburger helper, and while I have nothing against HH, if I'm cooking it's because I want something other than HH for once :P It also lacked in colour so I added a big handful of dried parsley flakes. However, it did taste better than expected, mostly due to the Worcestershire sauce. I added in a very liberal \"dash\", stirred it in and let it cook for a few minutes, then added in an equally liberal second dash. It was decent, I will at least eat the leftovers. However, if I make it again I'll probably use beef strips and fresh mushrooms, and maybe experiment with a few additional seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emily21147"
},
"reviewBody": "Very easy!!! Used ground sausage instead (didn't have beef). Turned out FAB!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ampetrow"
},
"reviewBody": "The flavor was ok but way too much flour that made it gooey and the meat was too tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shirice"
},
"reviewBody": "It turned out great!! I was looking for a quick recipe to whip up before I head to work and this was perfect. Its quick, easy and tastes great. In lieu of chopped mushrooms, I used chopped eggplant and in lieu of worcestershire sauce, I just seasoned the meat while frying it with all purpose seasonings. It provided enough flavor and paired well with the cream of mushroom and wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "I used fresh mushrooms (they're always better) and chicken broth (because that's what I had). Came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte"
},
"reviewBody": "This was very quick and easy recipe. The only thing I did different was didn't have any white wine. So I used beef broth instead. Worked great that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I did not add additional salt when I sauteed the meat because canned soups tend to be a bit salty on their own. I used 8 oz. fresh chopped baby bella mushrooms instead of canned, the full can of beef broth (just to make more \"gravy\") and fresh ground pepper to taste. I served this over buttered egg noodles. I did not try this myself but my family thought it was great. NO leftovers. This was very simple and came together in 20 minutes, from start to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cryzztal_7"
},
"reviewBody": "This was good if you are a hamburger helper fan. I enjoyed it but didn't think it was the best. I would have given 3 stars but my husband loved it and is still eating leftovers the 3rd day! Lol \n\nI omitted the mushrooms because we are not a fan. I used slightly more than half a can of beeth broth. I found the the taste of the beef broth overwhelming so I ended up diluting with about 1/4 cup water. This made for the perfect creaminess. Adding the Worcestershire at the end is a must!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie K"
},
"reviewBody": "Wonderful, quick, simple and tasty recipe! It also works with ground pork and chicken broth when you want a break from red meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Greer Pavelka"
},
"reviewBody": "Toddler LOVED it, I thought it was tasty, picky husband ehh he ate it, but not super thrilled ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "this turned out delicious, I actually added frozen hash brown potato's to it, and it was all devoured. Adding the wine was a good call!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beaner4"
},
"reviewBody": "thank you!!!!!!!!!!!! i dont like using sour cream and used this recipe it was great! i used sherry instead and it came out greatg"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathilee and Emma"
},
"reviewBody": "Loved it! Very filling! Delicious over a bed of steamed cabbage and egg noodles. I used leaks instead of onions for a more mild taste. Made it for my family twice in two weeks. They even liked the left overs :) Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rach"
},
"reviewBody": "This was great! I made as is minus the mushrooms. Also drained the beef after cooking. Served with noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bake'n'Eat"
},
"reviewBody": "This was fabulous - I rarely have sour cream in the fridge. This recipe hit the spot with ingredients I had on hand and in terms of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snickersmum"
},
"reviewBody": "My kids LOVED this! Second time preparing it in 3 weeks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shawntelle Pendagast"
},
"reviewBody": "we had no sour cream either and this was a great recipe we had almost everything in it. we had beef steaw chunks so I used those and used garlic powder and 2 cand of cream of mushroom soup no wine or acctual mushrooms but the taste was great. thanks so much for providinga reciepe that is economical. Shawntelle Pendagast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon M"
},
"reviewBody": "This was very tasty! I used what I had on hand, so used french onion soup (canned) instead of beef broth, fresh mushrooms, and steak cut into strips instead of ground beef. Didn't have any Worcestershire sauce either, so added a dash of A1. The pans are empty (barely enough for my lunch for tomorrow!), so looks like it's a keeper at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jendave"
},
"reviewBody": "My husband LOVED this! It was very good and super easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NAVYPINSTRIPES"
},
"reviewBody": "for as easy as it is, it tastes great. good weekday option"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "for how easy this is, it is amazing! I used fresh mushrooms and it came out so flavorful and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "melissa"
},
"reviewBody": "You could taste the wine in it which I didn't really think you would be able to. I don't think I will make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SooperLowa"
},
"reviewBody": "This was exciting because it used up a can of cream of mushroom soup left over from the green bean casserole holiday tradition. We used fresh mushrooms and beef bullion cubes as mild substitutions.....pretty tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abapplez"
},
"reviewBody": "Everyone enjoyed this. I did change things a little...I sauted the onion in a little butter and olive oil until tender, and then added the mushrooms (I used fresh - 1/2 sliced white button and 1/2 sliced baby bellas) and sauted those until all moisture was gone and then added the minced garlic and sauted for 2 minutes. I then deglazed with the white wine and allowed to simmer until the pan was almost dry. This mixture was removed from the pan and set aside and the ground beef was added to the pan and browned. Then the mushroom mixture added back in. I mixed the flour with 1/2 cup of beef stock and added that to the skillet and then 2 cans of mushroom soup and 1.5 the amount of beef broth (I used stock) called for in the recipe and a splash of Worcestershire. (Also seasoned with Salt and Pepper along the way). Allowed this to simmer for approx. 10 - 15 min and served over wide egg noddles. Very tasty weenight dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thill40397"
},
"reviewBody": "Very nice without the sour cream. We used Sirloin steak instead of the ground meat. Cooking time was extended to insure meat tenderness. The mushroom soup and wine added a really good flavor to the dish. I would recommend to anyone interested in a quick, simple, meal. We served with broccoli, side garden salad, and hot crescent rolls. 2010-03-05."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IWannaCook"
},
"reviewBody": "Great recipe! Some things I didn't have like, the can of mushrooms, wine, Worcestershire sauce or garlic. I used 3 Tbsp of flour and added skim milk to thin the mixture a bit since I wasn't putting in wine. I used garlic seasoning in place of the garlic clove. Delicious!!! I poured the gravy over cooked rotini noodles! YUM!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PhelimEstranesk"
},
"reviewBody": "I forgot the mushroom soup but it still worked and was extremely tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "don't use frozen,thawed meat/ season the meat well while browning......super good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "_ahcinns"
},
"reviewBody": "Very easy to make, I made it for my cousin's bbq and by the end of it there was none left =) I would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mariehipple"
},
"reviewBody": "I love Beef Stroganoff but never have sour cream so this was a great recipe for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Maus in the Kitchen"
},
"reviewBody": "Meh, kind of gloopy and my husband wasn't enthused."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny in China"
},
"reviewBody": "easy and yummy with no sour cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "a4bz"
},
"reviewBody": "Was it just me or did this come out creamy white and not like the picture at all!? I think the picture must be wrong. Overall, a pretty good recipe considering I didn't have any sour cream. It could use a little more taste. Mine seemed a little bland so I added extra garlic, pepper and worcestshire sauce. Not bad. A good recipe to have on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KimEats"
},
"reviewBody": "It tasted like hamburger helper--that's fine at least I know what's in it! But it was so visually unappetizing that I could not finish eating it. Really pale, white and grayish. I don't know how the above photo looks so good--maybe they left out the flour?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blevngood"
},
"reviewBody": "I thought this was good.. However, dont use beef stew meat or it will not get tender enough to eat..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ilkaisha"
},
"reviewBody": "This was very good, and easy, despite my picky boyfriend not wanting ground beef. I subbed top round, thinly sliced. I ditched the salt, because I used white cooking wine which is very salty. I did shop specifically for this recipe, so I found myself wanting (and lacking) a little bit more beef stock while it was thickening. I used water, and it seemed okay. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sunshinebluesky"
},
"reviewBody": "Made this recipe using our leftover meatballs instead of the ground beef. Will use this recipe again. Next time I'll be more careful when I add the wine/flour mixture...mine went lumpy..oops! (-: Thanks for the no sour cream stroganoff! (we almost never have sour cream in the house)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GrandkidsMawMaw"
},
"reviewBody": "Very good. Everyone liked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jonne TheMrs Francis"
},
"reviewBody": "Leave out the wine and this will still be a good dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jasperthecook"
},
"reviewBody": "An easy, quick, and tasty meal. And it makes plenty of food when you double the recipe... good for college students."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "diva12"
},
"reviewBody": "This was okay. I tried it bc I wanted to do something with ground beef other than lasagna or spaghetti or meatloaf. But I didn't have sour cream, thus I used this recipe. I used ziti pasta. I'd make this again, but its nothing to write home about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nivasi"
},
"reviewBody": "Hubby enjoyed it and it was sooooooooo much easier to make than the original recipe I have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ckelly976"
},
"reviewBody": "No complaints on the recipe, I've always liked stroganoff but I hate sour cream so I was more than excited to find this recipe. I usually make it with whatever wine I feel like throwing in there, red, marsala, or white, and it's good with all three. I omit the mushrooms, but keep everything else pretty much the same. this recipe is one that made it into my personal recipe notebook, excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzyq"
},
"reviewBody": "i changed this one a bit. i used cubed stew meat, and burgundy cooking wine. it was so delicious, i would definitely consider serving this to dinner guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aly sun"
},
"reviewBody": "I was pleasantly satisfied with this recipe. I thought I would miss the sour cream, but I didn't I used a little extra of all the seasonings and the stroganoff was very flavorful and creamy. The only change I made was that I used steak instead of hamburger and vegetable broth instead of beef. My family really enjoyed this meal. One reviewer said it tasted like Hamburger Helper and I agree, but felt better about making this recipe rather than the processed powder in HH."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kinah"
},
"reviewBody": "Awesome recipe my family adored it, including my inlaws who are usually very hard to please (were talking about how good it was the next day!)\nI only added some garlic powder and a few turns from the pepper mill.\nOther than that i followed it exactly and it was perfect! Definetly family fave now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Tillem Silverberg"
},
"reviewBody": "I really like this recipe! I love beef stroganoff, but don't make it because my son has a dairy allergy. This is so good, easy, tasty, not expensive and not totally unhealthy with lean meat. I used corn starch instead of flour, fresh mushrooms because I don't like canned, chicken broth instead of beef because I didn't have beef broth, and even with all the substitutions it was really good. I'll make this a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SAMAGGIE"
},
"reviewBody": "The ground beef created a dish just like Hamburger Helper, which is not a favorite of mine. It also was visually unappealing. If I try again, I will use sirloin strips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie's Kitchen"
},
"reviewBody": "I was looking for a way to use up some left over roast beef with a gravy and some noodles and this fit the bill perfectly and it was A+++ delicious. I didn't make any other changes to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "recipejunky"
},
"reviewBody": "I really like this recipe! I omitted the mushrooms because my children don't like them. Like another reviewer, I also increased the beef broth to one cup. I also didn't have any cream of mushroom on hand, so I used cream of golden mushroom. I served it over egg noodles and both kids including a picky eater ate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stessiej"
},
"reviewBody": "My family loved it! I thank you so much I had to tweak! I it my way No mushrooms and it was Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Kolifrath"
},
"reviewBody": "This was are a really great, fast, familty meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MANTELLAS"
},
"reviewBody": "This was edible, but certainly not good. My husband ate it. He said it was good, but he will always be nice when it comes to comments on anyone's cooking. I ate part of mine, but couldn't eat the rest of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIAMYA"
},
"reviewBody": "I was just looking for something quick and easy to do with ground beef, and instead I've found my husband's new favorite meal. The only thing I changed was instead of white wine I used Marsala cooking wine. I didn't have any onions, so I used dried minced onions. I served it over fettucini noodles, but I think it would be better with egg noodles, or even macaroni. It was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ATowne"
},
"reviewBody": "Hey, I am trying to cook light so the \"No sour cream\" attracted me to this recipe. To make this even lighter I replaced ground beef with lean ground turkey; used plain yogurt instead of butter; wheat flour instead of white flour and mixed regular egg noodles with whole wheat egg noodles. It still tasted great! Enjoy cooking light :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bama Lady"
},
"reviewBody": "This recipe was very good. It is great for a quick week night meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Arizona Desert Flower"
},
"reviewBody": "I used 1lb ground turkey (that's what I had). I used fat free cream of mushroom soup and corn starch (what I had) and an entire can of beef broth. I didn't have worchestershire, so I used soy sauce. I still felt that it was bland, so I added some garlic powder, more black pepper and a small splash of mustard. All in all it was very good. The most picky eater (my husband) had two bowls and said he would eat it 'occasionally'. The college student, kindergartner, toddler, and I all enjoyed it. I will keep it and make it again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Sperry"
},
"reviewBody": "This was a very good tasty way to utilize ground beef and ingredients that usually are available in the cupboard. Instead of using canned mushrooms, I used fresh mushrooms that I sauteed prior to adding them to the browned meat mixture. To reduce the fat content, I drained the browned meat mixture, used reduced fat soup and substituted the butter for olive oil. I would recommend this recipe for anyone who is looking to make a quick meal with ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Calamity Anne"
},
"reviewBody": "This recipe is definitely a \"do-over,\" although I found we needed to add extra salt at the table. You might want to increase salt to 1/2 teaspoon. Also, I drained the fat off of the meat even though the recipe didn't indicate to do so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Honey"
},
"reviewBody": "Very good...I just added some parmesean cheese right before serving"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bkj228"
},
"reviewBody": "Really good and easy. But I did add sour cream. Had some in the fridge and needed to use it soon.\n But all in all I loved the outcome and will use it again. Over noodles of course."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HMRANK"
},
"reviewBody": "I thought this was good, not great. I did use low-fat, lower salt cream of mushroom soup. I used 2 lbs. of ground beef, two cans of the soup, a whole 10 oz can of beef broth and 3/4 cup of white wine. I thought it needed some more spice, so I put about a 1 teas of dried thyme in it. However, my husband loved it, so I will make it again. I think I will try red wine next time, perhaps that will go even better with the beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CUCKOOBIRD"
},
"reviewBody": "We loved this so much we ate it for four consecutive dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marandi Diehl"
},
"reviewBody": "I love beef stroganoff but my husband can't have dairy so this was a great recipe for us! I didn't think it was possible to make beef stroganoff without sour cream but this was great. I have made it several times now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AngieRatz"
},
"reviewBody": "Really good! Increased the broth to a full can &amp; increased the worchestershire sauce to 2 tbsps for a richer taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHERIDANSMOM"
},
"reviewBody": "Made according to directions, and was truly impressed. I had reservations about the wine, but used it anyway, and I'm glad I did. Even my 4 year old liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "AggieFan92"
},
"reviewBody": "Sorry, this just wasn't very good. It was too thick, too salty, and we didn't like the flavor of the wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHEFANDERSEN"
},
"reviewBody": "This was a good recipe and would suggest it to anyone who is looking for something quick and hearty to serve a family. My husband and kids ate it right up/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "VBELL511"
},
"reviewBody": "very bland, far to thick. By the time I added enough liquids so that it could be served - the recipe had doubled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "motxgal"
},
"reviewBody": "Very simple yet very tasty! My family raved. We didn't have wine so I used water. Next time I'd cut back some on the onions and I LOVE onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAWNMONAHAN"
},
"reviewBody": "Lovely recipe - the white wine addition really makes this dish. Even though ground beef is used it really tastes much more elegant. I used fresh mushrooms instead of canned just because I had them. Delicious."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/87524/no-sour-cream-beef-stroganoff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17123/main-dish/beef/beef-stroganoff/",
"name": "Beef Stroganoff Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/87524/no-sour-cream-beef-stroganoff/",
"name": "No Sour Cream Beef Stroganoff"
}
}
]
}
}
, "about": [
]
}
]