				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No-Sugar-Added Oatmeal Cookies"
,"datePublished": "2019-04-02T03:01:13.000-04:00"
,"dateModified": "2023-01-03T16:02:11.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Gene Payne"
,"url": "https://www.allrecipes.com/cook/4563841"
}
]
,"description": "Low in sugar, these oatmeal cookies sweetened with only applesauce, bananas, and raisins are still sweet enough to satisfy your sweet tooth."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/To4Qdmg4vY1KwF_lsSOVi6qlCjI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8015582-8ea912fa40a24893b68932a0a70770c2.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No-Sugar-Added Oatmeal Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "131"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "52 kcal"
,"carbohydrateContent": "11 g"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "3 mg"
,"sugarContent": "4 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups rolled oats",
"3 medium ripe bananas, mashed",
"0.5 cup raisins",
"0.33333334326744 cup applesauce",
"0.25 cup almond milk",
"1 teaspoon vanilla extract",
"1 teaspoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "Stir oats, bananas, raisins, applesauce, almond milk, vanilla, and cinnamon together in a bowl until well combined. Drop spoonfuls of dough 2 inches apart onto the prepared baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the edges are golden, 15 to 20 minutes."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "Awesome oatmeal cookie! I added chocolate chips instead of the raisons for a bit of sweet. It was a little wet and added more oats, turned out great. I like that there's no flour or sugar.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really liked these and sooo easy. They don't taste like an oatmeal cookie but more like a banana bread cookie. They are soft and more gummy like a bread instead of a cookie. I did add salt, extra cinnamon and some baking powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It is a very good base recipe. I made it according to directions, baked 2 cookies and then decided to add peanut butter to part of it. I will add walnuts, Lily's chocolate chips and peanut butter to the rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was great ! I actually had Apple sauce that had cinnamon in it without sugar . Cookies were very good I did not have vanilla I've vanilla but added some nutmeg Ginger and cloves They turned out really delicious. Thank you for the recipe God-bless -Maria M."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marydonceel"
},
"reviewBody": "This recipe is Great. These are not for people who are looking for a regular, sugary tasting cookie. These are for people who are wanting to cook snacks that are a much healthier option. I made them just as the recipe and they were a little bit\"rubbery\" but one you start chewing them they are pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tammy_scanlon"
},
"reviewBody": "For a first try, I used dried cranberries instead and put a few mini-morsel chocolete chips. I'm trying to increase my intake of oats and grains. And this could work for a healthy snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "instructorvbpr"
},
"reviewBody": "Very easy. Did not have almond milk. Used skim milk. Did not have raisins. Used dried cranberries. The only problem I had was telling if they were done. It is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Krasnoff"
},
"reviewBody": "Very nice recipe. Made nice, soft oatmeal cookies (which is how we like them) with natural sweetness (my partner is diabetic, and so we avoid recipes w/added sugar)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aileen Olmsted Stumpf"
},
"reviewBody": "Instead of almond milk are used 1% milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Rush"
},
"reviewBody": "These no sugar oatlmeal cookies are great for a healthy breakfast cookie, hiking snack. Yes add your own creation, nuts, coconut, micro choc chips. sesame seeds, hemp seeds, chia seeds. makes an excellent healthy snack choice and energy to boot! The pictures shown dont do the end result justice. If you shape them with your hands and press them round they look great! In other reviews they mention rubbery... They are dense cookies but they taste great and they are sin free! \ncheers! enjoy! make em youll love em!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Brown"
},
"reviewBody": "Super quick and it made 24 cookies for me. I like the fact that I have every item in the recipe already. Whipped them up and I think they taste good. It's a healthier approach for a cookie with out sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "I added dried cranberries and pecans and increased cinnamon as many reviewers suggested. These have an odd sponge-like texture. The oats, nuts and berries break up that weird texture, but I probably will not repeat this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kandace Jaconski"
},
"reviewBody": "I was sceptical of this at first not tasting good. But oh they are so tasty and kicks that sweet taste I search for. I added peanut butter and chocolate chips. I used cinnamon applesauce. I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Don't make again. Upset my stomach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Jane"
},
"reviewBody": "I've been making these for a few years now. I use coconut milk in lieu of the almond milk and add dried cranberries and Enjoy Life chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "healthyafter50"
},
"reviewBody": "I made these cookies and hoped they would satisfy my nightly cravings for a sweet treat. I’ve been on a healthier lifestyle journey. Cutting sugar, flour, butter, cows milk and egg yolks. This recipe was a perfect solution to add to my snack list. I must admit that I altered the recipe a bit :)... I added two small boiled sweet potatoes, nutmeg, zest of a tangerine and 1/4 cup of 50% less sugar dried cranberries. I may try adding chopped prunes or dates the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani"
},
"reviewBody": "Great recipe for a different kind of cookie. The only difference that i did, I added 1/4 Cup of chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Silberberg"
},
"reviewBody": "My husband who is diabetic, and I have a sugar sensitivity both loved these! I used cinnamon applesauce and added pecans. It really hits the spot when you are craving something sweet and you need to fight that craving right in its ugly tracks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaVonda"
},
"reviewBody": "After reading the reviews. I did make a few changes. I used cranberries and almonds . I also added a half a cup of Splenda. I thought they turned out really good. A healthy tasty alternative to oatmeal cookie. I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leila Pendal"
},
"reviewBody": "I added blueberries and a few chocolate chips. They are fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "my2cents"
},
"reviewBody": "Seriously? I'm irritated with this recipe and myself for wasting my time and good ingredients on these bland-tasting, spongy lumps that laid like a rock in my stomach. People don't seem to know what good baking really is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joanna"
},
"reviewBody": "Pretty good..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akitamom2"
},
"reviewBody": "Wait! What? No flour? No sugar? I had to try because a friend is diabetic and misses home made cookies. I made them just as written, except I used 1/4 cup of Sunny D drink. I hate Almond milk. Fast and easy to put together and cooked fast. I made 4 big cookies with my muffin top pan and 12 regular size cookies. Three of the cookies had added chocolate chips for me! I'm not a big fan of oatmeal, but darn these are really good! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Messiah Bros"
},
"reviewBody": "Used nonfat milk instead of almond milk. Included raisins. Used natural unsweetened applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdub"
},
"reviewBody": "These were great! I followed the recipes and they came out gooey in the middle. They looked like they weren’t done but I figured I was harmless because there was no egg. I brought them to an event and everyone love them. They are great. Definitely make these but don’t expect regular cookies. Expect chews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Alldredge Stevenson"
},
"reviewBody": "These are great! Instead of raisins I used cranraisins and it was a hit at my work. Something with no processed sugar is great but I am thinking of trying it with peanut butter in substitute of the applesauce and see how that comes out leaving out the cranraisins. Maybe put in some nuts or flax seed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Olson- Van Putten"
},
"reviewBody": "Looking for a no sucrose cookie and these are great for that search. I added chocolate chips (I know, sugar) and a squirt of stevia, left out the milk and added a T of no sugar peanut butter. Baked at 375 for 15 minutes and then the next pan for 20 minutes. The 20 minute pan was perfect...crispy edges which made them yummier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keenalynn Pratt"
},
"reviewBody": "I put in a 1/2 C of pure applesauce and a bit more raisins. The first batch tasted more like bananna bread and were a little mushy. But tasted good. Im trying them a second time but in a 9 x 13 pan to cut into bats. My hubby likes them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mara"
},
"reviewBody": "I followed some suggestions from the comments and which were very helpful. Thought I would compile what I did differently:\n\n1/2 cup chopped walnuts added\n1/2 of applesauce instead of 1/3\nMaybe my oven is different but I cooked it for 14 minutes and I usually go for right between the suggested times but I was worried about these drying out and they were perfect at 14, very moist so keep an eye on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Pearsall"
},
"reviewBody": "Lydia pearsall cell see tie you make sugar free oatmeal cookies recierpie to make the sugar free oatmeal cookies how to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kurt"
},
"reviewBody": "This cookie is more of a cake type cookie (no crunch or crisp at all). It is a very good and healthy option that's forgiving in the way of ingredients. Will make again but will use this as a base to tweak until it is to my likings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terrie Jones"
},
"reviewBody": "This recipe works well with our diet changes. I added butterscotch chips instead of raisins. I liked them and will try other suggested variations ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rashmi Hemrajani"
},
"reviewBody": "These are by far the best healthy cookies I've ever made. A few suggestions: Add way more raisins that the recipe calls for. I did almost a full cup. Also, I added some dates, which helped with the sweetness. Apart from that, this recipe is amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilli"
},
"reviewBody": "I am currently not eating added sugar, dried fruit or fruit juice so I swapped chopped walnuts instead of raisins, 1/4 cup of shredded unsweetened coconut, doubled the almond milk and a pinch of salt. I also couldn't find my cookie tray so I made them in a muffin tin (1/4 cup drops) greased with coconut oil for about 20 minutes. I am amzed at how good they are!! I can't wait to add some unsweetened carob chips next time! Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeanne"
},
"reviewBody": "These are easy and good. They taste strongly of banana but I like that taste so I'm good. I made cookies and a sheet. In a 9x13 cake pan and they are about an inch thick. It worked really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "My partner and I are observing lent that prohibits consumption of dairy and eggs. I was looking for some vegan cookie recipes and was very glad to find this one that listed ingredients that I always have on hand. Thanks to helpful suggestions, made this recipe twice already. The first time I made these with small addition of 1/4 cup brown sugar and used 1 1/2 cups of oats and 1/2 cup of flax seeds, and I kept them in the oven for 10 extra minutes. The cookies were good, soft on the inside, a bit chewy, but since my partner likes his cookies sweeter, I added 1/3 cup of maple syrup the second time and substituted almond milk with orange juice. They came out much tastier with enough sweetness and same soft consistency. Half a batch is already gone. My daughter was helping me make the cookies and she also loved the flavor. Thanks to the author and all reviewer suggestions, will definitely make them again, want to try with chunky peanut butter...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laury Pendergrass"
},
"reviewBody": "I made these for a church social for the diabetics and they were a huge hit with everyone! Those were the first plate to be eaten. I will make them for the grandkids next. They are that good and sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rhonda Bradley"
},
"reviewBody": "I wouldn't call it a cookie as much as a little granola-like bite, but a nice little healthy sweet treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Beulah"
},
"reviewBody": "This is the first time I've ever had to rate a recipe from Allrecipes this lowly. These no-sugar cookies are not at all good tasting. They came out dry and tasteless (but for a sort of faint, dry, baked banana taste). If I ever made them again (which I won't), I'd maybe increase the apple sauce and leave out the bananas. I did include the optional raisins (thankfully). Because they were so terrible and hating to waste food, I put them in an airtight container in the freezer for later. Thawed, they are now rubbery. I even tried breaking them up in cold milk with artificial sweetener -- possibly they could work as a cold breakfast cereal. Nope. Unfortunately, the remaining ones are going into the trash. Even for diabetic diets, I've tasted better things."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MNola917"
},
"reviewBody": "I made the recipe as is, and the texture was pretty bad. Very bland and dry.\n\nI made the recipe a second time; omitted the apple sauce (too much sugar) and replaced it with 2 whole eggs. I used reduced fat coconut milk instead of almond milk, I used 2 tsp vanilla and a heaping tablespoon of cinnamon. I added a 1/2 tsp salt as well. I cooked at 350 until the edges started to brown. \n\nThe texture is still very cakey, but not spongy like the original recipe. I find them easier to eat this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pstacey"
},
"reviewBody": "This recipe is simple and delicious! Plan on making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Nelson"
},
"reviewBody": "Really simple and tastes good. I added some peanut butter and pecans. Cooked it at 375 for 21 minutes to get the cookies to have more texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICHELLE SANTOS"
},
"reviewBody": "I didn't make any changes, I followed the exact recipe &amp; it was so delicious! I was worried that the bananas would be an overpowering taste especially sense mine were extremely over ripe, but there was a perfect balance of everything in these cookies. I came up with 12 regular sized cookies which isn't that much to me &amp; they're healthy so I ate them all (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Russell"
},
"reviewBody": "I make it just the way it is or I add cranberries or chocolate chips. Sometimes I reduce the oatmeal and use coconut or almond flour. I add chia and flax too. It's super versatile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beezy"
},
"reviewBody": "I felt good serving this to my two year old as a snack and letting her help me make them! These hit the cookie craving spot without the guilt. I would definitely make them again. Oh, I should probably mention that I didn't have applesauce so I threw in three tablespoons of peanut butter instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria Jean"
},
"reviewBody": "Great healthy recipe! I used dark chocolate chips in place of raisins. I've made these cookies two times. The first time I added Trader Joes organic peanut butter. Both times I shared with friends. Everyone wants the recipe!! I'll try the recipe next time without adding the extra calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vera Pasynkova"
},
"reviewBody": "I've modified the recipe slightly by adding a chocolate chip and substituting sometimes almond with ricecmilk - this way my very picky toddler eats them whenever he sees them. I also bake them at higher temperature, at 200C, then it really takes 20min. At 175C as in the original revipe, you need more time in fact to get done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eaconsi"
},
"reviewBody": "I am so happy with this recipe. I made a few changes based on Joanna's input. (Thanks, Joanna.) I increased the applesauce to 1/2, and I used strawberry applesauce. I added a full cup of dried cranberries. I made sure the bananas were overripe -- soft and perfect. I also made sure the bananas were well blended - no lumps. I doubled the vanilla and cinnamon, too. (Cuz I love those flavors.) These would have been super healthy, but I added a 1/2 cup of mini chocolate bits. (Not that they needed them.) The texture was more like a fruit bread than a cookie which was fine by me. My husband and son liked them, too. Oh yeah. I will be making these again. I think I will add pecan pieces next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danie Rae Hernandez"
},
"reviewBody": "Just tried this recipe and love it. I'm doing a no junk food challenge and these are perfect for my sweet cravings. I didn't have any bananas so I stewed some apples and mashed them up. I am not fond of raisins, I substituted with dried mixed berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sage"
},
"reviewBody": "Made these for my diabetic husband, we both loved them . I only had 2 bananas, they very very ripe, so I added an extra \n1/4 cup oatmeal . \n Also added chopped walnuts &amp; pumpkin seeds . \n Baked them in convection for 15 min. \n Will definitely make these again . \n Thank you for sharing this recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bette Speer"
},
"reviewBody": "I used raisins instead of chocolate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "caroles"
},
"reviewBody": "needs more spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jonathan Lackey"
},
"reviewBody": "They tasted good, but I didn't like the texture of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Harris Easter"
},
"reviewBody": "Excellent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra Lynne"
},
"reviewBody": "I added one organic egg, 1/4 cup of brown rice flour, 1 tsp baking soda, 1 tsp baking powder, 1 tbs agave (light)\nthey are fluffy, cakey, not sweet but def serve to replace a cookie or brownie craving, made them in a bread pan shallow, cut into strips, or bars and made 5 big cookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna"
},
"reviewBody": "Have made these twice, and they were much better the second time--actually really good!--so here are my tips to making the best of the recipe.\n1. Make sure the bananas are really ripe. Mine had some brown spots on the fruit under the peel.\n2. I increased the unsweetened apple sauce from 1/3 to 1/2 cup.\n3. Don't stint the raisins--these provide most of the sweetness. I used a cup full.\n4. I also increased the amount of cinnamon, to at least 2 tsps.\n5. I used skim milk rather than almond milk the second time around--no difference that I could detect. \n6. I added a lot of walnuts--at least 1 cup, coarsely chopped--you could add more. To me these are the best part. \n7. When you put the dough on the cookie sheet, flatten them into a cookie shape--the dough does not melt and spread out like other cookie doughs, so the shape you put in is what comes out.\n8. I forgot to grease the cookie sheet but I think it would be a good idea--the cookies do stick a bit.\n\nThese are delicious for breakfast with coffee, and would be great to have handy for a breakfast on the road as required."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "My husband and I both loved these! I added 1/3 c of shredded coconut, and 1/4 cup of dried cranberries! Excellent for staying on track but meeting the need of the sweet tooth. We enjoy eating with a cup of tea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JMJ"
},
"reviewBody": "I know they are not your exotic sugar sweet cookie that most lovers enjoy, but if you wish to eat well, they are comfortably good for taking the craving away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jitse AT"
},
"reviewBody": "Tastes good, but the consistency was not like a cookie, more cake-like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy J"
},
"reviewBody": "I think these were great. I took the advice of some of the people that made these and added peanut butter and I did chocolate chips instead of raisins. I only had skim milk and I didn't bother with the cinnamon. I'm not a huge banana fan, so I used a mixer to beat the bananas instead of mashing. Occasionally I still got a lump of banana so next time I will beat them even longer. I made them slightly larger and got 19 of them. I worked up the nutritional info and mine worked out to 3 pts each on weight watchers. They definitely have more of a muffin consistency than a cookie. Now I just have to keep myself from plowing through all 19 of them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina D"
},
"reviewBody": "Love these cookies. Just wondering how to store them?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stewart Williams Putney"
},
"reviewBody": "Terrible and tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lhn"
},
"reviewBody": "I really enjoyed these 'cookies'. I wanted a sugar free snack for my toddler and I love them for myself-very healthy. They aren't cookie consistency or taste though but are an easy to make and are a healthy pick me up so I'll add these to our weekly intake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Medic53"
},
"reviewBody": "I found these to be sweet enough, but the flavors didn't meld well. I had one bite and threw the rest out. I wouldn't make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "woebcontact"
},
"reviewBody": "I needed a recipe for a friend who is diabetic and this recipe said NO SUGAR oatmeal cookies. Well that is NOT TRUE. There may not be any added sugar but there is sugar in the bananas, applesauce, raisins and even the vanilla. They taste good of course. But don't be fooled. There IS hidden sugars. Just be aware of this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I needed a recipe for a friend who is diabetic and this recipe said NO SUGAR oatmeal cookies. Well that is NOT TRUE. There may not be any added sugar but there is sugar in the bananas, applesauce, raisins and even the vanilla. They taste good of course. But don't be fooled. There IS hidden sugars. Just be aware of this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SuzyQ"
},
"reviewBody": "I've been making two batches of these a week. I substitute the apple sauce with crushed pineapple and add about a third of a cup of coconut and omit the cinnamon. I also bake it in a 9x9 pan and cut into bars and get best results if I bake at 375° for half an hour. This recipe is a godsend in my attempt at cleaner more healthful living."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marubi"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "I added a packet of nuts with chocolate chips in it and they came out great! I added a little extra almond milk and baked exactly at 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Gina"
},
"reviewBody": "This recipe is great. I have played with it a lot. I've added various nuts, different types of morsels, different flavors of sugar free applesauce, etc. This last batch I used butterscotch morsels, vanilla almond milk and pumpkin spice in lieu of cinnamon. Absolutely wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer Joan"
},
"reviewBody": "I did not care for this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri McFadden"
},
"reviewBody": "These were really good. I made them without the raisins only because I didn't have any in my pantry. Next time I'm going to add walnuts or dates. I use them as a mid morning and mid afternoon snack instead of the protein bars that I usually use. I like them much better and feel healthier eating them and not processed bars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Cloutier"
},
"reviewBody": "A real healthy recipe plus it is Vegan. I added frozen wild blueberries as I didnt have any raisins and it was really good.\nI work in a restaurant, so long hours and barely any time to eat. They are simply perfect and keep me going until midnight. \n\nWhy do people who love sugar thought it was a good idea to try this recipe in the first place!?!\n\nThe title clearly say NO SUGAR :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karie 'ccSallie' Switzer Burns"
},
"reviewBody": "definitely better with peanut butter. Play around with what you add such as dark chocolate chips, walnuts, various dried fruits. Since they are so quick and easy, I may even try one batch with bacon and chipotle. what could possibly go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nutsandall"
},
"reviewBody": "They turned out wonderfully, with thanks to the many intrepid bakers who offered great suggestions and substitutions. Here are some of my own: DRY INGREDIENTS - added 1/2 cup cranberries, 1/2 cup toasted chopped walnuts, 1/3 cup shredded coconut, 2 tbsp ground flax seed, 2 tbsp wheat bran, 1/2 tsp kosher salt AND two tiny packages of Italian \"Vanillin\" powder (brand: Cusina della Nonna). WET INGREDIENTS - one tbsp blossom honey, one tbsp molasses (plus the vanilla extract as per the recipe). TECHNIQUE VARIATIONS - 1. increased oven temperature to 375 degrees F - 2. lined baking sheets with parchment paper - 3. combined wet and dry ingredients in separate bowls - 4. Baked cookies for 21-22 minutes - 5. Yield = 36 cookies. \n\nGave the recipe to some friends, and one highly skeptical friend called and apologized for ever doubting me, as she thought they were fabulous. My second batch turned out better, and I accidentally used a bit less soy milk. Baking them at a higher temperature (375 degrees) for slightly longer, and by adding nuts, coconut, ground flax and wheat bran seems to have made them less bland and lumpen. All I know is that they are the best healthy cookies I've ever made, and I'm grateful to Gene Payne (and all the wonderful reviewers) for this excellent and highly adaptable recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "I add unsweetened coconut and these cookies are wonderful healthy options!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gailannteacher"
},
"reviewBody": "These are awesome healthy treats, but you need to be realistic on your expectations. They are NOT oatmeal cookies. They are good treats for people who limit their sugar intake. I read all the suggestions and added unsweetened coconut, shaved 85% dark chocolate, and raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Ehly"
},
"reviewBody": "These are very versatile, I regularly sub coconut, chips chia/ flax seeds, as long as you have 1 cup of oatmeal the rest works, though mine are allways too watery to add the milk so I skip it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marion Brown"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya Baird"
},
"reviewBody": "I used craisins insteas of raisins. It balanced the banana better. I also added some nutmeg. They taste divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiffany_mae"
},
"reviewBody": "Sooo good! Perfect recipe for my one and three year old. I only use three ingredients for them cinnamon applesauce, vanilla almond milk, and bananas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gabriela"
},
"reviewBody": "I added chopped almonds, yummy, will most probably bake again! Sweet tooth Satisfied. yoo-hoo!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sugar Doll"
},
"reviewBody": "Two words. Bland rubber. This was not even close to edible. What a waste of good ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ersmith1121"
},
"reviewBody": "I was unsure of what to expect when making these. I was pleasantly surprised by how delicious they smelled as they were cooking. so easy and absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia K"
},
"reviewBody": "I have been making these cookies for awhile now. I always add something different to change them up. I just made a batch and I just had to share what I did. I eliminated the raisins, I added 1 cup of toasted coconut flakes and some tiny dark chocolate chips. I also added 1 1/2 teaspoon of cinnamon and 1/8 teaspoon nutmeg. So good....just right for a little something sweet when your trying so hard to still eat healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alicia Laidlaw"
},
"reviewBody": "Healthy but not yummy. Something to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Ayer"
},
"reviewBody": "Great \"lower your cholesterol too\" recipe, I added teaspoon baking soda and 1/4 of flour. After they came out of oven I put a dab of honey on every other cookie, it really gave it the extra sweet taste if needed. Otherwise 100% super healthy, I would recommend eating these daily if you intend on using Oatmeal for cholesterol reduction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saads"
},
"reviewBody": "I made this today. I did not use any raisins but added chia seeds, flaxseeds, and sunflower seeds. It gave a really nice nutty flavour. Definitely making more of these. Great way to snack healthily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Will Joey Cell"
},
"reviewBody": "Perfect on the go. It's healthy and sugar free!!!\nDelicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnystream"
},
"reviewBody": "I made these cookies exactly to recipe and they were amazing. Perfect for anyone wanting to lose weight but needing to satisfy their sweet tooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lilyb0423"
},
"reviewBody": "Have just tried -taste good ,but stuck to pan. Broke into pieces trying to get off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Have just tried -taste good ,but stuck to pan. Broke into pieces trying to get off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Pastorelli-Hagar"
},
"reviewBody": "My husband is diabetic so I gave these a try adding 1/2 cup natural peanut butter to the recipe as another reviewer had recommended. We both loved them! They are soft &amp; chewy &amp; really yummy. Next time will try adding a different dried fruit or some chopped nuts or coconut to change things up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cuamaer"
},
"reviewBody": "I did not like this at all they spelled delicious but I took a bite and they were quite bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Ellis"
},
"reviewBody": "Please, please be sure to grease the cookie sheet first. Mine stuck badly and I had to rebake them a bit on the greased sheet.\nTaste isn't bad. Better than some boxed no sugar items I've had. I'll try a few variations with the ingredient amount to see if they come out better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Bowlby Moore"
},
"reviewBody": "These are fantastic! I add different ingredients every time - chia seeds, hemp seeds, sunflower seeds, chocolate chips, dried cranberries, dried apricots, dried pineapple. Pretty much any dried fruit works well. The variations are endless! They're a perfect breakfast on the go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "So I was bad and put brown sugar instead of aapplesauce because my son decided to polish off all of it that day. These are really good! Hearty and just good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhea C. Wong"
},
"reviewBody": "I can eat this for breakfast everyday! Definitely not your usual oatmeal raisin cookie as it is a little on the dense, filling side (1-2 and you're good); but one you can actually feel good about (no artificial sugar at all). Same recipe ratio can be used for muffins, though cooking time should be about 8-10 mins more. Must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dee Golden Gomer"
},
"reviewBody": "These are HORRIBLE!! Taste like wet rubber! I was at least expecting them to have a little crispiness to them. I followed recipe as stated and even cooked them a little more because they weren't even crisp. Will never make again!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/233012/no-sugar-oatmeal-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
"name": "Oatmeal Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17654/desserts/cookies/oatmeal-cookies/oatmeal-raisin-cookies/",
"name": "Oatmeal Raisin Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/233012/no-sugar-oatmeal-cookies/",
"name": "No-Sugar-Added Oatmeal Cookies"
}
}
]
}
}
, "about": [
]
}
]