				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "No-Sugar Apple Pie"
,"datePublished": "1999-11-21T21:35:54.000-05:00"
,"dateModified": "2022-11-14T12:21:35.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Carolyn"
,"url": "https://www.allrecipes.com/cook/26842577"
}
]
,"description": "This sugar-free apple pie is a naturally sweet and tart recipe that contains no added sugar. Enjoy a wholesome take on a classic favorite dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-s7SCtn998segjH-wcRx4TXJcFM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/59709-8ff88da0e49447c0815d4225fc32b18f.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "No-Sugar Apple Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "174"
}
,"cookTime": "PT65M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "307 kcal"
,"carbohydrateContent": "52 g"
,"fiberContent": "3 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "218 mg"
,"sugarContent": "30 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"2 (9 inch) pie crusts",
"1 (12 fluid ounce) can unsweetened apple juice concentrate, thawed",
"3 tablespoons cornstarch",
"1 tablespoon ground cinnamon",
"6 cups sliced green apples" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Whisk 1/3 cup apple juice concentrate together with cornstarch and cinnamon in a small bowl. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Simmer apples with remaining apple juice concentrate in a large saucepan until apples are tender, about 10 minutes. Stir in cornstarch mixture and continue to simmer until thickened. Remove from heat."
} ,{
"@type": "HowToStep"
,"text": "Spoon apple mixture into pastry-lined pie plate. Cover with top crust. Seal and flute edges. Cut steam vents in top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until crust is golden brown, about 45 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for parents, many years ago, still do. because it was easy and delicioys"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy easy easy and delicious, delicious, delicious. Kids thought it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a fantastic recipe, thank you very much for sharing. I made it multiple times now, it’s really delightful with peaches as well. In my neck of the woods, ( Florida)there is no apple or peach concentrate to be had. Hence I just use some regular organic juice and simmer it for a while before thickening it with cornstarch. I cut the starch down to 2 tbsp because of its high glycemic index ( 97%), it can spike blood sugar levels for pre diabetics. The pink lady is a fabulous apple, I like them crisp so I just slice them straight into the pie crust. I will try out other fruits but the apple and peach pies are definitely fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've been making this recipe for years, and the whole family loves it. It's simple, healthier, and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Wester"
},
"reviewBody": "I didn't use Apple Juice concentrate I used diet apple cider and 2 cups of Splenda and cooked apples for only a couple of minutes. I'm going to make this again and this time not cook apples. This should make the Apples slightly more crispy and less soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heavens Angel"
},
"reviewBody": "Easy to fallow, fast, taste delicious..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamiella Clark"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "Followed the recipe exactly except I used granny smith apples. This is an amazing pie and a definitely will do again. Who needs all that processed sugar?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Caley"
},
"reviewBody": "I love this pie. The only thing I changed was less apple concentrate and used more water. This alao helped cut back on the sugar. Also make a sugar free crust with almond flour...... Thanks for the tasty treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany S"
},
"reviewBody": "This is the second time ive made this pie i really like it very easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "christy323"
},
"reviewBody": "This pie is delicious. I used apple spice instead of only cinnamon &amp; my own sugar free crust recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark R. Cordz"
},
"reviewBody": "I followed the recipe exactly. Haven't tried it yet, but it smells wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "I made this for a social gathering that was attended by a diabetic. My friend was able to eat it and said it was the first time she'd eaten apple pie since she's been diagnosed. It was a real treat for her and we all found it delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jose Armijo"
},
"reviewBody": "Great and easy. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Gower"
},
"reviewBody": "i cook the apples longer and i normally overstuff my pie but thats only bc i really love this pie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxana Morán"
},
"reviewBody": "Used a gluten free pie crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Junebaby53"
},
"reviewBody": "Oh My ,it smelled and looked lovely but was so over sweet as the concentrate juice was overwhelming. I didn't offer it to my diabetic friend. I know it was the cause of too much concentrate. Possibly I used a larger can. Be ware of how much you use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ginger Watkins"
},
"reviewBody": "I made this leaving out the apple juice entirely- I added instead a jar of unsweetened applesauce. I also used red delicious apples instead of what the recipe called for. Apple juice is loaded with sugars, so that's not a very healthy alternative. The unsweetened applesauce worked great for my pie, and made the filling thick and lovely. It's a much healthier option that has zero added sugars. My crust is made homemade with Earth Balance instead of butter or other unhealthy oils. I didn't make this particular pie crust to be beautiful- it could've been. However, this pie I made for a fast dessert pie for supper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Wonderful , easy recipe and the taste is excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda V"
},
"reviewBody": "My son is diabetic but he loves Apple pie this sugar free option made him happy and he loved it. I also bought one to a Fourth of July gathering where there were everyone loved it ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalia Delgado"
},
"reviewBody": "So yummy! My whole family loved it! Will for sure make again! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Q"
},
"reviewBody": "On my second rendition or this recipe. It went over extremely well, the first time around. Should have brought a second one to the gathering . :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl T."
},
"reviewBody": "I loved this pie, but I did make some changes based on past experiences. I used red delicious apples instead of green apples because with no added sugar, the green apples tend to be too tart. Also before putting the apples in the pie shell, I tasted the mixture and it tasted a little bland to me. I added a little nutmeg, a pinch of salt and a little more cinnamon and re-tasted. It still was missing something which I finally determined to be sweetness. It was not very sweet. As I did not want to add sugar, which was the whole point of a sugarless pie, I had to think for a minute about what to do. Remembering something I heard in a cooking class I took, I added a couple of teaspoons of vanilla. It did the trick. I served it at a dinner with friends and it received rave reviews. I will be making this from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "my husband a diabetic said it is very good and I also liked it a lot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Angel Faires"
},
"reviewBody": "Great recipe, but as a diabetic, I refuse to use apple juice concentrate. It's like drinking 2-3 cups of juice per slice of pie. \n\nI used apples &amp; pears, fresh apple pear juice &amp; added a cup of Splenda, tsp allspice, cinnamon and nutmeg. \nPlease change the title of this recipe, as this is NOT No Sugar Apple Pie. When using any fruit, you will always have natural sugar content."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zalia"
},
"reviewBody": "I pressed our own apple juice and came out wonderful. Kids loved helping out with this pie :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn"
},
"reviewBody": "I am diabetic and can have little to no sugar, this is maybe the best apple pie I have had, the family request it all the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "I loved the tartness and was super easy to make. It just had way too much cinnamon for me. Next time I make it I will probably cut the cinnamon in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "Instead of apple juice concentrate, I reduced down some apple cider. The sweetness level was good, but double cooking the apples left them fairly mushy, and the pie could use more cinnamon and spices. I thought it was good, but not great; family members liked it fairly well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mike"
},
"reviewBody": "I loved it. Ingredients were very simple. Followed the directions exactly but with one exeption. I used 3 granny smith, 2 gala, and 1 fuji, apples. Apple concentrate give it all the sweetness needed and yet still had just a little tart to it. This is going to be my first choice in apple pie and im not diabetic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "robinjk"
},
"reviewBody": "This is a good pie, but is NOT good for diabetics, which is why it gets 3 stars. Apple pie, even with no added sugar, is filled with carbohydrates (one med apple alone has 25 simple carbs which immediately convert to sugar). Pie crust and cornstarch are the same. So while the pie itself is healthier than a 'normal' apple pie, this is not a good diabetic choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Teevie"
},
"reviewBody": "Use apple juice instead of juice concentrate. Change apples to 1/2 granny and 1/2 other pie apple, or all other pie apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jules"
},
"reviewBody": "Excellent recipe!!! Made another pie right after I tasted the first one. Didn't even need the apple juice concentrate. Used regular apple juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaPaula"
},
"reviewBody": "Used our homemade apple cider for the apple juice. My diabetic husband LOVES this pie, and so do the grandhcildren!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Menia Hussey"
},
"reviewBody": "I made it, but it was time consuming for me to peel the apples by hand. I will make again, though. It'a refreshing to have a sugar-free go to dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby Westwood-Gasser"
},
"reviewBody": "You would never know this does not contain processed sugar. I have found my new \"go too\" recipe for Holidays and other special occasions. I found It to be as time consuming as any other apple pie made from scratch but it's so much good and I'm sure it's better for you. The only \"tweek\" I made was I added 1/8 teas. of Nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taryn Graf"
},
"reviewBody": "Love this recipe! I made my own pie crust, but this recipe is great. I can't digest sugar, so I've made this a few times for a dinner party and no one knew it was sugar free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Foltz"
},
"reviewBody": "followed recipe and had so many people tell me how much they loved it. wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisaloo"
},
"reviewBody": "Well received, delicious and easy! The trifecta achieved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "I am so excited. This is my first Allrecipes review and I'm so glad it 's for this apple pie. \n\nI wanted to try this because my father in law who is diabetic is visiting for 3 weeks for the holidays. So when I came across this recipe I wax like a kid in a candy store. \n\nThis pie came out amazingly tasty. I did make a few changes after reading countless reviews. Since I couldn't find sugar free apple juice, I decided to used Motts Light Apple juice, Publix unsweetened organic apple sauce, nutmeg and all spice. I also went with 6 Fugi Apples as well. \n\nAs per another review, I wanted my pie to be chunky so I did not add the apples until after my filling thicken. Then I simmered the apples in the pie filling for about 10- 15 mins adding more apples juice, and spices as needed.\n\nI sampled the pie filling prior to pouring it into my pie shell and it wasn't tart nor sweet at all but it needed a hit. So I added about 2-3 table spoons of Stevia . I know it defeats the purpose but I used so little that it didn't alter the flavor at all.\n\nWhen I looked at the regular apple juice it had anywhere from 25-31 grams of sugar per cup. So the light only had 12 grams per 8 ounces so I went with that. \n\nThis is definitely a keeper. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MicheleB"
},
"reviewBody": "I did love this pie. I gave it 5 stars because it is all natural. I am type 2 diabetic and love sweets. I used honeycrisp apples, a little over 6 cups. I also cooked apples as called for &amp; apples were not mushy as some noted. I used a pre-made pie crust, which didn't brown as nice as I wanted it too. Bottom was doughy. I did bake it for 45 min as called, maybe more time next time? I added 2 packs of Splenda into juice mixture. It gave a touch of sweetness I always crave. Will definitely make again with some changes to pie crusts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances Lambert"
},
"reviewBody": "I used the three sweetest apples my grocery store had (Honeycrisp, Fuji, &amp; Gala) and followed the recipe and got rave reviews from my Mother-in-law who is a diabetic. I'm making it again for my mother-in-law's birthday and expect the same kind of results! I had researched lots of sugar free apple pie recipes and apples in general and decided to use the sweetest apples to compensate for not sugar! I can't use artificial sweeteners because they give me migraines, and with a diabetic husband and mother- in-law it limits the type of desserts I make these days, but this is a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I have made this recipe many times. My husband doesn't eat desserts with added sugar - the natural sugars in fruit seem to be OK for him, however. I have also made this pie with peaches instead of apples, and I used mixed berry juice concentrate in place of the apple juice concentrate. It turned out delicious. I am going to try it with strawberries - we have a ton of strawberries in the freezer - using the mixed berry juice concentrate. I think the possibilities are endless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shania"
},
"reviewBody": "I am pre-diabetic and am trying to stay away from sugar, but love love love sweets! This pie was just the thing I needed to satisfy my sweet tooth, but not off my blood sugar. Definitely a favorite for the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Krieter"
},
"reviewBody": "HAPPY PI DAY! I'm so glad I found this recipe. I was making an apple pie already when I was reminded that my dad's diet didn't allow him to have sugar. I looked up sugar free apple pie recipes and I saw this one. It sounded good so I decided to try it! I'm very happy to say that it turned out really well despite me never having made apple pie before. ^_^ Dad ate two slices and said it was really good! Also said it was worth making again after he finished this one, hahaha! I might try using more cornstarch next time though, he didn't think the gooey part was sticky enough. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Brown"
},
"reviewBody": "I only make this apple pie recipe any more...everyone loves it and my diabetic friends are especially happy...good to the last crumb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jack beggs"
},
"reviewBody": "Fantastic! I am and have been on a no sugar added diet for a few years now and have not felt better. One thing I have missed is a good quality pie without the added sugar. When I made this I was out of this world. A+ by everyone who tried it. I did make a few modifications: Because this diet does not allow fruit 'concentrates' (the theory is that the fiber slows down the abortion of the sugar into the bloodstream so you can process it normally), I had to find something else. Unsweetened Apple Sauce was what I used, though it is not as sweet. To sweeten I used about 10 chopped dates with pits removed and mixed it in with applesauce/cornstarch/cinnamon. When I put the crust on top I did not cut any holes so that the sweetness would absorb into the pie from the dates better. I used both green and red apples too. It turned out FANTASTIC! Best apple pie ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bita"
},
"reviewBody": "We made this for my Dad that is Diabetic… everyone at the table loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cassy MacDonald"
},
"reviewBody": "Turned out kinda mushy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cookinggymnast"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy Brisco"
},
"reviewBody": "Just made this pie today; I used Granny Smith apples and like the others said, I too was skeptical at first that the apple juice concentrate would be overpowered by the tartness of the apples, so I was pleasantly surprised the pie came out as well as it did! With my no-fail crust recipe, the pie was a hit, even for my picky husband! Will make this my go-to apple pie recipe as of today!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Hopper"
},
"reviewBody": "I made this today for Easter dinner dessert and it was delicious! I substituted white grape juice concentrate because I couldn't find apple juice concentrate. The recipe was extremely easy to make but it did overflow in the oven so you may want to put it on a flat baking sheet to catch any drips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "A wonderful pie! I used red delicious apples cooked in no-sugar-added apple juice that I reduced to increase the sweetness. This pie tasted so sweet, it was amazing that it had no table sugar (sucrose) in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liz"
},
"reviewBody": "Loved it! I baked it for my diabetic uncle I was blown away how good it was. I was amazed and couldn't tell it was sugarless other than natural sugar. I didn't use very much cinnamon and I used 3 Granny Smiths and three gala apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EAMCCARR"
},
"reviewBody": "Wonderful and there is no need for sugar. I used 6 Honeycrisp apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Opal"
},
"reviewBody": "I substituted the can of unsweetened apple juice concentrate for 1 1/2 cups of unsweetened apple sauce. \n\nThe grocery store didn't have the concentrate and the apple cider (reviewer Kathy S. suggested the use of apple cider instead of the concentrate). So I used the apple sauce. It what I normally use to substitute sugar in some baked goods so I thought why not? \n\nIt turned out really good. \n\nNext time I'm going to use apple cider like Kathy S. suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tbyrd"
},
"reviewBody": "I used reconstituted apple juice instead of the concentrated as I was making it for diabetics. Also, I used Johnathan apples. I would use a crisper, sweeter apple next time. Saying that, it was still a delicious pie. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debora C"
},
"reviewBody": "Can not Believe this has No sugar in it. It is The Best Apple pie. Who needs sugar with this Wonderful recipe. Thanks for sharing.5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Emi"
},
"reviewBody": "I really want to give this recipe a 5star for the no sugar and butter fillings but I don't know why my fillings turn out watery and I had to spoon out about 6 tablespoons of juice. \n\nRead from one of the top reviewer for this recipe that she don't wanna double cook the apples and I followed her style to thicken the entire can of apple juice with the cornstarch and stirred in it cinnamon then put the apples in the crust, glopped the apple concentrate mixture on top &amp; then covered it with the top crust. Baked it for 1 hour at 350, allowed to cool for an hour but recipe failed. Can anyone tell me what went wrong?\n\nI will try this recipe again and edit my review."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "When the pie first came out of the oven, it was very tart and I didn't think it was going to be edible. However, after it set in the refrigerator over night, it was wonderful the next day. Still a bit tart, but perfect for my tastes. I had to crumble it together and mix with brown sugar for my husband to eat it, but he's picky. My mom absolutely loved the recipe and wants me to make it again. So this is definitely going in my recipe box! The only reason it didn't get 5 stars is because I do expect apple pie to be sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rhonda D."
},
"reviewBody": "This is NOT a NO Sugar Pie, but a NO ADDED refined sugar pie. Other than that its good, but I can not serve this to my diabetic family members since the sugar content is much too high from the sugars in the concentrated juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "girleypearl"
},
"reviewBody": "The pie was easy to make and tasted good. I didn't use apple juice concentrate, I used fresh apple juice. Also, I put in some lemon juice to tart it up a bit. I also added a little splenda for a little extra sweetness without the calories. And I decided to experiment and added 2 nectarines. I liked it and would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ariel"
},
"reviewBody": "In my opinion, it needs sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tgoodhart"
},
"reviewBody": "I was SO pleased with the way my pie turned out. I used nutmeg instead of cloves and 1/2 red apples. Thank you for sharing your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jules1984"
},
"reviewBody": "This was easy and yummy! I just wish I had some way of knowing how many apples make 6 cups. Now I have an extra two in my saucepan and the lid lifted off my pie in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcbird"
},
"reviewBody": "I didn't really have enough apples, but made the 2 pies anyway. Did not have a top crust, either. Now that said ... DELICIOUS. The apples were from a co-worker's tree, not too tart. The pie was sweet even though it was sugar free. I can't wait to make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MN515"
},
"reviewBody": "This pie tastes great. The liquid was too much for the pie shell so next time I will use only half of the apple juice concentrate. Very, very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Staritz"
},
"reviewBody": "Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ajwright"
},
"reviewBody": "Nice recipe. Very easy to make and it turned out nicely. I couldn't find unsweetened apple juice concentrate so just used the regular. I mixed granny smiths with red delicious. I thought it was a nice mix of sweet and tart, but as per the hubby's request will use a combination of sweeter apple next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marlene Sweeney Nelson"
},
"reviewBody": "Made the pie over the weekend. Next time I will add lemon juice because the Granny Smith apples are very tart and need a little toning down. Otherwise it was good, except the apples turned to applesauce after cooking. Think I will try different apples next time also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Great recipe, luckily no one in family is diabetic. The juice I used was Orange/Pineapple/Apple because the stores I went to didn't have Apple. I thickened the juice first, added some raisins then apples uncooked. Added an oatmeal crumb topping instead of another pie crust and it turned out great. Only recipe we'll use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BLyn"
},
"reviewBody": "This is definitely more healthy than the \"sugar-added\" variety of apple pie, but it isn't necessarily better for diabetics, myself being one of them. Apple juice contains a lot of sugar (15 grams in half a cup RECONSTITUTED). I haven't figured out how many carbs are in a can of concentrate, but it definitely isn't a wise choice for a diabetic. That being said, this is super yummy, and doesn't need the extra calories from the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhilipD"
},
"reviewBody": "This was my first attempt at an apple pie and it came out wonderful. I did not simmer the apples as long as suggested and I used two different kinds of apples to add flavor. I also could not find unsweetened concentrate so unfortunately mine has some sugar but it came out tasting great. As soon as find unsweetened concentrate I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeSsNdOn"
},
"reviewBody": "this is great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha"
},
"reviewBody": "This recipe is delicious! I didn't follow it exactly, I just had 4 apples so I diced those up and poured some apple juice (not concentrate) into the pot. I probably added a lot more cinnamon that the recipe called for...I love cinnamon. I also added a couple dashes of nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dschaefer"
},
"reviewBody": "I absolutely loved this recipe! My dad has recently become borderline diabetic, so this recipe will be great for him! I used granny smith apples and even though it was a little tart (which i love) it was still sweet too. I also used sugar free cool whip when serving.....it went great with it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris From Kent, WA"
},
"reviewBody": "Absolutely delicious. I don't think I'll ever make Apple pie any other way again. This was fabulous and \"NOT\" too sweet as others mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathie Olney Lang"
},
"reviewBody": "not bad esp for a sugarless pie - almost too much cinamon but Rich really liked- so did the kids"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djzings"
},
"reviewBody": "I used mackintosh apples instead so it was probably a bit sweeter than it would have been with green apples. But it was still a big hit at Easter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marcella"
},
"reviewBody": "This pie turned out very well and tasted good. However, I think the 'No Sugar' in the title is a bit misleading. This pie has plenty of sugar in it from the fruit and the juice. I was rather taken aback when I saw the calorie content, which is more than a regular apple pie. It was very easy, though, and turned out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BensJen"
},
"reviewBody": "Wow! I'm impressed to find a \"sugarless\" recipe that doesn't use yucky sugar substitutes like Splenda! (dangerous!) This turned out great and is something that I don't feel guilty about feeding my family. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbiej"
},
"reviewBody": "Thanks so much for this recipe. I made it for Thanksgiving for my husband who is a recently diagnosed diabetic he loves apple pie and knew he would be tempted by the full sugar type of pie so I made him his own and it turned out great and after tasting the no sugar version the regular one actually tastes too sweet. i didn't have any trouble making it and it made my husband's Thanksgiving special. thanks again, Barbie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YogaMom"
},
"reviewBody": "Yummy! I adapted and used pre-made gluten free crust and made gluten free crumb crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "This is a very good substitute for your traditional apple pie. It's definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenda"
},
"reviewBody": "This was the best apple pie!! We loved it. Traditional Apple pie has always seemed to sweet to me. This pie has a natural rich fruit taste that is very satisfying. The only change I will make is that I used 1 tbs of cinnimon which seemed like too much 2 tsp would be plenty and I used Golden Delious apples I am making it again this week, Yummy! Try it warm :0"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocoluvs"
},
"reviewBody": "The best pie ever!!!!!! why bother putting sugar in? excellent , will make this recipe from now on. Followed exactly except for I used Cortland apples :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Les753"
},
"reviewBody": "This pie turned out great and tasted wonderful! It was my first time making pie and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beatriz"
},
"reviewBody": "yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "Trying hard to eat healthy and I think I hit the jackpot. This is sweet with just the concentrated apple juice. Will never use sugar again when I make apple pies. Great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakerjanna"
},
"reviewBody": "I made this pie as well as a sugar-added pie. this one was more of a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "russanjess"
},
"reviewBody": "Amazingly sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jjtraw"
},
"reviewBody": "Apple pie is my favorite dessert *ever,* and now that I no longer eat cane sugar, I'm thrilled to find a recipe that will allow me to still eat it! I've been experimenting with this recipe for about a year now, using it as a springboard for my personal perfect apple pie :) I use about eight red delicious apples - as sweet and good quality as I can find (you're not adding cane sugar to compensate for the tartness of green apples, so sweet is better). Make sure you slice the apples nice and thin, lots of surface area. 4 Tbs tapioca instead of 3 Tbs cornstarch - I prefer the flavor of tapioca. Two Tbs cinnamon and a heaping tsp of nutmeg, because I like a lot of spice in my pie. Also, I add about half a tablespoon of clover honey - that little bit of flavor just sets off the taste *perfectly.* This pie is good the night it's made, and *heavenly* the next day after the flavors have had a chance to meld. Also makes a very nice cobbler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jess13dc"
},
"reviewBody": "To my surprise I didn't miss the sugar at all! The first piece that I cut was a soupy mess but after sitting for almost 24 hours it had thickened up a little. This was quite good considering how few ingredients are required. Thanks to others for suggesting cooking this on top of a cookie sheet, that saved my oven from the sticky pool of juice that leaked everywhere!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roodie"
},
"reviewBody": "Delicious! I have given this recipe to everyone I know that bakes and they all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "This was an excellent pie. I served it as dessert at a card game for some elderly women, many of which are diabetic. They loved it. I followed the advice of other reviewers and used 5 Granny apples and a nut top crust, the rest of the ingredients were the same as listed. Everyone loved it. I served it with sugarfree vanilla ice-cream. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I used unfiltered apple juice instead of the concentrate, which was recommended by another user. It gave too much apple juice flavour for me. I would try it again, but change it up with some brown sugar added and some other spices like nutmeg. Perhaps this is a good base for some experiments???"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ruthee"
},
"reviewBody": "the flavor in this pie was wonderful, just because theres no sugar in it doesn`t mean your skimping on quality.\nI did add an extra 2 cups of apples for the second pie, because with only 6 cups, i felt like my apple pie was totally flat and waaay too liquady....also, only simmer your apples until they START to get tender, or else you`ll have mush.\nGreat recipes overall, with the changes, i`ll be making more pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This is delicious--but the \"no sugar added\" title is a bit misleading, it's very sweet! It almost put my diabetic father in a coma, but the rest of the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chibi chef"
},
"reviewBody": "I'd love to give this 5 stars for not using butter in the filling, but while it was good for a healthier recipe, it didn't wow me. I used super sweet Fuji apples instead of Granny Smiths, and I'm glad I did because the pie was a bit tart even with the sweeter apples. FYI: the body metabolizes fructose (fruit sugar) the same way as sucrose (table sugar). So while BOTH INCREASE BLOOD SUGAR, fructose is generally preferred because they usually come along with good stuff like fiber and vitamins, while things made sugar are usually processed and lacking nutritional value (i.e., apples vs cake)."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15697/no-sugar-apple-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
"name": "Apple Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15697/no-sugar-apple-pie/",
"name": "No-Sugar Apple Pie"
}
}
]
}
}
, "about": [
]
}
]