				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Oatmeal Cake II"
,"datePublished": "1999-02-11T18:02:43.000-05:00"
,"dateModified": "2022-07-14T16:19:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Glenda"
,"url": "https://www.allrecipes.com/cook/24323535"
}
]
,"description": "This a quick cake that &#39;s hearty enough to serve for breakfast or brunch."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TLnQS9XmwvLwAojQNeZbwSN4D-Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/93580-6d1a64510f9e4d2abb0d67e001c4c83e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Oatmeal Cake II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "83"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "141 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "26 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "137 mg"
,"sugarContent": "15 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1.25 cups boiling water",
"1 cup quick cooking oats",
"0.5 cup butter",
"0.75 cup packed brown sugar",
"0.75 cup white sugar",
"2 eggs",
"1 teaspoon vanilla extract",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"1 teaspoon ground cinnamon",
"1.5 cups all-purpose flour",
"0.5 cup raisins" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pour the boiling water over the quick oats and let stand for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 13x15 inch baking pan ."
} ,{
"@type": "HowToStep"
,"text": "Cream the shortening with the sugar until light. Beat in the eggs. Then add the oats and vanilla, mixing well."
} ,{
"@type": "HowToStep"
,"text": "Combine the baking soda, salt , cinnamon and flour. Mix until combined. Add the raisins to the flour mixture and coat well."
} ,{
"@type": "HowToStep"
,"text": "Add the raisin and flour mixture to the oatmeal mixture and stir to combine. Pour the batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 25 minutes or until a tester inserted near the center comes out clean. Dust with confectioners&#39; sugar or serve with whipped topping, if desired."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Wallace"
},
"reviewBody": "Made the recipe exactly as written. My husband said I could make this at any time! It was very moist. Next time I might add my own ideas like chopped dates and maybe some spices like clove or nutmeg. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Stow"
},
"reviewBody": "I made this exactly as the recipe says except for the raisins and they were so moist and delicious. I made cupcakes and baked for 20 minutes as others recommended. These are do very moist, just perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin MacLachlan"
},
"reviewBody": "I didn’t have vanilla extract or raisins so substituted with maple syrup &amp; blueberries. Baked in round pan for about 45mins. Turned out amazing. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Smith"
},
"reviewBody": "Perfect, perfect. I had lots pf oatmeal and thought to give this a try. I did as other reviews and only used 1/2 cup of each sugar then sprinkled a few chopped walnuts on top. That’s the only change. WOW DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Omaha Belly dance"
},
"reviewBody": "I made these for the family and we loved them. I increased the cinnamon to 2 teaspoons and used margarine. I also made some into muffins and used a 9×13 pan. I will be making these again! I liked the idea of adding apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Izaakrach"
},
"reviewBody": "super easy and fast. great breakfast paired with eggs and bacon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ayesha Parveen"
},
"reviewBody": "I have made this twice and it's a really great recipe. Although I halved the amount of sugar and used jaggery instead of brown sugar which made it even more delicious. I even reduced the amount of butter and used some Vegetable oil instead. I also used wheat flour instead of all purpose flour. Turned out healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farm Cook"
},
"reviewBody": "This is a keeper. Wanted a healthier cake so made these changes: scant 1/2 c of honey, 2t of stevia (no sugar!); 1 c whole wheat flour + 1/2 c of wheat germ. Also 1 1/4 t of cinnamon and 1/8 t of nutmeg and currents not raisins. It's a thin cake (also using ww flour made it rise less. But very tasty. We ate it slightly warm with butter since it is almost like a muffin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "surfingman1"
},
"reviewBody": "I give this cake 4 stars added a little vegetable oil. Baked for 35 minutes. After made a glaze with brown sugar half stick margarine and added a little milk. Heated and poked holes in cake and poured over. Very moist and sweet. This was made by Cheryl Brotschul. Hope hubby enjoys the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn"
},
"reviewBody": "Made it just how it said and it was great! Loved it. Thanks so much for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mricesingla"
},
"reviewBody": "I increased the portions to 30 so my cake wouldn't be so thin. It was delicious, moist, couldn't ask for a better cake. Followed directions as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bibibel"
},
"reviewBody": "I made this a little easier by adding the butter to the oatmeal &amp; water mixture so that it melted. I mixed dry ingredients together while it cooled. Once cool, I mixed in eggs and vanilla, followed by the dry ingredients. This was perfectly enough to make 2 9 inch pie tins. I added chopped apple instead of raisins and it was delicious. I also topped with some sliced almonds for texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Lee Mainka"
},
"reviewBody": "it turned out awesome i made 2 to more times already and i left out the raisins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathy Jean Knutson"
},
"reviewBody": "I halved it and it still came out as pictured. I thought it was plain, but good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mak"
},
"reviewBody": "I made these in mini muffin pans . I used liners for easy clean up. They were moist delicious and just the right size for a bite of something sweet. Great with coffee or tea. This recipe made 24 mini muffins with enough leftover to bake in a loaf pan. Freezes very well and can microwave for a few seconds to heat. I watch my calories but can't give up the little bite of something these are very satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Costa Upshaw"
},
"reviewBody": "I made this as a Sunday morning breakfast cake and tweaked it to meet the tastes/requirements of my daughter. I used gluten-free oats and flour, 2 T. butter, 3/4 c. unsweetened applesauce, 1/2 c. organic cane sugar, 1/2 c. each dried cherries and chopped dark chocolate (instead of raisins). All other measures and ingredients the same. I baked it in an 8x8\" pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YumBear"
},
"reviewBody": "I was looking for an apple oatmeal cake recipe, and with a few changes, this worked out perfectly! To save time, I microwaved the oatmeal for one minute with 1/4 cup extra water. I didn't want to wait for the butter to warm, so I cut the stick of butter into 1 inch sections and microwaved for 30 seconds. After mixing the wet and dry ingredients separately, I decided what I REALLY wanted was a cran-Apple cake. I measured 1/2 cup frozen cranberries and chopped them, then added the crans into the flour mixture instead of raisins. After mixing together the wet and dry ingredients, in went 1 1/2 cups of coarse lay chopped (skin on) Cortland apples. I also baked these in a 9x 13\" pan for the same amount of time specified for a 9x15. My thirteen year old who doesn't like cranberries just finished his fourth piece, and I thought the cranberries gave it a great tang!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stillearnin"
},
"reviewBody": "Thanx for the awesome recipe !! Was very moist, and just absolutely wonderful. I doubled the spices. Sub applesauce for butter, and used apprx 1 and half cup of leftover oatmeal from breakfast. I basically followed the recipe as is,, and turned out this well.. definitely a keeper. I used raisins that I soaked for half hour before mixing, then patted dry to floured ingred'ts. Blended all very well. I used a bundt dark non stick pan, and baked 5 mins longer. Fit the pan just right,, and dusted with confect sugar when cooled. Nice blended flavors,, just love this recipe,, been looking for awhile for one like this for years. Thanx again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby"
},
"reviewBody": "I made this today and it was really good. I made it in a 9x13 pan, but just put the serving size up to 32. At first it will seem as though there is not enough because this batter is thick, but just spread it with a spatula and it will come out perfect. I followed the recipe exactly, except instead of putting 3/4 cup of white sugar and 3/4 cup of brown sugar, I made a mixture of brown and white sugar that would come out to be 3/4 cup. In other words I just halved the amount of sugar. It was sweet even with only half the sugar! All that sugar is unnecessary. Other than that I loved this recipe. Except, the cinnamon in my opinion came out a little too much. But thats just me, I dont really like cinnamon very much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bebbiebell"
},
"reviewBody": "Made this exactly as recipe stated except I left out the raisins and added pecan pieces. It was very good and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana Searles Davidson"
},
"reviewBody": "I made this today--it's perfect and very easy. moist and tender. I did add extra cinnamon and 1 cup instead of 1/2 cup raisins. My grand kids love raisins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "This was just ok. didn't find anything spectacular about it. 13/x 15 pan just seemed too large for the amount of batter. I baked it in a 9.5\" pie plate and baked for about 35 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fatehpur"
},
"reviewBody": "This is a great base cake for a lot of add-ins! I don't like raisins so I added some Heath toffee chips and chocolate chips. I also made it in a 11x7 pan because I wanted it to be thicker. Very moist, looking forward to trying different add-ins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tish"
},
"reviewBody": "I used agave to substitue for the white sugar. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Alicia Cromwell"
},
"reviewBody": "Perfect tasting as is. Could try bringing the cal. and fat down, by substituting applesauce for the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yesijadee"
},
"reviewBody": "pretty good with coffee"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danell"
},
"reviewBody": "So yummy! I used blueberries instead of raisins and twice the cinnamon:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Wonderful cake! My husband and I devoured this cake over the weekend and I am already making this again!\n1st time I made with 1/4 c raisins &amp; 1/4 c semi-sweet choc. chips. My husband asked me to do 1 cup of the choc. chips only this time! I also made a crumb topping (from another review) which was 1/4 c brown sugar, 1/4 c flour &amp; 1 T butter (adjusting as needed... in a 9x13 pan double that..in a round pan the measurement is fine). Also added confect. sugar to top!\nI will make this over and over and...over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rinnie"
},
"reviewBody": "Have been eating this since I was a kid! LOVE this bread!!! I cook at 300 degrees for 1 hr."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mbfelix90"
},
"reviewBody": "This cake was good: sweet and hearty. Nonetheless, i can't give it any more than three stars since my idea of an oatmeal cake is more.. oatmealy! I will definitely try it out again and add a bunch more of oats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tullybear"
},
"reviewBody": "I thought this cake had a nice flavor.I made it just as written but I baked it in a 9x5 loaf pan because I was wanting to make more of an oatmeal bread out of it.The middle didn't get done but that's ok because I actually like mine gooey in the middle.My mom tried it and she liked it too.It's not one I would make very often but it was fun to try it since I do love oatmeal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlie"
},
"reviewBody": "quick and easy to make! not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Koh"
},
"reviewBody": "First off, I was never an oatmeal lover. However, since I had oatmeal in abundance, I decided to try this cake. What a pleasant pleasant surprise! The cake was moist and delicious, and it was really easy! I love it! And I will definitely be using oatmeal more in my cakes. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monica"
},
"reviewBody": "easy, moist, soft, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitsue"
},
"reviewBody": "I didn't have a small enough pan, used a loaf pan to bake, this increased the cooking time to an hour to finish baking. I halved the recipe, used only Brown Sugar, and may have used porrage oats accidentally. So I guess I kind of screwed the recipe up with that....But it's a decent cake, have some milk with it. Despite my inability to know what kind of oats I used, I'd have to say it's worth 5 stars just because it managed to pull itself together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DesiLu"
},
"reviewBody": "I also used dried cranberries and substituted water for fresh orange juice. I added the peel from the orange and it was fresh and wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eattolive"
},
"reviewBody": "I made a few changes to see if I could make do with less sugar: instead of white sugar I used 1/3 c. honey. I increased the brown sugar to 1 and 1/3 cup, and used 2 tsp. cinnamon (not one) and instead of butter I used 3/4 c. applesauce. It was moist and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "My family loves this cake with these small changes. Instead of butter, I use applesauce. I also cut back on the sugar and omitted the raisins. A little more vanilla, 2 tsp of cinnamon, a little more oatmeal, and a lot of love. ^_^"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "My husband raved and said he could eat it every day. I thought they were just okay. They tasted a bit \"wet\". Like oatmeal mashed into a cake. I would prefer something closer to an oatmeal cookie or oatmeal biscuit. Good flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "I rarely make a recipe \"as is\" - and this one was no acception. I had to add a little nutmeg, probably 1/2 teaspoon, since it reminded me of my oatmeal cookie recipe (which of course has nutmeg). I'm also a major raisin fan, so took others' advice &amp; doubled to 1 cup - I also plumped them w/some boiling water first. opted for an 8x8 cake (for home) + 9 cupcakes for the office folks. everyone raved. thank you for a good one, I'll be making it again, but will add a little more oatmeal next time - just not enough \"presense\" for my taste. mmm - yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "Very good and easy, but half the sugar that's called for is plenty, unless you wanted something very dessert-like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "Makes a very good coffee/breakfast cake! I omitted the raisins, and only used half of the sugar (1/4 cup sugar, 1/2 cup brown sugar) and it turned out great. I also added some wheat germ to the dry ingredients. I will definitely make this again for our freezer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ Rodgers"
},
"reviewBody": "This was fabulous ! I used a 9x13 pan and increased the ingredients for 32 servings and it raised all the way to the top of the pan. I served it to a group of 16 and it was gone !!! No leftovers for me to bring back home.\n\nEveryone commented how moist and flavorful it was and several want the recipe. \n\nI did not add the raisins since I did not have any but I don't think it would have made that big of a difference. This cake is wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chairman James"
},
"reviewBody": "Add more raisins and some nuts. A 9 x 13 baking pan is about the right size, otherwise it's too flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bwright"
},
"reviewBody": "This is delicious! I highly recommend it! So moist and only slightly sweet, not overwhelming. Great breakfast goodie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina"
},
"reviewBody": "YUM! My whole family loved this. My kids each ate two pieces for an after-school snack, and would've had more if I let them. I used instant oatmeal instead of quick oats (because I needed a way to use it up), and topped it with a streusel topping. It was so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lemon Mama"
},
"reviewBody": "This was pretty good. Not amazing, but good! I made the recipe into 15 muffins and put an oatmeal/brown sugar crumble on top. I baked them for 20 minutes at 350 and they were just right--moist inside, a little crunchy on top--yum! I made a few small changes, such as added 2 tsp. cinnamon, 1/2 cups of each sugar, and 1.5 teasp. of the baking soda. Thanks for a good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This cake was so good. I made the following adjustments after reading the other reviews. I cut the sugar back to 1/2 cup of each. I added some pecans on top, cuz that is what we have plenty of in South Georgia right now. I put my batter in a 28x18 cm pan. Smaller than the 9x13 and the cake came out nice and moist and thick. Will make again and again!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REDDEBKELLY"
},
"reviewBody": "To die for! I added two chopped granny smith apples and made a streusel topping. I baked it in a 9 x 13 and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ENSHALACOOK"
},
"reviewBody": "moist, tasty, great solid recipe. I added pecans and a crumble, too, yet would have also enjoyed it on its own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kari"
},
"reviewBody": "Five year old Sam says \"I think this is the goodest thing I've ever had.\" I also used a 9X13 pan, chopped apples instead of raisins and 1/2 wheat flour, then added a 1/2 t. baking powder, and a struessel topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dbldutchtreat"
},
"reviewBody": "Will definitely keep this in my arsenal - everyone liked it and was asked for recipe.\nI followed some advise by adding a crumb topping, substituted cranberries for raisins, and added a small granny smith apple (peeled and diced). Used 8x8 pan which made a VERY thick cake and which took about 40 minutes to cook. Still moist. Did not give it 5 stars only because this is a solid dish but not a WOW."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrnTheEmpireDown"
},
"reviewBody": "really tasty, heavy cake..I've only made the cake part though, no icing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Miller Cook"
},
"reviewBody": "Very good, but I felt it needed some sort of topping. Next time, I made a crumb topping as follows: 2 packages instant oatmeal (apples &amp;cinnamon), 1/2 cup brown sugar, 1/4 c flour, 1/4 tsp cinammon, 1/4 c butter (melted). Mix all together and crumble over top of cake batter before baking. YUM! Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WriteasRain"
},
"reviewBody": "I also used 1 tbsp of cinnamon and in place of raisins, I used some fresh honey crisp apple, and a streusle topping. The 11 year old said , \"I LOVE IT\" The 10 yro said, It is good, I like it\" The 13 yro...hes not out of bed, more for the rest of us! Will make again. I used in a bundt pan, and I was impressed with how pretty it looked. We didnt serve any topping with it..great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shan~"
},
"reviewBody": "Very good. I used whole wheat flour (added an extra half tsp of soda) and added choc chips. I also took another reviewers advice and put on a crumb topping. I used an 8 by 8 pan, but baking time was more like 35 min rather than 25."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Langley"
},
"reviewBody": "This was quite good. I didn't have quick cooking oats - used old fashioned instead. I also made a crumb topping. It was all excellent. Kids loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessica"
},
"reviewBody": "Wow!! This was super easy and delicious. I baked it in a round pan (a 9x13 would have been too big, i think) and had a bit extra left over for a few muffins. I ommitted the raisins and added a crumb topping (1/4 cup flour, 1/4 cup brown sugar, 1 TB butter). Definitely will make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kj"
},
"reviewBody": "This was really good, although I did make some minor modifications. As suggested by other reviewers, I baked it in an 8x8 pan so it would not be so thin. I also added a little extra cinammon, used Splenda instead of sugar, and replaced the raisins with chocolate chips and chopped pecans. I will definitely make it again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne Shaw Weeks"
},
"reviewBody": "This is an excellent basic recipe using oatmeal. I made it into muffins. I think it would be more interesting if it contained fresh berries instead of raisins. Adding a little wheat germ or flax seed would make it healthier and the sugar could be reduced or substituted. Overall, it made a great breakfast cake/muffin and could benefit from individual variations on the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "milly"
},
"reviewBody": "Just forgot to mention that i only had white sugar on hand. Also for a doubled recipe i only used 2 cups of white sugar in total. This cake is even better this morning. I may just eat the whole thing myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Salsera713"
},
"reviewBody": "This is a nice, healthy alternative to the usual brownies and breakfast cakes and quite good. I don't think I let it cook long enough and next time will leave it in for a few more minutes, but I do think you have to be careful with this drying out, so I'll keep a watchful eye. I took it to the office for breakfast and by the end of the day it was all gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Nelson Tallacksen"
},
"reviewBody": "I followed the recipe except added 1 C. of raisins. Made it into 12 muffins and had just a little batter left over (not even enough to make 1 more). Baked at suggested temp. for about 20 minutes. The muffins are moist and the taste is wonderful! Will be making these again. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mrs. Jabaay"
},
"reviewBody": "This recipe was OK. It was kind of dry and plain. I doubt I'll make it again, but it was an experiment and worth the try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arasam22"
},
"reviewBody": "Yuuuum!! This was so good. Very moist and delicious. I only made two changes: I put it in an 8x8 pan because it looked like it wouldn't be enough for a 9x13 and i was probably right, it was perfect for an 8x8. I also didn't put in any raisins because no one in my family likes them. I will definitely make this again. Great job!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GlassWalls"
},
"reviewBody": "Yummy. :) Definitely very moist. But spread very thin.. and I somehow managed to not put in enough sugar. =/ It was extremely easy though; I'll probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "APPLESPEARS"
},
"reviewBody": "I made this cake following the recipe exactly with one exception: I baked it in a 9x13\" glass pan. We did not top it with cream - just the powdered sugar. It was wonderfully moist and delicious! My husband and children all enjoyed it. Thank you for a great recipe!\nI might try this with a crumble topping next time. I might also try it as muffins, but I think it would be too moist for paper muffin cups - I'd try it straight in the muffin tin. However I make it again, I will be sure to watch it carefully. It was moist this time, but it seems like the kind of recipe that could get dry quickly if you bake it too long. \nThis is definitely a recipe to keep!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsey Wolnowski"
},
"reviewBody": "Great cake. I used chocolate chips instead of rasins. I also increased the cinnamon, and I added some nutmeg aslo. I iced this with Chocolate Sour Cream Icing. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHILLABILA"
},
"reviewBody": "Yummy in the Tummy! I made this for my son's preschool snack. I left out the raisins and dusted in with powdered sugar. it is a good thing I had to send most of it to school or I would have ate it all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ENGINEERING"
},
"reviewBody": "Great recipe - easy to prepare (made it into muffins). However, I adjusted it somewhat - added a 1/2 cup of white sugar and 1/2 cup brown sugar and it was sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very hearty cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my family of six. Most of us loved it, but my teenage son thought it was kind of sweet. He still ate it all. LOL\r\n\r\nMy only comment would be that I used a 9 X 13 pan and that was plenty big. The cake was less than an inch tall using that pan. I've never seen a 13 X 15 pan, but I can't imagine it would have given me a very thick cake if I had used one.\r\n\r\nWe'll definitely be making this again!\r\n\r\nThanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was very good, I will make again. Very moist. I made cupcakes(muffins) instead, it made 19 at 3/4 full."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8147/oatmeal-cake-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/389/desserts/cakes/coffee-cake/",
"name": "Coffee Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8147/oatmeal-cake-ii/",
"name": "Oatmeal Cake II"
}
}
]
}
}
, "about": [
]
}
]