				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Old-Fashioned Strawberry Pie"
,"datePublished": "1998-11-15T21:45:58.000-05:00"
,"dateModified": "2022-11-17T18:49:39.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cindy B"
,"url": "https://www.allrecipes.com/cook/24322227"
}
]
,"description": "A wonderful baked strawberry pie recipe. Fresh berries are baked with flour, sugar, and cinnamon — piled into a prepared crust for an easy dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/tQrF_3GZh6zBC3nKaCos5qWACj4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/12468-Old-Fashioned-Strawberry-Pie-naples34102_5206296_original-4x3-1-105565a8ae924b56908a4554e54308bd.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Old-Fashioned Strawberry Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "292"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "412 kcal"
,"carbohydrateContent": "63 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "301 mg"
,"sugarContent": "35 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 (9 inch) unbaked pie crusts",
"1.25 cups white sugar",
"0.33329999446869 cup all-purpose flour",
"0.5 teaspoon ground cinnamon",
"4 cups fresh strawberries",
"2 tablespoons butter, cut into pieces" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C). Place 1 crust in the bottom of a 9-inch pie pan."
} ,{
"@type": "HowToStep"
,"text": "Combine sugar, flour, and cinnamon in a bowl. Mix lightly through strawberries."
} ,{
"@type": "HowToStep"
,"text": "Pour filling into the pastry-lined pan and dot with butter pieces. Cover with top crust and cut slits in the top to vent. Seal and flute the edges."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the crust is slightly browned, 35 to 45 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Lia Rubio"
},
"reviewBody": "Amazing recipe! I used cornstarch as a thickener instead of flour because it is what I am used to. I also threw in some blueberries because I had them! It was AMAZING! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolanne Howell Gurley"
},
"reviewBody": "I did add the 2 tablespoons of cornstarch and used a butter pie crust recipe from this site! It was fabulous!! My family and myself loved it. I love alrecipes!! Every thing I cook that I find on this site is always fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This pie was awesome. I added corn starch to the flour ingredients. The rest I followed as stated. Let the pie set a few hours before eating. We have been eating this for three days and we don't eat any kind of sweets. Definitely making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bzemom"
},
"reviewBody": "Amazing and easy recipe. After strawberry picking I realized I had an over abundance of berries. I searched for what I thought looked like the perfect recipe and I was right!! Second time in 3 days making this pie. I followed some suggestions and added 2 tablespoons of corn starch and cream and Sugar on top. Look no further...this is a keeper for sure!."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I haven't tasted the pie yet, but thus far it looks delicious! I used a few of the modifications, such as adding 2 tbsp. of cornstarch to the filling and baking at 425°f for 30 minutes and then changing it to 350°f for the last 20 minutes. Made my own butter crust. Looks great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added 2 spoons of corn starch to thicken it up. People ask me to make this pie every season"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caseydmcinet"
},
"reviewBody": "I made exactly as specified. My husband raved about this pie. Best strawberry pie ever. I used egg white to wash the top crust. Makes it beautiful golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tish"
},
"reviewBody": "My late grandmother used to make these all of the time and I’ve been feeling her nudging me to make one for the past few weeks. With a little modification, this recipe is spot on!! I only used about 1 TBSP of butter in total on the top/bottom crusts and in the filling, 1 TBSP of raw brown sugar in the pie filling, squeezed fresh lime juice over the strawberries, added corn starch, dressed up the pie crust with a mixture of cinnamon/brown sugar with a pinch of salt, and baked the bottom pie crust for 10 min before adding the filling. I also baked it on high at 218 Celsius which is 425 degrees for a half hour and 350 degrees for 15 minutes. Then I let it cook before I cut it. I normally don’t like my baked goods super sweet hence the low amount of sugar added to this dish. It was delicious but I could’ve added a lil bit more to the fresh strawberries although they were already pretty sweet. I did add a pinch of salt to the strawberries to draw out the sweetness. The crust was flaky and golden brown while the pie filling settled nicely, not soupy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "I read Frank the trained cooks review and many others before baking. I sadly didn’t have 5 cups of strawberries but 4. For me the 1.4 cup flour four cups berries was too dry. I did add milk and a little sugar as frank suggested but it did t really do much in this pie for me. I would try again but 5 cups Berries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joella777"
},
"reviewBody": "Made exactly like recipe it was perfect thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celine"
},
"reviewBody": "Sliced the strawberries, only used 3/4-cup sugar and forgot about the butter before adding top crust. This was fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "reblef01"
},
"reviewBody": "It turned out runny and wayyyy too sweet. I'd put half the sugar and a bit less butter maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ranayamak117"
},
"reviewBody": "I did it yesterday and followed my daughter's lecturing tbe recipe. I got a good looking pie but not a sweet one. The consistancy of the dough was good so I'll try it again and pour the filling onto the dough. It needs 35 minutes no more. To compensate on the missing sugar I poured ice sugar and strawberry marmelade"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Susut"
},
"reviewBody": "This will be my go to recipe for two crust strawberry pie. I read a few reviews before starting. I made a couple of tweaks. I added one tablespoon of cornstarch to the flour. I used one cup of sugar because my berries were sweet. I let the strawberry mixture sit while I rolled the pastry and put it in the pie plate. Quite a bit of juice came out so I drained some leaving the mixture juicy but not swimming in it. The pie was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jeri Young"
},
"reviewBody": "Well, I did not read the reviews on this before I made it, like so many others and alas, I ended up with the dreaded strawberry soup pie. The taste was great over ice cream but I’m so glad I didn’t serve this at the family function I was planning it for. It was an absolute mess. I used such beautiful strawberries too. Grrrrr. Use some kind of thickener, the flour is not enough, at\nALL."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mina Y"
},
"reviewBody": "This was excellent and i made no changes whatsoever! I might add a few more strawberries next time because the pie looks less full than I would like but you simply can't go wrong here. Amazing and much thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PhDiva"
},
"reviewBody": "My absolute go-to strawberry pie! I substitute 1/3 cup of corn starch for the flour. In addition, I brush the top crust with cream and sprinkle a bit of sugar on top before baking. Aside from that, I followed everything exactly as written. \nFor those who think that too much juice is produced: I discovered a while ago that if I make my berry pies the day before, they really are best when they have lots of juice out the oven; overnight, the juice condenses into a delicious and pleasant texture. Everyone in my family loves this pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patty Greer"
},
"reviewBody": "I really liked this recipe. I would cut the amount of sugar by half!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Mansfield"
},
"reviewBody": "I loved this recipe. I did a couple of things different though. I cubed up 8 oz of cream cheese (let get to room temperature first) with the strawberries and sugar in a pot and heat until all was mixed well and the berries released the juice, then added the cinnamon, then added a 2 TBSP of cornstarch for thickening (I like a thicker pie filling, I mixed it with maybe 1/3 cup cold water before adding). I then poured the mixture into my crust, added my top crust, brushed with milk and sprinkled with sugar, then baked for 45 minutes at 350. Turned out beautifully. I do realize my lattice crust isn't perfect lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginjafide"
},
"reviewBody": "I made this, and i put a cup and 1/2 of sugar with cornstarch to thinken it, its still in the oven but im sure it will taste great!! thanks for the easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie D Ostic"
},
"reviewBody": "So super easy!! Followed the directions and used melted butter and sugar as a topping!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Ladner"
},
"reviewBody": "I have made this pie at least three times and it has come out great each time. Strawberries are plentiful most of the summer so it makes an inexpensive and delicious dessert . As long as you mix the strawberries well with the flour and sugar it comes out perfect each time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol Miller"
},
"reviewBody": "Great fresh strawberry taste. Easy to make. It was also super delicious when served with a good vanilla icecream. I totally love that strawberries and cream flavor.\nMine was just a little bit more juicy than I would have liked otherwise no complaints here. \nI only used a cup of sugar as my strawberries were fairly sweet to start with and I really don't care for overly sweet desserts anyways. \nI used 2.5 lbs of fresh strawberries. \nI would definitely make this pie again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Denise Rhoades"
},
"reviewBody": "I had never tried making a strawberry pie this way and I won't do it again. I actually decided not to serve it for dessert. The taste of the strawberries got lost in the thickening AND it made a colossal mess in my oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra Snow"
},
"reviewBody": "We’ll be careful of baking it I cooked at 425 I checked after 30 it’s good I did some of the crust got burnt haven’t tastiest it yet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alain Gauthier"
},
"reviewBody": "I am voting again because I had the pie again a day later and it is AMAZING!!! It thickens nicely and is just perfect. Will definitely make again. The ONLY thing I changed was cutting back on sugar to 1 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen jen"
},
"reviewBody": "Added a little more flour turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FNChef"
},
"reviewBody": "I followed the exact modifications from Naples review, as usual, though it required closer to 55 minutes. Baked beautifully My edges didn't stay crimped tightly all the way around, but I love how much this reminds me of a pie my grandma would've made for us. Unfortunately, I won't be eating this one as it's for a client to take to her father for his birthday! But it's one I will proudly deliver to her."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brother Ron"
},
"reviewBody": "This is an awesome pie. I did make a few changes. Reading most of the reviews I was concerned I would end up with strawberry soup pie so in addition to the 1/4 cup flour I also added 1/3 cup corn starch. When I added the flour, corn starch and sugar I mixed them by hand using some kitchen latex gloves so as not to end up smashing the berries with a spoon. I cut the larger berries into 1/2 the size. I also left out the butter and cinnamon because I did not want to take away the taste of the fruit. The pie came out absolutely perfect as far as consistency goes. Not soupy at all yet not gelled either. Great recipe just make sure you use more thickening agent than the original recipe called for. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kira Rich"
},
"reviewBody": "Hands down the best pie I've eaten. The strawberry filling was sooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "Very tasty me I had to beat people away with a club"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Natalie Johnson"
},
"reviewBody": "Tried this recipe today, and I saw that some people found it watery so I added cornstarch like they recommended, but it still came out super watery, and I could taste the flour in the mixture. It was more like a juicy cobbler which was good, but I didn't like the flour taste. I also added zest of one orange and that was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maboyles84"
},
"reviewBody": "It was very good! My berries were fairly sweet, so only used a cup of sugar. Added cornstarch to make sure the pie was thick. I just felt it was lacking something. I feel it needed a touch of tartness since the berries were more sweet than tart. Perhaps a little more cinnamon could have helped as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Abigail Delaney"
},
"reviewBody": "I made this pie for my dad he said it was missing something I really think he thinks it taste like I can see it on his face as he is eating the pie. My dad is very disappointed in me and my pie I am going to cry myself to sleep"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kmanalo"
},
"reviewBody": "I made this exactly as the recipe is written. It is VERY juicy. I stuck it in the fridge to see if it would set up at all. Wish I would have read the comments. Afraid it won’t be fit to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Abigail"
},
"reviewBody": "It looked good, but it was very juicy; the strawberries were swimming in their juice. I had added 1tbsp cornstarch like others recommended, but it was still very runny. However, after we extracted some of the juices, it tasted very good. I tasted like an apple pie though, no strawberry flavor for some reason. the sweetness was good, since my strawberries were fresh and sweet already, i added less sugar, like only 1 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Kublitskiy"
},
"reviewBody": "Delicious! Included picture of day 2 of the pie and it’s still beautiful - used fresh strawberries 3/4 cup sugar, 1 tbsp corn starch and 3/4 cup flour. Made a crumble top instead of the top crust, baked as instructed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Storey"
},
"reviewBody": "I'm just going by looks, cause this pie is for my son for his Birthday. It looks great to me. I'll let you know what he thinks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "I used strawberries and blueberries! For the crust I used the Betty Crocker pie crust box mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Victoria Lewis"
},
"reviewBody": "When I make it again I would want it to be thicker and not as runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma MacDonald"
},
"reviewBody": "I read other reviews before beginning because the recipe seemed too simple for someone like me who usually needs a hand hold. The key to having a thick pie that doesn't run is cooking the filling in a pan first, on medium low to low heat! My strawberries were a bit on the tart side, so I stuck with the cup of sugar. I decided against the cinnamon all together, and instead went with a tiny splash of vanilla and juice from half a small lemon. I also bumped up the flower to a 1/2 cup, but when you cook it all together on low heat, you may not need that much. Recipe definitely calls for whipped cream on top! will definitely keep baking and experimenting, but i think cooking is the key"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roxy"
},
"reviewBody": "Very good ..little runny but what sat overnight is not as runny definatly a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Always a crowd pleaser! This pie never lets me down.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim-S"
},
"reviewBody": "I made this pie at my granddaughter's suggestion. I had never heard of strawberry pie but this one has a delicious strawberry flavour, which we very much enjoyed. However, I found the recipe too sweet so I will cut back on the sugar if I make this pie again. Also the juice is way too watery, which will make the bottom crust soggy by the time we eat more tomorrow. If I make this recipe again I will at try doubling the amount of flour to thicken the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katt Meagher"
},
"reviewBody": "Looks like it turned out !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianeK"
},
"reviewBody": "It's very difficult to wait until tomorrow for my 2nd piece. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachael Forrester"
},
"reviewBody": "Added more flour like suggested to thicken the juices and oh my gosh it's so delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lockhart"
},
"reviewBody": "This was so easy and so delicious. I cut back on the sugar and flour, using 1 cup of sugar and 1/4 cup of flour. And in my haste, I forgot to add the butter. It was quite delicious with the bonus of cutting a few calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marguerite Susan Grondin"
},
"reviewBody": "I made this delicious pie and let me tell you it was unbelievable. Followed this recipe and will continue to make again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cherylmom22"
},
"reviewBody": "Most amazing taste! Will make again. Inside was very funny. Next time will try one of the many tips in reviews to reduce that problem. We solved it this by eating a slice while still warm and then draining out the extra. Hopefully this will keep crust from going soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marci Banes"
},
"reviewBody": "The best Strawberry Pie that I have made. I would suggest that if your strawberries are really sweet adjust the added sugar. I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Mallette"
},
"reviewBody": "I have made it twice, the first time I tried less sugar and it was not sweet enough and th second time I put the exact amount of sugar as th recipe and it was perfect. I also replaced the flour with minute tapioca. Delicious ...I almost cried it was so good.This is definitely my favourite dessert pie to make. I am just about to make a third one. That would be 3 strawberry tapioca pies in about 2 weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Anderson"
},
"reviewBody": "Yum, love this recipe. It's been my go to for ages now and the kids LOVE it. I've tried many strawberries but I find that Driscoll's are the most consistent and sweet all year round\nhttps://www.driscolls.com.au/berries/strawberries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Montefel"
},
"reviewBody": "The taste was delicious, the filling was too loose; may need to adjust flour in the future or use corn starch or tapioca instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "S"
},
"reviewBody": "Totally runny. It didn't set and I had to dump the liquid out. a failure. \nDon't give it a 5 star if you modify it! Then, it is a different recipe.\nVery disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darien Moore"
},
"reviewBody": "turned out amazing!! i brushed with an egg+ water wash right before baking, if you do this make sure you don’t leave any clumps and leave a very thin layer all over instead because the spots that were thicker with egg did turn a little soggy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Meagan Cervelli"
},
"reviewBody": "Pie was tasty But super runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "It was runny, and the crust browned too fast. I would add more flour and cook at a lower temperature."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ronald Romancik"
},
"reviewBody": "The pie came out great. I used fresh whole berries, cut the larger ones in half. I followed the recipe and took some suggestions from previous reviews. I add 1/4 cornstarch and thats about it. Used a lattes pie crust on the top thought that would down the moisture from the berries. All in all the pie was delicious a little moist but not soupy. Stayed together nicely when sliced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Ellsworth"
},
"reviewBody": "I gave this 5 stars just the way it is! I changed nothing!!! Awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brianna "
},
"reviewBody": "great recipe but for all pies using frozen berries is NOT an option!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaCa"
},
"reviewBody": "Made this twice. A very delicious pie! Received many compliments, and one person scrapped the pan! The strawberries were very ripe, so I decreased the sugar to 1cup. The second time I thickened the filling by increasing the flour to 1/2cup and adding 1Tbsp cornstarch. Thank you so much for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Morris Leak"
},
"reviewBody": "After reading the reviews, I only tweaked the recipe a little by adding a little more flour and sugar. My Husband Absolutely Loved this pie, and I must say that it was very delicious and turned out extremely well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah Sue Messenger"
},
"reviewBody": "This is a great pie recipe! I’ve returned to it many times over now. Like many others have said, I will join them with saying that berry pies require a level of intuition in order for them to turn out well. Following a berry pie recipe verbatim might turn out great or turn out awful depending on your berries. \n\nFor example, the first time I made this pie, it turned out really soupy... tasted fabulous, but I was disappointed in the soupy texture. I knew it has nothing to do with the recipe, but everything to do with not following my gut when I was putting the berry mix together. I felt like I should have added more flour, or corn starch even. \n\nThe second time I made it, I planned accordingly... tasted my berries first to adjust the sugar content... and added some extra thickening agents so it would turn out less soupy. \n\nGood pies take practice and each pie can be very different from the next in the creation of it. Go ahead and keep practicing! I mean, you get pie out of the deal each time. ???????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen B"
},
"reviewBody": "This is an excellent pie!! Will definitely make it again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer"
},
"reviewBody": "I did add a half of can of strawberry pie filing, (Our Family brand). It is cooling now, and it's my first pie. I'm so proud of myself. I'm starting to like this easy baking thing. If you have any easy simple recipe ideas please let me know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Nicole Gathing"
},
"reviewBody": "I love this recipe I make it every year and my family loves it. When I first made it the filling was too runny and my pie wouldn’t hold shape so I decided to try corn starch as a thickener and cooked some if the juices down on the stovetop first and the pie came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine McCollister"
},
"reviewBody": "Normally I read reviews but failed to this time. whoops..... I'm sure a little cornstarch would have been good. As is, it's a bit juicy but it's very tasty and we just enjoy w a spoon. My picture is not great, sorry. I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaptainron"
},
"reviewBody": "My first try I got strawberry soup, the crust was almost burnt but the strawberries were still raw. Next time I started off at 425 degrees for about 10min and then turned it down to 325 degrees until it bubbled, and it turned out just like the picture and tasted great!\nI will make it again.\nThanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billie Branham"
},
"reviewBody": "This was a superb recipe. Everyone enjoyed it and it wasn't too sweet at all. I got many compliments. I'll make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Powell"
},
"reviewBody": "This pie is one of perfection!! Easy and absolutely delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Sweet and light and so so summery. Leave your berries whole and it solves the \"juicy\"problem. Freaking awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "green77"
},
"reviewBody": "I consider myself a good pie maker but his pie was an epic failure. It was very liquidy. And cinnamon and strawberries do not go well together. I will continue to search for better recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "John DeWilde"
},
"reviewBody": "Good flavor, but a runny mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "I would place tin foil around the crust edges for the first 15 minutes. I also didn't have enough strawberries so I added a little fresh rhubarb. My husband doesn't like whip cream so we had vanilla ice cream instead. Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Nickoloff"
},
"reviewBody": "This pie was so easy I have made it a couple of different ways. I added one sliced ripe banana last time for Strawberry banana pie. Outstanding!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christine Dehnke"
},
"reviewBody": "Love anything with strawberries, but this was a bit too sweet and a bit runny. I will decrease the sugar and increase the flour next time I make it. It's a keeper, though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foxy Lady"
},
"reviewBody": "This pie was absolutely delicious! My only changes were to add about 2 tablespoons of cornstarch for thickening, and use less sugar (after tasting my strawberries). Thanks for a great &amp; easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vicki Marie Haighway"
},
"reviewBody": "Good flavour. But came out soupy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Fults"
},
"reviewBody": "Thank you for sharing this recipe, it is the best strawberry pie I've ever made. I did reduce the sugar down to 1c, pre reviews and baked 425 for 25 min and 350 for the last 15, it came out perfect. This will be the one I made from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chrism"
},
"reviewBody": "I too wish I had read the reviews before making it. It seemed so simple, so I figured what could go wrong? As others said, it was very runny and way too sweet. I would try it again because it is so easy, but with way less sugar and more thickener of some type."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Hyde Hennessy"
},
"reviewBody": "I've never baked a strawberry pie, but had 4 quarts of strawberries given to me. I read all of the reviews and took some advice. I halved my strawberries and used maybe 6 cups measured after halved. I used 3/4 cup of white sugar and 1/4 cup of brown sugar. I added 3 TBSP cornstarch. I had a prepackaged crust on hand from Trader Joe's that I rolled out. It is an adequate pie crust but not very big. I did take the advice to bake at 425 for 25 minutes and then switched to 350 degrees. I swear it took at least 1 solid hour AFTER i turned it down to 350! But I cooled the pie outside at night for an hour and then switched it to the fridge for 1 1/2 hours. I couldn't believe my eyes when it came out in a solid piece and did not run! My husband raved about it being one of the best fruit pies he'd ever had. It was just the right amount of sugar, too. I think next time, since after 25 minutes at 425 the crust was barely beginning to color, I'd wait for more color before turning the oven temp down. I was wondering if it was too dry. Either too much corn starch or too long in the oven. But either way, I was very pleased with the results! Will keep it and make it again! And use more strawberries next time! I used the amount to be level with my pie pan. It sunk down a little as it cooled. Next time I will heap them up in the center."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Belt"
},
"reviewBody": "so I made this, and It was amazing. forewarning, the filling runs a little thin, but a bit extra corn starch or flour will fix that right up. It's still a five, though, because that was on me. I, not being a fan of strawberries but needing to use a bad of them, was very impressed. in fact, I also used a home made pie crust and used the extra to make a little strawberry on top for decoration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara R."
},
"reviewBody": "Delicious! But, I used 4 cups of sliced strawberries and the sauce bubbled up and dripped all over the bottom of my oven. I guess I should have used whole strawberries? I wish the recipe had been more clear; this was my first strawberry pie and I needed a little more clarification. It's delicious though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Weir"
},
"reviewBody": "No changes....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Malta"
},
"reviewBody": "Right now as I`m writing I`m eating a piece of this heavenly pie.....I saw some negative comments, so I`ll tell you what I did. I doubled The Ingredients... BUT.... Sugar I only Used1 and a half cups, because when mixed with fresh and washed strawberries it melts and as for the flour instead of using one third cup flour x 2... I used a cup of flour, so that way the texture is not soggy in the least, and while going to all this relaxing trouble :D.... I have 2 pies in the process"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bruk"
},
"reviewBody": "Really really good! I added 1/2 a cup of flour only because my berries were super dense and I sliced the strawberries in half which made it perfect in texture and set up just perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TanyaRenee"
},
"reviewBody": "I used turbinado sugar instead of white and only 2 cups. It came out juicier than expected but was still delicious with some homemade whipped cream. Will experiment with thickeners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci BB"
},
"reviewBody": "We loved this pie. I followed the directions except for the cinnamon. I didn't use it because I didn't think it would suit my family's tastes. Overall it was a great tasting pie. I will definitely make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Coffey"
},
"reviewBody": "Really great pie. A little too sweet, but think I'll reduce the sugar to 3/4 cup next time. Got rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae M"
},
"reviewBody": "I loved this pie! I used fresh, sweet strawberries, so I took the sugar down to 3/4 cup. I adjusted a few others things too- 5 tbsp of cornstarch instead of 1/3 cup flour, reduced cinnamon to 1/4 tsp, and added 1 tbsp lemon juice. I also did a lattice top rather than a full crust. I baked it for 80 minutes at 375F. The pie was delicious and not runny at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ramegrl"
},
"reviewBody": "I made this as the recipe listed here. I made two of these and took to work and got rave reviews! I did add milk and sugar to my crust (as I always do), and this added just a hint more sweetness to my tart strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "It turned out perfect and I did it by the recipe! Made no changes. It did not last long at my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsea Broskin"
},
"reviewBody": "EXCLUDE THE BUTTER! This pie is absolutely delicious if you exclude the butter, brush some egg on the top crust, and wrap the edges in foil while baking to prevent them from browning too much. This is my go to pie for holidays! I love it! And this is coming from a person who doesn't really like pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "October Lady"
},
"reviewBody": "Fabulous pie. Absolutely delicious. Just like my mother used to make. She never wrote anything down, so I searched for years trying to duplicate her delicious results. This hit the spot. Won the gold medal! My family and I all enjoyed it, with each saying \"it's just like mother's\".\n\nDo cover the edge of the pie 1/2 way through baking, to prevent overbrowning.\n\nToo, watch the pie, when the juices begin to bubble through the vents slashed in the top and the crust is golden brown, it's done. It you cook it too long, you will lose a lot of the delicious juice from the pie. It will be on in your oven, I know! \n\nYou may want to adjust to flour, increasing if you like a thicker juice in the pie. I made the pie exactly as the recipe stated and found the juice to be just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "Good, but very wet and a little runny, so kind of mushy texture when eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "daniel"
},
"reviewBody": "I followed recipe exactly but it was way too runny, tasted pretty good but wouldn't serve to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary B"
},
"reviewBody": "My family loved this pie! I cut the sugar down to 1/2 cup. I also used 5 cups of berries. I also used the suggestion of half and half on top of the crust sprinkled with sugar. Created a pie with a nice golden brown appearance. I also covered the edges of the pie with aluminum foil for -5 minutes of the baking time so my edges didn't get too dark.\nAm making this pie again per my family's request!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12468/old-fashioned-strawberry-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12954/desserts/pies/fruit-pies/strawberry-pie/",
"name": "Strawberry Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12468/old-fashioned-strawberry-pie/",
"name": "Old-Fashioned Strawberry Pie"
}
}
]
}
}
, "about": [
]
}
]