				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Old Fashioned Strawberry Shortcake"
,"datePublished": "2020-06-18T23:50:46.000-04:00"
,"dateModified": "2022-10-15T00:25:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MALIA2"
,"url": "https://www.allrecipes.com/cook/1312638"
}
]
,"description": "Sweet strawberries are sandwiched between layers of homemade shortcake in this favorite dessert. Use less sugar if you have sweet, ripe strawberries."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/qHVh0eINyl2PnR6ESFTBABq0yrY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4509389-old-fashioned-strawberry-shortcake-Dixie-4x3-1-280dfc76becb4279bfb46729cb01c0d9.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Old Fashioned Strawberry Shortcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "82"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "391 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "17 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "524 mg"
,"sugarContent": "35 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 quart strawberries, sliced",
"1 cup white sugar",
"2 cups all-purpose flour",
"2 tablespoons white sugar",
"1 tablespoon baking powder",
"1 teaspoon salt",
"0.33333334326744 cup vegetable shortening",
"1.5 cups milk",
"2 tablespoons butter, softened",
"1 cup whipped cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix strawberries and 1 cup sugar in a bowl and allow to stand while you complete remaining steps. Stir occasionally to help juice form."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch round baking pan."
} ,{
"@type": "HowToStep"
,"text": "Combine flour, 2 tablespoons sugar, baking powder, and salt in a bowl; cut in shortening with a knife or pastry blender until the mixture resembles coarse crumbs. Stir milk into crumb mixture until just blended; pour into prepared baking pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes; cool in the pans for 10 minutes before removing shortcake."
} ,{
"@type": "HowToStep"
,"text": "Split shortcake into two layers; spread bottom layer with 2 tablespoons softened butter and top with strawberries and juice. Place top layer over strawberries. Serve with whipped cream."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NonnaNan"
},
"reviewBody": "Since I've prepared this several times, I knew it would be the perfect dessert for our dinner party last evening. Luckily I doubled it bc everyone loved it! It's not a heavy dessert but I do use Splenda in the strawberry sauce and just a little vanilla in the whipped cream. For July 4th dessert, I'll add fresh blueberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Grauerholz"
},
"reviewBody": "Excellent shortcake! Great texture, a little more 'cakey' than the 'biscuty' which we really enjoyed. It soaked up all the yummy strawberry juice perfectly. I added an extra T of sugar just cause we like shortcake a bit sweeter. As other reviewers have said it does take about 10 more minutes to be done. I used my food processor to cut the butter into the flour mixture which made a very simple recipe even simpler. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Perfect! The shortcake was a nice fluffy biscuit with a tender crumb that perfectly soaked up the juice from the strawberries. The only thing I did differently was to use butter instead of shortening because that’s all I had. And I found it took more like about 35-40 minutes to bake. Otherwise it was super easy and quick and I will definitely keep making this one whenever strawberries are in season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Kirkland"
},
"reviewBody": "I followed the recipe to a T. It was not bad, but the only thing I would change is the amount of sugar added to the strawberries, way TOO sweet, next time I will start with 1/4 cup of sugar . But overall pretty good. I covered the leftover cake with foil and it was still moist the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David Fisher"
},
"reviewBody": "Horrible. Notice only 2tb sugar to 2 cups flour. Bland. No vanilla in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Jo"
},
"reviewBody": "This was awesome I added vanilla ice cream &amp; whip cream then added the strawberry sauce. it was a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "OhioKEE"
},
"reviewBody": "I agree with the others who said it took MUCH longer to bake. For me it was 30 minutes at 350 degrees. That being said, the taste was FANTASTIC. It is a blend of the cake/biscuit types of shortcake and VERY GOOD. I will make it again, noting carefully the extra baking time needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Riley Barnes"
},
"reviewBody": "The only thing I did differently was split into two pans and next time I’m going to add some sweetened condensed milk to the layers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lu Ann Brown"
},
"reviewBody": "I had not baked in YEARS. Made recipe as written and it was perfect. Loved that it's not too sweet and it has the perfect consistency to hold the juice. This is definitely a keeper. As others have said, it did take longer to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurapatOsterwald Smith"
},
"reviewBody": "making it again, soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia "
},
"reviewBody": "Delicious, I followed the advice of other and used butter instead of shortening and used fresh made whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shareen"
},
"reviewBody": "Simple and easy to make. \nAt 6300 ft above sea level, I had to bake it between 10-15 minutes longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy M"
},
"reviewBody": "This was the first time I ever made strawberry shortcake and I found it came out wonderfully! As many others have said the baking time was about 10 mins longer than indicated. I used Cool Whip instead of whipped cream but otherwise followed the recipe exactly and will make it again. The texture is perfect and even my husband who isn't big on sweets found it to be very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Preshie from CA"
},
"reviewBody": "I was looking for a recipe with no eggs since I was all out. I used almond milk instead of dairy and did let it bake at least 15 minutes longer to get some color. The cake had very little sugar and was the perfect texture for soaking up all the sweet juices from the berries. It was lovely! I will definitely use this as a great base recipe for my shortcake in the future. Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Valleychick1970"
},
"reviewBody": "Consistency was good. I thought it was too salty. I will make again but omit the salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KungFuJimmyChoo"
},
"reviewBody": "I made this for my house following the recipe because, you know, sugar and carbs, YUM! I also made this for my parents house but used a low carb baking mix and Splenda for the cake and tossed the strawberries with a sugar free vanilla syrup (like you use for coffee) because, you know, carbs and sugar, booooo! I did enjoy some at both houses and didn't really feel that guilty about it. Both were equally as delicious and I couldn't really tell the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fricia"
},
"reviewBody": "I'm 71 and this is just like my mom and dad made. So easy to make. It does take a few minutes longer to bake, but sure not complaining. Made it twice in two nights. Going to show my young granddaughter, who loves to bake, how to make it. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacqualin"
},
"reviewBody": "I liked it. I was looking for a recipe for peach shortcake. With a few modifications this hit the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "hike4diamonds"
},
"reviewBody": "This took 22 minutes to cook in an 8 inch pan as directed. It was moist and a good texture. I liked that the recipe was simpler than some (ex use of milk instead of cream). However, it desperately needed more sugar (and I do not have a sweet tooth). If I make it again, I will triple the sugar. As is, it is more like bread than cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "handymam318"
},
"reviewBody": "I really liked the recipe. I did make changes to it. I used butter instead of shortening; used half the amount of sugar on the strawberries and next time will use even less. I baked it in an 8\" square pan and finally, I didn't use butter after baking. It didn't need it. I like the consistency of the shortcake and had a really good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Auntie RaeRae"
},
"reviewBody": "Followed recipe, not the flaky kind of shortcakes I prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janelle"
},
"reviewBody": "I subbed butter for the shortening. It came out perfect, not too spongy and not too hard. I used round cake pans and doubled it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Reese"
},
"reviewBody": "I followed the directions exactly as written. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "giulietta"
},
"reviewBody": "I couldn't decide if I liked it or not. I read many of the reviews before making it. I decided to use butter vs shortening because many reviewers who made it with shortening seemed to say it was tasteless due to the lack of butter. I used unsalted butter and half of the amount of salt (per other reviewers who said it tasted off, perhaps due to the amount of salt and the amount of backing powder). I added two tsp of vanilla. I liked that it wasn't very sweet. I liked that it tasted like a big, huge Bisquick pancake. Something nostalgic like that. But there was still something missing. Also, cook this until it looks almost golden brown. I let it cook for 10 more minutes than recipe stated, toothpick test came out good, pulled it out and literally gooey in the center, 3 inches! ugh. So we ate the outer edges. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail Lowry-Standley"
},
"reviewBody": "I followed the recipe but I had to add an additional 10 minutes cooking time. I also would eliminate adding the \"butter\"as directed just before serving the dessert. The butter is overkill and not needed. Overall, we really like the shortcake (not too sweet)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nonalegrande"
},
"reviewBody": "Finally an old-fashioned recipe like my husband and I enjoyed in our youth (long ago). It's also pretty quick and easy--a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lavender1"
},
"reviewBody": "I made this and served it with strawberries and blueberries together. It made for a very pretty desert . I recommend that you follow directions and split it, toast it and spread it with butter. Toasting it gives it a much more intersecting texture and with butter lightly spread on it before adding the fruit, it is so much better than just serving it as is. I cut outs in wedges, split and toasted instead of the whole cake because it was only three of us and the whole thing would have been too much. This is a great recipe, easy, and I will definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Davis"
},
"reviewBody": "This tastes just like my grandmother's shortcake! Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SugarBritches"
},
"reviewBody": "I should have read reviews. Agggghhh it was dry and tasted of baking powder. I will try it again and make the changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James O'Hearn"
},
"reviewBody": "best strawberry short cake ever. added vanilla pudding in between layers, so easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel"
},
"reviewBody": "I had a request from my daughter-in-law for strawberry shortcake for her birthday celebration. This was very easy to make and delicious, exactly as the recipe stated. I baked my shortcake for 20 minutes and had a beautiful, moist biscuit to serve. Everyone commented on the delectable dessert. Thank you for sharing this delight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meso Bassam Samman"
},
"reviewBody": "this is the first time i try this at home\nand its pretty good actually\ni added 1 egg to the recipe, 1 tsp vanilla extract, instead of all white sugar i mixed white and brwn and used olive cookin oil instead of the veg. shortening \ni didnt ise butter between the layers\n\nthe cake it self with out the strawberry is not sweet \nbut when u add the strawbery for me thats the perfect sweetness level \" not to sweet but sweet enough\"\n\nprobably next time ill do some modifications in the cake it self\n\nbut it worth the try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Wollens"
},
"reviewBody": "I just love a biscuity, not too sweet shortcake. None of that sponge cake for me! This fit the bill. Soaks up the berry juice nicely. I had to make some modifications for dietary restrictions and ingredient availability. I used almond milk and instead of shortening I used coconut oil. I added a splash of vanilla, per another suggestion and doubled the recipe, so I had to bake almost twice as long as recommended. The double batch was necessary because in addition to strawberries, I had a flat of raspberries to use up. Raspberry shortcake is delicious, too, it turns out and, really, why should strawberries get all the glory?! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darren Gordon"
},
"reviewBody": "Loved it! I used butter instead of shortening and organic soy milk, thought it turned out great. No extra butter or sugar on the finished dessert, just loads of awesome fresh picked homegrown berries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Landers"
},
"reviewBody": "I'd have taken a picture, but the family devoured this! I used 1/2 butter and 1/2 shortening and skipped the extra butter layer because I didn't want the butter to be overpowering. I cut the cake in half and put the strawberries between the two layers and topped with homemade vanilla whipped cream; not really a modification just a matter of visual preference. The texture was great and the taste was wonderful. I did have to bake longer than the recipe, so make sure and test for doneness before setting to cool! Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rina"
},
"reviewBody": "Too much sugar for the strawberries, but the shortcake itself was quite nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marjorie"
},
"reviewBody": "My husband loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynthia LaFourcade"
},
"reviewBody": "Texturally, this is exactly what I want in a shortcake. A little coarse to soak in fruit juices, and a nice rise in the pan with a golden top. For me and hubs, it lacked in the flavor department even after the fact I added a teaspoon of vanilla extract. It just wasn't sweet enough. With that said, this recipe is as close as I have found to being a good shortcake base. It definitely beats the store bought spongy cakes. I'll try it with butter next time and see if that makes a difference. As for the bake time, it was definitely understated in the recipe as others have noted. It required an additional 15 minutes to yield a beautiful cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdm1025"
},
"reviewBody": "Great shortcake/shortbread nothing too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommaBeth"
},
"reviewBody": "I have used this recipe twice now. The second time I used good old fashioned lard that I get from my butcher. I use it for my pie crusts as well. The family really liked it better with the lard. A great simple recipe to do with the grandchildren! So easy that the 3 year old can even do it! Thanks for the delicious food and love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynnaford Lynn"
},
"reviewBody": "This is exactly what I was hoping for in a strawberry shortcake! It has that old-fashioned, not sweet, baking powder flavor, taste that you expect. I followed the recipe exactly, didnt need to change a thing for the cake, however for the strawberries, I used less sugar. The baking time was perfect as well. My family loved it and I know that I will turn to this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela Bruno"
},
"reviewBody": "I liked the consistency of the cake but it had too much baking powder. Also I would use butter instead of vegetable shortening. It has potential."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tina Marie Moore"
},
"reviewBody": "The shortcake turned out to be very doughy and dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather P"
},
"reviewBody": "This was my first try at home made strawberry shortcake and it turned our fabulous! My mom said it was the best shortcake she's ever had! We didn't have vegetable shortening so I used about 6 tbsp of cold unsalted butter instead. I topped it with fresh, lightly strawberries and the Easy Whipped Cream recipe from this site. I'll never buy those spongecakes again! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ZypherJen"
},
"reviewBody": "Something is missing from this. Other than a soft, dense texture (which I thought was good), it's really lacking in flavor--I even added vanilla to the batter. I used salted butter which is probably why I found this to be too salty. I plan on keeping this in my recipe box, but will try to tweak it so it's more flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bcjohockey"
},
"reviewBody": "Taste was good but cooking time was way too short! First one was baked 5 min longer than recipe stated and was raw in the middle. Second attempt I used a 9\" pan and baked it for more than double the time...basically until the edges just started to colour. Family loved the finished product (using the second made cake). I would make again but be certain to cook it longer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Ruskiewicz"
},
"reviewBody": "Made this last night for friends and they loved it too. I'm not much of a cook so this was easy and I already had most of the ingredients. I live in Colorado and I had to bake it an extra 10 minutes. For the strawberries I used about half a cup of sugar for 2 pounds. It tasted great without being too sugary. I paired this with the allrecipes whipped cream that uses sour cream. Very yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sawyern"
},
"reviewBody": "Made recipe as is and loved it! Perfect go-to but I feel you can easily alter it to your needs! Well done"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Cruz"
},
"reviewBody": "It was so delicious. I did run into trouble with the sauce. I cut up the strawberries and tossed it with sugar but the sugar didn't desolve properly and didn't liquify. It was just a clump of sugar and strawberries. I would recommend using less sugar, about half since I ended up scooping that clump of sugar out and throwing it away. I loved the shortcake. It was delicious and soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megan partida"
},
"reviewBody": "I love this shortcake recipe. ! My boyfriend is not a dessert person, but he was very impressed by this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Musiclover507"
},
"reviewBody": "This was super easy to make and delicious ! The cake had a good texture, not too dense. The shortcake was a little plain so next time I am going to add a little vanilla extract in it. I cooked the cake for a little longer than suggested and turned out just right. I made this cake for my boyfriend and we both went back for more! It was definitely a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "I too substituted butter for shortening and it was delicious. I cut the sugar for the berries in half. I served this with homemade whipped cream. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BakerBee"
},
"reviewBody": "Do not recommend this one, sorry. If you make it, I would recommend butter only - I used 1/2 butter 1/2 shortening but it was still no good. It does need to bake longer than the recipe calls for as well. The texture was pretty good though. Flavor with the berries &amp; whip: eh - bleh to me...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Davis"
},
"reviewBody": "Dense, weighty, spongy...delicious. I will return to this recipe.\r\nI added sicilia di fiore orange oil to the batch too...yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "armbrust806"
},
"reviewBody": "great recipe, nice old school shortcake. tasted awesome!!!! i'm not that much of a baker but this was easy and really good. i like to smash the strawberries to get lots of juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladder50"
},
"reviewBody": "This was amazing !!! Everyone loved it. So easy to make and soooo very moist. I also baked it a few minutes longer -- maybe 24-25 minutes in all but I have a small oven and made 2 cakes so I don't know if that mattered. I used much less sugar in the strawberries just because I like it that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocoholic"
},
"reviewBody": "Oh my goodness!! My husband raved and raved about this one. I only used 1/2 cup of sugar with the strawberries. I sliced berries, and added sugar then refrigerated while I made dinner and it turned out plenty sweet enough for us. This is what we call at my house, a \"do over\"! Never buying spongey cake ever again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewCakeBaker"
},
"reviewBody": "I made this for my stepmother's birthday dinner and everyone loved it! I made a couple of changes to make it a touch healthier and even more flavorful! I used half white flour and half whole spelt flour, which is highly nutritious and has a mild, sweet flavor that is closer to white flour than whole wheat. I used 1/4 cup sugar in the strawberries, which worked out great, and I used half the salt it called for. I added a beaten egg and lessened the amount of milk, so it would hold together better. I also did not put butter on the layers- I felt that butter and whipped cream were overkill in the heavy dairy department. Also, I found that the cake was thick and sturdy enough that I was able to cut it into three layers instead of just two. I put strawberries, whipped cream and banana slices in between each layer and on top. The bananas added a yummy, sweet touch. I can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "This cake is more moist than any that I've made before. It is delicious and was a hit with my Dad. He said it was the best he had ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RandyKiehle"
},
"reviewBody": "This was yummy. My husband kept saying how good it was. I had to bake it an extra 10 minutes though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beachbums"
},
"reviewBody": "Delicious!!! and super easy too!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Margie"
},
"reviewBody": "Sorry, I will never make this again. I think butter would have been better. The cake was so \"white\". Will go back to my Better Homes &amp; Gardens old cookbook for the one I used to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spikelucy"
},
"reviewBody": "Made recipe exactly as stated. Baked for 22 minutes. Perfect shortcake-dense, not overly dry. Great summer dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Followed the recipe exactly and absolutely loved it! Perfect sweetness for shortcake. Much better texture than strawberry shortbread. It soaks up more strawberry juice because of this too. I cooked mine 20 minutes and it probably could have used a little longer but I prefer it a little more on the spongy side. Definitely will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodcrazee"
},
"reviewBody": "Perfect shortcake base. I used butter in place of shortening and did not use the melted butter. It was a great compromise between the two standard types - biscuit vs. spongecake. This was great. Quick, easy, good texture and not too sweet. I served it with fresh berries and homemade sweetened whipped cream. Kids and adults loved it. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aliseb"
},
"reviewBody": "I thought it was very heavy and chewy. Generally OK flavor, but not very sweet. Won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mindymomof3"
},
"reviewBody": "EXCELLENT!! I needed to make this dairy free, so I used almond milk instead, and I prefer palm oil shortening instead of veg. shortening. I also wanted to serve this as a trifle, so I baked it in a 9x13 pan, cut cake into cubes and layered in the trifle dish with strawberries. I served the whipped cream on the side. I also really liked it topped with sour cream mixed with maple syrup, instead of whipped cream. Mmmmm. I just printed and added this to \"my family's favorite recipe binder.\" Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgilbo"
},
"reviewBody": "Great recipe, very good and even better because it's so easy. We had very sweet strawberries that were locally grown so I skipped the sugar in them and it was still great. Did I mention how quick and easy this is to make? Love that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Ludlow Franklin"
},
"reviewBody": "Perfect texture! Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lrickey"
},
"reviewBody": "This shortcake was fabulous - like a slightly moist/spongy biscuit - just perfect. Was hesitant to try it because it seemed way too simple, but I will probably never use another recipe for shortcake. Made it exatly as written, as other reviewers mentioned did have to bake about 10 minutes longer. I cut the cake into 8 pie shaped wedges which I cut in half horizontally. Mashed some berries with a little truvia to make a \"sauce\" and then sliced the remaining berries with no sugar. I didn't use whipped cream and instead put a small dollop of plain greek yogurt on the top. Divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Rose Hills"
},
"reviewBody": "I followed the recipe exactly as written (though I did have to bake an extra 10-15 minutes as well before it was set in the middle) and this was a FANTASTIC shortcake recipe! We had guests over, and all 5 of us LOVED this recipe. Delicious (especially with some fresh made whipped cream - YUMM!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "godssoulsinger"
},
"reviewBody": "Loved this! The shortcake was tender and soft and a little spongy, just right! Not very sweet on its own, which was good since the strawberries were sweet. :) Quick, easy, and will save you a trip to the grocery store next time you want a strawberry and shortcake, will never buy the store made shortcakes again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Cantos"
},
"reviewBody": "I made this recipe exactly as written, however I had to bake this about 10 or 15 minutes longer than stated for the toothpick to come out clean. Oven temps. vary though so that was not a big deal. This recipe was very good. I chose this recipe because it has less sugar in the cake batter than others like it making it a little less sweet than most short cakes. However this was very good for my diabetic husband, as for me, I just poured more sugar on my strawberries. With the strawberries and whipped cream tastes sweet and has an old fashioned feel about it. Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pelicangal"
},
"reviewBody": "This was delicious and very easy to make. People were licking their plates. Thanks for posting this recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228308/old-fashioned-strawberry-shortcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228308/old-fashioned-strawberry-shortcake/",
"name": "Old Fashioned Strawberry Shortcake"
}
}
]
}
}
, "about": [
]
}
]