				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Old-Fashioned Chocolate Fudge"
,"datePublished": "1999-04-11T23:24:45.000-04:00"
,"dateModified": "2023-02-21T18:23:30.667-05:00"
,"author": [
{"@type": "Person"
,"name": "BOOK_WORM"
,"url": "https://www.allrecipes.com/cook/61277"
}
]
,"description": "This 5-ingredient chocolate fudge recipe makes over 60 mini fudge squares! These rich, creamy, and delicious fudge treats are perfect for any special occasion or holiday."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/h5tio-yZ1L-BgfRB5o_23CUOItQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-5-6b18889bfd5840bab4661b13cecc0d0f.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6317359829112",
"description": "",
"duration": "PT1M10S",
"name": "How To Make Old-Fashioned Chocolate Fudge",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/99764d2a-e6be-4bbb-b044-a845961f00b8/8618ffb9-90fc-4c3e-bb61-cf0f25d9fa55/1280x720/match/image.jpg",
"uploadDate": "2023-01-13T15:37:39.716-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Old-Fashioned Chocolate Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "711"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "35 kcal"
,"carbohydrateContent": "7 g"
,"cholesterolContent": "2 mg"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "2 mg"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dessert"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"2 cups white sugar",
"0.5 cup unsweetened cocoa powder",
"1 cup whole milk",
"4 tablespoons unsalted butter, sliced and softened",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/66RysTj4qn1EhzeMU9UhPgL27KI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-1-e946b4c7455648e4ad6d0fe0cf5ed154.jpg"
}
]
,"text": "Gather ingredients."
} ,{
"@type": "HowToStep"
,"text": "Grease an 8-inch square baking pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gGkvQkofunP9AuVnJXKIs7oebio=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-2-a08dc10fff084425aaf1d4ca07b3fafb.jpg"
}
]
,"text": "Place sugar and cocoa powder in a medium saucepan; pour in milk and stir until blended. Set heat to medium-high and stir constantly until mixture comes to a boil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Cqll3OcrJOA4CgG6i6RNzdhz1UI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-3-dd0cb83b682c410d805e6ed8d46a48eb.jpg"
}
]
,"text": "Reduce heat to low and place a candy thermometer in the pan. Let the mixture simmer without stirring until the temperature reaches 238 degrees F (114 degrees C) when measured with a candy thermometer, about 10 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/14ceI8AGiYgO3Rsigpz0ng-aEBw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-4-ee719df49fb34ccda79f5bd42344bcb5.jpg"
}
]
,"text": "If you don&#39;t have a candy thermometer, drop a small amount of the mixture into cold water; if it forms a soft ball that flattens when removed from the water and placed on a flat surface, it&#39;s ready."
} ,{
"@type": "HowToStep"
,"text": "Remove from the heat. Allow to cool to 110 degrees F (43 degrees C), 50 to 70 minutes. Do not disturb fudge as it&#39;s cooling."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/h5tio-yZ1L-BgfRB5o_23CUOItQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9420-OldfashionChocolateFudge-mfs-Step-5-6b18889bfd5840bab4661b13cecc0d0f.jpg"
}
]
,"text": "Add butter and vanilla to the fudge. Beat with a wooden spoon until well incorporated and fudge loses its sheen; do not under beat."
} ,{
"@type": "HowToStep"
,"text": "Pour fudge into prepared pan and press to flatten. Let cool at room temperature or in the refrigerator before cutting into 1-inch squares."
} ]
,"recipeYield": ["64"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made this. You just have to go a little bit beyond 238. I went up to 244. I added raisins and pecans. Everyone loved it. If you follow the rules like not touching it until it reach the desired temp, your fudge will be great. Having a candy thermometer sure does help a lot. The only downside is that when you wait for it to cool yo about 140, there will be so much wastage because it hardens real quick. I think once you’re in 180-170 you can add room temp butter and vanilla. And mix nail the mixture looses its shine. With 140, too much left over on the wall of the pan. When you scrape it, it kinda becomes chalky. But the rest are truly creamy. We didn’t even have anything left to take pictures."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe^^ don't underestimate the beating at the end until it looses its sheen, it takes time^^ Just as a tipp: find a thermometer that is caged. So the tipp of the themometer doesnt touch the base of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe, though it definitively takes more than 10 minutes to hit the soft ball stage. I did add 1/4t salt to it. Key things to consider when making candy: your altitude, how fast you’re cooking it, and what the humidity is. If it’s humid, it’ll never set up, because what you’re trying to do is cook the moisture out of the candy. Cook too fast, it could boil over and you might accidentally cook it too hot. Cook too slow, you could end up with dry, crumbly fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grgrssll"
},
"reviewBody": "I screwed up and put the butter in in the beginning before cooking the mixture but it still came out good. It's really hard to stir after it cools"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It tasted delcious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made fudge for 30 years and never once gotten the consistency I wanted. Always hard and gooey. So I was skeptical of the texture. i simmered it for 20 minutes at low then gradually raised temp. After cooling, I added butter and vanilla at 120° and thought it would have been gooey like all the other times. It was perfect texture. I will only be using this recipe from now on. Thank you for being so precise and helping me finally get the consistency I wanted. It's been 30 years of fudge failure🤣"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Daniele"
},
"reviewBody": "I agree with one of the other comments that this recipe needs a review. The mixture needs almost an hour to come to temperature (not 10 minutes) and no amount of stirring will make this fudge thicken let alone harden! After a half hour of beating I gave up an used my electric mixer for another half hour and still it’s very liquid. It’s now sitting in the fridge until I come up with a use for it…spoon it into milk? Use it with powdered sugar to make a frosting? But, fudge it is NOT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "joanne D"
},
"reviewBody": "Do not make this recipe. I spent money(a candy thermometer) and a lot of time and it's basically thick chocolate milk. I get fooled by the write-ups and videos all of the time. So very disappointed. My son asked me to make fudge and I followed the directions exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "milabulic"
},
"reviewBody": "The directions were easy to follow and even though I had to stir after the boiling started (pot was a little too small), the finished product was silky smooth and delicious. I made this last year and it came out dry and crumbly. The fault was mine because I didn't take my altitude into consideration. My recommendation for those who do not live at sea level is to first boil some water, take the temp and for every degree registered below 212F deduct that amount from the 238F temp in the recipe. That will be your target temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this recipe but it still hasn't set for me to cut it, I made it yesterday so 16 hours ago I followed the recipe but it did not set so not happy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLHilton"
},
"reviewBody": "My grandmother and father have been using a variation of this recipe for years. But with 3/4C milk, 2C sugar, 1/2C cocoa powder, pinch of salt; and 1tsp vanilla and 2 heaping tablespoons of crunchy peanut butter at the end when it’s setting up. Both have now passed; my father a year ago unexpectedly. He would make it every year, and family and friends always looked forward to it and expected it at Christmas time. I made it with him on many occasions to learn; but don’t recall all the details/nuances and don’t have the talent of doing the softball method. So I found this recipe to fill in the gaps of my memory to avoid sugar crystallization. Came out wonderful last year. BUT This is the key when using a candy thermometer!!!!!! = you need to calibrate your thermometer to boiling for your specific environment! (Elevation, humidity, stove, and equipment). To do this….. put your thermometer in a pot of water on your stove and bring to a boil. Water boils at 212°F. Whatever temp yours boils at you need to +/- to your recipe temps. For example, mine boils at 220°. So I add +8° to my temps, simmering the fudge to 244-246° instead of 236-238°. If you don’t do this, you can follow this recipe to a T, and it can come out too soft or like rock candy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Hernandez"
},
"reviewBody": "I was so excited to find this recipe. This is the only way we ever used to make fudge growing up 50 years ago. Although it is missing one ingredient, a little salt. It makes a difference! I think most of the people who gave bad reviews did not follow the instructions. This fudge takes patience and most people today are used to instant gratification and tend to rush things. We never had a candy thermometer growing up so I always used the cold water to find the soft ball stage. This is the best tasting and most authentic tasting fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AKTaylor"
},
"reviewBody": "First time making fudge, followed the recipe exactly and it came out perfect! Sprinkled some crushed candy cane on top. When I was stirring it before pouring into my glass dish, it still seemed pretty shiny. I stirrer probably 5 minutes and just went ahead and poured into the dish and it almost immediately got less shiny and set up. Like others, I found it took longer than 10 min to get to 235 degrees. I had my induction burner set to a 3 out of 9. Stirring in the butter at 110 degrees was easy, butter was very soft from sitting out during the rest of the process"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the worst recipe that I have ever used. I followed instructions right to the tee. It was a total flop. I will stick with my marshmallow fluff in the jar. I've never had a problem with it. This recipe needs to be removed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the recipe my Mom always used. Taste is the best. I have tried many times to make this and never succeeded. I can not eat any other fudge, so I will keep trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Once it got to 110°, you couldn’t even stir it. The texture came out like a soft tootsie roll. Did not look or taste anything like fudge, and I followed the directions very carefully and used a candy thermometer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time at making fudge. I didn't have a candy thermometer so I used the drop method. Because it was a high humidity day it took more like 25-30 min to reach the soft ball stage. My first batch I let get to cool before adding the butter and vanilla. This made stirring it more difficult, but was accomplished. My second batch I was able to stir in the butter and vanilla at the correct temperature, not having a candy thermometer I judged the temperature by touch. Then added the butter, vanilla and some macadamia nuts. Overall my final product was a great success. Both batches was smooth to the tongue and melted in my mouth. Thank you for this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It took longer than recipe says, unless stove temps are different on low , i had to turn mine up to simmer. very good fudge, wondering about using evaporated milk nxt time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Kennedy"
},
"reviewBody": "This was my first time making old-fashioned fudge. I didn't have much confidence going in because I'm not great at candy-making. It took a long time to get to 238 degrees, which had me nervous. Then, when it had cooled to 110, and I started stirring, it looks like hot fudge sauce. I stirred for 5 minutes, seeing no sign of the mixture coming together as fudge. I sighed and abandoned the pot on the counter and went to mope. I came back about 10 minutes later and it was fudge! I scraped it out of the pot and it's delicious. Like a magical science project, it turned from goo to fudge. Oh and I used vegan milk (Next Milk) and vegan butter (Violife). Fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phylliso59"
},
"reviewBody": "Loved it, good taste simple ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this using a meat thermometer so I had to guess when it was hot enough after it maxxed out the meter; the drop in the water trick didn't ball up like suggested, but it did have the right texture when I squished it between my finger, and that's how I knew it was ready fir the next step. Overall it was fun to make and it tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Steen"
},
"reviewBody": "I've made it a few times. First time was perfect and the next couple times it didn't set up properly... Fudge is tricky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candyconnection22"
},
"reviewBody": "It looked at me..I looked at it .. It knew it was perfect and was waiting for me to understand this. 50 times I have made this recipe and 50 times I have messed it up in some way.. Today was different. Not a sugar crystal in sight. Chocolate silk.. I don't know what came over me, but I started to run, making sure I was not being followed. I ran to the farthest closet and locked myself in with my perfect fudge. I heard cats looking for me, I heard humans looking for me. I knew it was totally selfish of me but I was in nirvana, heaven, chocolate joy.. I emerged from the closet hours later smelling like Willy Wonka. I knew it would be another 50 times before I got it right again and the next time, I would share, unselfishly, but this time, was our time, me and my perfect fudge... The only tip I can give is to watch time, watch fudge, keep heat at slightly lower than medium and get that soft ball stage on the money..It is so worth it~"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew AndHeather Ahr"
},
"reviewBody": "Easy and delicious no candy thermometer either. The water trick works"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Simpson"
},
"reviewBody": "I just made this fudge tonight and it's awesome.Went right by recipe and was very happy with the texture as it's satin smooth.It takes awhile to come up to temp but it's worth the wait,just make it.It's the fudge I remember as a child,big difference than the marshmallow kind.Loved it.It's a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Adam Ray Elmadany"
},
"reviewBody": "Really need to add to the written instructions that it needs to cool before adding the butter. I ruined my batch adding the butter and vanilla straight after taking it off heat. Not the best written instruction"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkfdf5"
},
"reviewBody": "I made this on my stove and it came out perfect. I followed the directions but didn't have a thermometer. We all loved it and everyone wants more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anne O"
},
"reviewBody": "How long do you cook it? Even using a thermometer, If you cook too fast it sticks to bottom and turns out like taffy. Some reviews say to add butter and vanilla just before you beat it, just before putting in serving dish. I've tried making this many times and it usually doesn't get hard, but I end up with delicious hot fudge sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Moore Cavanaugh"
},
"reviewBody": "Came out awesome!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigredjoann"
},
"reviewBody": "I didn't let it cool first, so it took me forever to get it done. Next time I make it, I will let cool and then put the butter and vanilla in and it should go much better. It did taste great. I'm still waiting for it to setup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pduff"
},
"reviewBody": "Not nearly as easy to make as they say My fudge did not harden Put in the freezer but didn’t help! Tastes great but I have to re-boil and see if it can be saved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingcarol"
},
"reviewBody": "This was my first time making fudge with out the marshmallow cream. It was great! Loved it - creamy, chocolaty and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Learner9"
},
"reviewBody": "It burned. Used candy thermometer- followed directions exactly. Did use electric stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "machelle105"
},
"reviewBody": "Never again will I make this recipe. It didn’t set up even though I followed the instructions exactly. I had to use the still liquid product with a white cake mix and 3 eggs and 1/4 cup coffee and made a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sellgen1111"
},
"reviewBody": "AVOID MAKING FUDGE OR DIVINITY ON A HUMID OR RAINY DAY!!! I hear my mother's voice in my mind, as she told me every year as we prepared to start the candy making.\n\nThe internet states that these candies reabsorb moisture from the air on humid days and will not be successful.\n\nMany older/wiser cooks made fudge in cooler weather, as it set up more quickly without becoming grainy from forming sugar crystals. With a/c, this would be less of a problem, now.\n\nThis does sound very close to the recipe on the back of the Hershey Chocolate tin, made plain or with chopped pecans. All the melted chocolate chip recipes are just pretend fudge! \n\nThanks Mom! She was the perfect cook/baker. I feel sorry for anyone who didn't get to grow up eating her delicious creations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chancespam04"
},
"reviewBody": "I’m what some might call an overly-experimental baker, but this recipe still worked out, so here are the tweaks I made!\n\nI only did a fourth of the recipe. This cut cooking time and beating time way down from what other people are saying, but didn’t compromise on taste. I didn’t change any of the ingredient ratios, though (but I did add a sprinkle of salt).\n\nI made sure the ingredients were WELL mixed before ever putting it on the heat. About two minutes of hard mixing with a wooden spoon. This helped the sugar dissolve faster. \n\nI let it keep boiling for a little bit rather than immediately turning the stove down to a simmer (30 or so seconds) (this is a good time to mention that I cook on a gas stove, which other reviews have insinuated is easier for candy making). I did not stir, though, or swirl the pot.\n\nI had no candy thermometer, so I used a poultry one that only went to 200° and once it was past that, further estimated the done-ness using the cold water soft ball method. And then after it seemed like it might be done but maybe not, I left it on for a minute or so more cause I wanted to be sure.\n\nI waited after taking the pot off the heat for about a minute before putting in the butter and vanilla. \n\nGetting rid of the sheen was obvious and since the amount I was making was so small, it didn’t take long to do so (less than three minutes). The fudge turned out GREAT. No crystallisation, no weird texture, perfect melt-in-your mouth fudge. I second the review that said to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamlafberry"
},
"reviewBody": "If you add a pinch of salt or 1/4 to 1/2 teaspoon makes even better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Faith Van"
},
"reviewBody": "THIS WAS AWFUL! AWFUL! I followed directions to a t ,I was so careful of temperature, I let it cool down, added butter,vanilla and some nuts and began to beat with wooden spoon. What a joke! It IMMEDIATELY began to freeze up,. it became like cement used in the Hoover Dam, I needed a jack hammer to try to loosen it from pot, I added a little water, put back on stove until it heated up, turned it into a pan and now it sits. I wasted milk, sugar ,cocoa,butter and vanilla with this infernal recipe. NEVER EVER AGAIN! Cooks beware!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Copter Doctor"
},
"reviewBody": "Man, this is the fudge Mama &amp; Grandma used to make!! Even I made this fudge as a teenager back in the sixties! I have not made fudge, or done much cooking, since those days. Well, I made up batch of this fudge two evenings ago and the memories came flooding back from the flavor, the anticipation, and even using the “soft ball” method of determining “done - turn off the heat!” Overall, this is great fudge and an excellent experience for an old man! Even my finicky wife loves it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Dann"
},
"reviewBody": "It was old fashion basic few ingredients type fudge. No marshmallow or corn syrup. How fudge is suppose to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Scott"
},
"reviewBody": "Very easy to make, had to buy a candy thermometer, worked well. Now letting it cool in the fridge. Can't wait to try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Minifairy??"
},
"reviewBody": "Great tasting and easy. As with ANY candy, temp is key. Make sure it’s exactly on. Pay attention to Fahrenheit vs Celsius on your candy thermometer. Getting rock candy means you cooked too long and taffy means too short. It will lose its gloss very obviously if temp is right, and be sure to do vanilla as directed. It matters. If you do it right, super refined and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Harry Wojahn"
},
"reviewBody": "I got this recipe to turn out the 1 time. Since then I have followed all the same steps and kept everything the same and the fudge has failed and turned to taffy 5 more times. I have wasted so many ingredients, I give up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail Swanson"
},
"reviewBody": "First time making fudge and the first dessert more involving above pre-made cake mix. \nSo my maiden attempt, objectively speaking, not bad. I read through some of the previous comments and invested in a candy thermometer. Anything I thought that would make it easier throughout the process. So keeping track of the correct temperature, not difficult. There was a lot more effort put into the stirring after the cooking. What I got out of the advice is that a sufficient amount of beating was quite important, so I pulled up a stool to kitchen counter and had at it. Even through a little laborious, it wasn’t that bad. Maybe 20 minutes I put into it. \nI gave it an hour cool down. I liked the end product. Came out a mite crumbly, but still soft and chewy inside. Which is the way I like my fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tisha Cummings"
},
"reviewBody": "You have to cook for a long time. Took me several attempts and if you aren't used to dealing with fudge I highly suggest getting a thermometer. It helps so much. I also prefer using wax paper in my pan instead of greasing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lee"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Karas"
},
"reviewBody": "easy and delish,,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Robinson"
},
"reviewBody": "On the second try, after reading all the reviews, I was able to make this successfully. On my electric stove, I brought the heat down to a simmer, but then every time the temperature stopped going up, I inched the heat up a bit, and it was around medium-high by the time the temperature got up to 238. If you left it on low, it wouldn’t ever get hot enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lynn Price"
},
"reviewBody": "I tried it twice. Both times ended up with fudge sauce. Step 4 never worked. Didn't beat long enough? Who knows? I give up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson Bevan"
},
"reviewBody": "This was absolutely delicious, however the recipes calls to beat it with a wooden spoon until it loses it’s shine. I have done this and the fudge was much to crumbly. I usually just beat it until I’m too tired to continue and it has turned out excellent. I also admire the technique of dropping the hot fudge into cool water. This has helped me with caramel sauces as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "dspeciale"
},
"reviewBody": "Not clear recipe, took too long. Find another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne"
},
"reviewBody": "My first time and it was great!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Blankenship"
},
"reviewBody": "Best fudge ever…hands down. But the second time I added 1/2 cup of peanut butter it was good but the Old-Fashioned Chocolate Fudge was better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fati"
},
"reviewBody": "Very quick and easy, will definitely do it again. I was worried that this would turn rock hard but it was amazing and fudge. My husband loved putting it into hot milk to make hot chocolate (weird). Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Catherine Jones"
},
"reviewBody": "This recipe is terrible. The directions are not clear enough. I had to go to my mothers old drawn out forever making fudge recipe because it was easier then this one. I did this one twice, waited at least an hour and followed it to the tee and it became syrup. Do not bother with this one. Go to old reliable moms recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Redding"
},
"reviewBody": "Just keep stirring and keep an eye on that thermometer, it raises fast after 210"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Micheau"
},
"reviewBody": "Never even tasted such an amazing fudge!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Miller"
},
"reviewBody": "Would help to have time estimates on recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darin Campbell"
},
"reviewBody": "Quick and easy and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Spencer Gordon"
},
"reviewBody": "This fudge is not easy to make as many of the reviews say if you do not get the timing exactly right it does not setup properly and is more of a gel or icing than a hard fudge. It’s completely misleading to say “this is easy to make.”"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela N Robby Bradford"
},
"reviewBody": "This is just like my Mamaws fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ernie305"
},
"reviewBody": "yummmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christine Poskus"
},
"reviewBody": "Mine came out runny never got hard"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cgregb"
},
"reviewBody": "Old fashioned fudge like Granma's Temp is not too picky. I prefer 143 on my thermometer. I have gone to 153 and it was okay. Trick is to beat it, beat it, beat it after it comes off the heat. I use a cast iron pot. It keeps the heat and spreads it throughout the whole mix. Mine is smooth throughout and not grainy. Everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mina Y"
},
"reviewBody": "Just like mom used to make, and I haven't been able to find a similar recipe until now. I love the texture difference between this and the old refrigerator or sweetened condensed milk varieties- and this one more than wins for texture AND taste! Nice job of bringing back nostalgic memories- this will be a keeper, exactly as written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JUSTTWOSWEET"
},
"reviewBody": "These were a lot of work for a so-so fudge. I prefer a more creamy texture and these were more gritty. They tasted a lot like the oatmeal no-bake cookies we made as kids. Don't get me wrong, we still gobbled it up, but I've had better. Next I'll try the marshmallow fluff version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Bone"
},
"reviewBody": "Added pecan with one and walnuts with the other"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill R Llewellyn"
},
"reviewBody": "Definitely make it again per my husband's request, lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary vanwychen"
},
"reviewBody": "yes it was very good and I would make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Goldie Owens"
},
"reviewBody": "This turned out just the way I like it. I'm going to try leaving out the cocoa and adding 3 tablespoons of instant coffee. So I made it! I also used 1/4 c. Liquid coffee mate, cinnamon and vanilla cream flavor. And reduced Milk to 3/4 c. It turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbie"
},
"reviewBody": "Let it cool a little while before whipping air into it By Hand not mixer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Ayers Skinner"
},
"reviewBody": "My mom used this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Gourley"
},
"reviewBody": "I didn't make any changes!!! It was wonderful!! It was just like I remember making it years ago and I will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David Tate"
},
"reviewBody": "I made this twice. The fudge would not thicken. I used candy thermometer and cooked it for 40 min. and still wouldn't get to 138 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wyatt"
},
"reviewBody": "Don't be scared off by reviews saying you can't make this on an electric stove. I've been making fudge for forty years, have won prizes, and have never had a gas stove. If you know your pans and your stove, you'll be fine. You need a good steel pan but even if you don't have a heavy one, you can use a burner trivet (if you don't have one, you can make one out of a wire hanger.) Most electric burners have numbered dials from 1-10. I find that I can bring the mixture to a boil on 5 (takes a bit longer than with a gas stove) and then let it simmer between 3 and 4 and I get perfect, non-grainy fudge every time. A good candy thermometer is also your friend here, as well as learning how to do the soft ball test in cold water and buttering or oiling the sides of the pan before you begin. Don't let anyone scare you off of trying a recipe just because you don't have a gas range."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLesGo"
},
"reviewBody": "I made this exactly as directed but added 1/4 cup peanut butter &amp; pecans(because I wanted to). Very easy and delish! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meghan"
},
"reviewBody": "Nice and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cori"
},
"reviewBody": "This is the first time I've made fudge and it will probably be my last time. I followed the recipe exactly as stated. I've read all of the reviews so I would know what to expect and listen to tips of other fudge makers. It took forever. There is nowhere that states how long this takes. I even watched the video and they made it look so fast and easy. The wonders of editing. They said to use a medium pot. So I did. The candy thermometer is to big for a medium pot. The chocolate mixture kept almost boiling over. I had my temperature at 4 on an electric stove. I had to turn it down to 2. But at 2 the temperature wasn't getting above 225. So I had to turn it up again. After about 45 minutes it finally got to the right temperature. I also kept doing the ball test in the cold water. Many, many times. So after about 1 hour I could finally take it off the stove to cool. I cooled it to the stated temperature that other people suggested. Then added the other ingredients. Then began to beat and beat and beat. I have blisters on my fingers and my hands cramped. I had to get the hand held electric mixer out. Wow! it started to thicken and get less shiny, and then with my luck the electric mixer burned out. It couldn't handle it. So back to mixing with the wooden spoon. Then I tried a whisk. It did get very thick but still shiny. I gave up after mixing for about 45 min. I dumped it into the pan and spread it out as best I could."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shell"
},
"reviewBody": "omg wonderful wonderful wonderful. . im making it to give out for Christmas snack boxes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loretta Flowers"
},
"reviewBody": "BEST homemade fudge I've ever had! And even beats some fudges I've gotten at specialty shops. I made this recipe exactly how the recipe says and it's so creamy, everyone I gave some to said it was \"pure bliss\" ! \nThis will be my main fudge recipe always!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char Kells"
},
"reviewBody": "Easy and delicious. Just like my mom made 50 yrs ago. So many recipes are too complex, extra ingredients and this is simple. Caution tho use a candy thermometer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gibby"
},
"reviewBody": "This was my first time making “real” fudge. I followed the recipe exactly (I did use a candy thermometer). It turned out perfect!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Debbie A"
},
"reviewBody": "I didn't make changes except listening to the video it said to let it cool to 110 degrees. That was a Huge mistake. It wouldn't mix at all. I was very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Followed recipe exactly. After stirring for what seemed like forever, I reached the temperature stated. After pouring into the pan the fudge never got hard. Made many easier fudge recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "This is my favorite kind of fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hockeymom Klein"
},
"reviewBody": "Easy peasy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shelley Ryan Economou"
},
"reviewBody": "Simmered even boiled this and it did not ever get to 238 degrees. Need to mention that you need a gas stove for this recipe. Turned in to a very Thick chocolate syrup and never set up the way it’s supposed to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is a good, very sweet fudge, but not as creamy as I had hoped. Use a large pan because it does expand while cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wrajhm"
},
"reviewBody": "Awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Well I did everything it said and also read reviews and I let it cool 110 but I think the problem was was when it says to steer until the shine goes away was the mistake because it just started setting and I think you want a little shine in it from the fudge that I remember tasting so good. I should have just stirred it all in till the butter mixed well and then poured in a pan but it wasn't a total failure it was still soft enough to cut but it was kind of crumbly and know shine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maddy"
},
"reviewBody": "I had to make it 9x9. The recipe is really good, and make sure if you're going to go for a bigger size to always double it! I will be making this probably all the time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cw ellzey"
},
"reviewBody": "Made with fat-free milk, took longer to cook but taste great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Doud"
},
"reviewBody": "No changes needed, just have to be patient, it takes a while to remove that shine, but that is the secret to great chocolate fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Grove"
},
"reviewBody": "It looks good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Bradford"
},
"reviewBody": "I will definitely make this again. So simple and only 5 basic ingredients. Anyone can make this. Takes a bit to bring to the right temperature to make it \"rise\". Must hit temp but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "It tasted phenomenal, but I definitely did something wrong because it didn't set properly. My thermometer was a little finicky, so I'm thinking I didn't hit the proper temps. I beat it for 25 minutes and it never lost its sheen! Definitely trying again though, because the flavor was great. We ate it with spoons!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorena Clark"
},
"reviewBody": "it turned out absolutely wonderful and tasted amazing thank you so very much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Pleasants"
},
"reviewBody": "yes, also used it for icing yellow sheet cake. just dont cook it as long as u would candy ! Big Hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neunana"
},
"reviewBody": "I cannot d this in a microwave. This is just like Aunt Margie made every Christmas."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9420/old-fashioned-chocolate-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
"name": "Fudge Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17151/desserts/candy/fudge/chocolate/",
"name": "Chocolate"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9420/old-fashioned-chocolate-fudge/",
"name": "Old-Fashioned Chocolate Fudge"
}
}
]
}
}
, "about": [
]
}
]