				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "One Pot Tuna Casserole"
,"datePublished": "2018-03-21T12:18:07.000-04:00"
,"dateModified": "2022-07-14T18:04:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "PREFERED1"
,"url": "https://www.allrecipes.com/cook/156268"
}
]
,"description": "This is so easy and fast, like tuna casserole without baking it! Top with French-fried onions, if desired."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/jMty_fWPz4Pq_FchRrMIUbHh6Fs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7127550-4c16ba13b710455fa169555ef8f5607d.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "One Pot Tuna Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "294"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "395 kcal"
,"carbohydrateContent": "43 g"
,"cholesterolContent": "79 mg"
,"fiberContent": "3 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "452 mg"
,"sugarContent": "4 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (16 ounce) package egg noodles",
"1 (10 ounce) package frozen green peas, thawed",
"0.25 cup butter",
"1 (10.75 ounce) can condensed cream of mushroom soup",
"1 (5 ounce) can tuna, drained",
"0.25 cup milk",
"1 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water until al dente, adding peas for the final 3 minutes of cooking; drain."
} ,{
"@type": "HowToStep"
,"text": "Melt the butter in the same pot over medium heat. Add the mushroom soup, tuna, milk, and Cheddar cheese. Stir until cheese is melted, and the mixture is smooth. Stir in the pasta and peas until evenly coated."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cruiselover914"
},
"reviewBody": "I made this, but I read the reviews and I added 1tablespoon of garlic powder, one tablespoon onion powder. A half a can of milk and a half a bag of. 12 oz bag of noodles. It was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlene Marchbank"
},
"reviewBody": "After looking at several recipes and reading reviews with various tips I used this recipe loosely as a base. My substitutions/additions were 1 1/2 cups of small elbow macaroni, 2 cups of frozen mixed veggies, 1 can cheddar cheese soup, 1 can cream of celery soup,1 cup of sour cream, 2 cans 5 oz albacore tuna ,1 can 2% evaporated milk, 10 slices of mixture of pepper jack and cheddar cheeses, 1 onion and crushed garlic sauteed in butter, and French fried onions crushed. I'm I'm a casserole lover so I did put this into a casserole dish and put crushed French fried onions on top and baked uncovered at 400 for about 20 minutes until bubbly. Left in Left in oven for 5 minutes. My husband does not like tuna casserole but I was in the mood to make one. He actually had 2 helpings and complemented me on my cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "curleegirl"
},
"reviewBody": "Needed way more flavor - an additional can of cream of mushroom soup, more butter, and more milk probably would’ve made all the difference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beachy"
},
"reviewBody": "I wanted to love this and made most of the feedback suggestions- garlic, Worcester, red pepper, baked with a topping, etc. but was only ok, still pretty bland. Whomever can get this right will be a superstar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana Daniels Gerst"
},
"reviewBody": "Quick and easy and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Marquez Szany"
},
"reviewBody": "I made mine but added the butter to the noodles then cream of mushroom soup, milk, cheese, then canned peas (didn't hv frozen) then the tuna 2 cans!!! It was excellent!!! Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "Use more tuna, less noodles, and more spices"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica "
},
"reviewBody": "I added chopped onion, 2 tablespoons of onion soup mix , put in oven for the last 10 minutes adding cheese &amp; fried onions on top!! very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "China Expat"
},
"reviewBody": "Easy to make expat recipe. Substituted the egg noodles for a 300 gram package of dao xue gua mian (sold at hong qi) substituted the green peas for mushrooms (ping gu, which ended up being a little bland, will probably do a different mushroom next time) and an onion. Added in some garlic too. I was already stocked with the soup and tuna from taobao, so ready to go in minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Rosencrants"
},
"reviewBody": "For what it is great. Used sour cream instead of milk and was out of peas so forced to use carrots. When it was done topped it with fried dill pickles. Comfort food, quick and easy. Thanks for this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celestine Otis"
},
"reviewBody": "I thought this was a great meal base. I used Swanson chicken in a can instead of tuna. Also, added onion powder, garlic powder, paprika and worchestire sauce. I switched to cream of celery soup too. It was so easy and my grandson helped me make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deen Waddell"
},
"reviewBody": "Adjustments had to be made....less noodles, more tuna, more milk, and some seasonings. It was easy, though, and fit the bill for my tuna noodle craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Angell"
},
"reviewBody": "There was not enough sauce for the noodles and turned out rather dry. **EDIT** I made it again and this time doubled the sauce and it was much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Purgatorio"
},
"reviewBody": "I made this and it turned out absolutely fabulous but I twirked it a bit. I used sour cream and since I make homemade chicken and noodles; I made my own noodles and crumbled potato chips on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JeannieJoe"
},
"reviewBody": "It was easy enough to make, and very economical. As far a tuna casseroles go, it was tasty. My husband enjoyed it. I would likely make this in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Blondiecooks"
},
"reviewBody": "This recipe had way too much noodles for the amount of liquid. I ended up adding another can of soup, another 1/4 cup milk, miked it in with the other sauce as well as 1/2 cup diced white onion. I also added a 1/4 cup shredded mortadella on top, as weill as 2 diced hard boiled eggs, a melted tbs butter, sprinkled with paprika and covered top with fried onions. then baked for 15 minutes at 375. it was then perfect! The way written I would suggest 8 oz noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "xrxtech"
},
"reviewBody": "Good, but next time I would definitely double the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "we love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Thune Cooper"
},
"reviewBody": "I used peas and carrots but otherwise followed the recipe as is. I am having a kitchen remodel and needed an easy one pot meal. It was easy, fast and delicious. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tabitha M"
},
"reviewBody": "Too many noodles and not enough tuna. For this much pasta you need to add at least 2 cans of tuna and 1/3 can more cream of mushroom or adjust butter and milk depending on your taste. This would be a good recipe if you used 2/3 to 3/4 the noodles. I make tuna and noodle casserole a lot but thought I’d try a different recipe and it was a fail. I suggest looking at a couple other recipes because the measurements are incorrect here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bri Benedict"
},
"reviewBody": "This was fabulous!! My step dad and I are the only ones in the family that eat tuna, so I made a pot for him and I. It got both of our seals of approval! I accidentally got the cream of mushroom soup with garlic, but I think it really worked well with the recipe, you couldn't overly taste the garlic, it was just enough to give it that little boost. I used macaroni noodles instead of regular egg noodles also, I had a lot of them in the cabinet, and it worked out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kay LeeAnne"
},
"reviewBody": "The first time I made this, I followed the recipe exactly. It was very similar to the kind my mom made growing up. Both my husband and I thought it needed more sauce, and so now I double everything but the noodles and peas; the peas, we use a 16 ounce bag. This makes a ton for us, probably about 8-10 servings, so my husband has a lot for lunches (which he loves). He served in the army and says this tastes very similar to the MREs he used to get in Iraq and uses red Tabasco to season. He says it brings back lots of great memories, minus the sand blasted face :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Wolfe"
},
"reviewBody": "This was great! As a basic recipe, this gives the guidelines. Dress it up to taste, as is a cook's prerogative, and the possibilities are endless! I doubled everything but the noodles, added onions, fresh garlic, sour cream, and a WHOLE BAG of shredded cheese. Top it off with french onions, and it's quick, easy, and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Montevideo"
},
"reviewBody": "Used 12oz egg noodles, 1 1/2 c. extra sharp cheddar cheese, added celery (uncooked for more texture), and used herb and garlic tuna for added flavor. Ended up adding a little extra milk for desired creaminess. Crunched up original potato chips are delicious on the top! Good base recipe to make changes per taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moises Lacano Alburo"
},
"reviewBody": "I'm Just totally in love with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marc Lehman"
},
"reviewBody": "Nice and simple, just like mom used to make with a bit of garlic salt and paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Angelle"
},
"reviewBody": "Simple and economical. Good for building confidence in amateurs like me. Might be good to spice it up a little bit, literally. Makes a lot, you might have leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "Didn't like it. Too fishy taste for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary1244"
},
"reviewBody": "We were out of frozen peas so I used frozen mixed veg it was just as yummy!! Winner, winner tuna dinner we will be adding this to our current line up for weekly/bi-weekly dinners for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann D"
},
"reviewBody": "thank you prefered1 for this recipe and everone else who gave their input. i sauted onions in butter then added 2 cans of cream of onion soup and two cans of tuna fish with 1/2cup of milk. i added sharp cheddar cheese to that pot. this came out fabulous, esp when adding frozen peas to wide egg noodles. made enough for the extended family. thank you again to all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dt24"
},
"reviewBody": "No changes- very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Habeck-Johnson"
},
"reviewBody": "I only added half can of mushroom soup, added a little bit of hot sauce, worchestire sauce, pepper, a bit of sour cream, and put the french fried onions on top, a great base recipe to start with. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MrMatt"
},
"reviewBody": "I'd suggest using more than the recommended amount of cream of mushroom soup as the noodles will absorb a good bit. But it was very good and I'd make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Pettigrew"
},
"reviewBody": "I made this with green (veggie) rotini because my picky eater loves the color green. Omitted the extra veggies. Used 15oz tuna to make it heartier. Mixed noodles, butter, milk, and cheese as directed, then transferred to casserole dish to add soup and tuna mixture (warmed tuna in a pan with garlic, oregano and lemon juice before adding to casserole). Topped with parmesan cheese and microwaved for 4 minutes to combine flavors. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Lee Morgan"
},
"reviewBody": "Decreased tri-colored spiral pasta to 8 oz., increased milk to 1/2 C, used cream of Celery soup, used 1 packet of Velveeta cheese sauce, seasoned with onion flakes, garlic powder, turmeric, parsley flakes, and celery salt. Finally drained a can of Le Seur small sweet peas and added to the boiling pasta water for the last 3 minutes. I did all that after reading several of the reviews. Results....voila, perfection! Otherwise, the only ingredient that stayed the same was tuna, but I only had a 5 oz. can!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anka"
},
"reviewBody": "Great quick recipe for weekday dinners- very easy to make and to adjust to your personal preferences , i used fusilli pasta and added sauteed mushrooms, onion ,garlic and celery, as well as frozen corn and peas this tme but i made it several times and used whatever veggies i had on hand -always turned out great !I topped the casserole with mozzarella and on top of mozzarella prepared melted butter and plain breadcrumbs lightly toasted ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Dunn"
},
"reviewBody": "I added 1 extra can of tuna and sauteed some fresh mushrooms in the butter before adding the other ingredients. The flavor is great but 1 lb. of uncooked pasta is a bit too much for 1 can of tuna and 1 can of mushroom soup. Next time I will cut back a little on the noodles and add another can of mushroom soup to make it creamier but we really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Norah"
},
"reviewBody": "Very good and easily adaptable for add-ins. I left the onion out and used 1 tsp onion powder. I doubled all the ingredients except the noodles and peas. Came out fantastic. Even my very picky husband liked it! I have also made it using cream of chicken soup and canned chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Way too many noodles. I would cut the amount of noodles in half or double the mixture of soup, cheese, milk etc. I should have read the reviews before I made this recipe. disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dino28"
},
"reviewBody": "This was just as it was supposed to be simple easy and good. MADE RECIPE AS DIRECTED NO CHANGES!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justasunflower"
},
"reviewBody": "Very good! My family loves it! We make this at least once every other week..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "Very nice and soooo quickly done. Thank u:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angelina"
},
"reviewBody": "This is your 'very basic' tuna noodle casserole recipe.... before you pour it into a baking dish and top it off with whichever topping you prefer to use (seasoned &amp; buttered breadcrumbs, crushed corn flakes, French's French fried onions, etc.) in order to make the topping crunchy. I too, have made changes to the basic recipe over the years. I use frozen peas &amp; carrots, and sour cream (instead of milk). I've also made it using a can of condensed New England Clam Chowder instead of Cream of Mushroom Soup, and it was terrific! I also add in some sliced mushrooms (either canned or fresh) since we love them. I like that you can do almost anything with this basic recipe, which is also very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gary Vos"
},
"reviewBody": "This is pretty much how I've made tuna noodle casserole for many years but like Nina I saute half an onion in butter before adding rest of ingredients listed here. I also use less green peas--don't measure just throw in what I think is enough. Of course I add garlic powder to almost everything I cook. Next time I'm going to add the celery too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Basset5"
},
"reviewBody": "This was just ok. Too many noodles for the tuna, soup, milk and cheese. If I make it again I will halve the noodles and use 2 cans of tuna and soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "winamoe"
},
"reviewBody": "I just have one comment for all the reviewers who couldn't resist adding a bunch of extra ingredients: \"It's tuna casserole.\" \n If you feel like you need to power up the taste, then you obviously don't care for tuna casserole. No hard feelings, I'm just putting that out there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Loretta"
},
"reviewBody": "I made this for dinner tonight and my casserole-loving guy raved over it. I had to give it 3 stars because of the changes I made.\n\n I used 16 oz. of egg noodles cooked in UNsalted water; 16 oz of Mixed frozen vegetables that I added during during the last 7 min of cooking. (I didn't thaw first). Drained the veggies and noodles, then added a can of mushroom soup And a can of cheddar cheese soup, plus a half cup sour cream instead of milk. I didn't add salt as there's enough in the condensed soups. I used garlic powder and onion powder and freshly ground pepper. Then I stirred in a half cup of hot cheddar cheese, with extra pepper flakes, I had on hand, after shredding it. We like our tuna to be chunky, so I gently folded in 3 Cans of tuna without breaking it up down too much. Then transferred the mixture to a casserole dish and sprinkled cracker crumbs on top and drizzled it with a half stick of melted butter. Baked in 375 degree oven until bubbling and browned. Gave me time to set the table and toss a salad. We will definitely add this to our favorite weeknight meal list!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pudgysmom"
},
"reviewBody": "Instead of cream of mushroom soup try one can of cream of mushroom soup and one can of cream of celery soup. We sometimes just use the cream of celery. Celery and tuna have an affinity for one another that mushrooms and tuna do not. I put tuna in bottom of microwaveable casserole dish, layer noodles, soup and cheddar cheese on top of the tuna, put a layer of cheese on top and pour milk on top of the cheese. Microwave on 60 (bake) for 8-12 minutes depending on your microwave or until the cheese is melted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Just Tabitha & me"
},
"reviewBody": "I modified it. For one, as written above with milk, the problem of dryness is solved. However, with just 1 can of soup, the milk just increases the blandness. So, to combat the dryness problem I added a can of Cream of Celery Soup too! (Came out about 2 years after the Mushroom variety). Fantastic flavor adjustment!!! After the first time I served it, my husband (a huge meat &amp; potatoes man) actually liked it, and asked if we could have again, BUT(!!!) \"could you put a little MEAT or more tuna in it?\"! Think about it, you have 8 servings, which amounts to less than 1 oz. of protein per person even with cheese added! So, I tripled the number of 6 oz. cans, of Tuna, now I simply buy larger cans of tuna. If I serve this at a potluck, for instance, everyone wants the \"recipe\"!!! Oh, another trick I learned, about 5-7 minutes before your pasta is cooked, throw in the UN-thawed peas, &amp; they impart a bit of flavor into the pasta! HTH!!! Blessings!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Good , simple .... ate a lot of this 40 years ago .."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susanne Jourdain Thibeault"
},
"reviewBody": "I make this recipe all the time , only change I make is I use cream of celery soup I don't like canned mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glen Harvey"
},
"reviewBody": "I think the whole point of PREFERED1's recipe was that it's \"stove top\" not \"baked\". I've done the stove top many times and tried the oven once and saw no real point in messing up another dish! I like stove top just fine thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Anderson"
},
"reviewBody": "I've made this its awesome especially when you have to feed a hungry 9 year old and a teenager! Also how can I make this without cream of mushroom soup? I have canned mushrooms and milk but no cream of mushroom??\nI am making this tonight for five we have a guest tonight people. Also I use regular spiral colored noodles and I put a little onion powder in it its awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Desirae Holman White"
},
"reviewBody": "Good base recipe. I agree with other reviewers that it needs a bit more flavor and ingredients to make it great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chicken143"
},
"reviewBody": "A great base recipe! I used frozen peas and carrots. Used 2 cans and doubled the milk. I added a little onion powder, garlic, celery salt, and a dash or worchestershire. Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MichaeleM"
},
"reviewBody": "I didn't make it as is b/c I didn't have all the ingredients, so I adjusted based on some other reviewers. The end result, we really liked and will make again ! I didn't have any peas so I used a can of mushrooms. And two cans of tuna and soup. Added some garlic powder, well, because everything is better with garlic :0) Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby Fuchs"
},
"reviewBody": "Love this recipe! Fast and easy! The only change I made was using Velveeta cheese. So good and creamy and best of all NO BAKING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mammers"
},
"reviewBody": "Very yummy! I added another hal can of cream of mushroom soup as well as another 2 1/2 tbsp. of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VETTELVR24"
},
"reviewBody": "a little bland but all in all great dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Pretty good. A bit bland. Will need to add more flavoring to it next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pauline"
},
"reviewBody": "This is now one of our favorite desserts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Thea"
},
"reviewBody": "I added some mushrooms and onions. I know for this recipe you're not supposed to bake to save time but I put it in a casserole dish, added cheddar cheese and bread crumbs on top and baked it for just a few minutes to melt the cheese and toast the bread crumbs. Turned out really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray Andraka"
},
"reviewBody": "I also modified it: I used 1 lb egg noodles, 2 cans cream of mushroom soup, a red bell pepper, 4 celery stalks, one yellow onion chopped, sliced mushrooms, 16 oz bag of frozen peas, substituted sour cream for the milk, and 3 cans of tuna. I added some dried red pepper flakes, black pepper and celery salt for seasoning. I used about 2,5 cups shredded cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SOCAGYAL"
},
"reviewBody": "This dish came out great with a few changes! The quantity of pasta and peas was too much, so you can either cut down on the pasta or add more tuna (about 1 can more as others suggested). I also decreased the amount of peas used. \r\n\r\nFollowing other reviews, following are some additional ingredients I added: 1/2 teaspoon onion powder, 1/2 teaspoon garlic, 1/2 teaspoon paprika, 1 tablespoon Worcestershire sauce, and a little bit more milk. It would have turned out too bland without these additional spices.\r\n\r\nI then put the mixture into a casserole dish, sprinkled Italian breadcrumbs and a little cheddar cheese on top, and baked it at 375 degrees for 20 minutes. \r\n\r\nNext time I would like to add coriander leaves and some additional vegetables and see how it turns out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Luv is Cooking"
},
"reviewBody": "I made it exactly as the recipes say's. I always make it without any adjustments the first time out and it was ok. I will make it again but with my own twicks to make better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "roxz"
},
"reviewBody": "This tasted pretty good as the recipe is written, but for my family's taste preferences I will probably make some adjustments next time. My husband noted that this could have used a little more cheese and I felt it would have benfited from a little more liquid (soup, milk, or both) and some seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elaine Best"
},
"reviewBody": "It sounds very plain but it's good. we enjoyed it a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Ann Inniss"
},
"reviewBody": "This is a great fast meal. I sauted onion and garlic and celery also and added it to the casserole. I added to the milk a little bit of cooking cream to thicken it up.I also added another can of tuna. I definately will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "weschm"
},
"reviewBody": "Very bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AmandaT"
},
"reviewBody": "I found this a little bland, but it was good comfort food that was quick and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "big lou"
},
"reviewBody": "Very easy, very quick, and it tastes good. This recipe is very easy to augment for one's personal taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRAYCE"
},
"reviewBody": "I've been makling a similar recipe for many [40] years.I use cream of celery soup. 2 cans tuna, 2 cans soup, &amp; 1 can of milk. Maybe a little more. I sautee the veggies [ onion &amp; celery to taste]. Combine all ingredients including the peas except the cheese &amp; put it into a buttered casserole, then top with cheese, cover &amp; put into a 350 degree oven for 35 to 45 min. Remove the cover &amp; put back in oven for a few minutes to melt cheese. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow, this dish was super cheap to make and delicious! I'm giving it 4 stars because it was looking dry so I read more of the reviews and added another can of cream of mushroom and luckily I had another can of tuna to add as well. We plan on making it again later this week. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "whachagotcooking"
},
"reviewBody": "This was an easy recipe to follow. A little bland though and my family did not care for the tuna casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "livinhapaz"
},
"reviewBody": "It definitly need some hot on it. Next time will put some chilli for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patricia"
},
"reviewBody": "I often added a bit of curry powder or hot sauce to this. It's one of our favorite go to recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lilly Frances"
},
"reviewBody": "Great cheap go-to meal, even for a single gal. Plenty of leftovers. I just changed the pasta ratio (I used about half the amount it called for), used shells instead of egg noodles, upped the salt (I'm not concerned about my salt intake, so don't follow my advice if you are!) and used half Parmesan and half cheddar. Deelish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Olsen"
},
"reviewBody": "Only reason I didn't give this a 5 star rating is because I made adjustments. I added 1/4 cup mayonaise and 1/4 cup sour cream to this. Upped the milk to 1/2 cup. Also added a can of corn. Baked for 40 minutes in at 350 degrees. Very, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ayn"
},
"reviewBody": "I found this to be very easy to make and the taste was pretty good. not quite the same as baking it though. I would make t again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nuttynewtmeg"
},
"reviewBody": "This was a tasty recipe! The only thing I would do different is definitely add another can of tuna, and add one more can of cream of mushroom soup and an extra 1/4 cup of milk. The soup and milk is just to make it a little bit more creamy, personal preference really, but this was still a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GeeAnn"
},
"reviewBody": "Four stars with my tweaks, 3 without. Reduced pasta to a 12 oz bag of bow tie pasta. Increased tuna to 2 cans. Had to increase milk to 1/2 cup. Needed some seasoning of onion powder, salt and pepper. I would have sauteed some onion with the butter if I had thought about it. Sharp cheddar is good. I made this lighter by using light butter, skim milk and 2% cheese, and tuna packed in water. No one was any the wiser and it was delicious and very quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee's Deelites"
},
"reviewBody": "I changed a few things. I used Rotini, fresh broccoli and 1/4 cup of chicken broth to \"loosen up\" the dish. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hawksbill"
},
"reviewBody": "I've made this twice now, both times I used a little more cheese than called for, 2 cans of tuna and I used mixed veggies instead of just peas. Everyone loves it. My 21 year old son's comment was that it would also be good made with chicken. Very quick to make and there is always leftovers to take to work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tat"
},
"reviewBody": "An extra star for ease of preparation. But really, one 6 oz can of tuna for eight servings? Setting aside the fact that almost all tuna comes in 5 oz cans nowadays. \n\nIt's good if you want to fill up on egg noodles, and it certainly is economical. But I would not make again, as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Patty"
},
"reviewBody": "Easy and delicious! A working mom's dream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ClareJ"
},
"reviewBody": "Really yummy, it came out a little dry, so I would up the milk next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rons recipes"
},
"reviewBody": "Basic forever recipe. Used it during my college days in the 60's but added potato chips on top. Tasty, easy and inexpensive but use a quality cream of mushroom soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessiegavrilles"
},
"reviewBody": "This recipe is so easy and yummy. I added sauted onions and mushrooms to the mix and double the tuna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "vedda"
},
"reviewBody": "This is close to the recipe on the back of campbells cream of mushroom soup. Butter is not necessary just added fat. I make this alot really cant mess it up use as much or as little as you want of noodles, peas. You can also use cream of chicken soup for those who dont like mushrooms use chicken instead of tuna. Black pepper is optional but adds alot of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "Quick and easy to make, family loved it !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luckylinda"
},
"reviewBody": "This was great, but I added 3 cans tuna, 2 cans soup, onion powder, and topped with crushed potato chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Smalls"
},
"reviewBody": "I will be making this tomorrow with the leftover pasta I have. I used to make this for my kids. I was surprized that they always gobbled it up as we were not big tuna eaters to begin with. I also used the version made with Kraft Dinner and veggies as one reveiwer suggested. It was cheap and really quite good. As another reveiw stated this is just tasty, good, affordable, basic, fast cooking. It's not meant to fancy. Thanks for featuring this recipe as I had forgotton about it after my kids left the nest. As a suggestion, for those who prefer chicken. I am sure it is fine to use the canned chicken or stop at the suppermaket on the way home to get a rotisserie chicken. This will be great with my leftover pasta. Fast and easy. Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZeldaSayre"
},
"reviewBody": "So many of the reviews for this are lists of things added, ingredients altered, and cooking methods changed. Which is fine, do what you want; but I think those people are kind of missing the point of this recipe. It's not intended to be the Best Tuna Casserole Ever. It's just like the description says: easy and fast. It's something to make when you don't have the time or gumption to make much or shop, but still need to eat, and would like the thing you eat to be as palatable as possible. So that's how I'm going to rate it. On those terms, this recipe is great: it's easy, it's fast, it contains a vegetable, and it tastes pretty good. The next time I make it I imagine I'll use two pots, one for the sauce and one for the noodles, since by the time the water boils and the noodles cook the sauce could be made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ncadair"
},
"reviewBody": "SUPER easy, sooo fast, and SO good! I added another can of tuna, a lil more cheese, and a dash more milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "N K Thoms"
},
"reviewBody": "Has anyone used canned chicken for thisinstead of the tuna? Sounds like a possible, maybe?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Mendoza"
},
"reviewBody": "Easy and simple. I enjoyed this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Yvette"
},
"reviewBody": "A nice and quick meal for a weekday. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Captain Sunny Fox"
},
"reviewBody": "Love this--only change I made was using a LARGE can of tuna in oil, plus I added a cup of Miracle Whip and omitted the milk. Was really good! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amitchem"
},
"reviewBody": "It was simple and delicious! I was able to whip it up in no time which is always a plus when you get home late from work and need to cook dinner for the family. Everyone loved it!! I used condensed cream of mushroom and garlic soup. No seasoning necessary :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24512/one-pot-tuna-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
"name": "Fish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/415/seafood/fish/tuna/",
"name": "Tuna"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24512/one-pot-tuna-casserole/",
"name": "One Pot Tuna Casserole"
}
}
]
}
}
, "about": [
]
}
]