				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ono Butter Mochi"
,"datePublished": "2020-06-18T23:12:02.000-04:00"
,"dateModified": "2023-03-08T12:51:34.718-05:00"
,"author": [
{"@type": "Person"
,"name": "SAXONY"
,"url": "https://www.allrecipes.com/cook/1395341"
}
]
,"description": "This recipe for mochi is an easy Hawaiian local-style treat made with coconut and butter in a rice flour base. A great dessert for any tropical themed party."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lehbr5V0zvwxVdaxgnqsCxyGgXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/748_Ono-Butter-Mochi_CD_55656-4-1b4ee0c493784fd99b9402d5b1b4ec71.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ono Butter Mochi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "198"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "463 kcal"
,"carbohydrateContent": "78 g"
,"cholesterolContent": "104 mg"
,"fiberContent": "2 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "156 mg"
,"sugarContent": "47 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
, "recipeCategory": ["Dessert"]
,"recipeCuisine": ["Hawaiian"]
,"recipeIngredient": [
"1 pound mochiko (glutinous rice flour)",
"2.5 cups white sugar",
"1 teaspoon baking powder",
"0.5 cup butter, melted",
"3 cups whole milk",
"5 eggs",
"1 teaspoon vanilla extract",
"1 cup sweetened, flaked coconut" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8PX3HG_SNxCsVmGkg-c5381H2AQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/748_Ono-Butter-Mochi_Mise-en-place_CD_55629-1-694d4a86dde64452a4ba87d1a4239de4.jpg"
}
]
,"text": "Gather ingredients. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Rvy3ntwc2eqNc2GTBoKnRyUZV9U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/748_Ono-Butter-Mochi_Step-2_CD_55630-1-c573b3daa8b247b4b84217fcee5f42ab.jpg"
}
]
,"text": "In a medium bowl, whisk together the eggs, vanilla and milk. In a separate larger bowl, stir together the rice flour, sugar, and baking powder."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/k-7X-wiFfBtGwzLcKh884SQXBNc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/748_Ono-Butter-Mochi_Step-4_CD_55631-1-ee355fe538fb4050a686db191bd0e22f.jpg"
}
]
,"text": "Pour the wet ingredients into the dry ingredients, and stir to blend. Mix in melted butter and coconut. Pour into the prepared pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IZNipNsjcxF6UtTgEgUX0Wq_wB8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/748_Ono-Butter-Mochi_Step-6_CD_55633-0629c63f1341436b8a5671cb50100183.jpg"
}
]
,"text": "Bake for 1 hour in the preheated oven. Cool completely, then cut into squares to serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Okimoto"
},
"reviewBody": "I made it twice. Cut the recipe in half. Use only 1 cup of sugar. Use a 8x8 baking pan lined with parchment paper. Use half cup of sweet coconut flake in the final stir, I added3/4 teaspoon of almond extract. Blended well and only use 2 eggs. After pouring in pan take 4-5 tablespoons of shredded coconut and lightly sprinkle over top of mixture. What they don't tell you is this is a butter rich greasy cake, when it cooks the butter seem to float to the top, sides and bottom. Set oven 350. 45 to 50 minutes check for a nice golden brown. Then let cool in the open shut off oven for at least 30 minutes or more. Use a sharp knife and cut into the picture pieces, more semi crunchy chewy crust hint of almond taste of coconut and real uwee gooeey mochi texture and taste. Can store in airtight container (do not put in fridge) for 2 days if it last that long. OISHI"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Loved this recipe I used the rice flour but I put pineapple in mine turned out good it looks burned along the sides but it’s not I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keiko"
},
"reviewBody": "YUM!!! I actually made this in my AIR FRYER last night and it was SO good and successful! I used the 3 serving recipe, just one egg, no shredded coconut, and 1% milk. At first I baked at the regular 350 degrees for about 10 minutes then decided to switch to 325. The top was dark but didn't taste burnt at all, the sides had a slight crispiness and overall it was just DELICIOUS. My boyfriend loved it too and he's not big on sweets. I'm going to make another batch today since I just finished the last bite and it just wasn't enough! :P I loved it so much I made an account just to write a review LOL thank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Parker"
},
"reviewBody": "This is a great recipe for mochi cake. My mother in law is from Kauai and this is just like hers. It’s easy to make, tastes onolicious, and is great to bring for potluck or a bake sale!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodmom"
},
"reviewBody": "OMG its sooo good, I used the Mochiko sweet rice flour, doubled the coconut and followed the tip about substituting the milk for evaporated milk, sea salt and coconut milk. Baked for only 50 minutes. Its perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maytee2015"
},
"reviewBody": "I made changes as one of the reviewer, replacing 3 cups of milk with coconut milk and evaporated milk to make up 3 cups. And cut the sugar to 2 cups and add 1 tsp of salt since I used unsalted butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyBird1432"
},
"reviewBody": "instead of 3 cups milk, i used 1.5 of milk and 1.5 of coconut milk (if you can find Chaokoh brand, use that!). I also only used 2 cups of sugar (raw Florida Crystals), and it was plenty sweet! I make mine with whatever glutinous rice flour is cheapest and Mochiko isn't always it! I love how the sugar rises to the top and makes a crunchy crust! Bake this the full hour in the 9x13 pan, and let cool completely before cutting. Better the 2nd and 3rd day. Broke da mouth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene Devera"
},
"reviewBody": "This recipe is better than other mochi recipes that I've tried. I substituted the milk with 1 can of evaporated and 1 can of coconut milk. I also cut the sugar in half and added macapuno strings instead of coconut flakes. PERFECT! Its my go-to recipe for family gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladyfox8501"
},
"reviewBody": "Great recipe and crowd favorite! I will\nDefinitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ArtsyAnne"
},
"reviewBody": "I’ve never had mochi before and I like trying new things, so I was excited to try this recipe. It was easy to put together, good flavor, smelled wonderful too. I followed another reviewer’s advice and did part coconut milk and part evaporated milk instead of regular milk, and I’m glad I tried those substitutions. However, having never tried mochi before, I didn’t care for the texture. I guess I was expecting the center to have a softer, creamier texture. My mochi was kinda chewy, and I’m not a big fan of chewy desserts, but reading other reviews I guess it’s supposed to be chewy. If you like chewy things and you love coconut, I highly recommend this recipe. It does have a lovely, coconutty flavor. But if you’re like me and hoping for something more the consistency of lemon bars, you might be a little disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Len Travers"
},
"reviewBody": "Came out great, think I’ll add a couple teaspoons of cinnamon and double the vanilla next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Doe"
},
"reviewBody": "I could not find sweet rice flour. I'm not a fan of buying perishables online, especially from the big online super warehouse, because I don't know what conditionsare where it is stored. So I used plain rice flour but added 2 Tablespoons of potato starch. I'm going to make it again once I find the actual ingredients listed. But a native Hawaiian ate it and said it had a very similar taste and consistency to what he remembers back home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JT McAwesomeFace"
},
"reviewBody": "I added a teaspoon of salt because I thought it needed it and I used mochiko 75% / glutinous rice flour 25% because that's all I had. It turned out a little gooey in the center part. I will cover the edges and cook for another 5-10 minutes next time. I still ate the whole tray myself so yeah I loved it regardless! I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Brown"
},
"reviewBody": "Subbed some of the milk for a can of coconut milk and left out the shredded coconut as others have suggested. This would be so good baked as individual servings (silicone muffin cups, etc) because the crunchy edges are amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanie"
},
"reviewBody": "Very good, much denser then I I thought it would be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Ko"
},
"reviewBody": "This is a really good recipe! Used 1 cup of coconut milk and whole milk for the rest. This seems super modifiable so I’m excited to try it with others ingredients, though the coconut gave it an amazing texture and top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saiko"
},
"reviewBody": "I've made this more than once and absolutely love it! Brings me back home in terms of taste. Butter mochi is something that I grew up with in Hawaii but is not readily available up here in the mainland. So...gotta make 'em myself!\n\nI have used the \"evaporated milk\" variation and came out with similar results. Either way worked really well for what I was expecting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Bongco"
},
"reviewBody": "The only thing I would modify is the amount of sugar . 2 1/2 cup was too sweet . I would modify it to 1 1/2 cup next time as the milk, coconut flakes, and rice flour already has sweetness tho them ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Faye"
},
"reviewBody": "This is fantastic. Used 2% milk, because it’s what I had. Baked in glass pan at 325 for 50 mins. Covered edges with foil and baked another 23 mins. I am trying not to eat the whole pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jadedoe"
},
"reviewBody": "So delicious! Big hit with my parents, even my fussy dad. I was so excited to try it I cut a piece straight from the oven. Not the best idea but it was so worth it. My brother ended up doing the same! \n I made this for the Lunar New Year. We don't have Mochiko in Australia and I read some comments saying it was just normal rice flour so I opted using normal rice flour rather than glutinous rice flour. I didn't put foil over it but it still came out good! The top was still a little gooey and had a nice caramalisation. Only used 2 cups of sugar and it's still very sweet! Might have to cut it down to 1 and a half cups but that's down to personal preference.\n Will definitely make it again for a gathering!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Au"
},
"reviewBody": "Made a few changes . Used coconut milk in place of milk and used only 2c. sugar . Added a 1/3 cup more coconut and it was WINNAHz!! Simple, satisfying and a oh so good heavenly dessert! Ono definitely describes this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Turned out delicious! Easy to make. I didn't add the coconut because I love it the traditional way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Martha Dolgner"
},
"reviewBody": "I only put coconut in/on half of it because of the personal preferences of my family. Both halves turned out great. I put aluminum foil over it for the last 15 minutes and when I opened the oven I was shocked to see it had risen over the edge of the pan, but because of the way the edge cooks, it didn't slop over or anything, and it sank back down as it cooled, it was just funny. I refered to it as a baked custard to get my dad to try it and can now say that I have found a type of mochi that he likes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel"
},
"reviewBody": "It came out perfect as I remembered it from back home in Hawaii. Thank you! It's definitely a dessert I will continue to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nori Lee"
},
"reviewBody": "So good! I used 1 can of coconut milk and the rest whole milk to equal 3 cups total. And I baked for 50min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I made this for a memorial service that I attended. Everyone that tried it said it was delicious. This recipe is similar to a recipe that I had made in the past. I would make it again. I sprinkled the remaining shredded coconut on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Davis"
},
"reviewBody": "I prefer to make it like bibinka by substituting the 3 C. fresh milk with 1 can of coconut milk and one can of evaporated coconut milk. Can also sprinkle with brown sugar before baking to have a nice crust on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RyanHB"
},
"reviewBody": "This was really good. In the five minutes after I took it out of the oven, a third of it was already gone and I had to kick everyone out of the kitchen. Made 2/5 of a recipe to try it out and had to use unsweetened coconut instead of the sweetened variety, which worked four our palette. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocolots"
},
"reviewBody": "This is so delicious! Make sure you use glutinous rice flour, not plain rice flour - it's supposed to come out a little gelatinous and chewy (think gummy candy rather than muffin). A lot of reviewers seem to be confused by the texture, complaining it's sticky or too soft, but I think it's because they haven't had butter mocha before (a Hawaiian creation as far as I know). This might also be different than traditional Japanese mochi, which is dryer and stiffer I think. I used a can of coconut milk and a can of evaporated milk instead of the 3c regular milk, and also reduced the sugar to 2c. I made half the recipe in a 7x11\" pan, baked for 50 minutes, then left it in for another 10 minutes after turning off the oven. The middle will look pretty gooey but sets as it cools. Don't overcook it! Next time I plan to bake it in mini muffin pans (more crust, the best part!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Easley"
},
"reviewBody": "Taste great and everything was perfect but next time I'm going to reduce the sugar because that was way too sweet. I'm wondering if you can use almond milk instead of whole milk for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Tarpley"
},
"reviewBody": "I followed some other comments and replaced the 3 cups of whole milk with 1 can of unsweetened coconut milk and 1 can of evaporated milk. I also cut back the sugar by 1/2 cup. The result was very rich but not too sweet. Definitely more delicious the second day. After cutting it into squares, I stored it on the counter in a covered container."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neekko"
},
"reviewBody": "Amazing! Tastes just as I remember. I did have to change the recipe slightly. I have no easy access to Mochiko on this side of the world (Pennsylvania), so instead I used a 1:1 mixture of normal rice flour &amp; potato starch. The resulting texture is pretty much the same. I also used coconut milk as I did not have any whole milk, either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suz"
},
"reviewBody": "It came out amazing! I didn't add the coconut and it was perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nims"
},
"reviewBody": "I followed the recipe and it came out great! The plate was empty before the end of the party! I served this a Luau birthday party along with iced Hawaiian Pineapple tea.\n\nWill make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "micamargarita"
},
"reviewBody": "OMG its so good! And this recipe was so easy. I didnt have any coconut so I left it out. But it was a great simple and tasty dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Buack Jones"
},
"reviewBody": "Wow... liked warm right out of the oven... but I think cooling it or putting in the fridge for a little is much better... Couldn't keep my family's hands out of the pan.. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Ishida"
},
"reviewBody": "Yummy goodness! My family makes these for all of our family get togethers. Very buttery tasting chewy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MaxWildwood"
},
"reviewBody": "Looked beautiful and smelled wonderful, but I ended up with a rubbery, chewy texture. I was looking for plain, non- glutinous rice flour as other reviewers suggested, but I only had one choice of rice flour, and I mistakenly assumed that gluten-free is the same as non-glutinous. It is not! Comparing my result to the other reviews suggests that I unwittingly used glutinous rice flour. I can't be sure, because the package does not specify which type it is. The flavor was so nice that I tried to eat it anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Cedar"
},
"reviewBody": "Ono! I used coconut milk instead of whole milk. LOVE IT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Kasz Willmarth"
},
"reviewBody": "I think I may have overcooked this based on others reviews to cook it longer. It isn't as creamy as I thought it would be but it is good tasting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THE57MOTZ"
},
"reviewBody": "posting review to politely correct another posted Mochiko at least in US *IS* glutenous or sweet rice flour. see the following link:\n\nhttp://www.kodafarms.com/blue-star-mochiko-sweet-rice-flour-serving-suggestions/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna Hopeau"
},
"reviewBody": "I used SOYMILK vanilla flavored and bourbon Vanilla. Also omitted 1/2 cup sugar &amp; added BLUEBERRIES. Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaCoconutGirl"
},
"reviewBody": "Sooo ono!! I rated it 5 stars with the changes I made. I read previous reviews and decided to do the following changes: 1. Substituted 1x 13.5oz can of coconut milk for 13.5oz of whole milk 2. Used only 2 cups of sugar (and it was still pretty sweet because of the added coco flakes) 3. Baked for 50 minutes, added foil around edges to prevent them from burning, and baked an additional 25 minutes to brown the middle (we loved the crusty parts!). Super simple and super easy but so good!! Just wanted to point out too that although this may seem like the Filipino Bibingka, their difference is that Bibingka is made with glutinous rice flour resulting in a stickier kankanun (dessert), while butter mochi is made with plain rice flour (mochiko), yielding a bready, cake-like dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuvM"
},
"reviewBody": "Aunty's favorite! Make a coconut/no milk version: Replace butter with coconut oil, milk with coconut milk, and use turbinado sugar (less sweet)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allurose"
},
"reviewBody": "oh my god. this recipe is AMAZING. I first tried hawaiian mochi at my friend's graduation party last summer and since then I've been craving it like nothing else. I finally decided to make some myself and my mom tried it for the first time and pretty much hates me now because of how good it is. I'll definitely be making this again! ? I followed the recipe almost completely, but I did subtract one egg and opted out on the coconut, just as a personal preference. :) Thank you so much for this recipe, you're a livesaver!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ym1022"
},
"reviewBody": "So tasty. I used coconut milk instead of milk and came out so good, more coconutty. I'll make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa4Dennis"
},
"reviewBody": "I've had better, but this is good, just not great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inez Olive"
},
"reviewBody": "The best I made!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tardis"
},
"reviewBody": "OMG, Melts in the Mouth. Follow the directions like they say and you'll have a truely fantastic desert. I'm lucky I can get Mochiko easy here on Kauai, Hawaii. Made it and it blew me away how good it was. Dont' wait, Make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marlyn"
},
"reviewBody": "I love this recipe and I've made it several times. I've replaced regular eggs for egg beaters and the milk with Silk Coconut milk, which cuts back on the fat a little and I'm sure you can also cut back the sugar if you intend to put carmalized brown sugar on top. Last time I made it, I added jack fruit, just cut up and mix, do not include the liquid from the jack fruit. Next time, I will add the pandan flavor which is a popular Filipino flavoring with alot of the desserts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry A. Garrison"
},
"reviewBody": "I have not tried this recipe YET...but have been searching for YEARS for one for Bibingka! FINALLY...someone, in their reviews (Sherwin907) mentioned that it was like that. I cannot wait to try this recipe...even with the changes that Sherwin made. Bibingka is a WONDERFUL dessert, one which I have had many times on the Big Island of Hawaii. But could never get anybody to give me the recipe. Can't lose with this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "Fantastic Recipe! Have had mochi many times here in Hawaii, and this at least stands up to and often squashes anything I can buy. Great stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AggieB"
},
"reviewBody": "This recipe was so ONO!! I only had 1 cup of 1% milk on hand so I used 2 cups of almond milk for the rest. I was worried this may change the results but I tried it when it came it out of the oven and again the next morning and still its so delish! I also only used 2 cups of sugar per other reviews. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LKS"
},
"reviewBody": "Tastes just like you buy in Hawaii. I'll half the recipe next time because it makes a lot and it's very filling. Tastes even better the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terrilicious"
},
"reviewBody": "Wow! I apprehensively made this because my daughter begged. The mochi I have previously tasted at parties was severely lacking, and it was the only reference I had, so I was not excited to say the least. This stuff is REALLY GOOD! I also used coconut milk and milk as others suggested. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CODYSMOM3"
},
"reviewBody": "Excellent. I didn't have whole milk, so I used two cans of coconut milk instead. Mine cooked for 1 hour and 20 minutes, which is a bit longer than it took for the cake to disappear at work the next day! Rave reviews all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "Substituted 1 1/2 cup Agave nectar for sugar, reduced temp to 325 - came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alohalani"
},
"reviewBody": "Very, very good! I used 2 cups of whole milk and 1 cup coconut milk. Love it and it takes me back home to Hawaii!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malia Brinkley"
},
"reviewBody": "Holy moley!! I don't know what those of you who didn't like it were doing, but... I think these came out GREAT. I did follow one reviewers advice and used coconut milk and evaporated milk in place of the whole milk. But, I use a whole (12 oz.) can of coconut milk, and only 1/2 cup of evaporated milk. I thought 2 1/2 cups of sugar would've been too much, but it really isn't; this butter mochi is not too sweet at all!! I probably could've baked it a little longer, but I think that's just a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theamazingamber"
},
"reviewBody": "The dense chewy texture and delicate sweetness of this butter mochi is absolutely ADDICTING!! I used this recipe for my first time ever making any type of mochi. I did make a couple substitutions/omissions: I left out the shredded coconut, and in place of whole milk, I poured a can of coconut milk into a large fluid measuring cup and added enough evaporated milk to make a total of 3 cups (I bought a 12oz can of evap. milk and had a little left over). Also, I increased the baking powder to 1 1/2 tsp (I noticed a lot of butter mochi recipes call for 1 TBSP of powder--I dont know if the extra 1/2 tsp made any difference, but it's what I did)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E M"
},
"reviewBody": "AMAZING! I love mochi and make it at home often. I stumbled across this recipe and had to try it. It's perfect. I was a bit worried when it started looking mealy at the top(not smooth like typical mochi) with butter bubbling around the edges. I guess this is the desired effect. Chewy, crispy... Use Mochiko or glutenous rice flour ONLY. I see people saying it's the same as normal rice flour and it is NOT. They are made from two different kinds of rice. Mochiko is made from sticky rice whereas regular rice flour is made from regular rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AGEHLKE"
},
"reviewBody": "My family LOVES the custard mochi that I normally make, but for the last party I wanted to try butter mochai and couldn't find one in any of my local (Hawaii) cookbooks. (Hard to believe!) Could hardly believe I found it here!\n\nI baked this exactly as stated and found that the time was a bit too long. I should have heeded AZURE_PHOENIX's advice to bake only 50 minutes because the mochi was a bit too stiff. It's suppose to be soft and a bit on the sticky side. For those confused about the Mochiko, we use Koda's Mochiko since that's what always goes on sale here. The box states the ingredient as SHORT GRAIN SWEET RICE so I wouldn't use anything that is different from that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "boomocrash"
},
"reviewBody": "I accidentally added butter first and it wasn't completely melted. It solidified because of the cold milk and eggs. After baking it it bubbled up and expanded weirdly for some reason. I'm pretty sure this was all my mistake and that it would've turned out better if I completely melted the butter and added it last. Nonetheless, it tasted pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Weiye"
},
"reviewBody": "Great recipe - these things are super addictive. I searched and found a few different coconut mochi recipes and this one is so far the best. I found that it's ultimately inconsequential if you use less butter or eggs than called here, but the amount of milk (in this case I used coconut milk instead of whole) does matter. Also, I didn't mix in the coconut flakes, only sprinkled them on top so that I still get the smooth texture within. All in all a great success."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angelina"
},
"reviewBody": "this is a great recipe, thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "This recipe was great! I looked at a bunch of butter mochi recipes online and decided to try a modified version of this one. I followed one reviewer's suggestion of using one can of coconut milk and one can of evaporated milk instead of the whole milk. I also cut the sugar by 1/4 cup. It was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrggmom"
},
"reviewBody": "Delish! I did use 1 can coconut milk and the rest whole milk but followed the rest of the recipe! My daughter and I loved it! Even my husband liked it and he is not a mochi fan! I did not refrigerate it cause I was afraid it would get hard. It kept well but it did lose the crispiness of the topping by the next day. It didn't matter to me though...I still thought it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Sobieski"
},
"reviewBody": "Good, but can be made low calorie using Splenda"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoretoBelinda Villegas"
},
"reviewBody": "I just wanted to say that if you are looking for Mochiko flour, hopefully in the mainland you canfins them at Asians store. This is another great recipe and thanks for sharing a recipe that alot of people from Hawaii like. Enjoy everyone and keep on sending those great recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "khrys"
},
"reviewBody": "I made this as written except for using first press coconut milk in place of half of the milk stated and topping with additional shredded coconut in the last 15 minutes of baking (so it could toast). \n\nI wasn't sure how to store it, so I put it in the refrigerator. When served cold it tasted good, but had a very odd texture. I found that keeping the mochi out at room temperature produced a slightly more cake-like texture that my family adored and readily devoured. Definitely a keeper. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eguido"
},
"reviewBody": "I'm used to the white red bean filled mochi so I didn't know what to expect from this recipe. It turned out pretty good! It's much easier to make, but it's a little greasy. Since I didn't know what to expect, I'd halved the recipe and baked it in 8x8 sq glass baking dish. But I forgot to halve the sugar and baking powder and it still turn out well. I'd modified the ingredients for the half recipe: 2 C glutinous rice powder &amp; 3 eggs, skipped the coconut flakes, 3/4 C dextrose, 3/4 C brown sugar. I'd baked a little longer so it was pretty brown but not burnt (didn't hear the timer go off), and the edges were chewy but that's the best part. I will make the full recipe next time. Dextrose is much less sweet as table sugar&gt; I'm trying to avoid fructose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennleegordon"
},
"reviewBody": "easy to make, easy to eat. It's fun, it's squisy, it's custardy, it's delicious! Not everyone likes the jelly texture of mochi, of course, but if you do, this is wonderful. I did use a can of coconut milk and made up the rest with skim milk, in place of the whole milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MissNikki"
},
"reviewBody": "This came out weird. I used glutinous rice flour (as stated in the recipe - 1st ingredient) - I couldn't find mochiko flour itself and thought they were the same thing? It came out rubbery and slightly sticky. Is that normal? I had a choice of rice flour or glutenous rice flour at the store and now I wonder if I made the wrong choice? I'm totally confused at this point and since I've never had mochi, I have no idea if this worked well or not. As for flavor, it's okay but not super flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chiquitabanana"
},
"reviewBody": "wow! chewy and delicious. i used less sugar (2 cups), unsweetened coconut, and 4 eggs instead of 5 based on reviews -- not sure how this changes the texture compared to the original recipe. soooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EXNCALGAL"
},
"reviewBody": "Sorry, I didn't make the original recipe so the 5 stars is for the following modification. I used 1 can coconut milk and added 2% milk to equal a total of 3 cups, 2 t. vanilla and omitted the flaked coconut since I have family members that don't like it. It came out great! Very, very dense, as mochi is, and rich so cut into small squares. Has a buttery taste with very subtle coconut flavor. Parts of the mochi may puff up when baking but it evenly flattens when cool. Baked for 50 minutes, turned off oven and left in for another 10 minutes. Made day before and left out unrefrigerated before serving. Was concerned about the 5 eggs but it did not taste \"eggie\" at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzukumi"
},
"reviewBody": "We loved the texture and the flavor! Reduced sugar and used light coconut milk &amp; fat free milk. I didn't add coconut. It was so yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaymie Sanchez"
},
"reviewBody": "I have made this recipe for years!! For different flavors I subsitute the coconut flakes with other ingredients ie: pumpkin, sweet potato, banana's, and taro. Its all ways fun to experiment!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyMaganda"
},
"reviewBody": "I had to make this for my Japanese class as an extra credit assignment. My taste tester = my mom (Who is very judgmental on certain foods/desserts) and her score...SHE LOVED IT!!! I used EVERYTHING /direction as noted...except I used Fat Free Milk instead of Whole Milk...It's DELICIOUS!!! Thank you for the recipe! I will post pics soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LADYDRAKE"
},
"reviewBody": "I may have used more rice flour than intended but this was a hit! Not too sweet, yummy coconut flavor. I wouldn't have minded a stronger coconut flavor but for those who aren't big on coconut, this works well too. I did as others suggested and used a can of coconut milk (equaled 2 cups) and 1 cup of whole milk. I made the mistake of forgetting about it in the oven!! I was upstairs and didn't hear the timer. It was a golden brown on top and it tasted great the same evening and even better the next day. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skorpio2180"
},
"reviewBody": "I followed the advice of another reviewer and skipped out on the toasted coconut and milk. Replaced both with coconut milk and evaporated milk (one regular can each) and OMG, it came out amazing and doubles the recipe (so have 2 brownie pans handy!). Thank you Saxony!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "So, I've grown up with this butter mochi recipe. This was a staple growing up in Hawai'i. My mom taught me the recipe when I was little. I however, use 3 cups of coconut milk and only put in 1/2 cup of coconut. So ono it's crazy! Do not refridgerate like some people do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luckysale"
},
"reviewBody": "This is not really mochi but it IS almost the same cake my mom made for me as a kid so great memories. She is Chinese so this is a staple. I followed everything is the recipe but used a can of coconut milk (per mom's recipe/reviews) which yields about 2C &amp; 1C milk. Turned out perfect golden brown crisp top (puffed up, flattens as it cools) &amp; chewy. Cooked for 1hr as noted but I did open 3X to check &amp; eyeballed. Thanks for this trip down memory lane. Yes, mochiko is GLUTINIOUS rice flour! Google it (another reviewer said it was not!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dan75"
},
"reviewBody": "This was SOOOOO good! It didn't have much flavor at first, but when you let it sit for a day or two, the flavor really comes out. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tahitian4rmj"
},
"reviewBody": "Yummy! I also tried a brown sugar topping to coat the top and broiled it for a few for a little carmelization. Yummy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimnelson09"
},
"reviewBody": "Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Amazing! I followed the recipe exactly and it turned out soooo good! The edges got a little crispy, but thats the best part! I love how the coconut rises to the top and makes a nice crispy topping. Will definitely make this again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Lea"
},
"reviewBody": "This recipe is great. Everyone who tried it loved it (Japanese family). Mochi is dense and chewy. I cooked the recipe till toasty brown, we love eating the edges. I cut back on the sugar to 2 cups. I divided into 2 pans, doubling the topping. Definitely a keeper. My nephew had to return to the house at midnight to have some more. I gave some to a girlfriend and her son took it to his room and wouldn't share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "frugal_losangeles"
},
"reviewBody": "Made this for Christmas and my guests loved it. I packaged some up for friends as gifts. Total winner, especially because it's not something you can just purchase ready made anywhere. I was worried because the batter is so runny, but it baked up just fine. Oh, I used 2 cups instead of 2.5 cups of sugar and it was still sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "zhou"
},
"reviewBody": "This tasted okay, but won't make it again. It's just my taste. I love mochi, but butter mochi isn't for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thebaileyohana"
},
"reviewBody": "I followed the recipe the only change I made was no coconut. I've never had coconut on my butter mochi and didn't want any on it. So far from what I've tasted its pretty yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jorlan2000"
},
"reviewBody": "Made this as a Japanese dish for my son's class presentation. Other other mom's RAVED about how good it was!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lan"
},
"reviewBody": "This was a really good recipe. It was great the first time I made it! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MattOlay V-H"
},
"reviewBody": "Will not make it again, though, it does have potentials. I also followed other reviewers to cover loosely with foil but it still didn't cook thoroughly and had burnt sides."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherrrylll"
},
"reviewBody": "I have made this over and over for my Filipino family and friends as our \"bibingka\". I substitute some of the milk (I use skim) with a can of coconut milk and some of the white sugar with brown sugar. I've been asked to make this addictive snack many times over. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gladice"
},
"reviewBody": "This was great! I was initially thinking that I would use coconut milk, but didn't get a chance. I didn't change a thing about this receipe. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VIVNIDHI"
},
"reviewBody": "Used 2 eggs and 2 egg whites. This recipe came as super rescuer for the rice pancake batter (from this site and it was really a bad recipe) I tasted mochi for the first time so no idea of taste, but it is just delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My4boys"
},
"reviewBody": "Wow, this was really a neat recipe. I have never heard of anything like this but my teenager wanted me to find some recipes with coconut..so, here was one of them. I had a small gathering here this evening and everyone wanted to bring some home. The texture is completely different than what I expected. I expected more of a custard type thing but my neighbor tells me the texture comes from the mochiko flour. One of my friends also suggested that this would taste great with a lemon base versus coconut. ***EDIT*** I have since tried this with chocolate and it tastes wonderful. I used 4 tbs of cocoa powder in the mix. Also good with chocolate chips baked on top in the last 10 minutes of cooking.****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My4boys"
},
"reviewBody": "Wow, this was really a neat recipe. I have never heard of anything like this but my teenager wanted me to find some recipes with coconut..so, here was one of them. I had a small gathering here this evening and everyone wanted to bring some home. The texture is completely different than what I expected. I expected more of a custard type thing but my neighbor tells me the texture comes from the mochiko flour. One of my friends also suggested that this would taste great with a lemon base versus coconut. ***EDIT*** I have since tried this with chocolate and it tastes wonderful. I used 4 tbs of cocoa powder in the mix. Also good with chocolate chips baked on top in the last 10 minutes of cooking.****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The was so tasty! I never knew this type of dessert existed. My friend tried it and thought it was a winner. I took the advice of previous reviewers and baked it for 50 mins. at 350 then loosely covered with aluminum foil and baked for 20 mins. and turned off the oven for the last 5 mins. I used one can of coconut milk and the rest whole milk. I wanted a smooth texture so I omitted the coconut flakes. I'm wondering how it would taste if raisins were added. It was easy to find Mochiko at H Mart, an Asian grocery store. I highly recommend buying an oven thermometer. My oven takes a while before it reaches the correct temperature."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/84857/ono-butter-mochi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/79/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/84857/ono-butter-mochi/",
"name": "Ono Butter Mochi"
}
}
]
}
}
, "about": [
]
}
]