				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Orange Almond Biscotti II"
,"datePublished": "1998-11-23T13:07:07.000-05:00"
,"dateModified": "2022-07-14T16:19:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karen"
,"url": "https://www.allrecipes.com/cook/24324895"
}
]
,"description": "These biscotti are very low in fat but they are delicious. You can substitute the almonds with 3/4 cup cranberries."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/PfgEioG-6mCWTVQMe2-VkCEADzs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1351865-4f3090fb6df741868798e09cc6dca1b3.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Orange Almond Biscotti II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "102"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "219 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "99 mg"
,"sugarContent": "21 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2.25 cups all-purpose flour",
"1.25 cups white sugar",
"1 pinch salt",
"2 teaspoons baking powder",
"0.5 cup sliced almonds",
"1 tablespoon orange zest",
"3 egg, beaten",
"1 tablespoon vegetable oil",
"0.25 teaspoon almond extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, stir together flour, sugar, baking powder, salt, almonds, and orange zest. Make a well in the center and add the eggs oil, and almond extract. Stir or mix by hand until the mixture forms a ball."
} ,{
"@type": "HowToStep"
,"text": "Separate dough into 2 pieces and roll each one into a log about 8 inches long. Place logs on prepared baking sheet and flatten so they are about 3/4 inch thick. Bake in preheated oven for 20 to 25 minutes. Cool slightly, and remove from baking sheets. Slice diagonally into 1/2 inch slices with a serrated knife. Set cookies on side back onto the cookie sheet and bake for 10 to 15 more minutes, turning over after half of the time. Finished cookies should be hard and crunchy."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Henderson"
},
"reviewBody": "I have been making biscotti for years but usually stick to my old basic almond biscotti. I am trying new recipes so that I have a variety for my son's wedding \"pot luck dessert\" table. I always make a double batch because I use biscotti baking pans (and two batches are just as easy as one!). I did so with this recipe along with following reviews to add more extract and zest. When I use the pans, I have to adjust the baking time. These turned out very nice and the drizzle of chocolate just adds a nice touch. They are a bit crispier than I am accustomed to which can be a result of the adjusted baking time but will also stand up to traditional \"dunking\". I would make again and maybe try and orange drizzle. Enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLPDX"
},
"reviewBody": "Nice! I baked at 325F to dry out dough more and decrease browning. Also used less sugar as I don't care for things too sweet. You can also substitute Swerve sweetener or other artificial sweetener.\nRecommend upping almond extract to at least 1 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J E"
},
"reviewBody": "This is a very sticky dough. Instead of rolling use wet hands to make a log then pat the log flatter. Rewet your hands as needed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle C"
},
"reviewBody": "Definitely my new \"go to\" treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamma mio"
},
"reviewBody": "Love them orange and almonds just yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emily"
},
"reviewBody": "So taking in everyone's reviews, this is how I made it and it wasn't too difficult. \nFirst, use parchment paper to roll and bake. I took out almonds and added pecans and cranberries plus I used the same amount of orange extract as the almond extract. For the first bake I set the oven to 320 and while cutting the biscotti, increasing the temp to 350 and baked it for 12 min. They came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginni"
},
"reviewBody": "Easy recipe to follow and delicious biscotti. I dipped one end of the finished biscotti into a semi sweet chocolate glaze with a bit of orange extract. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jo Who Cooks"
},
"reviewBody": "Very wet dough and difficult to work with even with wet hands. I used parchment paper. Dough spread out a bit too much for my liking. Flavor in the end was good but I do prefer another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgdance678"
},
"reviewBody": "I have made a lot of different biscotti recipes, but this is one of the best! I like a little stronger almond taste, so I generally add about 1/2tsp of almond extract and one full tbsp. of orange zest. I also use this recipe as a base for when I want to be creative, but nothing beats the orange/almond combo with chocolate chips intermixed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Savage"
},
"reviewBody": "I made this the first time and found shape too big and it failed to cook through on the first bake. Also I agree with the reviewer that said the biscotti tasted eggy. I made the following changes with great success:\nI substituted one of the eggs for irish cream liqueur (Baileys)\nI made 4 thinner and slightly shorter logs and this made for a more evenly baked and preferable sizes biscotti.\nIncreased almond extract to 1/2 teaspoon . \nWill definitely make these again with the changes I have made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MaeveO"
},
"reviewBody": "Lovely flavour. More almond than orange, though. Also found I had to bake at each stage a bit longer to get desired result. But still my favourite (of my admittedly limited) biscotti repitoire to date."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rusty"
},
"reviewBody": "really enjoyed this recipe! came out crunchy like their supposed to be. i made modifications to my recipe i used all organic ingredients and raw almonds light spelt flour but less cause its more dense then regular floor, one full orange for the zest, whipped up pasture raised eggs and organic coconut oil instead of vegetable oil, heaping 1/4 cup of organic cane sugar it was amazing but i would probably make three loaves next time cause the two loaves were really big and cracked on the first bake. it was very difficult to work the dough it got very stiff and i couldn't get all the flour folded in so had to add some milk to get it all together. will definitely make them again great recipe thanks karen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ardys"
},
"reviewBody": "Wonderful flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JustyJ14"
},
"reviewBody": "My first try at this I was tempted to handle it like bread dough, but it's too sticky. This batch was okay, but needed a tad bit more zest and almond extract. With my second batch, I divided into 3 loaves, added more zest and almond extract, plus a tiny bit of vanilla. I also used foil with non stick spray to help me shape the loaves. Finally, they are cooking at a lower temp for a longer time. They spread more than I remember the last batch doing, so be sure to allow for this. Took a bit longer on the second toast, but were very tasty! Drizzle with chocolate, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda P"
},
"reviewBody": "I had some trouble with the dough being really sticky. I might add a tiny bit more flour next time. But I made a simple powdered sugar and milk glaze and added some more almond flavor to that. It was really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim C."
},
"reviewBody": "Delicious! But do use wet hands to shape the logs...it will be easier because the dough is so gooey. Also, I did lower the heat to 320 F and baked for 45 minutes the first time through. Then, I baked 8 minutes on each side the second time through...they cooked much better this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "Delicious and full proof!\nWill definetly make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel T"
},
"reviewBody": "came out really well; i increased the almond extract to 1 tsp, but still felt it could have done with more. it could also have done with less sugar so i will probably decrease the sugar to 1 cup next time. all in all a really fabulous recipe, and honestly i'm just nitpicking! i couldn't stop myself from eating them so i just gave them all away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NachoMama"
},
"reviewBody": "Use 1/4 cup butter for \"crunch\" instead of hardness; 2 TBSP orange peel; 2 tsp vanilla; Bake 325 until firm to the touch (30-45 min); cool 15 min; slice and put in 200 deg. oven for 1 hour, turnign after 30 min; turn oven off and let sit a couple of hours til cool"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VISTAWAY1805"
},
"reviewBody": "Big Fan! I didn't have almonds, so I threw in some raisins. It was fantastic! I'm going to make again, with almonds, then cranberries...oh, I bet some blueberries would be good too! I'll stop before I get too crazy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baker75463"
},
"reviewBody": "I made these as directed and found them to be a little bland, but this is definitely a good base to experiment with different flavors. I will make these again with different nuts and fruits and more extract or vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BISCOTTIJOHN"
},
"reviewBody": "Superb taste that I have enhanced by adding a second tablespoon of orange zest, 1/4 teaspoon of orange extract, and 3/4 cup mixture of craisins, chopped dried mango, candied ginger, and floured Pennant candied (fruitcake) fruit. Cake is crisp yet chewy. Rave reviews but no complaints yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carla Martz Cooley"
},
"reviewBody": "Good recipe. I added some extra almond extract like others suggested, but still wasn't enough. Next time will try with anise as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis"
},
"reviewBody": "Perfect! I use dried cranberries and usually leave out the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "I've made lots of different biscotti but this one didn't quite work for me. I loved the orange flavor with the almond but the egg flavor was pretty prominent. Like another reviewer said, I think there are better recipes out there. I always use wet hands to form the loaves and these were no exception. I baked on parchment paper but they spread out very much (side to side) and were only about 1 inch thick. Other biscotti turn out much taller and more of the shape I'm used to. Guess I'll just stick with my tried and true recipe here on AR."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke"
},
"reviewBody": "I'm having a hard time rating this biscotti...it's actually okay but I probably won't make it again. Unfortunately, I can't decide what exactly is bothering me about the flavor. I can say that it was very easy to prepare. One of my logs was ultimately bigger than the other and therefore I discovered, while slicing it, that the dough was still raw. I cooked those slices a bit longer than the others and they were absolutely fine in the end. I also like the consistancy of this biscotti. It's hard, but not so hard that it's tearing up your palate. Next time I'll probably try it without the orange and with more almond extract. Anyhow, happy baking!\nUpdate-I made this again but I replaced the almonds and orange with approx 3/4 c. coconut and 1 tsp of vanilla. I like them more than the first batch, but I think I know the underlying problem now. The background tastes like egg. I'm going to search for a recipe with fewer eggs, which is a shame because the consistancy of these are very nice - hard but once they're dipped they soften perfectly. So the search continues..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Devin"
},
"reviewBody": "I made these for an open house my mo was doing and everyone raved and had several people ask for the recipe. I decreased the sugar to 1 cup and took out 1/4 cup of almonds and added 1/2 cup of chopped cranberries and just the tiniest squeeze of lemon juice to help moisten the dough a little bit. It was very sticky and had to do as others and just kind of shape it with a spatula, but the finished product was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa H"
},
"reviewBody": "Loved the recipe, I added an extra egg, gave it just enough more moisture! YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Zelle"
},
"reviewBody": "This was the best biscotti I have ever had! I used 2 teaspoons of anise extract, and added diced candied green cherries. I used the suggestion made to reduce the temperature to 260F for the first baking, and then added a few minutes to the final baking phase. Crispy, wonderful aroma and taste, and gorgeous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ursula"
},
"reviewBody": "Just ok. Made these and another batch and there is no comparison that the other one was so much better. these were too hard/crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "martese houle"
},
"reviewBody": "oh my gosh these are wonderful. I used 2 full tablespoons of orange peel because I love the orange flavour and it isn't too strong at all. I also made a quick glaze of 2 tbsp of orange juice, 1/4 tsp almond extract and enough icing sugar to the right consistency and drizzled it on top. These are going into the Christmas baskets for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROO911"
},
"reviewBody": "these were awesome.... as i do not like almonds i omitted the almonds and almond extract... i used vanilla extract and added some mini mini red and green chocolate chips... and i think when i shaped the rolls there were a little thick in the middle.. so a little soft, but one cooked and baked a 2nd time, i baked a few extra mins on each side... pretty color and tasted outstanding... thank you again another wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Qut al Butun"
},
"reviewBody": "Great recipe. I make these all the time! I found that using parchment paper prevents the loaf from spreading out so much--its easier cleanup too. I set the oven temperature lower at 325 degrees and baked for 25-30 minutes for first baking. I was able to make 28 1in thick x 5in long biscotti with this recipe. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Louise Whitlow"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loriva"
},
"reviewBody": "Fantastic and very easy recipe. I added the cranberries *with* the almonds and I loved the occasional chewy part with the crunch of the biscotti and the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi"
},
"reviewBody": "Wonderful! These are so good AND easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NegiMissy"
},
"reviewBody": "I made this for my boyfriend. He fed it to his family and they begged me for more! I used a lot of comments to make this mouthwatering food. I added and handful of white chocolate chips into the dough as well as putting in a total of 2 Tbsp of orange zest &amp; 1/2 tsp of almond extract. As other reviewers commented, yes it is a sticky dough! Instead of rolling it, I wet my hands and covered my hands with a thin layer of flour and formed it on the greased/floured pan. I took the advice of another reviewer and baked it at 320 degrees. Then as a final topping, I added a nice orange glaze of orange juice, orange zest, and confectioner's sugar to one side of the biscotti. I even covered them and ate them a few days later to let them stale up a little bit, and they were still perfect! 5 stars all around for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catfish"
},
"reviewBody": "Wonderful biscotti! I added a little orange juice to boost the flavor and subsituted vanilla for the almond extract. I also used 1/2 a cup of Splenda brown sugar and 1/4 cup of Splenda in place of the granulated sugar and they turned out beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ali"
},
"reviewBody": "Orange-almond AND cranberries - delicious :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie S"
},
"reviewBody": "I made this as a Christmas gift for my co-workers and they loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "The dough is really gooey. It's easier to just shape it on the cooking sheet. Spread it like PB. I ended up waiting on one log and the dough wasn't as sticky anymore. Use only one log per baking sheet because the dough spreads a lot. \nBake only the minimum time listed so it doesn't become too hard by the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HungryLobstah13"
},
"reviewBody": "making this right now. so far so good. dough tasted great! if its too sticky - sprinkle some flour on your hands and board. you do need fairly large baking sheet because this recipe makes A LOT OF biscotti! next time i may dip it in chocolate for final step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ewalky"
},
"reviewBody": "This was really good. I used whole almonds, but that's just my personal preference. I also added dried cranberries. Very nice. It's important to slice this with a serrated blade, otherwise you may have some crumbly action. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRANEY"
},
"reviewBody": "These were great! I baked on parchment paper - easy! As another person suggested, I baked for 25 minutes, then 6 minutes on each side. Tip: if they start to crumble when slicing, they haven't cooled enough. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KrsnaKrsna"
},
"reviewBody": "Not bad! My first attempt at biscotti and really tired of the overly sweet stuff that's out there. I added some nuts and used less sugar. Cooked product lasted weeks and even my son (with severe Crohn's disease) could eat these! Try 'em, you'll like 'em!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmelee"
},
"reviewBody": "Thank you for this great recipe! I just used 1 cup of sugar and that was sweet enough for me but I don't think another quarter cup would hurt. Next time I think I will add dried cranberries and/or white chocolate chips along with the almonds. I will also divide the dough into 3 logs as the biscotti turned out to be pretty big."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruthie Aase"
},
"reviewBody": "This biscotti was wonderful! My whole family loved it as well as my friends. I used half splenda/ half sugar and they turned out great. I also put in about a teaspoon of vanilla instead of the almond (by mistake) and they were still great. I'm thinking of making them with less sugar next time to because they were plenty sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nilly"
},
"reviewBody": "very simple, easy recipe, I have made this many times now, and I prefer it to the store bought biscotti. I have added cranberries, white chocolate chip and coconut flakes for a change ( depending on what I have at home)- it always comes out so well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Val"
},
"reviewBody": "These are the best biscotti's I've ever made and the easiest. I did change it a bit and add dried cherries and some lemon peel. Sometimes I add about 1/2 to 1 teaspoon lemon oil. My husband loves these. Can't make enough!! Just expermint and add different things to the base. Worth the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "drodrigues101"
},
"reviewBody": "Very good biscotti!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REBEJ"
},
"reviewBody": "These were really good, definitely the really crunchy kind of biscotti. I thought 1 1/4 cups of sugar sounded like a lot, so I cut it down to 1 cup and kinda wished I hadn’t. It really does need all the sugar. And the dough was pretty sticky, so I found that wetting my hands with water really helped when shaping it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roseann B."
},
"reviewBody": "I love making these for my family and friends. I use whole wheat flour and splenda instead of sugar. I also add 1/3 cup wheat germ and sometimes ground flax seeds. I too have increased the almond flavor to 1 teaspoon. I add applesauce if the dough gets too dry and dip my hands in flour to handle the dough if it is too sticky. There're healthy and delicious and I can't make enough of them. Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa D"
},
"reviewBody": "Well this is the first bicotti recipe i have tried, it was easy, and fairly cheap to make. It was deffinatly cheaped than buying it, and tasted much better. Thanks for sharing I will be keeping this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbi H"
},
"reviewBody": "Excellent! My first try at Biscotti and my family is eating it so fast I will have to double the recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShirleyAnn"
},
"reviewBody": "I have a batch of this recipe on my cooling rack as I type. I used 1 cup of sugar and other than that, followed the recipe exact. Easy to mold and slice. Initially baked for 25 minutes and 6 minutes on each side after slicing. Will dip top half in melted chocolate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ajpense"
},
"reviewBody": "Great but I baked 35min at 300F then sliced. Baked another 10 min on each side at 350F. Once cooled I dipped in melted white choc. Left out the orange flavoring and added extra almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "I followed the advice of a previous reviewer, and baked it longer and cooler, 300f.\n\nI didn't have an orange, so used orange juice. Delicious! \n\nI crushed some almonds and baked them into the top of the loaf for its first bake.\n\nOnce cooled after the second baking, I dipped them into chocolate. These are fantastic with a good strong coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wilco"
},
"reviewBody": "The orange flavor really stuck out to me and tasted very good! I especially loved the combination of that and the almond. I would do nothing to change this recipe. I sampled some while it was still soft and it was just as yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Umm Maryam"
},
"reviewBody": "This was really crunchy and good! I omitted the orange rind as I wanted to try out the plain one first. Next time however I will add the rind inshaAllah. It sure will enhance the flavor. I used cashewnuts instead of almonds too. This is a good and easy recipe. I did not have any problem with the dough like some of reviewers have said before. The dough was just fine although a lil sticky. I greased my hands well and pressed the dough on the baking tray.\n\nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anastasia"
},
"reviewBody": "This biscotti has a wonderful crunch. I used chopped almonds and tossed in some dried cranberries. I also drizzled with white and semi-sweet chocolate with wonderful results. These improve with age so make them a day ahead. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bshantay"
},
"reviewBody": "Just great!!! Everybody loves them! They just taste soooo good and they are very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "XCINNAMONX"
},
"reviewBody": "first attempt at biscotti worked out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHATTAPEACH"
},
"reviewBody": "I'm giving this 5 stars because they turned out awesome, although I did make a couple of modifications. I added almost an extra 1/4 cup flour. I also left out the orange zest and dumped in a little extra almond extract. I love that flavor. They were very hard and crunchy, as biscotti generally are, but they were amazing dipped in a cold glass of milk. I will definitely canonize this recipe into my collection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CATNAP"
},
"reviewBody": "This is fantatic!!!! I made some mistakes when I first made biscotti. It is a sticky dough. It doesn't roll. Don't even try! Just put some parchment paper on your sheet and spoon it on in a three inch by however long section until you get as many of these as it takes. Kind of ice it into a biscotti shape. Bake it and then cut it and then bake it for about 8 more minutes. It is great!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BWOODALL"
},
"reviewBody": "Yum! This was some good biscotti. A key tip on the dough - it must be very cold. I left this outside overnight to chill, afterwards I had very workable dough....and tasty biscotti."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Juling Chao"
},
"reviewBody": "The dough was sticky and gooey and was unable to hold the log shape. I even put it in the fridge for an hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kalice"
},
"reviewBody": "While I liked the consistency of the finished product, I didn't find it to have a good orange flavor even though I added 1 tsp orange extract instead of the almond extract. It's also sweeter than I like. If you want orange biscotti add much more orange zest and orange extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmy"
},
"reviewBody": "This was the first time I made biscotti and it turned out pretty good. My children enjoyed dipping these in hot chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Army_sister71"
},
"reviewBody": "These turned out GREAT!!! I just finished them and we are going to have them for a treat after supper. I took a few nibbles when I was cutting them and my b/f did too and said they were very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Thornton"
},
"reviewBody": "Some of the best biscotti I have ever had! If you like Earl Grey tea please try these with your tea, it is a wonderful complimentary cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGGIE MCGUIRE"
},
"reviewBody": "My family loves biscotti. This one is especially good. Because we are almond and orange nuts, I toasted 3/4 cups of sliced almonds and increased the orange zest to 2 Tablespoons. A nice lively flavor! Thanks Karen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used 1 cup of sugar and only 2 eggs with 1 egg white but yet it was so runny &amp; sticky..... wonder why? another complain was that it had an 'eggy' taste despite putting 2 TBSP orange zest.... i'm sure i can find a better recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AlabasterAK"
},
"reviewBody": "Excellent recipe, but cut back on the eggs when making a large batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MISSESRITA"
},
"reviewBody": "Messy, sticky dough. Seems the more I worked with it to form it, the stickier it got! I added dried cranberries and mini chocolate chips. I was looking for a recipe with oil instead of butter (didn't want to run to the store) but I think I'll stick to the butter based one I usually use. These are ok, but not the best I've had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misha"
},
"reviewBody": "Oh so good! This recipe got me hooked on biscotti. I used dried cranberries instead of almonds. I baked the first time for 30 minutes. They got crispy. Very flavorful and coloful cookies. I drizzled white chocolate for decoration. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NANCY"
},
"reviewBody": "The flavor is wonderful but making them is a nightmare! I made this recipe twice (I thought I did it wrong the first time), both times being careful to measure accurately with no modifications. It was so sticky, it was impossible to form a log. I ended up just spreading it out, like peanut butter, into more or less the right shape with a spatula."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We made these in several combinations: orange/almond, lemon/poppyseed-white choc drizzle, spice-choc drizzle, cranberry/almond-white choc drizzle. A huge Christmas basket favorite. We packed in cellophane gift bags and tied with ribbon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "This recipe is great. I've made it a number of times and always with great success. When I've made it with cranberries, I've replaced the almond extract with vanilla. Also, there have been a few times where the dough had been rather dry, and in those instances, I've added the juice of one orange (usually the one I zest for the recipe anyway). Yummy. My husband has requested a copy of this recipe so he can make a batch whenever he has a craving for them (which is often)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rochelle"
},
"reviewBody": "These were a big hit with the family. I couldn't keep them around long enough for me to enjoy too. Great with a cup of tea or coffee. Will definitely make again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dora"
},
"reviewBody": "This was a good recipe but certainly not the best for me. I had to add extra veg oil to keep the dough from separating. I sub splenda for sugar and sub pecans for the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KINGHOUSE"
},
"reviewBody": "Tasty! My family has enjoyed these. I drizzled some melted chocolate chips along one side for a nice effect. Had to bake slightly longer than the recipe indicated to get them crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic biscotti! I recommend baking them at a lower temp (160 degreesC) for 30mins for the first baking, as this ensures the insides dry out thoroughly without the top browning too much. these were so delicious - i added a little more almond extract, some chopped dried apricots and a handful of white chocolate chip and they were wonderful! next time i think i'll try forming the dough into three or four loaves to make smaller biscotti, as two loaves makes each one quite big. this really is a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BBURG_HOKIES"
},
"reviewBody": "This was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely delicious! You need to make this; you will not be disappointed. After they cooled I dipped the tops in melted Bakers-SemiSweet Squares (8 OZ box). I found mixing the dough into a ball on the counter top easier. Also, I had no problem with serrated knife-just sawed across the top,then applied pressure to slice. THIS ONES A KEEPER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettyscone"
},
"reviewBody": "they are absolutely fabulous! i also love to dip them in chocolate too!!! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blue Devil"
},
"reviewBody": "Delicious and quite healthy (each piece is about 4 weight watcher's points). I substituted cashews for the almonds, and vanilla extract for the almond extract. I found the dough to be sticky even after a full day of refrigeration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made with cranberries these are just fantastic. I gave them out for Christmas and everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAM B"
},
"reviewBody": "This is one of the first biscotti's I made and I promptly made two more batches and modified it by adding the cranberries. They were all delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These Biscotti have a wonderful flavor and texture...a perfect lowfat treat."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11524/orange-almond-biscotti-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
"name": "Biscotti Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11524/orange-almond-biscotti-ii/",
"name": "Orange Almond Biscotti II"
}
}
]
}
}
, "about": [
]
}
]