				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Orange Fluff I"
,"datePublished": "1999-08-24T05:58:44.000-04:00"
,"dateModified": "2022-07-14T16:35:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jill Lopez"
,"url": "https://www.allrecipes.com/cook/24322462"
}
]
,"description": "Orange flavored gelatin is stirred into whipped topping and then folded into a bowl of cottage cheese, crushed pineapple and mandarin oranges. Even better when chilled for an hour."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/NtaVhUXSPAJB8bcO6bhP3GH2_IY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3613172-9ac36aa029bc4469b9cc6511e71e85a0.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Orange Fluff I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "200"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "393 kcal"
,"carbohydrateContent": "52 g"
,"cholesterolContent": "9 mg"
,"fiberContent": "1 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "327 mg"
,"sugarContent": "50 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 (11 ounce) cans mandarin oranges, drained",
"1 (15 ounce) can crushed pineapple",
"1 pound cottage cheese",
"2 (3 ounce) packages orange flavored Jell-O® mix",
"1 (16 ounce) package frozen whipped topping, thawed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine the well drained oranges and pineapple in a large bowl and mix together with the cottage cheese. Add the dry orange flavored gelatin powder and stir until well blended. Fold in the thawed frozen whipped topping and refrigerate for at least one hour."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Augusta"
},
"reviewBody": "only used half the container of Cool whip and it still turned out sweet and creamy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "This is very good but it is a lot and it could be better. As someone said before use only one 8oz container of whipped cream. Then some ideas to try might be add shredded coconut, or crushed pistachios. It’s good as is but I like more orange flavor so I should have read the reviews before I went shopping. Too much whipped cream cuts the orange flavor. I remember this being an inexpensive dish when I was young. Not so anymore."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke Winston-Berwald"
},
"reviewBody": "DELISH!! Light, fluffy and satisfying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dabeau1"
},
"reviewBody": "Yes. Very addictive. I made it with the mandarin oranges. Taste wad great. Texture was not right. Pureed cottage cheese produces \"fluff.\" Period. Made it again today with fresh strawberries and bananas. Help! Can't stop eating it. Ruining my diet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chey1"
},
"reviewBody": "This was easy and very tasty. Made it for my parents who love Cool Whip fluffy desserts. It was gobbled up quickly by all . Thanks! **Trick to success - start draining the oranges a LONG time in advance, like the night before. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverly Berry Kerr"
},
"reviewBody": "So good. So easy. So fast. So pretty. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t schmidt"
},
"reviewBody": "Drain the cottage cheese to ensure the mixture is not too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry GIvens"
},
"reviewBody": "This was GREAT! Will definitely make it again. Might try 2 cans of Mandarin Oranges in it next time. Took some to a friends family and her boys loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzie Waters"
},
"reviewBody": "I enjoyed the salad. It was not as light and airy as I had had previously. I also made it with sugar free jello. It was very orange but tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diann"
},
"reviewBody": "Loved it and I bought small curd cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amy w"
},
"reviewBody": "This is a fun, tasty little dish. My mother's version uses one box of raspberry Jello, rather than the orange (though I imagine orange would be yummy too). Actually, we refer to the dish as \"The Pink Stuff\" for this reason. She also includes a 1/2 cup- 1 cup or so of small marshmallows. I agree with the other reviews that it is important to drain the fruit well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colleen B."
},
"reviewBody": "Very tasty! This is my first time making the “orange fluff”. I made along side of Watergate salad for my family reunion. I think it’s a good paring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L4S"
},
"reviewBody": "My family has made this for years, we love it! One key item is using the SMALL curd cottage cheese, it makes a huge difference in the texture. We only use 1 - three ounce box of jello."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryan Wilder"
},
"reviewBody": "A little more cool whip than we normally use but always a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "I've been making this for years. It's always a must have for any family holiday. My recipe calls for orange jello, crushed pineapple with juice, cream cheese, cottage cheese, cool whip and pecan pieces. It's lovely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookin' Mama"
},
"reviewBody": "Reminds me of the same thing I had as a kid at potlucks and reunions. I get lots of compliments when I make this. VERY addicting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelley Sykes"
},
"reviewBody": "This was an easy, light and refreshing dish to take along on election day. Everyone that tried it liked it. I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "diane"
},
"reviewBody": "the flavor was ok but it had no jello texture at all. I made it as directed. will make again except I will make jello according to package directions let set up till slightly thickened then add the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "My family loves this. I use one orange and one pineapple 3 oz each for the gelatin. I also like to have the cottage cheese smooth, but if you just dump it all in a bowl and mix, the lumps of the cottage cheese mix in with the lumps of the fruit.\nThis is the only way my husband will eat cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda71"
},
"reviewBody": "The only change I made was omitting the pineapples due to an allergy. Otherwise, it was deliscious! Definitely will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nhan"
},
"reviewBody": "Easy and adaptable! I've made this many, many times. I've altered amounts of fruit, cottage cheese, and coolwhip. I usually use 1 large or 2 small cans of mandarin oranges and a large can of pineapple tidbits -all well drained. Today I used the large 24 oz cottage cheese....I like the added protein. I usually use 1% or fat free. I use 1 box of jello but if it doesn't taste sweet or \"orangey\" enough I add another 1/2 or full box. If I use less cottage cheese, I don't use the whole amount of coolwhip as it is too sweet for me. I don't care for added marshmallows , but have thrown in some halved grapes or some chopped pecans or walnuts. It is so easy to throw together, you can experiment with other flavors of dry jello and fruit combos. Enjoy??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayme Cox Bruce"
},
"reviewBody": "There are certain recipes that taste like childhood. This is one of them. I grew up with this stuff, and where I grew up it was common to see this as part of the spread for holiday celebrations. There is no need to drain the pineapple or cottage cheese. But I don't think you need all the cool whip called for. I use half the amount and it's perfect. And orange fluff is not orange fluff without colored marshmallows! The addition of shredded coconut, and chopped pecans is recommended as well. And if you want to try some real decadence, try adding some torn up angel food cake for a yummy dessert. I use sugar free jello and lite cool whip with great results. I was raised on this, and now I raise my kids on this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ruth Thompson"
},
"reviewBody": "I use ricotta instead of cottage cheese. I don't like the texture the cottage cheese creates,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriMontoya"
},
"reviewBody": "I've made this several times. I use sugar free orange jello, low fat cottage cheese and light cool whip. It's a really light salad to eat and somewhat healthy using the altered recipe I use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colene Marshall"
},
"reviewBody": "I make this for a lot of summer holidays. Reminds me of an orange creamsicle. I use light cool whip and sugar fee jello to cut the fat and calories down a little. I get an extra can of mandarin oranges to make a pretty design on top. I do like this chilled overnight and then the texture is firm and not as gloppy. I also do not take it to potluck dinners when it is very hot because it gets watery when it melts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norma"
},
"reviewBody": "I use small curd cottage cheese and do mash it a bit. I also drain the pineapple and add to the cottage cheese first, then blend in the orange gelatin along with the drained mandarin oranges then fold in the whipped topping with a half bag of mini marshmallows. The marshmallows puff up and add another dimension to the fluff...ummm good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebornCool"
},
"reviewBody": "Didn't change a thing and it came out perfectly! Sweet, as a dessert should be, and delicious. So quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie B."
},
"reviewBody": "Reminds me of my grandmother's orange salad she made around the holidays. I make it exactly as written. Very good stuff! I have also added a couple cups of mini marshmallows to it and that was also good. Either way this is a really yummy dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria Johnston"
},
"reviewBody": "We've had this salad every holiday! I love it. I've also used raspberry jello with fresh and frozen raspberries. So good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marguerite MacDonald"
},
"reviewBody": "I was so hyped to try this recipe and only give it two stars. The cottage cheese texture did not fit in with this recipe. The rest of the ingredients had a smooth texture and eating this really disappointed me and my family. Next time I will try sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan C D"
},
"reviewBody": "Love love love! Just like Mom's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetSuzee"
},
"reviewBody": "Fell in love with orange fluff as a kid when my grandmother made it for us! Kids usually love it. I don't always use an entire container of cottage cheese and I often will use extra cool whip and I always drain the crushed pineapple. I also use the sugar free jello sometimes. You can modify this to taste and no matter what, it is always yummy. Great as a summer side dish, but we enjoy it year round."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "For this recipe put the cottage cheese in the blender and blend until smooth then add the dry jello, blend until dissolved, about a minute. Mix in the whip cream then the oranges. I don't use pineapple but add at the end if you do. This is rich and smooth and tastes like orange sherbet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cnien"
},
"reviewBody": "It didnt specify large curd cottage cheese so I used small curd and it felt like gravel on your tongue. It also was way too stiff. It should have called for UNDRAINED fruit. The jello needed some liquid, which would make the salad a much nicer consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chelmarsie"
},
"reviewBody": "I have been making this recipe for many years, didn't know it was actually a recipe on the internet (lol). I mix the dry orange jello (sugar free for my aunt and dad who are diabetic...in a separate container) into the cottage cheese and mix real well first. Then I add the cool whip so it is very smooth, then add the mandarin oranges. Some people love the mini marshmallows in it so I always make sure I bring a bag with me so they can add themselves if they want to (but I never put them in the desert). What a great idea to puree the cottage cheese beforehand (I like cottage cheese by itself, but in this desert I have always thought it a little too chunky myself). Great tip! thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheron"
},
"reviewBody": "The first time I made this salad, I was not too crazy about the texture of the cottage cheese, so I decided to make it differently the next time. I put the cottage cheese in a bowl, along with the dry jello, and beat both together with a hand mixer until the cottage cheese was a smooth consistency. I then added half of the (well drained) mandarine oranges and pineapple and beat those in too, chopping them up into smaller pieces (this helps spread the fruit throughout the jello salad). I took the remaining fruit and chopped the pieces in half and folded them in the jello mixture along with the cool whip. A little bit more work, but worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "donnamj1"
},
"reviewBody": "YES I'VE TRIED IT AND LOVE IT IT IS VERY EASY TO MAKE MY HUSBAND TELLS EVERYONE ABOUT IT. AND I DIDN'T CHANGE ANYTHING IT PERFECT THE WAY IT IS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristyK"
},
"reviewBody": "Trying to recreate a Thanksgiving memory and this one fit the bill. Easy and delicious. Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn C"
},
"reviewBody": "I love this recipe as is. If you dont like the texture of cottage cheese you should sub pudding. But I think just as is is awesome! Very refreshing and not heavy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmy"
},
"reviewBody": "Yum! Quick and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy Bell"
},
"reviewBody": "Even after putting the cottage cheese in my Ninja and pulverising it, this dish still had a \"starchy\" consistency (best way I can describe it). Good start, but now I'm on the lookout for an orange fluff recipe w/o the cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JD562"
},
"reviewBody": "Very easy. I blend the cottage cheese in a blender until smooth and followed the rest of the recipe exactly. I've made it using both 1 pkg and 2 pkgs of orange Jello and there were no left overs nor any complaints. :) I've even added 1/2 of a pkg of cream cheese blended with cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Moon Riding Fences"
},
"reviewBody": "My children love this because it's sweet. I love that I'm getting a little protein and calcium into them, via the cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theallensofbridgeport"
},
"reviewBody": "I love this stuff!!! My mom used to make it when I was a kid! There are some variations to the recipe of this, but this one is the classic and it's awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "winotasta"
},
"reviewBody": "LOL it says to stir until well blended (not put in mixer or blender!). Its not fair to rate this recipe low because people cannot follow directions. Its a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Nielsen Yeagley"
},
"reviewBody": "Yum! I thought I had orange jello, but it turned out all I had was peach. But it still turned out super delicious! I added mini marshmallows for an extra treat for the kids. They loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frisby0"
},
"reviewBody": "Perfect orange fluff! Didn't change a thing, turned out perfect! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Rose"
},
"reviewBody": "This is a thanksgiving tradition in my house. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "malmbr"
},
"reviewBody": "My grandmother has been making this for as long as I can remember. The only changes I've made (to make it more like hers) is to slices up the oranges and drain the pineapple. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vandegrb"
},
"reviewBody": "My kids loved this! It was a nice treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiff"
},
"reviewBody": "I grew up on this salad and love it! It's such a breeze to make and many people enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ladawna"
},
"reviewBody": "Too much orange flavor &amp; the cottage cheese makes it have a weird texture even after putting it in the blender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "I have been making this recipe for a few years. I came up with it on a whim (great minds think alike). I don't use pineapple though, instead I add miniture marshmallows. Yum, yum, yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2ka"
},
"reviewBody": "Loved it! So easy, and a big hit. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolie Hoffman"
},
"reviewBody": "Wonderful, tasty, light desert. I did, however make some changes. I used 1 can of mandarin oranges, 1 can of peaches and 1 can of pineapple tidbits. I drained the fruit and then mashed it with a potato masher. I also pureed the cottage cheese in the blinder. I followed the rest of the recipe and to make it look pretty I topped it with pineapple rings and placed cherries in the center. It looked and tasted wonderful. I will make this again and again and again. A big hit, everyone loved it! Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Potter"
},
"reviewBody": "Ive had this before but this was my first time making it. I substituted raspberry jello and it was very good! Thank you, I have made this twice in the last day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wildflower86"
},
"reviewBody": "This is a great basic recipe. Had I made the recipe as written, I probably would've given it 3 stars due to oversweetness. The changes I made were that I used just 1 (3 oz) package of orange Jello and just 8 oz (not 16 oz) of Light Cool Whip. With the changes, the orange flavor and sweetness were just right and not overpowering. In addition, I added 1/4 cup of unsweetened coconut and 1/3 cup of chopped pecans. I used small curd cottage cheese, and I really smushed the crushed pineapple in order to remove as much juice as possible. Just a note: if you add pecans, wait to add them just before serving, otherwise they'll get kinda soft and lose their crunch. This recipe needs to be finished off within a couple days, otherwise it gets watery. I love it, my husband likes it, and my 2 teens, though they like the flavor, don't like the cottage cheese. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PINKGRRL"
},
"reviewBody": "My grandmother has been making this for years. A few tricks: use small curd cottage cheese and ALWAYS make it the night before and let it sit. We have it every holiday or get together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaina"
},
"reviewBody": "Very quick and easy, next time I might add more fruit,but great as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana1963"
},
"reviewBody": "This was very good. I made it for a family bbque and everyone loved it. I did put the cottage cheese through a blender first and squeezed all the juice from the oranges and pineapple. It withstood the ninety degree heat. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LANDERS"
},
"reviewBody": "This is so good I did not change a thing. I took it to a potluck and came home with a empty dish, everyone wanted the recipe. Will definitly make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G"
},
"reviewBody": "Very good recipe and super easy to make! I prepared it without variation, but I did puree the cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie62"
},
"reviewBody": "Be sure to drain the pineapple, oranges and cottage cheese otherwise it'll be soupy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy"
},
"reviewBody": "I just made this for Easter desert and it looks wonderful. I too, only used 1 box of gelatin and 1 container of whipped cream, added coconut and pureed the cottage cheese....Just put in the fridge to set overnight, but tasted it and it is AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "A fun, easy recipe. I made it as written, except I added about 1 cup of mini marshmallows. It's a great balance of sweet, with a little tang from the cottage cheese. The texture of the cottage cheese did not bother me at all - it really blends in. I took it to my book club and no one guessed there was cottage cheese in the recipe. A few tips - mix in a BIG bowl. The whipped topping goes down a little in volume as you stir, but it takes a big bowl to have enough room to mix. Also, it does not keep very well. After 3-4 days, the texture is not quite the same and liquid begins to separate. Try to finish it all in a day or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NikkiA"
},
"reviewBody": "I think this would be better with pineapple chunks instead of crushed. The crushed makes the consistancy gritty. Other wise it's pretty tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Great and light tasting! I had to use 2 15oz cans of mandarin oranges (saved 1/2 dz chunks to eat and 1 20oz can pineapple chunks - couldn't find crushed so saved a few chunks to eat later! We enjoyed this alot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dorothy Denise Garcia"
},
"reviewBody": "I think the unit of measures are wrong on this. I used 1 6 oz box of Jello instead of 2 3 oz. And I had to buy 2 8 oz tubes of cool whip to make up the 1 16 oz. I didnt even use all of the second one and I think the orange flavor was barely there. It was good though, however for sure doing coconut next time. That would make it even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whodunitrdr"
},
"reviewBody": "This is very good. I have also used other flavors of gelatin and other fruits. One good one was raspberry gelatin with diced canned peaches and crushed pineapple - it tasted like a peach melba."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CafeAmericano"
},
"reviewBody": "This is what relatives beg us to make for holidays, although my wife calls it ambrosia. Follow directions to the letter and don't change a thing if you're trying it for the first time, though we use sugar free jello. Use both boxes for full flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lupe B."
},
"reviewBody": "Tastes great if eating it right away. Does not keep well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIKI810"
},
"reviewBody": "This recipe is great!! Very easy to put together, made it the night before Thanksgiving. I think next time I will add some walnuts or pecans. I used black cherry jell-o because it's what I had on hand and it turned into a pretty pink fluff that everyone liked, including my husband who is not a cottage cheese fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ao5775"
},
"reviewBody": "Nice light orange creamcicle taste. I used the suggestions made by others. I pureed the cottage cheese, drained the fruits VERY well, and decreased the amount of cottage cheese and orange gelatin. It turned out nice and fluffy. I think these would look more visually appealing if they were served in parfait glasses, with alternating layers of mandarin oranges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nykndan"
},
"reviewBody": "I have had this recipe in my family for years. The only hanges we ever make were to add a box of Cream cheese cut into tiny bits. This helps it set up faster and tastes great! I do also use large curd cottage cheese. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DEBUTANTE8"
},
"reviewBody": "This was delicious--it's very refreshing and it reminded me of my picnics at my grandma's when I was a little girl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SYRIELLE"
},
"reviewBody": "I too, pureed the cottage cheese. I thought only 1 box of jello and 8 oz. whipped topping were necessary; it's a salad- I didn't think it needed to be overly sweet! Just sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "6MOUTHS"
},
"reviewBody": "Yum! I've had this before but never made it myself. What a fabulous healthy way to get in some good ol' cottage cheese! I used 16oz fat free cottage cheese, 1 box of sugar-free/fat-free strawberry jello mix, 1 can of diced mandarin oranges (drained) and some fat-free cool whip. I would have used pineapple but didn't have any. This is as quick and easy as it gets and tasted great! Perfect healthy treat for the kids on a hot summer day. I don't know if it tastes better after it's chilled awhile but it tasted delicious immediately after I made it -which is a big plus! I don't think this is anything fancy for company or anything but it's great to have in the fridge for a sweet treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annasmimi"
},
"reviewBody": "Trying adding sliced almonds for a little crunch! I make mine with light cottage cheese and lite cool whip, sugar free jello. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tanyaj122"
},
"reviewBody": "I love this recipe! I changed the flavor of the Jello from orange to peach and WOW! Just like my Mom used to make! The only thing I did was as others had suggested cut back the Jello a bit since 2 seemed like an awful lot. Great and will be making it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laralynn"
},
"reviewBody": "Great!!! You can also use sugar-free jello and sugar free Cool Whip and it's just as wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Smith"
},
"reviewBody": "Great recipe! I followed it as written and loved it. Only thing I might try differently next time is to only use 1 box of jello. After it sat in the frige for a day the jello kind of took it over. Other than that, excellent! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Satsuki Rebel"
},
"reviewBody": "Not very good, I blended the cottage cheese but could still taste it. This was edible but I definately won't be making it again. Also, I suggest dropping the jello down to one package."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Farm Wife"
},
"reviewBody": "A quick and easy salad to throw together. There's another orange salad we like a little better, but this one is good, too, and easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina"
},
"reviewBody": "This salad reminds me of one my grandma used to make. So creamy and refreshing. It doesn't last long around here. I could eat the whole bowl myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohchloe"
},
"reviewBody": "I've made this 3X since Thanksgiving and each time to rave reviews. I also added 1/2 to 3/4 bag of mini marshmallows..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SYHEINZ"
},
"reviewBody": "This receipe is the bomb, quick and easy! Great to make the evening prior to an event...doesn't take but 10 minutes to make! The Cottage Cheese give it a unique texture. Even my kids love it and they don't like cottage cheese...great way to hide it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pirate Princess"
},
"reviewBody": "I made this for a family dinner at my in-laws. I added sliced strawberries and doubled the recipe for our large clan. Many of my sister-in-laws asked for the recipe. They were surprised to know that it contained cottage cheese, because many in the family don't like cottage cheese! I took the advice of other raters and pureed the cottage cheese, making a smooth fluffy consistancy. I will definitely use this again, maybe change the flavor of gelatin and the fruit to make something different every time. I loved this super easy salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSLUV"
},
"reviewBody": "My grandmother made this when I was a child and I loved it, so I was thrilled when I found the recipe on here. It's brought back very fond memories for me. The only thing I change is to blend the cottage cheese in a small food processor before hand, to get rid of the lumpy texture (but that may not bother some people). A very tasty treat for a warm summer day :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sara"
},
"reviewBody": "Loved this!! I used fat free whipped topping (12oz) and small curd cottage cheese. Great taste and texture! Can't wait to try some variations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ARYQA"
},
"reviewBody": "This was pretty good. I made it with ricotta instead of cottage cheese, because of the texture. The ricotta made it a little grainy, but not lumpy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Young Sweeting"
},
"reviewBody": "Overall not a bad recipe. First, kids definitely did not liked the lumpy cottage cheese. Will blend next time. Second, This recipe does make quite a bit. So I put some of the remaining balance into small popsicle containers, WOW, these are great frozen. Next time I make this recipe, I will definitely serve it as a frozen dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHARITYBOO"
},
"reviewBody": "Really good, I drained the cottage cheese, and drained the fruit for a very long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HONEYIMHOME"
},
"reviewBody": "excellent--will drain fruit and cottage cheese better next time. and use a little less of the whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYJOLLY"
},
"reviewBody": "I made this for a Bunco party because I wanted to be the first to serve \"Jello\" with the meal...why? I guess because it's All-American-Down-Home-Cooking and I was serving pot Roast (the awesome crockpot kind from this site) and new potatoes. It isn't a surprise that everyone loves Jello and a few people asked me for the recipe. I guess if you don't like cottage cheese you won't like it but otherwise it's great...and so easy to whip up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Olivia Myers"
},
"reviewBody": "This sounded great, but tasted horrible. It seemed like there was too much dry orange gelatin mix in it. Texture was hard to handle as well. Will not make this again. All three kids couldn't make it past a couple of bites"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ElissaMay"
},
"reviewBody": "This reminds me of something I'd have at family potlucks as a kid. Doesn't exactly sound good, but I like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANNA51"
},
"reviewBody": "My family really likes this. None of us will eat cottage cheese except in this. So easy to make. I use Fat-free Cool Whip and it turns out good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRO138"
},
"reviewBody": "Exactly what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TARAOYLER"
},
"reviewBody": "Nice recipe but guests did not enjoy the clumps of cottage cheese in it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14251/orange-fluff-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/373/desserts/specialty-desserts/dessert-salads/",
"name": "Dessert Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/980/desserts/specialty-desserts/dessert-salads/jell-o-salad/",
"name": "Jell-O&reg; Salad"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14251/orange-fluff-i/",
"name": "Orange Fluff I"
}
}
]
}
}
, "about": [
]
}
]