				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Orange Cream Fudge"
,"datePublished": "2000-09-25T22:26:23.000-04:00"
,"dateModified": "2022-08-08T11:37:28.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Betty from Ohio"
,"url": "https://www.allrecipes.com/cook/24321500"
}
]
,"description": "This simple recipe combines cream, butter, marshmallow creme, white chocolate and orange extract to make this classic favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/pg7zUKpg0ybvMt6hwCr0mm1prIU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/593405-da5307a5a05547d0891f8056b44b9f70.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Orange Cream Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "128"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "271 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "27 mg"
,"proteinContent": "1 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "64 mg"
,"sugarContent": "36 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 cups white sugar",
"0.66666668653488 cup heavy cream",
"0.75 cup butter",
"1 (7 ounce) jar marshmallow creme",
"1 (11 ounce) package white chocolate chips",
"3 teaspoons orange extract",
"12 drops yellow food coloring",
"9 drops red food coloring" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Grease a 9 x 13 inch pan."
} ,{
"@type": "HowToStep"
,"text": "In a medium saucepan over medium heat, combine sugar, cream and butter. Heat to soft ball stage, 234 degrees F (112 degrees C). Remove from heat and stir in marshmallow creme and white chocolate chips; mix well until the chips melt. Reserve 1 cup of mixture and set aside."
} ,{
"@type": "HowToStep"
,"text": "To the remaining mixture add orange flavoring, yellow and red food coloring. Stir well and pour into prepared pan. Pour reserved cream mixture on top. Using a knife, swirl layers for decorative effect."
} ,{
"@type": "HowToStep"
,"text": "Chill for 2 hours, or until firm, and cut into squares."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dinosmum2"
},
"reviewBody": "I made this fudge and everyone raved about it , it was gone in 4 hours , i will be making this again , Thankyou ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PLPacer"
},
"reviewBody": "I followed this recipe except:\n1. I substituted evaporated milk for the heavy cream.\n2. I used butterscotch chips instead of white chocolate chips.\nIt turned out great! Smooth, creamy, melt in your mouth goodness. The butterscotch chips made it orange-ish. I added some red food coloring to the 1 cup reserved along with the orange extract. This made it a darker orange. This is a great taste that is quite different from the usual suspects (chocolate or peanut butter)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ibmtpckts"
},
"reviewBody": "fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "Very easy recipe and it turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Reel"
},
"reviewBody": "I followed the directions on everything BUT the confections sugar. I double the batch to put it into a 9×13. I didn't have enough confections sugar so I only used 8 cups (because I was doubling it, it should of been 12) and it turned out great! Not grainy at all and more than sweet enough! Will definitely make this again and cut down on the confection sugar, regardless if I'm doubling the recipe or not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kahula"
},
"reviewBody": "I did as someone in the comments suggested and used 10X sugar. This fudge was super easy and very good. Thanks for sharing your recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Littlekc87"
},
"reviewBody": "The flavor is spot on, and it just melts in your mouth, but it was hard to cut because it was kind of grainy, I like the suggestion of using confectioners sugar and I will try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "Since my dad loves lemon desserts, I used only the yellow food coloring and lemon extract. It took a little time to get everything smoothly melted together, but the result was worth it. I will make it again, and if I can find orange extract, I will try that as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erica Figg"
},
"reviewBody": "I had trouble with the sugar staying crystalized - it may be the sugar I used. I used Fiori di Sicilia instead of orange flavoring which I prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Ray"
},
"reviewBody": "Ive never had this kind of fudge before! LOVE IT!!!\nAm making for my bffs mom. Its really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blessed Mama"
},
"reviewBody": "We loved this. The store was out of orange extract so I used strawberry instead. It was very good. Be sure to hear until sugar is completely desolated or it will be grainy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Thing Maker"
},
"reviewBody": "My only concern is the lack of specification in the recipe on how dissolve sugar. This was my first time ever making fudge, and I read through the comments and got some information there, but was still unsuccessful in making it creamy.\n\nAlso, I would opt for more orange flavor next time.\n\nAs a side note, could I substitute orange oil for lime oil and some zest and go for a key lime pie fudge? I might try it out to use up my ingredients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sparkle"
},
"reviewBody": "I will definitely make this again! It is smooth and delicious. I did make a few changes based on other reviews. I used about 4 cups of mini marshmallows instead of the marshmallow cream. I also added a glug of corn syrup to ensure no graininess. I'm in Canada and our packages of white chocolate chips come in 225 gram packs so I used one and a half to get to the 11 ounces. Next time I will be more careful with the food coloring because mine turned out pink. But this is so delicious it doesn't matter what color it is to me. It seems to be quite a forgiving recipe based on all the changes I made. Give it a go it's easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OutOfThyme"
},
"reviewBody": "I made this for a holiday goodie exchange and everyone loved it. The only change I made was adding about 1 Tbsp of corn syrup to prevent sugar crystallization (grainy texture). The result was a perfectly creamy, tasty confection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zhang Min"
},
"reviewBody": "I found this a bit too sweet for me (Although I caught a cold right after making this, so who knows?) My friends said they liked it and found this very interesting. They didn't finish their pieces, but my friend's older brother was very happy to see fudge Overall I would only make this for special occasions with younger children."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swtchrrypie"
},
"reviewBody": "Used powdered sugar as one review suggested and it was very good. Keeps better cold. Taste like and orange cream dream lol it's heavenly. Will definitely make this again!! Keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I read through all of the reviews and decided to try this using powdered sugar to replace the granulated sugar. I also read one review that said it tasted very artificial, so I replaced the orange extract with pure orange oil. The taste is absolutely wonderful and not artificial at all. This is so different and delicious. Everyone loved it! I'm looking forward to trying it with different flavors. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna"
},
"reviewBody": "I made this recipe for my family and it was a big hit, it tastes like the orange dreamsicle ice cream bars. I cooked the sugar, cream and butter about 5 minutes longer than the soft ball stage. Removed from heat and stirred in the marshmallow creme and then followed the rest of the recipe. It was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Gollnick"
},
"reviewBody": "This has been a popular treat at our holiday celebrations for the last few years. It tastes like orange creamsicles. I've added dried cranberries a couple times, which adds more color and an interesting flavor. I love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shyluv96"
},
"reviewBody": "Loved it! It tasted great. Though very crumbly, but very smooth! Definitely recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Sali"
},
"reviewBody": "It turned out great. I followed the advice in the comments and cooked it on very low for about 15-20 mins. The result was a very smooth tasty fudge, not grainy at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "Use 2 cups white sugar instead of 3..3/4 cup of heavy cream...fudge is not so sweet nor grainy. I used wiltons orange food coloring paste. Can find in walmart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deenie"
},
"reviewBody": "I was so stressed out when I couldn't get it neatly out of the pan! I got a lot of good opinions, though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Devina"
},
"reviewBody": "This didn't turn out for me. I followed the tip, suggested by others, to wipe down the sides (while cooking) with water to prevent it from getting grainy, didn't help. Still grainy, crumbly and way to sweet. I will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momosons"
},
"reviewBody": "I looked at other recipes for orange cream fudge to compare and found them identical with the exception to cream being 3/4 cup rather than 2/3 cup. Adding this little bit more cream does make this fudge loose the graininess, though you still need to heat it slowly at the beginning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Polum"
},
"reviewBody": "Love the flavor and the texture. Remember DON'T scrape the sides or bottom of your pan, and be VERY careful about stirring constantly and not overcooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Filozsofia"
},
"reviewBody": "Yummy! I put more orange extract in it, because I like stronger orange flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Cantu"
},
"reviewBody": "I have made this recipe many times. It was requested by my husband because he loves the orange cream flavor. After I made it, it was often requested and made that I even branched out and made it green with mint and then tried red with cinnamon in place of the orange. It is so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJodyH"
},
"reviewBody": "Out of this world! Took me back to my childhood. BUT, including buying a candy thermometer, the first batch was pretty expensive. (I just have to make more, right??)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maleamorphosis"
},
"reviewBody": "This recipe was actually very easy to put together. The only error was on me putting the fudge in the wrong pan so it's thinner than I would have liked. \n\nI will say I don't feel like you need a full cup of the mixture out to the side for swirl effect. A half cup or a little less would work just fine.\n\nOh yes! And I did use confectioner sugar instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rissandjohn"
},
"reviewBody": "I have been using this recipe for awhile now and always with great results. This fudge is smooth and creamy with the perfect flavor look no farther for great creamsicle fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Siobhan Piercey"
},
"reviewBody": "The taste is incredible; it looks beautiful. But the texture is somewhat gritty. So I'm going to give it 4 stars.\r\nI'd definitely recommend not using granulated sugar, and next time I'll use powdered. \r\nI am totally going to make this again, though! Everyone loved it that I gave it to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sage"
},
"reviewBody": "This was my first time making fudge an it didn't turn out the way I expected. Other than it coming out gritty it tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caranam"
},
"reviewBody": "Excellent! I'm someone who prefers cooking over baking or making desserts any day, but I have to say, I was pretty proud of myself in how this turned out :) I did as some other reviewers suggested and used powdered sugar in place of the granulated sugar. It looked beautiful and tasted sooo good! I can't wait to make this again for Easter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sasksi"
},
"reviewBody": "I cooked mine really slow, so it was not grainy. Use 1/2 sugar and 1/2 XXX sugar. But, when I cut it, the fudge, crumbled. Still tastes great. Tastes just like a Dreamsicle ice cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JosieJams5"
},
"reviewBody": "I MAKE THIS EVERY YEAR FOR CHRISTMAS AND GIVE IT TO FAMILY AND FRIENDS IN TIN BOXES AND THEY ALL LOVE IT AND LOOK FORWARD TO GETTING IT EACH YEAR.ITS THE BEST ORANGE FUDGE I HAVE EVER ATE.I HIGHLY RECOMMEND THIS RECIPE BUT DO AS SOMEONE ELSE SAID,DONT RUSH START ON LOW WITH BUTTER SUGAR AND CREAM UNTIL YOU RUB IT BETWEEN YOUR FINGERS AND FEEL TILL ITS NO LONGER GRAINY,THEN TURN IT UP TO MEDIUM,HIGH BRING TO BOIL AND FINISH THE REST.TAKES ALITTLE LONGER BUT WILL NOT BE GRAINY IF YOU DO THIS,ENJOY THIS FUDGE,I KNOW EVERYONE I MAKE IT FOR DOES."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "I read all the reviews about this fudge being grainy, so as suggested, I cooked slowly at a low temp until it reached the soft ball stage on the candy thermometer. And it still turned out grainy/sugary. So it's not as \"creamy\" as I would like, but it set up beautifully, great presentation on a plate, and most importantly, it tastes good and orange-y. Flavor is 5 stars, but because of the texture, I'm rating 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trackcgb"
},
"reviewBody": "I made it last year for a Christmas bazaar fundraiser and received lots of compliments. Am making it again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pinkypal82"
},
"reviewBody": "I have never made fudge before and this recipe was so easy! I did use powdered sugar instead. I also took the time and started sugar, butter, and cream at a low temp to make sure the sugar was dissolved. I will be making this again. I have been inspired to try other flavors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking4Joy"
},
"reviewBody": "Awesome recipes! Made some last night and now we can't stop eating it, gonna have to go make another batch soon! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Hines"
},
"reviewBody": "Excellent recipe! Following recipe to the \"t\" makes perfect orange cream fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jlrief"
},
"reviewBody": "As stated in another review...heat the sugar mixture SLOWLY. Don't crank the heat on high right away. Will turn out nice and creamy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "witchywoman"
},
"reviewBody": "Absolutely a 5 star recipe...I followed this exact and this was my first attempt at a cooked fudge and it is wonderful! I followed one reader's suggestion subbing powdered sugar for regular sugar and it is creamy, delicious and set up perfectly. Thanks for a wonderful recipe! Update! 12-18-11: I have made this recipe at Christmas time for the last three years. It turns out great every time if you use powdered sugar, granulated has always remained grainy every time I use it, but I just give those batches to people I don't like...this year, I switched out the orange extract for cherry extract and nixed the yellow food coloring and went with just the red...otherwise the recipe remained the same...Cherry Cream Fudge...HOLY YUM! This recipe is a super fun recipe to play around with, so get adventurous and try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Snowbaby58"
},
"reviewBody": "Made this last night and it turned out very good. Used half granulated sugar and half powdered sugar. The only problem I had was getting the white chips totally melted. There are small bits of the chips throughout the fudge, which doesn't really hurt the taste at all. Next time I might put the chips in the microwave for a bit to make sure they are totally melted. Hubby really liked this fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolanna Hudson"
},
"reviewBody": "this turned out very good, when i went to store to get my ingredients they didn't have any orange extract so i got cherry extract instead. this (cherry cream fudge) tastes so goooood. it was simple to make just follow instructions. I stirred mine all the way till soft ball stage, very smooth texture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOMMASTONE"
},
"reviewBody": "I make this each year for Christmas trays. Everyone loves it and it keeps well. I do sometimes have trouble getting it to set up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "Oh my goodness, these were amazing!! So ridiculously sweet &amp; smooth but now &amp; then when you need something sweet these are perfect! I took the advise from one review to use confectionery sugar because I had more than my container could hold. Wow everyone loved this - I'll make this again - definitely at the holidays too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari"
},
"reviewBody": "Very rich, creamy and delicious! After reading so many reviews about the consistancy being grainy, I cooked the first 3 ingredients for about 15 minutes while stirring constantly. My fudge wasn't grainy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aRbie5"
},
"reviewBody": "tastes just like orange cream! very visually pleasing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephiehawk"
},
"reviewBody": "This is a super recipe! I had no problems at all. I did take the advice from one of the other reviews and let the sugar, cream and butter simmer at low temperature for about 20 minutes which helped make sure the sugar was not grainy. Everyone loves the taste. Will be great especially during the summer time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "r-me_grl"
},
"reviewBody": "while I didn't make this personally, I was on the tasting end of it. It is good, but extremely sweet and rich. A very little piece (I stress little) goes a long way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mominml"
},
"reviewBody": "I made this fudge and put it in clear baggies with ribbon for Easter gifts. Everyone thought it was such a unique idea and made fudge into a \"springtime\" treat, not just for Christmas anymore. The flavors meld together so nicely and this is not difficult to make with a candy thermometer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "merrilymarilee"
},
"reviewBody": "I've been making this for several years now---everybody raves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catheryn Sparkman"
},
"reviewBody": "a \"little\" grainy but overall very good. a different twist on your usual chocolate fudge. made it for christmas and my family loved it. tastes like orange sherbert. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacia"
},
"reviewBody": "My first adventure in fudge and this was great! Tastes like orange creamsicle / sherbert. I followed the instructions exactly EXCEPT for using confectioners sugar as one review had suggested (thanks!). Came out great, only took about 1.5 hours in the fridge to set, and it also looks cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Blaze21"
},
"reviewBody": "I will start by saying that I've been making fudge for years and am a very experienced chef and have worked professionally in the industry. This is a HORRIBLE recipe I am surprised so many people like it so much. It tasted like sugar with orange kool aid mixed in. It was overly sweet and very fake tasting and in no way resembled quality fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovegoodfood2"
},
"reviewBody": "Great flavor and super easy to make. Tastes like those creamcicle (sp?) ice creams."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MISSMOON"
},
"reviewBody": "These did come out grainy. I should have read the reviews first. They taste, and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURACA1212"
},
"reviewBody": "This tastes just like a Dreamsicle! Make sure you start out cooking on low heat &amp; work up to higher heat to dissolve the sugar &amp; it won't get grainy. (I rub a little of the mixture between my fingers to check for the sugar being dissolved.) Also use only quality extract and use the cream &amp; butter as indicated...it makes a HUGE difference in the taste &amp; texture. This was the first to go off of my huge Christmas candy tray at the family dinner. Everyone wanted the recipe. Thank you Betty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TrygT2"
},
"reviewBody": "This recipe is amazing! I used powdered sugar as others suggested as well as an extra 1/2 tsp of orange extract. I also used heavy whipping cream instead of heavy cream (is there a difference?). It turned out smooth and creamy! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Johnson"
},
"reviewBody": "so good! I made some and took it to work, people were threatening me if i didn't give them the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camo lover"
},
"reviewBody": "WOW! My culinary teacher found this recipe and he got me to make it and wow does it taste just like a creamsicle! Amazingly delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Starlet"
},
"reviewBody": "Grainy, grainy, GRAINY and I used a superfine sugar and stirred away trying to disolve the sugar, but end result was still grainy. Used a candy thermo AND a digital, and did measurements by weight so I was accurate and still it was grainy. And I didn't find it as orangey as it could have been either, but it was sickeningly sweet. It was however the right consistency, hence the 2 stars. What a waste (of ingredients AND time!). Did NOT make the cut for my holiday treats baskets... too bad, so sad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amethystshells"
},
"reviewBody": "Came out grainy the first time I made it. Just be more careful and it's really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcmustang"
},
"reviewBody": "Made this for Christmas.. tastes just like the ice cream.. really easy to make too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenniferB"
},
"reviewBody": "My boyfriend who really doesnt like sweet treats LOVED this recipe!!! Will make again. Instead of using all powered sugar i used half white and half powered to make not so sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Although I am not a big orange person these where a complete hit with my friends and family. I used the power sugar instead of regular sugar and used 1t. more of the orange extract. Came out perfectly and I don't ever use candy thermometers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mojokitty9"
},
"reviewBody": "I made some of this for home at Christmas and it turned out so well, I made some for my friends at work the next week. Very smooth because I took a cue from other reviews and used confectioners sugar instead. Everybody loved this stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori A"
},
"reviewBody": "Huge hit this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CVOELKEL"
},
"reviewBody": "I also made with powdered sugar. So good and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie R."
},
"reviewBody": "I found this recipoe in a magazine several years ago and have been making it several times at Christmas every year. My insurance policy when making any fudge that is cooked like this is to add 2-3 T. white Karo. I learned this from Alton Brown on the Food Network on one of his fudge shows. It doesn't affect the taste of any fudge and the different type of sugar, or glucose, will prevent the other sugar crystals from clumping together which accounts for the graininess. You can also substitute a 10.5 oz. bag of miniature marshmallows for the marshmallow creme which makes this step a whole lot easier. This is a variation on the Fantasy Fudge that has been around for years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "One reason fudge gets grainy is because it is rushed... When heating the sugar, butter and milk start on low heat (I use simmer setting) for about 12-15 minutes until sugar is throughly dissolved (put small amount on spoon, raise out of pan, let cool a couple of seconds and rub some between your thumb and forefinger, if you feel sugar it's not dissolved yet, keep stirring), once dissolved then raise heat to med-hi to bring to a boil. If you don't rush it you will not regret it. This is true with any flavor fudge!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zmhays"
},
"reviewBody": "Absolutely amazing fudge!!!! i love this recipe and i definitely plan on using it from now on. I'll never have to buy fudge again. Mine did not turn out grainy at all, probably because i used half fine grain sugar (but not confectioners) and i stirred it in the sauce pan until the sugar dissolved nicely. Thank you Betty for this wonderful recipe!! You are certainly right.. it is an easy recipe to make fudge real quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nay nay"
},
"reviewBody": "Made this and took it to work. It really had rave review,I did read previous reviews and did use powdered sugar instead of granulated sugar. I will be using this recipe again. It is a keeper. I get the people I work with to give me the ratings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scepure5561"
},
"reviewBody": "This fudge is absolutely delicious. I did replace the white sugar with powdered sugar and it took a little time in the freezer to set up, but it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Foran"
},
"reviewBody": "I MADE THIS FOR CHRISTMAS BIG HIT EVERYONE LOVED IT WILL MAKE THIS EVERY YEAR!! THANK YOU!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Wilson Martin"
},
"reviewBody": "Lots of my friends really enjoyed this fudge. I liked the taste, but it was a grainy and really sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeadHeaded"
},
"reviewBody": "Delicious delicious delicious! I'd never heard of orange cream fudge before and was a little worried about how it might come out, but it was easy to make. I used confectioner's sugar like someone else suggested and I had no problems with the fudge being grainy or cracking. We can't stop eating it! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This was was the best..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KERRYPAT"
},
"reviewBody": "Great stuff! This tasted as good as I was hoping it would. The end result however, was grainy and the pieces crumbled, so I will try the suggestions by others. It is good enough to make again, grainy or not!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beatrice D"
},
"reviewBody": "This was an amazing fudge! After reading that people found it grainy, we used icing sugar instead of white sugar, which turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gry"
},
"reviewBody": "I read the reviews and some of you are having trouble with it turn grainy. \n\nIn order to keep this from becoming grainy you will need to wrap a wet paper towel (or a wet cotton flour sack towel) around a fork and wash the sides of the pan down when you are boiling the syrup. The water that goes into the pan will not harm the syrup being made. This will keep sugar crystals from forming on the sides of the pan. The crystals will cause the syrup to sugar causing a grainy texture in the final product. Hope this helps. GRY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marla LR"
},
"reviewBody": "Amazing -- creamy and rich. As other reviewers have said, it tastes just like Creamsicle ice cream bars. A unique alternative to typical chocolate/peanut butter fudges -- it looks great and was a huge hit with friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ellen Egan"
},
"reviewBody": "I found this candy to be sweet and the cream-sickle flavor was very faint. Next time, I think I will add another drop or two of orange flavoring just to see. It was also a bit grainy,not too bad though maybe I stirred it too much. We'll see how it turns out next time. Other than that everyone loved it.It was very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelmurry"
},
"reviewBody": "This was an awesome substitute for fudge. Everyone around my table loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Vose"
},
"reviewBody": "This recipe was very good taste wise. I found a little trick, use confectioners sugar instead of the white grain sugar. It will make the fudge much creamier. It may take a little longer to set, however its worth the time because you get wonderful fudge with no cracks or grain texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sarajo614"
},
"reviewBody": "The flavor was good. However, it was grainy - not the kind of grainy like all the sugar didn't disolve, it was just grainy - and it did not set up well. Not at all impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gosuz"
},
"reviewBody": "This is a fantastic recipe! I make a variety of fudges during the holidays, and this one is a hit with everyone thankx!!!! In all the years I've made fudge, the biggest recommendation I can give to anyone is DIGITAL therometer. I got one as a gift, and have NEVER HAD A PROBLEM SINCE. If you're making any kind of candy, it's a necessity!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Audra Ekendahl"
},
"reviewBody": "I saw this recipe here on the site, thought that the picture looked pretty, the recipe looked easy, and the decription sounded yummy)\n\nso I made this recipe (literally 20 mins ago) I've never made fudge before, but I made almond toffee for the first time last weekend and it turned out great, everyone loved the toffee, so I thought that this would be a cinch. \n\nwell, it's not that it was a difficult recipe, just alot of things going on at once (adding the chips, fluff that didn't want to blend flavoring coloring, seperating and reserving a cup of this sticky stuff) anyways, too make a long story short it was messy, slightly fustrating, and after I was done I licked the knife and immediately tasted a too sweet, mild burnt butter/sugar taste followed by a faint after-taste of the creamcicle that I know and love. \n\nunfortunately I don't think that this batch is going to turn out good, I'll try it once more, pre measureing out everything, and paying more attention to it all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Gilbert"
},
"reviewBody": "Wonderful recipe! I also made it with strawberry flavoring although it takes about double the amount to get enough strawberry flavor. Everyone raved about both. This year I am trying it with raspberry and also banana flavoring.\nUpdate 11/29/16: I use powdered sugar as others had suggested and it came out nice and creamy. Used 1 and 3/4 cups of packed powdered for each of cup of granulated needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Rodenparker"
},
"reviewBody": "Awesome stuff! Tastes just like a creamsicle and my entire family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Hewett"
},
"reviewBody": "SWEET! Oh my THis is SWEET! But so good. As with any fudge eat only a little bit at a time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandywine Blacketer"
},
"reviewBody": "I've made this recipe twice, once for family and once for friends. Both times they were raving about it! It came out perfectly creamy with great visual appeal. I'm planning on making some more this weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hokiechef"
},
"reviewBody": "I made this last year for the holidays and it was incredibly crumbly. I decided to give it one more try this year and I followed a pp's advice and got all of the ingredients to room temperature before making it, I stirred often and made sure it was exactly at soft ball stage (with a candy thermometer) and the recipe as listed turned out excellent. I can't even count the amount of oodling I got on this fudge, it didn't crumble and was incredibly moist. Its definately a sweeter fudge as far as they go but it is absolutely enjoyable and such a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Ostlund"
},
"reviewBody": "This recipe is extremely easy and very tasty. I did have a problem with it cracking and hardening a little bit 'granular.' I used a candy thermometer, so I know that the temp was right; however, it is raining outside. My Grandmother always said that candy will not set properly if there are clouds in the sky. I will try it again when the weather is clear. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ELAINE BROCK"
},
"reviewBody": "I had trouble with this recipe cracking as well, but loved the flavor. I decided to try using vanilla coating (like you use for making bark candy) instead of the white chips. It turned out creamier this way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie J"
},
"reviewBody": "We have many small-town candy/fudge shops in northern Minnesota. My favorite fudge has always been 'orange cream'. This recipe is as close to \"Up North\" fudge as one could get. This fudge is awesome; smooth, tasty, an delicious. A bonus is that it is easy to make. A definite \"keeper\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Kelly"
},
"reviewBody": "This was a fairly easy recipe to make. I felt that it wasn't as creamy as most fudge recipes turn out to be. Therefore, it cracked a little when cutting it. But, everyone still loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lynn C"
},
"reviewBody": "I wanted this recipe so badly, but it turns out grainy both times I've made it. What am I doing wrong?????? Wonderful flavor, if I could just get the creamy part right."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22860/orange-cream-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
"name": "Fudge Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17151/desserts/candy/fudge/chocolate/",
"name": "Chocolate"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22860/orange-cream-fudge/",
"name": "Orange Cream Fudge"
}
}
]
}
}
, "about": [
]
}
]