				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Out of This World Turkey Brine"
,"datePublished": "2020-03-04T23:59:21.000-05:00"
,"dateModified": "2022-05-09T15:48:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SUDEMERS"
,"url": "https://www.allrecipes.com/cook/631705"
}
]
,"description": "This smoked turkey brine recipe makes a juicy, flavorful turkey. It&#39;s easy to make with water, salt, brown sugar, Worcestershire, garlic, and pepper."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/t5s2DPNX4DyCuJqtKerlSsjw_uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7392436-382988a9d8234c8cac3e438ef0dafa94.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1795845870001",
"description": "Brining your turkey preps it perfectly for smoking or roasting.",
"duration": "PT2M8S",
"name": "Out of This World Turkey Brine",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/11/16/85839-out-of-this-world-turkey-brine-mfs107.jpg",
"uploadDate": "2021-07-07T22:39:33.228-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Out of This World Turkey Brine"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "851"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 gallons water",
"1.5 cups canning salt",
"0.33333334326744 cup brown sugar",
"0.25 cup Worcestershire sauce",
"3 tablespoons minced garlic",
"1 tablespoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together water, salt, brown sugar, Worcestershire sauce, garlic, and pepper in a food-grade bucket or container large enough to hold your turkey. Carefully submerge turkey in brine."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/t5s2DPNX4DyCuJqtKerlSsjw_uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7392436-382988a9d8234c8cac3e438ef0dafa94.jpg"
}
]
,"text": "Cover and store in the refrigerator. Soak for two days before smoking or roasting."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The perfect turkey brine. I used this recipe for a spatchcock turkey for the first time and it was a hit. I have been selected to make the turkey every Thanksgiving from now on. I also used a modified version of the recipe on a ham and it was amazing as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good basic brine. Added 1 cup orange juice, 2 dried pasilla-ancho peppers without seeds, and 50% more brown sugar. Made before following the recipe exactly. Was good, but I wanted to tweak to my taste. I find 1 day of soaking in the brine has worked fine, as I splatchcock the bird ( or just do breasts), and 14lb is the largest bird I will smoke"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russ Fordyce"
},
"reviewBody": "Wow! Just as delicious as everyone says in the comments. Super easy to prepare, just invest in a brine bag and a 5 gallon home store bucket. I did not cook the brine to dissolve but I did turn/shake the bucket every 6 hours or so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Coinmn"
},
"reviewBody": "The recipe calls for canning salt. I purchased the green box of Morton Canning salt specifically to brine one of the 3 birds I was brining for Thanksgiving. The canning salt crystals are significantly smaller than kosher salt and when weighed I got ~25% heavier salt content than with kosher salt. I cut the canning salt to 1 cup and it still was saltier than the 2 other birds using my regular brining recipe. The recipe should be corrected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "To Paulette Broadbent: If your turkey turned out too salty, it’s because the size of the salt grains or ‘corns’ that you used were too small. You want to use large grain salt, such as kosher salt, or large grain sea salt. Never use fine grained salt for a recipe like this, because it doubles the amount of salt in the recipe. If all you have is fine grained salt, you need to cut the amount of salt in half. I hope this helps someone. Have a wonderful thanksgiving!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I spatchcocked my turkey beforehand last year and brined it for 24 hours in this brine and threw it on the smoker on turkey day. The taste was outstanding with the brine and Herbs De Provenance and olive oil as the binder. This year i will use the same brine but add some oranges and whole peppercorn. I also boiled the brine last year and will do the same thing this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "4 for simplicity. We shall see how the turkey smokes in 2 days! Could not find any canning salt, so halved the amount using coarse Himalayan pink salt. Will let you know how it comes out. Warmed the water to tepid so the salt would dissolve. Was about 2 spots under pasta water, so think I'm good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Football Mom"
},
"reviewBody": "I've been making this brine for years and it is always successful. Like one of the other reviewers stated, I bring one gallon of water to a boil with all the other ingredients to make sure the flavors meld and the sugar and salt dissolve. I let it cool before adding the additional water and submersing the turkey. Also, make sure you rinse the turkey well after brining. My turkey is never too salty and always juicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsandds"
},
"reviewBody": "this brine never goes wrong - so much flavor, so much juiciness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MROBERTWARE"
},
"reviewBody": "Absoulutely amazing. No changes to the recipe. I wondering if I can try this frying a turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darryl M J Harrison"
},
"reviewBody": "Made a few changes to the recipe. Added extra garlic &amp; bay leaves. Turned out fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngieF"
},
"reviewBody": "This was life changing. I've never brined a turkey before, but will never skip this process again. I love this recipe since it was simple and u had all the ingredients already. Followed as is. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Gizankis"
},
"reviewBody": "Only way to make a turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjjbcox"
},
"reviewBody": "I have made this 3 times. The first time it was delicious but seemed a little too salty. But the leftovers were not salty. The second time I cut down the brine time to 40 hours. It was also delicious and not salty at all. But the big difference was we rinsed the bird a lot more. The third time we brined for 48 hours and really rinsed the bird. It was amazing and not salty. You really have to make sure you rinse the bird really well. Including under the skin. The second and third time we let the bird dry for 24 hours in the refrigerator. Another thing we added was to boil a small portion of the water with the all the ingredients in it so it would cause the salt to dissolve. Then we added the remaining water. Just make sure you let that cool in the refrigerator before you put the bird in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Al Gruna"
},
"reviewBody": "It's a good brine !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan "
},
"reviewBody": "Very good. Hard to rate 5 because this was my first time smoking a turkey. So I have nothing to compare with. Instead of the 48 hours to soak in, I was only able to soak for 20 hours because of procrastination. Lol. Either way it was delicious. I also wasn’t able to let sit in fridge open to the air so that the skin would dry out a little. If you want the skin crispy then this process is a must. Sooo juicy. Funny thing is is that I probably won’t try anything else I think I’m stuck on this one for a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whoshungry"
},
"reviewBody": "Made this turkey brine for Thanksgiving and it made the turkey very moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sgt Reuster"
},
"reviewBody": "Great flavor and juiciness, but I could not find canning salt and and other recipes stated kosher was “less salty” and comparable. Next time I’ll cut back by a 1/3 and it shod be fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allan Sawyer"
},
"reviewBody": "Having brined a lot of turkeys before, I was a skeptic about the name of this recipe, \"Out of this World Turkey Brine.\" So several weeks before Thanksgiving (2020) I did a test turkey, defrosting in the refrigerator for 24 hours, then brining in the refrigerator for 48 hours, followed by smoking the turkey. Wow! Amazing! This was truly the most tender and delicious smoked turkey I have ever made. I'm sold. I doubt I will ever use another brine again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gordon"
},
"reviewBody": "No changes aside from adding some sliced sweet onions to the brine. Best smoked turkey ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom of Many"
},
"reviewBody": "WHOA! This is the first time I've tried this brine and it is by far the BEST ever! \nI brined it for two days then put it on the smoker, using another recipe from this site \"Turkey in a Smoker\" This is the first time I've smoked a turkey (practice run for Thanksgiving turkey) The only problem...NO leftovers! This is the best turkey I've ever made. The flavor was indeed \"out of this world\" and was so moist and tender. I enjoyed watching my kids eyes pop open when they tasted it. I'll have to make 2 turkeys at the request of the family. They want leftovers. If you're going to smoke a turkey, use this brine and the \"Turkey in a Smoker\" recipe, can't go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Nider"
},
"reviewBody": "Excellent, everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jojomatt"
},
"reviewBody": "I didn't have Worcestershire sauce so used A-1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Akbari"
},
"reviewBody": "I did not use a turkey roasting bag and the turkey turned out tender and savory! Yes, I will definitely use this recipe again. -Paula Akbari"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "I brined two turkeys with this. The first I roasted after about 18 hours, and thought the flavor was quite salty, so I took the second out right away, at about 22 hours. They tasted excellent, but 48 hours would have been way too salty for me. My turkeys were not pre-brined, and I used kosher salt. I did dissolve the salt and sugar in boiling water before adding the rest of the brining ingredients. Overall I love the simplicity of this brine, and will use it often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cliff Kite"
},
"reviewBody": "This was my first attempt at brining a turkey, I followed the recipe as written, but I’m a garlic lover and got a little carried away with it. I will never cook or roast turkey again without brining it. Turned out as tender and juicy as I’ve ever seen, I could literally cut it with a fork. I wish however I would have stuck to the recipe amount of garlic. GREAT RECIPE AS WRITTEN. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy McIntyre"
},
"reviewBody": "Great recipe, such moist and delicious outcome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna Warner"
},
"reviewBody": "I have used this recipe everytime i brine a turkey it's amazing. So many compliments"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksneij"
},
"reviewBody": "This made the most succulent and juicy turkey breast ever! I brined the turkey overnight, and then basted with butter before and during baking. It was amazing, and I'm not even that big of a fan of turkey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marci Banes"
},
"reviewBody": "I made this recipe just as written and felt that it was way to salty. I also rinsed the turkey really well before placing it in the brine (other reviewers thought that was necessary). I noticed that quite a few of the reviews, with a 5 star ratings, smoked the turkey as the cooking method. I roasted the turkey and I don't know if that could have made a difference. Nonetheless, if you make this recipe you may want to have an alternative gravy plan instead of using the drippings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "positano"
},
"reviewBody": "I doubled this brine for a 20 pound turkey and soaked it for 12 plus hours. My husband slathered it with some seasoning and bourbon maple syrup and smoked it on the Traeger at 250. It was done in 5.5 hours and was juicy and delicious! Even better since I didn’t have to worry about over cooking it and taking up oven space!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Bever"
},
"reviewBody": "The only change I made was to add fresh sprigs of rosemary. This was delicious - makes turkey so moist. I even over cooked it because I didn't get home in time to take it out. No leftovers from a 19 lb bird!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oleMemphisboy"
},
"reviewBody": "I also stuffed the cavity with a lemon, cut in half, a whole clove of garlic, cut in half, and 4 or 5 six inch sprigs of thyme. Tied the legs together and smoked as usual. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ceedo"
},
"reviewBody": "Very good Brine. I was a little scared about 2 days of brining because of salt. Definitely use kosher salt. Everyone said best Turkey they ever had cold or hot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "Easy to prepare, and did wonders for our turkey. And I only soaked the turkey for 24 hours pre-Thanksgiving. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RobboNJ69"
},
"reviewBody": "5 Stars! Fantastic! The only change we're going to make is reduce the salt to 1 cup, not 1.5 cups. Even using Kosher salt, some cuts were little saltier than we like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZP5"
},
"reviewBody": "This recipe is great, my turkey was super tasty and moist. After brining it for 2 days I soaked the Turkey in water for 15mins before roasting it to remove all the salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kyalex08"
},
"reviewBody": "My turkey was super juicy and was a crowd pleaser, will be doing this again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bek78"
},
"reviewBody": "Use this every year. It is perfect and makes amazing gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "martin fellerer"
},
"reviewBody": "We did not have all the ingredients but it still turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cookingforfun"
},
"reviewBody": ","
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Patterson"
},
"reviewBody": "I like to heat up a little to get a good mix then cool it down:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skittle"
},
"reviewBody": "I tried this recipe for our 13 lb. Thanksgiving turkey. We smoked it in our electric smoker at 250 degrees for 4 hours to 165 degrees using mesquite chips 3x and it turned out perfect! It is the most moist I’ve ever made. One thing to note is the turkey thermometer that is in each turkey never popped out. It isn’t reliable! We used thermometer probes. Also, I definitely wouldn’t add any more salt for that size turkey. Try it, you won’t be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "0l-lazz"
},
"reviewBody": "If you have bought a turkey that was already brined should I cut the salt back to half a cup, so that it is not to salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toots"
},
"reviewBody": "I decided to brine my turkey last Thanksgiving . I found this recipe and decided to try it. OMG. Everyone loved the flavor and how moist it was. My Family doesn’t want turkey any other way!! Must give it a try, you won’t regret it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christine"
},
"reviewBody": "Used this brine before smoking the turkey (smoking receipe from this web site as well). Was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Earnest Herschel Eaddy"
},
"reviewBody": "AWESOME recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dottie"
},
"reviewBody": "Super good, easy and quick brine for a moist and delicious turkey! We were short on time, so we only marinated approximately 12 hours and holy smokes what a delicious turkey. We cooked in our new Big Easy by Char Broil and the skin was also crispy - YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRiley"
},
"reviewBody": "Followed recipe exactly- brined 2 days, rinsed and smoked...SO good!!! (14lb smoked about 4 hours)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patricia623"
},
"reviewBody": "This brine truly is out of this world! I’ve used this recipe for the past 2 thanksgivings and every year it’s hands down THE BEST!! My family loves it!! I’ll never use another brine recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Choochoomoo"
},
"reviewBody": "Ok so this was amazing! I brined for about 24 hours prior to cooking. I added some onion, rosemary, bay leaves, oregano, thyme, till it smelled good to my own tastes. Then rinsed turkey slathered butter all over inside and out. Cooked turkey in a roaster at 425 degrees for thirty minutes then set at 275 degrees until it was cooked to 165 internal temp. It was sooooooooooo good!!!! This is a great brine recipe. I know I changed it a bit, but it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Storemski"
},
"reviewBody": "This was super easy to make and the turkey was so moist!! Used a 5 gallon food grade bucket and brined the 15lb turkey overnight. We smoked the turkey on the Traeger and it was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Morgan"
},
"reviewBody": "This recipe is on point! I used a 9.75lb turkey and placed it in the brine for about two days in a stainless steel pot in the fridge. I definitely added an entire bulb of garlic because we're garlic people. For as small of a turkey as we had, I cut the recipe in half to reduce the amount of water needed. As someone else stated, make sure to rinse your turkey for a few minutes after a two day soak in the brine solution! The finished turkey had a spectacular taste and had the perfect amount of salty goodness. We also chopped up an apple and cooked that inside the turkey with the garlic from the brine. Overall, the taste was almost identical to a smoked turkey without the hassle of smoking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kshutt"
},
"reviewBody": "This worked great for me. Smoked 3 turkeys over the holiday using this time for 36-48 hours and all 3 turned out super. I will be using it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Rehan Rons"
},
"reviewBody": "Fabulous!!!! Used this for chicken and the result was perfect! This will be my go to recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Dolan"
},
"reviewBody": "We'll be using this brine from here on out! It's the best we've ever used. We brined overnight and then used a dry rub and smoked the turkey with apple wood. It was the best turkey we've ever had. It stayed moist through out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Mirau"
},
"reviewBody": "So moist and tender, will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Gaslin"
},
"reviewBody": "Delicious! Best turkey recipe I've ever tried. I followed the recipe and roasted it in the oven. 500° for 30 min and then 350° until done. It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "I have been brining my turkey with this recipe for the past 7 years. I also use the Homestyle Turkey, the Michigander Way recipe after I brine. Everyone raves about my moist and flavorful the turkey is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scott"
},
"reviewBody": "I have been making this brine for our Thanksgiving turkey for four years! Every year I want to do something different and my family begs me not to. This is absolutely the best way to do a turkey. Of course you can add anything variations you want but the base recipe is beautiful!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "marti"
},
"reviewBody": "My turkey was way too salty. If you don’t like it salty, cut back. I liked it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicole "
},
"reviewBody": "Amazing! We only had about 12 hours to brine it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Basham"
},
"reviewBody": "My mother sent me this recipe for turkey brine and I used it for thanksgiving turkey last year and it turned out perfect and moist. Will be using it again this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Jo Schmitt Weber"
},
"reviewBody": "Just the recipe I was looking for! I loved the garlic and pepper. My other recipe for brining didn't include those ingredients and they made a difference. I did add a few dashes of hot pepper sauce though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dung Beetle"
},
"reviewBody": "Wow.. just wow! YUMALICIOUS!\n\nSo easy to put together! We had everything on hand to mix it up!! We soaked (in the fridge) a turkey breast for 13 hrs. Hickory smoked for 1:45 min and finished in the oven at 325*. We use a meat thermometer (with temp alarm) so I can't tell you exact times on the cooking. OFF THE CHARTS deeelish! It was soooo MOIST and not salty! Followed the recipe to the T.. no changes or substitutions made. This one went into the book!! PS~. It's not burned. I put a rub on it prior to putting it in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NikiBerry"
},
"reviewBody": "This turkey brine is awesome! Kept the meat super juicy and very flavorful - a must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug Johnson"
},
"reviewBody": "I made this turkey last year and I’m making it again this year. Both my parents were restaurant managers and one of them even a cooking instructor and both agreed it was the best turkey day at ever had. As a consequence I get to make the turkey every year LOL. It’s a must try you can’t go wrong. Btw I smoke mind when it was finished brightening"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loveandadmiration"
},
"reviewBody": "This was the absolute best brine I have used! I had a 15 and 3/4 lb turkey and the recipe was just right for the bird. The turkey came out so moist and juicy. It was delicious! I will definitely use this again for the next Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky Johnson"
},
"reviewBody": "I tweaked this recipe a bit. I added ice, bay leaf, sage, thyme, homemade vegetable stock and peppercorns to the brine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanna"
},
"reviewBody": "I've been using this brine for years and every time my fried turkey is juicy and filled with delicious goodness. Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya"
},
"reviewBody": "I was disappointed with my last turkey, so I looked into what would make it better, tastier, and juicier. This is it! I used kosher salt since I didn't have canning salt, and added slices of red onion to the brine. I left my turkey in the brine for about 8 hours, and then roasted, and it was amazing! I will brine my turkeys from now one! One thing to note, is that even though my turkey was stuffed, it was done and reached the temp if 165 about 30 to 45 min sooner than shortest cook time for a 14 lb turkey. Thank you for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aaron"
},
"reviewBody": "Fantastic turkey brine. Made it for Thanksgiving and everyone who \"doesn't like turkey\" couldn't stop eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TASIA1"
},
"reviewBody": "Turkey turned out moist &amp; delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Turner"
},
"reviewBody": "I actually meant to leave a review much sooner than this. We made our first smoked turkey this past Thanksgiving and it was gone! All of it! Everyone raved over how good it was. I know the brine is at least 75 percent of the reason the turkey was so good. The other 25 percent was my husband smoking it and using Applewood. This will definitely be my go to brine recipe from here on out. Thank you so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "livingrn"
},
"reviewBody": "Excellent brine! Let it sit in brine 2 days,rinsed very well then dried with paper towels place orange,lemon and onion in cavity. Butter under the breast skin and baked breast side down for first hour. Flipped it over and continued baking. Everyone raved over this moist savory turkey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tarzaninchrist"
},
"reviewBody": "Great mix. I mixed it up in the blender and set a couple of chickens in it overnight before I smoked them the next day. Thats all the seasoning I did and it was amazing. The chicken turned out so juicy, the kids loved it. I made 4 more chickens like this for a total of six, and they all turned out the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oceandiva"
},
"reviewBody": "LOVE this, especially since it used ingredients I already have on hand. Very tasty !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StanConn"
},
"reviewBody": "This is truly the best turkey brine I’ve ever had. I can’t believe how flavorful it is. You could cut back the salt a little bit but other than that it’s perfect. Try this recipe for an easy and most effective brine. You won’t be sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GinaMia"
},
"reviewBody": "Wonderful. I will be using this again next Thanksgiving. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ctdreamin"
},
"reviewBody": "Followed exactly, turkey was way too salty, needs a chart or something to vary the brine times or salt amounts based on turkey weight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeaniene Jones"
},
"reviewBody": "Helpful hint: If this is your first time brining a turkey - be sure to rinse the turkey well when it comes out of the brine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenna"
},
"reviewBody": "Fantastic! First thanksgiving turkey was a hit...I used this with a 23 lb fresh butterball turkey that had 4% mixture of salt and spices. I was nervous it would be too salty but it was spectacular! I also used the Alton Brown method...started at 500 for 30 mins, then at 350 but it started to cook fast so I lowered to temp to 300 a little over halfway through"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeffinKY"
},
"reviewBody": "I added 1 teaspoon of Onion Powder to the brine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gobblerdad"
},
"reviewBody": "22lbs bird brined for 28 hours, smoked for 14:40 hours @ 250 with mesquite wood. Very moist and tender, taste is awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JSMcClurg"
},
"reviewBody": "Always fun to get the turkey ready for Thanksgiving. After it’s in brine for 2 days it goes in the smoker. This is year 4 (I think) with the same recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice"
},
"reviewBody": "AMAZING, best turkey i have ever had. Not salty at all and juice will be pouring out of it! I have brined 3 yrs in a row and will never fry a turkey again. Smoking is the way to go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris Kesel"
},
"reviewBody": "I love this brine recipe. I also add some whole cloves (about 8-10) and 1/4 tsp allspice. I heat my brine to dissolve all salt and sugar and then cool prior to submerging the bird. I brine for 3 days and then cold smoke for 6-8 hours and then we deep fry the bird. Best turkey EVER...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Harper"
},
"reviewBody": "Canning salt and Kosher salt are two VERY different things. Canning salt is very finely ground. Kosher salt is large flakes. By a given volume (eg. 1 cup) the canning salt is much denser. Therefore, a cup of canning salt will have more weight and sodium content. Given the recipe calls for 2 gallons of water, Kosher salt should be used. Canning salt will be too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "This lives up to being smokey flavored. I followed the recipe exactly and my only change next time will be to use half the amount of salt. Even using canning salt and rinsing well it was so salty it was almost un-fit to eat. For anyone who has to watch their salt intake (as one of my guests did) then this is a recipe that you need to drastically change or just skip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Grant Dickinson"
},
"reviewBody": "If you are cooking just the turkey breast-- cut your salt in half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zoom zoom"
},
"reviewBody": "I smoked probably 10+ turkeys with this brine and I always to forget to write a review on this fine recipe. Followed directions and smoked for 16 hrs to perfection. Used Hickory, Mesquite, or Apple are awesome woods to use. Indeed, OUT OF THIS WORLD."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Trageser"
},
"reviewBody": "I will never cook a turkey again without using this brine recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved it!!! I added chopped onions and did one and a half times the recipe for a 19 lb turkey. Using a brining bag made this so easy. We brined it overnight in the fridge and then grilled it on our weber charcoal grill and it was amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia LaChappelle Sweeney"
},
"reviewBody": "I love this brine recipe. I have an extra fridge, so I clean out my veggie bin and put frozen turkey and brine in there a couple of days before I want to use. Half way through I turn the turkey over. I have roasted and smoked my turkeys using this brine and it is delicious every time! You can stuff the cavity w/ oranges, etc. BUT it is not necessary. Rinse well before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben Brantl"
},
"reviewBody": "Best brine period.. brined for three days, rinsed very well, patted dry, fired up the Traeger, produced the finest turkey I ever had.. using same brine for Christmas turkey.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Hiler Galvan"
},
"reviewBody": "This was the first time I ever brined my Thanksgiving turkey so I didn't make any changes to the recipe. Everybody agreed that this was the best tasting and juiciest turkey they had ever had. This will definitely be my go to recipe every year! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyel Lenarth"
},
"reviewBody": "This was a wonderful way to get the turkeys ready for smoking! The turkeys turn out so good, my husband and I are summoned to make the Turkeys for Thanksgiving every year now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQ Dad"
},
"reviewBody": "I used this bike for out Thanksgiving turkey this year. I did add some thyme and bay leaves. Soaked the bird for about 10 hours then into the pellet smoker for about 6 hours. It was awesome! Turkey was moist, smokey and flavorful. Will definitely use this again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/85839/out-of-this-world-turkey-brine/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15901/meat-and-poultry/turkey/brine/",
"name": "Brine"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/85839/out-of-this-world-turkey-brine/",
"name": "Out of This World Turkey Brine"
}
}
]
}
}
, "about": [
]
}
]