				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Oven Kalua Pork"
,"datePublished": "2000-09-11T19:45:03.000-04:00"
,"dateModified": "2022-10-07T14:06:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ruby"
}
]
,"description": "Fire up the tiki torches -- it&#39;s time for a luau! This delicious slow-roasted pork is rubbed with sea salt and liquid smoke to recall the glorious flavors of pig cooked in a traditional Hawaiian imu. Once cooked and cooled, it can be shredded and served with poi, yams or even on a bun. You may use ordinary sea salt for this recipe if the Hawaiian variety is unavailable."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UzFI23NzS9cLBzLVIL333rLRT8o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17034-851b72db55cb44b989af7b81de870d05.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2310648650001",
"description": "Amazing Hawaiian luau-style slow-roasted shredded pork.",
"duration": "PT2M34S",
"name": "Oven Kalua Pork",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/6634a0a6-2e74-4fc6-986a-fa4f4a491a85/05e8ad55-9da3-4152-a002-7834de9472c4/1280x720/match/image.jpg",
"uploadDate": "2021-07-19T07:10:44.665-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Oven Kalua Pork"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "151"
}
,"cookTime": "PT300M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "251 kcal"
,"cholesterolContent": "74 mg"
,"proteinContent": "19 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "1495 mg"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"5 pounds pork butt roast",
"1 tablespoon liquid smoke flavoring",
"2.5 tablespoons Hawaiian sea salt, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Rub liquid smoke and 1 1/2 tablespoons of the salt into the skin of the pork. Wrap well in foil, and seal completely. Place in a roasting pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UzFI23NzS9cLBzLVIL333rLRT8o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17034-851b72db55cb44b989af7b81de870d05.jpg"
}
]
,"text": "Bake in the preheated oven until an internal temperature of 145 degrees F (63 degrees C) is reached, about 5 hours. Remove from oven and let cool before shredding. Sprinkle the shredded meat with the remaining 1 tablespoon of salt."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT330M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi686"
},
"reviewBody": "The only thing I added was rosemary under the roast. This recipe would be wonderful without it as well. The most tender meat with salty juices. Great with rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PWObsession74"
},
"reviewBody": "I first made this in July of 2012 for my daughter's Hawaiian themed grad/going away party. It was such a hit that I have made it countless (literally) times since. It's been requested by my family for Christmas Eve dinners, birthdays, family get together's, you name it. I actually have a couple of roasts cooking right now! Sometimes I put it in the slow cooker, sometimes in the oven. I do always add some garlic to it though, whether it be fresh slices or just garlic powder if I'm feeling particularly lazy. It's delicious as is or drizzled with the bbq sauce of your choice. My family loves it served with coleslaw, macaroni salad and sweet and sour beans. Thank you to the original poster of this recipe, you have helped me give my family many happy tummy's over the years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Bice"
},
"reviewBody": "Absolutely delish! Last time I made this I had a 14 lb roast and decided to just put it in my roaster and cover tightly with foil. It was a bit on the dry side, so if I do a large piece again I will divide into two smaller portions and wrap tightly in foil as directed in the recipe. I'm not sure if it's necessary to have Hawaiian sea salt, but I did find some on Amazon. I offer Sweet Baby Ray's BBQ sauce when serving. I've used this method more than five times now and it's always perfect! I make it the day before so I can let it cool and pick the fat out with my fingers. Easily reheated in the crockpot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MontanaMom"
},
"reviewBody": "The only thing I changed was that I used pork loin roasts from Costco. Smells wonderful while cooking and tastes heavenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Collins"
},
"reviewBody": "Absolutely delicious! Just like we ate in Hawaii!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssminoe"
},
"reviewBody": "My family loves this recipe! I will make a large amount so I can divide it up and freeze it. I found it too greasy for us as is, so I will slow cook it and then let it sit in the refrigerator until the fat has jelled. Then I scrape off as much of the fat as I can. Next, I like to sprinkle sesame seed oil on it a put it back into the oven for awhile. If it still seems to have a lot of grease, back into the refrigerator and another tossing away of the fat into the trash. By this time it is not greasy at all. We love to make burittos out of it. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My Pressure Cooker Recipes"
},
"reviewBody": "Followed the recipe except we wrapped the pork butt with banana leaves we bought at a local Asian market then doubled wrapped with heavy duty aluminum foil . Put it into a aluminum foil pan and the wrapped that with heavy duty foil and baked in the oven. We have cooked many pigs underground before and this tasted just like it. Absolutely wonderful. Try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bibi"
},
"reviewBody": "Excellent! Great flavor, moist and tender--we all enjoyed this for dinner. My only change was to wrap in cabbage leaves, then wrap in foil. I baked at 325 for 5 hours, and the internal temp was 205, when I pulled it out. The probe went in just like it was going into butter. We had this for dinner, tonight, and a little barbecue sauce will turn this into pulled pork, in a few days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Schwartz"
},
"reviewBody": "I’ve made this several times. It reminds me so much of imu pork from the luaus. Close as I can get without an in ground oven and ti leaves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Wolfmeyer"
},
"reviewBody": "I have only had Kalua pork a few times in Hawaii and it has been long enough that I cannot tell you how this compares to that experience. However, this is so good and so simple and so versatile! I’ve made this twice and had a little bit bigger roast both times. Even with my family of six, we get at least two full meals out of this plus a lunch or two. Sometimes we eat it as a just a pile of meat, sometimes as a sandwich (last time I made Hawaiian slaw to go with it and I liked that a lot actually ON the sandwich with the meat), sometimes as a taco, and sometimes on a mango kalua pork pizza, just like we had from a pizza place in Ko’Olina on vacation. I followed the directions exactly, except the second time my hawaiian sea salt was ground so I started with half when cooking it and then to taste after I shredded it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Warrick"
},
"reviewBody": "This is perfect just as is. Do not try to improve on it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annette Clark"
},
"reviewBody": "I didn't make any changes it the recipe and I shared with my neighbors and everyone thought it was out of this world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara Thompson"
},
"reviewBody": "This recipe is delicious and so easy to make. It filled the whole house with a smell that made my mouth water. The pork was so tender and kept its moisture perfectly wrapped in a bath of foil. I wasnt able to find frozen banana leafs at the last minute so I was so happy that this recipe didnt call for them. Seriously Ono!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Davis"
},
"reviewBody": "Perfect pulled pork for Christmas!!! Didn't have liquid smoke but made a dry rub with salt and pepper and a Penzey spice I had. It was so moist and delicious! So easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marty Courtney"
},
"reviewBody": "I did this in my new Instant Pot 7-1 cooker with pressure cooking. Prep time 5 mins to brown the meat in the pot and 90 mins to completion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dominica"
},
"reviewBody": "It was really tasty. I don't know how it compares to \"the real thing\", but my kids loved it. I will try adding garlic next time for variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "livingrn"
},
"reviewBody": "I just realized I have never rated this! I've made this more times than I can remember over the last 6 or 7 years. I have never deviated from this recipe as it is perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cheryl Tamburri"
},
"reviewBody": "Good base recipe, although using real Hawaiian Alaea salt , some minced fresh ginger, soy sauce (shoyu) and wrapping pork in banana leaves (available in many Hispanic or Asian markets, fresh or frozen) before foil wrapping literally makes this 'pig' taste like it just came out of the imu pit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PEARLIE5"
},
"reviewBody": "I made this today, very tasty. It was sooo tender and moist, lots of juice. I couldn't find Hawaiian sea salt so I used coarse kosher salt. I didn't know how they compared, so I used 1 1/2 T of kosher and that was plenty. After 4 hrs. it was at 180 degrees, so next time I'll have the oven temp at 300 degrees. I'd use more liquid smoke next time. And there will be a next time. I want to try it with minced garlic, ginger like another reviewer suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth W."
},
"reviewBody": "This dish is absolutely amazing!!! We direct a week at a summer camp for kids. One of our theme meals was Hawaiian night and I gave this recipe to our cook to make for us. She followed the recipe as is, increasing the amounts to feed almost 100 people. It was unbelievably good and there wasn't a single scrap left. Will definitely be making this at home for our family soon!\r\nThank you SO much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alli Shircliff"
},
"reviewBody": "This was so easy and incredibly delicious. We cooked a 2 1/2 pound shoulder and it took 3 hours. Served with cornbread and avocado-red cabbage slaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula Swain Kelly"
},
"reviewBody": "Very good recipe for basic pulled pork. Mix with salsa for barbacoa style or add BBQ sauce for sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Copeland Taft"
},
"reviewBody": "easy-use less salt next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattycake"
},
"reviewBody": "I did a test run of this recipe, before a luau party. I did not have liquid smoke, so I used 2 T. minced ginger, 3 minced garlic cloves, and 1 T. Hawaiian salt (for each roast) to rub all over the pork roast before wrapping (fat side up) tightly in heavy duty foil, and placing in a roaster. I roasted it at 300 degrees for 6 or 7 hours, 6 hours for a 5 pound roast (test run), 7 hours for two 7 1/2 pound roasts (party day), in separate pans. I used two forks to pull the pork into tender, delicious, juicy pork delight. Most of the guests asked for the recipe, it was that good. I did not add the extra salt after cooking; it was perfectly seasoned for our taste. I was surprised how juicy the meat was, since it releases a lot of juice to the pan. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kazoo"
},
"reviewBody": "I have a confession to make. I literally CRIED when I ate this. I made the recipe as described with all ingredients, except I slapped that puppy all wrapped up in foil into my slow cooker and left it for several hours. When I checked on it, the smell alone brought a tiny tear to my eye. The finished product opened the floodgates and I cried -- LIKE A BABY -- because it was so good.\n\nI have never been to Hawaii so I don't have the real thing to compare it to so for me, it WAS the real deal! Plus, my kid loved it which made me cry a little (inside, of course) as well since he's so dang picky. \n\nIf I ever make it to Hawaii, I know what I'm hunting for. Forget the spam musubi my friends rave about, I'm looking for authentic kalua pork.\n\nWIN!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tialiha"
},
"reviewBody": "This was excellent. Never ate or cooked this before. Followed the advice of others and shoved minced garlic and ginger in poked holes; doubled the smoke and wrapped in banana leaves then foil.Even cut back a smidge on salt and used soy sauce to rub all over. I cooked a 7.5 pound shoulder for 8.5 hours at about 310F in a water bath. Once done, I drained the fat and poured the juices onto the shredded pork. Enjoyed with Hawaiian bread, pineapple and coleslaw. OhMyGosh!!! Cannot wait for leftovers tonight! Thanks for the recipe. A keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wadley"
},
"reviewBody": "Absolutely, awesome !!! I went by the original recipe and wow! I grew up in Mississippi so I have eaten some pork.\nYummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Knightcraft"
},
"reviewBody": "I made this over the weekend. Along with the liquid smoke and sea salt, I rubbed the pork with some sesame oil to replace the earthiness usually provided by the banana leaves (as suggested by another reviewer)\nThis was fantastic! Served with some creamy coleslaw. \nThanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "Made it today. Yummy. Husband said to try putting cabbage inside the foil towards the end. My goodness what a lovely addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jareth"
},
"reviewBody": "Love this recipe. We buy 3 or 4 pork butts when on sale and cook them all at one time. Preferably in cool weather. Saves on the power bill. We shred all the meat, dividing it into foil packets, adding some juice, sealing and freezing. That way whenever we want pulled pork we just thaw and heat in bar-be-que sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Denson"
},
"reviewBody": "This was delicious. My husband couldn't get enough. I made a homemade sauce and coleslaw to go with it, but it is flavorful and moist all on it's own. I didn't change a thing, which is rare! I will make this again and again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley"
},
"reviewBody": "It's very hot here and the oven on for 5 hours won't work. Can this be done in the crock pot?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookinLovin"
},
"reviewBody": "This was pretty good. I love the flavor of liquid smoke and pork and the meat was very tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justjack"
},
"reviewBody": "i make this in the crock pot. i use 2 tablespoons of liquid smoke, and cover the pork with unpeeled bananas. also, i piece the meat with a fork/knife before i rub the salt/ smoke into it. cook it covered on low for 12 hours. yummy! i live in southern california, so i try to find ways not to put on the oven for long periods of time. so versatile. makes great carnitas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hokey"
},
"reviewBody": "Okay....just a little confused...got excited when I saw this recipe, due to the name. Was thinking it used Kahlua in the ingredients... :-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "Great pork. I placed a banana (peel and all) in with the pork since in the islands it is usually wrapped in a banana leaf and it added to the Kaula taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrmanheim"
},
"reviewBody": "this is a very easy recipe. Several others have mentioned wrapping in banana leaves. Cannot find them near my home, but you can take 4 bananas (for a 5 lb roast), place then on top and wrap tightly in foil. Imparts a great, sweet flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drew McPherson"
},
"reviewBody": "Hi to get more fat use a pork shoulder it has the skin on it cheaper even .the butt roast is the leaner part of the pigs shoulder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen Cavanaugh"
},
"reviewBody": "Great technique for cooking a boston butt. I used liquid smoke and sesame oil but I would use much more next time as the flavors didn't come through as much as I would like (personal preference)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mojihini"
},
"reviewBody": "I tried this and liked it very much. Did my own twists based on some of the reviews listed. Definitely used a bit more salt and bit more smoke. Mine turned out the tastiest I have ever made. Tastes just as close to Keneke's in Waimanalo. Someone mentioned in a review they were looking for a greasier version like they have in Hawaii. Someone else mentioned sesame seed oil created that effect. I did not have the oil, or any oil on hand. Used Pam spray butter (gasp) as it was all I had) and it gave me the exact taste I was looking for. \n\nRecipe:\n\n4 pound pork butt\nred hawaiian salt...as much as you feel without over salting\nliquid smoke...as much as you feel without over doing it\n\nTake a knife and poke as many holes in the raw meat on all sides as possible. Rub with a good deal of the salt. Rub with a good deal of the liquid smoke. Spray meat all over with the Spam spray butter and wrap perfectly tight.\n\n45 min i read on another review per pound. so i did 3 hours at 325 degrees, pulled it out,cool, shredded it in all those juices and then baked in the juices in a pan covered in tinfoil at 275 for 30-45 mins. \n\nJuicy, just right amount of grease without being gross and very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Super Shan"
},
"reviewBody": "Loved this! Mine turned out a little dry, not sure why, but totally hit the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvisgood"
},
"reviewBody": "I salt and pepper the pork, put it on the grill and brown all sides then put it in the pan with water to get the smokey flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vanessa"
},
"reviewBody": "This recipe was so easy!! I seasoned the same but put 3 whole bananas (unpeeled) on top of the pork butt then wrapped the butt in foil. I cooked the butt in a counter top roaster at 300 degrees for 8 hours. Discarded the bananas and After shredding the pork I added a little bbq sauce and worchesershire sauce. I made 2 of these for 58 ppl and served with Hawaiian rolls. I had NOTHING left!! What a hit. I will definately make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Weaver-Beal"
},
"reviewBody": "I've made this recipe so many times. It's simple and delicious! It goes well on rice, on buns (try the Hawaiian rolls or pan de sal ii on this site), or on nachoes. My family loves this. I will sometimes add shallot or garlic powder for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillian Mattingly"
},
"reviewBody": "From Hawaii 2 born and raised living in Las Vegas now! So ONO!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "J Milton Keller"
},
"reviewBody": "This recipe was fairly close to the one from \"Tradewinds and Coconuts,\" page 142. by Jennifer Brennan. I have made Brennan's version numerous times, and it is hands down, the best I have ever tasted,and much more authentic tasting. By using the greenery with it, it brings to it, the taste of the Swiss Chard and spinach...AND you may eat them as well. *****"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clcasas"
},
"reviewBody": "Oh, my word! I have been craving kalua pork for years! If only I had known it was this easy to make!!! This recipe is spot on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie62"
},
"reviewBody": "Hubby made this to take to a friend's Hawaiian-themed birthday party. It was exceptional! He didn't measure the liquid smoke or salt. When it was done cooking it shredded easily. I added salt and kept in fridge until dinner time. He heated it and served it on Hawaiian sweet rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aaron"
},
"reviewBody": "THis is a pretty good recipe... the only thing that is missing is the banana leaf that it should be wrapped in. most asian food markets sell it (mine has it in the frozen foods section) and it's super cheap. For on shoulder or butt i use 2 leafs or so. No foil is needed. The Kalua comes ou perfect every time. The banana leaf adds that \"kalua\" flavor! The only other change i make is turning it down to 300 degrees F and leaving it for 8 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CinnamonGramma"
},
"reviewBody": "Born and raised in the Islands and in the NW for 35 years, I rate this recipe OK. The authentic Hawaiian style combines garlic powder and Hawaiian salt to rub any meat used (pork, chicken, beef). The pan is lined with foil, then layered with banana leaves (frozen at Asian markets) which have been washed. The meat is placed on the leaves, liquid smoke sprinkled over top and then wrapped well. Leaves, then foil tightly enclosed. Couple cups of water at the bottom of the pan. Slow roast for hours, check water only. Only open foil near end to check doneness. Serve with sweet potato, poi, rice, long rice and/or poki, pineapple, haupia. We start roasting at 9pm and leave until 9am at 300 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tiana"
},
"reviewBody": "This recipe calls for the meat to be cooked to fast. I use the same ingredients, however I bake mine at 200 degress for 12 hours. After you have shredded it and are ready to serve, if the meat has dried out a little, just add some water that has been salted with the Hawaiian salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chop Suey"
},
"reviewBody": "This version has the most authentic taste to traditional kalua pork. You can use kosher salt, just not salt with iodine. If available, wrapping the seasoned pork in ti leaves before baking also enhances the \"out of the imu\" flavor too. Because it's an easy dish, I make it for often for large parties. Tastes good in tacos too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DIXLYN"
},
"reviewBody": "I really liked this one. I did do some of the changes that Iadonna suggested. I rubbed the roast with the salt and crushed garlic and ginger. I was thrilled with the way it shredded so easily. My Hawaii-going friends were suitably impressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "K-nutt"
},
"reviewBody": "Pretty good flavor. I didn't have Hawaiian sea salt and this could have been the difference. I felt like the pork needed more flavor. Possibly more liquid smoke?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sammye R"
},
"reviewBody": "Only use half the salt [sea salt, Hawaiian salt, or red clay can be purchased at 99 Ranch Market if there's one in your area], cooked in the oven for about 3 hrs &amp; it was ready. Also tried it in crock pot for 6-7 hours. Crock pot retains more of the juice and did not heat up the house. Added the ginger, garlic and onions as some reviewers suggested - gave it more flavor. Reducing the salt made it much easier to eat and you did not have to keep drinking water. Would definitely make this again - so easy - Prefer using the crock pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Chase Simon"
},
"reviewBody": "Absolutely delicious. So much easier than smoking and tasted equally as yummy. I cooked mine longer only because of my schedule - probably closer to 7 hours, but it didn't hurt the taste or tenderness a bit. Served on Hawaiian rolls with a little bbq sauce. Already can't wait to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quailrun"
},
"reviewBody": "This recipe is amazing!! The meat turns out so moist and has incredible flavor. The first time I made this I followed the directions as stated and it was really good! The second time I didn't measure out the liquid smoke or salt; I just rubbed the liquid smoke and salt all over the roast and it also turned out great!! I use this recipe a lot now!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JadeM"
},
"reviewBody": "This is the only way I cook my kalua up here in the states. Pork, cooking in its own juice instead of water. No need to measure....Just slap liquid smoke around the meat, then salt, and follow direction. Tip: for best flavor, insert slices of fresh garlic around the roast. Dont even need to check temperature. Bake in 400 degree for first hour, then 350 for another 3-4 hrs. depending on size. Bring it out of oven and check the old fashion way.....open, see, and feel....If its tender and almost falling apart.....its ready. If not, throw it back in. However, if you want that greasy, roasted, underground flavor....here's the secret: \"sesame oil\" ohhhyeaaaaaaah!! Save all the liquid in foil. You should have alot of liquid, if not, then its overcooked. Dont know why people add water instead of using real thing. In baking pan, combine shredded pork &amp; liquid from foil, drizzle few drops of sesame oil, add more salt if needed, black pepper as needed. Mix well and heat in 350 oven, covered, for 30-40 mins. or till thorouly heated thru. For big parties, I would refrigerate in ziploc bags after mixing, then continue with last step the next day. Throw some chopped green onions for flavoring &amp; color. Good with baked sweet potatoes. Its \"ONO\"LICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisaking527"
},
"reviewBody": "I made this for a Luau Bridal Shower yesterday. I added the 2T of liquid smoke like other reviewers. People kept asking what restaurant we order the pork from. lol . It was that impressive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyson Baker"
},
"reviewBody": "This is fantastic! I have made this three times now! My guests can't get enough! I had to order the Hawaiian sea salt online and was glad that I did because it really changed the flavor. I will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nan Pardew"
},
"reviewBody": "Delicious with no changes at all, but we missed a certain depth of flavor. With slight tweaks, though, it was exactly like the kalua pork we lived on when visiting Hilo: rub pork roast with 1 tablespoon minced ginger in addition to Hawaiian salt and liquid smoke, wrap in foil, place in baking pan and *let sit 24 hours* in the fridge before baking. An added benefit, prepared this way, it didn't need the last tablespoon of salt at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarbsBerry"
},
"reviewBody": "I LOVE this recipe...throw it in the oven around noon time and dinner is on the table at 5!! Serve with coleslaw.....yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "Yummy, yummy, yummy. I made this recipe with 2 1/2 lbs of pork and it cooked in 3 hours. I also used Red Sea Salt that I had left over from making the Kalua Pig recipe a while back, otherwise I didn't change the recipe, it was perfect. It has such a great flavor that you don't even need any bbq sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hope03"
},
"reviewBody": "This is the basic recipe but a few changes will make a big difference for a more authentic result: 1. Use more Hawaiian salt. Two and a half Tbsp is not enough. It seems like a lot but it is not; 2. If you can get it, use the Alai salt (red clay salt). Remember, NOT to use table salt!; and 3. Line the foil pan with ti leaves. Not tea, but ti leaves. Use the liquid smoke. Then, wrap with foil. When you shred it, be sure to let it soak in the juices. You can use this same recipe to make pork fillings for tacos and bbq sandwiches, too. Of course, if you're from Hawaii as I am, eat with poi and lomi salmon! Onolicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela Reish"
},
"reviewBody": "I've made this several times, my family loves it! I'm now making it for a meal exchange I have with some neighbors. Such a cheap cut of pork you can't help but be generous. Easy to modify to your own taste as far as some of the additional seasonings go. And while you can bake it in a crock pot, it sorta changes the flavor and texture a bit. I happen to have lots of the Hawaiian red clay salt - which is out of this world for this recipe. If you don't have the ono salt be sure to use a large granule type salt. I like to pile it on top really thick and then remove it before I shred it - give the \"illusion\" of a healthier dish. I also recommend wrapping at least two layers of foil around the pork - I think it makes all the difference in the tenderness. (another reason the crock pot does not do quite as good a job - but still tasty) ALSO - the cooked meat freezes well too! Be sure to freeze it with some of the extra juices for when you reheat it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SRQchef"
},
"reviewBody": "I made this in the oven for a party I had with 30 guests. It cooked completely unattended, which was nice for me to entertain. The fat on the meat stays in place, so it's easy to remove vs. cooking in a crock pot where all the fat gets mixed in with the meat. I later added barbecue sauce to the leftovers to finish it up once we were tired of plain pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kac2research"
},
"reviewBody": "Okay, so I know it says \"Oven Kalua Pork\" but making this in the crockpot is the best way to go with this recipe. Use all the same ingredients and put in a crockpot on low for 8-10 hours and this is just like a taste of Hawaii!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soccer Queen"
},
"reviewBody": "I have been craving Kalua Pork for weeks and this totally hit the spot! I read most of the reviews and took all the suggestions. I doubled the liquid smoke and lemon zest; added ginger and garlic; and topped with sliced onions....MMMMMMM! Delicious! I used pork tenderlion (because that is what I had) and it came out awesome; it still fell apart and everything! Definately adding this to the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie24"
},
"reviewBody": "My husband and I both thought that this was VERY close to the \"real deal\", however, when I made it mine did not come out as moist/ greasy as it is when in Hawaii. Any ideas on how to get that?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAKAD"
},
"reviewBody": "FANTASTIC!!!! However I baked my in a tight-fitting casserole dish with about an inch of water. I was glad I checked on it early because it was at 200 degrees in about 3 1/2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "Being half Filipino, we make alot of these kinds of foods. Mine are more on the Polynesian type. My mother was taught this way too. I use a slow cooker and cook it all day long. It is awesome!Dont forget the garlic, I add onions too. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Kids enjoyed it with BBQ sauce, Cam and I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidiw"
},
"reviewBody": "This stuff is great! I even forgot to put the salt on it before baking and it was still great. I did sprinkle a little more liquid smoke on the meat when it was shredded right before serving. We all loved this... even my 2 and 5 year olds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "gia manry"
},
"reviewBody": "Came out okay, but not super flavorful either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Giovanna Morrow James"
},
"reviewBody": "I cooked it as the recipe stated. Maybe my oven runs hot (it is a new oven) but mine was done in only 2 hours. Had I let it cook the full 5 hours, it would have been burnt. It was also not really \"shreddable,\" I ended up just chopping it. I add barbecue sauce because I think it's kind of bland otherwise. It comes out tasty, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISTEN ANNE"
},
"reviewBody": "Although I am not an authority on Hawaiian cooking, I must say this pork is delicious. It is very tender and shreds so easily. I skipped over this recipe several times afraid that it would not be flavorful due to the minimal amount of ingredients, but my entire family loved it! I served it with BBQ sauce and teriyaki sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISTI"
},
"reviewBody": "I recently made this for a party, and it was a HUGE hit. I've been waiting for months to try a Kalua pork recipe, having visited Hawaii and had real Kalua pork. This recipe is delicious and perfect for a crowd or party - as it makes a lot of food with minimal effort! I did make modifications based on other reviewers suggestions, and have prepared this two different ways. This recipe is best in the oven, NOT a slow cooker - the oven method was much more tender and flavorful. I did make modifications, which I think added tothe recipe. My modifications were as follows: 3 T. minced garlic, 1 T. minced ginger AND increased the Liquid Smoke to 2 T. The additional Liquid Smoke really makes this recipe pop! I will definitely be making this again and again! Several people asked for the recipe. I've tried this both ways - once wrapped with tinfoil (the BEST!) and once wrapped with banana leaves. Both were very, very good. You can't go wrong with this one with the modifications. Be SURE to use Hawaiian Sea Salt... it makes all the difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Velasquez"
},
"reviewBody": "I made this for a Luau for my boyfriend this summer and it was a HUGE HIT!!! Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ltlvxn"
},
"reviewBody": "We added a whole clove of crushed garlic and about the same amount of grated fresh ginger to the liquid smoke, mixed it up, then rubbed it into the scored pork butt.\n\nWe also laid out the foil then layered corn husks on top, placed the rest of the marinade onto the husks and wrapped the entire thing in corn husks (as they were to hand) on the top and bottom before completely sealing with foil. We cooked it as above.\n\nNote: When cooking more than one, it still only takes five hours cooking time if wrapped individually - I am a novice so we found that out the hard way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I thought we were going to run out this was such a huge hit at my daughter's graduation party! And I way over bought the recommened pounds per person! I followed the recipe, but added about 1-2 tablespoons fresh ginger and about 2-3 tablespoons minced garlic. Also, instead of the oven I used a crockpot and started it partially frozen on high for 5-6 hours. Then I turned it to low for another 4-6 hours and it came out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Shannon Doucet"
},
"reviewBody": "i did the recipe 3 different ways one because i cant have much salt so i did it with just liquid smoke and a little salt next i did one the exact recipe and than i did one the same way except i wrapped it in a banana leaf and i have to say the one with the leave was so tender and fell off the bone. the others were good but the one wrapped was great i recommend this!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seattle stacey"
},
"reviewBody": "I used this recipe because I liked the idea that it is cooked in the oven. I also used the advice of the review that said to add ginger and garlic, so I added both, but I used ginger powder because I didn't have any fresh and I also added a sprinkling of brown sugar...MMMMMM it was sooooo good!! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BUSYBAKER1"
},
"reviewBody": "What an easy and great recipe! I cooked up 3 five pound pork roasts for a large group of people. The roast was tender and fell apart. I served the pork on Kaiser rolls with Oriental-Sesame cole slaw from this site. I also made up a batch of mango barbeque sauce to go with. The leftovers are even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURAMATTNSHAINA"
},
"reviewBody": "I served this on top of the Soft Onion Rolls from this site and some coleslaw. It felt like a summer barbecue retreat in the midst of a cold winter day. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENATHOME"
},
"reviewBody": "Every time I serve this dish I am asked for the recipe! I've had it several times while visiting Hawaii and this recipe is just as good if not better. I also love that it is so easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zpoiled1"
},
"reviewBody": "Made this today and hubby and I both loved it!! I added an extra Tbsp. of liquid smoke and set the oven at 300*. It was perfectly cooked at 6 hrs. I was unable to find hawaiian rolls in 3 different stores so I ended up with kaiser rolls. I toasted them just a bit and we each added a sweet barbeque sauce on top of the pork. Served with homemade coleslaw and pickles. Will make this often. Fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa"
},
"reviewBody": "Ono! Tastes like it came right out of the imu!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "4my4girls"
},
"reviewBody": "I made this for a Hawiian themed family dinner. I follewed the recipe exactly, although I did use my crock pot. It was very tasty although a little dry. I may add a more liquid next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ladonna"
},
"reviewBody": "This is an ok recipe. I have been living in hawaii for the past 6 years and have made oven kalua pork lots of time. You need to add minced garlic, minced ginger and soy sauce (as much as you think your family will like). Cook the pork as directed in this recipe. I add the sea salt after shredding the pork, because of the saltiness of the soy sauce. Then place in oven to combine the flavors. I got my recipe from a lovely Hawaiian grandmother."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathiees"
},
"reviewBody": "Oh my gosh!! I had never tried to cook anything like this and I have to say I was really surprised at how delicious this turned out. My family almost gave me a standing ovation (ok, maybe not) and I really have to say that I don't have to go to any expensive BBQ places anymore to get a wonderful pulled pork platter which by the way, you can only get one plate for the cost of the entire pork roast when you buy it and make it yourself. I was soooo happy with this recipe. THank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amaruzi"
},
"reviewBody": "I love this recipe and have made it several times. The only thing I do differently with this recipe is use a little more liquid smoke and rub it in really well. After I shred it, I transfer\nit to a crock pot (with juices or it'll dry out) and take a can of\npineapple rings (drain half the juices), pour it over the top and\nplace a few rings on top. Nice presentation and adds a slightly sweet\ntaste to the smokey flavor! Yum! Serve with a collection of BBQ sauces. A previous reviewer served it with mango chutney. I've gotta try that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pinksnowflakeliz"
},
"reviewBody": "Everyone raved about this recipe, so I had high hopes. I thought it was OK, but nothing I would crave in the future. I found it to be WAY too salty, so the second time I made it I cut back on the salt and it was much much better. This goes great with the recipe on here for \"Pani Popo\" (Hawaiian coconut bread)...now THATS a recipe I do crave!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ASIANDELITE"
},
"reviewBody": "tender, moist... the outside was tasty but the inside needed more salt...making it again soon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MORTENSEN"
},
"reviewBody": "OH MY GOSH!! No leftovers!! Used pork sirloin roast, because that is what I had. OH MY GOSH!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KimHr"
},
"reviewBody": "I was so excited to try this recipe that I even ordered the Hawaiian sea salt on line so that it would be just right. But I was really disappointed in the way it turned out. The meat was tender and juicy, but very bland as if it had no seasoning at all. I ended up simmering the shredded meat in some of the juices from the pork as well as sauteed garlic, onion, salt and a touch of cumin, reducing the liquid completely. I then served it Mexican style in corn tortillas with verde salsa. After all this it ended up tasting great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLFROMSCRATCH"
},
"reviewBody": "This was absolutely FANTASTIC!!! I can't rave enough about it. It comes out SO tender and it has to be the easiest recipe that I have. Incredible! Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stac"
},
"reviewBody": "This was really good. We had a Luau party and this was the main course. Everyone really liked it. I had buns on the table if they wanted a sandwich or they could eat it just plain/no bun. It took just under 5 hours to make and I did add just a little water to the pan. Very Moist and Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing!!!!!! Tastes just like when we had it in Hawaii! It was so easy to prepare.This has become the new family favorite!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moffat949"
},
"reviewBody": "so ONO!!! This was just like at home, we ate every last bite!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20964/oven-kalua-pork/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20964/oven-kalua-pork/",
"name": "Oven Kalua Pork"
}
}
]
}
}
, "about": [
]
}
]