				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Oven Baked Jambalaya"
,"datePublished": "2001-07-09T21:01:05.000-04:00"
,"dateModified": "2022-10-17T23:52:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JOSLYN"
,"url": "https://www.allrecipes.com/cook/428938"
}
]
,"description": "A sixteen-serving batch of Creole classic! Chicken, ham, shrimp, and Andouille sausage are combined with onion celery, green pepper and garlic. Tomatoes, chicken stock and rice are stirred in, and the whole thing is baked in a large roasting pan."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WKM33dDO-4PeY4wIkmMQkJuH8gA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/29555-oven-baked-jambalaya-cookinmama-1x1-1-1ad90fdfcc334a8da51dea8769bd0a91.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5279958783001",
"description": "It’s so easy to bake the Creole classic!",
"duration": "PT1M3S",
"name": "Oven Baked Jambalaya",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/6b8aa291-6d17-4d4c-a913-ac0241153ec2/03ec2291-9aee-46a0-9d29-3b9ae47d176d/1280x720/match/image.jpg",
"uploadDate": "2021-07-18T13:37:56.278-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Oven Baked Jambalaya"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "439"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "541 kcal"
,"carbohydrateContent": "48 g"
,"cholesterolContent": "125 mg"
,"fiberContent": "3 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1858 mg"
,"sugarContent": "5 g"
,"fatContent": "26 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"0.5 cup butter",
"1 large onion, diced",
"1 large green bell pepper, chopped",
"4 stalks celery, chopped",
"4 cloves garlic, minced",
"1 (6 ounce) can tomato paste",
"3 bay leaves",
"3 tablespoons Creole seasoning blend (such as the one linked in the footnote)",
"4 teaspoons Worcestershire sauce",
"2 (28 ounce) cans whole peeled tomatoes",
"7 cups chicken stock",
"3 cups chopped cooked ham",
"3 cups cooked andouille sausage, sliced",
"3 cups cooked chicken, cut into bite-sized pieces",
"3 cups frozen cooked shrimp",
"4 cups uncooked long-grain white rice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in large stock pot. Saute onion, green pepper, celery and garlic until tender, being careful not to burn the garlic. Add tomato paste and cook to brown slightly, stirring constantly. Stir in bay leaves, Creole seasoning blend and Worcestershire sauce. Pour into a large roasting pan. Squeeze tomatoes to break up into pieces, and add to mixture in pan. Stir in juice from tomatoes, chicken stock, ham, sausage, chicken, shrimp and rice. Mix well. Cover tightly with aluminum foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WKM33dDO-4PeY4wIkmMQkJuH8gA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/29555-oven-baked-jambalaya-cookinmama-1x1-1-1ad90fdfcc334a8da51dea8769bd0a91.jpg"
}
]
,"text": "Bake in preheated oven for 1 1/2 hours, stirring once halfway through baking time. Remove bay leaves before serving."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT165M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SherylBR"
},
"reviewBody": "I lived in New Orleans for 3-1/2 years and this tasted very authentic to me. The prep took me 55 minutes including making the creole seasoning blend so if you have that done, it would be less. I cut the recipe in half and because I didn’t have chicken but had a lot of ham I used 3 cups ham, one and a half cups andouille sausage And 24 thawed and shelled raw shrimp. In a 350 F. Degree oven I cooked in a Le Creuset French oven (like a Dutch oven) for 45 minutes without the shrimp and then 45 minutes with the shrimp and then I let it sit. It was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Made this for the first time today and didn’t need this large of a batch, so I cut the recipe in half and it was PERFECT! I will be making it again soon as I was looking for a good jambalaya recipe for a church Mardi Gras event…and this recipe fits the bill. The rice was cooked fine and the spices were spot on. Nice flavor and great to have the recipe include sausage, chicken, ham and shrimp. Simple, easy and delicious. This recipe is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Daunoy"
},
"reviewBody": "Had this at a recent beach retreat and it was sooo yummy. Having been born in New Orleans, I expect a lot of flavor in my jambalaya. This one was made without the shrimp but was still a very flavorful red jambalaya."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I should have halved the recipe or invited the whole neighborhood over for dinner! I thought it was fabulous. Yes, oven times vary, and I added about 15 additional minutes to the baking time to get the rice fully cooked. Next time I’ll remove it from the oven halfway through and stir very thoroughly, and rotate the pan in the oven a couple of times to insure even cooking. The flavors were outstanding, just the right amount of spice. The shrimp tasted a bit mushy to me, so next time I won’t add it until the halfway point when I’m stirring it. What a great dish for a party or a potluck. Thanks so much for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Logsdon"
},
"reviewBody": "This was excellent! I was looking for recipes to use some leftover Christmas ham and stumbled on this. So glad I did! I had all the ingredients (except green pepper) I cut it in half because I live alone, and it still made a TON! I used my dutch oven from start to finish and it was done about 15 minutes early. I read the recipe wrong and added the full amount of Creole seasoning so it's got quite the kick but I love spicy so it's fine! I'll definitely add the green pepper next time but this was very VERY good! (and I won't have to cook again for a couple of days)! Bonus! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodger Dodger"
},
"reviewBody": "Second time making this recipe and I think I finally did a great job. First time I did something wrong like I didn't wait long enough in cooking time. This time spot on! I did Kielbasa instead of Chlorizo. Marvelous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Cee Jay"
},
"reviewBody": "Great flavor! I dislike reviews that go on about changing this or adding that, well, I’m going there, just slightly. I added a puck of “More Than Gourmet” Classic Seafood Stock for depth. Next time, I’ll need to adjust moisture-to-rice ratio, as it was a little to moist for my wife’s liking, but only a minor tweak. All-in-all, a yummy Cajun dish. Oysters?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "Prepared exactly as per recipe, turned out excellent every time. Delicious. I’ve made it several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "loftobotcooks"
},
"reviewBody": "The recipe was GREAT until I put the rice in... I’m not exactly sure what I did wrong as I feel I followed the recipe fairly close but the rice took over the whole dish. Cooked way faster than the recipe called for and it was like thick spicy pudding... not very appetizing and there was SO much leftovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gini Lu James"
},
"reviewBody": "Best dish I have had in a LONG time! Very yummy very filling! I did a few things different- I didn’t put the jambalaya in the oven to bake, I put it in a pot and cooked it there, I put the ham, and “and Dooley?” meat in the oven for 13-15 minutes and cooked the shrimp with the rest and it shaved lots of time off . Veryy yummy , will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lclewis157"
},
"reviewBody": "Perfect! Great taste, not difficult"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJ Wischmeyer"
},
"reviewBody": "I have had this recipe for over 20 years and always come back to it after trying other jambalaya recipes. It was the first jambalaya I ever tasted and just cant be improved upon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thecritic"
},
"reviewBody": "Very good, rice cooked perfect, next time i need to half the recipe because it makes enough for a party. I ended up using two lasagna trays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Thomas"
},
"reviewBody": "Took quite a bit longer for my oven/cookware, but this is delicious and worth the wait."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ode2joy"
},
"reviewBody": "I'm giving this 3 stars, but my rating is only that high because of the amazing flavor. Even so, that flavor is largely due to the Creole Seasoning that's linked in the footnotes. I made exactly as indicated except I halved it, and the rice was nowhere near cooked even after 2 hours no matter how thoroughly I stirred as contributor recommended. I should have listened to the other reviewers and made it separately, but always like to try recipes as written the first time. Will try again, but will either make the rice separately or just throw it in a dutch oven and cook on the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Kettle"
},
"reviewBody": "Excellent dish! Love the leftovers! Absolutely fragrant while cooking.\nI diced raw chicken, used my slow cooker, set on high for 3 hours. Added the frozen cooked shrimp in the last half hour, on low setting. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Ruby Gramelspacher"
},
"reviewBody": "I made this exactly as written EXCEPT for reducing chicken stock to 5 cups! Cooked perfectly in 90 minutes. I added fresh shrimp and crab legs during the last 15 minutes of cooking. Excellent dish. Makes enough to feed 10-15."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momof2"
},
"reviewBody": "This makes ALOT!!! Could easily halve for an average family. Agree that it was a dance of sorts getting the rice to cook properly, but I finally did after cooking longer and checking frequently. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Duplessis"
},
"reviewBody": "This dish turned out perfectly the very first time! I used diced tomatoes because I find they are better in casseroles, but other than that I followed it exactly and it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tima1224"
},
"reviewBody": "No changes but next time I will use paella rice(Arborio)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bradley Yencer"
},
"reviewBody": "my rice came out half cooked and half crunchy. the flavor is good but without good rice the recipe is a fail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee A. Staggs"
},
"reviewBody": "I prepared this Jambalaya using the ingredients listed but adding a can of cream of shrimp soup and a little more Cajun seasoning as I like a little spicier food. It turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JohnP"
},
"reviewBody": "Made as directed except didn't include the ham. Very easy and sooo good! It was a hit at my superbowl party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "debmak"
},
"reviewBody": "Not crazy about this. The recipe calls for too much rice, and it bakes too long. the net result is it's more like a paste. The flavor is good, but the texture is not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cooker"
},
"reviewBody": "Added a bit extra sausage... Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Travis"
},
"reviewBody": "Very flavourful, but my rice was undercooked.. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Well, let me tell you, cooks out there (not chefs!). I do all my prep work in advance of cooking. No way did it take me 45 minutes. I like the whole process, and prep took me about an hour and a half. Enjoyable as can be, and it's baking now, but prep time for all you regular home cooks is much longer than 45 minutes!!!!! UPDATE - IT WAS HORRIBLE AND I ENDED UP THROWING IT AWAY, AS IT WASN'T EVEN GOOD ENOUGH TO FEED THE NEEDY. RICE STUCK TOGETHER IN BALLS AND NEGATED THE REST OF THE FLAVORS. WILL MAKE IT THE OLD-FASHIONED WAY NEXT TIME."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "S H Muck"
},
"reviewBody": "Made according to the recipe. Shrimp was wayovercooked. Way too much rice. Threw half of it away. Not good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rex M."
},
"reviewBody": "I cut the recipe in half (two of us didn't need enough for 16!), and only went the full 90 minutes, holding the shrimp out until the last 10 minutes. Came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Have made this several times now and it has come out perfectly every time. Everyone loves it! I cut chicken breasts into bite sized pieces and add them in raw. They came out nice and tender without being rubbery. I also added thawed cooked shrimp for the last 1/2 hour just to warm and blend flavors. I also added extra vegetables, just because that is to our liking. It was a very forgiving recipe so you can tailor it to your preferences. We prefer kielbasa so I substituted that. Other than that I stick to the recipe as written. Will make it again and again, we loved it that much. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue123456"
},
"reviewBody": "Good everyone liked it. I halved the recipe, cooked a cup of basmati rice in the rice cooker separately, and had a side dish of peas and I have leftovers with four people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alkinie Lewis"
},
"reviewBody": "After reading the reviews about the over cooked/under cooked rice, I modified the recipe. I actually cooked it in the slow cooker for about 5 - 6 hours on high. I omitted shrimp &amp;a ham. (allergic to shrimp, not fond of ham) but kept and added 1 1/2C. extra of andouille sausage &amp; chicken. Throughout the cooking process, I added about another Tbs. of Creole seasoning and kept adding chicken stock (approximately 2 1/2 to 3 cups) along the way to make sure the rice consistency doesn't get sticky. It turned out perfect. This is one of the best flavored Chicken Jambalaya recipes I have ever tasted. It was a hit with my family..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grete"
},
"reviewBody": "We love this recipe! I did vary it a bit. I was short of time, so I cooked the rice separate using some of the broth. Also reduced amount of rice. Then cooked the rest of the jambalaya, added the rice &amp; put it in the oven for appox 1/2 hr."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy SOLO"
},
"reviewBody": "I used chicken and rosemary sausages, as well as reduced the creole seasoning so my toddler son would enjoy it. Which he did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marcy wise"
},
"reviewBody": "This is a delicious easy meal for a large group! Great flavor! As other reviewers said I would suggest making the rice separately. My rice was a little mushy for my taste &amp; I did follow the recipe. I had to add about 30 minutes because the rice was too crunchy &amp; then by the time it was done it was a mushy but the flavor is spot on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Breanna Nelson"
},
"reviewBody": "rice didn't cook right. I stirred it plenty and even added water. couldn't salvage it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robinigoode"
},
"reviewBody": "I made this for my Bunco Group for Mardis Gras and used the Cajun Andoullie Sausage and used Tony Chachere's Creole Seasoning mix. It was sooo good I had to make copies of the recipe for everyone. I cooked all the meats together and after mixing everything together I realized I made it too early. So the rice sat in the pan (which I used a disposable roasting pan like the ones you bake a turkey in) in the refrigerator for about an hour before I baked it. The rice soaked up a lot of the juice but everything turned out great. I will definitely make this again. Sooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my Bunco Group for Mardis Gras and used the Cajun Andoullie Sausage and used Tony Chachere's Creole Seasoning mix. It was sooo good I had to make copies of the recipe for everyone. I cooked all the meats together and after mixing everything together I realized I made it too early. So the rice sat in the pan (which I used a disposable roasting pan like the ones you bake a turkey in) in the refrigerator for about an hour before I baked it. The rice soaked up a lot of the juice but everything turned out great. I will definitely make this again. Sooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya"
},
"reviewBody": "I read 90% of the posted reviews before making this for a Girls Night dinner. It definitely takes more time to prep than I planned for but it was worth it! I made the rice separately so not to deal with the potential gumminess and made the creole seasoning, as well. I used fire-roasted, diced tomatoes instead of the whole, peeled ones suggested and they were a nice, flavourful addition"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wastrox"
},
"reviewBody": "We enjoyed this. I was worried that my husband would find it too spicy but he especially liked it. I cut the recipe in half and cooked skinless boneless chicken highs in with all the ingredients. When they were done I removed them to take the meat off the bone. I put the meat back in with the raw thawed shrimp and a bit more broth. Stirred everything back together and cooked about 15 minutes more. I think doing the chicken this way added depth to the flavor and resulted in chicken that wasn't dry as has happened to me before with other jambalaya recipes. I'll be making it for a crowd of 13 in a few weeks and plan to do as another reviewer did and cook the tomato base the day before and store with the ham and sausage in it. I'll heat that up before I put it in with the rice and chicken thighs to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smonfils"
},
"reviewBody": "This is so delicious and easy. I love the fact that it has chicken and sausage and ham!! It DID take a little more than 2 hrs but she did say oven temps vary but the rice was perfect!\n\nWas a huge hit and will make this often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoxyRae"
},
"reviewBody": "I really liked this recipe. Halved the recipe as other reviewers indicated it made a very large amount. I omitted the chicken and ham and added extra sausage and shrimp. Added thawed cooked shrimp after I took it out of oven and it turned out great. I think the shrimp would have been overcooked it they were put in prior to going in the oven. I also used Uncle Ben's Converted Rice and it came out good, not mushy. I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leah Svadlenak"
},
"reviewBody": "Really enjoyed this recipe. However, I would cut the recipe in half. It makes A WHOLE WHOLE LOT! In fact it overflowed my dutch oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lavram"
},
"reviewBody": "I used \"Smokies\" sausage because I could not find Andoulle. It did take longer than the recipe stated for the rice to cook. I ended up cooking it for 2 hours and then holding it warm in the oven for 1/2 hour due to guests being late. By hen it was quite thick. A little broth thins it toesired consistency.Just adjust the seasoning. I will definitely make it again. The amount it produced was huge, so I will cut he recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "damnfinecook"
},
"reviewBody": "This is a great recipe but so glad I read the reviews for two reasons: 1) You certainly want to half this recipe. It is still huge even halved. And, 2) make sure you have some good Creole Seasoning at the ready."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Wiseman"
},
"reviewBody": "I was pressed for time so substituted canned chicken. I also substituted cooked beef sausage for andouille. Instead of cooking the rice in the oven in the roaster pan I did it on the stove top using the 7 cups of chicken stock while the other ingredients were heating in the oven. I added the shrimp just before I put in the cooked rice. We don't do bell peppers so I substituted cubed zucchini squash and added this along with the shrimp and rice. After 30 minutes it was steaming, the shrimp and squash were done and the tomato spice flavoring was incorporated into the cooked rice. There was no need to watch and stir the roaster pan. Next time I will just add canned peeled, diced tomatoes instead of squishing the whole tomatoes. The creole spice mix was really easy to make since I already had the ingredients and I now have it pre-mixed for the next time I cook this recipe. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bethshaw"
},
"reviewBody": "I have made this recipe for quite a number of years and agree with the person who submitted the recipe that you just need to stir well half way through and make the minor adjustments to your cooking time depending on your oven. Every time I serve this dish it gets rave reviews and I have served it at large BBQ parties on numerous occasions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Corri4Short"
},
"reviewBody": "The rice didn't cook very fully, but I have had issues with pasta bakes and dishes of that nature. Taste was fantastic, so I'm sure if I could have gotten my oven to bake it correctly, it would have been a perfect dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marissa Getty"
},
"reviewBody": "This recipe is very tasty and makes a ton! Cut in 1/2 or only make 1/4 of the recipe if you do not need to feed your entire neighborhood!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whitedoyle"
},
"reviewBody": "Used canned stewed tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this last night. Made a few changes. I added everything to a pot stove top and let it simmer for a little while in the chicken stock. I used jasmine rice in place of the long grain. I set my timer at 45 minutes to stir and it was done. My husband really liked it and we live in New Orleans. So it is very close to authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Agius"
},
"reviewBody": "Yum! Actually, I think the next time I make it, I'd have the rice on the side and then it can be put in the bowl to have the thickness desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anclife"
},
"reviewBody": "This was excellent and I didn't bake it. Just cooked everything and put it together. I left out the ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shawn R"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jenn10_10"
},
"reviewBody": "I followed this recipes to the T and it was too watery that it diluted the flavor. I would recommend to cut back on the stock next time. Also, more Cajun seasoning to give it that kick it needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Carter"
},
"reviewBody": "This was awesome! I made some slight changes due to what I had on hand: Only shrimp and hot Italian sausage (no chicken or ham). I cut the recipe in half because we are only 2 people and both me and my 16 year old daughter loved it! I wouldn't change a thing next time. Level of spice was great, cooking time was spot on too. We are so excited for leftovers tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Libby Iida"
},
"reviewBody": "I used raw chicken, sautéed in the beginning with onions &amp; other vegetables. I used raw shrimp which I added at the end with some okura. It was really delicious !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April"
},
"reviewBody": "This is one of my favorite freezer meals to make. I put 1 cup each of chicken, ham, and sausage into 4 freezer bags. I don't use shrimp. I then cook up the vegetables and seasoning and tomatoes and divide that up into the bags. Freeze. Thaw out a bag and add can of broth and a cup of rice. Fits perfectly into my 9x9 square stone pan. Cover with foil and bake 1.5 hours...stir half way. Sooo good reheated as leftovers too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bennett1127"
},
"reviewBody": "I have made this recipe a dozen times. It is the best thing to make for entertaining a crowd because it is so easy and is in the oven cooking when guests arrive. No last minute prep required. Once again, it's EASY! I add the meats FROZEN and it still comes out beautifully. No pre-cooking required in my experience. I prepare the base sauce, throw in frozen chicken breasts and sausage, etc. After cooking, the meats are so tender they are easily shredded with a fork or chopped with food scissors in the pan. I do cook the rice separately (and adjust liquid accordingly) and add it at the end, and I do add the raw, frozen shrimp towards the very end. I get requests for this whenever is my turn to host book club. I love it because it's one dish. Prepare a salad ahead and dinner is done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitagrl"
},
"reviewBody": "The flavor of this is great! I added a little extra of the homemade Cajun seasoning. Otherwise I followed all instructions. Except I forgot to cover it until the last 30 minutes, so as a result the rice did not cook properly. The bottom was slightly overcooked, and the top was undercooked, despite stirring it. I think next time I need to cover it the whole time, and also stir it a second time to avoid the uneven cooking. The time given seemed about right, if not ten minutes too long. (I can't imagine it taking longer, unless your oven temp tends low.) The batch is huge, so be ready to feed a crowd! Don't forget to make the Quaker cornbread recipe with honey to go with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ab"
},
"reviewBody": "This is a very good recipe. I cooked my rice in my rice cooker, and served it on the side. I then cooked everything else in a large skillet on the stove top instead of baking. I used pre-cooked shrimp to save time and omitted the tomato paste (because I didn't have any). Came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Recipe was very tasty though too spicy. I changed the serving to 4 so maybe there was an issue in the conversion. Or perhaps it was the Creole seasoning mix I was using. Anyway I would make this recipe again though with half the seasoning. My husband enjoyed the dish and he normally doesn't like rice based dishes. I cooked it on the stove instead of in the oven so I could have more control over the doneness of the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacie King"
},
"reviewBody": "This was very tasty, I did cook the rice separate which was tasty but think I may try it in the dish the next time. Also while jambalaya is spicy if you don't like any spice leaving the rice out would help curve the heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "It was the most disgusting dish I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanlj"
},
"reviewBody": "Made the recipe as is. Loved it! Will definitely make it again. Other reviewers have said it was difficult, or time consuming. Compared to other recipes, I didn't think so at all. Plus, it made a huge batch, so I was able to freeze some for another future dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loddiecheftress"
},
"reviewBody": "I give this 5 stars for flavor. I made the creole seasoning which was perfect! I added 2 more green peppers to which thank goodness I did! Next time I make this I will only put in 2 cups of rice, as all the rice absorbed to much of the juice. I will certainly make this again, but only with 2, maybe.....2 1/2 cups rice tops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry J Trainor"
},
"reviewBody": "This was GREAT!\nI wanted a much smaller batch, however, and when I decreased the servings it became very difficult, so I made it using the following quantities, and it is about right for four people:\n3 heaping tablespoons butter\n1 large onion, diced\n2 stalks chopped celery\n1 tblspn minced garlic\n1 16 oz can tomato sauce\n1 16 oz can diced tomatoes\n1 cup chopped ham\n4 Italian sausages, peeled, split, sliced 1/2\". I used mild.\n1 13 oz can cooked chicken breast meat\n1 14.5 oz can chicken stock\n1 cup frozen shrimp\n1 1/2 cups uncooked rice.\n1 1/2 tsp Worcestershire sauce\n1 1/2 tsp Creole seasoning\n1 bay leaf\n\nI did not have any green pepper, so skipped that.\nI made my creole seasoning per the footnoted recipe, but HALFED the black, white and cayenne pepper because my better half does not like things too hot. \n\nI sautéed in a regular baking pan per directions, then add the other ingredients to that pan, put the lid on and baked as directed.\n\nWife LOVED this, and I am making it again for our next family get-together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Zeien"
},
"reviewBody": "Absolutely loved it! Will make again. Cooked it for 2 hrs in a gas stove &amp; stirred well twice. Used emeril's bayou seasoning. Great recipe. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shenika Thomas"
},
"reviewBody": "The only thing I changed was not add chicken. But the recipe for this dish is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marie Thuresson"
},
"reviewBody": "will never make it again and cannot recommend it at all. I made the spice mix as per instructions on the site and cooked it as per instructions. Tastes terrible and glutinous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bilan Pbb Evans"
},
"reviewBody": "Two stars for flavor and ingredients but too much work just to have good rice and still have it almost/too done. I will make the rice separate then mix it and cook stew on the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tink"
},
"reviewBody": "This was terrific!!! I used \"spicy\" tomatoes and it was wonderful. EASY! EASY! Wonderful holiday dish. Major crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela K Lightfoot"
},
"reviewBody": "Really good and pretty easy. Sauted in olive oil. Used diced tomatoes. Took longer to cook than stated. Think it might have been double. Add a little Tabasco."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCOOTERMOM"
},
"reviewBody": "Wow, this was easily the best jambalaya I've ever made. It was easy, too. I did vary the steps in the recipe a bit. I did everything through adding the rice exactly as written, but didn't add the protein yet. I covered the pan tightly with foil and baked for around an hour and a half. Before serving, I browned the sliced sausage (I used turkey kielbasa because that's what was in the freezer and I'm not sure my kids would eat andouille), sauteed the spice-dusted shrimp (used the Creole spice mix), and sauteed the chicken (leftover rotisserie chicken from the supermarket). Added all the meat/shrimp, stirred well, and threw it back in the oven to keep warm. It was really tasty, but not muddy-tasting, and not too spicy (I toned it down the cayenne a tiny bit for my family). The rice cooked perfectly, and the meat didn't get overdone. Definitely a keeper for my family!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GayeofPA"
},
"reviewBody": "This dish is so wonderful! Hearty, comfort food, flavorful, very special treat in our house! I cook the rice separately (in the broth) like others suggest and then add it to the rest of the ingredients after they have been baked. If we don't have shrimp, I add more chicken to replace it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kevlyn"
},
"reviewBody": "This is the first review I've ever written, and only because this has become our favourite recipe. We look forward to it every few weeks. I've done everything exactly as written including the DIY creole seasoning. The only change I made was by mistake. I used uncooked meat (chicken, shrimp, sausage) and it turned out perfect. I didn't notice til I went to make it again and read it over. So I decided to keep doing it the same because it turns out wonderful. Thank you for the great recipe! Oh, and we cut it in half and the two of us have meals for the next 2 days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kailxy02"
},
"reviewBody": "This was the best jambalaya I have ever had! I only had medium grain rice, and some diced and stewed tomatoes in the cupboard that I used instead of the whole tomatoes, and I added canned cut okra but other than that I stuck to the recipe including making the suggested creole seasoning blend and it was so fantastic. Yes it made a large portion but it will be a perfect freezer meal as well for when I don't want to cook next. I thought it called for quite abit of meats but I did it anyway and it wasn't too much at all in proportion to the rice. I am very impressed with the recipe and will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Burns"
},
"reviewBody": "I was in the mood for Jambalaya and came across this recipe. I have a crock pot recipe that I use when we go camping but this one will be my home recipe. I was going to only make 1/2 the recipe but with the amount of meat I had out I decided to make the full portion. Oh my. The roasting pan I had wasn't big enough so I had to use two restaurant pans my husband uses for his smoker. I used diced tomatoes instead and could have used a 4th one but I only had 3. No big deal. I made the creole seasoning mix that was in the footnote since I already had all the ingredients. That blend had just the right amount of heat for me and really brought out the flavors. It was far better than the creole mix you buy from a store. This recipe was so delicious. When I get a \" good\" from my husband I know it is good. lol. I was a little iffy about the baking of it but it came out just right......with LOTS of leftovers. Will absolutely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "myork13"
},
"reviewBody": "Cant eat Chicken, so I substituted bacon and added Okra. Yum Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NancyLou"
},
"reviewBody": "Just the right amount of heat. Followed the recipe pretty close - did use the suggested spice blend recipe which was very good. Cooked my rice separately - personal choice because I used brown rice - which left extra broth. I just ladled out the extra broth (which made a wonderful spicy tomato soup for lunch the next day) and added the rice and uncooked shrimp about 15 minutes from the end. My guests loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sean Pendleton"
},
"reviewBody": "While cooking it smelled delicious but it could have been the bay leaves but i'm not sure, I just know that this recipe was not for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lovesmurfs"
},
"reviewBody": "Good recipe. It made a VERY generous 16 people serving. Four people have eaten generously for 2 meals so far, and there's barely a dent. First time I'm making it from scratch (have used mixes in the past), and it's SOooooo....much better than the mix. Used regular beef smoked sausage (the andouille was very high priced at the store) and it was fine. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOLLE888"
},
"reviewBody": "This dish is delicious! I was trying to recreate the jambalaya from this awesome fusion restaurant in our neighborhood, and although it's not identical, this recipe is a home run. I cut the recipe in half and it was dripping over in the oven in my 9x13 dish. I even left 1cup of the broth out! Mistake, too, because once the 90 minutes was up my rice wasn't quite done. So I added the cup of broth I had omitted and cooked another half hour. Fixed the problem! The amount of spice was right on... Definitely use andouille! I used Tony Cacheries Cajun seasoning. Next time I'll omit the shrimp as they are expensive and I could've done without them. All in all this will definitely be a repeat! Thank you for this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KITCHEN DOLLY"
},
"reviewBody": "Very nice recipe! I didn't read all 200+ reviews, but I always read the least positive and the most helpful before starting any recipe. A common theme was mushiness, esp. w/the rice &amp; shrimp. I scaled the recipe to 8 servings, and this made a TON!! filled up a 13X9 pan. To keep the prep work easy, I used frozen chopped onions and bell peppers (Picsweet). Used jarred minced garlic. Used pre-cubed ham also. Only had to slice/cut the sausage. Used 5 of the whole tomatoes and crushed..whole can would have been too many, and no extra juice. Proceeded with the recipe, cutting out 1/2 cup of the broth. Cooked the rice separately in chicken broth, and during the last 7-10 minutes, stirred in the rice and shrimp to heat through. This made a nice, juicy jambalaya, but not overly tasting of tomatoes, and consitency was nice throughout. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZAMBOLIE"
},
"reviewBody": "I have been making this recipe for a few seasons now. We love this recipe and it freezes well. This is a great fall winter dish! I just made this over the last weekend while camping. \n\nThe only modifications we have done is to use an electric roaster, add MORE broth while cooking (omitting the rice)and then when we are about 30 mins out of serving we cook the rice in some of the broth we have scooped from the dish. We keep the rice separate until we're ready to freeze what we don't eat in 2-3 days, then all of it is combined and frozen. Great stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Hanley Froomkin"
},
"reviewBody": "I love this recipe. I double it for my 3 college age sons. They can't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandimeeks"
},
"reviewBody": "This was AMAZING!! Quick side note here, my husband is black and I am as white as a white girl can be lol. The only time I've had jambalaya was at a big family get together, using the \"secret family recipe\" and it was delicious. I'm not a great cook (nor do I have the family recipe), so I've been super intimidated to try to make jambalaya before...but this recipe is fantastic (possibly even better than the family secret, but shhh don't tell them that!). It was a tremendous hit, I made my own seasoning (thanks for including the link, it was a huge help)and couldn't be happier. Just enough spice to keep it authentic, but even my little ones, age 2 and 3, ate theirs...plus seconds! My older boys are already requesting I make it again next week. Safe to say, this ones a crowd pleaser and definitely a keeper! Thank you sooooo much :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ConkyJoe"
},
"reviewBody": "Made as written except for using RoTel Diced Tomatoes &amp; Green Chiles and brown rice. The recipe was halved, and a 4 qt. baking dish worked perfectly. The bake time was 1-3/4 hrs. We mainly made this recipe to see how we liked this oven version since large gatherings sometimes creates a shortage of stovetop space. We wouldn’t hesitate to make this for a large group but prefer another stove top jambalaya when making a family sized meal. We use a slightly modified version of Creole Seasoning Blend by Joslyn in many dishes, and it is exceptional. Joslyn, thank you for two fine recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Ball"
},
"reviewBody": "This recipe is so good, and it's relatively easy to make. I made the creole seasoning linked to this recipe, but I omitted the cayenne for my spice-challenged family. I also used smoked sausage instead of andouille. This is an enormous recipe, so next time I will definitely cut in half (and still have leftovers I'm sure). Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet4ta"
},
"reviewBody": "This was good and the whole family enjoyed it. I halved the recipe and thus cut out some steps, after initial saute, I just threw everything into my Rachael Ray ovenproof pan and let it rip. Also subbed large prawns for pre cooked shrimp, chicken tenderloins for store bought rotisserie and Evergood Pineapple sausage for andouille, which helped control the heat of the dish a bit as I have a 3 year old that doesn't yet appreciate very spicy food that the rest of the family does. I also used the recommended link for the creole spice mix and just eased up on the cayenne and white pepper. An overall winner that I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine "
},
"reviewBody": "This was excellent and so easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZ"
},
"reviewBody": "I throw an annual mardi gras party, and this dish is a life saver! You don't need to be exacting when you chop the veggies or the meat, so don't spend a ton of time on chopping. There's a lot of veggies here, so if you're not fast with a knife, the prep time will be longer. Also, note the recipe calls for pre-cooked meats. If you don't have precooked meats, go ahead an poach some chicken breasts while you're chopping veggies! Lastly, I like to cover my dish with foil, and put the lid on it. If steam is getting out because your seal isn't tight enough, then your rice won't cook all the way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rossvy"
},
"reviewBody": "Excellent!!! Love the Creole seasoning. I made a big batch and use this seasoning in many other ways. Add white and brown sugar and dried mustard to some of it and rub it on ribs. I used the Baked BBQ Baby Back recipe on All Recipes. They were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Brandon"
},
"reviewBody": "This worked brilliantly and was a huge hit at my party. I used chorizo as andouille is unavailable in England. I also used cajun seasoning (ditto) but I have actually eaten Jambalaya in New Orleans and this tasted authentic to me. I've also adapted it for the slow cooker - I use brown rice in the crock as you end up with a better consistency somehow. It was a happy but accidental doscovery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hausgemacht"
},
"reviewBody": "Wow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "I halved the recipe and it truly turned out perfect - used long grain parboiled rice, left the juice in a 28 oz can of diced tomatoes and used 3 cups chicken broth - this is totally flavourfull! Everyone loves it and now my only jambalaya recipe ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sonrisa00"
},
"reviewBody": "This recipe was fabtabulous! I made a few adjustments to the Creole Seasoning Blend and the Jambalaya to suit our tastes and oven :) \r\n\r\n*I added 2-3 tbsp (I think) of Cajun seasoning to increase the kick of the Creole Seasoning Blend and extra cayenne pepper (possibly another tbsp or 2). \r\n*I increased the garlic to 8 cloves. \r\n*Instead of using 2-28oz cans of whole peeled tomatoes, I substituted 4-14oz cans of fire roasted diced tomatoes with garlic. \r\n*I lowered the chicken stock to 6 cups *I used parboiled rice instead of long grain. \r\n\r\nCooking time for me was two hours and I stirred it once at the halfway point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "capayne"
},
"reviewBody": "I cooked the rice separately which worked really well since I had leftovers, but forgot to leave out the chicken broth from the main mix so my dish was a little soupier than expected. It was still delicious, easy to make and got good reviews from my friends!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/38060/oven-baked-jambalaya/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1428/soups-stews-and-chili/stews/jambalaya/",
"name": "Jambalaya Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/38060/oven-baked-jambalaya/",
"name": "Oven Baked Jambalaya"
}
}
]
}
}
, "about": [
]
}
]