				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Overnight Blueberry French Toast"
,"datePublished": "2000-01-04T14:25:23.000-05:00"
,"dateModified": "2022-07-14T17:41:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "KARAN1946"
,"url": "https://www.allrecipes.com/cook/33105"
}
]
,"description": "This blueberry French toast casserole is filled with fresh berries and covered with blueberry sauce for a scrumptious holiday breakfast or brunch."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Vby_DF911Ba6adX2sUBHD-8lPDY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/381517-overnight-blueberry-french-toast-Melissa-Goff-1x1-1-a44e7d138fdd4cbbb4194ce5f2fdc858.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1886536485001",
"description": "Make this delicious brunch dish for a holiday, or any special occasion.",
"duration": "PT3M56S",
"name": "Overnight Blueberry French Toast",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2c975438-99ec-44fa-8ae6-bb0c7e0d6ba2/42c4d038-8594-44c2-9218-06d848349859/1280x720/match/image.jpg",
"uploadDate": "2021-03-02T13:07:23.641-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Overnight Blueberry French Toast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "2272"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "485 kcal"
,"carbohydrateContent": "52 g"
,"cholesterolContent": "279 mg"
,"fiberContent": "1 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "451 mg"
,"sugarContent": "33 g"
,"fatContent": "25 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"12 slices day-old bread, cut into 1-inch cubes",
"2 (8 ounce) packages cream cheese, cut into 1 inch cubes",
"1 cup fresh blueberries",
"12 eggs, beaten",
"2 cups milk",
"1 teaspoon vanilla extract",
"0.33333334326744 cup maple syrup",
"1 cup white sugar",
"1 cup water",
"2 tablespoons cornstarch",
"1 cup fresh blueberries",
"1 tablespoon butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Prepare casserole: Lightly grease a 9x13-inch baking dish. Arrange 1/2 of the bread cubes in the dish and top with cream cheese cubes. Sprinkle blueberries over the cream cheese, then top with remaining bread cubes."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, milk, vanilla extract, and syrup together in a large bowl until well-combined; pour over the bread cubes. Cover and refrigerate overnight."
} ,{
"@type": "HowToStep"
,"text": "Remove casserole from the refrigerator about 30 minutes before baking. Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake casserole in the preheated oven, covered, for 30 minutes. Uncover, and continue baking until center is firm and surface is lightly browned, about 25 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, prepare blueberry sauce: Mix sugar, water, and cornstarch together in a medium saucepan; bring to a boil and cook, stirring constantly, 3 to 4 minutes. Stir in blueberries, reduce heat to low, and simmer until all the blueberries burst, about 10 minutes. Stir in butter."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Vby_DF911Ba6adX2sUBHD-8lPDY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/381517-overnight-blueberry-french-toast-Melissa-Goff-1x1-1-a44e7d138fdd4cbbb4194ce5f2fdc858.jpg"
}
]
,"text": "Serve portions of casserole on plates and pour warm syrup over top."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT580M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Estelle A. Gilormo Brousseau"
},
"reviewBody": "This is the second time I am making it. My family loved loved this for breakfast, lunch and anytime they felt hungry for a treat. I made it with blueberries and Italian bread but today I made it with challah bread and sweet black grapes. Next time I’ll try canned apples. So easy and good. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizawings"
},
"reviewBody": "This recipe is awesome. I make some teeny changes. I only use one brick of cream cheese and use my fingers to pinch of little pieces. I also add cinnamon to the egg mixture. This recipe is bomb as is. I’ve been making it for years for Christmas morning but made it tonight to be a good wife and mom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Owens"
},
"reviewBody": "Absolutely LOVE this receipe. Always a hit with friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made and enjoyed it! Try it with a vanilla sauce, like Birds custard, instead of blueberry sauce, super easy and excellent too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe with a few modifications as everyone is suggesting. I used French bread, half of the cream cheese and double the blueberries. Easy to make the night before. I made it for 6 teenage boys and they gobbled it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Make sure you do it overnight. Be sure to have cream cheese spread out. The sauce is to die for, you may want to make extra. It's on the sweet side, so we served bacon on the side. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen"
},
"reviewBody": "It's on the menu every year!. I use sliced italian or french bread and I spread the cream cheese on each slice. this assures that every slice has a good amount of cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cgrafton"
},
"reviewBody": "This was very simple to make and everyone enjoyed it. I made a few changes. I reduced the eggs, using 10 total which kept it a bit lighter. I used frozen blueberries. They worked out absolutely fine! I whipped 1 1/2 packages of cream cheese with 1/4 cup powdered sugar, put it in a Plastic bag with corner end cut out and distributed the cream cheese mixture over the bread cubes. Then placed the still frozen blue berries over cream cheese. Bakery Italian bread is perfect to cube. I made the sauce as directed with the frozen blueberries as well. One mistake I made was not to grease my baking pan well enough but we managed and it was still very delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Total bliss! Amazing flavor, everyone loved it!!! Keeping as one of those family brunch must haves every Christmas Eve morning! Kudos to the recipe author!!! I have used French bread and brioche... we preferred the brioche but both were amazing! The blueberry syrup takes it over the top!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "To A Tea"
},
"reviewBody": "Well, made this for a weeks vacation, in the mountains. I served it for breakfast, and I swear this did not make it to dinner the same night. EVERYBODY LOVED IT. The tart blueberries really cut the sweetness of the sugar. Personally, I thought the amount of cream cheeses was too much, bUT NO ONE ELSE THOUGHT SO, SO IT STAYS IN!. Thanks for getting me rave reviews from my traveling companions! Next time I use ChAllah!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "palandmagee"
},
"reviewBody": "Family favorite. Used a 16 oz loaf of french bread from the Kroger bakery. Sprinkled the cream cheese with cinnamon and powdered sugar as other reviewers suggested. The blueberry sauce made it stand out from other recipes I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple &amp; easy recipe! I actually made this for my annual family breakfast and everyone loved it including myself, as there weren’t any left! I will definitely be making this again I may even try it with a different fruit even though the blueberries add the perfect amount of tartness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "coachmattwagner"
},
"reviewBody": "The recipe was OK. It needs a little salt, and I used a fresh bakery loaf of sourdough bread. I also doubled the blueberry syrup and added a little lemon to it. After reading the comments, 10 eggs is plenty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this several times and it is always a hit! It’s rich and decadent. And oh so fresh with blueberries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Tarpey"
},
"reviewBody": "The whole family liked this, which in my household, is a win."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Calhoun"
},
"reviewBody": "I have made this recipe for overnight blueberry French toast so many times a have lost count. It is a tradition at Christmas for my family. Never any left over and you have to be quick to get your plate filled! It is just so easy and yummy! Also, have made it with Brioche bread and the family seems to really love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it in a Dutch oven camping. No leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara K"
},
"reviewBody": "I added a couple heaping tablespoons of powdered sugar to the cream cheese. added cinnamon to the egg mix.with a french loaf, the eggs did not need to be reduced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Made this for my sons to cheer them up during quarentine and it was a huge hit!! I did add blackberries to use them up and it was so good!! Served it with fresh whipped cream and I was asked to make it again asap!!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krobbins68"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Nicole"
},
"reviewBody": "WOW! What an amazing recipe! I made this for a brunch I was hosting and everyone loved it! The blueberry topping made this dish in my opinion. I also added about 2 tsp of cinnamon, but followed everything else exactly as it said. Will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shortred"
},
"reviewBody": "This is beautiful and yummy! I followed the recipe exactly because I do not feel that I should make comments on a recipe if I don't follow the instructions. However, I forgot to add the maple syrup to the egg mixture, so I just poured the syrup over the top after baking. And I served the blueberry syrup on the side. I used Italian bread from the bakery and that worked well. Next time, I will definitely add more blueberries and less cream cheese, but that's just my personal preference. The recipe is great as written. I even enjoyed this cold the next day. I will be making this again but not too often because it is like having blueberry cheesecake for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leann R"
},
"reviewBody": "I use Hawaiian Sweet Bread and doubled the blueberries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It is delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Voted \"It's a keeper!\" by my family. I used French bread and doubled the amount of blueberries in the casserole. Also doubled the blueberry sauce because you can never have too much sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TWWINNS"
},
"reviewBody": "took a look at the reviews before making. I added a little squeeze of lemon juice and cinnamon to the sauce. turned out fantastic. I let each person decide on the syrup to use. I made the sauce and put maple syrup out as well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HealthMinded"
},
"reviewBody": "Made it as is, and it was divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandyanglero"
},
"reviewBody": "I made this for a therapy group and everyone absolutely loved including myself. I did everything to the recipe except 3 slices of bread which was because my casserole dish couldn’t hold it. I used Sarah lee butter bread which turned out awesome. I didn’t have cornstarch so I used flour instead and used real sweet cream butter in the topping. To get my bread stahl I laid the bread whole in the oven on a low temp just to harden it. Almost like making your own croutons. Turned out wonderful. Plus a extra I put extra creamy whipped topping on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebraB"
},
"reviewBody": "A-Mazing! Easy and delicious. I double the Blueberry Sauce. Cut the leftovers up in squares, wrap them in saran wrap, then put in ziploc. Heats up and is just as delicious as the day it was baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greenies1"
},
"reviewBody": "This recipe is delicious. I have been making it for Christmas morning breakfast for years. I did make a couple of changes. For the cream cheese I soften the two bricks and then beat it until creamy with 1/4 C powdered sugar, then I spread it over the bread layer. I double the blueberries and then sprinkle cinnamon on top after the egg mixture has been poured. My family likes to use regular syrup so I don’t typically make the sauces. Definitely a crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swimmom190"
},
"reviewBody": "This was an excellent recipe! My guests gobbled it down. I followed some of the reviewers’ advice. I made it with thickly sliced brioche bread. I used almost two cups of blueberries, and I sprinkled cinnamon over the first layer. I also added fresh squeezed lemon juice to the blueberry sauce for a bit of tartness. I will definitely make this again…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "racersedge43"
},
"reviewBody": "I have been making this for the last couple of Christmas mornings. My family absolutely loves it. I used 1 loaf of French bread. It has a million calories but I don’t think about that. LoL. Highly recommend this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherri"
},
"reviewBody": "I used brioche bread, it was delicious! I doubled the syrup. I doubled the blueberries in the dish and used frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shonda bell"
},
"reviewBody": "I absolutely loved this recipe! I made it fir our Sunday morning family breakfast. I have a bit of a sweet tooth so added extra maple syrup and it just perfect! It's a must try recipe and now it's going to be a holiday staple for our morning breakfast/brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "My only substitution was I used frozen blueberries instead of fresh. I’m thinking this is why mine took 1 hour and 25 minutes to cook, as oppose to the recipe’s recommended 1 hour. I used a brioche bread. I did have an addition of the zest of 1 lemon and the juice of 1/2 a lemon in the sauce, HOWEVER I did make the sauce as directed in the recipe AND I tried it before making those additions. It was VERY sweet and did need the acid to brighten it up. I served my sauce on the side along with homemade whipped cream and it was FANTABULOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gresh"
},
"reviewBody": "Amazing! The first time I made it I made it exactly as stated, sooo good! But since then to save some time I use blueberry pie filling instead. When I did make it the first time, the cream cheese cubes stayed as cubes when baked so now I take the cream cheese out of the fridge several hours before making so it’s nice and soft and when I forget to do this I microwave it till soft and put it in a zip lock bag, cut out a corner and pipe it around the bread so it’s more evenly distributed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jenlee"
},
"reviewBody": "The adults liked this, but 2 young children did not. It is more like a desert than breakfast/brunch food. I decreased the amount of maple sryup, but I should have left it out. As someone else suggested, I beat 8oz (that's enough) cream cheese with 2 tbsp powdered sugar and 1 tsp vanilla, then it was easy to smear on the dried bread cubes. I used extra blueberries along with some sliced peaches. I shouldn't have bothered making the sauce - because even though I only used 1/2 cup sugar it was too sweet. When I had a second helping several hours later when it was room temperature (no sauce) I thought it tasted better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonya Galloway"
},
"reviewBody": "Excellent flavor but had to bake it for additional 20 minutes or so because after 30 minutes it wasn’t even hot. I will make it often, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisasportraits"
},
"reviewBody": "I've made this twice. We love it. The second time I was out of lemon. It was very flat. I bought a lemon and added zest and juice and it is super now. I do have to make extra blueberry syrup/sauce. I've made it with good quality store-bought white sandwich bread and with home-made whole wheat sourdough. It's good with either, though the cream cheese was more noticable with white bread. I may have used too much bread in the sourdough one. I will definitely keep making it. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JesusLover"
},
"reviewBody": "I used Hawaiian Sweet Bread and it was a hit.\nI will definitely make this again.\nIt was a huge success.\nIt exceeded my expectations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Dudley"
},
"reviewBody": "I made this for Christmas and it was spectacular. I followed the comments suggestions about spreading the cream cheese mixture. \nThis recipe makes a HUGE amount of casserole. Unless you are serving 10+ people you could definitely make this in 2 loaf pans and freeze one for later or halve the recipe and still have enough for leftovers for a hungry family of 4."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lucas"
},
"reviewBody": "This was absolutely delicious. Made for Easter and everyone loved it. I did make the cream cheese cubes smaller and used French bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Paige Q."
},
"reviewBody": "This was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M J"
},
"reviewBody": "I made this for Easter brunch 2021. It was excellent! The cream cheese was a great addition. I did make the cream cheese mix with sugar and lemon juice to spread over the bread, croissants and blueberries. I added hemp hearts, flaxseed and chia seeds (1 tsp each) to the egg mixture for extra protein. We had maple syrup over the French toast instead of the blueberry sauce. What a wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef Bughead"
},
"reviewBody": "followed recipe to a tee cept i used only 8oz of cream cheese. This is definitely a make this again breakfast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tiffany"
},
"reviewBody": "This was delicious!!!! I only made one adjustment and that was reduction in sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Davies"
},
"reviewBody": "Great recipe, followed to the letter first time and the 2nd time I tried freezing and grating the cream cheese to avoid huge gobs of uncooked cream cheese in the dish- that worked better BUT the 3rd time I made this, I spread the cream cheese on the pieces of bread before cutting into smaller pieces- little messy but more effective and better tasting. I also added vanilla to eggs and added nutmeg and cinnamon to the first and last layer of bread cubes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ollydog"
},
"reviewBody": "So good I add extra blueberries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Dee Beckwith"
},
"reviewBody": "I've been making this for years! It's a must at Easter according to my family!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Forrest Green"
},
"reviewBody": "This is a family favorite. Like many others, I blend the cream cheese with some confectioners sugar and pipe it across the center. I’ve continued to make the full 2 pkg batch, but reserve about 1/3 of it to put on during baking, just after pulling the cover for the last 25-30m session. Even my picky eaters gobble this up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "This was very good. I decided to try something new since the old “make ahead French toast” I had been making for years and serve Christmas morning (once gifts are opened) needed a revamp. My family couldn’t get enough of this! It was so delicious and easy to make . My mother-in-law even asked for the recipe! This is my new go to recipe for Christmas morning breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Robinett"
},
"reviewBody": "Very decadent, I’d make again as a dessert versus breakfast entree. Turned out great, easy to make, just need to carve out the prep time the day prior and the cook time the day of"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana L"
},
"reviewBody": "This was scrumptious! We had it for Christmas brunch. Used Italian bread. Sprinkled cinnamon over both layers of bread. Took the suggestion from others and mixed together 1 1/2 bricks of cream cheese, 1/4 cup powdered sugar and some milk and spread it over the bread. Used more blueberries than it called for. Used 10 eggs. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Lyons Hall"
},
"reviewBody": "Absolutely amazing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "madison"
},
"reviewBody": "I love that I can prep this recipe the night before and just pop it in the oven in the morning. This recipe has been my go-to for holiday and brunch gatherings. I tweaked some of the ingredients like 1 tub of cream cheese, 8 eggs, 1.5 cups of blue berries, a commercial brand of soft white bread; crusts removed, A sifting of powdered sugar on top of the casserole was just right! I adjusted the sweeteners as well. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lainie0425"
},
"reviewBody": "Great base recipe but as other noted, needs tweaking. Here were my adjustments - I used a loaf of sourdough and it stood up well. I reduced the eggs to 10 and added a teaspoon and a half of cinnamon. Once the egg mixture was combined, I tossed in all of the bread cubes, mixing until well absorbed and combined. I then spread half of the egg/bread mix into the pan. I used 1 and 1/2 blocks of cream cheese, heated in the microwave until pourable, stirring every minute or so. I then beat in a quarter cup of powdered sugar to the melted cream cheese and poured it over the bread/egg mix in the pan. Covered with a cup and a half of berries, topped with remaining egg/bread, pouring any remaining egg mix over the whole thing. It turned out perfect the next morning and got rave reviews! The cinnamon gave it more of that French toast taste and the cream cheese center was perfect. We all ate it without the syrup topping, the little bit of sweet to the cream cheese made it terrific without being overly sugary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "My family has come to expect this recipe on Christmas morning. I do use crusty French or Italian bread, 1 bar of cream cheese and 10 eggs. My oven takes more time to cook than the recipe says so allow for extra cooking time. It does take more than an hour to take out of the fridge and cook so someone needs to wake up early and get things moving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wiscott"
},
"reviewBody": "Outstanding French Toast made according to recipe. Received rave reviews on Christmas morning. It needed about 15 min more baking time however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yoli"
},
"reviewBody": "This was easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Vargas"
},
"reviewBody": "I used Pantone and added some fresh nutmeg and as others suggested I froze the cream cheese and grated in my cusinart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judy"
},
"reviewBody": "Used fresh blueberries and day old French bread- big hit with the kids !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DaisyLu"
},
"reviewBody": "This was good but it needs modifications as others mentioned. I used French bread which we cubed about 1.5 days ahead and left barely covered on the counter to dry out. I added more blueberries in the middle, mixed cinnamon into the egg mixture. Then for the topping I used almond extract and added a little blueberry liquor. I bet it baked another 15-20 minutes because I used an oval baker which was a little deeper than a 9x13. If I did it again, I'd reduce the eggs to maybe 10 and add even more berries to the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lancey03"
},
"reviewBody": "I read the suggestions in other reviews but decided to try as is the first time. I did sprinkle cinnamon on the bread, though. That was a good choice. I definitely recommend listening to other reviews on the cream cheese. As-is, it doesn’t really melt and doesn’t soak up sweetness, so it’s just eating chunks of warm cream cheese. I recommend thinning it out and sweetening if you’re looking for a stuffed French toast vibe. I used sandwich bread and it held up ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loves Cookin'"
},
"reviewBody": "Amazing! Used 12 slices of french bread. Whipped 2 packs of softened cream cheese, 1/2 cup milk, 1 T vanilla and 1/3 cup sugar together, spread on the bread, then cubed. 10 eggs instead of 12. So, 6 slices, then cream cheese, 1-2 cups blueberries, six more slices, then egg/milk mixture. Pressed down mixture to ensure absorption. Set out for a half hour, cooked as directed. It was a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie Acree"
},
"reviewBody": "Very good and I even forgot to add the butter and we didn’t even notice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey E Wrobel"
},
"reviewBody": "This is a fabulous recipe as written, I bet, but I had to make a lot of adjustments, based on what I had on hand this first time I am following this recipe, while also reading from the reviews. I absolutely love how highly adaptable this recipe is, though. You can make it from frozen waffles, you can make it in the morning to have breakfast for dinner, plus you can easily change up the flavor profile to other fruits, even!\n\nI will make so many versions of this going forward, most definitely. Thank you dearly for posting this!\n\nYou must try it with lemon extract added with the vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D B"
},
"reviewBody": "Soooo delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Aulis Gould"
},
"reviewBody": "I have made this a few times now and it has been a huge hit with a crowd. Recently I cut it in half to make just for myself and it was still just as good as the normal size. As for adding a photo...I only have an empty pan at the moment. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amkoffee"
},
"reviewBody": "This is a great breakfast for a special morning. We had this with memosas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Troy Sparling"
},
"reviewBody": "Followed the recipe. Turned out great! Because there's only three of us, I cut the recipe in half and was the perfect amount. It did cook for about 45 minutes, the last 15 I put the lid on it which ended up being the right move. Added strawberries because we're nuts for strawberries. Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal Shirley"
},
"reviewBody": "We enjoyed this recipe, however, next time I’ll cut the cream cheese in half. The blueberry topping is really fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ella Scerba"
},
"reviewBody": "This recipe is amazing!! Everyone in my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela HJ"
},
"reviewBody": "Delish!!! I save the heels of my bread and/or stale bread and keep it in the freezer to make bread crumbs. I had built up quite a bit of leftover bread so decided to try this. It is delicious . . . my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellbell"
},
"reviewBody": "This is a favorite in our house and I’ve made it 5-6 times now. Here’s what I’ve learned from reviews and my own experience. —I use French bread to get hearty chunks. Last time I used the whole loaf because I was tired of figuring out what to do with just a little piece leftover. It fits fine but it takes a lot longer to cook. —I’ve tried blueberries and strawberries. The blueberries are definitely better. Other berries would probably work better than strawberries. Or use strawberries in a mix of berries would be better. —don’t try to melt and spread the cream cheese. It’s difficult, adds a lot of time, and creates a barrier so the bottom bread doesn’t get soaked with the mixture. —spray the pan really really well. —push down the bread mixture so it all gets soaked before putting it in he fridge —spray the tin foil too! —bake it way longer during the covered phase if you use a lot of bread. Next time I’m going to try on a lower temp so the part touching the pan doesn’t overcook while the middle is still setting up. If it’s still not cooked through by the end, leave it in longer but cover it again or it will get too crispy on top. —one batch of sauce is alllmost enough. Two is way too much. —I have used fresh and frozen berries and either works. I like to do fresh in the casserole and frozen in the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Gene Lebold Stone"
},
"reviewBody": "Went together easily and baked beautifully, light brown. Prep was super quick and loved letting it sit overnight so that I could just pop it into a hot oven in the morning.\n\nI did not add any fruit to it until after baking and then gave the option of fresh fruit as well. It was delicious! Not too sweet (worried because of the syrup!) at ALL and was in fact creamier than most breakfast bake type dishes. Will make again and again. A new Favorite for this Mom!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Happybaker"
},
"reviewBody": "I didn’t have Italian bread that others recommended but I have a loaf of Hearty White and it worked well too. I also followed others’ suggestion to cream the 1 1/2 bricks of cream cheese with 1/4 cup of sugar. I didn’t like the blueberry sauce in this recipe. Next time, I will use the Blueberry Sauce recipe that is also in this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "claire"
},
"reviewBody": "Everyone loved this dish. I used 2 loaves of Italian Bread, which gave it a little crunch in between the moist pieces. \nWe then added some yummy whipped cream to our individual plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ne11er"
},
"reviewBody": "I used 2 baguette loafs (about 24” each) for the bread. I also forgot to soak overnight so I used a spatula and pressed it down into the egg mixture to make sure all of the bread was soaked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla Weaver"
},
"reviewBody": "I found this recipe 12 years ago and it’s a favorite!!! I follow it exactly and my family would cry if I lost the recipe. Fortunately, I’ve made it often enough that I have it memorized...it’s worth the time and it’s so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Mary"
},
"reviewBody": "Very good every time. I've made this gawd-only-knows how many times! Always perfect, even if the instructions aren't followed \"perfectly.\"\n\n...Working on a Strawberry adaptation!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Oldham"
},
"reviewBody": "This recipe is great just the way it is. No revisions needed. I cut the recipe in half for my husband and I on Mother’s Day and paired it with bacon and a bottle of Champagne! Delicious. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tbone"
},
"reviewBody": "Excellent followed recipe came out great! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "Made the recipe as is. I cut the cream cheese cubes pretty small. Used french loaf and also cubed it up small. Added cinnamon which made it smell delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blanca Gutiérrez"
},
"reviewBody": "Cooked a little longer than the original recipe called for, but otherwise it was really good. Also, substituted strawberries in place of the blueberries. The family really enjoyed it. Will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmoons"
},
"reviewBody": "Great, cream cheese, blueberries, eggs and bread, yummm the blueberry syrup on top is the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marions Rezepte"
},
"reviewBody": "This became our traditional breakfast on Christmas day but without the blueberries. It makes it an easy morning breakfast since it's prepared the night before. Tastes wonderful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "My 3 boys"
},
"reviewBody": "Made this for my sons to cheer them up during quarentine and it was a huge hit!! I did add blackberries to use them up and it was so good!! Served it with fresh whipped cream and I was asked to make it again asap!!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Isley Stump"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RHowe"
},
"reviewBody": "Delicious. I made this during quarantine so had to make 2 ingredient revisions. I only had 9 eggs and frozen, not fresh, blueberries. I used 2 cups of berries instead of one. One more note, 350 degrees did not cook this in 30 minutes. I ramped you to 375 degrees for additional 20 minutes and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marita Stoneman"
},
"reviewBody": "Didn’t make any changes, but will surely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrschiefmac"
},
"reviewBody": "Absolutely delicious. It’s going to the top of our favorites list. I used organic, thick sliced white bread. I split the bread bag open &amp; left the bread exposed all night. It def helped for the bread to be stale so it doesn’t get soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cblackgo"
},
"reviewBody": "I made no changes &amp; used a crusty loaf of Italian bread, which I'd recommend. Perfect Easter brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I didn't read other suggestions but on my own used 1 cup splenda instead of sugar and a splash of lemon juice for the blueberry sauce. I think next time I will do 1/2 sugar 1/2 splenda. We have discount bread stores here so I used thick slices of Texas toast. I did push all the bread down in the egg mixture to make sure it was saturated before I put it in the refrigerator. The next morning I \"fluffed\" it up a bit and ut it in the oven for the first 30 minutes covered. Before baking uncovered for the next 25 minutes I stirred it all up to help distribute the cream cheese better. I also sprinkled cinnamon over the top and put it back in the oven for 25 minutes. It came out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EKD"
},
"reviewBody": "I've made this several times for brunches, Easter family brunch and tomorrow for our quarantined mini brunch. It has been fabulous every time. Rave reviews. I've always added a b it more blueberries because everyone loves them. And I use Challah bread because it's available and delicious. I like to serve the blueberry sauce on the side and let people add their own. Try this one!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "We love it made it 3x except I only put in 6 or 7 eggs depending on the size, I tried with 12 and I ended up throwing it away it cooked for almost 2 hours a is very still eggy. The other thing is I add a little cinnamon approx 2 tsp into the egg, milk vanilla batter.\nMy daughter begs for this every Christmas and Easter Morning!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maria Uthlaut"
},
"reviewBody": "It's alright. Not as good as I'd hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DetGirl"
},
"reviewBody": "Yum! Used half the cream cheese, frozen blueberries, added some cinnamon and nutmeg, added lemon to the sauce. Left the cream cheese in chunks, and when I uncovered it to return to the oven I used a knife to break up the chunks just a bit. So it still had some cream cheesy bites. Delicious, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JnM"
},
"reviewBody": "Yuck! Nobody liked or finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BeckyBD"
},
"reviewBody": "It was a little difficult to get the cream cheese to spread evenly. That seems to be a common issue. Didn’t affect the flavor, though, and my family loved it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15057/overnight-blueberry-french-toast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
"name": "French Toast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15057/overnight-blueberry-french-toast/",
"name": "Overnight Blueberry French Toast"
}
}
]
}
}
, "about": [
]
}
]