				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Overnight Coconut Pecan Steel Cut Oats"
,"datePublished": "2020-03-05T00:09:12.000-05:00"
,"dateModified": "2020-03-05T00:09:12.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Linda"
,"url": "https://www.allrecipes.com/cook/lindalmt"
}
]
,"description": "Soak your oats with milk, brown sugar, pecans, and coconut before bedtime for a ready-made breakfast the next morning."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rq1ojE9yZ4u_rXUa0V4bRk8Nh_I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1030747-19949d9a82404adfb1b4a24364fd2839.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Overnight Coconut Pecan Steel Cut Oats"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "68"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "347 kcal"
,"carbohydrateContent": "45 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "7 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "42 mg"
,"sugarContent": "9 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"0.33333334326744 cup steel cut oats",
"1 tablespoon unsweetened shredded coconut",
"1 tablespoon crushed pecans",
"0.5 teaspoon brown sugar",
"0.125 teaspoon ground cinnamon",
"0.33333334326744 cup milk",
"1 tablespoon milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix oats, coconut, pecans, brown sugar, and cinnamon in a small container; top with 1/3 cup milk. Cover and refrigerate for 8 hours or overnight. Stir 1 tablespoon milk into oat mixture before serving."
} ]
,"recipeYield": ["1"]
,"totalTime": "PT490M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Everett"
},
"reviewBody": "Excellent, tasty recipe that is ready the next morning. It’s great exactly as written. It also works well substituting oat milk for cow’s milk. Either way, you can’t lose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Surf and Turf"
},
"reviewBody": "Super easy, delicious and healthy. You can make this anyway you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy Gatto"
},
"reviewBody": "Excellent! I dislike cooking steel cut oats because they just take too long. This is the perfect fix! And the flavor is great! I added a little maple syrup, apple and figs, and used cinnamon sticks (broken into smaller pieces) instead of powdered cinnamon. Tonight (yes, I plan on making this often!) I will add more pecans and milk to the overnight mix. Try it - you’ll love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Windels"
},
"reviewBody": "I'm a type 1 diabetic so I look for breakfast foods that have little to no sugar and sustain me through the morning. This was DELICIOUS! I used Stevia vs. the brown sugar and heated it for a short time in the microwave. Yum! This will be my go to breakfast. I also lowered the carbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CCAPPUCCINO"
},
"reviewBody": "Great substitute for processed cereal! I prefer mine similar to cereal, so I made the following changes: *Increase Milk to 1 c. (Subbing Almond milk) *Replace Brown Sugar with 1 T. Real Maple Syrup *Add a pinch of salt *Add 1/8 tsp. Nutmeg *Add 1/2 T. Ground flax *Increase nuts to 2 T. Perfect base recipe with which to play around, resulting in numerous varieties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakeaholic"
},
"reviewBody": "Very tasty. It worked great with almond milk. Might even add some raisins next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Being new to steel cut oats, and loving them- I was so happy to see this new, easier/time saving way to prepare them. So far in have made them as written (using almond milk), added strawberries once and blueberries once, varying the amounts of coconut and pecans. Delicious! Excellent base recipe that works perfectly with alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jack Leroy Campbell"
},
"reviewBody": "Tasty but too gritty when soaked overnight. I prefer cooking them using box instructions and adding other recipe ingredients when finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia Robinson- Petersen"
},
"reviewBody": "I used almond milk and regular oatmeal. Next day I added cinnamon and almond extract before warming in microwave. After warming I sprinkled with coconut and pecans. Tasty!!!!\nI will definitely make again. Didn't add brown sugar because almond milk was a little sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ethel"
},
"reviewBody": "I needed to add more milk. Maybe my steel cut oats was very dry. I made it in the early evening &amp; checked it before bed. There was not enough liquid to absord so I added more. I do not like cold breakfast in the winter, so popped it in the micro for 90 seconds. Lovely flavor but really chewey. I usually cook a large batch of these oats in my pressure cooker then heat up a serving each morning. For me I will stick to that, but use this recipe ingredients plus more luquid. Really loved the flavor not the firmness, thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "manjit malik"
},
"reviewBody": "Power pack breakfast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna"
},
"reviewBody": "This was the first overnight oats recipe I've made and I loved it! I left out the brown sugar and added a splash of vanilla creamer instead. I also added way more coconut and pecans than it called for and had to use almond milk instead of regular. I had read a few reviews that the oats were too hard/chewy so I added more than an extra 1/3 cup of almond milk (I also had to compensate for the ground flax and rye flakes that are in the mix of oats I have) and the oats were perfectly soft and chewy. Will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Pulley"
},
"reviewBody": "This is a good recipe, and everyone else is right, it's actually very filling. It looks like it makes such a small amount, but it was plenty! I followed the recipe exactly, although I did heat it in the microwave for 1 minute after I added the milk in the morning. Yes, it will remain chewy, but it's very good if you like steel cut oats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidihb"
},
"reviewBody": "Great fast recipe. You can swap with different nuts/fruit and I added a touch of cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriT"
},
"reviewBody": "Delightful! I used unsweetened almond milk, sweetened coconut a bit more brown sugar. I am making it again tonight for tomorrow's breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Moutsopoulos"
},
"reviewBody": "Nice! I liked this more than I thought I would. Because it was what I had to hand, I used regular old fashioned oats instead of steel cut. I also added more cinnamon, used honey instead of brown sugar, used cashew milk, and skipped the nuts because I didn't have any. Even with all those tweaks it was delish! I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GrammyDi"
},
"reviewBody": "Made this recipe overnight as written, however, warmed in microwave for a minute and thoroughly enjoyed. Nice change of pace from my usual old-fashioned oats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Fletcher"
},
"reviewBody": "This recipe is great with the ingredients however, it must be cooked in the AM...I use the overnight soak method always because otherwise it takes a minimum of 35 min to get these oats soft and flavored. They still keep a chewyness but at cooked thru and will be soft like regular oatmeal when ready...IN THE MORNING ( I put the pan in the fridge overnight and cover with plasic wrap...take off plastic and add some milk..in this case half coconut milk / water or reg milk. Bring to a steady simmer and cook for about 10 min with the lid on and stirring occasionally as well as adding additional liquid you like to keep it able to absorb and soften. I also check for sweetness throughout the cooking time so its perfect . Depending on how you like your oatmeal , more or less liquidity you will add or remove lid at the almost desired softness and reduce liquid.\nThis will give you amazingly wonderful oatmeal thats not got any raw taste. .cooking tome totally depends on your desired softness/texture of oatmeal. .10 min is a start but I have definitely had to cook a bit longer sometimes after the overnight soak...THESE TAKE A LITTLE time to get down WHAT time gives YOUR desired softness and texture...ANY FRUIT..like pineapple, apples (granny smith recommended, mangos etc) just cut small and soften in a skillet of butter and brown sugar until like a pie filling consistently amd add this to oatmeal at the time the oatmeal starts to simmer and cooking it in oatmeal. .I usually prep that t"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BPMargieD"
},
"reviewBody": "PDQ &amp; PDG- Pretty Darn Quick and Pretty Darn GOOD!! Very surprised this came out so well. I did use Bob's Red Mill old fashioned rolled oats instead if the steel cut and added a Tablespoon of brown sugar and some raisins. In the morning, added the splash of milk and I nuked it for 1 minute. So easy and so good on this frigid winter morning!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjusti"
},
"reviewBody": "I didn't like the 'raw' or the brown sugar, used almond milk &amp; added another 1/3 water &amp; heated in the morning- OMG We all LOVED it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Eleazer"
},
"reviewBody": "I used the unsweetened coconut with coconut milk. It was so good!! I loved it and so does the family. Will definitely be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "Ate it for breakfast this morning, wow! It was great, nice and chewy which is how I like it. I used quick cooking oats, my husband bought them by accident and I thought that they would be good for this dish. I also used light vanilla soy milk as I don't use cow's milk, it turned out fine. I heated mine up before eating. I have already put batches together to take to work for breakfast this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Snyder"
},
"reviewBody": "After reading other user's comments, I was concerned about the toughness of the oats. I used 3 min steel cut oats, worked like a charm. I love steel cut oats on the weekend, but they take too long to cook for busy weekday mornings. This is an excellent alternative, and it sticks with me all morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karon Davis Giles"
},
"reviewBody": "We normally make ours with almond milk. Also have added things like cranberries, green apples, nutmeg, walnuts, etc. Great basic recipe for those morning you want something different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aselill"
},
"reviewBody": "Wow, I love this easy breakfast. I am making it all the time, but I usually don't follow the recipe. There is so much you can add to this, peanut butter, jam, berries or whatever you like. I love it cold, cooked it once but like it best cold. I don't even feel the need for any sweetener or sugar, and I also like it plain with milk only."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "manella"
},
"reviewBody": "Wonderful oatmeal recipe. I use gluten free steel cut oats and i only had almonds so used those instead of pecans.This is a great way to start the day and will be my go to breakfast. Thank you Linda(LMT) for your recipe i did enjoy it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "France C"
},
"reviewBody": "I think I finally found my go-to overnight oats recipe! I've always made overnight oats with regular old-fashioned/rolled oats and wasn't that big of a fan. I love steel cut oats but it never occurred to me to try it in overnight oats. I absolutely LOVE the chewiness of the oats. This doesn't seem like it makes a lot, but it's actually quite filling. The only changes I made were to use unsweetened cashew milk (bc that's what I tend to have on hand nowadays), I used half the pecans and I used flaked coconut (larger pieces) instead of shredded. With these changes, the calorie count was 271. I was so happy to have made this last night bc this morning I woke up late for work and otherwise wouldn't have eaten breakfast. A perfect on-to-go breakfast! I like putting my overnight oats in small canning jars. For those who can't find unsweetened coconut, Bob's Red Mill makes some, so check that section of the store. These oats won't get soft, so if that's what you're looking for, you're better off sticking with a cooked oatmeal recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LJOY"
},
"reviewBody": "I made this according to the recipe submitted, but I think there are probably limitless variations. Very easy. Very good. I prepared five containers of dry ingredients and then prepped one every night with milk. In the morning I added a little more milk, put on the lid, and out the door I went."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whachagotcooking"
},
"reviewBody": "I eat oatmeal everyday for breakfast and have done this since 2002. I really love oatmeal! So I decided to try this recipe. First of all- it's very good and I really liked it! But I can relate to some reviewers who thought it tasted somewhat raw. Personally I really liked the texture and the nuttier taste. I didn't use pecans or coconut however. I also heated it in the microwave for 2 minutes before I ate it. I can't imagine eating cold oatmeal!I will definitely make this again and try adding walnuts. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gsoak"
},
"reviewBody": "This is delicious! I followed the recipe exactly but it would be easy to substitute other ingredients to mix in if you prefer. My two year old even gobbled it up, which really surprised me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "This recipe grew on me and I have made it three times now. First time I thought raw oatmeal this is just too weird to eat. Then, I ended up sprinkling on a little more brown sugar and eating it all. I accidentally bought steel cut quick oats instead of regular quick oats. I came upon this recipe looking to use them up. Only change is using a quick type of steel cut oat and adding 2 teaspoons of generously packed brown sugar to the oats. Still has to be healthier than the alternative breakfasts I have eaten. I like cinnamon, but I have found I like this better without it after adding the extra brown sugar. A review posted here mentioned heating it for a minute before eating. I may try that too. ty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsoofie"
},
"reviewBody": "I. LOVE. THIS! The combo of flavors is perfect, and it could not get easier. Yes, the texture is chewy but I read the reviews before making the recipe and I don't mind it. These steel cut oats are very filling, and hold off my hunger like nothing else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cjgrc"
},
"reviewBody": "This is a great recipe for those who are rushed in the morning. Other reviewers did not like the texture from the cooked method but personally I liked it! It's soft but still firm, best way to describe it would be whether you like steamed crunchy veggies or mushy veggies. * I used almond milk (personal preference) and my kids did not want coconut or pecans. It was delish!So many possibilities with the basic concept of this recipe. I will definitely be experimenting with different variations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bets"
},
"reviewBody": "Love this recipe! Easy and delish! Add what you like (more sugar, less coconut)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sevastopol"
},
"reviewBody": "Don't make it if you expect it to soften a lot. It's the same chewiness as the raw coconut and pecans. If that wouldn't bother you, go ahead and give it a try! I also recommend adding a few drops of vanilla or almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nighat"
},
"reviewBody": "Very good! I used sweetened coconut flakes since Walmart did not have unsweetened one...and I used crushed walnut instead of pecans. I loved the taste. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "Love this, found making it two days ahead and heating before serving makes it a hit. Took it to my monthly breakfast club and everyone raved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sumerelaine"
},
"reviewBody": "I used natural almond soy milk, no pecans or brown sugar, and added honey and it came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tready"
},
"reviewBody": "I pre cook my Groats and keep in a container in the frig for quick serve. So, I just added it all together and nuked it in the micro. Came out pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Newman"
},
"reviewBody": "Excellent flavor! I cooked mine for 5-7 minutes before serving, takes that chewiness away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "N5232P"
},
"reviewBody": "Basically this is a version of a European dish call Muesli (Swiss). I almost doubled the recipe but didn't need to. I am a big guy at 6'2\" and even though it does not look like a big serving it is hearty. I think next time I will serve it over some sliced Banana , raisins or other ripe fruit. I used some half and half on top too. Lots of ways to have fun and tweak the recipe to your liking. If you feel this is too firm for your pallet, just cook the oats a little before you put it together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gogirlrun"
},
"reviewBody": "This recipe was great. The flavors meshed together exactly to my liking. I had a small bag of crystallized ginger chips on hand and added apps 1 teaspoon to the mixture. Loved it. Easy and quick to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pippin"
},
"reviewBody": "Very yummy and hearty breakfast. I've made it with cow's milk and with unsweetened almond milk. Both were great. I heated it for about a minute in the microwave before eating and it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Volleyballmom"
},
"reviewBody": "Made these for hubby. Trying to get him to give me words for a review was like asking a teenager. Here's what I got...he liked the chewy texture and it reminded him of cereal.(ya think?) They were tasty and he wants them again. :) I used lactose free milk as I do for all recipes that call for milk. I like that I can prepare this the night before and still know that he's getting a nutritious breakfast. This is such an easy recipe and a keeper! Thanks linda(LMT)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristi S"
},
"reviewBody": "Good flavor and great idea for busy mornings but I preferred it heated up. Used regular old-fashioned oats since that's what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "linda2d"
},
"reviewBody": "I liked this for a change and will surely make it again. It was an oddly chewy texture, more than I expected. The flavor was good and it was definitely filling. I haven't had soaked steel cut oats before so I would think the texture is something that grows on you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mclainart"
},
"reviewBody": "I felt like I was eating raw oatmeal. Even after I heated it up it was too chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dmaw234"
},
"reviewBody": "I made this exactly as written, and felt it to be 3 stars... Heat it for 1 minute in the microwave and it becomes 4 stars! Super easy, and makes the perfect amount. I will be making this again and trying different ingredients too - raisins would be a great addition. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Plourde"
},
"reviewBody": "Great flavor combination! Made exactly as written - just felt that I was eating raw oats the whole time, which wasn't horrible, just very chewy. I think our family would prefer it cooked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alhall84"
},
"reviewBody": "YUM! I didn't have unsweetened coconut, but it was great, very adaptable and great nutritious breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOUSIE206"
},
"reviewBody": "This was delicious. Looking forward to eating it all week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rina McDaniels Shaffer"
},
"reviewBody": "Love that this is \"no cook\", but I do warm it up the next morning. Didn't have coconut and went with raw organic honey for sweetness. Can't wait to add other healthy goodies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "spicycook"
},
"reviewBody": "Wonderful flavor, but not with steel cut oats. I soaked them for two days and they were still hard and very chewy, but not in a good way.I put the whole thing in a pot on the stove, added some water, and cooked it for 20 minutes. It still wasn't cooked thoroughly. Old fashioned oats would be fantastic though. I look forward to trying it that way next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "Oh Yum! This is a great no-cook method that's so easy and delicious plus the \"night before\" prep makes this perfect for busy mornings when you want something healthy but don't have time! This not only tastes good, but is good for you too. I had regular coconut on hand and used 1% milk to lighten it up a bit. This is also great to use your favorite add-in's like a little nutmeg, raisins, dried cranberries or cherries. Thanks for a great recipe Linda (LMT)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I didn't have unsweetened coconut, I used the regular sweetened I had on hand. I also used a packet of Truvia instead of brown sugar and lowfat milk. This was absolutely delicious. Very filling breakfast. Next time, I would double the coconut and pecans but that's really a personal preferance, not reflective of the recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223483/overnight-coconut-pecan-steel-cut-oats/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
"name": "Cereals"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1315/breakfast-and-brunch/cereals/oatmeal/",
"name": "Oatmeal Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223483/overnight-coconut-pecan-steel-cut-oats/",
"name": "Overnight Coconut Pecan Steel Cut Oats"
}
}
]
}
}
, "about": [
]
}
]