				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Paella I"
,"datePublished": "1999-07-07T00:58:52.000-04:00"
,"dateModified": "2022-08-04T11:40:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Christine L"
,"url": "https://www.allrecipes.com/cook/24321070"
}
]
,"description": "A very traditional paella, garnished with chorizo, chicken, peas, squid, mussels, and shrimp. Spanish Chorizo is a smoked sausage with a different flavor than Mexican chorizo. A paella pan is recommended for this recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/oofsNrmuTFaQsBMa-bh8FUqgDLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2337092-27e7b3d532cf44e9b1462061e8251527.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Paella I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "192"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "524 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "106 mg"
,"fiberContent": "3 g"
,"proteinContent": "29 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "1162 mg"
,"sugarContent": "5 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"4 tablespoons olive oil",
"1 onion, chopped",
"2 cloves garlic, minced",
"1 red bell pepper, chopped",
"4 ounces Spanish chorizo (cured spiced pork sausage), casing discarded and sausage cut into 1/4-inch dice",
"2 skinless, boneless chicken breast halves - cut into 1 inch cubes",
"1 (12 ounce) package uncooked Arborio rice",
"5 cups chicken broth",
"0.5 cup white wine",
"1 sprig fresh thyme",
"1 pinch saffron",
"salt to taste",
"ground black pepper to taste",
"2 squid, cleaned and cut into 1 inch pieces",
"2 tomatoes, seeded and chopped",
"0.5 cup frozen green peas",
"12 large shrimp, peeled and deveined",
"1 pound mussels, cleaned and debearded",
"0.25 cup chopped Italian flat leaf parsley",
"8 slices lemon, for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat olive oil in paella pan over medium heat. Add onion, garlic and pepper; cook and stir for a few minutes. Add chorizo sausage, diced chicken, and rice; cook for 2 to 3 minutes. Stir in 3 1/2 cups stock, wine, thyme leaves, and saffron. Season with salt and pepper. Bring to the boil, and simmer for 15 minutes; stir occasionally."
} ,{
"@type": "HowToStep"
,"text": "Taste the rice, and check to see if it is cooked. If the rice is uncooked, stir in 1/2 cup more stock. Continue cooking, stirring occasionally. Stir in additional stock if necessary: use up to 2 cups additional stock, 5 cups total. Cook until rice is done."
} ,{
"@type": "HowToStep"
,"text": "Stir in squid, tomatoes, and peas. Cook for 2 minutes. Arrange prawns and mussels on top. Cover with foil, and leave for 3 to 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove the foil, and scatter parsley over the food. Serve in paella pan, garnished with lemon wedges."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "This seems more like a risotto than a paella to me, but it was very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie"
},
"reviewBody": "Agreed with the switch to Goya's parboiled rice. Used 3 cups of rice - 6 cups of chicken stock with 2 packets of Sazon Goya disolved in the liquid. Used skinless chicken thighs- shrimp, scallop and clams. Used 2 cans of diced tomatoes (drained). Great recipe. Good portion size with 6 adults. - couldn't find safron so added tumeric."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndreaZ"
},
"reviewBody": "I added a little more chorizo and an extra pinch of saffron. This has become one of our favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ERIC H"
},
"reviewBody": "This was great. I used Yellow Spanish rice and made it for 10 hungry Firemen. So the logistics changed a little bit basically cooked all the peppers, onions and meet. Added all the rest of the ingredients and cooked until the rice was done. Then added the seafood for the last 5 min. This was an outstanding meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim S."
},
"reviewBody": "I substituted sea scallops for the squid, just cut up about 5. Recipe was quite tasty and well received by husband and 5 year old. Also used a dash of drugs thyme as I didn’t have any fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Orlando Ceballos"
},
"reviewBody": "rice was a little mushy. I probably used too much broth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Challenged Chef"
},
"reviewBody": "After ready all he reviews, I only used 2 cups of broth until the end. Once I made sure rice was not gummy, I added 1/2c broth. Added shrimp at tomatoes/peas stage. Omitted squid and doubled the shrimp. Used full 1/4t of saffron and 1/4t of red pepper flakes. I omitted the peas, but they would have added color. Served at a Catalonian themed dinner and it was a big hit!! Fairly easy to make. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brandy d "
},
"reviewBody": "So good and so pretty. Love that it’s all in one pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "My favorite Paella recipe! I also add little neck clams."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Juliana"
},
"reviewBody": "this was the first time making this and made no changes. Everyone loved it. Thanks so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "juan Rodriguez"
},
"reviewBody": "I followed this recipe as close as I could to the instructions. It was risotto with seafood and not good. I had my doubts when I saw that the tomato is added at the end. Paella is not supposed to be white! I’ll try a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dawn Kiefer Hall"
},
"reviewBody": "This was easy and was ok. My family wasn't wild about it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Sutton-Wright"
},
"reviewBody": "Good start to a great paella"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari Bennett"
},
"reviewBody": "Delicious! Used my new paella pan received for Christmas. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich d"
},
"reviewBody": "Excellent recipe, I would use little necks next time instead of mussels"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Me"
},
"reviewBody": "I made some substitutions since this was made on the fly. Scallions not onions, vegetable broth not chicken, added lemon zest and used frozen bag of seafood mix, had to decrease broth to compensate for frozen stuff...Turned out awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Ervin"
},
"reviewBody": "I added a dash of Adobo seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Brownson"
},
"reviewBody": "Very easy. I used frozen mixed seafood and frozen shrimp and it turned out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AbiM"
},
"reviewBody": "Excellent recipe! I cook it mostly as is and use Goya California Pearl rice instead of Arborio. The amount of liquid needs to be adjusted accordingly. Start with 2 cups, plus the wine and then add as needed (per bag of rice). I also make this on either a charcoal grill or on my Traeger to infuse a char-grilled flavor. Once the rice and liquid goes in, no more mixing to develop a little crust. Last but not least, easy shortcut is to use frozen seafood medley from Costco instead of fresh seafood to seriously cut down on cooking time. Always a hit with the family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine50"
},
"reviewBody": "Easy to make and excellent tasting. I just had a hard time finding saffron and had to use turmeric."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Barker"
},
"reviewBody": "Absolutely delicious. I ended up using all of the liquid and maybe even a bit extra chicken broth. I did not use squid, but added scallops. I used ground chorizo (store didn't have the other) and a bit of extra saffron. I'm excited to eat the leftovers tonight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IFortuna"
},
"reviewBody": "Great recipe! Some folk don't like the use of Arborio or Carnaroli rice. If you cook it properly is does not come out like risotto. I have cooked it the way I cook regular rice. The more you stir the rice the creamier it gets. Let it cook covered like regular long grain rice. Here in Texas, we can buy our Spanish dry cured chorizo at our grocer in the deli section. Mexican chorizo ( a fresh chorizo) we buy in the sausage section. Also, iGourmet Online has a few varieties. It is easy to find when you know where to look. Sorry to say, I hate squid so I add other seafood such as clams, octopus, sea bass or other white fish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Narra"
},
"reviewBody": "It was delish but the rice is wrong. The rice is way to mushy for paella. It’s a rice one should for risotto not paella. I also added more safffron. And I added smoked paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca@gardenemail"
},
"reviewBody": "I made this with Bomba rice versus the Arborio rice. Arborio is more like Risotto and Bomba doesn't get creamy and sticky; it absorbs more liquid. Also, I doubled up on the mussels, substituted clams for squid and used the contents of an entire jar of McCormick Saffron (which isn't much) and the result was magnificent! We will be making this many times in the future. Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon C"
},
"reviewBody": "love this recipe as is or ramp- up. I used 1-1/2c wine,more rice, chicken broth, doubled the seafood to include crab meat, more than a pinch of saffron(4g) and season to taste to serve 14, all done in electric skillet. it was a rave....for the rice not to be creamy, its important to saute in the hot oil for about 5 mins or so then add the liquids wine first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Ray"
},
"reviewBody": "This recipe had great flavor, but was too WATERY. I substituted parboiled rice for Arborio rice. Be very cautious using liquid, better to add more liquid as needed. The Spanish chorizo really added extra flavor. I will slice circles, rather than mince it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiger Karma"
},
"reviewBody": "Delicious recipe and turned out tasty and filling. I did exchange the arborio rice for Basmati Rice. Basmati was lighter and fluffier and easy to work with. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mofun"
},
"reviewBody": "This was tasty and made a lot of food! No squid or mussels. Added paprika &amp; hot pepper, used brown rice. Next time will use a full pound of chorizo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Jackson"
},
"reviewBody": "I used saffron threads and clams instead of mussels. It was absolutely delicious. Looking forward to making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zarsky"
},
"reviewBody": "This was a hit! I made a couple of changes based on reviews. I warmed the saffron threads in some of the chicken stock ahead, used long grain basmati rice and added liquid as I went so that it was just right. I also added 3/4 cup of white wine instead of 1/2 cup and about 1/2 tsp sweet paprika. Everything else was per recipe. Glad I went through all of the recipes and reviews in advance. Definitely will make this my go to recipe for paella!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "No changes made to recipe, will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sharon Meneian"
},
"reviewBody": "It was good but I would use basmati rice instead if the short grain rice next time. Rice was kind of mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myra Salguero"
},
"reviewBody": "I will make it again! My family love it \nInstead of chicken breast I used chicken wings drumstick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luther Utt"
},
"reviewBody": "This is absolutely great. As several have said before, this is time consuming but oh boy is it worth it. I did follow the instructions with a couple of minor exceptions which related to time constraints. I did not add the squid nor the mussels. Also in this recipe it calls for adding the shrimp at the end by simply placing them on top after everything is cook and covering with tin foil for 5 minutes. Sorry, but that is not cooking the shrimp and besides, I'm of the believe that cooking the shrimp in the dish from the beginning adds to the incredible mixtures of taste. Everything else I followed (oh, I didn't seed the tomato). This is just a great, great dish that will wow the socks off anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cstone0771"
},
"reviewBody": "This didn't fit into my paella pan so I made it in my electric frying pan. It was delicious. And everyone loved it! I did not used the squid and subbed clams for mussels. I will definitely make this again. It helped that I prepared all the ingredients earlier and just put it together when my guests arrived. Easy to make for 5 to 6 people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda DeCouto Paulos"
},
"reviewBody": "I actually did not have arborio rice but used short grain rice. The kids were studying Spain so I made this as a bit of a taste of Spain dish. I didn't think they'd go for squid so I substituted clams. The seafood lovers thought it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Honey Strollet"
},
"reviewBody": "substitiuted chorizo for pork with a chorizo marinade and mussels for salmon and squid for chickpeas and the dish still held its integrity"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebbyJean"
},
"reviewBody": "This was delicious. Made it for friends and they loved it. Could not find Spanish choriz so I subbed Kielbasa. Added some clams also. Really versatile dish. Used arborio rice and it turned out great. It did take me way longer than the time stated to prep and cook (more like 4 hours total) but it is so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassandra Kjos"
},
"reviewBody": "Delicious, and instructions are actually not too hard to follow! My Mom is ethnically Spanish, &amp; when I lived at home she used to make awesome Paella, on special occasions such as birthdays etc. But she hates to write her recipes down. \n\nFortunately, this recipe is just about identical to the Paella my Mom used to make! Definitely a keeper, I am going to save this recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Delicious meal! Once I gathered all of the ingredients, it was really easy to put together, was a massive portion feeds way more than 6 people. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Fantastic!!! I did make a few substitutions with lobster and jonah crab claws as squid and mussels were not available at my local grocery store today. Also used long grain white rice that I had on hand. Other than that, I followed the recipe to the letter to keep the integrity. I've had paella at high end restaurants that were nowhere near as tasty. Thank you Christine for the share. Definitely will be making this again and again. Delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jules"
},
"reviewBody": "First time ever to make/eat paella and found it very easy to make. But moreover a meal that all my family enjoyed, which us a rarity nowadays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Roberts"
},
"reviewBody": "easy to make, and really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taylor Hilson"
},
"reviewBody": "Took longer than stated to simmer down. The end result was slightly wetter than I expect a paella to be, however it tasted amazing and very much like the paellas we have had abroad. Will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia"
},
"reviewBody": "Yummy! Used Spanish rice and doubled the wine :) turned out really well. Big thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Kleiner"
},
"reviewBody": "Worked out fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooksalott"
},
"reviewBody": "I made this recipe exactly as the original and it came out fantastic. I do not have a paella pan but I used my electric skillet and it did the job very well. The arborio rice cooked perfectly and my husband told me this was the very best meal I ever made (I have been cooking for him for 26 yrs) and said it was much better than anything in a restaurant. I would recommend, however, removing salt from the ingredient list due to the saltiness of the sausage and broth. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Feeser Taylor"
},
"reviewBody": "Absolutely Delicious. Used medium grain rice and just had to test it for done-ness. You can change this recipe up for whatever ingredients you like and it will work well. Wilw make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bryanziebart"
},
"reviewBody": "Took quite some time to prep everything but it was definitely worth it. This dish is great. I strongly recommend using a paella pan as to ensure an even distribution and to get that nice crispy texture on the bottom layer. It actually isn't too expensive to prepare everything for this either... Probably $25 if you get your saffron at Trader Joe's and seafood at Costco. The Costco 2.5 lb frozen seafood medley is perfect. Highly recommended all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abiris"
},
"reviewBody": "Excellent! I made minor changes. I added smoked paprika, omitted the squid and mussels. If I had mussels, I would have added them! Arborio rice was a great choice. Thank you for this fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "Peculiar as it may seem, I used basmati rice with this (although I had arborio at hand) and it turned out wonderful.\n\nAnd don't forget to drain the oil from the pan before adding the wine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hraefn"
},
"reviewBody": "Very good. Rice ended up very overdone because the medium-grain rice I used did not need the full 15 minutes. Will try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie"
},
"reviewBody": "I made this dish with bay scallops rather then the squid. I received rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geebz"
},
"reviewBody": "This was great! I compared it to the one that I normally make and this is a nice spin. I like the addition of white wine with the mussels. The family seems to like it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Great recipe, pick the proteins that you like. I also added hot pepper flakes and next time will also add cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Alston"
},
"reviewBody": "This is a wonderful dish. I substituted chicken thighs for breast meat because it's more tender and used scallops in place of squid because that's what I like. I also used a can of Rotelle tomatoes for an extra kick instead of fresh tomatoes. Large skillet with a lid is perfect...no room for a paella pan in my kitchen. Thanks for sharing this wonderful dish and the picture which drew me in to try it--beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan Bertram"
},
"reviewBody": "Made this last night &amp; it was delicious! I live in a small town in the South so squid &amp; mussels were not available. Substituted 1 lobster tail for squid &amp; clams in shell for mussels. Reduced broth based on other reviews. Also used Uncle Ben's rice based on other reviews but will try arborio w/reduced liquid next time. I consider these minor adjustment because the flavor was \"off the hook!\" Thank you for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lilchefdeebo"
},
"reviewBody": "All in all this is a good recipe, although, I agree with MIAX. Arborio is definitely the wrong choice. It has too high of a starch content. Regular long grain white rice does a fine job, just be sure to adjust temperature and time, as it is not as dense as arborio."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SharonO"
},
"reviewBody": "I had no musells, so I doubled the shrimp and added craw daddies. I added 5 small trout fillets, they needed to be used. I omitted the wine and used home made broth and dried parsley. I loved this rice in this dish, to me the creaminess is a plus. I will do this dish again, soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aly baby=]"
},
"reviewBody": "very nice, made a few adjustments, but nice taste. make it your own."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ariel Michelle"
},
"reviewBody": "This was very good! The proportion of the ingredients seem just right. I made this vegetarian- style, without chicken, chorizo, or chicken broth. I instead boiled water with seasoning and then added the rice and cooked til done. After cooking the shrimp with the chopped tomatoes, I added the rice, peas, and more seasoning to taste. Little tip: MSG is found in some seasonings and some people have reactions to it. Some might get headaches, skin rashes, etc. from it. This recipe was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Ho"
},
"reviewBody": "Everyone loves it. Never go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "[H]"
},
"reviewBody": "LOVED this! Very easy to follow and it turned out very very good especially for a Paella first-timer! \r\n\r\nI never tried Paella because I thought it would be so difficult and that I'd flop in this.. but it really turned out quite well!\r\n\r\nIncidentally we also opened a very nice Rose wine from Australia and it was a perfect match!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette Wade"
},
"reviewBody": "This was my first time ever making Paella and it was a big hit. Everyone loved it! I will definitely make it again and may have to double the recipe because the four of us demolished it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OkinawanPrincess"
},
"reviewBody": "Quite an impressive dish! Very pleasing to the eye. Instructions were easy to follow, preparation took a little time especially gathering all the ingredients. This dish to begin with was a challenge for me but well worth it!! The Saffron threads is the key ingredient and it is a must for this dish. There is no substitute for Saffron. I soak a pinch in warm water first. This dish is full of color, texture and flavor. The arrays of shellfish, meats and sausage are what what makes this dish pop as well. This is worth the work involved, thou it is a costly dish to prepare (saffron, seafood, stock, meats). I did add a bay leaf and a pinch of red pepper flakes. The only slight change I made was to use long grain white rice instead of arborio and that is after reading what others stated about the rice being too mushy, and too much liquid. So I watched carefully when pouring in the liquids and made sure nothing got overcooked. I added the shrimp and pressed it into the rice. Shrimp does take about 8 minutes or so to cook all the way through. Instead of mussels I chose clams which were the last ingredient I put in and I placed them on top of the rice in a circle. I covered it with a lid and let the steam and heat cook the clams and open up. Before serving I sprinkled a generous amount of fresh chopped flat leaf italian parsley. I would certainly make this dish again but probably for a special occassion or family gathering. A truly authentic and wonderful dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K DUB"
},
"reviewBody": "Delicious! I used a 1 lb. package of rice, a large can of diced tomatoes, red wine (all I had) and only chicken, shrimp and mussels. Teenage kids thought it was just okay, but my husband and I really liked it. Not too hard to prepare, but impressive looking. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaS"
},
"reviewBody": "Incredible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tummy Tara"
},
"reviewBody": "This is such a good recipe. I gobble it up each time I make it. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MISSYLYNMITZ"
},
"reviewBody": "Super yummy! I used Mexican pork chorizo &amp; substituted scallops for the chicken, but I put the scallops in the same time as the shrimp. I also put in a lobster tail with the mussels. The lobster &amp; mussels needed a little extra time though. Sooooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wmosley"
},
"reviewBody": "I was scared to try this recipe but it did not let me down, i heard that saffron was expensive so i bought rice with saffron in it already and added extra rice, i also substituted seafood and near the end added fresh oysters, thawed frozen shrimp and scallops! Came out amazing but a little to much liquid, for the leftovers i sivved out the extra broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Morrison"
},
"reviewBody": "This was my first time trying to make paella. I was a little scared but it came out great! Didn't use mussels and squid but substituted scallops for squid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARSHMALO"
},
"reviewBody": "Really GREAT recipe! You may find some of the ingredients a little hard to track down. Instead of the mussels and squid, I ended up using a little less than pound of scallops and added them in with the peas and tomatoes. I also used canned tomatoes (drained) since I didn't have fresh. Otherwise, I made this as is and it was fabulous! This was my first time using saffron threads and I'm not sure it made a difference, but regardless, it was delicious! My only change in the future would be to add some white pepper for a little more heat. This one is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yulisa Otero"
},
"reviewBody": "I substituted the rice for parboil rice which is the rice used to prepare Paella in most restaurants and I followed the directions for adding liquids from the rice bag. I'm Cuban and have prepared Paella many times in the past and these are a few thing I recommend adding/omitting. I added 2 Lobster tails cut in pieces, scallops, little neck clams, more shrimps and a packet or two of Sazon Goya with achote which gives it more flavor and the yellow coloring. No Squids or thyme for me. Make sure you do not use the Mexican style chorizo, it's got to be the dried type that comes in a small suctioned package. If you can find fish stock use it instead of chicken stock. Paella can get expensive to make but if your trying to impress guest then this is it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Truly a remarkable, memorable dish. I've made this several times already (once for a dinner party - to elated, gobbled-up glee) and sometimes for some extras that I freeze for another night. The only successful \"changes\" that I've made, having prepared it a few times now, is to brown the chorizo and drain b4 adding the onion, peppers, and garlic, have the chicken pre-cooked and cubed, and to toss everything in a large skillet (less the seafood and peas, until prior to serving) and use Vigo brand saffron-flavored rice. Covered, it's typically ready in 40 min. and I haven't found the need for more than 3 c. chicken stock, 1/2 c. wine. I've even used canned, diced Rotel tomatos w/ no complaints. Oh and I'm happier w/o the mussels, so we skip on those. Absolutely amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RedFur"
},
"reviewBody": "My family loves this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Serena"
},
"reviewBody": "I admit, I did make some minor changes to the recipe. However, my rating for the recipe is based on the fact if you follow the directions you end up with a risotto consistency and NOT paella. The recipes calls for too much liquid. Despite knowing the recipe called for too much liquid, I went ahead and followed the directions and was greatly disappointed. For \"rice\" it's best to use 1 part rice and 1.5 parts liquid. When using arborio rice if you use more liquid you get risotto. 12 oz. of rice is 1.75 cups of rice - so the maximum amount of liquid you should use is a generous 2.5 cups. I omitted the white wine for religious reasons - but used 3 1/2 cups of liquid and ended up with risotto. Despite my best attempts to boil the extra liquid off it didn't work. With all that said I would highly recommend cutting back on the liquid by at least 1 cup - and adding more, if needed, as you stir occasionally. I also used soy chorizo (aka soyrizo) instead of pork chorizo. I recommend using 1/4 tsp saffron and 1/4 tsp of smoked paprika (or Spanish paprika). This will increase the flavor greatly and is more traditional. I would start with 1 tsp of salt and add more if needed (depends on how salty your broth is), use 1/4 tsp of black pepper. I used 1 cup of peas and I tripled the amount of shrimp. Overall it was tasty but disappointing. Next time I'll make it with less liquid and will most likely be pleased."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wafandben"
},
"reviewBody": "Turned out as more of a risotto than a paella, but was still delicious. I couldn't get my hands on anything except shrimp - still delicious and a lot cheaper! Still hunting for that perfect authentic Catalonian paella recipe... Substituted vegetable broth for chicken broth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dosvets"
},
"reviewBody": "This was my first attempt at Paella. I used mussels, scallops and large shrimp. Otherwise, I followed the recipe exactly. It was a huge hit with my parents, my nine-year old and me! It makes a huge batch and the leftovers were fantastic for lunch the next day. It was much easier than I expected and I will be keeping this one in my recipe box for a long time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megan"
},
"reviewBody": "This is a great recipe, and quite forgiving. I've made it several times with whatever meat/seafood I have on hand, although I always include sausage. I particularly like buying the frozen mixed seafood option from the grocery store, that usually contains squid, scallops, mussles (de-shelled), and it can go in frozen, just a bit earlier in the cooking process. Saves a lot of time and work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "maryyyy"
},
"reviewBody": "Very creamy and a little bland. I would suggest adding the squid AFTER the shrimp as it became very rubbery by the time the shrimp finished cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicianyc"
},
"reviewBody": "It took many stores for me to get all the ingredient for this dish and cost $50 -but it was well worth it! Restaurant quality paella. My only issue was that it was a little mushy and I should have actually timed and measured things. 6 servings is a joke, this is easily 10 adult meal portions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Garland"
},
"reviewBody": "I changed it a bit because I was lacking ingredients, I didn't have chorizo sausage, so I used a chorizo sausage recipe and just added the spices. Also I didn't have a red bell pepper so I added 4 roma tomatoes, my boyfriend usually picks out the bell peppers anyways. Other than that I followed to-the-letter, turned out AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ana Rodriguez Carrera"
},
"reviewBody": "you sould always use spanish chorizo, as the one they sell in stores in the States is mexican and completely different. Palacios chorizo is a fav of mine and i used to get it shipped in the States from latienda.com , do not remove the casings though. Also for the rice use a long grain, i do not know what brands, as i always buy the spanish ones. I am from Spain and paellas are a fav dish of mine and love to experiment! Recipe is a great one to start off with something simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jinnng"
},
"reviewBody": "i hardly cook and i used this recipe (slightly modified - used clams in place of squid) for a dinner party. it was an absolute hit and i even cooked it in a WOK. turned out great! will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gus3099"
},
"reviewBody": "This paella was very good and reminded me of what I had in Spain. I used brown rice however, and it took twice as long to cook so next time I'll use Arborio. The only things I changed were to add extra saffron (15 threads), 3/4 cup wine, and clams. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This paella was very good and reminded me of what I had in Spain. I used brown rice however, and it took twice as long to cook so next time I'll use Arborio. The only things I changed were to add extra saffron (15 threads), 3/4 cup wine, and clams. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura B"
},
"reviewBody": "Delicious and easy. Even my picky kids loved it! I used extra shrimp instead of mussels and squid. Other than that I followed the recipe exactly. Oh, and I let the shrimp cook for about a minute before covering and turning the heat off. This will be put in my family recipes to do again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sonasi"
},
"reviewBody": "This recipe is very good if you follow the instructions exactly. I don't like white rice, so I used basmati (Brown) rice. Since brown rice has a longer cook time, I began cooking the rice first (in 3.5 cups chicken broth, 0.5 cup wine and saffron). I added a little extra saffron since brown rice has a stronger flavor). Let the rice cook for 25 minutes, and then add the sauteed vegetables and other ingredients (except the seafood), and cook for another 20-30 minutes until rice is done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JENECOURT"
},
"reviewBody": "Excellent!! Easy, yet impressive dinner dish. I mostly stayed true to the recipe. Also made a vegetarian version that was just as delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "julie a"
},
"reviewBody": "This is very good, not perfect, but good. Arborio rice seems like a bad choice because it is too creamy. I used 1 1/2 cups medium grain rice and it was still a bit creamy. I think next time I will start out with only 3 cups broth. I also added the zest of one lemon. Don't skimp on the saffron - it's what makes it - and please don't substitute turmeric!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "girlnamedtom"
},
"reviewBody": "Excellent! Couldnt find muscles, so left them out. Peas didnt do anything but add a color, the color is great, but dont fret if you dont have a handful of peas. Other than the muscles we pretty much followed the recipe, we eyeballed our measurements... Turned out very well and we would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mollykathrynlewis"
},
"reviewBody": "Delicious, but I think the saffron was an unnecessary splurge b/c according to a native Spaniard, they just use yellow food coloring called \"colorante\" to get the yellow look. Also, you aren't supposed to stir it any more than you have to or it turns too risotto-y, and that's not the correct consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malinda"
},
"reviewBody": "Just love it and I am serving it to my family this Sunday"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Äileen Gore"
},
"reviewBody": "It was alot easier than I thought. I used clams instead of mussels, next time I will try it with mussels, I also didn't have any white wine on hand so I used red instead and it was still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snakemagic"
},
"reviewBody": "PERFECT. Used medium grain rice and full 5 cups of stock, although it ended up a little on the salty side so I may cut out adding the salt in the previous step or switch to a water/stock mix. Used baby octopus in place of squid, added 2 teasp of paprika and small amount of fresh chilli in place of saffron at the same time as adding the wine and it was divine! Highly recommended! Did this in a large fry pan and it served 6 although it was all gone!! Perfect with the lemon wedges!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillylicious"
},
"reviewBody": "This is a great recipe! It was perfect for a deluxe holiday dinner or potluck. It does make TONS of food - be prepared for leftovers. I didn't include squid (my guests don't like it) and I followed the advice of others and used Basmati rice instead of Arborio so that it wouldn't be too slimy. It was wonderful and everyone complimented it. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katrinangel2"
},
"reviewBody": "It turned out good, though I was disappointed in the flavor of the rice a little. I think a little saffron would have helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LDWeber"
},
"reviewBody": "This recipe was just ok. It lacked a lot of flavor, which we tried to compensate for by adding our own blend of spices. I would recommend that to anyone trying this. We added cumin, cayenne, and others. We did like the rice though...nice texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ckcederh"
},
"reviewBody": "This was my first time making Paella after having it at a restaurant in Costa Rica. I made it for my husband and some friends and they all raved over this recipe! It was easy and we all had leftovers for lunch the next day. I also added some turmeric when I added the rice to give it some extra color. And I used extra shrimp in the place of the other seafood simply to keep the cost down. I will definately make this recipe again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12728/paella-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/726/world-cuisine/european/spanish/",
"name": "Spanish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12728/paella-i/",
"name": "Paella I"
}
}
]
}
}
, "about": [
]
}
]