				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pancit"
,"datePublished": "2018-03-21T12:22:43.000-04:00"
,"dateModified": "2018-03-21T12:22:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ozzyzmommy"
,"url": "https://www.allrecipes.com/cook/23755"
}
]
,"description": "This is a recipe I got from a family from the Philippines. Rice noodles are pan-fried with chicken, pork, shrimp, cabbage and carrots."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xxslxPoxTF0qpIePQSJMKwTpnI4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/60188-283b0ba8c3914ec48135b44cbadbfea8.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pancit"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "88"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "484 kcal"
,"carbohydrateContent": "60 g"
,"cholesterolContent": "169 mg"
,"fiberContent": "5 g"
,"proteinContent": "40 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "2109 mg"
,"sugarContent": "6 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (8 ounce) package thin rice noodles",
"0.5 pound skinless, boneless chicken legs, cut into bite-size pieces",
"0.5 pound pork tenderloin, cut into bite-size pieces",
"0.5 cup soy sauce",
"ground black pepper to taste",
"0.5 medium head cabbage, shredded",
"2 carrots, shredded",
"2 green onions, chopped into 1 inch pieces",
"0.5 pound shrimp, peeled and deveined" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place the rice noodles in a large bowl, and cover with warm water. When soft, cut into 4 inch lengths, drain, and set aside."
} ,{
"@type": "HowToStep"
,"text": "In a skillet over medium heat, brown the chicken and pork until no pink shows. Season with soy sauce and pepper. Remove from skillet and set aside. Saute the cabbage and carrots until tender. Stir in the noodles, green onions and shrimp. Cook for 4 to 5 minutes, stir in the chicken and pork, and cook for 5 more minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny"
},
"reviewBody": "Just like I remember as a child"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnn Plett"
},
"reviewBody": "have made this twice and both times it was a winner.. its just me now and the left overs heat up great and so Wonderfull even heated up the next day... I have even frozen it as well... with no problem..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "I've been SO wanting to try a pancit recipe, but was so sure I couldn't make it like my neighbor does (she's a Filipina). But I saw this one, and it looks just like hers does... and it has the same ingredients... and since she just moved back to the islands a few days ago, I decided to give it a try. FANTASTIC!!! I found the instructions to be very easy to follow, everything came together well, and the only thing I changed is I added 3 T of sesame oil simply because I love the taste of it. Before making it, I even checked with my local store/restaurant Philippine Cuisine, and the owner checked over the recipe and said yep, authentic, you can do it! lol AND I DID!!! Thank you SO much for posting this, it will become a staple in this family! OH...and I cut it down to 4 servings in the recipe adjuster, and it's closer to 6 servings, so we'll have tons of left overs! YAY!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Scott"
},
"reviewBody": "I used flour noodles placed in hot water about five minutes to just under al dente. Poured the veges over the noodles and let it rest about 30 minutes. Then added the shrimp and green onions and stirred. Turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Johannes Atts"
},
"reviewBody": "no changes....The directions could be a little clearer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Pryce"
},
"reviewBody": "Came out great. I put a small twist with more veggies and spice, but this dish is great! Recommend for a quick nice dish on a cold day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Alwayssmiling Flemin"
},
"reviewBody": "Family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AndTheKitchenSink"
},
"reviewBody": "My family grew up eating Pancit ! We lived on \nA Navy base in the early 80s and the Philippine neighbors would make this and shared the recipe with my mother. Maybe not 'authentic' but really is a lot more flavor with the addition of oyster sauce and it was used by the Philippine family. We made it with pork &amp; shrimp. I could live off this dish... oysters sauce or not! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "food lover"
},
"reviewBody": "My family loved the recipe. I added a twist by drizzling some sesame oil on top, before serving. They can't wait for the next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shemeka "
},
"reviewBody": "I found this recipe and made the dish 3 years ago according to the picture I posted! it's still a hit with my family! I use lower sodium soy sauce now and it's still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keolamom"
},
"reviewBody": "As someone who is ACTUALLY Hawaiian. The noodles that she is referring to with the oyster sauce and \"BBQ pork\" aka Char Siu is Chow Mein which is actually a Chinese dish NOT Filipino. This recipe is very similar to the traditional pancit recipe that I'm used to. And yes, I actually use fish sauce in mine as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mz Yaka"
},
"reviewBody": "Overall, I think this is the most authentic recipe that I have found. We've spent a few years on Guam. This dish was a steeple at any fiesta or get together that we had. I am not a huge meat eater, nor do I personally care for much seafood. So, I used the base of this recipe to create my own.\n\nI would recommend using just a touch more soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roger & Laura"
},
"reviewBody": "I followed the directions regarding the basic recipe however I couldn't help but throw in bok choy, red cabbage, a little onion and a couple of eggs. I will cut back on the soy sauce next time, add fish sauce and sesame oil. Overall it was very good and even my kids liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Scogin"
},
"reviewBody": "This was actually easy to make and allows for adding your own special touches. Next time I'll add spring peas and boccoli. The texture was wonderful, the crunch of the cabbage. I just used regular cabbage and it was fine. This will be a crowd-pleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yesenia"
},
"reviewBody": "Yummy added snow peas and teriyaki sauce I used what I had. It came out yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Reminded of a dish I got to enjoy as an Air Force brat. Filipino neighbors prepared this dish and this recipe tastes just like it! Family hit first time out...outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Galarneau"
},
"reviewBody": "This is sooo good and exactly as I remember my mother's pancit tasting. We squeeze lemon over ours. I've cooked this a couple of times and we added snow peas once just because we like them. We had lumpia too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Halyard"
},
"reviewBody": "Great flavour....but too much noodles. We'll cut down on those next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cg5285"
},
"reviewBody": "I made this tonight!!! It's not quite like my Papa's but it was good!!!! I'll be making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Prosperini Kilwy"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pairofbluebirds"
},
"reviewBody": "Delicious. My husband said if it came a takeout container he would not have known the difference. I added a few tablespoons of vegetable oil and a chopped yellow bell pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MrsCliffordLeopold"
},
"reviewBody": "I took the advice of the Pancit Vets on here and mine came out goopy. the flavor however isnt bad but im going to use low sodium soy and reduce the liquid next time because it was salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole S.R. Flores"
},
"reviewBody": "This is Amazing! I'm from Guam and we make this dish - This recipe is so much better, Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tvmw"
},
"reviewBody": "I've been trying to re-create the flavor of pancit that a filipino friend of mine made several years ago. The taste of what I sought was etched in my memory. This recipe was a wonderful blueprint to help me on my way. Pancit is a very versatile dish and additional vegetables can be added ad lib. In my case I added diced baby bella mushrooms, 4 cloves minced garlic and 1/2 sliced onion. I remembered sliced celery and sprouts included in my friends rendition. As I only had boneless chicken thighs for meat that's what I used. I wouldn't hesitate to also include diced dry fried tofu. The cabbage and carrots are a must. To season I used about 1 T. fish sauce and about 1/4 c soy sauce. One other preparation note that I thought added to the flavor but not necessary was after soaking and draining the noodles, I brought to a boil my favorite broth and cooked the noodles about 3 minutes. This softened them enough to eat then, I just pulled them straight out of that pot into the skillet everything else was. I used a bit of the broth to help disperse the fish and soy sauce. Added another generous sprinkling of freshly ground black pepper and it was a wonderful and healthy meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey Ferrari Posner"
},
"reviewBody": "Tastes just like my friend from the PI used to make all the time. I have been looking for a recipe for a long time and finally, this is the one! It is so versatil and you can put practically any meats or vegetables into it. This one's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prettysmile"
},
"reviewBody": "Everybody's cooking their own idea or modification no judge if they don't like the taste. Luzon Mindanao Visayas cook diferently to all Filipino's and Filipina's no judge to other pinoys recipe if you have your own recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kalehla"
},
"reviewBody": "Try substituting soy sauce with Maggi seasoning. It tastes better and is not as salty. Also, add chinese sausage cut into bit-sized pieces. . When you are ready to turn off the stove, add 1 tbsp fish sauce (patis) and cilantro. You kitchen will smell like heaven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MReinecke"
},
"reviewBody": "This is the closest thing to authentic an American gal can make without having Filipina standing right beside her. LOVE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meyer"
},
"reviewBody": "Love it! Every time I make this for an event I get many compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Caroline"
},
"reviewBody": "This is my new favorite poor person meal and one of my new favorite overall go-to recipes. \n\nWhat do I mean by poor person meal?\n\nRice noodles: $1.19\nBag of carrots: $1\nNapa cabbage: $1.20\nGreen onions: $0.80\nMisc meat: $3-6\nSoy sauce and pepper: in pantry\n\nTotal: about $7-10 and makes a ton of food! When they say 4 servings, one serving actually fills you up! That's $1.50-$2.50 per meal, and it's freaking delicious. \n\nI will never go to my local Chinese takeout place again for pancit when I can make it myself just as good for cheaper and get about 3 times as much.\n\nP.S. If you don't have enough soy sauce, fish sauce is quite good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MattOlay V-H"
},
"reviewBody": "Very close to how we make it. We like ours just with pork and shrimp or pork itself. My mom would use pork belly sometimes. The choice of veggies are carrots (long matchstick), cabbage, celery, snow peas, onions, &amp; green onions. Oh, I also added minced garlic just because I love it. To prevent everything from drying, I had to add a little bit of broth. I love to squirt lemon or calamansi on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kie"
},
"reviewBody": "Excellent Pancit, as good as any I've eaten. Modifications: 1) Used one 16oz package noodles, 2) doubled the soy sauce to 1 cup, 3) added about 1/2 teaspoon ground ginger. This served 6 (unexpected company, that's why the doubled noodles and sauce!) with a little leftover. Everyone LOVED it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie S."
},
"reviewBody": "I used to work with several Filipinos who would bring this in for potlucks and I fell in love with it.\n\nI made the following changes to the recipe according to personal preferences: I used chicken breast and round steak in place of chicken legs, pork and shrimp, though I found that this dish could just as easily be vegetarian. I also added a little bit of garlic. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RoccosDaughter"
},
"reviewBody": "For all you vegetarians out there (or if you just want a vegetarian alternative), try this recipe without meat or fish by doubling the carrots and scallion. I was taught this recipe from a Filipina friend in the 70's and she called it Pancit Canton and used Pancit noodles (flour) instead of rice noodles. I have tried it both ways, but really do prefer the Pancit noodles. They can be ordered easily online at Asian Food Grocer or depending on where you live, can be found in most Asian grocery stores."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle D"
},
"reviewBody": "I altered this a bit. My dad was military and I was born in Guam. I grew up eating Philipino food. Good base recipe. I used fresh chicken-boneless tenders, pork chops and cut them up and salad shrimp. I bought everything already chopped and that cuts down on the time significantly. I use carrots, celery, onion, and cabbage. I cook the veggies together with soy sauce and cook the meat with soy sauce, olive oil, and garlic. I soak the rice noodles in a mixture of hot chicken broth and water for about 10 minutes then mix all the things together.. Add more ssoy sauce needed and just keep mixing until everything is well blended. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joydee Mccorkle"
},
"reviewBody": "Wonderful!!! Fish Sauce vs 0yster sauce...makes no difference which one is used...it's tasty stuff!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Dutcher Galan"
},
"reviewBody": "I love this recipe. I have used it as written and with my own changes. It always comes out good. i love to add hoison sauce and chicken or pork. I also switch up the veggies for what I feel like. Great job."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janaluwho"
},
"reviewBody": "I have made this 3 times for my Filipino bf. He and his daughters love this recipe! Even better the next day (we love leftovers!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "Yummy, i jst made this tonite and oh its good...thanks ozzyzmommy for the delicious pancit..ive always wanted to make it but didn't know how, sooo will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marnie"
},
"reviewBody": "Great !!! Tastes just like what my Dad makes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Iheartcooking"
},
"reviewBody": "put the noodles in the pan and cook in chicken broth until tender it adds to the taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GrillLover"
},
"reviewBody": "I remember begging for some pancit aboard the Navy ships I served on. The Filipino cooks made it for themselves all the time. And the addition of a little bit of \"pancit seasoning\" does wonders to perk up the flavor of this recipe. I'm sure that's what's missing for those, like me, who think \"just soy sauce\" isn't quite enough. It's available at any oriental market."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michele DArcy"
},
"reviewBody": "I found this recipe to be a little bland. I also marinated the chicken and pork in soy sauce for 30 mins. I added fresh garlic and onion and also used coleslaw mix and snow peas. After I soaked the rice noodles in water and drained them, I added chicken broth to the pan and sauteed the noodles in the broth. They quickly soaked up the broth and gave them a nice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lauren Brockett"
},
"reviewBody": "Amazing recipe but In stead of using Rice noodles I use Corstarch noodles they are the clear noodles the pancit wont break so easily and the flavor is out of this worl . Also The broth you cook your chicken in or canned chicken broth is a must!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget"
},
"reviewBody": "Yum! Easy and delicious. My friends and family LOVE when I make this for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PORTIANAY"
},
"reviewBody": "I loved this! Much more authentic, from what I recall, than the other pancit recipes posted here. Next time, I am going to try it with regular Asian wheat noodles, as opposed to the rice ones mentioned in the recipe. My long-ago (30 years!) Filipina employer used the wheat, and we like it better that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teddybear"
},
"reviewBody": "Made this for my daugthers birthday she loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alisha"
},
"reviewBody": "This was very easy yet delicious. However, the presentation was not so lovely. The noodles were so porous that they soaked up the soy sauce and was brown; plus, the veggies didn't stick to the noodles. Hubby loved the flavor! I used yellow pepper, carrots, broccoli, mushrooms and shrimp and added a tsp. of sesame oil to the olive oil I sauteed them in. That's what's great about the dish--you can add whatever veggies you have on hand!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CMUCKEY"
},
"reviewBody": "Loved this recipe! Didn't use shrimp but ahve made this with pork &amp; chicken. Both very good. Have made it with rice noodles &amp; actual pancit noodles. Good both ways. Very simple dish. I hae had pancit many times made by phillipino friends &amp; this is pretty close. I do add a little bit of fish sauce for a more authentic flavor. This gets made frequently at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "courtney"
},
"reviewBody": "I had searched and searched for this recipe. I once knew a Filipino lady who would make this and I loved it! I have been searching for this recipe for years. Very good, she used green onions and I think I prefer them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coi"
},
"reviewBody": "this is one of my favorite filipino dishes, but specifically we call this pancit bihon because pancit is basically made of egg noodles and bihon is rice noodles. to compare, i love bihon better. my style is first saute garlic and onion with the chicken (breast is preferred), shrimp, and add chicken stock. add chicken boullion later carrots and cabbage or celery. fish sauce and lemon would finally complete the recipe...sooooo delicious, try this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela F."
},
"reviewBody": "I actually make pancit all the time (my own recipe) and this one is pretty much identical to how i make it in regards to the veggies and soy sauce. I prefer mine with shrimp for the meat and not all that other stuff. I also disolve a little bit of beef bouillon in water and find it tastier that way(although thats not an authentic way of doing it) I find it lacks flavor with just the soy sauce. Sometimes I splash some fish sauce on it too. You have to play with it and make it to your liking. I do however like my fast food restraunt-bought pancit better than this recipe-or my own recipe for that matter. I dont know what else they put in it but it has tons of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lovebeingamom"
},
"reviewBody": "My family was very pleased with this meal and recieved the family rating of 4*, they thought it would be better if I left the vegetables \"chunkier\" to give more contrast to the meat and rice noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Closest to my grandma's recipe. I added some chopped celery just because my grandma puts it in her pancit. Next time I would put some Chinese sausage on it because that's how my grandma cooks it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMSILVA"
},
"reviewBody": "I boil my chicken and pork (w/ bones) and reserve the broth to add some moisture to the dish (and addl' flavor) when adding the noodles. This was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rummi71"
},
"reviewBody": "My husband is Philipino and we both loved this recipe. I did add some chicken stock and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emy"
},
"reviewBody": "I LIKE YOUR PANCIT RECIPE VERY MUCH...YOU KNOW IM A PILIPINA. BUT I LIKE PANCIT.AND I TRY YOUR RECIPE...ITS GREAT!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosalicious"
},
"reviewBody": "Love Pancit and to me, this is the real deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BANYO"
},
"reviewBody": "A friend brought this dish over to a potluck dinner once, and I had to have the recipe. Unfortunately, she didn't make it, so I found the recipe here. This dish is good both hot AND cold. Before putting leftovers in the fridge, sprinkle lemon juice on it and cut some lemon slices on to it. The Lemon gives it an extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae"
},
"reviewBody": "WOW! Even better the next day! I only had a few of the ingredients (noodles, chicken broth, onion, garlic, shrimp and seasonings) and it was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorilei"
},
"reviewBody": "Any noodle dish tastes better when you make the noodles with chicken broth as opposed to plain water. Fish sauce (patis) is the way to go if you want it to taste right. And maybe some lemon or calamansi right before you eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "vettech"
},
"reviewBody": "I only used the chicken, so it came out really bland. I think I will try it with the pork and shimp next time. Maybe it will give it more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Honey"
},
"reviewBody": "I used boneless chicken thighs instead of the legs, added garlic (isn't everything better with a little garlic?)and instead of carrots, I used water chestnuts...I also used Bok Choy instead of regular cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marci B."
},
"reviewBody": "This was YUMMY! My neighbor is Filipino and she cooks WONDERFUL! This taste like hers! I did marinate my pork in soy 3 hours before it was cooked. I also added garlic. My chicken was a rotissarie chick from our grocer. So, I did change things a little, but it was for easy more than anything! Hubby and 3 kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luvmybabies"
},
"reviewBody": "i haven't tried this recipe since i have my own \"family recipe\" but i had to respond to MOM2SOFIA's comment. i'm a true filipino. make pancits all the time and family makes it all the time since i was a young child. we filipinos DO NOT use oyster sauce for pancit. it's usually soy sauce and/or patis (fish sauce)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Krizan Reale"
},
"reviewBody": "Excellent recipe. I added peapods and water chestnuts, as well as a touch of garlic. My family was fighting over who got to take the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent. Straight-forward and simple, but quite delicious. Because of its simplicity, use the finest ingredients you can find."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "In the philippines, we do not serve this with rice! it is eaten alone. Pretty authentic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As a Filipina (female for Filipino) who was born and raised in the Philippines, I tried this recipe and it's pretty authentic to me. I beg to differ, by the way, Oyster Sauce is not an authentic recipe for Pancit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "COOKNNRSE"
},
"reviewBody": "I have had \"authentic\" pancit, made by Filipinos and this recipe was close to what I remember. I find it easy to make and have made it several times. All my friends love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BugNBear"
},
"reviewBody": "I think I might be a bit more accustomed to the \"Hawaiian version\" of pancit wherein BBQ pork and oyster (rather than soy) sauce is used. But overall, it's pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "COOKINGJUDY"
},
"reviewBody": "This recipe is very close to the recipe I use. I find that cabbage is too over powering for the rice noodles so I leave it out. I also add bell pepper strips, celery, and snow peas. I enjoy this dish cold more than I do hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This did not have a good flavor at all and while I may try another pancit recipe, I would not recommend this one to anyone. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "One of the easiest recipes I have come across. Can be made for dinner that night. Or taken to a potluck. Always well received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DDOMINIQ"
},
"reviewBody": "Easy and really good!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/31799/pancit/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
"name": "Filipino"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/31799/pancit/",
"name": "Pancit"
}
}
]
}
}
, "about": [
]
}
]