				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Panko Crusted Mashed Potato Cakes"
,"datePublished": "2015-11-19T02:12:47.000-05:00"
,"dateModified": "2022-10-17T22:40:38.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kikkoman"
,"url": "https://www.allrecipes.com/cook/kikkoman"
}
]
,"description": "Kikkoman Panko Bread Crumbs make a crispy crust for these pan fried mashed potato cakes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/q74LbqKq9EbaRTAWXKsBOJL8rko=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2263548-panko-crusted-mashed-potato-cakes-naples34102-4x3-1-0dad8a30e3dd4b18ac996d4cda1e8b44.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Panko Crusted Mashed Potato Cakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "52"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "164 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "40 mg"
,"sugarContent": "1 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups chilled mashed potatoes",
"2 eggs, slightly beaten, (separate bowls)",
"2 tablespoons chopped onion",
"0.5 tablespoon black pepper",
"0.5 cup flour for dredging",
"1 cup Kikkoman Panko Bread Crumbs",
"3 tablespoons vegetable oil for pan frying" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, combine potatoes, one egg, onion and black pepper. Divide potato mixture into 8 equal portions. Use your hands to form 1/2 inch thick patties. Dredge patties in flour, then in egg and coat with Panko Bread Crumbs. Meanwhile heat vegetable oil in a large skillet over medium high heat. Add potato patties to the hot oil. Cook until well browned, turn with a spatula and brown on the other side."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We loved it, my leftover mashed potatoes were on dry side to start with. I did put about 1/2 cup of cheese. I seasoned the flour with season salt and garlic. Every thing else was following recipe. Perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Augusta"
},
"reviewBody": "very messy. I will make potato cakes with shredded potatoes not mashed potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very simple to make but you need the right consistency of potatoes too creamy will be difficult to work with. Also as another reviewer wrote, keep in mind you need to use the two eggs separately, one in the potatoes and one for the wash when you dredge in the flour. I did the recipe exactly and they came out beautifully. Crispy on the outside and soft and fluffy in the middle. I would also suggest using more oil though. I used a bit over 1/4 cup so the oil would bubble half way up the cake so when you flip them they get cooked nicely on the sides as well. EDIT: I forgot to add, after making the cakes themselves, I would suggest re-chilling them in the fridge for an hour since the potatoes will warm up after handling them and they stay well formed while frying when they go in the oil chilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dar"
},
"reviewBody": "These were delicious! I used green onion??, added about 1/2 C sharp cheddar cheese, added a little extra salt maybe 1/2 teas and about 1/2 teas of onion powder. I skipped the flour and egg on the outside of the pancakes and used the Panko crumbs directly on the outside of the pancakes. We will definitely be making ?these again! They would be delicious with sour cream or a spicy a aioli. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "rizzledizzle98"
},
"reviewBody": "Absolutely horrible. Tried the recipe. It was mush. Tried again and “doctored” it. Still mush. The only way to make them is the old fashioned way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jack brychka"
},
"reviewBody": "Instead of dipping potato just use bbq brush and brush egg on then dust tops with flour use spoon to flip in panko so csn press on it a bit to help stick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARTHA R."
},
"reviewBody": "After reading comments about them being a little bland, I spiced mine up. I sautéed one onion, one garlic clove and one chili pepper in some butter and caramelized it. I added the onion mixture with approximately half a cup of shredded cheddar cheese, a quarter teaspoon of salt and a half tsp dried parsley. I topped them with sour cream mixed with chopped green onion and no salt seasoning salt. Spicy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rogail"
},
"reviewBody": "These are extremely messy to make and bland. IF I were to make them again I would add Dill &amp; Garlic &amp; maybe some ground red pepper. And I would not dredge in flour &amp; egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "William. M Pratt"
},
"reviewBody": "It was good and easy. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sal "
},
"reviewBody": "added a little hot flavorful seasoning. would of been a 5* but, I need to tighten it up . Very runny . Maybe more mash potato/less egg ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ariel O'Suilleabhain"
},
"reviewBody": "A delicious potato cake - several versions exist for the extremely weighty taste bud added grated carrots and potatoes to one, and served and ate that one under a\nfluffy dollop of sour cream. For the child guest, a small\namount of ketchup on the original recipe' worked out\nwell for both child and adults alike. - Ariel O'Suilleabhain"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NANNYMM"
},
"reviewBody": "The first time I made these, I followed the recipes exactly. They turned out beautifully. My family loved them and asked me to make them again soon. The next time I changed the recipe a bit. Because we liked them so much, I decided to\n double the recipe. (I should have done that the first time!) Since I had a lot of leftover garlic mashed potatoes, I used those and added minced Italian parsley from my garden and about 1/2 Cup of grated Romano cheese. I also used Italian seasoned panko to coat these. They were absolutely wonderful too. When I asked my husband which way he prefered them, he couldn't decide. He said they were equally delicious. So now I have two variations of these to add to my repertoire! Next time, I think I might try a bacon and cheddar version. \nThank you for sharing this excellent recipe! It's going to be a frequent item on my dinner table from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Light Pratt"
},
"reviewBody": "I did not add egg to the potato mixture. I did add garlic powder and Turkish Seasoning to the potato mixture. Once I shaped them into patties, I dredged in egg, then the Panko and fried as directed. Very crispy and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "These are delicious! They are a little hard to work with but I managed ok and they ended up holding their shape. I think it's a good base recipe and anything could be added, like cheese, or bacon :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Schoonover"
},
"reviewBody": "Delicious! I decreased the chopped onion, added real bacon bits and 3/4 cup shredded cheddar. Super yum.. crispy, golden and family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bruce Robertson IV"
},
"reviewBody": "Too much of a mess for what you end up with.. Taste is good, great crunch though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cathyquilts"
},
"reviewBody": "My Mom made potato cakes every time we had left over mashed potatoes. I think she made extra so we would have the leftovers. One trick she used was to make the patties the same night, (just the potatoes, nothing else) layer them on a plate with plastic between, cover with plastic and refrigerate overnight. \nThe next evening because the patties had been in the fridge so long they were firm and kept their shape while breading. \nOf course Panko was not a 'thing' yet in the 60s, so after dipping them in a beaten egg, she pressed them into a cornmeal, flour mixture. I'm loving this panko version, so now, when making these potato cakes, I'll have to decide which version to make... Mom's or panko?!?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lidah"
},
"reviewBody": "My husband makes wonderful mashed potatoes, and always uses Yukon Gold potatoes.....adding horseradish into the mix. This recipe is perfect for leftover mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "J Ragan"
},
"reviewBody": "These are all about how you originally made your mashed potatoes. Mine tend to be thick, not creamy. I really enjoyed the variety of ingredients people added. Made them this time with only 1 cup of thick mashed potatoes, a little flour to help bind it and the whole egg, rather than try to half it. Had to add a little instant potatoes, but still worked, and rolled in Italian crumbs as that is what I had on hand. Still turned out fine. Will add some other ingredients next time and have even more fun - like the idea of ranch seasoning.\n\nWhat I don't understand is why people thought you were to add 2 eggs to the 2 cups of potatoes. It clearly said separate bowls so you had the other egg to dredge with. Another misunderstanding is the 1/2 T of black pepper. Clearly should have read 1/2 tsp - No recipe calls for 1/2 T of something. 1/2 T would be written as 1-1/2 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamelah"
},
"reviewBody": "I made these potato cakes today and we enjoyed them, but they need a little lift. Next time i make them i may add a small amount of either garlic powder or fresh garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellen"
},
"reviewBody": "Made many potato pancakes from left over mashed potatoes that I have saved in freezer, but this is husband's favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "I had leftover “Loaded Mashed Potatoes,” which were simply ideal for this recipe. Because I didn’t want to risk the cakes being too gloppy I added no egg. Also, it didn’t seem critical to coat the cakes in flour and egg first, so I just immediately coated them in the panko bread crumbs and it worked out just fine. These were so flavorful and delicious, albeit a little on the fragile side. Hubs thought they were better than most of this type, less greasy, he thought. Maybe it was the panko bread crumbs that made the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gatorgirl9"
},
"reviewBody": "Tastes yummy and very easy to make! Best way to use leftover mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPA"
},
"reviewBody": "I didn't use any eggs or flour. I wanted to taste the potatoes. I sauteed some onions and seasoned the mashed potatoes to my liking before I rolled them into balls, then rolled them in the panko crumbs. Everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "Gave these potato cakes an Italian twist. I mixed in some grated Pecorino Romano cheese, breaded with Italian panko crumbs, garnished with chopped basil, and drizzled the mashed potato cakes with marinara. Made a very nice side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "I.eatmore"
},
"reviewBody": "Excellent recipe. Only variation for me was sauteed onion and small handful of shreded chedar cheese. Will make again. perfect for left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nkleblan"
},
"reviewBody": "I made these for dinner tonight with leftover mashed potatoes. I followed the recipe ingredients but I found the panko browned very quickly, before the potatoes were heated through, so I put them in the oven to heat through (I did make them quite large though). We haven't eaten yet, but I did sneak one and it was very tasty. I think next time I might add more onions and maybe some garlic. All in all, this is a good recipe to use leftover mashed potatoes and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "davebuoy"
},
"reviewBody": "Wonderful basic recipe. You can jazz it up, but the most important tip is to make the potatoes a little stiff. (not as much cream as usual)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blueberry"
},
"reviewBody": "These were very good. I was a great way to use up some leftover mashed potatoes. I did not add the 1 egg to the mashed potatoes, they would have been too wet that way. They were a little difficult to coat with the bread crumbs and get to the pan without falling a part. I just made them very small so that helped in keeping them together. I also add a little shredded cheese to the mixture before I formed them into patties. They tasted great, I would make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Warren"
},
"reviewBody": "My husband and I really liked these. I added extra onion grated finely in the food processor, salt and pepper. I skipped the flour and egg for dredging and did have to add some flour to the mix to get it firmer and easier to work with. I formed the mix into a ball, rolled in the panko crumbs, and put in the oil. Then I flattened with the spatula. Make sure the first side is crispy before turning. I was making open faced hot pork sandwiches to go with these but my hubby just put the pork and gravy over the potato cakes. Awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hentaitube"
},
"reviewBody": "It was messy I'd have to admit, and it sort of fell apart when i dredged it in the egg. The overall texture was super crunchy though :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tableforfour"
},
"reviewBody": "I made this and it was great, though I didn't use the egg and added a tablespoon of Dijon mustard. It was amazing!!\n\nAlso, I baked them in the oven instead of pan-frying them. It makes them healthier, but next time I will try the pan-fried version ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gilzam"
},
"reviewBody": "I liked this recipe. i used chakalaka(A blend of Syrah, Mourvedre, Carignan, Petite Syrah, Grenache and Tannat) spice in place of black pepper and my family love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Krista"
},
"reviewBody": "This is a creative side dish, but wayyyyyy to MESSY! not worth it, My mashed potatoes are very creamy and with that style potatoes to work with this did not work at all. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yoga"
},
"reviewBody": "These were great! I took other reviewers advice and only use 1 egg and then dipped in 1 egg before rolling in the Panko. I added cheese and 1 TB of dry ranch dressing and some salt. I cooked the onion to golden brown before adding for extra flavor. Definitely spray your hands so you can roll them and they wont stick. I fried in EVOO/butter mix. Definitely a keep in my house!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Goff"
},
"reviewBody": "While this was a tad messy. It turned out well from what my family said. I thought it was to peppery myself. And ended up making not just a double batch, but a half a batch more on top of that to knock out some of the pepper, because that's all I could taste in the mixing round. I also minced the onions in this recipe. But again everyone else told me that the pepper flavor was just fine and went for seconds. The thing I would recommend to others when it comes to dredging method with the egg dipping part. Is use a small but shallow dish for the eggs when dipping the patty into it. And use a spatula to handle and flip to coat the egg onto both sides. If not, you are going to have to be very creative not to have your patty broken up and just a ploppy mess. Just warning others. But We did like the recipe. I can see making this again but still not adding as much black pepper into this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carnivore"
},
"reviewBody": "Delicious, but mechanics of process didn't work for me. After having problems with patties, I oiled my hands, formed 1/3 C balls which I rolled in the flour, egg &amp; Panko crumbs. Only when these were all prepared did I add them to the skillet and gently flatten with a spatula. The second time I made this, I added 1 tsp each dried oregano, dried basil &amp; garlic powder. I want to try this one with a blue cheese topping, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jetas"
},
"reviewBody": "Definitely skip the extra egg -- it makes the pancakes too hard to handle. We combined the flour and panko together and that worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "I used one egg and more onions and placed a slice of cheese on top just until melted. Yummy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MINNIE000"
},
"reviewBody": "This is the second time I've tried these. I figured I should give the recipe another chance and make some modifications and I think I'm going to make these yet again and modify them further. \nThis time I used only 1 egg in the potatoes and did not dredge the potato pancakes in the flour and egg. Simply rolling them in panko made them slightly easier to work with. \nNext time I make these I'm going to skip the egg all together! Unless you're making dry mashed potatoes (no milk and butter) there really is no need for the additional moisture from the egg. Just add the flavourings, form and roll in the panko. It doesn't need anything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish Gillogly"
},
"reviewBody": "Dredging these in the Panko crumbs is a wonderful idea. I used just 1 egg, though, and that made for an easier mixture to handle. Will do it this way from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "These were delicious! Patties were hard to shape because the mashed potato mixture wasn't very thick. I had to add flour to make it thick. Very crispy outside which is my favorite party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmyMTeets"
},
"reviewBody": "These were pretty good! If you find that your potatoes are not consistent enough to roll into balls, add potato flakes until you're able to roll them. I also breaded with Italian bread crumbs. Theses would be great with shredded cheese in them and topped with sour cream ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherandBill Law"
},
"reviewBody": "This was super good!!! I added more chopped onion about 1/2 cup as we like onion,and it gave it a sweet flavorful taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amjmp"
},
"reviewBody": "These is great recipe to use your left over mashed potatoes! I didn't have any left overs, so I used the Betty Crocker boxed kind. I let it chill in the fridge for about 2 hours. I had trouble keeping the potatoes stick in the patty. Next time I will use real mashed potatoes and I think it'll be much better. Also, this recipe had way to much pepper for us, so I will likely cut the pepper in half. I think a little bit of shredded cheddar cheese mixed the potatoes would add a nice touch. Overall excellent starter recipe - so thank you! I'm always looking for something different to do with potatoes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216977/panko-crusted-mashed-potato-cakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17562/dinner/",
"name": "Dinner"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216977/panko-crusted-mashed-potato-cakes/",
"name": "Panko Crusted Mashed Potato Cakes"
}
}
]
}
}
, "about": [
]
}
]