				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pecan Pie VII"
,"datePublished": "2020-03-04T23:56:06.000-05:00"
,"dateModified": "2022-08-08T11:43:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Deanne Gates"
,"url": "https://www.allrecipes.com/cook/24322648"
}
]
,"description": "This is a simple, yet delicious recipe to make without the syrup that most pecan pie recipes call for. It&#39;s more like a custard pie with pecans."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8q_2XliLqg2rAayM02gikEJHdSg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4586526-5f8e541171ce498a9fe8539e840fd2ae.jpg",
"height": 844,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pecan Pie VII"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "80"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "688 kcal"
,"carbohydrateContent": "73 g"
,"cholesterolContent": "79 mg"
,"fiberContent": "3 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "354 mg"
,"sugarContent": "59 g"
,"fatContent": "43 g"
,"servingSize": "1 - 9 inch deep dish pie or 2 regular 9 inch pies"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (9 inch) deep dish pie crust",
"2 cups light brown sugar",
"1 tablespoon all-purpose flour",
"0.5 cup melted margarine",
"1 cup evaporated milk",
"1 teaspoon vanilla extract",
"3 eggs",
"1 cup chopped pecans",
"1 cup pecan halves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C.)"
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, combine brown sugar, flour, margarine, milk, vanilla and eggs. Blend until smooth. Stir in chopped pecans. Pour into pie crust. Place whole pecan meats gently on top in decorative manner."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 35 to 40 minutes, or until golden brown and filling is set."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tokengoddess"
},
"reviewBody": "Thick filling and not smooth texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was sugar overload!!! Would not recommend, would not serve this to anyone. What a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "Oh. My. Goodness! Followed this recipe to a tee. I've tried several pecan custard reciped that went straight from the oven to the compost. This pie is too pretty to cut although I did gently move a top pecan over and stole a spoon ful to taste. Delicious little pieces of pecan throughout, lovely melt in your mouth flavor. The mix is super loose going into the pie shell but don't worry. It comes together beautifully after 40 minutes. Will jiggle when coming out of the oven.LET IT SIT. LET IT SIT A couple of hours at least until it thickens...yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irina R"
},
"reviewBody": "Best pecan pie recipe! Tried a whole bunch over the years - this one is by far the most delicious. Make it every year now for Thanksgiving. Usually make 2 at a time because it goes so fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Kim"
},
"reviewBody": "So delicious that even a pecan pie hater loved it. The top gets a bit too brown before it is done. I may bake it longer at a lower temperature, after a 400 degree start."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana M. Quintana"
},
"reviewBody": "This recipe turned out perfect. I followed all instructions and pre-backed the crust 8 minutes before pouring the mix on top. It didn’t need any extra baking time. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy Lee-Ridenour Bashore"
},
"reviewBody": "Good flavor. The pudding like filling set well and wasn’t runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StaceyLCooper"
},
"reviewBody": "Excellent recipe! I gave Ben making this recipe for a few years, and it never disappoints."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Peiffer"
},
"reviewBody": "A new family favorite. I wanted to bake a pecan pie, but forgot the corn syrup. This recipe was perfect. Will be making it more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grrbrr"
},
"reviewBody": "No changes, I enjoy this pie as it is not over sweet as I get from corn syrup basses pies. I am just optimizing the cook time for doneness any advice would be helpful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Howard Peters"
},
"reviewBody": "Delicious sums it up. Love this recipe and have made it every holiday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STC5"
},
"reviewBody": "Delicious, but yes, you'll need to cook it longer....I baked it for an hour and ten minutes, and it still could have used another 10. Good flavor though so I'll work with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dangie"
},
"reviewBody": "Love this because it doesn't use HFC. I have family who is allergic to HFC."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rere2013"
},
"reviewBody": "i made this for my family on easter and it was very good.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SugarCreekFarm"
},
"reviewBody": "I love this more than a regular pecan pie and I love pecan pie. It's nice that its not ultra sweet. Some pecan pies make my teeth hurt and I want to enjoy the pecan flavor. This one was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Barbay Hoskins"
},
"reviewBody": "My husband loved this pecan pie! I was pleasantly surprised."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alono"
},
"reviewBody": "My family absolutely loved it! Everyone requested for their own pie as their Christmas gift and this includes the children as well. Thank you for sharing this yummy recipe. For sure a family must have for the holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "arf"
},
"reviewBody": "If using a metal pie pan, expect to bake it much longer, like 30 minutes longer. Taste was good, not excellent. I'll probably use this recipe again as I don't like the corn syrup ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzlwilliams"
},
"reviewBody": "I think this will be great if it ever gets done! I made two and I used the bigger pie plate but not \"deep dish\" and it's already been in oven 1.5 hours and it's still not set but they look beautiful. I have foil just draped on top and that is keeping them from burning. Seems like there's too much liquid in recipe?? Can't wait to try them because regular pecan pie is too sweet to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandalin"
},
"reviewBody": "I love pecan pie but it's usually to sweet to be able to eat much. Not with this recipe! The light custard filling is just right anytime of the year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cute Brunettes"
},
"reviewBody": "Followed the recipe to the T and it tasted great but the problem was that we had to bake it way longer than what the recipe asked for (about 1 &amp; half hours like another person suggested) and it still wasn't set. So we had to let it sit for a day and the filling was still jiggly and not completely set. We had to scoop up each slice with a spoon, though the crust was done. Altogether, it tasted wonderful and everyone enjoyed it and it was gone in 2 days. Maybe next time we'll reduce the evaporated milk and use a little flour to thicken the batter. You won't need to toast the pecans you arrange on top. As for sweetness, you can reduce the amount of sugar just a tad. Thanks for sharing Deanne"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher McMillen"
},
"reviewBody": "Really enjoyed making this pie. 2nd time I've made it this Thanksgiving. It isn't as sweet and sticky as a store bought pie. It's almost a cake like texture with pecans. Mine turned out very pretty! I'll see if I can post a picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duchessbyday"
},
"reviewBody": "I get rave reviews on this pie every time I make it. This recipe is a must around the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian VanDyne"
},
"reviewBody": "Amazing and simple recipe! No strange flavor from the Karo that people are stuck on using either"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowpens"
},
"reviewBody": "This is a delicious pie. I couldn't stop at one slice. The filling is rich and sweet and tasted a bit like butterscotch. I actually used demerara sugar because I ran out of brown sugar and I wondered if that altered the taste of filling. Like other reviewers found, it was a lot of filling and I ended up making a little pie as well. I found the filling wasn't really set. Never ate or made pecan pie, so not sure if that's normal. Set or not, it is a delicious pie and I will definitely make it again. Thank you for sharing the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allissa"
},
"reviewBody": "I love this recipe! For the holidays my family always puts in a request for it. I don't change a thing, but I do make it with the 2 regular 9 inch pie crusts. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MINKCHAN"
},
"reviewBody": "I can't believe I forgot to rate this. This recipe was sooooo good! It was Christmas dinner and dear me, I had no corn syrup in hand...no stores open either! So, with much lookin I finally found a pecan pie recipe that didn't incorporate corn syrup! This was a winner! Absolutely yummy! Only thing I substituted was butter for the margarine it called for. Other than that, I stuck to the recipe with verrry yummy results! Thanks Deanne!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lobstar"
},
"reviewBody": "To be honest I've never made a pecan pie before but was startled at many other recipes which called for corn syrup as a main ingredient. I picked this recipe because of its use of evaporated milk instead. It was a very good pie, a little sweet for my tastes, but I was happy with it nonetheless. My father (for whom I made the pie) said the taste was good but the consistency was not what he expected out of a pecan pie. He said it was too airy and custard-like. Again, I'm not a big pecan pie eater so I don't know, but I enjoyed it and would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanaC"
},
"reviewBody": "Made this for my mother.. got great reviews from family. Not sugary or too sweet...perfect!! It is now the Pecan pie for our household. Thank you for posting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cookin for 5"
},
"reviewBody": "I was excited about trying a new pecan pie for my brother who loves them, i was making one especially for him on Thanksgiving...I followed this recipe exactly and it just didnt come out right at all...The taste was okay, but it was very mushy and it could not be cut into slices at all...I'm not sure if i did something wrong. Thankfully, my brother said dont worry, it will get eaten, but dont ever try a new recipe again if your old one is fine :( I think I'll try this again just for own sanity!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Christian Valle"
},
"reviewBody": "Very good take on a Pecan Pie. I'll make this one every holiday season. Difference in timing, mine took more than 40 minutes to set, even may have overcooked it a little, but regardless, scrumptious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Love this one. have been looking for a recipe that doesn't use corn syrup. i added 1 c choc chips, reduced the milk to 3/4 c. &amp; added 1/4 c Jack Daniels. My husband even liked it. only used the chopped nuts. will definitley make this one again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "This pie tasted good, but making it was a hassle. You see, I had the same problem as many other people; the middle of the pie wouldn't solidify. So I decided to refrigerate it over night, and it was somewhat more solid. It still wasn't totally solid, but good enough to eat. I added whipped cream, and it tasted good after all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Riarry"
},
"reviewBody": "I love this pie. It's not as heavy as the Karo syrup pies. I have substituted coconut milk for the evaporated milk to give it a more exotic flavor, and people loved the coconut version more than the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Searose"
},
"reviewBody": "This pie is so easy to make I love it! After several failed attempts to make a \"regular\" pecan pie by a non eater this one was a success. I even ate a piece and liked the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda M"
},
"reviewBody": "This is a pie that my aunt has been making for years and then passed the recipe down to me. If you like pecan pie but not the sticky filling made with all that corn syrup, this is the recipe for you. It is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KK"
},
"reviewBody": "I followed the instructions exactly as described by the recipe, and the pie never set up correctly. I even baked it a bit longer. It did set correctly around the edges but the middle was VERY runny. It tasted good, but we were unable to eat a large portion of it because of the texture. If you're going to make this, be prepared to bake much longer than the recipe calls for. Maybe someone can suggest an added ingredient that will fix the problem. I'll use a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tikabear"
},
"reviewBody": "I used the recipe as posted and it turned out very good. It didn't have that overly sweet taste that pecan pies normally have. The filling is very good and I do recommend using the chopped pecans in the filling as posted in the directions. This one is a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mindys Mama"
},
"reviewBody": "This was really easy but taste wise I guess I'd rather have the pecan pie made with the corn syrup because the texture of the filling. But don't get me wrong this was very tasty and none was left behind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HPP22207"
},
"reviewBody": "Oops...I put a baking sheet right under pie and it turned out soupy...but delicious nonetheless. I'm a beginning baker so guessing that should not have put the pie on a backing sheet -- so will definitely try this again--it was easy and deserves another try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "knotty head bajan"
},
"reviewBody": "too sweet and sticky"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mindy Thomas"
},
"reviewBody": "This pie was absolutely wonderful!!! I always worry about making pecan pie for Thanksgiving because sometimes they turn out and sometimes you get a mess. I would give this pie 5 stars for the flavor and ease however I can only give it 4 stars because the baking time, like other viewers said, was way off!! There was no way this pie was going to be done in 40 min! I believe mine baked for 1 1/2 hours. I kept checking it after an hour and it wasn't set yet. When it was all the way done, however, it was perfect!!! Make sure to put aluminum foil around the edges for this pie because of the length of time it needs to bake! This will be my pecan pie recipe every Thanksgiving from here on out...Thank you so much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sixgermans"
},
"reviewBody": "Thanks for a wonderful recipe without the Karo syrup! Everyone was skeptical when I told them it didn't have the syrup in it, but they all loved it! Used chopped pecans instead of whole ones and just mixed them all in at one time. Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "This recipe came out great! It was a hit there was not one crumb left. I made this for thanksgiving. Will have to make again since i only made one pie. And had only a small piece. Must try! It was easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarbs"
},
"reviewBody": "I've never been a huge fan of pecan pie (too rich and sweet and guilty feeling!), but I saw this recipe and wanted to give it a shot. I love it! It's much lighter but still flavorful. I told my non-pecan pie eating family that they still had to try this and they loved it too. I was making several other pies at the time, so I already had the crust prepared and the filling was really easy to throw together. I'm converted now and I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chsnutmare"
},
"reviewBody": "This is such a great recipe for those that love pecan pie but just cant take the sweetness of a traditional one, and perfect for those that use sugar alternatives!! My family loves this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lolly"
},
"reviewBody": "absolutely great!!! Much better than corn syrup. I used butter rather than margarine and made 2 pies rather than 1 deep dish (only because that is what I had). I also added 2 TBLS of cocoa which gave it them a hint of chocolate...YUM!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doodah"
},
"reviewBody": "Much better than a traditional pecan pie because of its lighter filling. I prepared with real butter, in place of margerine. Not as syrupy-sweet as other pies, I think the brown sugar &amp; butter lends more flavor notes than corn syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tonya Stephens"
},
"reviewBody": "It was good. I made it to recipe and the taste was fabulous. It was, however, a bit runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mofun"
},
"reviewBody": "My pie did not set in the middle. I used butter and put a cookie sheet on the bottom rack (just in case), cooked for 65 minutes 'cause it was still all liquid at 40 min. I know the temp of my oven is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lyndsay"
},
"reviewBody": "this was fabulous!! I did make a change...I didnt have any pecans and had a crazy sweet tooth, so i used cashews! worked out awesome, im going to try almonds next!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "styles"
},
"reviewBody": "Same recipie my grandmother used.....Love it and all recipies have trial and error..........eggs should always reach room temp. before using in any baking recipie.......Setting time after baking time is a great must before putting in fridge or freezer.....use foil under pie pans and not sheet pans..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Kovacic"
},
"reviewBody": "it was tasty but did take a LONG time to cook which meant I burnt the edges of my pie :( will try again but with putting foil around the outside so that doesn't happen again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kmelby"
},
"reviewBody": "Well, I would give this 5 stars BUT the cooking times are way off. I made this for Thanksgiving and cook it extra like all of the other reviews said. i took it out of the oven and the top was hardened just like a pecan pie should be. However, when I went to cut into it, it barfed all over and was liquid in the middle and tfor that it only gets 3 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmemmeuk"
},
"reviewBody": "There is no karo syrup where I live. I'm from Texas but have lived in Scotland for 10 years. There is no Thanksgiving here either but there IS in my house. I love pecan pie but never have it anymore. This year I just wanted to be traditional so I searched until I found this recipe. It's fantastic. You've just gotta try it. I never knew you could make a pecan pie without corn syrup. But YOU CAN and it's better than I ever imagined. The only thing I did different is I accidentally bought dark brown sugar so I just used 3/4 dark and 1/4 white to tone it down a bit. Worked a treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pace"
},
"reviewBody": "This recipe is fantastic. For a first time pecan pie maker,it was super easy. And the whole family loved it! Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Detective Nancy Drew"
},
"reviewBody": "yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JenO'M"
},
"reviewBody": "Not bad tasting, but the recipe makes WAY too much filling for the 9\" deep dish crust that I bought. It poof-ed up out of the pie, and when it settled, the top was not pretty. The pie also took forever to set! 35 - 40 mins is NOT enough...I left it in over 75 mins, and it was still pretty gooey. Luckily it firmed up after a few hrs. I might try it again with a few changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WYLDEANGEL"
},
"reviewBody": "I made this for a dinner with close friends and their children. EVERYONE loved it! I will make this pie repeatedly because it was so delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thistle53597"
},
"reviewBody": "I loved this. It's so good--kind of butterscotchy, I think. Quick, easy, tasty. I wouldn't skip the chopped pecans--love the crunch. The pecans on the top become nice and toasty, with great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "werscotties"
},
"reviewBody": "My bunch loved this pie. Thick and creamy, very yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CURBKICKER"
},
"reviewBody": "I will forever use this pecan pie recipe. I ended up making 2 regular pies with the filling instead of one deep dish and they turned out beautifully. My father-in-law ate a whole pie by himself and has requested another one for Christmas. I love this pecan pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VIBI"
},
"reviewBody": "Absolutely great! just like the ones my great aunt used to bake. I always roast the pecans first to give an even more \"old fashion\" taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Elane Berry"
},
"reviewBody": "Very nice recipe, I like the custard texture better than the syrupie one I usually get with pecan pies. I dont agree with another reviewer about too many pecans, but I love pecans. My bottom crust did not cook and it took about 1 1/2 hours to set but I think a glass pie plate would resolve that I used a foil one. Great pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DILLEAUX"
},
"reviewBody": "Richer flavor than recipes made with corn syrup and not quite as sweet. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was awesome!!! My family really enjoyed it. Every time I looked my husband was enjoying a slice. This will definitely be a recipe that will be used over and over and over again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an easy pie to make and has a very smooth texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOANNE B"
},
"reviewBody": "Quick, easy and delicious. Not as sweet and syrupy as regular pecan pie, but still has great flavor. Would use less butter, maybe 2-3 tablespoons. Make sure you use deep dish as recipe states. This is a pleasant change and definite \"make again\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MAMA GIN"
},
"reviewBody": "Gave this a try for a change of pace, and was pleasantly surprised. I used Splenda and 1 1/2 Tablespoons Molasses to cut back on sugar, and it was a nice treat. Sometimes, those syrupy pecan pies are just too much, and I'm glad to have an alternative."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24105/pecan-pie-vii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
"name": "Vintage Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12957/desserts/pies/vintage-pies/chess-pie/",
"name": "Chess Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24105/pecan-pie-vii/",
"name": "Pecan Pie VII"
}
}
]
}
}
, "about": [
]
}
]