				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pecan Pie Cookies"
,"datePublished": "2020-03-05T00:07:03.000-05:00"
,"dateModified": "2022-09-30T15:36:17.000-04:00"
,"author": [
{"@type": "Person"
,"name": "eibbed0001"
,"url": "https://www.allrecipes.com/cook/3770130"
}
]
,"description": "These pretty pecan pie cookies with a deliciously rich and nutty filling taste and look like mini pecan pies! A tasty addition to any cookie tray."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/jOb3VJ4-91iXZMnbSZWMFbYFCQ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/212863-pecan-pie-cookies-lori-75889b7fbec44434a3b25d0a6505bebe.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5858976024001",
"description": "Portable pie, bite sized!",
"duration": "PT1M10S",
"name": "Pecan Pie Cookies ",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/10/20/212863-pecan-pie-cookies-lori.jpg",
"uploadDate": "2020-10-21T04:22:01.942-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pecan Pie Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "132"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "185 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "28 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "82 mg"
,"sugarContent": "12 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.25 cup butter",
"0.5 cup confectioners' sugar",
"3 tablespoons light corn syrup",
"0.75 cup finely chopped pecans",
"2 cups all-purpose flour",
"1 teaspoon baking powder",
"1 cup brown sugar, packed",
"0.75 cup butter, softened",
"1 large egg",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To make the filling: Melt 1/4 cup of butter in a saucepan; stir in confectioners&#39; sugar and corn syrup until sugar is dissolved. Bring to a boil over medium heat, stirring often, then stir in pecans until combined. Refrigerate the filling for 30 minutes to chill."
} ,{
"@type": "HowToStep"
,"text": "To make the cookies: Preheat the oven to 350 degrees F (175 degrees C). Sift flour and baking powder together in a bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat brown sugar, 3/4 cup butter, egg, and vanilla extract in a large bowl with an electric mixer on medium speed until the mixture is creamy, about 2 minutes. Gradually beat in flour mixture to form a dough."
} ,{
"@type": "HowToStep"
,"text": "Pinch off about 1 tablespoon of dough and roll into a ball; press into the bottom of an ungreased cupcake pan cup so it lines the bottom and sides, like a pie crust. Repeat with remaining dough. Fill each crust with about 1 teaspoon of the prepared pecan filling."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/jOb3VJ4-91iXZMnbSZWMFbYFCQ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/212863-pecan-pie-cookies-lori-75889b7fbec44434a3b25d0a6505bebe.jpg"
}
]
,"text": "Bake in the preheated oven until the cookie shells are lightly browned, 10 to 13 minutes. Watch closely after 10 minutes. Let the cookies cool in the pans briefly before removing to a wire rack to finish cooling."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa_n_tn"
},
"reviewBody": "Delish! Don't forget to roll into balls then push down with your thumb. They were a HIT at Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rhonda engelauf-allen"
},
"reviewBody": "Like a lot of the other reviewers, I loved this base, but changed a few things. I used brown sugar instead of confectioners. I melted the butter and kept it on the heat long enough for the sugar to dissolve. Then I added rum extract, a couple drops of vanilla, and a 1/2 tbs of confectioner’s sugar. Once those were mixed up, I added the pecans and set it to the side. When I made the cookies, I used a hand mixer, and my butter was “just soft”. I added almond extract to this. I used a mini muffin pan, and used mini cupcake papers. I used a cookie scoop to get the dough out of the bowl, and then rolled them into a ball. I used a tart press to get the wells deep enough, and only added enough filling to go to the top of the well- about a tsp worth. These were very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorretta"
},
"reviewBody": "These are great. I followed recipe even refrigerated filling . It was thick and pliable so used my hands to break off pieces to put into cookies. I had read a few reviews that said not to refrigerate but it seemed to work out perfectly refrigerate about 20 minutes. They baked great in mini cupcake tin. Now if I can just stop eating them just like pecan pie. Yeah"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alexandra K"
},
"reviewBody": "Video says add corn STARCH for filling. Recipe says CORN SYRUP. I used syrup. Yes it makes it very hard if you boil it. Please test recipes , or something. \nAgreed: cookie tastes like missing something. But filling makes up for it. I would use brown sugar instead of powdered sugar next time for filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl"
},
"reviewBody": "Delicious cookie! I needed to double the filling mixture to use all of the dough that the recipe made. A great cookie to share as they look nicer than a regular cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aria Myers"
},
"reviewBody": "I thought these were delicious. I barely boiled the filling, and wondered if that was right. I also chopped the pecans quite fine as I used mini cupcake tins. I am trying this and many other recipes to make in a baking business. Since my baked goods are baked by fairies, of course I added pixie dust.:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Yoly"
},
"reviewBody": "I followed the instructions and refrigerated the filling for 30 minutes. BIG mistake. The filling was rock hard. I microwaved it for 2 minutes just to get it to melt somewhat. After baking the cookies, the filling once again got hard, not rock hard but hard enough. Tweaking the recipe filling might help."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "I followed the recipe (not the video that calls for corn starch, not corn syrup). They came out great, I will be making again to take along to a baby shower next week; this was a pre-run."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rosie"
},
"reviewBody": "I made it exactly as the recipe called for. They are delicious. The filling worked out just fine. It was not sticky and easy to roll into little balls to put it into the crust. The only thing that didn’t work was that they spilled over a little and some of them broke apart when I took them out of the pan. I probably could have made more than twenty four. I used the mini muffin pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Pierre"
},
"reviewBody": "Recipe is super delicious! The only changes I made: substituted powered sugar with brown sugar in the filling and added 1tsp of vanilla extract. That was based off the reviews. I also took everyone's suggestion and didn't bake the filling. It gels up pretty hard with cooling. I'm definitely making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQTim"
},
"reviewBody": "Made a half batch, since there are only two of us. Came up short on the filling, so put some chunky cranberry sauce in two of the shells. Worked well. When pressing dough into pan wells, found that I needed to be careful to thin out the joint area between the side and bottom. Will be playing with this recipe in the future, trying some different fillings as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miller5"
},
"reviewBody": "Delicious! I will be making these every year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billie"
},
"reviewBody": "I made these exactly according to recipe. They were delicious and I've shared the recipe with everyone who tried them. Thanks !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roger Windham"
},
"reviewBody": "Didn't change anything but I did learn to let them cool completely in the muffin tin before turning them out. Until I did that the bottom tore out of the warm cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goddesdark"
},
"reviewBody": "These cookies are amazing! Our new favorite,thank goodness I made a double batch. I did use a different filling recipe because I was out of corn syrup, but this cookie base could be filled with so many different things and still be great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathie Brown-Entler"
},
"reviewBody": "so good ! the only change I made was someone recommended using brown sugar in the filling instead of powdered more like a pecan pie. it was sooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cory Reisner"
},
"reviewBody": "I’ve never ate anything better, I didn’t expect this. INCREDIBLE!!!!!!! But I put mine in cupcake wrappers and I cooked it for 15 minutes, they came out perfectly golden brown and popped right out of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "blakevj"
},
"reviewBody": "Very good cookie! I didn't put them in a cupcake pan. I just made balls and put them on a cookie sheet. Made a depression and put the pecan mixture in. They worked out great!\n\nI would definitely put cinnamon or nutmeg in the pecan mixture next time I make them. The pecan mixture seems just a bit bland.\n\nI will definitely make them again! I like the softness of the cookie. They're not hard like some cookies are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shelly Duellman"
},
"reviewBody": "Recipe was definitely wrong. Making it like recipe says it turned rock hard in frig. Making it like video shows you couldn’t bring to boil and then add pecan. What a waste of time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "These were easy but I wasn’t wowed by the crust. I used the mini muffin pans and like these better. I will make again but maybe add a little salt to my dough. The key to getting them out is 5 min in the pan and then cool on rack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auna Knepper"
},
"reviewBody": "It turn out wonderful! I made these about a month ago and my co workers loved it! Now I made some for the troops overseas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VictoriaSe49896"
},
"reviewBody": "I made this as written. I found the cookies/tarts to not have enough filling and the shortbread was more grainy than my other shortbread recipes. I won't be making this one again. If you choose to make these I would recommend adding more filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Ross"
},
"reviewBody": "THIS!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Hackett"
},
"reviewBody": "Into ingredients you can add toffee chips, shredded coconut, butterscotch chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "These disappeared very fast at a family gathering. I will definitely makes them again, but I think I’d drop in a couple of raisins into the cups before I add the filling. De-lish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carole"
},
"reviewBody": "The pecan pie cookies are very good. I baked them in small cupcake pans instead of regular size cupcake pans and my family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "Definitely need to use a mini cupcake pan to get the pie effect. Using a cupcake pan made them a bit flat. I didn't experience the hard candy-like texture of the pecan mixture like other reviewers noted. I would make these again even without a mini pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cathy"
},
"reviewBody": "This recipe was a disaster. Not one of the cookies came out of the pan in one piece!! The dough was sticky like there wasn’t enough flour and the filling was awful. I wasted 2 hours and about $20 of supplies, including some pricey pecans. I will not be making this recipe again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bebbiebell"
},
"reviewBody": "I’m giving this recipe five stars for flavor and possible user error. I made the changes others did ( brown sugar instead of confectioners sugar and I didn’t cook the filling) But I used a mini- muffin pan and I couldn’t get the mini pies out without them breaking. I do plan to try this recipe again and use my regular muffin pan to make thinner pies and see if that works better. The flavor was so good I want to make these cookies look nice enough to serve company"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laureen Chaffin"
},
"reviewBody": "Another husband favorite - I made these twice last year. Adding them to the repeat recipe list for the annual Cook-N-Destroy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karinna F."
},
"reviewBody": "I don't have a cupcake pan, so I used circle shaped cookie cutters instead. Overall they tasted amazing! My friend now beg me to make them every Thanksgiving! \nHappy Holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Devon"
},
"reviewBody": "Amazing recipe! I ran our of the pecan filling so I used mini Reese's cups to fill in the last of the \"shells\". Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Curnonsky Comelier"
},
"reviewBody": "I just had margarine to make this and the consistency ended up being so liquid. Had a good result buts is more like a mashed thing. So I made 3 batches, 1 with more flour and another one with oats too. They ended up being ready but good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saundra"
},
"reviewBody": "Very easy nice cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Birdie"
},
"reviewBody": "I halved the recipe then followed others suggestions. I used a mini cupcake tin. It made 23, argh, one short. \nFor filling: Substituted brown sugar for the confectioners sugar. Did not boil filling so as to avoid making hard candy. Only melted butter and (brown) sugar just until melted then removed from the heat and added other ingredients but also added 1 tsp vanilla extract to mixture as suggested. Did not refrigerate since I didn’t boil it. Anyway it cooled quite enough while I prepared the cookie. \nFor the cookie: no changes made\nUsing a melon baller to fill made it easy!\nCleanup was super clean. Absolutely no worries that the sticky ingredients would leave hard to scrape residual on my pans. Really happy about that! Not exactly sure why people substituted brown sugar for confectioners sugar in the filling. So, just out of pure curiosity, I may make these again using confectioners sugar and compare the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tondre'"
},
"reviewBody": "These are wonderful! I did add a bit of vanilla flavoring to the filling mixture and it was devine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annette"
},
"reviewBody": "Love love loved these cookies!! They were a huge hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim Arnold"
},
"reviewBody": "Too much crust and not enough filling. I think the recipe expects you to use mini-muffin pans (maybe??) but does not specify. Either do that or half the crust/double the filling. I would like to try this again with proper ratios. The version I made had the crust overwhelm (i.e. close around the filling) on some cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "This recipe is very good. I only had one qualm with it: the dough stuck to the pan. As for the ingredients themselves, I added vanilla to the pecan filling and did not bring the mix to boil. The filling was delicious and gooey not hard like candy after baking. Definitely don't boil the filling mixture. Let it finish its cooking in the oven. The flavor was fantastic. Will make it again however I made a batch with mini cupcake cups at the bottom. I highly recommend it to prevent the mini pies from sticking to the pan. In mini muffin pans, the yield can be up to 34 mini pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Country Cook"
},
"reviewBody": "Easy to make and came out exactly as shown. I made my crust on the thin side and the recipe made just over two dozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wanda Johnson"
},
"reviewBody": "I made these cookies today. i added 1/4 cup extra of flour because the dough was sticky. I also added 1 1/2 teaspoons of rum flavor and I didn't cook the filling. The cookies came out pretty good after I made the adjustments. I also used brown sugar instead of the confectioner's sugar and added salt to the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanMcD"
},
"reviewBody": "So good, was a hit a Christmas, I made the recipe twice because they went so fast. Cookie part is delicious, bakes up firm enough to hold filling, but still tender. Try it, you will absolutely enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "First try not so good will try again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nmf"
},
"reviewBody": "I made this recipe as is except for adding rum and vanilla to the filling and as suggested, I did not cook it. These things were really good. I think without the rum and vanilla it would have been pretty plain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Chiodo"
},
"reviewBody": "I am torn between 3 and 4 stars. Like most everyone here, I had to modify this recipe. The recipe name should be changed to Pecan Tarts because they are not cookies. I chose to use two mini-muffin/tart pans that hold 24 individual pieces. That was a good choice. I agree 100% with NOT cooking the filling because it gets too hard. I purchased several frozen pie crusts and thawed them. I did not want all that sugar in the crust! I used brown sugar for the filling, not confectioners sugar; however, after they were cooked, I sprinkled confectioners powdered sugar on them for a festive look. They were delicious which is why I gave them 4 stars, but way too labor intensive (3 stars). One hint is that I used an appropriate-sized water glass to punch out perfect-shaped circles for the dough, then eased each circle of dough into the muffin tins. They looked perfect, but way too much work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "I made mine in a mini muffin pan, turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dourna"
},
"reviewBody": "I followed the advice of others and did not cook the filling. I used brown sugar in place of confectioners sugar in the filling. I split the light corn syrup with dark corn syrup and added cinnamon to add richness to the flavor. Also, I toasted the pecans prior to chopping and adding to the mix. I used the dough recipe as submitted. I pressed the dough into mini muffin tins without utilizing liners. They were fairly easy to remove from the greased pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jozi"
},
"reviewBody": "I made these and they turned out great. I did use brown sugar instead of confectioners like one review were recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desiere Campeau Hernandez"
},
"reviewBody": "Seriously delicious! Took these to work and got tons of compliments on how good these are. You won't regret bringing these anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucycchou"
},
"reviewBody": "These were delicious. I listened to the recommendations of other reviews and they were very helpful. Didn't cook the filling (Just melt the butter and stir in the brown sugar until it is dissolved. Remove from heat and stir in the corn syrup and pecans. ). I also used brown sugar instead of the confectioners sugar. I tried both minimuffin and regular muffin trays and both came out fine (I preferred the regular muffin trays slightly). Was careful not to overcook (stuck to 10-11 min)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elle"
},
"reviewBody": "These are not that difficult to make and look amazing!!!! They taste even better than they look! I used mini muffin tins so it made 50 cookies that look just like miniature pecan pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Coffman"
},
"reviewBody": "Made these Pecan Pie cookies, simple and easy to do. Looked similar to picture and tasted delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet Blais"
},
"reviewBody": "No, perfect just the way they are"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Wright"
},
"reviewBody": "I made a test batch this morning using the hint to not boil the topping mixture. That was a good call. I did find getting them to come out of the tin and not mutilate the cookie quite challenging. So my solution was to use cupcake wrappers. This made fluted crust edges and made removal a breeze. I ended up making four more batches. I’ll add these to my annual cookie bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruce"
},
"reviewBody": "Only change I made added a little more butter and nutmeg definitely MAKE again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Olson-Manska"
},
"reviewBody": "These Pecan Pie cookies are wonderful! The only change I made was that I didn't boil the filling for a full mintue - I didn't want it to get too hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "opihi"
},
"reviewBody": "i left a review yesterday about not having enough filling and it being too fiddly but i’ve had 3 people telling me how much they loved it and asking for more. i filled the remaining shells with mince meat and apricot preserves (seperately). and i tried one today. they aren’t cookies. more ov little tartlets. but everyone was right. they are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Acotton123"
},
"reviewBody": "These came out great! I took some of the recommendations and used a mini muffin tin. Added a bit of bourbon and vanilla to the filling and substituted brown sugar for confectioners, and added a 1/4 tsp and some cinnamon and nutmeg to the dough. The filling ran out so I improvised with some other fillings at the end. Looking forward to taking these to my cookie exchange!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "This is a very easy to follow recipe. I think I left the filling in the fridge for too long so it was completely set like a toffee so I was unable to spoon the filling into the crust. Do watch them carefully as mine were more than done after 10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ivy Lunt"
},
"reviewBody": "I would cook it for less time and add less sugar in the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KristenB"
},
"reviewBody": "4 1/2 stars, these are delicious little pecan pies! Pecan mixture does get a bit hard to work with once in fridge so I would suggest to put it in just to cool it down. I used a mini cupcake tin to form cookie base which worked really well Yummo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "Followed other reviews and did not cook the butter/syrup mixture, also added dark rum. They were fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "is-it-done-yet"
},
"reviewBody": "I haven't eaten them myself (diabetic AND THESE HAVE AN ABUNDANCE OF SUGAR ETC..), I replaced the flour with King Arthur (MEASURE FOR MEASURE GLUTEN FREE FLOUR), for a guest that has celiac disease. Everyone that has had them love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robyn G (VeronicaBell)"
},
"reviewBody": "Easy to follow recipe and tasted pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Delicious. I made them in a little muffin tin. Except I made them too big and they boiled over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Theresa Milhomme"
},
"reviewBody": "As someone already stated once you let the filling cool you have the consistency of peanut brittle, really hard. I put my filling in the microwave until I could stir it easily (not hot) and added one egg to the mixture. The filling was more like the filling of a pecan pie. It baked beautifully! I will make them again but will add one egg to the filling once it is cool but not refrigerated and bake as usual"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myrt Bryl"
},
"reviewBody": "Turned out just as I thought. Made them for Christmas but could not help myself and ate four! Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosaitalia"
},
"reviewBody": "The batter and the filling amounts matched to completion. I added a 1/2 t salt to both the batter and filling. In addition to the vanilla flavor, I added the same amount of rum flavor. Thirteen minutes bake time was good, but the pies had to cool completely in the mini-cup tin on a rack or they would fall apart. This meant that unless there are two pans, one has to wait to complete the batch. It also took a bit of practice to release them. They went straight from the pan to the plate without a “part two” cooling on a rack. The recipe made 37 pies. I will make these again; took less time and finesse for this baker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "Always use min cup cake pan and do NOT cook the filling just mix and DO add some flavor to it, like Almond extract or Vanilla or Rum extract. I used bread flour too. Also watched real close. Thanks !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Azucena "
},
"reviewBody": "Fantastic recipe! I made it exactly like it is and everyone loved it! I left half of the batch as is and the other half I dipped in a mixture of semi sweet and milk chocolate and they tasted even better! My sister and my mom have asked me to make more. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkcsem"
},
"reviewBody": "After reading through some of the previous reviews, I made some adjustments; I used the mini cupcake pan and for the filling instead of the confectioners sugar I used the dark brown sugar and added about a teaspoon of vanilla (just a smidge more). I also added a bit more pecans. I also only warmed the filling until the butter was melted. They turned out fantastic. My pickiest of eaters couldn't eat enough. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "booboo"
},
"reviewBody": "Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jasmine Radfern"
},
"reviewBody": "Not a perfect recipe, it doesn't have the depth of flavour an actual pecan pie has but it's nice none the less. It's good for bringing to a meal or giving as a gift since it's a little different and stands out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stella T"
},
"reviewBody": "I used brown sugar instead of confectioner's sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Speedinginger"
},
"reviewBody": "I love this recipe for several reasons. It converts well to gluten free using Bob's Red Mill 1-to-1 flour. The cookies look fancy but are really easy to make and they freeze well. Getting them out of the pan can be a bit tricky. If I'm feeling lazy, I'll just use cupcake liners that peel right off after baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "These cookies are incredibly delicious!!!!!!!!! My family loved them and I couldn't stop eating them. 1 tip I have: use mini muffins tins and a cookie scooper for the cookie dough. Both are the perfect size for making these tassie cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RoachHouse"
},
"reviewBody": "Super tasty - but somewhat difficult to get out of the muffin tin without breaking it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brigite"
},
"reviewBody": "Pure heaven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin LaCoursiere"
},
"reviewBody": "Cookies taste great and the filling really smelled like pecan pie! However, I found them a little finnicky in that it was hard to get the filling in just right and often the filling would bake over the cookie, making it look messy. They needed to be completely cooled almost before taking them out of the pan otherwise they would fall apart (I may have made the pockets too deep). I also made a few changes to the recipe based on other reviews:\nFilling:\nAdded 1 Tbsp molasses to filling\nUsed half confectioner's sugar/half brown sugar in filling\nDid not boil the filling\nAdded 1 tsp cinnamon to filling\n\nDough:\nAdded a little almond extract (this is personal preference)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kyl"
},
"reviewBody": "Made these to go in my Christmas cookie tin I gave to neighbors each year. Had a few leftover for my Christmas gathering with friends - they were delicious! I was surprised how quickly they baked in the oven - 11 minutes. I made these to look more like pecan tarts, only problem is there wasn't enough filling (4 short). If you go this route, be sure to boost the filling ingredients slightly. I highly recommend these \n!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "skatmatth"
},
"reviewBody": "I made these for a bake sale and for my husband who loooooooooooves pecan pie. he prefers the pie because he's used to it. I don't mind this and I hate the pie. Little notes: use dark brown sugar in the filling instead of confectioners as it adds a nice flavor. I didn't boil and refrigerate it as many people said that made the filling hard as a rock. Mine came out very nice. More nut than sugar mix and that's why i liked it more than the pie. The cookie part is good all by itself which is a hidden bonus as you need to double the filling to have enough for the cookies. I used paper lines in my cupcake pan for easy cleanup and sale, but I think the amount of butter makes it unnecessary if you want. Overall, very good. keeping this one for the southerners who like cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Taylor"
},
"reviewBody": "I made a couple of changes after having trouble getting them out of the pans (tried it twice). I used my mini cheesecake pans and they worked well. I pushed the dough about halfway up the sides. I also substituted dark karo syrup for the light and it has a better flavor. I baked them about 15 minutes instead of 13 (I was using dark pans so lowered the temp to 325). I didn't refrigerate the filling but just let it sit until thick and cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJONESY26"
},
"reviewBody": "SO easy and delicious! I made them for friends for the derby and they were a hit! I omitted the corn syrup and added a little coconut rum and vanilla to the nut mix, and in the fill part i put some dark chocolate chips. The cookie base is delicious- you could probably experiment with a lot of different fillings! I also used a mini cupcake pan and it worked really well. I will be making these again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nervousrek"
},
"reviewBody": "Very yummy cookies. Good tip is to use a small melon baler to scoop out the perfect amount of dough. This also helps to keep them all the same size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah McEwin"
},
"reviewBody": "These are so yummy! They're fairly quick and easy too. I may have a new favourite cookie. I Canadianed them up a bit with maple syrup rather than corn syrup and added a bit of cinnamon and nutmeg to the crust but otherwise followed the recipe. Be careful not to overfill them, they boiled over a little, though it kind of acted as a glaze on the top of the crust so it was no big deal but if they'd been a little more full, it could have been messy. Make sure to watch the time as they bake quickly and I found they were perfect after only 9-10 minutes (though I tend to like things lightly baked)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy"
},
"reviewBody": "These are so easy to make not to mention delicious! Thanks for sharing, its a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Susan Parrish"
},
"reviewBody": "Good luck, if you try this! It takes a better cook than I. They sound so tempting, but are a world of work, and then, impossible to get out of the tins without falling apart. Oh, you can eat it - they just won't look pretty. And, if you DO try, make sure to add a pinch of salt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "Very good cookie!These were so simple and quick to make!! These will make a nice addition to my Christmas cookie trays this year!my husband gave them two thumbs up!! So I know they must be good LOL because he complains about everything"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noel Keen"
},
"reviewBody": "Other reviews said the filling was missing something, so I looked at a pecan pie recipe. Substituted brown sugar for the confectioners sugar. It is so good! Don't cook the filling either- that turns it to candy. Just melt the butter and stir in the brown sugar until it is dissolved. Remove from heat and stir in the corn syrup and pecans. Doesn't even need cooled in the fridge. Will be proudly sharing these at a cookie exchange soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristinae Lucik Toomians"
},
"reviewBody": "It was good, but needed salt in the dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Castille"
},
"reviewBody": "This recipe is wonderful. Taste like a dessert from a gourmet bakery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "Oh.My.Gosh. These mini pies are AMAZING! They are a family hit and I'm definitely making them again. To make it a little healthier, I used half all purpose flour and half whole wheat and reduced the amount of butter by a couple tablespoons for the batter. Not chewy at all, very soft and sweet. I recommend this to anyone looking to satisfy a sweet tooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis Roe"
},
"reviewBody": "These are really tasty. I added a Tablespoon of molasses into the sugar/nut mixture to make it taste more like pecan pie. If you don't eat them while they're still warm I recommend microwaving them for 10 seconds to make the center a bit gooey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "The filling was delicious but I tried this recipe twice and my dough was very sticky. I could not work with it at all, I had to spoon it into the muffin cups. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori "
},
"reviewBody": "These are good. Sticky, crunchy nuts in the middle of a nice sugar cookie. These are cookies not tarts or mini pies so the outside does not taste like a pie crust. I did not boil the filling just melted the ingredients together. Made them in a mini muffin pan. Filled the well to the top with the filling but after baking most settled and came out looking only half full. They are stick in your teeth good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Ruesch"
},
"reviewBody": "These were absolutely delicious! Just like mini pecan pies. My husband, kids and I could not enjoy them fast enough......will be making them for many years to come! Thank you for sharing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Goolahoo"
},
"reviewBody": "The crust is more like a soft cookie, not really a pie crust. They fell apart taking them out of the pan. Did not taste like a pecan pie either. I was very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "susiekew"
},
"reviewBody": "These cookies tasted OK, but the filling was way too hard and sticky prepared as directed. I think the problem is in the amount of time it was boiled before being put in the cookie crust. When I took it out if the frdge after cooling it was like a rock and I had to microwave it to be able to get pieces off. Thanks anyway."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/212863/pecan-pie-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
"name": "Nut Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17284/desserts/nut-desserts/pecan-desserts/",
"name": "Pecan Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/212863/pecan-pie-cookies/",
"name": "Pecan Pie Cookies"
}
}
]
}
}
, "about": [
]
}
]