				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pecan Pie Tarts"
,"datePublished": "1999-10-15T11:55:14.000-04:00"
,"dateModified": "2022-08-22T14:48:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ruth"
,"url": "https://www.allrecipes.com/cook/Ruth"
}
]
,"description": "These dainty treats are so easy to accomplish. The cream cheese pastry is mixed, rolled into balls and each pressed into the bottom and sides of tiny tart pans. The pecan filling is spooned in and the pies baked until the filling is set. Garnish each with a dollop of whipped cream and a pecan half."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/n0duxLOgRO4-VIuwG9Y2u2tBEPY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1869522-bf294afad6284d9b8cda08b7fa282f62.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pecan Pie Tarts"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "121"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "209 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "39 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "79 mg"
,"sugarContent": "11 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"6 ounces cream cheese",
"1 cup butter, softened",
"2 cups all-purpose flour",
"0.25 cup butter, softened",
"1.5 cups packed brown sugar",
"2 eggs",
"2 teaspoons vanilla extract",
"1.75 cups chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Grease 30 tart tins or muffin cups and set aside."
} ,{
"@type": "HowToStep"
,"text": "To Make Crust: In a medium mixing bowl cream together cream cheese and 1 cup butter until light and fluffy. Blend in flour, 1/2 cup at a time, forming a smooth dough. Roll into 30 equal balls and press one into each greased tin so it lines the bottom and sides, like a pie crust."
} ,{
"@type": "HowToStep"
,"text": "To Make Filling: In a medium mixing bowl cream together 1/4 cup butter and sugar until light and fluffy. Beat in eggs and vanilla until thoroughly blended. Stir in pecans. Fill each lined tin half full. Mixture will rise as it bakes."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 25 minutes, or until lightly browned. Let cool in tins, then use the end of a table knife to flip each tart out of its tin."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Fortwangler"
},
"reviewBody": "Delicious! Used mini pans. Increased the recipe to use 8oz cream cheese - made 7 dozen. Had a recipe years ago that was similar and these turned out perfect ! Thanks !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Arlyn Delgadillo"
},
"reviewBody": "I followed the recipe and made everything as stated. no matter how long I left it in the oven the dough wouldn’t harden.. it tasted weird. Not the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariam Durrani"
},
"reviewBody": "Extremely easy, love the pastry dough, and the centers. I took half pecans and placed on top before placing in oven. The look was lovely when they came out. You knew it had pecans!! And then warmed in the microwave before adding a big scoop of Vani ice cream... YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Parks"
},
"reviewBody": "I reduced the number to 12. The filling ingredients for 12 was to much. Everything else was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MamaD"
},
"reviewBody": "So I’m NOT an experienced tart maker but have made my share of traditional southern pecan pies and was looking for something a little different this year. I think this could/will be a great recipe if I try it again. I made these in a mini muffin tin and did not press the shell thin enough. It’s difficult in a mini pan if you don’t have a tart press. So like others mentioned it felt like my crust/filling ratio was way off. We wound up just eating the little bite of filling and tossing most of the crust. Sad, because it’s actually a great little crust! :( My mini pan only holds 24 so I put 6 more in a regular muffin pan and those I pressed out super thin and filled almost to the top. This dough is very forgiving, like a bought pie crust, and fills in thin spots or cracks as it cooks. So don’t be afraid to press it thin against the muffin cup sides. The last 6 regular sized “pies” were definitely better. So, the moral of my story is, press a thin crust and use a regular muffin pan for these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Patrick"
},
"reviewBody": "I needed to add a half cup more flour. It took long to bake too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scarlett9735"
},
"reviewBody": "I halved the recipe. The dough came out kind of dry so I added some water and it was better. There wasn't a lot of dough to line the tins but the filling was really good. All in all this is a good recipe and the tarts come out very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy B"
},
"reviewBody": "My family loved these!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "The recipe, itself, is good. However, I baked mine in very shallow and tiny tart pans and baked them for the recommended 25 minutes and they weren't done. So, I left them in for another 7 minutes hoping that they'd get more done. They were starting to get brown so I took them out. Unfortunately, the pastry was still not done. Were I to make these again, I would cook them for at least 35-40 minutes or I would raise the temperature as 325 seems awfully low to me to cook pastry with such a heavy filling. I also added chocolate chips to some of the filling and it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Woolley"
},
"reviewBody": "It was so much easier than baking a whole pie and just as delicious! Everybody loved them and they were gone in a flash. Next year I’ll make two batches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dtyhosky"
},
"reviewBody": "Delicious mini pecan pie pastries, bite size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nes Ahmed"
},
"reviewBody": "My go to around holiday season!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aem"
},
"reviewBody": "Definitely will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Byubuf"
},
"reviewBody": "I've been making these for 35 years and never had a complaint. I don't like the Teflon pans, they make the crust really tuff!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue1"
},
"reviewBody": "these tasted great. i think maybe next time i wii melt the butter, cool it and then stir in the eggs. mixing everything with a mixer added too much air. it covered up the whole pecans i had placed on top on each mini tart. next time i might also use chopped pecans"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan S"
},
"reviewBody": "I think this is the same as our old Family Recipe (I can't find the recipe box). My mom always put in currants. But I prefer raisins. Just a quarter cup or so. The cream cheese gives a great elasticity to the dough, you can spread it pretty thin. Don't whip the eggs up too much, just mix, or you get a weird eggy crust on top of the tart. I fill min 3/4 full and they are just fine. I agree there is sometimes extra filling. That's a great problem to have. Grease a ramekin and bake it separately. I am trying to reduce carbs and gluten so I used coconut flour this time. Epic fail. Coconut flour just stays dry and crumbly, thick and somewhat tasteless. Might have worked if I doubled the butter? Not worth the effort. I may try a mix of almond and regular flour next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brancman"
},
"reviewBody": "The crust is the hardest part and only took like 30 minutes for all of them. The raw batter tastes really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missy D"
},
"reviewBody": "I used just the rust but o loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beannp"
},
"reviewBody": "Make these annually and never get tired of eating them! Still good a few days later, if there are any left!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alicia McNichols"
},
"reviewBody": "Made exactly as directed. Outstanding! No changes needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dat1guy"
},
"reviewBody": "Just made these for the third time and they get better every time. So delicious and just the right size so I don't eat too much (as long as I can stop myself from going back for seconds or thirds!). I made the mistake of putting the whole 8 Oz block of cream cheese into the dough and so that might explain the looseness that I experienced, but I was still able to work it into the muffin cups with a little finesse. It helps if you refrigerate the dough while making the filling. I use a tart tamper dabbed in flour before pressing out the dough ball in each cup. It works pretty well. I only made 24 since I didn't want to bake a 3rd muffin pan full, and I still ran short on filling. I like a lot of filling in them, so next time I will add enough ingredients to make 1 and 1/2 times the filling amount. Make these! You won't regret it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misstcat"
},
"reviewBody": "Make them every year and they are a big hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luv 2 bake"
},
"reviewBody": "Loved this recipe. It was a hit! I used normal sized muffin tins and there was extra filling. I suggest making double the crust or half the filling. Also, there was a lot of pecans and could hardly taste the sugar part, so I cut back on the pecans a bit or just take them out when I make them(pecans are expensive). But once I figured it out, they were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "Extraordinary taste and visual appeal. I read a review about having left-over filling using a mini muffin tin, but I did not have the same experience. I was able to fill two 24-cavity mini muffin pans - using up all of my dough and filling in perfect measure. I was concerned that the filling might be too simple and not have much flavor, but I needn't have worried. The brown sugar in the mix gives the tops a lovely golden color and sugary crackle while keeping a smooth texture inside the crusts. I did add 3 milk chocolate chips to each tart before popping them in the oven - which complimented the filling nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce Yeshua"
},
"reviewBody": "learned this recipe years ago. my husbands absolute favorite holiday treat. you cant screw this up. Anyone can make these!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alice"
},
"reviewBody": "Meh. I think these were just ok. I ended up with a bunch of leftover filling which seemed like a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristie Noble"
},
"reviewBody": "Delicious and so easy. I used a Pillsbury pie crust. Served them at Thanksgiving and had to hide a couple because they were going so fast. Perfect texture and sweetness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dianne"
},
"reviewBody": "Great taste, but follow the recipe and do not over fill! I had a tough time getting them out of the muffin tin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SpycGyrl"
},
"reviewBody": "I read lot's of people had issues with not enough filling in this recipe. Since this recipe was posted six years ago, it may have been reworked. I thought the proportions were spot on.\nI've made these for over 20 years, so here's a few tips I've learned along the way. 1) If you think your tarts are too doughy, you've probably made the balls too large-or not added enough filling. I've found a heaping kitchen tsp is perfect 2) Because of all the butter in the dough, there's no need to refrigerate first, it won't stick to fingers or the pan . After rolling the ball and placing in pan, a thumb pressed in the middle and using an index finger to press the sides works well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TR6"
},
"reviewBody": "Pretty much went by recipe. They were delicious and every one loved them. Used crust for sweet potato mini pies also. Made and froze both for Thanksgiving. Will top sweet potato ones with mini marshmallows and crunch toppings ( pecan, butter &amp; flour), everyone reaches for the pecan tarts first, go figure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "These remind me of the tassies my great aunt used to make for holidays when I was a girl. Just wonderful! I'm going to try using parchment strips to prevent spill-over this time, because I really want as much filling as possible. These are worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eggdestroyer"
},
"reviewBody": "Amazing recipe, so delicious and surprisingly easy! Sometimes the little cups collapsed, but that was all me making them too thin!! Thank you so much for this !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wordgirl"
},
"reviewBody": "Here's the problem: They're disappearing! Made them for Thanksgiving dessert (which will be in 4 hours) but people keep filching them. I even put them away in a cabinet, yet they're about half gone\n\nI agree with the advice to cook them about 3 minutes less than the recipe calls for. Also, I used a two kinds of pans - they came out much better in the dark nonstick cupcake pan, nicely browned on the bottom. In the silver pan they stuck and burned a bit. (Don't worry, they'll still get eaten.)\n\nOne other thing I would recommend: Gt them out of the pan as soon as you can - carefully. I used two forks. A few in the silver pan came apart because I left them in long enough for the random bits of melted sugar to solidify."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "l_thomas103"
},
"reviewBody": "Tryed filling only in tart shells. I found it very dry and not very flavourful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tryed filling only in tart shells. I found it very dry and not very flavourful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Editha"
},
"reviewBody": "I just made these. Big disappointment. I use the same dough for mini tarts but roll it paper thin. These came out very doughy, needs coffee to push them down. The filling was twice than what I needed. These would be better in regular muffin tins with very little dough. Editha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MREITZ"
},
"reviewBody": "It was the best dessert I have ever had. I do not know how to rate five stars but that is what I want to do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Wilson"
},
"reviewBody": "Simply amazing! Pastry is nice, light and flaky. The filling is the perfect mixture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stefisgreat"
},
"reviewBody": "These are great and always a classic in my home! I usually dust with powdered sugar on top to make it look a little more festive. Enjoy and thank you for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Wells"
},
"reviewBody": "Made a version of this with mini chocolate chips added to make mini-derby pies. Had lots of regular pie crust, so I used that instead. Turned out well and everyone at the Louisville bridal shower loved them. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Bell"
},
"reviewBody": "These are divine! The crust is melt-in-your mouth tender and the filling is rich and sweet. A home run for sure! Will make these again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hazel Kennard"
},
"reviewBody": "Wonderful can't eat just one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackie"
},
"reviewBody": "Made these for my son as he requested pecan tarts and I didn't have a restaurant. According to him they are really good. So that means they are a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "That Meta"
},
"reviewBody": "What the heck did I do wrong!? I made the crust as instructed...divided the dough into 30 very large sized balls for my mini muffin tins...then I don't care how good you are, 1/4C of butter does NOT cream into 1 1/2C of packed brown sugar; dry crumbly mixture yes...then after filling the crust (which I used the back end of a wooden citrus juicer dipped in flour to create the well of the crust-worked great) I had more than half the filling remaining.....they are still in the oven so I have tried them but again, don't know what I did wrong...doesn't look like any other reviewers had the same trouble....I'm going to freeze the leftover filling....and remain perplexed...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DRQUINN"
},
"reviewBody": "Tasted okay, but I will not make these again. Hoped the filling would be more like a pecan pie. I did use a Pampered Chef tart pan. Way too much filling for the amount of crust dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BdelSol"
},
"reviewBody": "Made these for Thanksgiving. This will be on my table for as many holidays as I can think of. My family loved them. My dough did not make 36 tarts - but close enough, I used regular muffin pans. Quick &amp; Easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy S"
},
"reviewBody": "Delicious! These were a hit at our southern style bbq. Next time, and there will be one, i will crush the pecans and line the bottom of each tart, pouring the mix over them. Maybe a few crushed pecans on top, as well. \n\nI cut the recipe in half, and barely had enough dough or filling for 12 full size muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whoisthesef"
},
"reviewBody": "Used for crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Green McIntyre"
},
"reviewBody": "These were just okay. I've had better. The filling and crust amounts didn't match up, I had way too much crust, way too little filling. The crust was pretty flavorless too, so maybe a little less crust and a little more filling would make these pop a bit more in the flavor department. The \"Maple Pecan Shortbread Squares\" from this site are a MUCH tastier option to a pecan desert. And easier too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smartt"
},
"reviewBody": "These little pecan pie tarts were so delicious and cute! I was a bit nervous about how the crust would turn out because I had a little trouble pushing them into the muffin tins. The crust came out so good though and was very light, flaky, and buttery! Next time I will double up on the crust though. Thank you so much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon T"
},
"reviewBody": "Awesome! First time making these and they will definitely be a Christmas staple. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkweathers"
},
"reviewBody": "everyone always loves these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOTTIENJ"
},
"reviewBody": "Fabulous...but they did not last! I brought these in to share with my office. Those who were not fortunate to get one (or two or more) begged me to either make more or for the recipe! I'm planning to make another batch or two so that my family and friends can enjoy them too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mily"
},
"reviewBody": "I've made this recipe a few times. The second time, I altered the recipe a little bit. I was missing a few ingredients. I replaced one of the eggs with 1/4 cup apple sauce and 1 tsp of baking soda. I didn't have enough brown sugar so I replaced it with 1 cup of white sugar and 3 tsp of molasses. These hit the spot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillian Dominguez"
},
"reviewBody": "I've been making these little bites of heaven for over 25 yrs. for my family and friends and they love them! Just made some recently at my friends house for her. I used macadamia nuts instead,...they were gone in less than an hour!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "June Purnell"
},
"reviewBody": "These were wonerful. I used the wooden tart former and found out I needed to use less crust in each tart. Will add sugar to crust, little more flour so it would not be sticky Chilled for a few minutes before making tarts.Doubled the filling and almost used it all.\nI will make these again with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashlynn"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I made the recipe for 30 tarts. It made 48. I ended up making the balls a little smaller so there wasn't so much dough in each tart. There is quite a bit of the filling left over so I will make another batch. These are absolutely adorable! And tast great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crackedglass"
},
"reviewBody": "Made these for a shower, and everyone seemed to like them. However, even though I ended up using less of the crust in each of the muffin cups then described, I still had too much filling left over, and they were a bit heavy on the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pinkdiva"
},
"reviewBody": "I recalculated for 20 servings..but it only filled up 12 muffin cups ( perfect as that was all my muffin tin sheet could fit ). A bit on the dry side and not too sweet. Next time I will put more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "A solid 4.5 rating from me. Definitely easy and tasty, but like others I needed more dough to compensate for the extra filling. The taste is very good, especially the dough. Thanks for sharing this recipe, Ruth!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Holly "
},
"reviewBody": "Served these at Thanksgiving and they were okay, nothing great. Not as flavorful as I had hoped. Used a mini muffin tin and had twice the filling needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynette"
},
"reviewBody": "Fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Massey Harbour"
},
"reviewBody": "These are great! The crust has amazing flavor. I made 2 batches of dough and 1 1/4 batches of filling and it made 4 mini muffin pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellastar99"
},
"reviewBody": "I'm pretty sure the recipe intends these to be made in normal sized muffin tins, not mini muffin tins. It just says muffin tins in the directions and never mentions mini. You can certainly do either, but I'm pretty sure that everyone who reviewed this and had an issue with the crust vs filling ratio being off made them as mini muffins.\n\nI made these in traditional muffin tins and they turned out perfect, I got 30, and I had the right amount of filling for the crust. The crust was flaky and buttery and the filling was delicious. Hope that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TR"
},
"reviewBody": "Perfect flaky crust and tasty filling without the gooey center of a traditional pecan pie. Will make these again and again!\r\nFollowed the recipe exactly and they were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rbmallory"
},
"reviewBody": "These taste great - no doubt about it, but I was a little peeved that the receipe portions are way off. I ended up with twice as much filling as crust. I didn't want to waste the filling so I ended up making a second batch of crust at the last minute. I wish I had known ahead of time so I could have made it enough crust at one time. As I read the reviews today I saw this was a common issue. I used a mini muffin tin as did some others. Is it possible we used the wrong type of pan? I really wish the author would correct/clarify the recipe, because it is easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rainmn13"
},
"reviewBody": "surprisingly good! i didn't think i would like the crust, but it was really good. i made them in my mini pizza pans (i think it made 4)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "Excellent had to add approx 3oz milk for batch of 15 to form dough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aynie"
},
"reviewBody": "Awesome recipe. Didn't change anything and turned out great. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "Simply awesome - these definitely taste just like miniature pecan pies! They look adorable and once you pop one in your mouth you'll be hooked. These are so easy to make, but people will think you spent hours. I did cut back on the nuts a bit and used 1 &amp; 1/3 cups but other than that I didn't change a thing. I used a miniature muffin tin to bake these and I did get more than 30 - but the more the better with these little gems!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamie62381"
},
"reviewBody": "These were awesomely delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaydalj"
},
"reviewBody": "Love these tarts. Great recipe. Didn't need to change a thing. Would recommend getting a tart tamper to press and mold the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie617"
},
"reviewBody": "These were very good. I did roll out the dough and then cut circles with a fluted ring. They fit perfectly into the mini muffin tins and looked pretty after baking. I also added some toffee bits to the filling...well, why not! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cinnylc"
},
"reviewBody": "These were fantastic, and easy to make. I made half with pecans and made the other half with some stuff I had handy...chocolate chips, coconut and raisins. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Mosley"
},
"reviewBody": "CHILDHOOD FAVORITE! I dust them with powered sugar to add that last bite of sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "traveljunkie"
},
"reviewBody": "These are soooo good. I made them for my husband, because I don't really like pecan pie (until now!) I used frozen pie crust and got about 16 little pies using a mini muffin tin. I halved the filling recipe and had a little left over. This recipe is so much easier than others I have tried that involved cooking a corn syrup filling on the stove. Oh, and hubby popped 4 in his mouth, one right after the other. Now we're fighting over the remaining little pies! These are definitely worth trying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Mae Hinken"
},
"reviewBody": "Sooooooo good! I had to halve the filling since I only bought 1/2 cup of pecans. Still made plenty-12 regular muffin tin and 24 mini muffin size. Not too sweet, awesome pecan flavor! We loved the crust also-altogether perfect! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsea"
},
"reviewBody": "I made these, but I only used the filling part. For the crust, I just used a store-bought roll of pastry dough. I used the opening of a drinking glass to cut small rounds. I pressed them into a cupcake pan. Same baking temp, same baking time. The filling was great. These are so gooey and yummy! Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Watts"
},
"reviewBody": "I was looking for something to add to a potluck at work and decided personal pecan pies would be fun. I cut the recipe in half and had enough to fill 6 regular sized muffins. I did fill them more than half full but it didn't bubble out. Tops are perfectly browned and the crust is amazing. I did add a dash of salt to the crust and filling, just a pinch for flavor really. I will be making more of these as they are a wonderful way to control portions and skip the hassle of cutting and serving a real pie. Pipe the top with whipped cream or cool whip, sprinkle with a touch of cinnamon sugar add a whole pecan half (candied is nice) and its perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STEPHCF"
},
"reviewBody": "Yummy! Very decadent, followed the recipe exactly. Ended up with 36 tarts and leftover filling. Next time may try with light cream cheese. Got very good reviews from friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dboogie35"
},
"reviewBody": "Pretty good recipe. I added orange zest to the filling. Pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nellie Fiorenzi"
},
"reviewBody": "Perfect! I use this recipe all the time and the dough works great for mini quiche too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOOKETTE"
},
"reviewBody": "These are amazing! I will have to say though, next time I will either halve the filling or double the dough. Drizzled some with chocolate and topped off with powdered sugar - was a HIT at the office."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Thompson"
},
"reviewBody": "I just made the filling and used store bought shells and it was YUMMY! I used to make pecan tarts with corn syrup but this recipe(filling) was very quick and easy.\nWill definitely be making them again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JPMJ"
},
"reviewBody": "I only used the filling part of the recipe, and put it in regular pie pastry shells. I followed the recommendation of other reviewers and cut down on the nuts. They turned out very well. I was unsure if 325* was the correct temperature for regular pastry but it was fine. Update: I made them with the cream cheese pastry and it was fine, but I think using regular pastry makes no real difference to the taste. I will just use pie dough from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hayley Coronel"
},
"reviewBody": "Gave these a poor review a while back. Tried them again and loved them! I screwed up last time by not spreading the dough up the sides of the cups. The filling pretty much glued everything to the tin. \nThis time I made these in mini muffin tins and while that was ok, I think they will be better in regular size muffin tins. Also, I had alot of filling left, but I think that's because of the mini size. Great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesa Hampton"
},
"reviewBody": "I have been making this for a while however the title of this recipe is different, we call those pecan cups...just an extra hint...We sprinkle powdered sugar all over them right after they are taken out of the oven...Yummy, you will agree for sure without any hestitation!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "verilium"
},
"reviewBody": "Whenever I make these they're a hit at home or the office. The amount of filling is short of what I think is needed for the amount of dough that's made...I take an additional amount of whole pecans and glaze them with honey and dark corn syrup and spoon them over the tops of the tarts before they go in the oven. It fills them to the top and adds a little extra sweetness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe! If you like a creamier filling, cut back on the pecans by about 1/4 cup. Using the small tart tins and making the crust on the thinner side, I got @6 dozen of tarts. And there was just enough filling for this number of tarts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a great recipe... I used it to make mini-tarts and could make 3 dozen using the recipe. I had LOTS of filling left over (even though I filled them more than 1/2 full). I also cut back on the nuts. These are awesome though, and I'll definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These turned out really well. The crust holds together nicely,but isn't tough. It browned to a very light golden brown. There should be more gooey filling though. I will decrease the nuts next time, so that the spoon isn't so full of nuts each time I fill the shell. I made mini tarts and half a recipe made 24 and I baked for 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brandi"
},
"reviewBody": "Maybe I did something wrong. These weren't completely done and already starting to burn on top???? I did freeze about half and will reheat them and see if they're better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JONI K."
},
"reviewBody": "These were great, but turned out better once I froze the leftovers and reheated them in the oven. Reheating them gave them a richer, crispier taste. Will make again and bake a bit longer. They freeze wonderful, so it's easy to have them on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I baked these for a church bake sale and they went like hot cakes!! Everyone loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LDENSVEN"
},
"reviewBody": "Wonderful! The pastry was great! I have to agree with other reviews that recommended increasing the filling ingredients. There were so many nuts but not as much filling as I would like. These tarts still got gobbled up, though. Next time I make these I'll know better. Give them a try!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe! But I added chocolate chips and my family loved these holiday treats!! The crust is amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tasted great. I made 36 tarts with the dough, but had enough filling to make another batch the next day. I will remember next time to either double the dough or cut the filling ingredients in half."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15862/pecan-pie-tarts/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/824/desserts/pies/tarts/",
"name": "Tarts"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15862/pecan-pie-tarts/",
"name": "Pecan Pie Tarts"
}
}
]
}
}
, "about": [
]
}
]