				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Perfect Pot Stickers"
,"datePublished": "2017-10-25T01:32:08.000-04:00"
,"dateModified": "2023-02-26T14:01:52.529-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Homemade pot stickers filled with pork, ginger, and cabbage are fried and steamed, then fried again until golden and crispy for a truly unique dumpling."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5yWI2FiyHmqNMUPYcuLYYW7s_o4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261153-PerfectPotStickers-ddmfs-step4-0016-1-4x3-a7fdfc819c2a4746aa57dea8a6d35b24.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5625059288001",
"description": "Chef John’s favorite dumpling!",
"duration": "PT10M7S",
"name": "Perfect Pot Stickers",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/08/08/261153-PerfectPotStickers-ddmfs-3X4-0038-1.jpg",
"uploadDate": "2021-07-05T11:51:04.116-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Perfect Pot Stickers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "107"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "439 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "55 mg"
,"fiberContent": "2 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "1453 mg"
,"sugarContent": "4 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
, "recipeCategory": ["Appetizer"]
,"recipeCuisine": ["Chinese"]
,"recipeIngredient": [
"1 pound ground pork",
"4 cloves minced garlic",
"0.5 cup finely chopped green onions",
"3 tablespoons very finely minced fresh ginger",
"2 tablespoons soy sauce",
"1 teaspoon soy sauce",
"1 teaspoon sesame oil",
"1 pinch cayenne pepper",
"1.5 cups finely chopped green cabbage",
"2.5 cups all-purpose flour, or more as needed",
"0.75 teaspoon kosher salt",
"1 cup hot water, about 130 -150 F (55-65 C)",
"0.25 cup seasoned rice vinegar",
"0.25 cup soy sauce",
"6 tablespoons vegetable oil for frying, or as needed - divided",
"8 tablespoons water for steaming, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place ground pork, green onions, garlic, ginger, 2 tablespoon plus 1 teaspoon soy sauce, sesame oil, and cayenne in a mixing bowl. Top with chopped green cabbage. Mix with fork until thoroughly combined. Tamp down lightly; cover with plastic. Refrigerate until chilled, about an hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Qa2bGxvlTpdR1I6hQS-SXGWsoaQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261153-PerfectPotStickers-ddmfs-step1-0040-1-4x3-789b7c9bd37e4af095c9c9fc5a13bb24.jpg"
}
]
,"text": "Place 2 1/2 cups of flour and kosher salt in a mixing bowl. Slowly pour in hot water. Stir with a wooden spoon until mixture forms a shaggy dough. Flour your hands and transfer dough to a work surface. Knead dough until it becomes smooth and elastic, about 3 to 5 minutes. If dough seems too sticky, sprinkle with a bit more flour, up to an additional 1/2 cup, and continue to knead. Wrap dough ball in plastic, and let it rest about 30 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/g8q1Mf5yKG6xLNJuUyS2BHQn2fg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261153-PerfectPotStickers-ddmfs-step2-0007-1-4x3-0b36c85ec8c64ee19ca7dc53b8114037.jpg"
}
]
,"text": "When dough has rested, divide into 4 equal pieces. Cover 3 pieces with a dish cloth while you work the first piece. Roll into a small log about the thickness of a thumb, about 3/4 inch. Divide each log into 6 equal pieces. Roll each piece into a thin 3 1/2-inch circle on a lightly floured surface to form the pot sticker wrappers. Repeat with the remaining dough pieces."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/YUPRBtfDBOIYnE5nTAasZysMGCs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261153-PerfectPotStickers-ddmfs-step3-0009-1-4x3-6c2140e5a1094d00a3fbb77ff33654a2.jpg"
}
]
,"text": "Lightly moisten the edges of a wrapper with your wet finger. Place a small scoop of the ground pork mixture onto the center of a wrapper. Fold up the 2 sides and pinch together in the center. Pinch together the remaining edges, forming &#34;pleats&#34; along one side. Tap the pot sticker on the work surface to slightly flatten the bottom; form a slight curve in it so it stands upright in the pan. Transfer to a well-floured plate. Repeat with remaining dough and filling."
} ,{
"@type": "HowToStep"
,"text": "Mix together seasoned rice vinegar and soy sauce in a small mixing bowl for the dipping sauce."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5yWI2FiyHmqNMUPYcuLYYW7s_o4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/261153-PerfectPotStickers-ddmfs-step4-0016-1-4x3-a7fdfc819c2a4746aa57dea8a6d35b24.jpg"
}
]
,"text": "Heat oil in skillet over medium-high heat. Place about 6 or 7 pot stickers in the hot oil, flat side down. Cook until bottoms are golden brown, about 2 minutes. Drizzle in water and quickly cover the pan; steam for 3 minutes. Uncover; reduce heat to medium. Continue cooking until water evaporates and bottoms are browned and crunchy, 1 or 2 minutes. Transfer to a warm serving dish. Repeat with remaining pot stickers. Serve with dipping sauce."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe with three exceptions based on comments I read. I used only 1 T fresh ginger and added about 1/4 cup chopped shiitake mushrooms. I also made a double batch of dough. I had enough filling for 44 potstickers. I overloaded them a bit on the filling and could easily have made 48. If you make one batch of dough (24 potstickers) I recommend cutting all of the filling ingredients in half. I used a 15 oz pre-seasoned garlic teriyaki pork tenderloin I found in the back of my freezer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! I mixed and matched from a few different ones. I like the cooking method described here. I was having trouble with them sticking to the pan. I've also noticed it helps to keep moving them the first few minutes they are on the pan to prevent the sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maylien Swenerton"
},
"reviewBody": "If you have leftover filling, form into small balls and freeze. Good addition to ramen noodles. No need to defrost just simmer them 5-8 min in the water you will add to ramen noodles. Add some sesame oil, frozen peas, cilantro, sriracha, green onions. A bonus treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tastes as good as the restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe has WAY too much ginger. Fortunately, I knew that before I ruined the recipe. I would use 1 teaspoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Burns"
},
"reviewBody": "We’ve made this 3 times. We freeze a bunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made these with this recipe and they came out amazing!! The flavor was on point. I had extra filling left over because I didn't want to overfill and thinly sliced more green cabbage and cooked it. Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mebeashli"
},
"reviewBody": "These were delicious! Used a little less ginger since I used those store bought ginger paste tubes and was worried it would be too overwhelming, and I used store bought cole slaw mix (cabbage and carrots) and just sliced it a bit smaller than how it came in the bag to use in the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wheelerrlowell"
},
"reviewBody": "Turned out really good. I was especially surprised by how good they were reheated - for some reason I thought they wouldn't be, but luckily that wasn't the case. Personally I wasn't fond of the dipping sauce - maybe I messed it up, but the vinegar was a bit much, and I actually really enjoyed them with just a little plain soy sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DeeDee Stone"
},
"reviewBody": "Dough recipe makes 24 dumplings (6x4=24) yet the yield says 32. Definitely doubling dough recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susannah79"
},
"reviewBody": "PERFECT !! My kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glen C"
},
"reviewBody": "I've made these three times so far and this is by far the best pot stickers recipe on the internet. I love them.\n\nI agree with one other comment that they need a little salt and pepper in the pork stuffing. But other than that, you can't go wrong. Far better than the boil first method and much easier. Thank you chef John for great recipe. Again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn Zen"
},
"reviewBody": "Maybe we didn't chill our dough long enough, but the stickers were kind of hard to form.\nOther than that they were really good. Everyone loved them.\nI think next time we'll chill our dough extra long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peg O'Grady"
},
"reviewBody": "For me, this recipe was perfect. The flavor was exactly what I was hoping for. The only change I made was to use ground ginger instead of fresh. I did not find it over powering, as some reviewers suggested. If you substitute ground ginger for fresh, use 1/4 tsp per tbsp of fresh. I used 3/4 tsp for this recipe and it was just right. I followed the dough recipe also and it couldn't have been easier. Two thumbs up for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j8wx7j449h"
},
"reviewBody": "Best video demonstration ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon B"
},
"reviewBody": "These were awesome! I must add that we too had more filling left over than the \"wrappers\".. Still really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Watson Halbrook"
},
"reviewBody": "This recipe was delicious!! It will be a great recipe to make when I have out of town visitors. I’ll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eduardo Maderas"
},
"reviewBody": "Absolutely fantastic. I used pre-made dumpling wrappers. I am going to look for larger size ones. My potstickers were a bit small, but boy did they taste good \n\nNext time I will chop the cabbage finer. I had a few threads of cabbage sticking out of the seams. No big deal. \n\nSomehow I wound up with no rice wine vinegar for the dipping sauce. My wife had me substitute basalmic vinegar. It worked just fine. \n\nCannot wait to make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "guitarvocs"
},
"reviewBody": "Made this tonight for the first time. The proportions are a bit off. The recipe says it makes 32 potstickers but the directions clearly say to cut dough into four pieces, then each piece into six, which I did. I was terrible at math but not that terrible. Also, I had a significant amount of meat left over, which I froze. The taste and texture were great, but the dipping sauce was disappointing. I'll have to work on that. I froze 14 of them raw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ltlkrow"
},
"reviewBody": "These really are PERFECT POT STICKERS! I thought I would need to buy wonton wrappers but this dough is excellent! As promised, this makes 2 dozen. Next time, I will make a half recipe. Also, I used a pie press. It makes life so much easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellyn Homa"
},
"reviewBody": "Absolutely delicious recipe! I made the dough per recipie and it was delicious. For the filling we used the recipie as a guide for what we had. Soy sauce, sesame oil, salt, pepper, old bay, onions, and garlic was delicious. The technique used for cooking worked excellent, just make sure bottoms are truly golden brown before adding water to steam. Can't wait to make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LLP"
},
"reviewBody": "I'm a vegetarian so I changed what I out in them. I also made store bought wrappers. Otherwise followed directions for cooking and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson's Mommy"
},
"reviewBody": "Delicious pot stickers! They taste exactly like restaurant pot stickers. My son loves them and asked me to make them again; so off to the store I went to buy more ground pork! I closely followed the recipe; the only thing that I changed is the method of rolling out the dough in order to make the process quicker. I used my pasta maker to thinly roll out sheets of dough and cut 3 1/2-inch circles with a round cookie cutter. With this method, I was able to make 48 pot stickers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Johnny Cool"
},
"reviewBody": "Didn't come out like the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rdsquid"
},
"reviewBody": "Please, use chicken broth instead of water for the steaming process. It will add a layer of flavor and make the finished product a super sticky, stretchy caramelized dumpling! OMG YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rodney"
},
"reviewBody": "Fantastic. We used wonton wrappers instead of making our own dough but they were still really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Smith"
},
"reviewBody": "I was nervous about how these would turn out, even store bought dumplings and pot stickers all seem to fall apart when I make them, but these all turned out perfectly. It seemed to produce more filling than I actually used (maybe I should have put more in?), but that wasn't a big deal. I can always do something with that sort of thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adoring Aedan"
},
"reviewBody": "So yummy. The filling, the dough, and the dipping sauce were perfect. Mine came out looking nothing like a potsticker lol but I know that I will improve my technique over time and they still tasted delicious despite their hilariously terrible appearance. Chef John NEVER disappoints!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greta K"
},
"reviewBody": "Absolutely delicious. Tasted like it was from a restaurant. I saw comments saying to add less ginger so I did 1 and 1/2 tablespoons and it was a perfect amount. I 100% recommend this recipe, especially for a dinner party appetizer. Assembly can be a bit time consuming but it is fun and that's expected when making things from scratch. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SBR"
},
"reviewBody": "Excellent recipe! Super yum! The Binging with Babish of your cabbage, haha\n\nI've made this twice now - once with remade wrappers from the store and the second time with the dough from scratch. I was super intimidated by doing my own wrappers but didn't need to be. It's very easy (and satisfying work!) \n\nI agree with another reviewer the filling needed a bit more salt... maybe more soy sauce? Next time I will cook a little of the filling for taste before assembling the pottystickers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Jennings"
},
"reviewBody": "Chef John nails it with this one, the video is great, very useful and helpful, I was never able to get them to not stick and come apart before knowing these simple tricks. The batch made about 24. The prep took a while, but I will definitely be making this again and I know I will get faster. It took me about 90 minutes start to finish, and they lasted me and my family all of 90 seconds to devour.. so good, even the sauce was spot on!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Perchall"
},
"reviewBody": "My 17 yr old daughter said: \"It was better than restaurant quality\" \n\nI did use WonTon Wrappers from the Grocery, instead of making my own dough. Even using the Premade wrappers, it did take me a little longer to prepare....but so worth it with the final product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim Caldarelli Hrywnak"
},
"reviewBody": "It was ok I would use less ginger next time and use regular green cabbage instead of Napa cabbage. But over all not bad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Hall"
},
"reviewBody": "I bought won ton wrappers from the Asian market because I was being a bit lazy and it worked great, I fried my pot stickers and then popped them into a vegetable streamer in another pot instead of pouring water into the pan. They turned out great I’ll make them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Durando"
},
"reviewBody": "They are very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "Did not use the full amount of green onions. Also added some shredded carrots to make up the difference. Will make sure to chop the cabbage smaller next time. Great flavour but I did add 1 tsp of salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lawgirl"
},
"reviewBody": "Delicious. The filling was yummy and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chickenella"
},
"reviewBody": "Delicious, easy recipe-worth watching the video for a tutorial on how till fill and seal them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLEWIS68"
},
"reviewBody": "I used wonton wrappers to make it easier"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Madi Montalvo"
},
"reviewBody": "Make sure your dough is SUPER thin...Other wise ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "palko16"
},
"reviewBody": "Delicious and fun! Recipe made approximately 23 dumplings. Kind of hard work to put together at first but you get the hang of it. Worth it to watch the “How To” video. Would definitely make these again! We paired them with a peanut butter vinaigrette dressed cabbage slaw. Used peanut butter powder instead of peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kims creations"
},
"reviewBody": "I made this exactly to the recipe. I got nothing more than a ball of raw dough and wasted money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelli R"
},
"reviewBody": "I made these for New Years (pork + cabbage).\n\nThis seems to be a recipe that requires a little bit of practice to master... The filling is easy enough to make, but I found my dough to be too soft and wet after it rested. It's probably a bit like pie dough - practice makes perfect. It needed a lot (and I mean a lot) of flour as I rolled the dough out. It was super sticky stuff.\n\nThe directions could provide a bit more info on the size of \"small scoop\" to use in filling the dumplings. What if you don't have a scoop? What's the target amount? I have a couple of small scoops, so I wasn't sure which one to use. I used my 1 tbs scoop, but ended up with quite a bit of filling left over, so I think I would go with the 1.5 tbs scoop next time. The cooking instructions were spot on. The hardest part was waiting for the pot stickers to cool down enough to actually eat them :-) They do need the sauce, because without it, there doesn't seem to be enough saltiness. They are delicious with the sauce, though. \n\nWhen I make these again, I'm going to use ground chicken in place of the pork. I would also try substituting for the sesame oil -- holy cow that stuff is expensive. I can't believe 1 tsp would impact the flavor that much. I also think I'd add some brown sugar to the dipping sauce. It's salty and sour, and could use just a little sweetness to balance that out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Callie Phythian"
},
"reviewBody": "Easy to make. So tasty. I did replace the cabbage with carrots though. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Cosmo"
},
"reviewBody": "Always can count on Chef John. Awesome as I expected them to be but I thought you might like a little tweak. One, the hardest part is probably making the dough. Much easier and just as tasty if you use won ton wrappers or similar...saves you half the time. Two, if you make the dough yourself, I would put them in the freezer for a bit to set up and then you can drop them right into some boiling water til they float. Then take them out and finish browning in a saute pan. Bon Apetit. Chef Cosmo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Castle"
},
"reviewBody": "These were easy to make and good my family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Me"
},
"reviewBody": "Made these just as the recipe calls. They are definitely worth the time and effort. Absolutely delicious. Oh, I did add one egg to the pork mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Petra"
},
"reviewBody": "They were fun too make and came out very well. Also I think I chopped the vegetables a little too fine. also, needs a little more soy sauce and not as much ginger. There was way too much filling, but i froze it, so the next batch will go faster. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Compton"
},
"reviewBody": "I used ginger powder because didn’t have ginger. I also cooked the pork with all the ingredients (beside the cabbage) already mixed in. Delicious! Make sure you cover them immediately to keep the steam inside the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SarahZ"
},
"reviewBody": "I've made these twice now and my family loves them. Time consuming (took me 2 1/2 hours from start to finish) but any from scratch are going to be. I put just a little less ginger. The sauce I added one small squeeze of sriracha. Everyone kept talking about how good the flavors were together. This recipe is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Ruf"
},
"reviewBody": "I love this recipe! the homemade dough was easier than I thought, just make sure to roll them out very thin. They don't have to be perfectly round. I added 1egg yolks to filling after reading the reviews and the inside texture was perfect! Make sure to squeeze the air out of the pot stickers before cooking! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela Harris"
},
"reviewBody": "way waaaaaaaay too much ginger--you can't taste the garlic, green onion or cabbage, so scale it back to just ONE tablespoon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OTF"
},
"reviewBody": "So... We are also doing KETO, so I was never going to make the wraps--I did meatballs. I used a bag of store bought 16 oz shredded slaw mix and \"drained\" it with salt. I'm mad at myself that I forgot to add the cabbage that I salted. However, the ratio of seasoning of pork to the rest made an amazing meatball. The meatballs of the filling (minus the cabbage) were awesome. I did not find the sesame oil overpowering at all without the cabbage. I ended up adding my salted cabbage to lo mein noodles with a bag of frozen trader Joe's stir fry vegetables. Spaghetti and meatballs Asian style!! Super delicious and all 4 of my kids ate it. Win for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hirowena"
},
"reviewBody": "Excellent! I used pre-made potsticker wrappers. There was so much pork I used 3 packages and still had leftover pork. I used the leftovers in ma po tofu the next night. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SER"
},
"reviewBody": "This recipe is dead on to the pot stickers I love to eat at my favorite Chinese restaurant. And I can make them at home! Chef John's recipe and instructions were perfect and the potstickers came out beautifully. Based on other reviews I went a little light on the sesame oil, but I don't think that was necessary. I will say that I had a good 1/3 of the filling left over and ended up making a 1/2 receipe of the dough to use up the filling. So, in all, I made 36 potstickers--each with a decent amount of filling. I did make a mistake and made them the day ahead and put them on a silpat in the fridge overnight. They got too sticky and if they touched one another, they were hard to separate and the beautiful shape was lost. Not a good idea! First, I would put them on a floured cloth and just put them in a container that doesn't touch the tops (no plastic wrap) or each other. Also, I found that steaming them 3 minutes was a bit too long (maybe be my stove) and I burnt the first batch (though still tasted great!). 2 minutes worked for me. I think I would like to bring these to a potluck in the future, maybe make them a little smaller for an appetizer. Yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nisha Broodie"
},
"reviewBody": "I think this recipe is a bit bland as is. Ive made it several times and finally found a modification I really like. I left out the cabbage, used 1 cup spring onion, 1/4 raw shrimp, and red pepper flakes. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Gracie Scott"
},
"reviewBody": "I made these today and it was the first time I have ever tried to make potstickers. If you dont have a good amount of experience cooking, I greatly encourage you to make sure to watch the video first. I tend to skip these but they do add a little something you may otherwise miss. I overcooked mine a little because of it. The flavor was still awesome but they were a little difficult to chew. I will definitely make this again. Good job chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "This was so easy and delicious! I made using Jimmy Dean \"regular\" sausage but ground pork from the meat department might even be better. I will make it again for sure but, next time I will double the recipe!!! lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amelia Head"
},
"reviewBody": "Me and my fiance doubled this recipe because it doesn't say that it makes like 24 of them. We doubled the dough as well and yet there was a good portion extra filling, even though we filled them pretty full. Good recipe but we accidentally made like 48 because the yield wasn't given and there's too much filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Opie"
},
"reviewBody": "This recipe is AMAZING! I used boneless pork chops about an inch thick and they came out so juicy and tender. The mushroom wine sauce is the greatest mushroom sauce I’ve ever made. Sooo much flavor! Definitely making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "I didn't make the whole thing, but the cooking method is the best I've found yet - absolutely perfect! Didn't make the filling because I already had some, but I will next time - Chef John is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diacetone"
},
"reviewBody": "The filling was phenomenal and the pot stickers really did have that signature juxtaposition of crunchy and soft. Pair it with some hoisin sauce! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vjvali21"
},
"reviewBody": "I used ground turkey bc that’s what I had it this is amazing!! The shapes of mine were all sorts of sizes but I’ll get better each time. It’s lots of fun and the taste is indeed so much better than take out or store bought! Love this!! Thanks Chef John!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "suzanne"
},
"reviewBody": "I would try to make my dough thinner next time. Mostly to cut down on calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hello Sunshine??"
},
"reviewBody": "These are so delicious! They are very easy but time consuming. I imagine that it would be much easier to grate the ginger for those who don’t have the best knife skills, and it would take less time. These make great party snacks or hors d’oeuvres but as good as they taste when fresh, they are not as great when reheated so eat ‘em while they’re hot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bonnie g"
},
"reviewBody": "i followed the recipe and they were very good. will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rose29206"
},
"reviewBody": "Delicious! I made this because it reminded me of the recipe my Chinese friend taught me for Shanghai dumplings. This was not too complicated and totally yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat J"
},
"reviewBody": "Delicious, loved the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "audreyw48"
},
"reviewBody": "Made it with ground chicken instead of pork and it turned out really well! Great recipe that I will definitely make again in the future!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yvonne Zoll Foley"
},
"reviewBody": "Pretty darn good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rudy Bagensie"
},
"reviewBody": "It took a couple of times for me to get it right. The whole boiling thing, it never worked for me. So I read other recipes that said to fry it first and throw in a couple of TBLS of water and that was great. The flavor was really good though and I got rave reviews will make them again just a few changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "londonlinn"
},
"reviewBody": "Absolutely, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryson"
},
"reviewBody": "Amazing and easy had the kids working it with me. loved them. woohoo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "YUMMMMMMY! We make them to eat that night for dinner and then we freeze the remainder to make a modified wanton soup. We use hamburger instead of ground pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan"
},
"reviewBody": "Amazing recipe, I love Chinese food. I have two website for recipes. allrecipes and zedchen.com"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauryn Macdonald"
},
"reviewBody": "A truly delicious recipe! Personally, I would add less sesame oil next time but that's my taste preference. Be patient making your wrappers because it is time consuming if you're a novice like me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Hampton"
},
"reviewBody": "This recipe is the bomb. We like our pot stickers crispy so we deep fried them. For the ginger because three tablespoons is a lot I peeled it and tossed it in my mini food processor. Delish!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimbo"
},
"reviewBody": "Try"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BatmanBob"
},
"reviewBody": "Turned out great (and with the added satisfaction of making at home)! I read the \"very finely minced fresh ginger\" to mean the smallest I could possibly cut it - which took way too long and ended up practically grated. 3 tablespoons of that size was a little too much ginger in the end. (I should've paid closer attention to the video.) I also had a good bit of filling left over, but no big deal. I will definitely make this again. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mernlyn"
},
"reviewBody": "So delicious! I followed the recipe exactly, with one small change --- I cooked the ground pork first, on low heat until it was cooked but not browned. Then I added all the other filling ingredients without cooking any further, and chilled that mixture. I found that a small rolling pin was much easier to maneuver than the pie-sized one. But I imagine a tortilla press or something like that would be very helpful. Thanks, Chef John, for another wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy"
},
"reviewBody": "OMG delicious!!! I followed the recipe all the way, cut ingredients by half since it was just me &amp; my boyfriend. It was a little time consuming but well worth it. Guy in video is correct, the dough is fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Sivavajchaipong"
},
"reviewBody": "Made dough exact to recipe. Dough came out really nice. Only addition I made was one egg to filling mixture after watching a lot of other videos. Filling was very tasty. I used a little less ginger because my boyfriend is sensitive to the ginger flavor. Will definitely make again. It was a fun group activity to fill and pinch dumplings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan"
},
"reviewBody": "Easy to make with the handy dumpling maker we found at the local Asian supermarket. Very tasty but felt the filling needed a little salt and pepper and will make another batch!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/261153/perfect-pot-stickers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/261153/perfect-pot-stickers/",
"name": "Perfect Pot Stickers"
}
}
]
}
}
, "about": [
]
}
]