				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Perfectly Moist Irish Wheaten Bread"
,"datePublished": "2020-06-18T23:32:39.000-04:00"
,"dateModified": "2020-06-18T23:32:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "laracucina"
,"url": "https://www.allrecipes.com/cook/2520492"
}
]
,"description": "This recipe for a dense, Northern Irish-style bread calls for both bread flour and whole wheat flour, as well as buttermilk, sugar, and margarine."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/B_8JWqv6-4KbyTvWSir8TGXQMnA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2034460-5dffec2a23a2403fa3fe30ae9384e5aa.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Perfectly Moist Irish Wheaten Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "63"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "225 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "2 mg"
,"fiberContent": "4 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "555 mg"
,"sugarContent": "4 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup bread flour",
"2.75 cups whole wheat flour",
"1.25 teaspoons salt",
"1.25 teaspoons baking soda",
"2 teaspoons white sugar",
"0.25 cup margarine",
"2 cups buttermilk",
"0.25 cup vegetable oil",
"1 tablespoon buttermilk",
"1 teaspoon white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C). Prepare a shallow baking pan with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Sift together the bread flour, whole wheat flour, salt, baking soda, and 2 teaspoons sugar in a bowl. Cut the margarine into the flour mixture until pieces are nearly indistinguishable. Make a well in the center of the mixture and pour in the oil and buttermilk. Stir with a spatula until dry mixture is completely moistened. Move the dough to a lightly-floured surface. Lightly knead the dough for no more than 1 minute. Place the dough into the prepared pan; pat down and around to form a round loaf. Cut a cross into the top of the loaf with your finger. Brush the top with 1 tablespoon buttermilk; sprinkle 1 teaspoon sugar over the top of the loaf."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 30 minutes. Reduce heat to 375 degrees F (190 degrees C); rotate pan and bake another 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Allow loaf to cool on a wire rack before slicing."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ckolebas"
},
"reviewBody": "Superb recipe. I lived in Ireland for two years and this bread is even better than the package stuff you buy in Ireland. Although I made a couple adjustments. I didn't have buttermilk so I used regular milk and it turned out just fine and I added one egg to stiffen it up, so it's not so crumbly and you could spread butter on it. Other than that it came out perfect. Thank you for this wonderful recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick D Berry"
},
"reviewBody": "Being the first time ever at making soda bread, this is a very good bread. Somewhat sweet, nice nutty flavor. Nice crunchy crust, nice&amp; moist center. Was easy to put together. Perfect recipe for anyones' first go at Soda bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pookers"
},
"reviewBody": "I didn't change the recipe except for exchanging the wheat flour for white bread flour. I ended up with a gloppy mess, and had to add at least another 1/3 cup flour. It was still too sticky and it didn't bake well. It baked up heavy and undercooked on the inside - which could be my fault - but the knife came out clean when I checked the bread and it was a deep brown crust. Oh well..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen S"
},
"reviewBody": "My mother is from Northern Ireland. She didn't get to make her annual trip home this year because of the travel restrictions due to covid 19. This bread took her home! Just slap on some kerrygold butter, pour a cuppa tea, slice up some aged cheddar and enjoy along side a bowl of potato leek soup, yum! I added an egg and skipped the buttermilk and sugar on top, came out great, so easy &amp; delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Despite following the recipe to the letter the dough was more like a batter. I kept adding whole wheat and white flour in equal portions and salt and sugar (to balance flavor) until I could make it into a workable dough. \nI brushed it with some sour cream thinned with water (I had run out of buttermilk by that time) and followed cooking instructions exactly. It turned out great. \nMy BF is from outside of Belfast and said this bread has the exact texture and taste his Auntie Mary used to make. \nIf he says it tastes authentic then I’d definitely say it’s a win!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I'm originally from N Ireland and its one of the best I've tasted. Will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jim f"
},
"reviewBody": "Great echoes and so simpto bake. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Xavier Donegal"
},
"reviewBody": "Made it for a friend from NI - he hasn't tried it yet but it seems fairly dry. *shrug*"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I liked this. At first bite, I wasn't sure what to think. I have never made an Irish bread. It sort of tasted like a beer bread, but then it wasn't quite sweet like one. It was more like a giant buttery and crunchy biscuit. I loved the crunchy outer coating and the inside was nice and soft. Later, I am going to try to cut each 1/4 or wedge into about 5 slices using my bread knife and guide. Unless one has a toaster oven, and could lay the slices flat, I am not sure how this would be toasted though. It might be easier after refrigerating. This is an extremely filling type bread. I will probably attempt it again, but more for something like St. Patrick Day. I found another recipe on here, basically the same, but fits in a 9x5 loaf pan for everyday. I flattened this to the size I wanted it for slicing, before baking. Note, though, it will puff up a little but it will widen to about double the size it went in the oven! Unlike some recipes I did follow this near exact with the good reviews. Only change was subbing salted butter for margarine, kneading directly in the bowl, and baking on parchment. It did take the full hour to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PATTRICIA"
},
"reviewBody": "My first time making Irish Soda Bread. Used my kitchenaid to mix, very east to put together. Not sure if Irish Soda Bread dough is suppose to be a bit on the crumbly side, or if I need to add a bit more buttermilk?\r\n\r\nIt was a bit sweet for my taste buds, but it's an excellent recipe. I will make again and cut back the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "I followed the recipe as it was suggested by BelfastJimmy, including adding one egg, and we think this is the best bread for us....it went perfectly with the Guinness Corned Beef recipe for St. Patrick's Day. A definite keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Booksie B"
},
"reviewBody": "This is a great alternative to soda bread! I made it for St. Paddy's day and changed the following: I used a buttermilk powder and water, brushed the crust with a salt water brine (water with a buch of salt), sprinkled a little red pepper and tarragon on the crust, and melted some butter over the top when it came out of the oven. Served with parsley butter (butter mixedith fresh parsley), corned beef, and a potato kugel. Mmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tarasis"
},
"reviewBody": "Not sure what I did wrong, but I followed the ingredients and ended with a sloppy mess that was nothing like dough. It took another 150g (ish) of flour to get it more dough like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "paki-eire"
},
"reviewBody": "This bread is good but when I sliced it the sides fell off some slices. The only alterations I made was that I used real butter instead of margarine (which is essentially plastic) &amp; olive oil instead of veg. oil. I barely kneeded it because it was so sticky. The top crust was pretty hard. Next time I will use an egg as another suggested in hopes it will hold together better, &amp; I will cut down on the sugar. The sugar made it a bit too much like a sweetbread instead of regular bread. It was also so sticky that it was impossible to cut an X on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Purple Baker"
},
"reviewBody": "Best bread ever! When this came out off the oven, I ignored the part about waiting for it to cool down. The crust is crispy and thick and the inside is moist and delicious. The bread is crubly, and the bottom is very hard, but sooo good! I only used 2 Tbsp of butter, and after reducing the temperature baked for 20 minutes. It came out a perfect, golden brown.\n*Update: I accidentally forgot the 3/4 c. whole wheat flour! I also put in slightly less than 1/4 c. oil, and still only 2 Tbsp. butter. However, the bread was still perfect and moist! I had to put it in a round cake pan because the dough was more like a batter. I did cook it for less time-about 40 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hazelnut"
},
"reviewBody": "This is excellent and easy. Very moist and flavorful. I happened to have made bacon the same day, so I decided to be frugal and use bacon fat in place of the butter and the vegetable oil. I also made butter in my KA and used the buttermilk in the bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ilovebread"
},
"reviewBody": "This was excellent. We really enjoyed it. I was not able to knead it because it was more like a cornbread batter than a dough. I used unsalted butter instead of margerine and baked it in a round cake pan. It rose up nice and high. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Very very happy with the results. It came out perfect just like the submitter said it would. This bread has a wonderful hearty texture and natural nuttyness from the whole wheat. As suggested by another reviewer I used only 2 T. butter and 1/8 c. oil also only 1 tsp. salt and no sugar with outstanding results. It smelled amazing while it baked and tasted delicious after it cooled a bit and the next day toasted. This recipe is a winner! ** Update ** I have made this bread more times than any other recipe on this site. I have added varying combinations of seeds, nuts, and dried fruits (be creative) mix seeds, nuts, and/or dried fruits into the dry ingredients. This recipe is adaptable as long as you stay with the original amounts of flours, b. soda and buttermilk. This recipe deserves more than 5 stars!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "As a Newry native this is close to my mother's recipe but I use half white and half brown. Good recipe but just a little to heavy on the wholewheat for my taste. Thanks - good to see this one in print."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niamh in Boston"
},
"reviewBody": "Just want to add my praise into the mix, I'm from Northern Ireland, and this tastes exactly like the bread my local bakery makes back home. I hate to say this, but this recipe trumps even my mother's ! Shhh.. it's our secret."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BEAR KEEPER"
},
"reviewBody": "Just got back from N. Ireland and wanted to match what I had every day there. This was reasonably close but a little too crumbly. Next time I'll add an egg as a previous reviewer suggested, and I'll increase the sugar by a tsp if not more. I love that this bread is yeast-free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BelfastJimmy"
},
"reviewBody": "Excellent recipe!\nAs a native Belfast man I can recommend this as perfect Wheaten bread.\nTexture and consistency just right!\n \nDidn't quite see the point of brushing with buttermilk or sprinkling with sugar prior to baking but it did no harm anyway.\n \nThere is absolutely no need to bake this within a pan and certainly this is something I have never heard of or come across before!\nI formed the cake round onto a lightly floured Pizza baking stone.\nAgain, cutting the pre-baked bread with a finger is new to me and does not quite give the quartered effect achievable by knife.\nJust make sure to cut no more than 1/3 to 1/2 way through to give the splendid quartering or 'flowering' effect desired on all wheaten or soda breads.\n\nI used Olive Oil in lieu of vegetable and butter instead of margarine.\n\nButtermilk is not usually in one's pantry so you can add a small amount of vinegar or lemon juice to regular milk to substitute for buttermilk. Dry mix can be purchased.\n\nThe mixture stays easily on a pizza stone for baking.\nThis ensures the bread 'free-forms' as it should without using a spray buttered pan.\n\nI have uploaded two photos.\nPhoto #7 shows the consistency of the pre-baked bread and #8 shows the finished product.\nServe with Irish smoked salmon.\n\nUPDATE: 17th Mar 2011\nI deleted some info to include this...\nReviewers have mentioned the bread as being \"too crumbly\".\nToday I added 1 egg to the mixture and found it to be \"tighter\". See Photo #10 for the texture after egg addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CANDYDOVE"
},
"reviewBody": "this bread is really good. i made it this last thanksgiving and it was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "khali1"
},
"reviewBody": "Have made this 4 times and every time it is perfect. A lovely recipe.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "agouvas"
},
"reviewBody": "Being from Northern Ireland but living in the States, this bread turned out perfect, perfect reminder of home! By mistake I left out the oil and the bread turned out just fine....will become a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin'mama08"
},
"reviewBody": "Fastastic, amazing, delicious, etc, etc, etc!!! This recipe is genius!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S_griffin"
},
"reviewBody": "This was a great Bread. I made this tonight for a small gathering of 4 Adults and I only have 5 pieces left. The bread got Rave reviews it was the first thing anyone ate at the gathering. I served the bread with Honey butter and I decided not to brush the additional buttermilk and Sugar on top as I was looking for a Savory Bread. Thank you for the great Recipe this one is a keeper. I will add that my dough was very sticky and moist when I turned it out onto the floured surface and I was not able to kneed the bread, without having my hands covered in the dough. But none the less I tossed it on my stoneware pan and baked and it was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "This recipe is definitely a keeper! Like some reviewers suggested, I only used 2 Tbsp butter and I reduced to oil to 1/8 cup. I brushed the top of the bread with the buttermilk but I did not sprinkle it with sugar. The bread turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Denise Roger Bender"
},
"reviewBody": "Just not something that we would make again. None of the family was really crazy about it. It was fun to try once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Very easy. A bit crumbly, but maybe it's supposed to be. I've never had wheaten bread before. I was trying to find a final recipe to use up the last of my sour milk, and this fit the bill. The dough was quite sticky, almost like a scone batter, but I didn't add any more flour. For all I know that's how it's supposed to be. this was good warm with butter. I served with Sausage Pasta from here and it was a hit. thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill"
},
"reviewBody": "I read the reviews and thought YES! And that was an understatement - wonderful flavor and moist bread. Thank you for creating. Will be one of my regulars. Bill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "caroleinn"
},
"reviewBody": "I found this recipe to be very bland. The crust was flavorful, but the the bread itself had barely any flavor. It might be good to add some cinammon or other spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Norm"
},
"reviewBody": "I made a loaf of this bread and I must say that it is delicious. Whole wheat is a little hard to get used to at first, but I loved this one and will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Rose Hills"
},
"reviewBody": "This was great! I followed the recipe as written and baked it in a loaf pan (I like being able to cut off slices and pop them in the toaster)! :) It was very easy to make, and the texture is wonderful. So dense but still very moist, and the crust is fantastic. As soon as this had mostly cooled I cut a piece put some Smart Balance on it and a couple slices of extra sharp cheddar and I was a happy camper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindym"
},
"reviewBody": "My husband is also from Northern Ireland and your wheaten bread recipe wins his approval and mine! The bread looked so gorgeous when it came out of the oven, it was a shame to cut into it! And to all who have never tried wheaten bread, this recipe gives the authentic taste and texture! Please try it toasted as well to bring out the nutty flavor of the wheat! On my first trip to Belfast to meet the in-laws, I was given the family's recipe for wheaten bread and the bowl that the flour was measured in. I haven't made wheaten bread in some time and thought I'd give your recipe (which is different from mine) a try. It is Wonderful! One tip: whenever I have to cut in butter or margarine into flour, I grate the margarine/butter over the flour. The smaller pieces are easier to cut in and it takes less time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "My family loved this bread! I wish I would have had a better pan to cook it in though. It burned a bit on the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elenchen"
},
"reviewBody": "It's good, but a bit too salty. I would reduce the dose of salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynette Sullivan"
},
"reviewBody": "Holy Cow! I had to make 4 more batches to put in the freezer for later! My family RAVED over this bread! I havent found a whole wheat bread they liked till now! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daidai"
},
"reviewBody": "I was looking for a quick bread that did not use baking powder, as I did not have any, and used only a little of baking soda, since the taste is so overpowering. This bread was perfect for even making drop biscuits! I subbed milk for buttermilk without any problems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tressa"
},
"reviewBody": "This was so good, and very \"authentic\" Irish! I will make this frequently--it's so quick and easy. I did as another reviewer, and mixed it in my Kitchen Aid mixer with the bread hook attachment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Terri Wolford Wearstler"
},
"reviewBody": "Hearty, but pretty crumbly. Very easy to make, but probably would not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINDYLU2"
},
"reviewBody": "The bread is gone in a very short time, with my family of 5! I used white whole wheat flour and powdered buttermilk. I also substituted butter for margarine. I think that if it were baked on the paper, it might not have burned on the bottom. It was very moist and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "I was excited to try this recipe to go along with the Irish Beef stew. It was very easy to make and the flavor is incredible. If you aren't a breadmaker (like me) but want to try your hand, pick this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doitnow"
},
"reviewBody": "I had never eaten or tried making bread like this before so I made this exactly as written and boy am I glad that I did. It was wonderful. I did use fat free buttermilk. It is a little sticky when you do the kneeding so I guess that's why you don't do too much of that? Just had to add a little flour to my hands and sprinkle on it when kneeding. Thank you for such a great and healthy recipe. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Rives McAdoo"
},
"reviewBody": "Unlike my usual M.O. I followed the recipe and it was delightfully easy and yummy. Went great with our corned beef supper. I think it would be fun to experiment with it next time by adding some savory additions or dried fruit, 'though it holds up very well as is. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STEPHANIEBERGEN"
},
"reviewBody": "I had some left over buttermilk from a different recipe I wanted to use up and decided to try this recipe. It is fantastic!! I added 1 1/4 cup of raisins as well baked it in a loaf pan rather than a round pan and it turned out excellent!! I have made a few trips to the store specially to by buttermilk now for this recipe...it has not failed me yet!! It is a must try!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "healthymom"
},
"reviewBody": "This is a very tasty bread and simple to make. Like one of the other reviewers, I used my Kitchenaid stand up mixer (my Christmas present this year!) and it only took about 10 minutes, plus kneeding time. I rated 4 stars only because it was SO dense, that I can barely finish a whole slice at once. I do like the wheaty flavor and the slight sweetness of the crust. My husband however, who is the real bread lover in the house, only thought it was so so. (He's also a picky eater)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marchmont daisy"
},
"reviewBody": "tried this recipe for the first time yesterday and it worked out perfectly! so quick and easy, and got just the bread i was hoping for. only one comment - i needed to add a little more flour than the recipe gave, as the dough was initially a bit on the sticky side, but that might have been my scales. will definitely bake this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Yummy! Not dry like soda bread so often is! Best on the same day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melinda Osborne"
},
"reviewBody": "Easy and quick recipe, tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi S"
},
"reviewBody": "Very good, moist bread. Its like a giant whole wheat biscuit or whole wheat irish soda bread. I really liked the effect of the buttermilk brushed on the crust before baking and the sugar sprinkles. It makes almost a glaze on it and adds just a touch of sweetness, but not too much. Great bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ita"
},
"reviewBody": "A very easy recipe. It's only fault was that maybe it was a little too crumbly - making it difficult to butter. Still, very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne"
},
"reviewBody": "This is exactly the bread I loved while visiting Ireland. Our group of four lived on cheese and brown bread from Jack's in Killorglin, County Kerry and were disappointed not to be able to bring extra home. Now I can make it myself -- despite the fact that I have always been a total failure at bread baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "I didn't know what this was before making it. I was pleasantly surprised with the result! It is moist, dense, with a very wheat-y taste. Such a great alternative to cornbread! The dough was easy to work with. We had it with Michelle's Blonde Chicken Chili (from this site) and it was a great dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Taylor"
},
"reviewBody": "This bread was very easy (and fast) to make and the result is excellent! I baked the bread on a cookie sheet and had no trouble with the dough keeping it's shape. The bread is very moist, but not doughy or too dense. The sprinkling of sugar on top gives it a nice hint of sweetness. This bread is great with jam! I will definitely make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "txvtchick"
},
"reviewBody": "I was very happy with how this recipe turned out and will definitely make it again. \n\nI had never heard of wheaten and was a bit concerned by the lack of yeast or rising time in the recipe. I did an internet search and found out that in wheaten (aka brown Irish soda bread), the buttermilk and baking soda cause the bread to rise during baking. \n\nThe bread doubled in size during baking and had the consistency of cornbread; in fact, we had it with chili and it was excellent. It would be great with any meal that you'd typically have bread as an accompaniment.\n\nThe dough was sticky and did not lend itself well to being free formed on a flat pan. I used the bottom of a ceramic tortilla warmer as a pan. A round cake pan would probably work well, too.\n\nI used 2 TB butter instead of 1/4 cup margarine, reduced the oil to 1/8th of a cup, and used low fat buttermilk. The bread was still very moist and did not feel or taste \"low-fat\". I also did not sprinkle sugar on top before baking as I wanted a more savory bread."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/150426/perfectly-moist-irish-wheaten-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1452/bread/quick-bread/irish-soda-bread/",
"name": "Irish Soda Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/150426/perfectly-moist-irish-wheaten-bread/",
"name": "Perfectly Moist Irish Wheaten Bread"
}
}
]
}
}
, "about": [
]
}
]