				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pineapple Upside-Down Cake"
,"datePublished": "1999-03-15T14:49:38.000-05:00"
,"dateModified": "2023-03-22T14:46:49.132-04:00"
,"author": [
{"@type": "Person"
,"name": "Anne"
,"url": "https://www.allrecipes.com/cook/24321112"
}
]
,"description": "This classic pineapple upside-down cake with a caramelized topping and cherry-studded pineapples is easy to make in a cast iron skillet. A perfect dessert!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8nA_q_aGt00p7PkvA4PHNrzwVBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17691-pineapple-upside-down-cake-vii-humblepieliving-003-4x3-1-5a70e5ae4ad44171a6570e4dda9821cc.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6309677298112",
"description": "The beauty of a pineapple upside-down cake is how its base becomes a delicious caramelized topping once it’s done and flipped. In this easy recipe, that base is made with melted butter, brown sugar, and cherry-studded pineapple rings.",
"duration": "PT4M10S",
"name": "How to Make Pineapple Upside-Down Cake",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2023/01/04/17691-pineapple-upside-down-cake-vii-humblepieliving-003-4x3-1.jpg",
"uploadDate": "2022-07-28T12:03:19.822-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pineapple Upside-Down Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "997"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "414 kcal"
,"carbohydrateContent": "55 g"
,"cholesterolContent": "20 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "267 mg"
,"fatContent": "21 g"
,"servingSize": "1 10- or 11-inch cake"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dessert","Cake"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"1 (20 ounce) can pineapple rings",
"0.25 cup water, or as needed",
"0.5 cup unsalted butter",
"1 (16.25 ounce) package white cake mix (such as Betty Crocker Super Moist)",
"0.5 cup vegetable oil",
"3 large egg whites",
"1.5 cups brown sugar",
"7 maraschino cherries" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Drain canned pineapple into a 1-cup measure. Add water if needed to measure 1 cup. Set aside juice and 7 pineapple rings for the cake. Set any remaining juice and rings aside for another use."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a 10- or 11-inch cast iron skillet over medium-high heat."
} ,{
"@type": "HowToStep"
,"text": "While the butter is melting, combine cake mix, reserved 1 cup pineapple juice, vegetable oil, and egg whites in a mixing bowl. Beat with an electric mixer on medium speed for 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove melted butter from the heat and sprinkle brown sugar evenly over top until all butter is covered. Arrange 6 pineapple rings around the outer edge of the skillet and the remaining ring in the center without overlapping. Place a maraschino cherry into the center of each pineapple ring. Pour cake batter over the pineapples."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the cake comes out clean, 25 to 28 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven and let cool in the skillet for 10 minutes; don&#39;t let the cake cool too much or it will stick to the pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8nA_q_aGt00p7PkvA4PHNrzwVBc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17691-pineapple-upside-down-cake-vii-humblepieliving-003-4x3-1-5a70e5ae4ad44171a6570e4dda9821cc.jpg"
}
]
,"text": "Run an offset spatula around the edges to gently loosen cake. Place a plate over the skillet, then flip and carefully turn the warm cake out onto a plate. Transfer any fruit or glaze that sticks in the skillet back to the cake."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Size"
},
"reviewBody": "Used 10\" cast iron, left a little bit of batter in the bowl to prevent potential over flow, which I had no issues with. My kids loved it, it looked good although was slightly crumbly. Would definitely make again because the kids liked it, it tasted yummy and was pretty easy not to mentioned looks impressive for the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a \"premium\" yellow cake mix and only had dark brown sugar. The cast iron created a wonderfully caramelized crust. It's so easy. It's so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamelarae"
},
"reviewBody": "Love ❤️ this recipe! It was amazingly delicious 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marylu Fernandez"
},
"reviewBody": "First time to bake a Pineapple Upside down cake using a store bought cake mix &amp; following the Instructions from here. Since I can’t find a round sliced pineapple, I used tidbits &amp; arranged into a circle plus used raspberries instead of cherries which was also unavailable in the groceries. The result was beautiful and delicious birthday cake as shown in my photo. Thanks for the recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Huang"
},
"reviewBody": "Recipe was good. Used a 12 inch skillet. I had to bake it for 37 minutes. Otherwise just like the recipe said!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Okimoto"
},
"reviewBody": "I made this 2 times in 3 days. Followed the recipe found out all 10 inch skillets are NOT alike. First hint first batch pineapple rings did not fit. Second batch I rolled them up the edges to make room aesthetics great. First batch used yellow cake mix. Second white. Second batch really fluffed up looked like a souffle. Second batch only 1 cup brown sugar. Second batch added some almond and banana extract for aroma and a hand full of shredded coconut to the cake mix. OMG original was awesome, second little touches explosion to the senses. 5 star to original traditional recipe, and right behind it the little tweeks . BTW first time I ever bought/used a cast iron skillet to cook/bake with ever. Anything I can do, you can do TOOOO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sunday baking, it was yummy! No clue what happened to the middle cherry…lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janehongo"
},
"reviewBody": "I happened to have a yellow cake mix and made everything else according to the recipe. I loved my mother's recipe, but this was even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "humblepieliving "
},
"reviewBody": "This cake was extremely easy to make and our family loved It! I will say that even in using the pineapple juice in the cake batter, I still could have done with some more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it by recipe turned out excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DoreenRose"
},
"reviewBody": "I love the recipe and my cake turned out awesome! (But)My cake was very undone after 28 minutes. I baked for approximately 35 -37minutes for it to be completely done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this recipe for over 50 years. Perfect the way written with a 12\" cast iron skillet or a 9\"X13\" baking dish. I have had no problems with variations. Subbing other fruits like peaches or apples works out well with this recipe. Using the Splenda brown sugar blend with no sugar added fruit makes it a little lighter on the calories and tastes good. An important part is getting it out of the pan when warm but not hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T. L. Collins"
},
"reviewBody": "I have never made an upside down cake before. I loved the crunch from the brown sugar being cooked in the cast iron skillet. I have made this 2 more times, and loved it every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Streifel"
},
"reviewBody": "Easy and delicious! I served it with vanilla ice cream, and even the cast-iron skillet cleaned up easily with a little soap and water. It was as good as I remember, and I’ll make it again, soon! I used a ten-inch Dutch oven, so lots of room in my well-seasoned cast-iron pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr. Grandma Jeannie"
},
"reviewBody": "Made 24 cupcakes and a cake from a 2nd batch. Delicious! My husband wanted 8 cupcakes \"now\", and a whole batch made \"just for him\" later! My skinny daughter ate at least 3 servings! Marinated pineapple in 1/4 c spiced rum for about 2 hours. Drained the rum, added pineapple juice to make 1 cup, and used in place of water in batter. Used half dark and half light brown sugar. Used FOIL liners for cupcakes, but lined 10-12\" cast iron pan with parchment paper on bottom and then sprayed it all. Both worked perfectly. Added 1 tsp. cinnamon and dash of nutmeg to brown sugar. Used 1 heaping TBS each of butter and brown sugar to each cupcake liner. Added 1 tsp. each vanilla and coconut extract to Pineapple cake batter. Baked cupcakes about 5 minutes longer; cooked cake about 10 min. longer. Cut off tops of muffins with serrated knife to make flat bottoms. Cooled 5 min. The addition of pecans in the extra spaces would have enhanced the appearance, but it was beautiful anyway. I made my first PU cake around 1963, but this is the BEST recipe (with mods). Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Omg this was a huge hit and so easy!! I used a 10 skillet and it poured over and i had to cook it for almost 50 mins. I sprinkled cinnamon over the pineapples then topped it with coconut. It was fluffy, moist and my BF loved it! My kids were in love with it too! will make this again soon!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Tompkins Truitt"
},
"reviewBody": "I made mine following the recipe exactly but with a yellow cake mix and pineapple juice. We only have a 9 inch skillet so I made a second one in a cake pan. The cast iron is the way to go! It turned out much nicer looking than the cake pan. Now I need to buy a larger skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Adams"
},
"reviewBody": "It turned out to be awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "OKC_MWC"
},
"reviewBody": "Too soggy, too sweet. I did use a few of the suggestions in the reviews, such as draining the pineapple on paper towel, but should have reduced the sugar as some suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bjb5856"
},
"reviewBody": "I made this for a birthday party in a new cast iron skillet. It turned over perfectly! I used pineapple juice for all the water in the cake recipe and used a yellow cake mix. Family went crazy it was so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody Nobert"
},
"reviewBody": "Love this recipe. It is simple and comes out beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer H."
},
"reviewBody": "I have made this cake for years. It’s my husbands favorite. Everyone in my family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra Bourne"
},
"reviewBody": "The recipe is very easy to make and quite good. I substituted canned pineapple for a fresh pineapple, and since there was no pineapple juice, I just used water. One box of cake mix is WAY TOO MUCH for a 9-10 inxh iron skillet, so I ended up splitting part of the cake mix and making a small vanilla one layer cake. My family loved the cake and ate it right away!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "msj22553"
},
"reviewBody": "Think I could have used some more time in the oven with using the cast iron to get a better outside edge crisp.. I followed instructions to the letter and mine was just beginning to crisp outside edge when center was done. Didn't want to leave it in longer and dry the cake out. All in all, good easy fun recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karaboo"
},
"reviewBody": "So disappointed with this recipe. First off way too much brown sugar. Second, I allowed it to cool for 6 minutes rather than ten (if I had waited it would have been worse). The pineapples stuck, even in a nonstick oven safe pan! My opinion way too much cake for the pan, excessive amount of butter and sugar.. I will be going back to the traditional way of baking these. This was a disaster. If you enjoy wet soggy cake that is saturated in fat this is your recipe. No thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Whitaker"
},
"reviewBody": "This is the best cake I’ve ever made! Cooking it in the skillet made it so crispy on the edges. So good and pretty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dania Marie"
},
"reviewBody": "Very cakey but delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Davis Greeley"
},
"reviewBody": "I made this for my husband's birthday. It was his favorite since he was a child and his mother made it for him. It is so delicious. I did exactly as the instructions said and only cooled it for 10 minutes. It came right out of the iron skillet in one piece. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Ray"
},
"reviewBody": "Campfire Magic! I made this PUD Cake with a reflector oven and a campfire and it was great! Everyone Ooh’d and Ahh’d at the big reveal when I flipped the pan over. It was so much fun!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleenw"
},
"reviewBody": "This cake is delicious, but I had to bake it for an hour. After 28 minures as per the box directions it was very jiggly and unset. I added 15 minutes and it still wasn’t set. An additional 15 minutes did the trick. I did not use a cast iron pan, that could be why it took longer. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg"
},
"reviewBody": "This was excellent. I used 1/2 water and 1/2 pineapple juice. Very moist and fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thom KinLA"
},
"reviewBody": "I didn't have an 11 inch skillet, so I used to 9 inch round cake pans. I did 2/3 cup of butter in each and 1 cup of brown sugar in each. Split a can of pinapple rings between the two as well as one box of cake batter. Came out perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweeti123179"
},
"reviewBody": "My 1st attempt at a pineapple upside down cake and it was a success. Delicious and I will definitely make it again. I also used a 9x13 glass baker as I do not have a cast iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MomMomG"
},
"reviewBody": "This is the first time making this in my cast iron skillet. So easy and so pretty when it's finished. This will be my go to receipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tory Knox"
},
"reviewBody": "This cake was super good and moist. I would just recommend using less brown sugar. It throws off the pineapples and cherries and makes them way too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "baking07"
},
"reviewBody": "The amount of batter in one box of cake is way more than enough! The edges were browned while the middle was completely wet and the entire top was raised at least a half inch over the top of the pan. we had to scoop out much of the batter partway through baking to save the cake. The cake was delicious though, i recommend using pineapple juice from you can to substitute for water/milk in your box recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonja Jackson"
},
"reviewBody": "Cna out amazing I used bundt pan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luvgod"
},
"reviewBody": "Very moist cake. I made it in an oblong pan and it came out wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Willey"
},
"reviewBody": "I must say this is a really good recipe!! It turned out really well. (There’s no cherry’s because the family doesn’t like Maraschino’s"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johni O'Dell"
},
"reviewBody": "I used sugar-free yellow cake mix. And substituted 1/2 of the brown sugar with golden monk fruit and a little sugar-free maple syrup. My pic won't upload, but it looks beautiful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TerryLMaxwell"
},
"reviewBody": "Love this recipe! Don't have an iron skillet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Davis Perrine"
},
"reviewBody": "No changes to recipe went step step the whole way. It’s awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Magilacutty"
},
"reviewBody": "You haven't lived until you've made this in a Dutch oven while camping. The look on the other campers faces is just priceless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CathyS"
},
"reviewBody": "I really loved this recipe! Sweet, tangy and reminded me of my mom’s favorite dessert. Love that it’s made in an iron skillet!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanna"
},
"reviewBody": "I used crushed pineapple and omit the cherries per husband’s preference. Otherwise I followed directions exactly. It is my go to pineapple upside down cake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovejbo"
},
"reviewBody": "This was great! Maybe could have used less sugar on top but it was a loved by all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn"
},
"reviewBody": "Haven't tasted it yet but only change I made was to use all Pineapple Juice instead of water. I made it in a 10 inch cast iron pan and no problem with running over except for a bit of sauce but I had put it on a cookie sheet so no mess to clean up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prana"
},
"reviewBody": "I tried my best to mess it up, but it still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Brown"
},
"reviewBody": "It was surprisingly easy but be very careful on how much brown sugar you use mine came out a little too sweet because I used too much sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Albonetti Sanderson"
},
"reviewBody": "Followed recipe to the T. Came out wonderful other than my iron skillet was too heavy for me to turn over quickly enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Clark Ferguson"
},
"reviewBody": "I used crushed pineapple and it baked about 50 minutes. It was so good! \n\nBtw..I only used 3/4 of the batter. I have a 9 inch iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marshall"
},
"reviewBody": "I used a 10 1/2” cast iron skillet, there was a little over flow while cooking but not bad. The cake turned out very well, and was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shani"
},
"reviewBody": "This turned out really nicely. Instead of doing 11/2 cups sugar, I did 1 cup sugar. Glad I did for it was just right in terms of sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Burgess Bessey"
},
"reviewBody": "Note to self: Not having a skillet nor round cake pans, I made this in a spring form pan. Like another suggested, I added cinnamon to the sugar, soaked the pineapples in rum, but it really needed to bake much longer than the cake box suggested. The middle was raw. I'll give this another go but use a larger pan. All that goo on top was a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Followed reviewer’s suggestion to use Duncan Hines Supreme pineapple cake. Excellent. Family loved the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen Adams"
},
"reviewBody": "Making it AGAIN for father-in-law's birthday. This is a great cake. Simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaRee Benedict"
},
"reviewBody": "Love the recipe easy and very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lelo"
},
"reviewBody": "Beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Love this recipe. Loved it more when I made it with fresh pineapple and substituted half the water for some of the pineapple blended in the blender with the 1/2 cup of remaining water. Takes this recipe to a whole new level. Also, I used frozen black cherries. All around it was a much richer and fresher tasting this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig c"
},
"reviewBody": "I don't know how this only has 4 1/2 stars. 5+ stars in my book. I don't give many reviews, but this one was worth taking the time to do one. I just added a small amount of cinnamon on top of the layer of pineapple. I used all the juice from the can and it left less then a quarter cup water needed. it took a little longer to cook. I used all the batter in an 11 inch skillet. so moist so delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachels694"
},
"reviewBody": "This was a delicious and very simple quick pineapple upside down cake. I added some coconut flakes with the pineapple slices and cherries and I thought it was a nice add. I will use this recipe over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tweetay Walker"
},
"reviewBody": "I used pineapple juice instead of water.. I also used pineapple supreme cake mix instead of yellow.. added crushed pineapples in my batter. Baked in my cast iron skillet for 55 mins at 350 degrees. Came out perfect!!! Cake didn’t last but one hour in my home.. will definitely make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle jones"
},
"reviewBody": "Found that I had way too much batter...used a 9 inch glass dish...next time will use a springform pan..medium...other than that this cake was awesome..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heybejay"
},
"reviewBody": "Very easy and very delicious! I have made this cake several times using a regular nonstick skillet to bake it in. This last time I decided to try baking it in my iron skillet. Wow! What a difference! While it came out fine in my other skillet, it was awesome baked in the iron skillet. The top and sides came out with a golden brown crunchiness making"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Kitchen Alchemist"
},
"reviewBody": "I found this quick, easy, and delicious! I've made it with yellow cake as well, which I like better in this application. I spare no pineapple or cherries, and I think nuts, in this case pecans, make a great contrast, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomalisa Yazzie"
},
"reviewBody": "This came out perfect. It was my first time baking this cake. Always love the cast iron for everything!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Echtinaw"
},
"reviewBody": "Easy AND Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cierra Landry"
},
"reviewBody": "This is my dad's absolute favorite dessert! I've made it twice now, and he loves it! Both times I substituted pineapple juice for water in the cake mix, and also I mixed the butter and brown sugar layer together to be sure it wouldn't come out crystallized when flipped over. After baking for about 45 mins, it comes out perfect! Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MYPRETTYPEONIES"
},
"reviewBody": "Yummy. I used a store brand box yellow cake mix instead of white, because that's what I prefer. I also skipped the cherries because...yuck! I baked it in cast iron pans &amp; it made a 9-inch plus a 4-inch pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rendyl71"
},
"reviewBody": "one of my favorite cakes ever. my mom would make this when i was growing up and this tastes just liek it. my coworkers always request i bring this in too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasmine_0206"
},
"reviewBody": "Did the suggestion of half pineapple juice and it made all the difference. I used about a 9 in cast iron skillet and it fit perfectly with a 15.3 oz cake mix. Thank you so much for the recipe. It was really delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray"
},
"reviewBody": "Let’s try this again. My last review was ruined when the app shut down and I don’t know how to edit it. This is the easiest and most delicious pineapple-upside down cake I’ve ever made! A couple minor adjustments: I used the pineapple juice in place of the water on the cake recipe (I added just enough water to get the measurement right) and I added 1 1/2 tsp of almond extract just because I love it. Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Wilker Rockamann"
},
"reviewBody": "Delicious, but needed to be baked much longer than \"as directed by the cake mix\". I had to double the time, put foil over it to prevent over browning. the extra time was well worth it!!! Very simple and a great treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SemperFi"
},
"reviewBody": "This cake was a big hit. I filled in empty spaces with cut up pineapple and used jumbo cherries. Making again today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Da'tiger"
},
"reviewBody": "This was amazing. Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Henderson Crider"
},
"reviewBody": "Look no further! Best pineapple upside cake recipe out there and I’ve tried a ton!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Mates"
},
"reviewBody": "I made this in a 9” square deep dish baker. Used 1 cup of brown sugar and baked for 55 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AuntE"
},
"reviewBody": "Great easy recipe. Made as is. Perfect for a family of 5 for 2 nights of dessert. Make sure to not overfill your cast iron pan or it will spill over sides. It really did flip and slide right out of pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kacey2767"
},
"reviewBody": "Yummy, yummy, yummy! It was super moist. And so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shyla Wetmore"
},
"reviewBody": "It’s awesome, I’ve been making it for about six years. I just made one for my Dad’s birthday party this afternoon and thought I would share. I use the White Texas Sheet Cake recipe, substitute the water for pineapple juice, cut a little sugar from the recipe, and use vanilla instead of almond extract so it pairs better with pineapple. All in all I’ve always had rave reviews even when I used the cake mix and pineapple juice in the past. It’s always a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andy"
},
"reviewBody": "Turned out nicely for a cake that uses a cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LL Cool Muffin"
},
"reviewBody": "Use pineapple juice instead of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "I make this cake in my cast iron skillet no less than one time per year. This is my daughters Birthday Cake request every year. \nIt is a beautiful and delicious cake. I make no changes to the recipe at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim A. LaBelle"
},
"reviewBody": "I used a silicone muffin pan. The recipe made 12 plus a small loaf cake with the left over batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Holt"
},
"reviewBody": "Made this in my 13 inch cast iron pan. And added the pineapple juice for some of the water. It was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "poonam"
},
"reviewBody": "The cake turned out awesome!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Williams"
},
"reviewBody": "I’ve made this several times but always in a cast iron skillet . That makes it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "Best pineapple upside down cake recipe I ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Kehm Lockey"
},
"reviewBody": "Very tasty. Took about 45 minutes to bake in 8x8” pans. Used pineapple tidbits so make pineapple taste in each bite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Holiman Carter"
},
"reviewBody": "This was so simple and delicious! I made it in an iron skillet and it turned out beautifully. I used all of the pineapple juice and just enough water added to cover the liquid called for on the cake mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Very good and moist. I used a pineapple cake mix and used the pineapple juice from the tidbits only having to add a little bit of water to make one cup. I only used 1 cup of brown sugar and did not miss the other 1/2 cup. The black iron pan was very full but did not overflow. It did take almost twice as long to bake in the oven. It was worth the wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave Wescott"
},
"reviewBody": "i USED VEGETABLE OIL INSTEAD OF BUTTER"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Wilson"
},
"reviewBody": "Great recipe. Used Jiffy yellow cake mix and juice from canned crushed pineapple. After reading reviews. I sprayed with Baker’s Joy 6 foil lined muffin cups and a small cast iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tom"
},
"reviewBody": "Made it for bingo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Mitchell"
},
"reviewBody": "This was really easy to make and delicious. I skipped the cherries just because I don't like them. For the liquid, I took the advice of others and added rum to the pineapple juice and the water. I used an 11\" cast iron pan and it did not run over and practically fell out of the pan when I turned it over. Note: this is a very heavy pan and cake. A little help when flipping is a good idea! Thanks for the recipe! I'll make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Zippay"
},
"reviewBody": "Easy and turned out great!\nI love using frying pans. Reminds me of the way that my grandmother cooked in the wood stove. I must be giving a clue to my age."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Rella"
},
"reviewBody": "Excellent recipe, as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Burns Springer"
},
"reviewBody": "had to use chunks as I had no rings"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Lyons"
},
"reviewBody": "I followed the receipt closely but like previous reviews I used the drained pineapple juice as a replacement for the water the cake mix called for. I also added three spoonfuls of crushed pineapple (since I bought a can by mistake) to the cake batter. The crushed pineapple made it longer for the cake to finish baking but was delicious when eaten."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17691/pineapple-upside-down-cake-vii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/11980/desserts/cakes/upside-down-cake/",
"name": "Upside-Down Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16209/desserts/cakes/upside-down-cake/pineapple-upside-down-cake/",
"name": "Pineapple Upside-Down Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17691/pineapple-upside-down-cake-vii/",
"name": "Pineapple Upside-Down Cake"
}
}
]
}
}
, "about": [
]
}
]