				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pineapple Upside-Down Cake III"
,"datePublished": "1999-10-17T09:52:28.000-04:00"
,"dateModified": "2020-06-18T22:53:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BUCHKO"
,"url": "https://www.allrecipes.com/cook/55841"
}
]
,"description": "This recipe for pineapple upside-down cake delivers a classic version of a favorite dessert in a 9x13-inch size."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/S_UAVFFUf55BX0MxPJBwRkX7flo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6251131-8ed25994f7144023b3335104996caed5.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pineapple Upside-Down Cake III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "130"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "251 kcal"
,"carbohydrateContent": "37 g"
,"cholesterolContent": "21 mg"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "124 mg"
,"sugarContent": "24 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 (15 ounce) can crushed pineapple",
"0.25 cup butter, melted",
"1 cup packed brown sugar",
"3 cups all-purpose flour",
"5 teaspoons baking powder",
"1 cup shortening",
"1.5 cups white sugar",
"2 eggs",
"1 tablespoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Grease a 9x13 inch pan and preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Drain crushed pineapple and reserve juice. Combine margarine, brown sugar, pineapple and 2 tablespoons pineapple juice. Spread onto the bottom of a 9x13 inch pan. Add enough water to remaining juice to make 1 1/3 cup of liquid. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine flour and baking powder. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Cream shortening and white sugar until light and fluffy. Add eggs and vanilla, and beat for 1 minute. Add flour mixture alternately with juice, beginning and ending with the dry ingredients."
} ,{
"@type": "HowToStep"
,"text": "Pour over pineapple mixture in pan. Bake at 350 degrees F (175 degrees C) for 40 minutes or until toothpick inserted in center comes out clean. Cool in pan 5 minutes and then turn out."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "lotsofteekos"
},
"reviewBody": "Way too much baking powder. Followed the recipe to the letter. Cake was crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Stugart Sullivan"
},
"reviewBody": "Although I've always used pineapple flavor box mixes, I tried this one on father's day, since I didn't have a box mix in the cupboard. First off I didn't read all the way through before I started measuring and mixing ingredients. So I had to make shift my way through. I put all the dry ingredients together before I realized I was supposed to cream the sugar and shortening. So I just used 1/3 cup of oil instead. I made 2 round cakes, instead of 13 x 9, going to two different homes. Both my dad and my step dad loved this old fashion style cake. Reminded them of what their moms used to make....win win!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonora Thigpen"
},
"reviewBody": "Cake was kinda bland. I should have read reviews and used butter instead of shortening and more vanilla for richer taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Pineapple Upside-Down Cake iii by Buchko. \n Subbed sliced peaches &amp; 2/3c peach syrup w 2/3c milk for juice &amp; water. Also added 1t salt to balance the sugar, which I reduced to 1c in the cake part. This one is better than GH Illustrated Cookbook one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tommie Penix"
},
"reviewBody": "Taste like lard and flour. Yuck! Besides I messed up half my dishes making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this and it turned out amazing! I used Food Stirs white vanilla cake and it was to-die for. The o my thing it doesn’t mention in the recipe is to put the melted butter/brown sugar glaze at the bottom of the cake pan you plan to bake it in but I figured that out then added the pineapples, cherries and cake batter as directed and viola!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sheila Schnee"
},
"reviewBody": "I am not a fan of this recipe. The cake reminded me of, and tasted like, one big pancake. It did not bake up right for me, and took several minutes longer to finish than the recipe stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "catheesue"
},
"reviewBody": "although the directions said a 13 x 9 pan, the picture shown is of a bundt pan, which i wanted to make because i liked the way it looked versus a rectangle. it took alot longer to bake, almost 20 mins, and it's too much batter. so if anyone wants to use the bundt pan, just make a small round pan in addition. otherwise, DELICIOUS!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dionne Nace"
},
"reviewBody": "I didn't really care for it...my husband and daughter liked it though. They said it wasn't their favorite, but it was okay. Made exactly according to original directions. It has potential, but I would look and see if anyone offers small changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "faaiza"
},
"reviewBody": "Tasted good, quite moist BUT fell apart and didn’t look pretty :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Mucha"
},
"reviewBody": "This turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Travis Harmon"
},
"reviewBody": "Very straight forward. The pineapple topping was too much for the pan I wanted to use so I used the extra in place of the water that was to be added to the drained “juice” to make 1 1/3 cups. I also don’t use shortening so I replaced that with nearly equal parts coconut oil and left over mashed potatoes (from scratch). I also added half of a vanilla bean and 1/2 tsp cardamom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshy159Mi"
},
"reviewBody": "I always make it from scratch. No matter what recipe I use, I double the brown sugar and butter and cook until smooth, caramelized. I use sliced pineapple, maraschino in the middle of the slices and put the crushed pineapple around filling all the open spaces so everyone will get pineapple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "John Martin"
},
"reviewBody": "I made it an I wasn't nt really impressed with it, I couldn't flip the cake because the crushed pineapples were to moist after cooking and stuck to my glass pan. If I make it again I'll use while pineapples and increase the sugar a little both sugars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Marquez Szany"
},
"reviewBody": "Really good cake. Definitely keeping this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "piebaker"
},
"reviewBody": "I substiputed butter for the shortening, 3/4 c of honey for the sugar, and gluten free flour for the regular flour. I loved the texture and the honey gave it a mild sweetness without being overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I made this recipe twice. The first time I made it I did just as the recipe called for and like the other reviews I did find it to be not a very flavorful cake and although plenty moist it almost tasted like it was going to be dry. So I doubled the vanilla and I also beat the shortening in the eggs together first to get some air into them which is what I do on a carrot cake recipe I have and it actually makes the cake be a little less heavy and more airy. I also doubled the topping that someone had written. I used one can of crushed pineapple and one can of the pineapple tidbits and it came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charla"
},
"reviewBody": "This Upside down cake is to die for. It is so good! It is not to sweet with the right balance of fruit and sugars. It seemed to me to be a lot of sugars and butters. But to my surprise it was perfect. Definitely reminded me of when I was a little girl at home. Try this one tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charla"
},
"reviewBody": "This Upside down cake is to die for. It is so good! It is not to sweet with the right balance of fruit and sugars. It seemed to me to be a lot of sugars and butters. But to my surprise it was perfect. Definitely reminded me of when I was a little girl at home. Try this one tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BiggPapa"
},
"reviewBody": "Very easy recipe if you have the ingredients. I also cut the recipe in half. I used butter instead of shortening &amp; increased the butter, brown sugar and pineapple in the 1st part of the recipe. Yum, Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francisca M"
},
"reviewBody": "Ohhh boy! I made this for Thanksgiving and it disappeared amidst a table of amazing pumpkin pie, a variety of cheese cake bites and other Thanksgiving dessert deliciousness! \n\nYou gotta make it! \n\nThe most moist cake I have ever made!!\n\nI made no changes. \n\nNext time, I would just decrease the amount of sugar since the brown sugar and pineapple topping makes it sweet enough! and mayble I'll ad a bit of rum!\n\nENJOY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sean Autin"
},
"reviewBody": "I used fresh pineapple crushed in my food chopper. I sifted dry ingredients twice yet the cake itself was that of a baking mix I'd use for blackberry dumplings--that is what it tasted like; which, if it were any better, the cake would have disappeared quicker. Some cakes are better the next day. The edges of the cake has a delightful crunch on the edge and the brown sugar and butter complimented the sweet pineapple. Next time I will use 3/4 C. less flour, but will add 1/3 C. corn starch to lighten it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ritchie Day"
},
"reviewBody": "Perfect! Didn't change a thing. Easy as can be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food Fanatic"
},
"reviewBody": "Holy heck! This recipe is delicious! I didnt have butter or shortening last night so I used vegetable oil, instead. I used half dark brown sugar and half liht brown sugar since that was all I had left. I also used a second can of fruit that I wont mention and combined both the second can of fruit juice and the crushed pineapple juice together. I didnt measure the juice but I assumed it was 1-1/3 cup of juice. I added no water at all. \n\nThen I read the reviews while it was baking. I read that some people's cake came out dry, that there was too much flour, that they doubled up on brown sugar, that it was too sweet, that ot wasnt sweet enough, that they used three eggs instead of two, or that theirs was not undercooked but it was dense and too wet, or undercooked. \n\nSo therefore...\n\nWhen it was i finished, I checked it and it was moist and undercooked a bit. I turned the oven off and put the pan back in for five minutes, checked it again, put it back in for five minutes, then checked it, then put it back in for five minutes, equaling fifteen minutes and it was perfectly done. Waited five minutes, flipped it, and it was great! \n\nThis cake is delicious, moist, baked to perfection, stayed moist today (i put it in the fridge over night), light yet dense, and ADDICTING. We cant stop eating it! \n\nYou have to be passionate about food when following a recipe and use your instincts. Dont give up on something because it didnt turn out correctly. I want to make this for a pool party this w"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrys"
},
"reviewBody": "I looked over several recipes and reviews before choosing this one. I made this exactly as stated, except I used solid coconut oil in the recipe instead of shortening and it was the best tasting pineapple upside down cake ever! It was very moist and flavorful and so easy to make that I no longer need to look for another recipe! My husband now wants this every year for his birthday cake..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "I made this cake as is except added cherries. It was just ok... I was unable to flip the cake out of the pan because it there was too much liquid on the bottom. The cake part was done. There seemed to be too much flour. My cake overflowed a little. It had more of a cobbler look than a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Wilhelm Roberts"
},
"reviewBody": "This cake tastes delicious and is light and moist, but I've made it twice in 2 different kinds of pans and when I turn it upside down, it falls apart. I followed the instructions about preparing the pan and letting it sit for 5 minutes and the topping just sticks and the cake falls apart. Maybe it's just me??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Lemons"
},
"reviewBody": "I made this with a proportion of 1 cup Stevia and 1/2 cup sugar. It worked very well. The cake tasted just like it would had I used regular sugar. The texture was not affected by the trade out either. If I had not said anything, no one would have guessed. I did not use Stevia in the pineapple topping mixture, I kept the same proportion of brown sugar in the pineapple mixture as the recipe used.\nAlso, due to the fact that I didn't have my big platter available, I made it as a \"right side up\" cake, baked it and added the pineapple mixture after baking.. It worked very well and I was able to serve it right from the 9x13 pan. Family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROSANNA"
},
"reviewBody": "PROS: I substituted 2 sticks of butter. Delicious, easy to make, VERY moist, fits perfectly in a 13x9 pan, feeds a crowd. This will be my new go-to recipe for yellow cake! (I made it the traditional way, with the pineapple rings.) \n\nCONS: We found it too sweet for our personal taste. So I made it a second time. Used 1/2 cup brown sugar in the topping, and decreased the white sugar in the batter to 1 cup. Perfect for us! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crystallovin"
},
"reviewBody": "The cake is dry. Maybe needs another egg. It definitely needs to be eaten the same day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Scott Townsend"
},
"reviewBody": "My family ate this cake up so quickly it was gone overnight. I found the recipe to be easy to make and is the most moist and delightful, sinful, and delicious cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Perkey"
},
"reviewBody": "It was really easy to make, but the cake didnt have a moist, cake like texture. flavor was ok. will keep looking for a better one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "micheleb"
},
"reviewBody": "Sorry but the cake part was way too dry. Topping was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Plumjelly"
},
"reviewBody": "I added one half cup of spiced rum to the pineapple water juice...it was an added touch. This cake was moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYBIRD1995"
},
"reviewBody": "I made this recipe exactly as listed except adding 1 tsp of salt. It was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ming"
},
"reviewBody": "I thought the flour would be too much (3 cups) but it was fine. Be sure to use all the juice and add enough water to make 1 1/3 cups of liquid as per recipe. However, even after letting cake cool for 30 min. rather than the recipe's 5 (as per other's suggestions), the toppings stuck to bottom of pan. Perhaps i will butter the pan even more heavily next time; don't know why else it would have stuck like that. Tastes good, though!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "4.9.13 ... https://www.allrecipes.com/recipe/8406/pineapple-upside-down-cake-iii/ ... So weird how submitter's names change. Originally, as in 2003, when I first tried this, it was from Nancy. No big deal, I guess. Just need to remember to save all recipes. Ha! Save all recipes, allrecipes?!? ... okay, okay ... :D ... I subbed sliced peaches &amp; 2/3c peach syrup &amp; 2/3c milk for the part where you add water to the pineapple juice to make 1 1/3cups. Also added 1t salt to balance the sugar, which I reduced to 1c in the cake part. This one is better than my Good Housekeeping Illustrated Cookbook one I've been using. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jordyne Dauberman"
},
"reviewBody": "I personally did not like this cake, but my mom loved it. I thought it was a little too soggy, but it was okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "islandfig"
},
"reviewBody": "may family and i thought this cake was great! i will make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "paddikake"
},
"reviewBody": "Followed to a tee. Dry and falls apart. Will keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya"
},
"reviewBody": "Super easy and delicious. I didn't have any shortening so I substituted 1/2 cup of butter and 1/2 of vegetable oil. Worked out perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat Levin-Kell"
},
"reviewBody": "I loved this cake but did make a few changes; I doubled the brown sugar and used one can of crushed and one can of pineapple tidbits for the topping. I omitted the cherries - too sickly sweet for me. I used butter instead of shortening and I also doubled the vanilla. After reading the reviews, I was concerned the cake was going to be too dense but it was just perfect - light and airy with just the right sweetness. What would I do differently next time? I would caramelize the brown sugar prior to mixing with pineapple. I would also like to try this with either coconut or almond extract - both work so well with pineapple. Note: I did not give it a 5 because of the adjustments necessary to the recipe however with the changes made - it was def a 5!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robi"
},
"reviewBody": "Great cake! I was nervous since i hadnt made one in years and tonight it was for my boss! It was a big hit with her and all the guests. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jo B."
},
"reviewBody": "This cake is delicious and reliable, and it scales easily. It may have too much baking powder, though. It leaves a strange skin on your teeth. Also, it does much better in a flatter, wider pan. The deeper the pan, the less likely it is to bake all the way through before the surface gets too brown. \n\nDepending on the pan, you can easily make the topping as per recipe, but reduce the batter by 1/3 (keep the eggs the same)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wintersunshine"
},
"reviewBody": "I didn't read these reviews until the cake was in the oven, then turned down the temp to 325, then 300, to try to avoid overcooking and dryness that other reviewers have noted. Cake turned out good, not dry, but definitely too sweet. If I make it again I will cut back the suger significantly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sue Larson"
},
"reviewBody": "The cake was not good at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cookin4Fun"
},
"reviewBody": "Loved the cake! It was my first time making this cake one spontaneous Saturday and I think it came out pretty well. It was a little too sweet for me, so the next time I make it I will probably decrease the white sugar by maybe a 1/2 cup. Overall it was moist and most importantly homemade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dettie"
},
"reviewBody": "i was looking for a recipe for pineapple upside down cake because my mom used to make it for us all the time and now that she is gone, i wanted to make it as tribute to her this christmas. this wasnt the same as hers though. i will keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "I altered the original recipe and new version is a 5 star, according to my guests. (1) Buttered 2 layer cake 9\" pans w/melted real Butter; then melted 4 Tbls. Butter divided into 2 Tbls. separately into 2 small bowls of 1/2 Cup packed Brown Sugar w/1 Tbls. Pineapple Juice in ea. small bowl. Mixed each well, then placed sliced Pineapple 1/2 circles onto mixture in each pan. (Used 1 and 1/2 cans 15 oz. each Sliced Pineapple) (2) I used \"Duncan Hines Moiste Deluxe BUTTER Golden Recipe\" cake mix in which I used 2/3 Cup Pineapple Juice instead of water, 3 Eggs, 1 Stick Real BUTTER softened; beat 4 minutes at 150 strokes per minute; poured 1/2 of batter into the 2 9\" pans over the Pineapple/Sugar mixture. (3) Baked 350 oven 20 min. Cooled 15 min. Turned out perfect even though I did not have cherries on hand. This was prepared to serve guests and it was a hit. Far better tasting cake than found in stores or bakery shops! Submitted Oct. 7, 2010"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alexis C"
},
"reviewBody": "I'd let it cool longer than 5 minutes...when I turned mine out the topping got stuck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zoenyc"
},
"reviewBody": "I just made this kind of cake for the first time. I halved the recipe and it came out perfectly! I did make a few adjustments: I used pineapple rings instead of crushed pineapple and near the end I added powder sugar because the batter didn't taste sweet enough. I also ran out of vanilla so used almond extract for about 1 t. I put the pineapple down before I put the sauce down, but it still came out great. It was like angels food cake and was delish! I highly recommend this for those who want a nice dessert to share!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci-in-Cali"
},
"reviewBody": "I added 1/4 cup extra water and baked an extra 5 minutes since lots of people complained it was dry... It was an ok cake, looked a mess out of the pan so I didn't bother taking a picture. I think I'll keep looking for one like my Mom used to make.. Taste was different!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kimberly S George"
},
"reviewBody": "Too much cake which made the whole thing seem dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beautiful Disaster"
},
"reviewBody": "This was great! Everyone does there own little twinges here and there to the recipes but overall this came out wonderfully.....thankyou for submitting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmy0316"
},
"reviewBody": "turned out great. my mom LOVES pineapple upside down cake and she loved this one. i showed my 12 year old nephew how to make this - its that easy! we made it in a bundt cake pan and it was very pretty and tasty too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Uccardi"
},
"reviewBody": "I followed this recipe to a T and the cake turned out very dry and very dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Blue Ribbon"
},
"reviewBody": "Much too dry......3cups of flower?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ariba Shah-Dugan"
},
"reviewBody": "too much flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ditzy Dahlia"
},
"reviewBody": "The topping was delish! but the cake for me was not good. I added the almond extract as some suggested, which did give it a nice flavor. Some of you said yours was very dense, mine was really flaky but just lacked flavor. My husband on the other hand really likes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin"
},
"reviewBody": "I didn't have any brown sugar for the glaze so i used white sugar, used pineapple rings with cherries in the center, and baked in a bunt pan. had to cook about 10-15 extra minutes.turned out great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Michelle Gardner"
},
"reviewBody": "Our cake was wonderful! I doubled the topping and added pineapple rings with cherries for decoration. We loved it! Will save this for special occasions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nelson"
},
"reviewBody": "I did not like this cake at all..I think it calls for way too much flour because it's very dense, almost like you're eating pudding. (It's definitely not undercooked...just very dense.) Too bad I made it for a luncheon today. :( lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ms. Vanessa! "
},
"reviewBody": "A beautiful cake, but I must agree with some of the other comments... The cake itself is bland on its own. All it has for flavor is a little vanilla and sugar. Next time I'll try some of the variations with crushed pineapple in the batter. I also like pecans and extra brown sugar-butter mixture for the top..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "*Sarah*"
},
"reviewBody": "I'm not sure what I did wrong, but this came out dry and flavorless for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Meagan E"
},
"reviewBody": "A box cake mix would have been a lot easier and a lot tastier. The cake is super bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sandysue"
},
"reviewBody": "I absolutely love pineapple. There aren't too many ways you can serve it that I won't eat it, but I was not at all impressed with this recipe. It came out more like a shortcake and was way too dry. I waited a day as the recipe suggested and still wasn't happy. I will definitely be looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieBlair1979"
},
"reviewBody": "PERFECT. I knew this was the recipe for me b/c of everyone saying it was too bland. My fave versions are fluffy and biscuity and not really cakey... this was awesome. The #1 trick is to get the brown sugar, butter, and pineapple cooking while you make the cake and when it's bubbling pour the batter on, it makes a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wingedwhisper72"
},
"reviewBody": "I am an experienced baker but this was my first time making this cake. You could taste too much of the flour at first but after it sat for a day it was much better. Still a good recipe in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DEANNE108"
},
"reviewBody": "disappointing version...could barely tell i was eating a pineapple cake..live and learn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Ann Pete"
},
"reviewBody": "This recipe makes the most delicious cake! I halved the recipe, used oil instead of butter (making sure to cream the sugar and oil together very thoroughly with an electric mixer), baked it in an 8x8 pyrex pan and it still turned out great! This is possibly the very best cake I have ever tasted! Thanks for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria A"
},
"reviewBody": "This was the first time I've ever made this cake before. Everyone loved it and it tasted great! I did double the brown sugar and butter as others suggested and if I didn't I don't think it would have tasted as good. I also substituted half the milk with pineapple juice and it came out very moist. Will make this again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EricaD521"
},
"reviewBody": "i halved the recipe and used butter instead of shortening. pretty yummy if you ask me! the cake part coud be bland but if you use a coconut extract instead of vanilla or a dash of rum you can liven up the flavor! i used a tsp of rum with the brown sugar and pineapples. so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christopher Sherlock"
},
"reviewBody": "The cake part is fairly bland, I added about 1/8 to 1/4 tsp of almond flavoring. Improved the taste! The Pineapple bottom is yummy.\nI still prefer the Dunkin Hinze recipe that uses boxed yellow cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amanda Amazeen"
},
"reviewBody": "Way too much flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GAIA3441"
},
"reviewBody": "Very good and easy. Not too sweet and great texture. Halved the recepie for a smaller cake and baked in a 7\" round corningware dish. It took 55 minutes, and came out perfect, yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "purenv"
},
"reviewBody": "very good ! Haveing a Luau for my daughters 11 b-day and wanted to test it out first , I think Im going to try it with whole pineapples to dress it up some ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ava Flavah!"
},
"reviewBody": "I baked this cake for my dad's 75 b-day. It was very good and I would have given it five stars except that it makes too much batter to fit the specified pan and is not quite as moist as a good cake should be. \n\n The juice in the batter gave the cake a nice flavor and the glaze was yummy. I wish I had made extra to drizzle over the slices. The texture baked up rather pound cake-like. Everyone enjoyed it.\n\n I was sorry I had not greased the pan as recommended and as noted by another reviewer; I sprayed it with vegetable spray and although I let the cake cool for quite awhile, some of the pineapple and glaze stuck to the pan. No matter. This is a great version of the traditional favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoMo'sGoodies"
},
"reviewBody": "This cake is delish! Probably one of the best upside down pineapple cakes I have made. I put the batter in a 9 by 9 inch pan instead of a 9 by 13 and it rose high and beautiful. I did not spray my pan enough, thinking the butter in the syrup would be sufficient, so about half of the brown sugar syrup was left in the pan when I tried to invert it. So, it did not look as pretty as I wanted it to be. I made a brown-sugar, pineapple glaze to cover up the bare spots. All in all-some mistakes on my part-but delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jodi Gillaume"
},
"reviewBody": "I thought this recipe was very good. I took other reviews advise and doubled the butter, brown sugar, and pineapples. I also used whole wheat flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Improviser"
},
"reviewBody": "We loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pianocook"
},
"reviewBody": "This cake had a sublime flavor amd just the right texture- not too grainy. It was very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EILISH40"
},
"reviewBody": "Good cake but too big for us so it halves successfully. I substitute butter for shortening and the taste is deeper and texture better. This, of course, is to suit our tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vee"
},
"reviewBody": "i have used several of other peoples recipes for pineapple upside down cakes.....because i love to experiment in the kitchen! :) but this one is just way too much....u use too much flour and sugar...not enough eggs....i use 3 eggs. sorry i was not pleased with this recipe at all. i made it exact to the T and it was just overflowing out of the pan :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andi"
},
"reviewBody": "my kids loved this cake warm with custard"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heinz14"
},
"reviewBody": "I made this for a friends birthday as a healthier birthday cake, and everyone loved it, and could have cared less about missing the sugary frosting and icing! I sived a small bit of brown sugar on the bottom of the pan to give it a more \"crystally\" appearence and added some green and red marichino charries, quartered into the mix to give it a bit more color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "butt3rflymomma"
},
"reviewBody": "I also added double sugar and butter I also added some pineapple pieces into the batter to give it some more flavor but don't add to much as the cake will fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lbiggar"
},
"reviewBody": "This recipe is a no brainer! I'm a that's close enough type of guy. I used about a cup of butter flavored Crisco. Pretty much the same measurment for the rest of the stuff. Came out perfect! It was quick, easy and even tasted great! Will do this one again! It's a keeper folks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "larryg"
},
"reviewBody": "I have to agree with sarahfaye and bethpc.The cake is not very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin De Wolfe"
},
"reviewBody": "doubled the butter, pineapple and brown sugar as suggested. Best i've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sarahfaye"
},
"reviewBody": "I did not like this cake at all, the cake part was so thick that I could not even taste the pinapple on the bottom. Maybe if I half the recipe for the cake? My hubby and I both had one piece and threw the rest out, dont think I will make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wendy"
},
"reviewBody": "This was delicious and I served it for a birthday party and everyone raved. I love the crushed pineapple on top rather than the rings. However take my advice and DON'T make it a day in advance. The cake was a bit dry. Next time I will make this the day of the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "azmamma"
},
"reviewBody": "Easy to make! I read the recipe so fast I didn't realize it called for Crushed pineapples, so I ended up using the sliced circles. Worked out VERY well for me. Accidently had the oven rack too high and the top (bottom?LOL) started to burn a little, so I put some foil over it when it had about 15 mins left to cook. Turned out Excellent!! It's a great dessert. My whole family loved it! We will add this to our menu! (It's not a rich and powerful dessert, but it's great tasting, easy, and quick (quick as far as completely home-made desserts go). Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe. My husband loved it. I think the pan size was too small and a 10x15 pan would do better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an excellent cake recipe! I doubled the brown suger, pinapple and melted butter, and it turned out fantastic! I also baked it in a large bundt pan, it took about an extra 12 minutes, and it worked out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a super fun cake to make and is super moist and very flavorful!\r\n\r\nI actually used canned pear halves instead of pineapple and it was a truly delicious treat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MummyJacks"
},
"reviewBody": "Makes a very large cake, and tastes like flour! When I flipped the cake the whole topping stuck to the pan, so i had to scrape it off and spread it back on! The only way my family would eat it was with custard or ice cream. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ZZZSALTS"
},
"reviewBody": "I was disappointed with this cake. I read the reviews and most talked about its great flavor, well I followed the recipe but the cake did not have alot of flavor. The first time I made it with pineapple in it's own juice so I thougth that was the problem. I made it agian with pineapple in heavy syrup, double the brown sugar and butter for the topping and double the vanilla extract. It tasted a little better but was still missing something. Maybe I'll try again and add salt. I really liked the texture of the cake very moist but not heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Recipe was Great - like my mother's ole time recipe.. All Six of my grandchildren loved it \r\nI altered a tad - Doubled brown sugar &amp; butter/sliced pineapple and marchino cheeries and then Cooled for at least 30 minutes before turning out -"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KRISTYLEE3"
},
"reviewBody": "This was very good. Moist and tasty. The only thing that went wrong was the cake cracked in 3 places when I flipped it out of the baking pan. It was still very good though. Maybe if you let it cool in the pan a little longer it wouldn't do that. Also, I used pineapple slices instead of crushed pineapple and put cherry halves in the middle of the slices."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8406/pineapple-upside-down-cake-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17531/desserts/fruit-desserts/pineapple-desserts/",
"name": "Pineapple Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8406/pineapple-upside-down-cake-iii/",
"name": "Pineapple Upside-Down Cake III"
}
}
]
}
}
, "about": [
]
}
]