				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pink Fluff"
,"datePublished": "2018-03-21T12:18:18.000-04:00"
,"dateModified": "2022-07-14T18:07:33.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Angela"
,"url": "https://www.allrecipes.com/cook/48815"
}
]
,"description": "This creamy mix of cottage cheese, whipped topping, pineapple, cherry pie filling and raspberry Jell-O is delightful garnished with chopped pecans and mandarin orange slices."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9VuZIvbb1r5CbeJaILqZYBDKKpM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5555830-7c0cff7b45d0433ab0e8d8aa25390b8b.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pink Fluff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "57"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "338 kcal"
,"carbohydrateContent": "49 g"
,"cholesterolContent": "11 mg"
,"fiberContent": "1 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "364 mg"
,"sugarContent": "27 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (16 ounce) package cottage cheese",
"1 (8 ounce) container frozen whipped topping, thawed",
"1 (15 ounce) can crushed pineapple, drained",
"1 (12 ounce) can cherry pie filling",
"1 (3 ounce) package raspberry flavored Jell-O® mix" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, stir together the cottage cheese, whipped topping, pineapple and cherry pie filling. Pour gelatin over the mixture and blend well. Divide into serving bowls and chill several hours, or overnight."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT1455M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I dont use raspberry jello...we love strawberry or peach or lime. No cherries. I warm the pineapple in a sauce pan on low then add jello to dissolve. This will keep it from being like its not dissolved. Cool &amp; add frozen topping &amp; cottage cheese &amp; stir...I then add pecans &amp; refrigerate overnight. Its amazing. I make every week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ascar52"
},
"reviewBody": "Have made this recipe many times for family dinners. We are having a cookout tomorrow so decided at the last minute to make this to go with the hot dogs and hamburgers. It is always well received and the dish gets emptied quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David4031"
},
"reviewBody": "I made this many times and I love this each time. You can make it any way you want to. My mom use to make this dish for the holidays. Its taste just takes me back to the big family holidays from when I was young. I have used different Jello flavoring and fruit. But, I like the cherry pie filling. It is sweet, but it is the holidays. I really enjoy this desert salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jovelyn Stucki"
},
"reviewBody": "Very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammiann"
},
"reviewBody": "Easy to make and tastes yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamala Bleecker"
},
"reviewBody": "I make this with large can of FRUIT COCKTAIL instead of pie filling and STRAWBERRY JELLO."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janto2"
},
"reviewBody": "Hubs said it was a little too sweet but that didn't stop him from loading up on it! I added chopped pecans. I noticed the \"grit\" some were speaking of, when it was freshly prepared but after a few minutes the gelatin dissolved and there was not any noticeable grit. I have made it again with strawberry pie filling this week and it is just as delicious! I will be making this again and again. So, nice to have in the fridge for after school snacks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vanagirl"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Jensen"
},
"reviewBody": "Make it every holiday season my grandkids love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pruettss"
},
"reviewBody": "Love this recipe. I didn't add the pie filling but I'm sure I'd really like it that way. It couldn't get too sweet for my liking. I ran frozen cherries through the food processor for a quick chop &amp; added a little sugar. Let it sit till the sugar dissolved &amp; used that instead of the pie filling. It was great. You can use any flavor jello and fruit combination. It's fine to leave out the extra fruit and just add the pineapple only. I always use small curd cottage cheese. Everyone that ran it thru the blender should try it omitting that step at least once. It is excellent without creaming the cottage cheese. No one ever knows it's made with cottage cheese unless they have made it themselves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan McNamee"
},
"reviewBody": "If you stir the jello into the cottage cheese thoroughly until it dissolves, then add the rest of the ingredients, the jello will not feel grainy. This is a family favorite and we made a huge bowl of it for my parents golden wedding anniversary party. It was pretty and very popular! We don't add the cherry pie filling, but I've got some extra fresh cherries today and will cut them up and add."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacy Peterson"
},
"reviewBody": "Too sweet. However, to make this less sweet and not at all gritty, double the amount of cottage cheese (blended or not, according to your taste - personallyI like the texture of cottage cheese in dishes like this) or add an equivalent amount of plain Greek yogurt. Also add an envelope of unflavored gelatin when you add the Jell-O but do not sprinkle it in; dissolve the Jell-O and gelatin in 1/2 cup of cold water (it will dissolve reasonably well with a little stirring) and then stir that solution into the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I added marshmallows. I did not use the pie filling, but chose to use a can of fruit cocktail and a can of crushed pineapple and it turned out very well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bmwheelon"
},
"reviewBody": "Everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MPKOELLEIN"
},
"reviewBody": "I love this recipe. It is sweet and a little goes a long way. To avoid the \"gritty texture\" that some have experienced, I always heat the pineapple and mix in the gelatin until well dissolved. Cool well and then combine the rest of the ingredients and chill. I sometimes add chopped pecans as requested by my oldest daughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisamarie78"
},
"reviewBody": "Mom makes this...kids LOVE it...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weiner0079"
},
"reviewBody": "This was amazing!! I made it with our Christmas supper &amp; it turned out great!! This one is a keeper for our table!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "It felt as though it was missing something, so I added 1/2 bag mini marshmallows and 1/2 cup crushed walnuts and I also used cherry jello instead of raspberry.....needless to say it got rave reviews!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I also enjoy this recipe and have a way to reduce the calories/sugar. Drain the pineapple well. reserve liquid, use regular cherries with light syrup. Drain the syrup, heat and thicken with cornstarch to pie filling consistency, sweeten with your favorite no sugar sweetener-I like utrisweet. Put back together and cool overnight. I also might drain the fat free cottage cheese if it has a lot of fluid. I put the cottage cheese through the blender and add 1 small package of vanilla or cheesecake flavored sugar free pudding, add back pineapple juice a spoon at a time IF the beaten cottage cheese is too thick, and use the no sugar jello at this point. Then fold all together well. I use the pudding to make sure it all thickens well, since sugar usually helps thickening and we are leaving it out of this. No one really notices the differences and everyone likes it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Victoria Hebert"
},
"reviewBody": "Yum! Made this without the cherry pie filling. Instead I added a jar of maraschino cherries. (drained and chopped) also chopped the mandarin oranges :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Dauterman"
},
"reviewBody": "I didn't use the cherry pie filling (cut up some maraschino cherries), but it was wonderful! I'm going to try it with the filling too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NMLady"
},
"reviewBody": "Was looking for a way to eat cottage cheese, because I can't stand the stuff. I have only one way that I will eat it, but now I have two ways. The only problem with this is the cherry pie filling, and maybe the pineapple. I am a disbetic and it tends to raise my blood sugar, and so if I can find a way to use something sugarfree instead I will give it another go. The reviews were very helpful. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Banks"
},
"reviewBody": "I liked this, it was easy to make and easy to modify to low fat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TNociti"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I also stick my cottage cheese in the blender for a smooth consistancy. Now when I make this, I use \"Trim\" cottage cheese, \"free\" whipped topping, light pie filling and SF jello and noone notices. YUM. The princess of Church Salads."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "popper72"
},
"reviewBody": "Not bad at all, just remember to use small curd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loves to entertain"
},
"reviewBody": "this is excellent!. After making the base recipe, I tried variations-using sugar free jello and lite whipped topping mix. I like it with a small strawberry or raspberry yogurt added to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This is perfect just the way it is. I did add frozen blueberries. Do not make the jello, only pour the packet in the mixture (last step.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl J"
},
"reviewBody": "I think this salad too sweet. I have adjusted the recipe by omitting the pie filling all together and adding one can of mandarin oranges. Also, I use sugar-free gelatin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "REBEKAHMO"
},
"reviewBody": "Many thanks to the reviewer who recommended pureeing the cottage cheese! I never would have made this without that idea. I left out the pie filling and added a large can of mandarin oranges. I used strawberry jello. It was delicious...very well received. Definitely the best way I've ever eaten cottage cheese! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baking Barbara"
},
"reviewBody": "1. Just had surgery a week ago.\n2. Kithen packed for pending move.\n3. Received invitation for Easter Dinner.\n4. Signed up for All Recipes today\n5. Found Pink Fluff.\n6. REVIEWS: Noted sweetness and fact that the jello was to be used straight from the box and not prepared. Recipe used term \"pour\" which is misleading.\n7. Needed 6-12 servings and adjusted the recipe as follows:\n * 1 24 oz. Low Fat Cottage Cheese\n * 2 8 oz. Lite Frozen Whipped Topping\n * 1 20 oz. Can Crushed Pineapple, Drained\n * 2 3 ox. Packages Raspberry Jello\n8. Tasted it...very good...will serve it tomorrow.\n9. Very easy to prepare, ingredients are usually on-hand.\n10. Used some multi-colored sprinkles for the top; would have saved some of the jello had I thought of it.\n11. A great basic recipe; will consider several variations including, but not limited to: Fresh fruit slices on top; kiwi, strawberries, raspberries, blueberries, etc. Variety of jello flavors &amp; fruit; nuts/granola, etc. See possibilities as endless. THANKS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Elizabeth"
},
"reviewBody": "This recipe turned out very well. I did make some slight changes from the original recipe though: added a can of mandarin oranges (next time I'll add 2 cans), blended the cottage cheese until smooth then gradually blended in the gelatin mix (used mixed fruit flavor b/c its what I had), used a 20 oz can of crushed pineapple, used a 21 oz can of cherry pie filling (couldn't find the other size). Make sure you really like the gelatin flavor you use because it gives the dish major flavor. Next time I think I'll use cherry flavored gelatin. Only 1 person complained about this dish tasting \"odd\" everyone else enjoyed it. BTW used low-fat cottage cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Townbaker"
},
"reviewBody": "I have to watch my blood sugar so I tried this with sugar free whipped topping, sugar free gelatin, no sugar added cherry pie filling, reduced fat cottage cheese, and crushed pineapple in its own juice. It turned out great and not so sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tara7373"
},
"reviewBody": "I am giving 4 stars as I modified the recipe so it wasn't so sweet. I used whipped cream rather than cool whip and frozen blueberries rather than pie filling. I also used blue jello. It was a hit at my sons Winnie the Pooh b-day party as Eyeores Rainclouds. I served with a dab of Cool Whip on the top. The other parents loved that the kids were eating cottage cheese and fruit! I poured the jello slowly into the blender after the cheese was smooth. It blended with no sign of any jello granules."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joyce Edgerton Laslo"
},
"reviewBody": "i thought this was great for the holidays. only thing changed was i used the sugar free jello"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idntseeya"
},
"reviewBody": "I made this recipe for a birthday party and the entire double batch disappeared quickly!!! We all loved it and I think It's a great new side. FLUFF is the word!! Loved it and Thanks for putting this recipe on here :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLC"
},
"reviewBody": "I made this for Thanksgiving and it went so fast I had to make another batch. I have used it for a couple of pot lucks since then and it is always a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it was really good but it didnt set like i thought it would. maybe i didnt make it right. it was too creamy and not hard enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOONPIE67"
},
"reviewBody": "I make this all the time for my family. I always put the cottage cheese in the blender and blend until creamy. No one can guess they are eating cottage cheese! I don't ever use a pie filling. The Jello gives it enough flavor...and strawberry is really good. You can use a low-fat cottage cheese to reduce the fat, also. I think it makes for a healthy snack and it's good for breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cindy Motz"
},
"reviewBody": "oh my goodness is this stuff is sweet! i left out the pineapple. in my family ambrosia type salads of every variety have always been on the dinner table at any family gathering as a side dish. so i am very acustomed to have it as part of the \"dinner\" rather then dessert. But let me tell you, this one is a dessert. It was way way to sweet for me. thank you for the recipe, even though it didn't suit my personal tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LAUREN003"
},
"reviewBody": "Mine turned out gritty from the gelatin bits. It would have tasted good if I could stomach that texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Frommelt Manderscheid"
},
"reviewBody": "This recipe is very easy and very tasty! I found myself eating the most of it! :O)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MAGGIE MCGUIRE"
},
"reviewBody": "Wowze,is this one ever SWEET, too. Both Pink Stuff and Pink Fluff recipes should be considered dessert rather than salads. They are both way too sweet. However, this can be modified by increasing crushed pineapple, adding mandarin oranges and using unsweetened whipping cream rather than cool whip. I gave this a four against my personal preference because my family and guests loved it. Thanks Angela."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicki Mills"
},
"reviewBody": "Beatiful and delicious. \r\nSo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe!! Makes alot, but it disappears fast!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24613/pink-fluff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/373/desserts/specialty-desserts/dessert-salads/",
"name": "Dessert Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/980/desserts/specialty-desserts/dessert-salads/jell-o-salad/",
"name": "Jell-O&reg; Salad"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24613/pink-fluff/",
"name": "Pink Fluff"
}
}
]
}
}
, "about": [
]
}
]