				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Plum Blueberry Upside Down Cake"
,"datePublished": "2020-06-18T23:05:05.000-04:00"
,"dateModified": "2022-07-14T15:54:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Dina"
,"url": "https://www.allrecipes.com/cook/91573"
}
]
,"description": "Use fresh or frozen fruit in this stunning twist on the upside down cake."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CmBXhGTbOYpk5uaHmW9yOQwwN78=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/23730-Plum-Blueberry-Upside-Down-Cake-COOKIN4MYFAMILY_444218_original-4x3-1-901e59540e834071bbec10400e66cba1.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Plum Blueberry Upside Down Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "388"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "229 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "17 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "196 mg"
,"sugarContent": "25 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.25 cups all-purpose flour",
"1.5 teaspoons baking powder",
"0.25 teaspoon salt",
"3 tablespoons margarine",
"0.25 cup brown sugar",
"0.33333334326744 cup margarine",
"1 cup white sugar",
"1 egg",
"1 teaspoon vanilla extract",
"0.75 cup milk",
"4 black plums, pitted and thinly sliced",
"0.75 cup blueberries" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch cake pan. Combine the flour, baking powder and salt. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In the prepared pan, combine 3 tablespoons margarine and brown sugar. Place pan inside the preheated oven until the margarine melts and begins to bubble. Set aside. In a large bowl, cream together the 1/3 cup margarine and 1 cup white sugar until light and fluffy. Beat in the egg, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated."
} ,{
"@type": "HowToStep"
,"text": "Arrange plums around the edges of the prepared pan, overlapping slightly. Distribute the blueberries in the center. Pour batter into prepared pan, covering fruit completely. Bake in the preheated oven for 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool 15 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had a friend in the kitchen helping me and i rushed so I didn’t read the part Mix flour and backing powder and salt so after everything was done and the cake was ready to be put in the oven my friend said will it be soft and I said yeah…… No because I didn’t put baking powder so I scooped the batter out carefully avoiding the fruit especially blueberries and gently mixing a little bit of flower with baking powder then mix it with the rest of the batter and placed it all back in on top of the fruit that extra dough without baking powder might make amazing difference who knows Love thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chasfield"
},
"reviewBody": "My whole family loved this cake and now rate it as our #1 blueberry dessert! I made it just as written but added pecans to the topping for a delicious crunch! We picked and froze quarts of our own Vermont blueberries this summer so will enjoy this year round! But I also want to try it with peaches. Wonderful recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary amiri"
},
"reviewBody": "Great cake! I used the modifications suggested by another cook. Microwaved the butter and sugar, used a springform pan and added cinnamon to cake batter. I was surprised at how many Plums suggested. I only needed about two and had no room for blueberries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally Scheffler"
},
"reviewBody": "I added a teaspoon of cinnamon and it was amazing! I definitely recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Auntie C"
},
"reviewBody": "We LOVED this cake. I made it per the directions with a very few adjustments. Doubled the butter and brown sugar (I used real butter and not margarine)as recommended by other reviews. Placed the blueberries around the outside edge and between my plums for a pretty design. Cooked in my 10 inch cast iron skillet. I am making four more this weekend to share with family. It was a HUGE hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PapaJud Lobdell"
},
"reviewBody": "I liked it 100% the coffee cake was excellent. I should have let it cool longer and let the juice coagulate more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Linn Black Henline"
},
"reviewBody": "I used coconut flour, natural cane sugar and blackberries instead of blueberries. The batter was not pourable or light and fluffy. It was more of a really loose dough. I spread it over the fruit and made sure it got gently pressed into the nooks and crannies. It turned out beautifully. It was still warm when I cut the first piece and it was soft, almost pudding-like but oh, so tasty. I covered it and put it in the fridge and hope it will firm up a little. Even if not, it is still very good. Next time I will use regular flour which will make it firmer I'm sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mocha"
},
"reviewBody": "It came out very good. I use butter instead of margarine. Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This turned out fabulous! I followed the directions almost exactly, except used all butter instead of margarine. I couldn’t find my springform pan, so just used a regular non stick round and it came out perfectly after cooling 10 minutes. I greased the pan with Crisco and mixed the butter and brown sugar in a separate bowl and microwaved a tad before spreading it in, so as not to disturb the Crisco coverage. I used two outer circles of plums, and the middle blueberry. I also made 5 single lines of blueberries coming out from the center like spokes on a wheel. Topped with Cool Whip, this was a massive hit! It did take about 50 minutes vs. 40 in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianeVA"
},
"reviewBody": "Very pretty, and easy, too! Used butter instead of margarine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monkeystar"
},
"reviewBody": "I have made this upside down cake more than any other recipe on Allrecipes. My husband is obsessed with it. If I say I am going to bake something this is the only thing he requests. I have used plums, blueberries, peaches, nectarines, pears, rhubarb. Any fruit works wonderfully. I have made some changes to suit my family's tastes but the five-star rating is for the recipe as-is. Thank you for a wonderful go-to upside down cake recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "Delicious as is! Beautiful to the eye, not too sweet and perfect when paired with whipped cream. Yum. I used a circle of parchment paper to ensure it came out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mafafa"
},
"reviewBody": "Yum! And so very pretty \nAdded a generous dash each of nutmeg and cinnamon to the dry ingredients, and served with the smallest spoonful of whipped cream, will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANDRA MACDOUGALL"
},
"reviewBody": "Loved, Loved this one. only thing I changed was that I added a little fresh lemon juice over the fruit. Something I always do when cooking with fruit. Texture of cake was wonderful, fruit was great. Used springform pan greased and lined with was paper for easy removal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Waxman"
},
"reviewBody": "I made this recipe using peaches and plums. I only use butter in recipes, never margarine. It was delicious! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chase Holdener"
},
"reviewBody": "This cake is very easy to make and tastes great! I used 1/3 cup butter + 1 tbsp canola oil instead of margarine, and it worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick Nelson"
},
"reviewBody": "My family absolutely celebrates when this cakes comes to the table. As delicious as it is beautiful! Very, very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa r"
},
"reviewBody": "Made in a 10” cast iron skillet, next time I would double up on the plums."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Decoteaux"
},
"reviewBody": "Made exactly as written, stellar flavor! Took exactly 40 minutes for me. Struggled a bit to get it out of the cake pan but likely because I should have greased with butter instead of spray. Did not use the blueberries because I had so many plums to use up. This is a repeat, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianelizabeth"
},
"reviewBody": "This is a fantastic recipe and so versatile. First, I made this in my 10 inch cast iron pan because I like to melt the butter and brown sugar in it. I used plumcots as they were on sale 1/2 price. After baking and cooling, just before flipping over onto a plate and serving, I heat the pan for a quick 15 seconds to warm up the fruit and caramel. So dang good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sierra Anderson"
},
"reviewBody": "I didn't have a 9 inch cake pan so i doubled the recipe and used plums and peaches in a 9x13 casserole dish. It turned out yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marciaotto"
},
"reviewBody": "This is such an impressive cake with both how gorgeous and amazingly tasty it is. Most people must have seconds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jennieqg"
},
"reviewBody": "This was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane A. Lesher"
},
"reviewBody": "Very easy recipe that would work with a variety of fruits - get creative!\nI thought the cake part was a little sweeter than necessary, but maybe my fruits weren't as tart as some. Keep that in mind when making this again and adjust sugar if necessary.\nTIP - don't try to make this in an 8\" pan (like I did because that's what I had handy) - it overflowed! If you only have an 8\" pan, scoop a little batter into a small dish or custard cup and bake it separately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa Martin"
},
"reviewBody": "I used blackberries instead of the blueberries. I think it needed a touch more brown sugar but otherwise outstanding!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is a wonderful use of plums and blueberries. The cake has perfect flavor and texture. It is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zittzo"
},
"reviewBody": "Great tasting, made it in my cast iron frying pan, easy and fun to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Dickerman"
},
"reviewBody": "I added 1/2 tsp cinnamon, doubled the butter + brown sugar combo, and used a 10'' cake pan for a higher fruit to cake ratio. This was great! I will add it to my metal recipe box where I keep all my tried-and-true recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacque Andrade Metzler"
},
"reviewBody": "I used raspberries instead of blueberries and my co-workers are raving! It turned out great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Nealy"
},
"reviewBody": "We didn't have black plums so I used about 1 dozen chopped prune plums instead....the blueberry/plum combo is delicious and the cake is beneath is nice and moist. Add a dollop of lightly sweetened whipped cream and you've got a spectacular dessert! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Troup"
},
"reviewBody": "Wonderful recipe! I used butter instead of margarine and a spring form pan. Thank you for a great recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "I used this recipe for a peach upsidedown cake, and it was lovely. I increased the brown sugar in the topping slightly, although the cake itself is pretty sweet. Overall, I was very happy with it, but like all upsidedown cakes, I removed it a little too soon and the center was a little underbaked. Next time I will be more careful to wait for a very dry toothpick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Entlebucherlover"
},
"reviewBody": "This cake was delicious!!!!!! I didn’t change the cake part of the recipe except to cut the sugar by 1/2. For the topping I had no plums so substituted with apricots and strawberries as well as the blueberries. I would certainly make it again!!!!! Thank you for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maryc65"
},
"reviewBody": "I questioned myself pouring this in the 9\" cake pan. Yep. ..it blew over that pan all over the stove setting off the smoke alarms. Holy cow wont use that pan again. It is a good cake though and I will make it again just in a spring form pan. Off to get the oven cleaned!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Kugel"
},
"reviewBody": "I left out the blueberries. The plums were sour, so I sprinkled a little extra sugar on them before adding the batter. The finished cake had a lot of liquid in the bottom, but it tasted wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisy girl"
},
"reviewBody": "I made this to take to a party. It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grandma Bea"
},
"reviewBody": "I had just what I needed to make this cake and needed to use up some plumbs that were slow to ripen. Not sure it would be at all remarkable; we were amazed at how lovely it was and how wonderful it tasted! The only thing I changed was to use only butter, rather than a combination of margarine and butter. Yum, I am making another one tonight to share with family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Jansen"
},
"reviewBody": "My colleagues absolutely loved this one. I'm not a fan of plums, or in fact, fruit on cakes at all, but when a farm we work with dropped off a pile of fresh plums I went hunting for a recipe. I left out the berries. And bought some custard for anyone who might want to add it. Rave reviews all round, with and without the custard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Neyland"
},
"reviewBody": "This cake came out just perfect! The only change I made was to use slightly less sugar in the cake batter. My only other tip is to take out the margarine-sugar as soon as it's melted and slightly carmelized on the bottom of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LAWoods"
},
"reviewBody": "Made this with fresh black plums from our farm share and it was delicious! I noticed others said to use a springfoam pan and I was glad I did. I can't see the sticky top coming out of a traditional pan so well. I did not have blueberries so I omitted them. It was pretty easy and came out nice. I don't like overly sweet desserts and the tartness of the plums works well with the sweet caramel and cake. I only wish there was a bit more cake - the cake is thin. Also, just a note that it took about 20 minutes longer to cook than the recipe stated, but still came out nicely cooked in the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AliciaBlackwell"
},
"reviewBody": "It was ok tasting and it's definitely a pretty cake. I used a mix of different plums and I did add the blueberries. For me this cake wouldn't be nearly as good without the blueberries and I think next time I'll double the cake batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MomTo6"
},
"reviewBody": "This just wasn't that great. I made it as called for except to use nectarines. This just wasn't exceptional in the way I thought it might be. It looked pretty, though. I don't think I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rene' Bernier"
},
"reviewBody": "Wow! I've never used vanilla in a fruit crisp, and the addition made all the difference. It was so fragrant. The dessert came out with just the right balance of tart and sweet. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicer"
},
"reviewBody": "Great recipe! Looks impressive and is super simple to put together. Everybody loved it. I added a pinch of cinnamon and a dollop of mayo to the batter and half again butter and brown sugar for the base. Will absolutely be making again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Helena Goodwin"
},
"reviewBody": "I used coconut oil for the shortening and almond milk in place of milk. I didn't have any blueberries so I added more plums"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skipperetta"
},
"reviewBody": "I followed this recipe exactly the 1st time I made it. I loved it &amp; it's beautiful. The second time I made it I used a 1/4 cup less white sugar &amp; it's still amazing!!! The plums bring their own sweetness.... black raspberries are a great addition too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angela"
},
"reviewBody": "I doubled the batter added a middle layer of fruit on pecans and then topped with the last half batter. Liked the crunch in there. Cake has a nice density. Twas yummy. Good with vanilla ice milk or cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "constantina"
},
"reviewBody": "After a couple of changes to the original recipe (50 gr less sugar, some lemon zest and 1/2 tsp cinnamon) and an increase to the baking time by 20 minutes, it became a flavourfull, moist cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "I made this for the first time . I cut the sugar down to 3/4 cup. I used all plums for the top ( all I had on hand ) It was a big hit not a crumb left. So simple to make &amp; I loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb."
},
"reviewBody": "Super easy to make and to modify. I added 1/2 tsp. of cinnamon and it was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helen8888"
},
"reviewBody": "Made with blackberries instead of blueberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Garton"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mleeinmd"
},
"reviewBody": "I made this as indicated in the recipe, except I used 1 plum and 3 pluots, and reduced the sugar by a couple teaspoons. The cake part was moist, fluffy -- excellent. The syrup, however, was two sweet for my taste, even with my slight reduction in sugar. My advice would be to adjust the sugar based on the sweetness of the fruit. In my case, I think I could have used half the sugar, and it would have been fine. I could not find a springform pan that was not leaky, and therefore just used a regular glass pie pan. It worked fine, but be sure to grease it very well. I used a thin metal spatula to help turn it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "Very tasty and easy. Use butter. Use a springform pan. Would have been prettier without the blueberries, they glopped everything into purple mush so you couldn't see the pattern of the plums. Served with custard and ice cream, it only serves 6 unless everyone is eating daintIly. Luckily I made an extra one, full recipe but in a loaf pan. Worked great, just slightly thicker cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele1981"
},
"reviewBody": "I took the advice of another baker and melted the butter and sugar on the stove and used a springform pan. My family and I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This cake was fantastic and would be delicious as written. I omitted the blueberries because I didn't have any and it really didn't need it. I did add about 1tsp of cinnamon to the flour and soured the milk (I would have used buttermilk if I had it) using a capful of vinegar and letting it curdle for about ten mins. I also used butter instead of margarine. The result was a beautiful, super moist, fluffy cake with a tart, caramel topping that my family would not share. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrnarevixen"
},
"reviewBody": "This cake is perfect. I mean, it's a showstopper, it's simple to make, and it's so, so delicious. I subbed blackberries for the blueberries, because I went blackberry picking today, and it turns out no one in my house actually likes blackberries. I was only able to fit about 2 and a half large black plums in the cake. I sliced each into about 16 slices, so about 40 slices of plum did the trick around the circumference of the pan, and I arranged about 10 gigantic fresh blackberries in the center. The batter made a wonderful, buttery, rich cake. It turned out perfectly. \nI would say, use butter instead of margarine, because why not! I actually used salted butter. Thumbs up! Wowzer. Going to make this again, but next time I will use fresh peaches and raspberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Rideout"
},
"reviewBody": "I made this and my husband loved it, even the next morning he was still raving about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Belb"
},
"reviewBody": "I found this cake to be to sweet. Also I left it in for way longer than 40 mintues and the center was still raw batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annmintz"
},
"reviewBody": "I made this cake twice, with mangoes and blueberries instead of plums, and it was fabulous both times. Cakes are not my long suit and I was delighted with how it turned out-- light, delicious, just sweet enough but not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetBigMomma"
},
"reviewBody": "Easy and yummy! My family of five gobbled it down! Only used plums and added the 1tsp of cinnamon as others suggested. I didn't even slice my plums pretty because they were too soft but it didn't matter because the taste was all that did!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mardi Warner"
},
"reviewBody": "I made a double recipe because only one cake layer is not enough and it's easy to refrigerate and have later. Unfortunately, the cake came out very dense and soggy. I don't know if its something I did or what, but I don't think I'll take another chance on this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Retzlaff"
},
"reviewBody": "I've made this twice. The first time I followed the recipe but it was in the oven for 50 minutes nit 40. It still was not completely done in the middle, too juicy. The second time I used peaches instead of plums and baked it for 60 minutes. Much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darien Keane"
},
"reviewBody": "Loved it! Did not have blueberries so I made it with plums and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aileen Espinoza"
},
"reviewBody": "Great recipe and very easy to make. The only change I made was to use butter instead of margarine. Liked it so much I made the following day as well. I didn't have anymore plums so I made it the second time with blueberries and blackberries and it was just as good. This recipe is a keeper :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colleen Cahill-Kingery"
},
"reviewBody": "This was not only a beautiful dessert for a potluck but I gave recipe to 5 people! I also used a springform pan for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Wiese"
},
"reviewBody": "no changes except - only 2 plums to go around the edges of my 8x8 pan but I think I could have done a double layer and it would be just fine and I had to cook it 10 minutes longer than the time listed. Turned out great - pretty and delicious! we will be making this again. thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nerem"
},
"reviewBody": "It was a really easy recipe. Loved making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rowena Burdeny"
},
"reviewBody": "I only used plums, I chose to not put in blueberries. It was delicious and will make this often....especially when the plums are in season. Peaches would work as well.\nAnd the cake is perfect.....just a light dusting on top of cinnamon and sugar mixed.....and voila, perfect....\nI am going to try freezing it and reheating it on the weekend\n(after eating 1/2 of it tonight)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Sullivan"
},
"reviewBody": "I've made this in a cast iron skillet and a springform pan. Turns out great with both, but prettier with the springform. Love this cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HAKELLYJK"
},
"reviewBody": "Add 1 tsp. cinnamon to flour mixture. Substitute yogurt for milk. Use butter, not margarine.\nDouble the butter/cinnamon mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Kuznetsov"
},
"reviewBody": "A hit, every time! Just be sure to cut the fruits thin. Otherwise they won't be soft enough. Also, I'd cut the sugar by a third or half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimbochica"
},
"reviewBody": "It turned out pretty good. I look forward to playing with the recipe a little bit based on everyone's suggestions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "We loved this dessert. I used half butter/half applesauce as I do in all my baking to keep it lighter. I also used Almond milk. These were the last plums of the season and so sweet that I cut the sugar in half. I also added blueberries to the top. It was scrumptious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "The cake was very good but I followed the advise of another baker and used a spring form pan which was a big mistake. Half way through the baking time the butter started leaking out all over my oven. Also had to bake for 60 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jena-licous"
},
"reviewBody": "Perfectly delicious. I followed the recipe but added vanilla bean paste and only black plums. Everyone loved it. I served it upside down so people could enjoy the beautiful design of the swirling plums. \n\nNOTE: the cake gets a wonderful crust when baked. Having that crispy texture is what makes this recipe stand out. Flip the dessert after 15-20 minutes onto your serving platter and serve immediately or you'll lose that crispy bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Thomson"
},
"reviewBody": "I followed the advice of many other reviewers and doubled the butter/sugar in the bottom of the pan. Also used peaches because that's what I had. This turned out absolutely beautiful, it could've been in a magazine or cookbook. It tasted nothing short of incredible. Sooo so delicious. I especially liked it cold from the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dan bates"
},
"reviewBody": "Wicked easy, tasty. I didn't have any blueberries on hand, but only 2 giant plums. The blend of flavors was very good. Going to try with whipped cream next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Very very good. Instead of melting the butter and sugar in a springform pan, I used a cast iron skillet and cooked it over the stove, then baked the cake in the skillet. I also doubled the butter and brown sugar. Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakingmama"
},
"reviewBody": "Perfect. Loved it, loved it. Have made several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissK2013"
},
"reviewBody": "Delicious!!!! I followed the recipe exactly and everyone loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tetya"
},
"reviewBody": "It was pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bern"
},
"reviewBody": "This is delicious....it looks so appetizing and it tastes wonderful with the combination of plums and blueberries. It makes a beautiful presentation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Renee Gandy"
},
"reviewBody": "My family absolutely loved this! It was gone within a few hours! :) so easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa O'Neill"
},
"reviewBody": "Excellent to make gluten free too. Fruits blend nicely for a cake that is not too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princessmommy73"
},
"reviewBody": "I made this recipe today. I bake quite a bit but this was my first go at an upside down cake. I subbed butter for margarine and I added some cinnamon to the flour mixture. My store was clear out of plums so I used apricots and blueberries. I had to bake a total of 50 minutes until my cake tester came out clean. I let it sit the 15 minutes stated in the recipe after coming out of the oven. It popped right out of my pan when I inverted it! I had sprayed a 9 inch cake pan with butter flavored cooking spray. I will make this again with whatever fruit is in season! I can't wait to try it with thinly sliced apples in the fall after we go apple picking and have an over abundance of apples!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizziebella"
},
"reviewBody": "Turned out fabulously! My boyfriend has a dairy allergy so I used almond milk and vegan margarine. Loved how pretty it looked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia Treadwell Griffith"
},
"reviewBody": "I've made this a number of times and it never fails to disappear too quickly. This time I made it w/a gluten-free flour and lemon extract instead of vanilla. Also greased the pan w/coconut oil. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M_Lensenmayer"
},
"reviewBody": "Just made this cake with these modifications: Doubled the brown sugar and used butter instead of margarine, added fresh blueberries, lemon zest and nutmeg to the batter, Substituted sour cream for milk and used an abundance of red plums. Previous comments were very helpful. Cake turned out great-very moist, light, lemony flavor. After 40 minutes cake appeared done when poked with toothpick on the bottom. After flipping the cake I found it was not done-very gooey so I put it back in the oven for another 30-35 minutes before it passed the toothpick test. Might have been the juiciness of the fruit. In the end it turned out very good. Might want to monitor cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "namelessunday"
},
"reviewBody": "The first time I made this cake I omitted the blueberries and used Santa Barbara plums.. it was superb. Since then I've made it with blueberries included, with pineapples, with nectarines, peaches, and several different kinds of plums. I use almond milk since I am dairy free and it comes out excellently. Did I mention I first made it two months ago? I've made this cake literally dozens of times since. The plum and blueberry combination is great but the cake base is very very versatile. I've memorized it and it is my go-to. Definitely worth a try. A+."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie"
},
"reviewBody": "Excellent! My husband loved this recipe. I didn't have plums, so I used extra frozen blueberries. The only other alterations I made were to use butter instead of margarine, double the butter and brown sugar per other reviewers recommendations, and add a teaspoon of cinnamon to the dry ingredients. I also always make my upside-down cakes in a cast iron skillet for crispy edges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hilla"
},
"reviewBody": "excellent cake. I made it with a combination of plums and nectarines and it was great. I think you can safely use any fruit you have at home with this recipe and have a great result. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hj"
},
"reviewBody": "Yummy. Just enough moisture / fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie C"
},
"reviewBody": "I doubled the brown sugar and used all pitted, halved, Italian Prune Plums and put them skin side down against the bottom of the pan. I also followed the suggestion of adding 1/4 teas. of cinnamon. Cardamom would also have been good. I used an 8\" springform pan which made the cooking time a little longer. The cake took at least an hour to bake. To get the bottom of the pan off the cake I slid a piece of dental floss between the pan bottom and the cake after it was inverted onto a plate. This is a delicious cake and would work great, I think, with cherries and almond flavoring or any other fruit which appeals to you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdeal"
},
"reviewBody": "This was wonderful! I did have to bake it 45 mins., instead of 40 as directed. I also used butter instead of margarine. Other than that, I followed the recipe. Very moist and great flavor! I will make this again! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lukenlori"
},
"reviewBody": "Made for Paul Walkup's 21st bday with plumbs only. Sifted cake flour and added a little more br sugar for topping. Didn't taste but it looked good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebecca"
},
"reviewBody": "love it. made a couple subs, per what i had in the kitchen. used 1 cup whole wheat and 1/4 cup bread flour. also, used a duck egg, which is bigger than a chicken egg and richer. no bloobs on hand, so it's an all-plum affair. i used a square baking pan, put a plate over it, and flipped to get it out. stayed intact. yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luchinka"
},
"reviewBody": "The cake was nice and light. I used butter instead of margarine and added a bit of lemon zest to the batter for extra flavor. \nI did find it too sweet (it burned in my throat). Will make again but definitively cut down on the sugar next time and take advantage of the sweetness from the fruit itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SheilaP1"
},
"reviewBody": "Yum! Made exactly as written!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23730/plum-blueberry-upside-down-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17532/desserts/fruit-desserts/blueberry-desserts/",
"name": "Blueberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23730/plum-blueberry-upside-down-cake/",
"name": "Plum Blueberry Upside Down Cake"
}
}
]
}
}
, "about": [
]
}
]