				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Polenta"
,"datePublished": "1999-08-15T23:23:08.000-04:00"
,"dateModified": "2022-07-14T16:29:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "This recipe is for the polenta novice. Two ingredients - polenta and water. So if you can boil water ...you can make a fabulous pot of polenta. Every time!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IE2ROuIfqmZuNayqbxFetHWyYY0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/681176-19fdf3dff3164ed8b0ea30579cb1e6cc.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Polenta"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "92"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "110 kcal"
,"carbohydrateContent": "24 g"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "11 mg"
,"sugarContent": "0 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"3 cups water",
"1 cup polenta" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring water to a boil. Reduce to a simmer. Pour in polenta steadily, stirring constantly. Continue to stir until polenta is thickened. It should come away from sides of the pan, and be able to support a spoon. This can take anywhere from 20 to 50 minutes. Pour polenta onto a wooden cutting board, let stand for a few minutes."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was my first time making polenta. I used regular cornmeal and added garlic powder, 1/2 cup parmesean cheese and a about a 2 inch chunk of butter. After it was cooked I put it in a 9 x9 dish, refrigerated until cool, cut into pieces and sauté in a little olive oil until lightly browned on both sides. I served with a tomato, spinach, onion, garlic and roasted red pepper topping and shrimp. Last night I poured half of the recipe into 9x9 dish, spread ricotta cheese then top with the rest of the polenta. Refrigerate until cook, cut in pieces, fry, top with red sauce and caramelized onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did this receipt; however , I tweaked it a bit. I added the liquid ( milk instead of water and chicken broth. ). I added a tablespoon of butter. Salt and pepper to taste. I used 3 min polenta. I cup of polenta. Add slowly while whisking. My cheese was 1,000 day Gouda (1cup) and 1/2 cup regular Gouda. Poured it into a pie dish. Let get cold. It will firm up and you can fry it. This was my second ever making it. Secret is to get a good smoky cheese. Use your favorite. Experiment with flavors. I love this receipt as a start of a long time cooking meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debhorvath30"
},
"reviewBody": "My Italian family substitues chicken broth for at least half the water. Before starting the water/broth brown onions, then fry some hard salami that's been cubed and drain both on paper towels. Also cube brick cheese, or other mild white melty cheese. Stir into polenta when it's nearly done along with some heavy cream. Allow to cook further until cream is absorbed. When pulling away from pot and firm, turn out on to wood board covered with a clean cotton towel in center of table. Pull sides of towel up over top to help it hold its shape and let it sit for 10-15 minutes. It will still be very hot. This is not a grits style of polenta. It should hold its shape. It's excellent with chicken cooked in a red sauce and spooned over the polenta or pork and sauerkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julie hammond"
},
"reviewBody": "I give 5 because the ingredients are correct for a basic polenta recipe. Use your brain though and do not follow instructions. Recipes are just a basis starting point. You literally just boil the water (spiced, if that's what you want), remove from burner and whisk in corn meal. That's it, no cooking involved. I refrigerate to firm, but only because I want to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vitaminp63"
},
"reviewBody": "Pretty good, super basic, easy, much stirring but I felt accomplished as a beginning cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jajam"
},
"reviewBody": "To the people who think cornmeal equals polenta, that is not so. Polenta is also known as corn grits, a very coarse kind of ground corn which makes a very creamy cooked polenta, Which the finished product is also called. This is a standard recipe, and the proper way to make it. I’ll try to post a picture of polenta and cornmeal side-by-side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen"
},
"reviewBody": "I did not make any changes and I will make it again. It came out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Ruderman"
},
"reviewBody": "I stuck to the basics on this one. I topped it with NOLA shrimp. They went away together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naturelover"
},
"reviewBody": "This was very good. I only used two cups of water,because I wanted it a little thicker. I boiled one cup of water and mixed the other cup with one cup of cornmeal and slowly added it to the boiling water. Served it with Osso Buco. I also salted the water a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlene S Noto"
},
"reviewBody": "purchased Golden Pheasant polenta instead of my usual corn meal. It is more coarsely ground than standard cornmeal. I cooked it once like regular corn muffins and it was a bit dry and mealy. i didn't care for it. Should have followed these directions first. will try again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "goofygirl"
},
"reviewBody": "Yes I used regular cornmeal and it worked fine with a shorter cooking time,, I think you might be able to use grits however I don't know if they would set up the same way that regular cornmeal does. Top with pasta sauce and parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosalind Brazel"
},
"reviewBody": "You'd have to be a candidate for worst cooks in America to screw this one up, but helpful all the same!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pjb3655"
},
"reviewBody": "This is a good recipe to put in a category that I call \"reminders\". In other words, about how much liquid to cornmeal I need. I like these things because when I'm throwing together a meal as I am tonight, I think \"I can't remember what the ratio of grain to liquid is.\" Bingo. I think something like this is for a more experienced cook than a novice. A novice would be very disappointed in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CaraRomaniaLeigh23"
},
"reviewBody": "I made this for the first time after my trip to Romania, over there it is also known as Mamaliga! I found the best way to add the cornmeal gradually into the water after it had boiled, that way you arent waiting ages for a watery mixture to go thick, i then added sheep's cheese, gave it a very rustic \"straight from the farm\" taste. I cannot wait to try variations!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aaba"
},
"reviewBody": "Did not make any changes, loved it&gt;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Fanznanz"
},
"reviewBody": "I use the ratio of water to polenta 5 to 1. So, if you use 1 cup of corn meal you need 5 cups of water.\nThe other thing I did was mix 1 C corn meal with 5 C water about an hour before I planned to cook. This gave the corn meal time to absorb water. \nThen I placed it on the burner and within about 30 minutes had a bubbling pot of polenta. The presoak seems to make a tremendous difference in the cooking time. \nHope this observation helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "burnice"
},
"reviewBody": "I grew up with polenta. we ate it hot mixed with fried onions or bacon. the next day mom would slice it and fry it. sometimes I make it instead of mashed potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryna Anton"
},
"reviewBody": "When I was little, if there was leftover polenta, my Bubby would cube it up and put it into chicken broth with some spinach, instead of rice or noodles. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "Good basic recipe. I have been.making polenta for years, learned from my parents. It tastes better if you use coarse ground corn meal ( I found it at Sprouts, Whole Foods and also packaged by Red Mill ). Salt the water like you would for pasta, add meal to boiling water using a whisk to break up lumps. Mix often with a sturdy wooden spoon, it needs to cook at least 30 min or it will taste raw. I found 1 to 3 ratio to be good, it will thicken as it cools. Using less water will make it very firm and hard to mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzana"
},
"reviewBody": "First, this recipe lacks one ingredient - SALT. You should add a pinch of salt to the boiling water (at least here, where I live, corn meal is sold as is - not pre-salted). \nSecond - cooking time depends on the type of corn meal (so called \"instant\" corn meal takes just a couple of minutes to cook, while regular cm takes much longer. However, both types need constant stirring.\n\nHow to \"upgrade\" the dish?\nYou can add in a little of butter or grated parmesan cheese (or both) while stirring. Then you can pour cooked polenta into a dish of whatever shape, put it in a cold-water bath or just let it cool down completely, then turn over onto a cutting board, cut into slices and arrange them into a baking dish (ceramic or glass) - a slice of polenta, a slice of cheese and/or ham and so on) ... Mix an egg or two with some cooking cream and pour over the slices and bake in an oven until sizzling and golden brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I added a good pinch of salt to the hot water, before adding the corn meal. I served it with cheese melted in it and sprinkled Louisiana hot sauce over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fancy Nancy"
},
"reviewBody": "I cook polenta in a crock pot. I use 3 cups of cold water or stock mixed with 1 cup of corn meal and cook it in a small crock pot on low for 4 hours or more. When fully cooked and the water is absorbed I mix in any other cooked ingredients (like cooked corn or sauteed mushrooms or cheese)and pour into a 7x11 brownie pan and refrigerate until firm (at least a couple of hours or overnight). When ready to serve I cut the firm Polenta into squares or triangles or circles and pan fry in a small amount of butter or olive oil for 3-5 minutes on each side until brown and crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KimD"
},
"reviewBody": "way too much water!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "this cooks up way faster than the recipe says. But I love this for the ratio of water to cornmeal since I never remember that! This recipe is spot on. :) A bit of salt and pepper and this is a really awesome staple. Very economical too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ"
},
"reviewBody": "Great basic recipe. Grew up with parents who lived through the depression. Everything was used, even empty cans. Remove both ends and press your polenta into it while still soft. Chill and then push it out and you have wonderful, round polenta that looks great. Use some Press and Seal wrap on one end. We enjoy polenta fried with butter and maple syrup in the morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mallie"
},
"reviewBody": "In Indiana we call this mush. You can slice it and fry it. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Therese Miller"
},
"reviewBody": "If you want to make \"Authentic\" polenta you must use polenta corn meal.. not just regular corn meal... its a courser grind than standard corn meal. It may be hard to find in your area .. best bet to find real polenta is a Italian market, Whole Foods or if you are fortunate in the ethnic section in a grocery store. the 3 to 1 ratio is good tho you need to add plenty of salt to the water since the polenta will soak it up fast. Stir constantly until almost done to avoid lumps. Once your polenta is almost al denta stir 2 tbls. butter to it and serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ireland"
},
"reviewBody": "In Jamaica we boil down coconut juice with garlic,green onion,tomatoes.let the liquid boil for a few minutes (with a scotch bonnet pepper ),take the pepper out before adding the corneal,and just let it thickens, covering the pot for about ten minutes making sure the corneal is properly cooked. BTW in Jamaica we call it \"tun cornmeal\" (turn corneal)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Overkamp"
},
"reviewBody": "Thank you to the person who explained what polenta was....I would have been one of the people wandering in the store looking for that product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Strange"
},
"reviewBody": "I used part beef broth, and it turned out just great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Food lover"
},
"reviewBody": "great with maple syrup or butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Micha Mi"
},
"reviewBody": "I haven't made polenta before, so my experience based on this recipe could have turned out poor since I could have been waiting 20-50 minutes for something to happen to make waiting that long worthwhile. It turned out that my polenta was ready in significantly less time and might have burned if I had kept waiting longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "1trinikitti"
},
"reviewBody": "I have to say this was really easy to make. I love corn meal and the things you can make with it and I always wanted to try polenta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Potts"
},
"reviewBody": "Basic Polenta..it's good. When I make mine I use all chicken broth or a mixture of chicken broth and water then add very crisp fried bacon and sharp cheddar cheese. I refrigerate the leftovers and make patties out of them in the morning and fry them up for breakfast. DEEEE-LISH!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DashAbout"
},
"reviewBody": "Polenta is soooooo good! Use to buy it in the store (because I didn't know any better) now make my own cheap and great with most anything, but I like it fried with maple syrup for breakfast, NOTE: I add 1/2 teaspoon of salt to kick it up a bit, but you can make so it tastes best to you.\n\nRegards"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Freid"
},
"reviewBody": "This is amazing ... I was raised on Polenta and didn't even know it!! Being from Swiss and German grandparents, polenta wasn't a staple for us. But my dad used to make \"cornmeal mush\" on the rare occasion that my mom would let him in her kitchen (the messes he made!). He'd then put it in a buttered bread loaf pan and into the fridge overnite. The next morning, he'd cut it into 1\" slices, fry it in butter until the edges crisped, and we'd eat it with breakfast sausages and maple syrup. Yum!! I've made it several times for my husband over the past 30 years ... and he loves it too. So now that I'm expanding my foodie horizons, I just looked up the recipes for Polenta, and Voila!! Thanks, Dad, for introducing me to my very first Italian comfort food ... even though neither of us realized it!! (If serving it with butter and maple syrup wasn't part of your childhood, TRY IT ... you may love it!!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seattle2Sydney"
},
"reviewBody": "Very easy, just what I was looking for. I added a bit of soup flavor to it for taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pamela Fowler Sweeney"
},
"reviewBody": "Polenta is easier to make thana glass of chocolate milk! Making a marinara sauce took some time, however this meal got A+ reviews from my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kelley Moore"
},
"reviewBody": "\"20-50 minutes\"?!?! Once the water was boiling, it took about 5 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinBug"
},
"reviewBody": "So quick and easy!! This was my first time eating, let alone making, polenta so I didn't know what to expect. Super easy to do and the add-ins are endless! I just made it plain this time, but fresh rosemary, basil, thyme, sundried tomatoes, or roasted red peppers would be great additions. I put plastic wrap in a small cake pan and poured it in there to set. Chilled it overnight and then used to make Angie's Polenta Lasagna from this site. Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jake"
},
"reviewBody": "I bought a bag of polenta, yes, that's how it was labeled, and saw immediately that it was nothing but cornmeal. If you want other recipes, look up cornmeal mush because that's all polenta is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Genoa"
},
"reviewBody": "I made this today and it was really easy. A big thanks to those reviewers who pointed out that you make it with corn meal. I added 1/2 teaspoon chopped fresh rosemary and 1/4 teaspoon salt when I was cooking it. Then I let it cool, cut it into wedges, lightly pan fried it, and served it with a home made tomato sauce and cheese. It turned out great and my boyfriend loved it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeepaholic"
},
"reviewBody": "This was delicious! After it was cooked and cooled I sliced it into servings and pan fried it then spooned fresh tomato sauce over and sprinkled parmesan cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smbilleck"
},
"reviewBody": "Delicious and really was easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pkd99"
},
"reviewBody": "The first time I've made polenta...this worked out well. It just took me about 15 minutes. I did add salt to the cooking water. Pouring out on the wooden board to cool for awhile firmed it up nicely. I served my chicken cacciatore (with chicken in small pieces) over it and we all thought this was a wonderful combination. I'm already looking for my next polenta recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "src"
},
"reviewBody": "polenta is yummy! i love it! add a bit of honey for sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Benjamin"
},
"reviewBody": "THE classic Italian comfort food, IMHO. And unlike other starches that one can dress up like pasta or rice, polenta does NOT suck most of the flavor out of the sauce you add do it. I would even go so far as to say it enhances it. Asf for finding something called 'Polenta' in the store, some have said no such thing exists, rather it is Corn Meal you seek..Well, this is only half true. Italian Delicatessens and probably some upscale markets do sell a product called 'Polenta' which is considerably more coarse than ordinary Corn Meal. Corn grits are closer to Polenta than corn meal is..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer DeFosse"
},
"reviewBody": "I was excited to try this, but mine never did firm up. Next time I make it I will reduce the water to two cups. I was in a hurry when I made this- I wish I'd taken time to read the reviews first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Theman"
},
"reviewBody": "Polenta flour is an actual ingredient and I am sure this is what the cook intended on the recipe card. Corn meal is a substitute for polenta flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DeadlyAlize"
},
"reviewBody": "Ok you got three stars because polenta is NASTY made with just water IMHO. however, using chicken or beef stock * or boullion* makes it better. you can even use vegetable stock. play with the recipe a little bit and you have the outer layer of your tamales. to answer the question about how to it cylindrical, use a clean empty coffee can * a small one*. grease the inside, add the prepared polenta, let it cool, use a can opener to cut off the bottom and push it out and slice it. my family always fried it in a little bacon grease. my dad would add shredded pork to it while it was cooking and then slice and fry it. hope this helps you out. another thing to get rounds, pour it out on a shallow cookie sheet, let it cool then cut it with a cookie cutter. just remember to grease the pan so it comes out easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsmaggiehunter"
},
"reviewBody": "fantastic base recipe - you can use any combination of stuff to dress it up! mine cooked in much less time though - more like 5 mins then 15!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Villanueva"
},
"reviewBody": "Very easy to prepare, mine is usually done in around 20 minutes. Tastes great after chilled overnight, this is a great starter. Do not use masa! The flavor will be completely off. Course cornmeal is the way to go, or if you prefer regular will work and seems lower in calories. If you buy cornmeal that says \"polenta\" it will cost extra just for these words to be printed on the box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rosabela"
},
"reviewBody": "This is a great basic recipe to start with, however, the cooking time is way off. Mine thickened up within a few minutes. My mom and I used to make polenta and she used to add some salt and a dab of butter for a richer flavour. NOTE: no need to reduce water. Keep stirring until it thickens and then let it cool a bit ... it will automatically thicken up some more. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Good starter recipe! I used 1/2 cup less water as suggested by some, put half the cornmeal in 1 cup cold water-brought remaining water to a boil, (to which I added a sprig of fresh rosemary and a little salt)-then stirred in the cold mixture. It cooked very quickly. Then folded in about a tablespoon cream cheese and 1/4 cup shredded cheddar-rolled it up in plastic wrap to be sliced later. Served hot medallions with red Italian meat sauce. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaz"
},
"reviewBody": "I agree with others who pointed out that this recipe could confuse someona who may not know that the ingredients are water &amp; cornmeal however what surprized me was that there were so many rather compex methods for adding the cornmeal. I have found that the best way to incorporate the cornmael is to use a wire balloon whisk. The trick seems to be the water, it must be at a full boil then just pour the dry cornmeal in a steady stream while whisking it...In two minutes it is ready. ...I have never tried quick cornmeal the regular inexpensive stuff form my grocery store works well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene Sledge"
},
"reviewBody": "Polenta...Golden Pheasant has a brand of corn meal called Polenta. Yes it's the finished product's name but it is also the name for the type of corn meal used. Regular corn meal is less coarsely ground! I am in a Itailian family from Italy. In making polenta from the \"real\" corn meal\" it takes quite awhile and some arm muscle to get the job done! This is great sliced thin once set and grilled with cheese added after removed from heat or add herbs &amp; cheese before it sets up. Chicken in a red sauce over this is delicious as well as many other dishes (sausage and onions grilled) or just get creative. Jazz it up! You can also serve before it sets and it is softer in texture. Chow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof3prettygirls"
},
"reviewBody": "Polenta and stew is my favorite family dish. My grandma always buys Italian Harvest polenta and I buy what I can find. Many grocery stores sell \"polenta\" in boxes and in bags. But yes you can buy corn meal too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Megan B"
},
"reviewBody": "The flavor was was rather bland. Next time I will try adding salt or some type of flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin"
},
"reviewBody": "Good starter recipe. You can always tweak it to your personal preferences. I like a denser polenta, so I used a bit less water. Unfortunately, it turns out my husband doesn't care for polenta, so I'll probably not be making it again. :-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "giovanna"
},
"reviewBody": "this is a great recipe...in defense of the original recipe...polenta can be used to describe the grain as well as the dish. i personally do not like 'polenta' made from the stuff in the blue and orange box at the store called 'cornmeal'. my mom grew up in a very italian home where polenta as they knew it was made with a very coarsely ground cornmeal. my understanding is that polenta is simply the italian word for cornmeal. if there's any way you can get very coarsely ground cornmeal...it's much more authentic as far as what the northern italians centuries ago used to eat and i think it has much more flavor than the finely ground kind. we've tried grinding corn in our large grinder (that we use for wheat) - and even the coarsest setting is significantly finer than the polenta we buy in bulk through the health food store. *Shrug* anyway...good recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CMW2"
},
"reviewBody": "I don't know what type of groceries that some shop in, but there is \"Polenta\" in italian food stores. This is a good basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Hill"
},
"reviewBody": "Great basic recipe. I used slightly less water than called for (which allows the cornmeal to thicken MUCH quicker-- approx. five minutes). I also added about 1/2 tsp. salt to the water. After thickening, I stirred in some chopped green olives, sun-dried tomatoes, and shredded parmesan cheese. I then sprayed a wax-paper lined cutting board with PAM, spread the mixture out, and let it cool. After 20 minutes or so, I hand-packed the whole thing into a log shape and sliced it into medallions. Then I pan-fried the medallions in olive oil. They were soooooo yummy, kind of like polenta \"fritters\" I guess. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcmeg12"
},
"reviewBody": "Simple and works. Keep stirring to keep the bottom from burning. You could also add a pinch of salt, much like you would to rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lora Davis"
},
"reviewBody": "This recipe is easy and yummy. I use these for breakfast. Once the polenta has cooled I cut with a round cookie cutter, freeze, thaw and brown in skillet as needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teleboy20"
},
"reviewBody": "Good recipe for basic polenta. Although a little vague, technically it is correct. Polenta refers to coarse-ground yellow cornmeal or the finished product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cookies"
},
"reviewBody": "The instructions are not very clear and may confuse some people...\"Polenta\" is the finished meal...\"Corn Meal\" is the ingredient that is needed to make POLENTA., also I use 2 cups of cold water to 1 cup of cornmeal for a thicker polenta. To diminish any concerns of lumps, just add some corn meal to cold water, stir then add it to the boiling water and stir constantly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy Weldon Barbusca"
},
"reviewBody": "In Romania, this is not cooked quite as long as this recipe says, and it is called mamaliga. We serve it with sour cream and/or feta-style salty cheese on top. It really is this simple, and it is a nice (and quicker) alternative to mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben"
},
"reviewBody": "I agree with italiangirl that this needs less water - you just need to cut the heat when you put in the cornmeal. I took it a step further and put in about an eighth cup chopped up sundried tomato and about 3 TBSP prepared jar pesto. (I got the cheap stuff for $2.00 at Wally World). Some people may need salt, but it tasted just fine. Turned it our into an 8x8 pan to cool so it would have some shape. I was trying to come up with a way to make it into a tube (cylinder), similar to what is sold in the store, but nothing really fit the bill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SOCCERPLAYR9999"
},
"reviewBody": "Very easy, but I only had to cook it for about 5 minutes until it was THICK. I used Quaker Yellow Cornmeal (Enriched and Degerminated)- I wonder if this is \"quick cooking\" polenta? Either way, it turned out good- I'm excited to fry some tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "appia9"
},
"reviewBody": "I've made polenta all my life and have never had it take that long to cook -- usually only a few minutes before it thickens up. It helps eliminate lumps if you mix your cornmeal to a cup of cold water, then add that to boiling water. Great with pesto, tomato and sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Cae Mc Inerney"
},
"reviewBody": "perfect base polenta.....smooth and creamy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corrine L"
},
"reviewBody": "Easy and tasty. I was tired of rice, potatoes and pasta and now have a new carb side dish. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISAPERP"
},
"reviewBody": "I use this recipe every time I make polenta because I can never remember the ratio. It works perfect every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanda"
},
"reviewBody": "I love polenta! The only difference is my great aunt uses 2 cups cold water to every 1 cup cornmeal. It makes a very firm polenta. This is the way I prefer it since I grew up with it this way. She only serves it with a red (tomato based) gravy but it is also good as a side dish to pot roast with beef gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SunFlower"
},
"reviewBody": "Thanks for the basic directions! I made polenta for the first time today and I found it very easy to prepare. Just follow these intructions to the t!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDVMD"
},
"reviewBody": "Simple to prepare -- next time I will add some sundried tomatoes and experiment with other seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca D'"
},
"reviewBody": "This was exactly what I was looking for. Just the basic directions for making polenta. Just add some tomato sauce, and away you go. Exactly the way my nonna makes it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KITLA"
},
"reviewBody": "Hey! It works! Cool! I added chopped sun-dried tomatoes, a little of their oil, let it cool on plastic wrap, rolled it, tossed it in the fridge for a while then sliced it, fried it and used it with the morrocan chicken recipe from this site. Next time, I'll try parm &amp; basil and put a nice red sauce over it.\n\nThanks so much, this has added a nice starch to my side dish recipes and staples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULIE COWEN"
},
"reviewBody": "Thanks very much for the recipe. Now I can make my own polenta at home without having to try to find it in my grocery store, and it tastes so much better!\r\n\r\nThanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple, yet very tasty. Using a gas cooktop, one needs only 15 minutes of stirring for the desired consistency. Thank you for the recipe , it added to our Thanksgiving feast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really enjoyed the home-made polenta I made with this recipe! I cut it into chunks about 2\" by 2\" and simmered it in homemade marinara for a few minutes, and it was terrific."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14067/polenta/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/223/side-dish/grains/",
"name": "Grain Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16769/side-dish/grains/polenta/",
"name": "Polenta Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14067/polenta/",
"name": "Polenta"
}
}
]
}
}
, "about": [
]
}
]