				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Polish Stuffed Cabbage"
,"datePublished": "1999-12-29T14:16:38.000-05:00"
,"dateModified": "2023-03-16T15:16:32.890-04:00"
,"author": [
{"@type": "Person"
,"name": "Christa"
,"url": "https://www.allrecipes.com/cook/24322143"
}
]
,"description": "Boiled cabbage leaves are filled with a mixture of ground beef, egg, and cooked rice. These are simmered for about an hour with tomato juice, vinegar, sugar, and water."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1TDUIJLiB1qc1_YQwajEF_FpN6w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-beauty-3x4-5ead78b279bd4270bceac70f81402941.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Polish Stuffed Cabbage"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "152"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "331 kcal"
,"carbohydrateContent": "20 g"
,"cholesterolContent": "95 mg"
,"fiberContent": "4 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "253 mg"
,"sugarContent": "9 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["Polish"]
,"recipeIngredient": [
"1 medium head cabbage",
"water to cover",
"1 pound ground beef",
"1 cup cooked rice",
"garlic powder to taste",
"1 egg",
"1 (12 fluid ounce) can tomato juice",
"1 tablespoon vinegar",
"1 tablespoon white sugar",
"water to cover" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6VROP_yYrKACBOkNVH0t90pUFUM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-1-89c942190f3f4b86a79d34cabe30894f.jpg"
}
]
,"text": "Place the head of cabbage in a large pot over high heat and add water to cover. Boil cabbage for 15 minutes, or until it is pliable and soft. Drain and allow to cool completely."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yqFrurtckhHn-CFP0GiSo1JMXj0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-3-51090875be9c4fac805c9237ebda1f2f.jpg"
}
]
,"text": "Remove the hard outer vein from the leaves."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aoIGDg6woWvnWiUIDqYfYWHH0sI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-2-ec312e85527c46a4a33a7be770e4b4ba.jpg"
}
]
,"text": "In a separate large bowl, combine the beef, rice, garlic powder and the egg, mixing well."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-SeQV0yo-efl2dS2bxs53kjTWsc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-4-dedb314d62e34598ba8a8c92f2d932be.jpg"
}
]
,"text": "Place a small amount, about the size of your palm, into the center of a cabbage leaf."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JIxCq1tRl90Yo-YmoAGnlsc5NXw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-6-4ec9f119d6b3493ea697f2c188f72605.jpg"
}
]
,"text": "Fold leaf over, tucking in the sides of the leaf to keep meat mixture inside."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hnPzQgcMSUbgb04XsxRakfW5d8Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16323-polish-stuffed-cabbage-ddmfs-step-8-96de5181b4064e1694fe7df45b6ad7c2.jpg"
}
]
,"text": "Pile up the filled leaves in a large pot, putting the larger leaves on the bottom. Add the tomato juice, vinegar and sugar and enough water to cover. Simmer over medium low heat for about 60 minutes. (Note: Keep an eye on them, making sure the bottom of leaves do not burn.)"
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Warren Jr"
},
"reviewBody": "Just a general FYI. After reading several comments I just wanted to make a remark or two. It's a Polish version, not Italian or something extra flavorful. Very simple because they had simple ingredients. I use a medium onion and two or three cloves of garlic chopped then cooked golden brown in butter instead of the powders. You will be much happier with the flavor. I don't add the sugar or vinegar. Instead, I do add a 1 tbs of parsley. Salt &amp; pepper needs to be added to flavor. I say that because you may like i it saltier or less depending. Salt your rice when you cook it because if you don't the rolls will be bland. Don't completely cook the rice. You want it about half cooked. Rice to hard &amp; it sucks up the juices, and your rolls will be dry. Completely cooked rice &amp; when you bake or cook them in the pot, the rice will be mush and the inside doesn't hold together correctly. There is no reason to pre-cook your meat before stuffing. It will cook over the hour, adding its juice to the rice and the tomato soup/sauce. My sauce is a can of condensed tomato soup with just over 1/2 of the cabbage water added. Mixed with a pinch or two of salt, pepper, and the littlest bit of oregano, maybe 1/4 tsp. I bake mine in a single layer like my grandmother did. Covered with the tomato soup mix. The can of soup is just enough to cover but not drown the rolls, and since the meat mixture adds it juice to the mix you will end up with more \"sauce\" then it originally looks like. Cover tightly with aluminum foil &amp; bake for 1 hour @ 375°F., and then take the foil off at the last 15 or 20 minutes to help the top brown. You can even brown under the broiler to get the tops crispy. Internal temp of the roll should be 160/165° F. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebekkak"
},
"reviewBody": "I had never made these and I’m 1/2 Polish. I thought the recipe sounded complicated, but it’s not. You just need to boil the cabbage and cook the rice first. My family liked it. I’d definitely amp up the garlic and spices though. Had other recipes that were baked and it comes out dry. My mom used to make them in pressure cookers i think. Steamed..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lady Texan"
},
"reviewBody": "I made this but wasn't sure if I was supposed to cook the rice first or not so I didn't. I think the prep work took more like an hour with having to boil the cabbage first. I didn't have any tomato soup so I used tomato sauce instead which tasted good. I also added sauerkraut and a whole lot of garlic. Overall, this was a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "The family enjoyed these! I agree with those who said to add some seasonings to the meat mixture, like garlic and salt. I used savoy cabbage, so these came out so tender and basically falling apart...they just melted in our mouth-yum! Thanks for sharing ?? September-2020"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Osiecki Difucci"
},
"reviewBody": "Great! I didn't use the egg and I used 1/2 ground pork and 1/2 ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "marz"
},
"reviewBody": "I used tomato juice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresha Weinkein"
},
"reviewBody": "First time making. I had to substitute marinara sauce for the vinegar and sugar mix. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Badpuddy"
},
"reviewBody": "Very good. Even better reheated. I used bloody mary mix instead of regular tomato juice. Made it a little spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roger"
},
"reviewBody": "Made it per the recipe and will make it again. Personally I will kick up the roll ingredients a bit. Maybe add sausage to the mix or garlic. Used Wolfgang Pucks tomato Bisque soup. that helped and gave the sauce a nice tang."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DLF"
},
"reviewBody": "I also used ground chicken instead of ground beef and brown rice. I just used balsamic vinegar to get the vinegar and sugar in. I shredded some of the cabbage and put it in some tomato sauce until it wilted, then put the stuffed bundles on top. I put everything in the oven, covered st 350 for an hour. Came out great! Next time I will bump up the seasoning though. It was a little bland but the tomato sauce and balsamic vinegar caramelized well together and made it tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colledge"
},
"reviewBody": "the best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keeper"
},
"reviewBody": "just like grandma its fabulous\nThank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alistaire MacIntyre"
},
"reviewBody": "I made this recipe for a roommate of mine who said his grandmother used to make stuffed cabbage and that's the only way he would eat cabbage and when he got done eating the stuffed cabbage that I made from this recipe he said it was just like his grandmothers so thank you I will be doing this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "critter"
},
"reviewBody": "This was very bland. If this is really just like what your grandma's made for you I feel very sorry for you and your whole family.\n\nI added some mushrooms, fresh garlic, onion powder and paprika to the meat mixture to give it more flavor, and it was okay. Much better the next day.\n\nWithout that this would've been a waste of calories, if you like understated food then you might like this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyle Huber"
},
"reviewBody": "I don't know much about Polish food but these are amazing. I did make a few small adjustments. I baked at 350 for 90 minutes instead of simmering on the stove. I added salt, pepper, and 1/2 an onion to the filling. I also used 1.5 tablespoons of sugar and vinegar. I also used canned tomato sauce since I wasn't too sure about canned tomato juice. Will be making again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aleiv58"
},
"reviewBody": "too addictive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "srinner"
},
"reviewBody": "I added a small diced onion to the hamburger and a little worchestershire sauce. Instead of using tomato juice, I used spicy V-8. I rolled them and put them in a deep rectangular pan, covered it with foil and baked at 350 for an hour. It was great! Not too spicy - I was worried about that but it was just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roy Dumond"
},
"reviewBody": "I am trying this recipe now and im sure it will be delish. I just wanted to point out to the people who used tomato sauce instead of juice that this is a eastern european recipe . I always try the recipes to the tee first . then if I think it needs adjusting I'll do that next time. I'll post my review tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Barbara Challice"
},
"reviewBody": "Cooked this recipe and followed direction faithfully. There seems to be several things missing. Salt? Pepper? Onions? There was absolutely no flavor to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kass"
},
"reviewBody": "I didnt freeze my cabbage. I just boiled the leaves till they were soft. And I used tomato sauce instead of soup. Great recipe though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "I have made this recipe a few times and my whole family really enjoys it. My Polish grandmother made stuffed cabbages but I only had a vague memory of the flavor. Recently, I had the opportunity to visit Warsaw and fell in love with the food all over again. This recipe is as close to grandma's as i can remember and much like what I had when I was in Poland. I would have given it a 5 but the sauce in the photo is a little misleading. To clarify for some of the commenters... 1. The sauce will not be thick like the picture unless you reduce it for about 10 min on med-hi after removing the rolls. It is not a necessary step unless you want thick sauce. 2. The meat is rolled uncooked...like a meatball inside a leaf of cabbage. 3. It is not supposed to taste garlicky... So don't over-do it with the garlic. It is not supposed to taste Italian. Polish food is warm and hearty, and the sauce is supposed to be mildly sweet. You should taste the parts equally... Meat /cabbage/tomato. 4. If you like your food salty... Add salt, it's as simple as that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "micheleb"
},
"reviewBody": "Thank you for the recipe. I wouldn't change a thing, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matthew10102"
},
"reviewBody": "Could have used more spices in the bowl mixture containing meat, rice, egg and garlic salt. Maybe some sea salt and white pepper. Jasmine rice instead of white rice would also be a better suggestion. Still awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "opihi"
},
"reviewBody": "Pretty bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dawn"
},
"reviewBody": "I was looking for a recipe similar to one my mother always made. (she passed away before I could get it and she never wrote it down). It was a sweet tasting cabbage roll with raisins. I chose this one because it sounded the closest to the one she made. I added raisins to the meat mixture, and also the liquid. I adjusted it a little by adding salt and pepper and also onions to the meat. Extra sugar and vinegar and used 16 ozs of the juice. It took alot longer then the 60 mins. Just keep checking it. It tastes close to what my mom made. Which made my children very happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sonya"
},
"reviewBody": "Great recipe but I tweeked it a bit. I had left over green and red bell peppers so I finely chopped a bit of them and added it to my beef mix. I added some salt and pepper. I lined the bottom of my pot with some of the cabbage that I didn't use for the rolls so they wouldn't stick. After the rolls were done cooking I pulled them out. I took the liquid which was a bit thin and all of the cabbage that lined the pot and tossed it into the blender with a tablespoon of flour to thicken it up. I put that mix back in the pan to reduce for a few minutes. When I've eaten this dish before the sauce is a little more sweet and tangy than mine came out. I'd add a bit more sugar and vinegar to get that tangy sauce I'm used to next time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane M. Coolbaugh"
},
"reviewBody": "I boil my cabbage instead of putting it in the freezer; the freezer method makes the cabbage stringy instead of soft. I placed the stuffed cabbage in my slow cooker and left it in too long resulting in a very dry filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "Excellent I used Quinoa and cream chease no meat was delicious family loved it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeartCooking"
},
"reviewBody": "I used lean ground pork and basmati rice instead of regular. The filling was extremely light and stayed together well.\nFor the sauce, I added canned tomatoes and thickened with cornstarch slurry after I took out the rolls. Once it cooled a bit, I added 2% milk. (My pictures are the ones in the white bowls with flowers)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "Instead of beef we always used pork and the rice wasn`t cooked. We cover the rolls in tomato soup instead of juice.Cook on top of stove for aprox 1 hour.Served with garlic bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "alleycat"
},
"reviewBody": "awful-----just awful"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "churchkey"
},
"reviewBody": "This is a great start but try this. Make your cabbage rolls any way you like, but cook them in a slow cooker. Layer some of the smaller leaves on the bottom to prevent burning. Make your sauce using a bottle of V8 juice, a large can of tomato soup, then a mixture of reg. Sugar and brown sugar. Make it as sweet as you want it. Pour a little of the sauce on the bottom then put in a layer of cabbage rolls. Put a layer of smoked sausage, which has been cut in thirds and sliced open lengthways, over the cabbage rolls. Sprinkle with a little saurkraut then continue layering until all cabbage rolls, sausage and whatever saurkraut is used up. Pour the sauce over all and cook on low for 6 to 8 hrs. I think you'll love the taste. Enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whirlaway"
},
"reviewBody": "Very easy. Very good. A bit blandish, but you would expect this from this kind of recipe. Hearty, good food. They all liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Binxy41"
},
"reviewBody": "Used my own tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelie Jones"
},
"reviewBody": "So good! I have to confess, though... I had no tomato juice, so I used a big ol' can of crushed tomatoes (NOT drained). And I cooked on the stove for 10 minutes then in the oven for an hour because I needed the stovetop for something else. Next time I'll be better prepared to follow this EASY and yummy recipe to the letter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merry"
},
"reviewBody": "Its a good starter recipe, We also green beans and cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyncha"
},
"reviewBody": "I think this recipe is excellent and authentic. Easy to prepare and cook. I add two spices from our family recipe that gives it an additional element of sweet and earthy: ground cloves and ground allspice berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "favabeens"
},
"reviewBody": "very good recipe, though I used napa cabbage because I like it better than the regular. Also aused fresh garlic and added half a chopped onion. I baked at 350, covered, in the oven for an hour. This recipe will definitely be in our dinner rotation. Very simple to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon"
},
"reviewBody": "I made this recipe, used sphaghetti sauce instead of tomato juice, added salt and pepper to taste, and baked it at 350 for 1 hour. I also used \"veggie crumbles\" instead of ground beef as I am vegetarian. My family LOVED this, even my husband who was afraid of the word \"cabbage.\" I am making it again this weekend for company............."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WEBUTANTE2K"
},
"reviewBody": "i lost my recipe for stuffed cabbage (it's here somewhere packed in moving boxes:) \r\nThis is very close to mine as i remember, but i use tomato sauce and brown sugar (i think 2 Tbs), garlic, onion pwd,s&amp;p.\r\nthis is SO delicious, THANK YOU for posting!!\r\nps...i also bake mine, which is easier for me. oh, and someone commented the inner leaves weren't cooked enough....just parboil the cabbage as stated, take it out of pot and remove the soft leaves, put the remaining back into the hot water while you're stuffing the larger leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janet Dieckmann"
},
"reviewBody": "I also put head of cabbage ,after coring, in the freezer. This recipe is similar to the way my Polish mom made stuffed cabbage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Happytown2000"
},
"reviewBody": "I have never made stuffed cabbage &amp; was very excited to finally try it! The preboil left the inner leaves still tuff. After reading the comments, I added onion &amp; garlic to the meat mixture along with a healthy amount of adobo. &amp; lined the bottom of the pot with leaves so the bottom rolls don't burn. I threw in a couple chopped up tomatoes on top. Cooked on the stovetop 40mins, then covered the pot leaving a small vent &amp; cooked another 35mins. Everyone loved it! Hubby asked for it every other week! Let me add... my son (who is 2) came back to the kitchen 5 times in 1hr to eat another serving of this! I still think the top rolls were a bit underdone (even cooked 1hr 15mins), but those are the smallest (inner) cabbage leaves. I am going to try it baked &amp; maybe more juice than water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Hubby liked it as is, the kids hated it and I thought it needed more tomato flavor/less tomato juice flavor. Perhaps some spices and fresh pressed garlic would help? Will make it again :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Meghan K."
},
"reviewBody": "I was really frustrated by this recipe. I had no idea what this was supposed to turn out like, as I have never had stuffed cabbage before, but my family adores the ingredients in this so we though we'd give it a try.\n\nI wasn't certain if I was supposed to cook the ground beef or not because the recipe didn't say, so I erred on the side of caution and prepared this with it cooked. \n\nGarlic powder 'to taste' is not enough information for someone cooking this for the first time. I like garlic, so I added it liberally. It was still not enough. Again, not knowing what the flavor was supposed to be in the end, it was frustrating.\n\nThe picture shows thick hearty sauce over the top, but it made no sense that that consistency could be achieved from just vegetable juice, vinegar, and sugar. But I trusted the recipe and positive reviews and made it how the recipe dictated.\n\nIn the end, I had a sort of tasteless watery tomato soup with cabbage pods submerged within. It needed salt, badly. \n\nI will not be making this again.\n\nHowever, I will be making an extremely loose adaptation with a robust marinara or spaghetti sauce and chunky veggies; and lots of garlic, onion, salt and pepper in the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janelle"
},
"reviewBody": "My husband has loved stuffed cabbage all his life. I made this recipe and would not change a thing!!!! He said it's the best he ever had...Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miseachel"
},
"reviewBody": "My first time making this. I was craving stuffed cabbage, even though I disliked it as a kid. Instead of calling my mom for her recipe, i used this. I could tell it was just a basic base for the dish, so I doctored it up just a bit. I used half g.beef and g.pork. I add some spices. garlic and such to the meat. I used plain tomato sauce, instead of juice. I like things saucy, so added a little more sauce than called for. Everyone ate it up. I'm making it again two days later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "The Wild Bunch!"
},
"reviewBody": "Bland and too much rice.. tomato soup didn't help either"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "Very bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "latrier"
},
"reviewBody": "BLAND! Good base recipe but needs much more than \"garlic powder to taste\". Lots of salt and pepper in the meat mixture. Also no need to cover with water, this made the sauce much too watery. If you cook with the lid on this will steam the rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ron"
},
"reviewBody": "this is a good one my mom was 100 percent Polish and mad them the same way just one thing differnt .She would use a pressure cooker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nalabud"
},
"reviewBody": "This recipe is very similar to the one that I make...with mine I use a dutch oven &amp; then proceed to bake it in the oven on 350 degrees for about 1-1/4 hrs covered...remove the cover &amp; bake for an additional hour. I also add in whole peeled tomatoes, use plain tomato sauce in place of the juice &amp; in addition to the sugar, I sprinkle the top of the cabbage with brown sugar. Delicious. People can never get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jacquelyn Gipson"
},
"reviewBody": "Love the pics. We just love cabbage and today I wanted to do it different. Its xmas. I told my kid its just an inside out eggroll. And we love eggrolls. Meat and cabbage. Tomato sauce is just another great taste. I added a little onion and used rice a roni and ground beef. I can't wait, its Christmas and it smells great. I stuff the cabbage and will put the sauce on in the morning and bake. Not much oil so pretty low calorie. A great recipe.I just cooled the rice and beef and blanched the cabbage. Merry xmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie C"
},
"reviewBody": "I made stuffed cabbage for the first time today using this recipe trying to imitate my grandma's stuffed cabbage. This was a good start, a little bland and I ended up adding a few more spices to the tomato juice. I then called grandma and she told me she uses tomato sauce instead tomato juice to add a little thickness and some extra flavor. Everything else is pretty much the same. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JenniferM"
},
"reviewBody": "This was good, but lacked a little flavor. Next time I will use my marinara sauce instead of tomato juice. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "simoneo333"
},
"reviewBody": "I have made this several times, excellent every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "userpr8403"
},
"reviewBody": "I just served this to my new husband with a baked potato and he loved it. Excellent recipe... Will definitely use it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melinda"
},
"reviewBody": "I also have never made stuffed cabbage before...It turned out good but my cabbage was a little tough and I think I should have added more tomato juice than water. My husband was very pleased with it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jersey John"
},
"reviewBody": "This was a good basic start for stuffed cabbages. Since it's apple harvest season now, I used 1 cup of fresh apple cider instead of the sugar, 1-1/2 TBS cider vinegar, and spiced up the meat mixture with fresh minced garlic, chopped onions, thyme, sage, and seasoned salt. Added 2 cups low sodium chicken broth to the tomato juice. A good time saver for the rice....we ordered takeout chinese dinner last night and ordered an extra qt of plain white rice for the cabbage rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Georgiann"
},
"reviewBody": "I cook this last night. First i started it out on the stove top. Call it old school, all my famliy bake this dish. So in the oven it goes. I added more tomatoe jucie,a dash more salt in the meat. Alright,passed the man test."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "StpFschr"
},
"reviewBody": "The sauce with this dish is way to thin and bland!!! Use canned tomatoes with their juice and do not add water or use just tomato juice. The filling is good but the garlic flavor gets swamped if too much liquid is used. ( I am a garlic lover)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Great dish. I would pass this on to friends. Thank You, Carol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maryjane27"
},
"reviewBody": "Yum! First try at making stuffed cabbage...my Polish grandmother would make it all the time when I was a kid and I would never have any...it was 'too stinky'. Now, I decided that I'd give it a try. I'm glad I did. I used crushed tomatos (1can) and 1/2 a jar of pasta sauce in place of tomato juice...but next time I'll try the juice...as that what grandma says she uses. Also I baked at 350 for a bit over an hour. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pa18sher"
},
"reviewBody": "I gotta admit, I doctored this from the get go but the basic recipe was really good. I used turkey sausage and added a little bullion to the rice (1 cup uncooked) water. I also used V-8 juice, because that's all I had on hand. Used 2 tblsp vinegar. It was a huge hit. Really tasty and needed no other seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlene Murphy"
},
"reviewBody": "I took others suggestions and used a jar of basil, garlic marinara to top it. I also chopped fresh jalapeno and added it in the ground beef mixture. I baked it in a casserole dish at 375 for 60 minutes and served it with white rice. My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debbie"
},
"reviewBody": "I loved this recipe I am one that has been buying the frozen dinner type and never tried to make it myself although I am I absolute chief in the kitchen. I didn't follow the recipe all the way made some changes but stayed with most. I added pork and sauted onions and garlic and lots of paparika I also put this concotion in the oven but I believe it would have been better simmering on the stove top. This is diffentially a keeper. This is a basic recipe and really works. My husband had four rolls to my two but we have more and it's what's for dinner tomorrow night or a quicky lunch tomorrow afternoon. Cabanara is next and is truly a favorite in my house. Thanks for such a easy meal cooking up into a deligous meal. I also used campbells Tomato Juice and one can of tomato sause on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darlene"
},
"reviewBody": "I too used garlic (when I was boiling the leaves) and sprinkled the pieces in the leaves added the meat mixture. I put them in the oven with the sauce. Coved with foil and baked at 350. I also added some meatballs in sauce to the pan. I did not boil them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MizzWycked"
},
"reviewBody": "Very similar to what I had growing up. My father was German and Croatian, my mother is Japanese. Dad taught mom to make these but because he wasn't a fan of tomatoes, he asked her to substitute with cream of mushroom soup. Just follow your usual recipe but instead of tomato sauce/juice, thin a can of cream of mushroom soup with milk or water, pour over the cabbage rolls and bake or use your slow cooker. Give it a go, you won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AB"
},
"reviewBody": "Easy hint for the cabbage and easier than freezing -- measure water in pot (enough to cover cabbage), remove cabbage, bring to a boil, drop in cabbage (carefully), return to a boil then turn off heat and set a timer for 15 minutes. At the end of that time the cabbage will be cooked through and the outer leaves won't be over-cooked. Dump hot water and refill with cold to make it easier to peel the leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "I love cabbage rolls and this recipe is great..I did make a few changes, I added more seasoning to the meat mixture and instead of tomatoe juice, I used tomato soup (mixed with water)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nita"
},
"reviewBody": "I did love this. I remember eating this as a child. I needed to add a little Chalula to give it more flavour. My boyfriend wasn't impressed with this, so I have to give it 3 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Richard L"
},
"reviewBody": "I found this way too bland. Not enough sweetness or sourness. Next time I will at least double the sugar and vinegar, as well as try some other spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debbbiedoodlenoodle"
},
"reviewBody": "Very good, definitely use the tomato juice, not sauce and definitely season your meat as others suggested. I used a little dill, chopped onion and garlic powder in a ground turkey and pork mixture. Delish, hubby ate 7 rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeni"
},
"reviewBody": "This recipe is a keeper. Although next time I will increase cooking time a little. The cabbage still seemed a little \"tough\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alan718"
},
"reviewBody": "needs more seasoning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AMANDAIZCOOL"
},
"reviewBody": "This was the first time I have made stuffed cabbage, and this recipe was good, but not great. It was good because it was pretty easy to follow. What would have made it MUCH better would be for it to call for seasoning the beef/rice mixture before putting it into the cabbage leaves. When I was finished, the stuffed cabbage was extremely under-seasoned, so I had to add a ton of salt and pepper to each cabbage package. Had I added that in with the beef, I don't think it would have turned out so bland. I also added a little hot sauce the the finished product, which spiced it up just enough. This recipe is really lacking in flavor and could benefit from some seasoning! The tomato didn't really come out in the finished product...maybe tomato paste would help? Also, I think it could have used more vinegar. I think that next time I will find another recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2Maggie"
},
"reviewBody": "These were great - my whole family enjoyed them - just like grandma used to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carolyn"
},
"reviewBody": "Good recipe,I added chopped fresh dill to the stuffing for more flavor. It tasted alot like my moms (Gulumpkies?) did. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tyler0896"
},
"reviewBody": "Menio67 is absolutely correct. If you have to make changes, the one thing you don't want to touch is the tomato juice. It becomes something completely different if you use sauce, paste, etc. Personally I use onions but this recipe is easily close enough. Do yourself a big favor and stick to the recipe for this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wendellden"
},
"reviewBody": "After not having a lot of luck my one other time making stuffed cabbage (I don't remember why but I think it had something to do with not getting the leaves pliable enough) I am please to report that this recipe worked very well. I used a tablespoon of fresh garlic instead of the powder, and I used a 26 oz jar of spaghetti sauce instead of the tomato juice, vinegar, and sugar because I didn't have tomato juice. What clinched it for me is that by coring and boiling the entire head of cabbage, I was able to get the leaves off in one piece, and then I left them in the water until pliable enough to roll easily. Next time, I will try the tomato juice - my husband and I both noted that the spaghetti sauce was not like we remembered our Mom's Glopskies (my family) or Glumpskies (his family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zizi"
},
"reviewBody": "Very tasty recipe. But please add some saesoning to it or else you will have a bland meal. I added chopped onions, salt and peper to the meatpart. And salt and pepper, and 1 garlic to the sauce. My husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NusiaG."
},
"reviewBody": "Overall,stuffed cabbage is a great polish dish.However I use ground pork instead of beef,there is a better taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristian"
},
"reviewBody": "I made it with deer meat and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ethel jeffers"
},
"reviewBody": "great recipe! instead of tomato juice i used sweet and sour sauce. it was great. but you have to bake it instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "I had to give this four stars, it would have been five but I had to make a number of additions to the recipe. I used 1 pound ground beef and 1 pound ground pork, 2 eggs, parsley, salt and pepper. I baked it the oven for 2 &amp; 1/2 hours. This is always best served with mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I haven't had a good, not-tomatoey stuffed cabbage in a long time and hoped this would be it...but sadly it wasn't. Since this was my first time making the recipe I followed the directions completely and was very disappointed in how bland...almost tasteless...it was. I should have paid more attention to the people who gave it 4 or 5 stars - they all seem to have tinkered with the recipe so they were rating their own version, not the one posted here. Even my DH, who loves just about everything, barely ate any. I will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shynoon"
},
"reviewBody": "Just made it and my part Polish husband really liked it! My twist was adding cooked brown rice instead of white and adding some caraway seeds (supposed to compliment cabbage and help w/ digestion per German friend). Topped w/ sour cream before serving. Next time, I'll try it by baking or cooking in a crock pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MENIO67"
},
"reviewBody": "My grandmother always made delicious stuffed cabbage, and I have never had it anywhere that compared. I have always found it bland, and too tomato-saucy, which is more like Italian food, not true to the Polish style. This is the closest recipe I can find to Grandma's. If you are substituting tomato sauce rather than tomato soup or juice, you are doing yourself a dis-service. Stuffed cabbage is not meant to be drowned in tomato sauce. It is meant to be served in a thin juice. Also, the addition of the saurkraut like other reviewers suggested gives it a nice kick, which is what my grandmother always did. (You can even add a little into the meat/rice mixture for added flavor.) I use Minute Rice, with no problems--rice is never hard. Good recipe--true to Polish style rather than trying to turn stuffed cabbage into an Italian dish. We also sometimes make instant mashed potatoes on the side, and drizzle the thin juice over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ryanras"
},
"reviewBody": "one of the best meals i have ever perpared"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This was good. I did add some brown sugar, lemon juice, worstershire, garlice powder, onion powder and vinegar to the sauce. I used crushed tomato sauce. Cooked it on stovetop for 1/2 hr first. I layered the pan on the botton with extra leaves and also covered the rolls with extra cabbage. Covered the pan while cooking with foil. Baked at 350 for about 1 1/2 hrs. Be sure to add water to the pan to cover rolls. This adds more sauce and keeps the rolls moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette Di Marsico Doyle"
},
"reviewBody": "I lost my moms recipe and hadn't made these in years. This recipe was great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHELL49"
},
"reviewBody": "Sooo delicious! Thank you. My husband raved about it and I ate @ 6 of them over the course of 2 hours. I kept snacking on them. I didn't try the freezer method, but I may do that next time because after boiling the head the leaves do get like wet tissue paper and hard to peel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela Sundaramurthy"
},
"reviewBody": "My first time making (and eating) cabbage rolls. The recipe was very simple to make, and it made my house smell yummy. But the \"stuffing\" was a little bland, even after I added salt and pepper. Maybe our family just isn't a \"stuffed cabbage\" family. \n\nI just couldn't let all that juice go to waste, so I strained out the stuffed cabbage, threw in some chopped carrots, potatoes, and the leftover rice along with some salt and oregano. After we were done eating the stuffed cabbages we threw whatever was left-over into the soup! Nothing to waste, and a nutritious leftover/soup!\n\nOh, I didn't have tomato juice, so I substituted spaghetti sauce. Worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I love this recipe also I used spahgetti sauce instead of tomatoe juice. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "oursprinkles"
},
"reviewBody": "This was delicious...though a little too wet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Cole"
},
"reviewBody": "I discovered this recipe a few weeks ago and when I cooked it for the first time my children loved it, even my son who hates cabbage. I followed the recipe except I added a jar of Mushroom and tomatoes sauce to my Mince mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dustyshoes"
},
"reviewBody": "Wonderful recipe. I make it twice a month. In addition to listed seasonings, I add seasoned salt to the meat mixture. Then I place the smaller cabbage leaves in the pot to serve as a bed for the stuffed cabbages. This prevents stuffed cabbage burn and makes more yummy cabbage to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Denise Langfield"
},
"reviewBody": "This recipe was just alright. I probably won't make it again. I added a good amount of rosemary, oregano and thyme to it as I thought it might be bland but it still was. It wasn't a bad recipe just not a great one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "This recipe is similar to mine except I do not use tomato juice or even tomato soup. I used 1 Can Crushed Tomatoes and 1 can whole peeled tomatoes drained. and I stew them in a pressure cooker for 20 mins rather then bake for 1 hour. The cabbage is tender (you don't have to worry about the veins in the cabbage) and the meat is fully cooked. Yes it's a thin sauce but that's good to sope up with a good french crusty bread. Great winter meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rockawaybaby"
},
"reviewBody": "I tweaked this recipe. It is truly wonderful on a cold winter's day. I call it Eastern European comfort food.\n\nI parboil my cabbage leaves by placing them into boiling water for one minute. I then shut off the fire and leave them in the water, taking them out one bye one to stuff each leaf. They are not too hot to work with but this is a necessary step to allow for easy and pliable rolling.\n\nIn a large bowl, I put 1 and 1/2 lbs of lean ground beef, unflavored bread crumb about 1/2 cup, 1 cup cooked rice, 2 beaten eggs,1/2 fresh green pepper finely chopped, half a small onion finely chopped, 1/2 cup golden raisins,zest of a lemon (for extraordinary freshness), 2 beaten egges, salt, pepper to taste.\n\nMy sauce is started in a seperate pot- in 1 Tbs olive oil Sautee half green pepper, 2 cloves garlic, finely chopped add two cans of tomato sauce to one can of tomato puree, Juice of one fresh lemon, 1 Tbs of sugar and 1 cap of white vinegar. cook for about 1/2 hour. \n\nPreheat oven to 350. In a large baking pan ladle some sauce on bottom. Tightly pack your cabbage rolls into pan, you'll get twelve rolls into a large pan. Cover them with a bit more sauce. Cover with foil and bake 1 and 1/2 hours. It is a lot of work but worth it. If you are like me you'll love to be in the kitchen on a cold day cookin' away! Enjoy.\n\nTip- If I have leftover meat and cabbage, I cook it in a large pot (the one the sauce is already in) making meatballs from meat mixture- I drop meatballs in raw to sauce"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16323/polish-stuffed-cabbage/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16323/polish-stuffed-cabbage/",
"name": "Polish Stuffed Cabbage"
}
}
]
}
}
, "about": [
]
}
]