				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pop&#39;s Dill Pickles"
,"datePublished": "2009-06-30T21:58:02.000-04:00"
,"dateModified": "2009-06-30T21:58:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ann Philbeck"
,"url": "https://www.allrecipes.com/cook/ann"
}
]
,"description": "These crunchy Pop&#39;s pickles are the best whole pickles out there with great flavor from dill, garlic, and more. Canning is easy with this recipe."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wlTjHoiv6BMPQHOKuSDMiYnCBKQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9345169-0b6aefc5d51a412ba3c76811041a2bb9.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pop&#39;s Dill Pickles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "190"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "35 kcal"
,"carbohydrateContent": "9 g"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"sodiumContent": "1585 mg"
,"sugarContent": "6 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"8 pounds small pickling cucumbers",
"4 cups water",
"4 cups distilled white vinegar",
"0.75 cup white sugar",
"0.5 cup pickling salt",
"3 tablespoons pickling spice, wrapped in cheesecloth",
"7 1-quart canning jars with lids and rings",
"7 heads fresh dill",
"7 cloves garlic" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place cucumbers in a large pot and cover with ice cubes. Let them sit for at least 2 hours but no more than 8. Drain and pat dry."
} ,{
"@type": "HowToStep"
,"text": "Place water, vinegar, sugar, pickling salt, and pickling spice into a saucepan. Bring to a boil, then simmer for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack cucumbers into the hot, sterilized jars, filling the jars to within 1/2 inch of the top. Place 1 dill head and 1 clove of garlic into each jar. Pour hot pickling liquid into the jars, filling to within 1/4 inch of the rim. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings."
} ,{
"@type": "HowToStep"
,"text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press down on the top of each lid, ensuring that the seal is tight (lid should not move up or down at all). If any jars have not sealed properly, refrigerate them and eat within two weeks."
} ,{
"@type": "HowToStep"
,"text": "Store in a cool, dark area, and wait at least 1 week before opening."
} ]
,"recipeYield": ["35"]
,"totalTime": "PT185M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "I have not made pickles before, and liked these very much. I think would reduce the sugar by at least a third next time, for my taste, though. I liked the bold taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cocomo"
},
"reviewBody": "Well I'm not quite sure what I did wrong but the pickles turned out terrible! They were all shriveled up and looked like I had canned them a 100 years ago! The only thing I did wrong was forgetting to cut the end blossoms off the pickles like everyone tells me I'm supposed to. They were mushy and way too salty also. Any ideas out there?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug Lee"
},
"reviewBody": "Pops Pickles are the best made them last year and just made 40 more pounds this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Fred Freed"
},
"reviewBody": "I'm not impressed with this recipe at all. The pickling spice totally overwhelmed the dill flavor. I only used 2tbs pickling mix and it was too strong. I also kept adding more water and vinegar in an attempt to make it edible, no such luck. IMHO vinegar, salt, sugar, and dill are sufficient to make a good dill pickle. Perhaps in 4 or 5 weeks the flavor will mellow, I hope so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paul R Steel"
},
"reviewBody": "I was happy with this recipe. For my taste I am trying a little less vinegar/water ratio, and doubling dill seed. \nWhat I likes was the overall taste was good. The pickles were crunchy. Nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick Whittles"
},
"reviewBody": "I cut the sugar to 1/3 cup. Tart crispy pickles......people love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda G"
},
"reviewBody": "One of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Weiser"
},
"reviewBody": "My second year making these, so good. I made a double batch of brine to finish 16- 1.0 liter jars with just enough brine. Fill the jars as full as you can with cukes, it works."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Char Paul"
},
"reviewBody": "I made these today and it smells great. I won't be able to try them for a bit but I will say the recipe is inaccurate. I was only able to fill 2 and 3/4 of a quart jar so I had to rush to make and prepare more brine to finish off the rest of my jars. I ended up tripling the recipe and was able to fill 9 quart jars with a little liquid left. I probly could have filled 10."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John Alexander"
},
"reviewBody": "These are great and I’ve done them several times now but you have to double the recip! I think this was intended for up to 8 PINTs not quarts. Also, I reduce the sugar by 1/3 and add chili flakes and people tell me they’re the best they’ve ever had :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Wilson"
},
"reviewBody": "I loved it... very easy and the family loves the pickles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "peachlovehope"
},
"reviewBody": "Just a note- A recipe exactly like this only calling for 3/4 c salt is called \"Quick Dill Pickles\" in the book \"Putting Food By\" by Greene, Hertzberg, and Vaughan. In the book, the YIELD IS 7 PINTS, not 7 quarts. All other ingredients and amounts are exactly the same, even including the suggestion of adding 1 clove garlic per jar. I don't share this because I have any problem with the author of this recipe, but simply to verify other reviewers' observations that the recipe as written here doesn't make 7 quarts. So, adjust your expectations/amounts and enjoy making delicious pickles!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandman5756"
},
"reviewBody": "The first years I tried making pickles, they often turned out limp and unsatisfying. The trick i learned from this is the ice bath beforehand. Absolutely essential. As for this recipe, I made this for two years, and the first year everyone in the family loved them; then my daughter decided she did not want sugar any more. So the pickles sat on the shelf. However, I discovered that by removing the sugar, you still get the great garlic dill flavor, just a bit tangier and without the sweetness. This is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lynn T Scott"
},
"reviewBody": "I followed the recipe exactly, found like several others that I did not have enough liquid. That wasn’t a tragedy—I made more. The problem for me is that the pickles are waaaay too salty! I also didn’t understand the instructions to cover the cucumbers with ice. Why? The ones on top obviously get much more exposure to the ice than those on the bottom. Maybe ice water would be better? Other than that, they were reasonably easy to do and I liked that the recipe could be scaled. I suggest packing your cucumbers into the jars ahead of time so that you know how many jars you’ll need. In my opinion, the jars don’t need to be pre-boiled—dish washer and keep them hot should be sufficient, but check with your extension office on this. Also, scrub and trim the blossom end before the ice treatment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARBRITE500"
},
"reviewBody": "Crispy crunchy pickles! I followed another recipe and it didn’t turn out edible. I was scared to try this one but this recipe was the most easiest and spot on for measurements. Love that you can change the serving size to fit your amount of cucumbers available."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jakman43"
},
"reviewBody": "I doubled the brain mixture as I saw other reviews that suggested that and I had exactly enough. I know it takes a few weeks to pickle but everything looks great and I enjoyed it as it was a very easy recipe and the results hopefully will be excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maureen"
},
"reviewBody": "I did not have enough brine, I even added more to the receipe...I thought I packed the jars tight \nAdded the garlic, peppercorns and a few red Thai chilies in a couple, I like them zesty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "blsapp"
},
"reviewBody": "Made this evening (8-4-2020). A little aggravating having to go back and make a whole batch of brine. Had to double it to fill seven quart jars. This recipe needs updating. Will update my review once I try them in a few weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof3boys"
},
"reviewBody": "Wow. I was pleasantly surprised. I have never made pickles, but I had an abundance of yellow squash and zucchini so I pickled them. I just tasted one of them (after about 2 weeks), and they are really good! I used a little less sugar, and I didn't use garlic because I really wanted a salty dill pickle. So yummy I may have to make some more! Thanks Pop!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "Too salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raebbie"
},
"reviewBody": "This is the recipe I use for pickles every year. I find that I need more of the vinegar mixture than it calls for with the amount of cucumbers it says but that’s probably because I’m not packing them tight enough. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "haf"
},
"reviewBody": "excellent; I learned a lot from other sources though and I'll share what I've learned: First add Turmeric for coloring like store bought. Second, put a grape leaf or black tea (loose) in the pickle jar to crisp the pickles. Finally, though it doesn't apply to all cooks, pick the cucumbers before 9am for sweeter, crisper pickles and do not pick on days when you might be menstruating (bizarre but time tested) so as not to make mushy pickles (not sure I buy this one). Also, use twice as much brine as you think you made because this recipe didn't cover the load which was four pounds of pickles with 2X the amount of brine made. 'Nuf said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Judd"
},
"reviewBody": "I just tried this recipe, my first attempt at making pickles . The directions were easy to follow. I read many reviews and I will agree, double the brine for the quart jars. I was able to fill 7 quarts. I didnt have dill heads so I used a few dill sprigs in each jar. I added a few more garlic cloves to a few jars for an extra kick.They smelled good and I'm hoping in a week they taste just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kikiboo"
},
"reviewBody": "I normally dislike dill pickles but I give this one 5 stars, I though for sure I just made a batch of pickles to give away. I horded all but one jar and ate them in the dark night with only the refrigerator light to warm my cold soul. I made my own pickling spices from a different recipe, so your results may vary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ItNeedsMoreGarlic"
},
"reviewBody": "Husband liked it, I thought it turned out a little too sweet. The pickle texture was inconsistent - some were crunchy, some were soft, although it was my first year making them. I might try a new recipe next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "These turned out AMAZING!!! Do not deviate from the recipe. Turned out perfect. Do wait 10 days before trying them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Manchen"
},
"reviewBody": "Love them and so does everyone that tries them. I made them last year and had no problems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whistlingbat"
},
"reviewBody": "This is now my go-to pickle recipe. For 6 large jars, I need to double the vinegar mixture. I skip the ice part, but the whole cucumbers typically sit in the fridge for a few days (out of laziness) before I'm ready to pickle/can - not sure if makes a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy E"
},
"reviewBody": "Turned out very nicely. My family is enjoying but I found the pickling spice was a little too much. I will make again but cut back on the pickling spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "I've made these for the last 8 years. After trying different recipes, this is definitely my favorite. I have increased the recipe to make what should be 35 qts. However, it actually makes 20 qts. so plan accordingly. I let them stand for a month or two and then put a quart in the fridge. They are crispy and delicious. I have had so many compliments on these pickles. They are still delicious after more than a year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessie Mayhew"
},
"reviewBody": "Perfect with adjustment.\nFirstly, only add all the sugar if you like sweet pickles. I like my pickles less sweet so I only added 2 tbsp of sugar.\nNext, this is not enough brine to make 7 quarts. I made another half of the brine to fill the rest of jars.\nLast, make sure you don't can the pickles with the pickling spice(I didn't have cheesecloth so I just strained the brine) or it will over power the pickles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Johnny"
},
"reviewBody": "The addition of sugar in the brine was too sweet for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Shaffery"
},
"reviewBody": "I used honey instead of sugar, came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenna Godwin"
},
"reviewBody": "I found this recipe a little bit too sweet and too much \"spice\" from the pickling spice. I changed the sugar to 1/2 cup and removed the step to boil the brine with the sachet of spice. Instead, in each jar I added 1/8 tsp. of pickling spice right in the jar. I let it sit for a min of 4 days, and it was great!\n\nSo...\n4C. Water\n4C. Vinegar\n1/2C. Sugar\n1/2C. Pickling Salt\n-Bring to boil and simmer for 10 min\n\nIn each jar add fresh dill, garlic and pickling spice. Happy Pickling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsCree"
},
"reviewBody": "Make this every year since i was lucky enough to come across it a few years ago. It is the best recipe dill pickle recipe i have made. I will never make another. Everyone loves them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "my2cents"
},
"reviewBody": "I used a basket of pickles, added pickles and ice to a cooler and let set for 8 hours. This causes the pickles to be crisp. Adjusted recipe for weight of pickles, reduced salt by half. Used fresh dill, one clove of fresh garlic and i half green jalapeno and half red sweet banana pepper with seeds per jar to spice the mix and add color. \nTo the brine, I added pickling spice to be strained out as jars are filled. Boiled brine, let cool to 170-200 degrees, strained and filled jars after stuffing with pickles. Used a five minute water bath in pre-boiling water to seal. 5 minute is important."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELPRES"
},
"reviewBody": "Ate one of these, then ate a Vlasic - no contest whatsoever - this recipe has so much more flavor (and I love(d) Vlasic until this)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamelaj"
},
"reviewBody": "We added extra dill to each jar and it was perfect. 4 jars are already gone!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Kinder"
},
"reviewBody": "this is the 2nd yr I have made this recipe They are Awesome, and yes the longer you wait the better they taste. made 6 pints last yr and 20 pints this year I used this recipe for 4 pints of hot peppers too,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "West_Nebraska_Dude"
},
"reviewBody": "Way too salty!! \nThe 1/2 cup salt that is called for made this recipe completely inedible … we threw the entire batch away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annette Lemieux"
},
"reviewBody": "I made these pickles yesterday. I had to use rice vinegar instead of regular vinegar which made them mush less tart. I added more water as well because I made 12 pint jars instead of quart jar. Head of dill for every jar. Came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine chase-lamont"
},
"reviewBody": "I couldn't wait and tried them at the 6 day mark. They were already very flavorful! I made 5 bigger jars and it wasn't enough brine for all, so I needed to quickly make a little more. I will definitely try making them again! Next time I will likely cut back a little on both the sugar and pickling salt though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Clarke"
},
"reviewBody": "I made these almost 2 months ago and just opened up a jar and the flavor is amaaaazing! So dilly and yummy a must try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Schwartz"
},
"reviewBody": "no changes and yes i have all read made more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cheryl Krause"
},
"reviewBody": "Pop must have liked his pickles salty. The flavor is nice if you can get past the salt. These will just turn into fried pickles. Because water and vinegar are equal, you can safely reduce the amount of salt. Am going to try again with half the salt and a bit of pickle crisp in the jar\n\nUpdated to 4 stars. Cut salt in half and added pickle crisp to jars. Still a tad salty. Cut salt again, added pickle crisp and used this recipe the rest of the season. I probably ended up with 20 jars of pickles that can be eaten as is. The others are all going is salad dressing, tartar sauce or being fried cause they are toooooo salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TexasTwo"
},
"reviewBody": "Great pickles as is. I wanted to jazz them up a bit so I added some Jalapeno, and I like the way my pickling spices look floating in the jar so I let those suckers loose in the jar and they look really nice. Next time I'll use peppers that are a different color and add purple onions for color and flavor! Keeper for sure!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susie-Q"
},
"reviewBody": "Well I believe the recipe is wrong in the brine amount, as other reviewers have stated, and really hope it is changed for the next brave caner. I have to make a quick repeat of the brine and I only canned less that 4 pounds of cucs. I used fresh dill as well. Looking forward to the taste test in a couple of weeks and the adventure of adding jalapeno\npeppers to the next batch. I also added onion to a couple of the pints. Even with double brine I ended up with 5 pints and 1 quart of finished product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "We iced the cucembers for an hour and 45 minutes and some of them froze and were unusable. Also the recipe only made enough brine for 2 jars. We had to triple it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Hoelting"
},
"reviewBody": "I made this using sliced cucumbers and it made 9 pints. Will be making this yearly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "taylor"
},
"reviewBody": "Taste delicious, but they didn’t turn out crunchy really at all. I followed the directions closely so I’m not sure why this would happen"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CJ"
},
"reviewBody": "So sweet! I wanted DILL pickles. The sugar completely overpowers any flavor. I thought the sugar in the recipe was to cut the acid...I was wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neoconnut"
},
"reviewBody": "Best pickles ever! My family loves them and so do my co-workers. the only change I make is I add some hot peppers to the mix to give them some heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Severance Ney"
},
"reviewBody": "My mouth is salivating even THINKING about these pickles. Do not look further. THIS is the dill pickle recipe you want. I canned them in pints, and do believe I each grand could eat his/her way through a pint in one sitting. They are that good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pat Henrikson"
},
"reviewBody": "I followed the recipe. Had just enough liquid for 7 pints. I had one jar not seal, so after 2 weeks in the fridge we tried the pickles. Definitely crunchy but too salty. I'll try this recipe again but will cut salt in half. Also would add some red pepper flakes and more dill. We don't use salt for the most part, so that may be why these tasted too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christel King Yavaliollah"
},
"reviewBody": "My first time to make pickles. I've never been patient-so as the instructions said, if the jay doesn't deal properly (the pop up lid doesn't stay down), refrigerate and eat within two weeks. Two out of 9 jars didn't properly seal. After being in the fridge about 2 1/2 hrs (after completing the recipe), we decided--what the heck--we'll go ahead and try them! If they aren't good, we'll just wait it out the full week. But they were delicious !!! We even agreed that they are the best pickles we've EVER had!! Yum!! I'll be making this recipe regularly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig"
},
"reviewBody": "Made a variety, chips, stackers and spears. Made several jars with carrots (cause we like carrots) and a few hot pickles with red jalapeño peppers. They all taste amazing! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CC"
},
"reviewBody": "I used this recipe as I like the ingredient list and proportions. They turned out excellent! This will be our go-to recipe moving forward. I also had left over brine, so have been using it with fresh sliced cukes and peppers as refrigerator pickles. (NOTE: I did double the brine recipe to be sure I had enough based on some of the other reviews)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Van Norman"
},
"reviewBody": "I made it the first time as listed but didn't like the sweetness from the sugar so omitted it the second time. Also added the pickling spice directly to the jars along with extra bay leaves and 2 whole cloves &amp; chopped garlic. Used \"pickle crisp\" and grape leaves to keep the crunchy texture. They are being devoured! I used the same brine to make spicy pickled beans for Caesars and added some chili flakes. Such a great way to preserve the abundance growing in my garden!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "pfirestone"
},
"reviewBody": "This is my first time make dill spear pickles. I cut the recipe in half so it said I needed 4 pounds of cucumbers. And the brine was 2-1/2 cups of water and vinegar. I stuffed 3 quart jars with cucumbers and had lots left over and the brine only filled one quart and a half of another. I made another patch and created another quart (making 4 total)... and had the same problem. I also probably have a pound and half of cucumber spears left over. Anyone else have this problem? I hope they taste good at least."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the receive exactly except I added a dried red pepper. The pickles were awful. Too sweet, and the pickling spice gave it a weird taste. While I like to use pickling spice in sweet pickles and relish the use with dill was definitely not good. I had to throw away 12 quart jars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tlr77536"
},
"reviewBody": "I followed the receive exactly except I added a dried red pepper. The pickles were awful. Too sweet, and the pickling spice gave it a weird taste. While I like to use pickling spice in sweet pickles and relish the use with dill was definitely not good. I had to throw away 12 quart jars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie H"
},
"reviewBody": "I used 10 pounds of small pickling cucumbers, in 10 x 1 litre jars, which needed 9 cups vinegar, 9 cups water, 1 cup pickling salt , 1 Tbsp sugar, a 3T cheese cloth bag of pickling spice, dill and garlic.... and WOW! Also cut a thin slice off both ends of cucumber."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarafina159"
},
"reviewBody": "Excellent dill pickle recipe! I had to double the brine to cover the pickles. I used sprigs of dill from my garden instead of dill heads. I will be making these again once I have more cucumbers from my garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "atasteofcreole"
},
"reviewBody": "Complete WASTE. KOSHER NOT DILL. Apparently people don't know the difference. Dill is crisp, vinegary and nice. Kosher is nasty, slimy and gross"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerry"
},
"reviewBody": "The recipe itself is awesome! I doubled the amount of solution you make. I didn't realize how much you have to pack the pickles in the container (may be this is why I needed more solution). I thought I had stuffed the containers, but when I filled them with liquid, the cukes floated up. Next time, I will know to pack these things very tight. I tried the first batch after a week, and they were really good. I did follow one person's suggestion to cut off the ends of the cukes to keep them crispy. It worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Auntie Mame"
},
"reviewBody": "The pickles were too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Justin Pope"
},
"reviewBody": "The recipe only makes enough liquid for 3-4 qts. I doubled the recipe and filled 7 qts with 6lbs of pickles (3 two pound bags). I also added two slices of habanero two give it a little kick, but copied the recipe exact otherwise. It's was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "Finally! An easy and tasty recipe! These pickles were amazing! After reading reviews I made 50% more brine and had a little leftover. One clove of garlic and 1-2 dill heads was the perfect balance. I added a Thai chili pepper to a few jars for fun and the spice was just perfect. \n\nI didn't soak my cukes - just took them from the fridge and they were great.\n\nThey tasted great after a month on the shelf but I popped a few jars into the fridge without processing and they were DIVINE after a week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cdngirl"
},
"reviewBody": "We are about to make our second batch.\nThe only negative is that I found them very slightly too sweet for my taste. This time we are reducing the sugar just slightly. Also, you may want to 1.5x or 2x the pickling liquid as the recipe doesn't make enough and we had to stop to make more. We also left the pickling spices in the liquid instead of having them in a cloth. We like the extra flavour it adds, but everyone's tastes are different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alistaire MacIntyre"
},
"reviewBody": "The only changes that I made to this recipe is I added less sugar and less salt and a bit more pickling spice I also added some red pepper flakes they are phenomenal I absolutely love how they crunch taste and look I will be making this recipe over and over again thank you very much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "Great pickles but the liquid does NOT cover 7 qts..... I made 3.5 batches for 12 qts. But the pickles are awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anna Birdseye"
},
"reviewBody": "I haven't tried the pickles yet as I want them to have a good chance to soak up the brine. The brine was FANTASTIC so I'm excited that these will be good. I'm concerned about how crispy they will be but the reason I'm only giving it 3 stars is that there's NO WAY this makes 7 quarts of pickles. I only got 5 quarts out of the brine. I had plenty of pickles left over. It was really disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan Mowbray"
},
"reviewBody": "Followed the recipe exactly and got very nice, crisp dills. They are a little bit too salty for my liking but perhaps I erred in my amounts - I had cut the recipe in half for the amount of cucumbers I got from my garden at the time. As others did, I also needed more liquid but that was no trouble. I'm doing another batch today. I may add just a touch more sugar - they aren't sweet in the least."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "al hatch"
},
"reviewBody": "Great recipe BUT double the pickling liquid. The amount in the recipe will only barely do 5 quarts. Other than that it is a terrific recipe. Makes tasty and crisp pickles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Jett"
},
"reviewBody": "Awesome pickles!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis"
},
"reviewBody": "Great pickles and very easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom of 3"
},
"reviewBody": "I made these with just the first two cucumbers that grew in our plant (we were excited). I did slices and obviously had to adjust the ingredients for my two cucumbers. We also made these as refrigerator pickles instead of canning. I might cut back on the salt a bit but this could be from a mistake I made in adjusting proportions. Overall these were crunchy and delicious. I just made them today and they already taste great so I am sure that in a few days they will be even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "phil"
},
"reviewBody": "The amount listed was not enough to filling 7 jars. I only got about 3 out of it. I had to make the juice twice. It's way too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TERESA GROOM"
},
"reviewBody": "Grand kids loved them. This year I will have to grow more cucumbers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulaagor"
},
"reviewBody": "i have several good bread and butter and sweet pickle recipes, but had never found a decent dill pickle recipe until now. This was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "highflyinryan"
},
"reviewBody": "Excellent pickle recipe! I made both chips and spears out of this recipe and followed every step perfectly. The pickles turned out tasting like deli pickles after a 7 day waiting period. One unsealed jar that I ate right away was a bit strong with a vinegar flavor, but still very good for my taste. I highly recommend this recipe for any deli pickle lovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leenie"
},
"reviewBody": "These pickles are so crisp and delicious that I was shocked. I will be making them again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kasi"
},
"reviewBody": "My husband took one bite of the pickle and simply said \"way too salty.\" So for the second batch I used 1/3 cup pickling salt instead of 1/2 cup. Much better! I agree with the previous poster that this brine only fills three quart jars so keep that in mind if you actually have 8 lbs of cucumbers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mngirl"
},
"reviewBody": "Extremely sour. The vinegar to water ratio is way too high. Hopefully they'll work on sandwiches because they're not good on their own. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragonflyrose"
},
"reviewBody": "First time I ever made pickles &amp; they were delicious! I think I'll use a little less salt next batch though. I loved them but my boyfriend thought they were too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steenbean18"
},
"reviewBody": "I made these EXACTLY as stated on the recipe. Now batches have come out perfect and crunchy (cut off blossom ends!) Huge hit with family and they went fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "m3shelly"
},
"reviewBody": "I have made this recipe 3x now. I followed the exact recipe, except I used regular cucumbers from my garden, because I had to use them up. I agree with other reviewers, there's only enough brine to do 7-8 pints, but that worked perfect for me with about four pound of cukes cut into crinkle coins.\n\nI will use this recipe every year. The last batch turned out fantastic! And, it was my very first attempt at canning anything. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marysnf"
},
"reviewBody": "I made these three weeks ago and they turned out with a great dill pickle flavor and very crispy. I am making another batch as I type this review. The only thing I did was increase the amount if liquid. Follow the recipe and you will have flawless dill pickles that everyone raves about!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krisjana Gorham"
},
"reviewBody": "I made this recipe last year. It was my first time trying dills and they were fabulous! Everyone in our large family loved them. I planted more cucumbers this year just so we can make even more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GardenGirl"
},
"reviewBody": "This recipe is a perfect starting out point, and very easy to make it your own with slight changes to ingredients. I like to use dill seed, I reduce the sugar a bit to be equal with the salt, and a little less of the pickling spice. The longer they are allowed to sit and become wonderful, the better! I like them best after about 6 months. They are crunchy and addicting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimCancook"
},
"reviewBody": "Really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neebird"
},
"reviewBody": "Absolutely the best !! Used NOT fresh dill -- and maybe not a full teaspoon per jar, but none the less they are yummy ! Gonna make more !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "blissfullybaking"
},
"reviewBody": "Way too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JGBis COOL"
},
"reviewBody": "GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This is my first time making dill pickles and i was very happy with this recipe but next time I will reduce the salt. I trimmed the blossom end as recommended and they stayed very crunchy. I believe the recipe author made a mistake saying the brine will fill 7 quart jars. it makes enough for 7 pint jars. so if you are filling quarts then double the brine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassygirl"
},
"reviewBody": "These pickles were fabulous. I used the really small pickling cucumbers because we like whole pickles as opposed to spears. I also used hot and spicy pickling spice, the serano peppers and garlic. These pickles turned out great. Will definitely keep this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonny Piantino"
},
"reviewBody": "This is the first time I was successful at making pickles. I am on my third batch. It's important to use the freshest cucumbers possible, as my first batch was shriveled but tasty. Use a scale. I had plenty of brine. Alot depends on the size of the cukes. I also used a pickling spice recipe from this site, which went very well with this recipe. My most recent batch is large but short cucumbers, so hopefully they won't be hollow or too seedy. Please thank your dad for me. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocolatelover"
},
"reviewBody": "great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cadmentr"
},
"reviewBody": "Made this recipe tonight, much to my surprise after making up the pickling liquid, and loading up my 7 quart sized jars with the cukes, there was only enough liquid to top off 4 jars of the pickles. I think the recipe should have 8 cups of water and 8 cups of vinegar, 1.5 cups sugar and 1 cup pickling salt. I made a second batch of the liquid according to the recipe, and processed all my jars. I'm really looking forward to trying these pickles in a week. If they taste as good as the pickling juice smelled I'll be very happy, and make another batch."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/218121/pops-dill-pickles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17621/side-dish/sauces-and-condiments/canning-and-preserving/pickled/",
"name": "Pickles"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/218121/pops-dill-pickles/",
"name": "Pop&#39;s Dill Pickles"
}
}
]
}
}
, "about": [
]
}
]