				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Potato and Egg Casserole"
,"datePublished": "2018-03-21T12:20:47.000-04:00"
,"dateModified": "2022-09-21T11:32:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Connie"
,"url": "https://www.allrecipes.com/cook/24322338"
}
]
,"description": "This potato and egg casserole is made with sliced potatoes and hard-boiled eggs layered in a rich sour cream sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/U5XozJKvWcHYntNR4wELIn6tBTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1125891-3efa7b41dc434c00bb3256f98019d2bd.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Potato and Egg Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "92"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "414 kcal"
,"carbohydrateContent": "25 g"
,"cholesterolContent": "169 mg"
,"fiberContent": "3 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "390 mg"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"6 medium potatoes",
"8 large eggs",
"1 teaspoon seasoning salt, or to taste",
"1 cup margarine",
"1 (16 ounce) container sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and let cool."
} ,{
"@type": "HowToStep"
,"text": "While the potatoes are cooking, cover eggs in a saucepan and with cold water. Bring water to a boil, then immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove eggs from hot water and place under cold running water to cool."
} ,{
"@type": "HowToStep"
,"text": "Slice potatoes. Peel and slice eggs."
} ,{
"@type": "HowToStep"
,"text": "Starting and ending with potatoes, layer potatoes and eggs in a 9x13-inch casserole dish, sprinkling each layer of eggs with seasoning salt."
} ,{
"@type": "HowToStep"
,"text": "Cook and stir sour cream and margarine in a small saucepan over low heat until melted. Pour over casserole and sprinkle lightly with seasoning salt."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 30 minutes."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vas Littlecrow Wojtanowicz"
},
"reviewBody": "I love this recipe, but I use butter instead of margarine. I also like to add paprika along with the season salt. In a pinch, plain yogurt works pretty well as a substitute for sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Haag"
},
"reviewBody": "This was amazingly tasty! It isn't difficult to make, but there are a lot of steps. I don't know how anybody could make it in the time allotted. However, I added some fried onions and spinach to it. My father-in-law took a second helping and complimented me on it. Two things that never happen!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "carolynd41"
},
"reviewBody": "Added shredded cheese on top. Also sprinkled chopped spinach in layers. Would cook potatoes a little longer. Make sure to use regular sour cream, light was too watery. Will try again. Good for vegetarians."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "2.12.17 I had a few mushrooms left in the fridge, so I sauteed them and added to the layers in this potato-egg dish. Surprisingly tasty casserole considering how few ingredients there are, and the sour cream-margarine sauce tastes simply decadent. As others reviewers have noted, easily you could turn this into a main course by adding sliced sausage, Canadian bacon, topping with crispy bacon, ham, etc. This was a winner today for a lazy Sunday brunch with a Bloody Mary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marcy"
},
"reviewBody": "This is a crowd pleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I'm Hungarian, and my Mom would make this and we devoured it. It's one of the few recipes that didn't get written down before cancer stole her away from us. She never used margarine, only a little bit of butter and she would add sausage as a layer too. I've been going though all the rukot krumpli recipes online, and this served as a good base to recreate my Mom's version. All the reviews helped too. Thank you for bringing back a wonderful memory of my Mom! FYI....it always tastes better the second day! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I thought it was great however... I added 2 t worchestershire sauce, 1 t mustard, 8 oz diced ham, a handful of chopped onions and a sprinkle of cheese. I thought it needed the extra oomph of flavor. My one question is: How does everyone else keep the sauce from separating after you put it in the oven? I melted the butter and added the sour cream to it off the heat. But once I cooked it for 30 minutes at 350, it was floating in butter. Still tasted great but it was NOT an attractive dish. My DH said this was his new favorite breakfast dish so I'll absolutely make it again, but I'd sure like to find out how to keep it looking creamy and delish, not oily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bruscookie"
},
"reviewBody": "This recipe sounded good for my son's girlfriend. She is vegetarian and was coming for Thanksgiving. With the eggs being the protein since she didn't eat the turkey. It was a great hit and she took the recipe home and its a family tradition of both her family and ours now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MARYB325"
},
"reviewBody": "I remember my mom made this a couple times when I was younger I can't recall if she used sausage or not but regardless it is good I'll definitely try this again with some sausage :) thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dedekins532"
},
"reviewBody": "This is a staple in our house. I will admit I was skeptical at first, but made this on a day with no other options. Promptly made it again the following week. We add Kielbasa sausage sliced in the layers, loosely follow the recipe depending on your taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "We thought this was a very tasty side dish, easily capable of becoming a main dish with the addition of meat. I scaled down this recipe by two-thirds for just the two of us, and we still have some left over. Even though it's rich, you don't eat that much of it! I was surprised at the few ingredients that led up to such a tasty dish! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Cochran"
},
"reviewBody": "Unbelievably WONDERFUL, easy to make\nLent 2/22/13 All 3 liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "WillaD"
},
"reviewBody": "It tastes good but it came out really dry. I followed the instructions exactly but it seems as though it needs double the butter/sour cream mixture. Not sure what happened?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tcostello"
},
"reviewBody": "Very good dish! I'm not very familiar with Hungarian meals, but this was quite good. For my personal taste, it was a bit heavy on the butter side, but good nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmuller01"
},
"reviewBody": "Awesome! Just the way my MIL makes it. I'm so happy I found this recipe. I made it last night and I have over half left. Turned out awesome. Takes very long to make but worth it. I did the recipe exact but peeled and slice the potatoes b4 hand and added them to the water b4 it boiled so they weren't hard. Also, added small pieces of cooked polish sausage to it. I think my MIL always added Hungarian sausage. Love! My husband said it tasted just like his mom's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremade"
},
"reviewBody": "Quick and easy and a yummy comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "I am Hungarian and I also make this although with less potatoes and I use butter (and much less than a cup) with the sour cream. Occasionally I also sprinkle some paprika on it as well. It's a great way to use up leftover baked potatoes. It's also great if you add sliced smoked sausage or even hot dogs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Newman"
},
"reviewBody": "This was really good. Easy to make, hard to screw up! I fed it Christmas morning and everyone loved it. Delicious topping, soooo creamy. I had to cook mine a little longer because the pototoes were still a little hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johanna Rouba"
},
"reviewBody": "I haven't had this for 20 years - I made the lazy quick bersion . I opened a can of sliced new potatos and layers with eggs I sliced on the egg slicer. I melted the butter in microwave, added and whipped in sour cream then returned to microwave with a handful of diced onions to add a bit of flavor. Some cracked peper on top and I got to have grandmom's cooking in a short time. I forgot to mention I made the 3/2 layer in a loaf pan and cut the recipe in half and it was nice. I had some as soon as half hour had passed but grandmom let it set for a while so will have more in a bit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Haley"
},
"reviewBody": "The flavor was great but there was too much butter/margarine and the potatoes were still hard. I would reduce the margarine (I used butter) and cook the potatoes for longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JohannaB"
},
"reviewBody": "Good traditional hungarian flavor- would've done 5 stars but the sauce separates during baking (even when I used less butter). Next time I'll try some cornstarch &amp; beat an egg in with the sauce... I diced a polish dog in for extra flavor. yum!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MDK"
},
"reviewBody": "Our family dinners were not complete without this. Though we did it with a couple of variations. Butter instead of margarine. Always start and end with potatoes. And on top of egg layer and final potato layer place 5 or 6 pats of butter instead of adding to sour cream, Use salt and lemon pepper and garlic salt on top of eggs and final layer of potatoes. Usually do two layers of eggs and three of potatoes. After layering is complete add condensed milk to sour cream until it is pourable, pour over casserole and bake at 350 until it is bubbling. Potatoes were cooked until a fork insterted could go all the way into the middle. Anyone who had tasted it loves it! Hopefully this is not a double post, I messed up the first time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracy K"
},
"reviewBody": "Surprisingly better tasting than I expected. I put a little grated cojack cheese on top near the end of baking. Also used much less butter. I might make it again, but there are much better breakfast casseroles. I was looking for something for a friend who is on a soft food meatless diet. This fit the bill for her purpose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof3boys"
},
"reviewBody": "My family really enjoyed this comforting casserole. I used butter instead of margarine and the sauce was so deliciously smooth and creamy!! I served it as a meatless main dish and no one complained, acutually they said this ones a keeper!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pamela Innes"
},
"reviewBody": "I modified it a bit...I added bacon slices and cheddar cheese...It was excellant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DonnaLee"
},
"reviewBody": "This is a great casserole side dish. I used the buttery yukon gold potatoes and didn't peel them as I happen to like the skins. The next time I will slice the potatoes very thin to make them as \"soft\" as possible without being mashed. I'm also wondering if browning some ground beef and adding that in before baking would make a main dish casserole. I'll definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Alina"
},
"reviewBody": "This was horrible! My own fault, because I should have known potatoes and eggs with sour cream poured on top can not be good, but I did not expect flavors to not go at all and the runny appearance. Nobody touched it! What a waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janalynn505"
},
"reviewBody": "This recipe is pretty time consuming, so I don't know how often I'll actually make it in the future. I followed the directions for the most part &amp; boiled the potatoes a little longer (about 22 minutes) as other reviewers had suggested. But my husband still thought they were a wee bit hard, (I thought they were fine.) I also cut the margarine to 1/2 cup as well. I added a little bacon to make it more of a main course meal, but my hubby thought it was more of a breakfast dish. It was good, I liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lunatika"
},
"reviewBody": "This is quite good though really heavy (obviously, smile). I actually prefer it at room temperature because then I can taste the tanginess of the sour cream more. Since I am veggie I did not try it with kielbasa, but some kind of spicy soy meat might spice it up a bit...I did add freshly ground pepper to the top which helped, but even more kick might be good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara p"
},
"reviewBody": "Warm, tasty comfort food. Economical and filling. Perfect for a cold night's dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Danielle Dutsch"
},
"reviewBody": "This was one of the most bland and boring dishes I've ever had. I thought all the butter would make it tasty, I even added a few spices like garlic powder (just because I love garlic), but this dish just left me feeling un-fed and unimpressed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bev511"
},
"reviewBody": "This recipe was very good! I halved the recipe and made it in a deep dish pie baker, cause this makes way too much for just hubby and me! I added some sliced kielbasa, but think it would be much better with added onions or onion powder, pepper and maybe some sort of shredded cheese. I will probably make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mermaid"
},
"reviewBody": "Way too much butter and sour cream. Just not the kind of recipe that people I know eat in this health conscience part of the world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooke"
},
"reviewBody": "We've made this several times now and it's very tasty! We always leave out the butter (and it's not missed.) It definitely turned out better when we used a sausage which purged its fat so that it mixed nicely with the sour cream on the bottom of the bowl. Additionally, my Hungarian boyfriend seems to think it's VERY IMPORTANT that egg slices are covered with potato, otherwise they may become hard while they're in the oven. Who am I to argue? :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "This is well worth the time it takes to prepare. I used redskins I had cooked the previous night, but any potatos will do. I also added onion and shredded cheddar cheese. I didn't have any breakfast meats in the house, so I added bacon bits. This casserole is rich, but oh so yummy. Try adding your own ingredients to make it your own unique casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terri Davenport King"
},
"reviewBody": "This looks very much like something my mom used to make for dad about 40 years ago.. except she put buttery toasted bread bites on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dpnw"
},
"reviewBody": "I agree, the potatoes were way too hard. Next time, I will boil them until pretty soft first. I loved the flavor and the combination though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cricket6614"
},
"reviewBody": "This needed a little more for me, bacon, cheese and onions would be a nice touch. Also, my potatoes had a hard time getting soft enough, maybe I did not boil them long enough?!?! My husband loved it though, hard potatoes and all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This is really good. I use Season All for the salt between layers. Also, I don't even use close to all the butter (about 1/8-1/4) because it is just way too much. I have use yogurt cheese instead of real sour cream and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "I thought this recipe was great to work off of! I sliced the potatoes first, boiled them until very soft, already had the eggs cooked and cooled, fried up some pre-cooked ham, then cooked a small bit of onion &amp; garlic &amp; added that to my pot of sour cream and butter that was warming. I layered 1/2 the potatoes, half the eggs, half the bite sized ham pieces, half the sour cream mixture, then a small amount of sprinkled bacon pieces (store bought), season salt &amp; paprika, &amp; shredded cheese, &amp; did the exact same layer again (leaving out the top layer of cheese). Cooked it for a half hour, then shredded a small layer of cheese on that, cooked it for 5-10 mins more &amp; it looked beautiful and tasted great! It was very filling so a small serving would have been better. Even hubby thought it was really good. This took quite a bit of time to make despite having my eggs &amp; potatoes pre-cooked, but was well worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandra"
},
"reviewBody": "I love this! Everyone in my familyloves it. It's my favorite food. When I make it i use light Sour Cream, butter, and only egg whites. So its pretty \"healthy\". I love when you make the \"lighter\" version, you get the soupy stuff on the bottom. I love to dip rye bread in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SUNRENAY"
},
"reviewBody": "I used margarine &amp; light sour cream and it was a total flop. I was told not to try again with the full fat ingredients. I really wanted this to turn out and to like it. Use the full fat ingredients &amp; give it the best chance possible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djar"
},
"reviewBody": "I doubled the recipe and made it for an office pot luck. It was a smashing success. I altered it based on some of the other comments: used butter, instead of margarine; added sauteed chopped onion to each layer; added shredded colby jack cheese to each layer; and I served it with fresh, spicy salsa on the side. It was divine. It is a lot of work to make two pans, much peeling and slicing and layering, but it is absolutely worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zsuzsanna Silva"
},
"reviewBody": "This is the first dish I ever made as a child growing up in Hungary. I also use kielbasa in the layers. I lightly salt each potato layer and then drizzle it with some of the butter and sourcream mixture. Then pour the left over sauce on top. This year it will be part of our Christmas morning breakfast. I'll prep the night before and bake while we're opening presents."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivi"
},
"reviewBody": "I am Hungarian and I used to make this dish quite often, in fact this is one of my favorite. Only couple of things I would like to mention:\n\n1. The original recipe is with sausage. You cut in circles the sausage and you put these as a layer as well. If you do this, no need for seasoning, as it will give a really nice taste to it.\n\n2. I never heard of anybody doing it with margarine or butter. You just pour the cream on it, and mixed with the sausage it will give a very nice flavor. I found it that economizing with the cream doesn't pay off as it would end up dry, but I guess it depends on the taste as well.\n\n3. This part is not \"standard\" but I used to put couple of slice of bacons on the bottom just for the more taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MARKBREK"
},
"reviewBody": "I loved the taste, so did the family (except for the 11 year old)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMHalcomb"
},
"reviewBody": "I lived in Hungary and I loved this dish. I believe it is called Rakott Krumpli (stacked potato)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YellowBeetleSB"
},
"reviewBody": "Pretty good. It was a big hit at the potluck. I added red onion and worchester sauce for a kick. \n*Be sure and melt the sour cream with the butter. If you just add melted butter to the s. cream you'll get a very puffy topping that wont sink down into the dish much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bdslittlefilly"
},
"reviewBody": "I'm Hungarian and am always looking for ethnic dishes. I made this as a side for Easter and it was a big hit. I am going to make this again but will add bacon or ham and serve as a breakfast dish for brunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Parrish-Becerra"
},
"reviewBody": "ok as Always I started before I read the whole instructions.. so i will tell you the first time I didnt have sour cream so I used creamcheese added that to the butter and onions I sauteed chopped some tomato and used raw egg oh yeah I added swiss cheese to the layer... I Didnt mean to make a mess out of this recip\"correct\" way and it was YUMMY too....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarnok"
},
"reviewBody": "This definitely has potential, but needs a little zip! Maybe some mustard?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivia"
},
"reviewBody": "I LOVE potatos! and I had a few eggs I needed to use, so I thought I would give this recipe a try. IT WAS SOO GOOD!! Next time I might add onion to the butter mixture but its not like it need it. Its really good just how the recipe is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RELUCTANTCHEF"
},
"reviewBody": "Great recipe! We couldn't believe there weren't more ingredients in it...tastes much more complex than it actually is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALESIA"
},
"reviewBody": "Same Hungarian recipe my family uses, except, you have to use BUTTER.... try adding ham or Kolbas (Hungarian Sausage). It was always an Easter dish growning up, but now its a staple.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Bunny Chef"
},
"reviewBody": "Yummy! This is such an easy, inexpensive, and tasty recipe. I added some sliced kielbasa but don't think it was necessary. I also sprinkled the top layer with parsley for color and pepper. I really liked the seasoning salt flavor! The method for cooking the potatoes seems strangely complicated. I just poked the potatoes with a fork, microwaved them for 15-20 minutes and then sliced them. Leavin the skin on is not only easier, but retains the vitamins in the skins. I used low fat sour cream and margarine and next time might try to sub chicken broth for half the margarine and use fat free sour cream. Thanks for the delicious recipe! *Update* I've made this many times since, I make the sauce with pureed cottage cheese instead of sour cream (add 2 t lemon juice), 3/4 cup chicken broth and 1/4 cup light margarine. A bit healthier and still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ilona"
},
"reviewBody": "Rakot Krumpli - needs butter, butter, and more butter. Also being Hungarian and growing up with this\nvery rich dish, we use butter not margarin. When layering this dish I also add the sausage and a few pats of butter on top of each potato layer so you really get the sauce throughout the casserole. Love it and agree with others that you can't make this very often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saci"
},
"reviewBody": "This was my Mom's staple dish when I was growing up. It's super easy to make and you don't need any fancy ingredients. She used to make it with Hungarian sausage added in between the layers of potatoes, eggs, and sour cream. Where I live now it's hard for me to find Hungarian sausage and I use regular polish or other spicy or cajun sausage to substitute or just leave it out like in this recipe. It still works and my family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aahni"
},
"reviewBody": "My hungarian family makes this and it's yummy. There are a few things we do different is use real buter, we tried to use margarine and it just wasn't as good. Also we end with the eggs and sprinkle with paprika of course. No season salt in ours. Also try using heavy creme in place of sourcream. Both are yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookies"
},
"reviewBody": "One of my favorite childhood hungarian dishes my parents used to make, and in turn I make often now! This is very close to the way we make it except I do: three layers of potatoes and two layers of eggs and then spoon the sour cream mixture over each egg layer. I cover the top potatoes with some reserved sour cream mixture and sprinkle with fine, dry buttered crumbs! Yummy. On occassion I put in some sliced sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Mitchell"
},
"reviewBody": "As a child growing up, I often ate over at my friend Sheila's for dinner. This was my favorite dish. I remember it with sausauge, but as a vegetarian, this did the trick. Thanks Connie!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Fulop Chamberlain"
},
"reviewBody": "I used an egg slicer to slice the eggs and the potatoes, I also added polish sausage, next time I will try the ham. We believe that you need a meat with dinner. This is a super great recipe. Every one loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KANDIYOHIV"
},
"reviewBody": "I was disappointed by this. I felt like the ratio of eggs to potatoes was way too low. I ended up only using half of the potatoes called for because they didn't all fit in the baking pan. The sauce was okay but in general I felt this dish was way too rich. And I'd suggest slicing the potatoes ahead of time and then cooking because slicing them when they're already cooked was more difficult and messy and they ended up not being tender enough after baking. Too much work for not an incredibly tasty dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHANNSTODD"
},
"reviewBody": "I don't usually like to change the recipes much, but I only used 1/3 cup margarine and added about 1/4 cup milk to thin the sauce a little. I also didn't use the egg yolks. My husband is on a heart healthy diet. I used a suggestion on this site and added some turkey bacon to a center layer. It turned out pretty well, but next time I may put some of the sauce into a center layer so it incorporates through the dish better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Our family enjoyed it!!! I've made this dish on various occasions and always get compliments on it. I also use fat free sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ILUVDOUG"
},
"reviewBody": "I added some turkey bacon to it and some cheese since my boyfriend is one of those guys who thinks a dish is inedible if it doesnt have any meat. But it really tasted good. He ended up loving it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dejalanee215"
},
"reviewBody": "growing up, my family layed this with ham and made it a main meal! good with a salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KulinaryKeri"
},
"reviewBody": "Made as is, to give it a little more flavor added Vegeta gourmet seasoning &amp; tarragon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! The eggs and sour cream go great with the potatoes. Approved by my very picky dh. He said it exceeded his expectations! I added a little pepper. Next time I will try sauted onion in butter. Thanks for a great dish Connie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lolita"
},
"reviewBody": "i love this recipe! i used to live in hungary and this was one of my favorite dishes... and it's so simple. i use *way* less butter, though - only about 1 tablespoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow, what a surprising dish. Its great to FINALLY make something good and my husband looks over at me with wide eyes. Yep, i cooked that! Ha. I did add one varience since i only had half of the amount of sour cream, i added cottage cheese and melted it down into the sauce. Yum. And i dont even like hardboiled eggs but i liked this dish a lot. Good recipe for beginning cooks like myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wessam Zaki"
},
"reviewBody": "unexpectedly DELICIOUS!\r\nI've been making since i found this recipe\r\nIt's easy ,hassle free &amp; turns out great even though when i first did it I was so in doubt!\r\nBut it turned out great.\r\nWhat gave it a kick was a cup of ground beef(cooked with chopped onions, a minced garlic clove &amp; a bit of salt &amp; pepper)\r\nAnd also added black pepper to the sourcream"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am Hungarian and have been making this recpie for years. It is fast and easy. They way I make it is that I add sausage(any kind, but preferably Hungarian sausage) and layer potatoes, eggs, sausage, sour cream and repeat. Incredibly delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Not too bad. I needed to add a couple spices to give it some kick. My husband loved it, and so did my two year old. \r\nThanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a recipe that the lent, for the Lent Season!!! Hungarian all the way, if you have anyword this is the simplist recipe you can make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SISSI808"
},
"reviewBody": "I don't know about this being a lenten recipe--we made it for Fat Tuesday and because I used butter instead of margarine it came out really rich and good. I liked it, but it's not the kind of thing you can make every day. =)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25912/potato-and-egg-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
"name": "Potato"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25912/potato-and-egg-casserole/",
"name": "Potato and Egg Casserole"
}
}
]
}
}
, "about": [
]
}
]