				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Potato Pancakes"
,"datePublished": "2000-04-05T13:09:38.000-04:00"
,"dateModified": "2023-01-20T13:33:07.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Deanne"
,"url": "https://www.allrecipes.com/cook/24322649"
}
]
,"description": "Learn what to do with leftover mashed potatoes with this simple 5-ingredient pancake recipe that&#39;s wonderful served for breakfast with fried eggs."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hxuvCtgUeCsWJKuFn1QBJYKXshc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9442947-28119cb060704765a14389e4667a8ae8.jpg",
"height": 978,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Potato Pancakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "205"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "254 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "84 mg"
,"fiberContent": "2 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "1350 mg"
,"sugarContent": "2 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 cups mashed potatoes",
"0.25 cup shredded Cheddar cheese",
"1 large egg, beaten",
"1 teaspoon salt",
"1 tablespoon butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix together potatoes, cheese, beaten egg, and salt in a medium bowl until well combined."
} ,{
"@type": "HowToStep"
,"text": "Melt butter on a large griddle over medium heat. Drop potato mixture onto the hot griddle, 1/4 cup at a time. Flatten each pancake with the back of a spatula to 1/2-inch thickness. Fry until golden brown, about 5 minutes per side. Serve hot."
} ]
,"recipeYield": ["3"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Delaney McSorley"
},
"reviewBody": "One of my favorite things about this site is reading all the reviews! I added a bit of flour and more seasoning as others suggested, along with some chopped onion (would have preferred chives or scallions but none on hand!) The guide to measurements and cooking method and time was key for me, that's where I need help and guidance. These got two thumbs up from me and hub. We're looking forward to having mashed potatoes again just so I can make the pancakes again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bibi"
},
"reviewBody": "These were good, and I like the idea of making them on a griddle! Mom used to make these, but she always used flour, and never thought to add cheese. I made the recipe exactly as directed, and we all appreciated a trip down memory lane. I feel there was not quite enough cheese to add much flavor, but perhaps it helped to bind them together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sanzoe"
},
"reviewBody": "As written these were a mess. They need more ingredients to bind them together. The addition of flour and another egg might help that. Unfortunately this is not a recipe we would repeat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "I followed the recipe but added diced onion and 3 T flour. I’ll add 4 T flour next time. (I don’t know how this recipe holds together without the flour.) Make sure to let them cook the 5 minutes suggested in the recipe before trying to turn them over or they will fall apart. This is a great way to use up a lot of leftover mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teresa Rivera"
},
"reviewBody": "They turned out good. But using oil was a better turnout than butter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff A"
},
"reviewBody": "It’s a great base recipe for leftover mashed potatoes . I added an extra egg and 1/2 cup chopped onions (or 2 tablespoons dried chopped onion)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Paris"
},
"reviewBody": "The ingredients did not bind together enough to be able to make pancakes. My try ended up more like home fries. They tasted \"OK\" (not great), but they looked horrible. I am relieved I wasn't serving to guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I made this last night with leftover mashed red potatoes with skins. I really liked it! Super easy and fast! I had a sunny side up egg with my potato pancakes (I know, weird craving) but it was spot on!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "Of course, there were leftover mashed potatoes from Thanksgiving. I wanted to make something for breakfast and went searching for a recipe. I found this one and I'm so glad I did. I did add about 1 tblsp of flour like other reviewers suggested and they were delicious with some fried eggs and bacon strips. Thanks for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Elyse Twichell"
},
"reviewBody": "Mine totally fell apart! :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andynack"
},
"reviewBody": "Two eggs instead of one helps the patties hold together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mickey"
},
"reviewBody": "My daughter really loved it and she doesn't like mashed potatoes. Delicious added some garlic powder. Ty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Imhgtvnut"
},
"reviewBody": "My leftover mashed potatoes had been made with milk and were very soft to work with. I added a little flour to this recipe, but not quite enough. They fell apart when I flipped them over but the taste was well worth the effort. I will keep making them until they come out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ctarzwell"
},
"reviewBody": "I made these up for breakfast as a way to use up some leftover mashed potatoes . Hubby and I both enjoyed them with our eggs as a change from the usual hash browns. As some others have suggested I did add about a 1/4c of flour to the mixture as well as increased the grated cheddar cheese to about 1/2c. I would definitely make these again but think I would add even a bit more cheese next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Kruze"
},
"reviewBody": "Just the recipe I was looking for to use up leftover mashed potatoes. Simple, not many ingredients but next time I make it I’m going to add some paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail V"
},
"reviewBody": "My husband had been asking me to make potato pancakes like his mother used to make. He loved this recipe. I made it as it is and it turned out just right. I will be making them again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luv2Cook!"
},
"reviewBody": "Had to cook longer to get a crisp crust and be able to flip without falling apart. Good but then added Panko and it worked a little better. Great way to use left potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frankie"
},
"reviewBody": "Really liked this. They cooked up nicely. Added some garlic salt and chives. I may just have to make 'extra' mashed potatoes next time to ensure I have some leftovers. :-) Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ronna"
},
"reviewBody": "Really nice when I followed some of the changes. I added 2 tbsp of flour, a bit of paprika, and some garlic. I made small pancakes (about 3-4 cm across) as they are easier to flip and don't fall apart. We ate them with some Greek yogurt and really enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cskrins"
},
"reviewBody": "Fantastic ! Even my 4yr old loved them. Added like others recommend green onion, 2 tbsp of flour. Did not add garlic as the original mashed potatoes had garlic in them. Definitely a keeper!I won't be throwing left over mashed potatoes ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie Hutton-Loyer"
},
"reviewBody": "This was the first time I had ever made potato pancakes and my family and I really loved them. When I make them again - and I will make them again - I will take the advice of the other reviewers and add a little bit of flour. Great recipe, very simple and quick! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Nicole Sutton"
},
"reviewBody": "I made these cakes, per the recipe. They are very easy and quick to make, and taste great! I will change it up the next time I make it, but the recipe is good just as is. Really recommend this recipe for gluten free folk, who want a quick something to eat :-)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shlyjo"
},
"reviewBody": "Made it this morning for breakfast. Added doe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Mrykalo"
},
"reviewBody": "My kids thought the sound of potato pancakes was gross till they tried these. Now I'm hoping they'll ask for these over the other syrupie ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BonnieJo"
},
"reviewBody": "Deanne, your potato pancakes are awesome! I really like this recipe and I'm sure it will see a lot of use. Note- If you've added the 3 tablespoons of flour and they're still falling apart when you flip them, then you're flipping too soon. You have to let the bottom get fully browned and firm before you try. It also helps to use a rounded spatula. Thanks again for sharing this. We all loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Queen Llemon"
},
"reviewBody": "I loved them, the kids didn't get past one bite each - didn't like the texture. Too bad for them! ;) The only problem is we never, ever have leftover mashed potatoes lol. If I make more, they eat more! These stayed together nicely and were easy to flip. They would be awesome with bacon &amp; onions, like big unrolled perogies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda Glaeser"
},
"reviewBody": "Rather bland as written. Need to add some onion (white, green or minced, dried). Do not flip too early, they will fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "Added flour like suggested. My husband went back for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaQ"
},
"reviewBody": "Added a bit of shredded carrot and a bit of rice milk since the first pancake wasn't sticking together so well. Easy, delicious and a fast meal by just adding salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kelly Kimball"
},
"reviewBody": "These are WAY too salty. But maybe it was because of the bacon I added, and the potatoes were already salted too.. Kinda weird anyways. I won't make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prodigal"
},
"reviewBody": "These were quite good! I added a little garlic powder and a few chopped green onions. I also added a little flour to hold the batter together better. They would be even better with some sort of sauce on the side, or sour cream and applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tina Cook"
},
"reviewBody": "This recipe is not for me. The cakes are too dense for my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenfwb"
},
"reviewBody": "If you find that your potato mixture is too runny, just add instant potato flakes instead of flour. Also you'll want to chill these prior to cooking to help alleviate the 'falling apart' problem. What I did was scoop them out with an ice cream scooper, rolled them in panko, placed them on a plate and stuck them in the fridge. When you're ready to cook them, just squish them down a bit when they go in the pan so you're not trying to fry a ball! :) Experiment a bit with spices like minced onion, garlic powder, or even ranch mix! For the basic recipe I'm giving this five stars...they're great if you're careful with prep and execution. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gideon"
},
"reviewBody": "To anyone saying they are bland, this is a very basic recipe you can build upon. The trick is in boiling them with flavors and then adding a little pizaaz to the mix once mashed. I added minced garlic, onion salt, basil, chili powder and whole grain mustard in with the boiling liquid and instead of using water I used a mix of veggie and chicken broth. I'm adding chopped green onion to the mash and a spoon of parmesan with the cheese also. Its very good as a starting point as a base recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ray Long"
},
"reviewBody": "i made this and added 1/4 cup bisquick and garlic salt to my taste, and they were awesome! the original was tough to keep together is why i used the bisquick. it worked gooood, served with haluski"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My first time making potato pancakes and these turned out pretty good! However, I would add less salt next time and add some flour. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "morsecan"
},
"reviewBody": "I used 2 1/2 cups of potatoes and 1 cup of Bisquick, added onions, a 1/2 tps of cayenne and kosher salt. Cooked on low. Be sure to could at least 10 minutes or more to make turning easier! They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSCANUCK"
},
"reviewBody": "These are so good! You do have to let them get good and browned then they will turn perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLIOOP109"
},
"reviewBody": "Delicious!! I read several of the reviews before making my batch. I needed to use up some leftover mashed potatoes. They were lightly seasoned, so I added in plenty of cheese, green onions, bacon bits, a touch of minced garlic, and a tsp of salt. I also added in 3T of Gluten-free Bisquick, as recommended by many reviewers. I used a large skillet, 2T butter to sautee the pancakes. I formed the pancakes by hand and smooshed them down a bit. It made about 8. I cooked on medium heat for about 5-8 minutes on each side. They were perfect! Crispy outside, warm and creamy inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milk-N-Hunny Mami"
},
"reviewBody": "This is a great basic recipe. They are great on their own or you can dress them up with anything you like. My kids like them way better than just plain mash potatoes. Sometimes I add bacon bits to mine and serve with sour cream or plain yogurt. They are like a loaded potato pancakes. Watch the consistency of your batter; depends on how thick you make your mash potatoes. If it is a bit runny you can do as some of the other reviewers suggest and added a little flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorna"
},
"reviewBody": "This is great for left over mashed potato, my 10yr old loved these and was nice and cheesy too. Will defiantly do these again. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terisa"
},
"reviewBody": "Easy and delicious! I added 2 tablespoons flour, crumbled bacon, garlic salt and cayenne pepper. I also cooked them much longer because we like them extra crispy! My husband and kids loved them! No left overs!!! Soooo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Layna128"
},
"reviewBody": "Just made these- they were a great recipe for my leftover mashed potatoes. Next time, I will not add salt. I usually don't mind salt, but between the salt from the cheese &amp; the salt already in the prepared mashed potatoes, these were a bit too salty. This recipe as listed is 4 stars. Very basic &amp; easy. Next time, I will add some garlic or veggies for a yummier potato pancake. Also made these thin &amp; no bigger than a sausage patty. Had no issues with breakage/mess making them this size. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bonza"
},
"reviewBody": "good stuff - but add 1 diced jalapeno for pep"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyMom"
},
"reviewBody": "We loved these. I added onion powder &amp; baking bits. They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LISA"
},
"reviewBody": "Delicious! I took the advice of another reviewer and added a 1/3 cup of flour, other than that I followed the directions exactly. I found that 5 minutes on each side was a little too long, so on my second batch I only cooked them for 4 minutes on each side and they were golden and perfect. Will definitely make again! What a great way to use left over mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Me"
},
"reviewBody": "These were good. The mashed potatoes that I used had a lot of cream so I needed to add more flour for them to stick together. I also increased the cheese to 1/2 a cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "harlgr8dane"
},
"reviewBody": "Very good and great way to use leftover mashed potatoes!\nI only used a pinch of salt though. \nNext time I will add either some onion or bacon for a little more flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette"
},
"reviewBody": "I make these when my sister or I have tooth aches or pain in our jaws, or when we're just in the mood for something different! They're really good and even better with ketchup on them! I like to add just a little more cheese, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nEVeRmOre0069"
},
"reviewBody": "This served as a great base recipe. I used the same amount of potatoes and cheese, but I added an additional egg and diced leftover spiral ham. The pancakes turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAGEXDRIA"
},
"reviewBody": "I add onion to them too....yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickdee"
},
"reviewBody": "I made these for brunch today from leftover Thanksgiving mashed potatoes. Very good! I did add 2 eggs and scallions. Do cook these at med to med/low so they cook through and crisp without burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jespe"
},
"reviewBody": "These are excellent. very adaptable to items you have on hand too! I added a few bacon bits, and parmesan as well as cheddar and some green onions--a couple shakes of bisquick does help hold these together! YUM! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Savithri"
},
"reviewBody": "Was expecting much better given the high rating and positive reviews. However, the potatoes were incredibly overpowered by the tasted of burned cheese, even when I undercooked the cakes. Will continue my search for a decent potato pancake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Minnesota_Girl"
},
"reviewBody": "I used to beg my Dad to make these for me whenever we had left over mashed potatoes. I still love them as an adult. Highly adaptable, throw in what you like. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizjowers"
},
"reviewBody": "Fun way to use up left over mashed potatoes! I added sliced green onions to the batter and made the pancakes small to they were easy to manage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "great way to convert leftover mashed potatoes to a breakfast item."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melisa Richbourg"
},
"reviewBody": "I added 1 more egg, 1/4 cup o flour and 1/4 of fresh chives. I fried them in bacon fat with oil and butter - just a small amount in a cast iron skillet on medium. They have been awesome both times I've made them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Litegal1"
},
"reviewBody": "I was quite pleased with these. Used left over mashed potatoes and added green onions (a must after having tasted them). Mine were a little soupy as well, so I had to quickly grab a pinch of flour. Didn't think they'd turn out, but they did. Will make again as I'm always on the lookout for recipes using leftovers. Served with Spanish Omelet and fruit salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan B-R"
},
"reviewBody": "YUMMY, YUMMY, YUMMY!!!! This is the only Potato Pancake recipe you need. After reviewing other people's feedback here are some additions that I made. I added chopped up leftover bacon (could do the same with sausage), three tablespoons of flour, a pinch of garlic salt, a pinch of pepper, and onion to taste (recommend you fry up the onion first). Recommend you make them a little bigger then a sausage patty. I made six nice size pancakes with the current measurements. Recommend doubling if you are cooking for more then just three people. Cook on medium heat. Be patient, if you cook them too high you will burn them and the middle will not firm up. This one is husband approved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "craftman"
},
"reviewBody": "this recipe says to use griddle but gives no cooking temp.i tried this with no cheese and cooked five mins on side before trying to flip and did not stay in pancake form while trying to flip to cook other side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gtyyup"
},
"reviewBody": "These were so good and so easy!! The cheese really made them tasty. I followed the directions but did use bacon grease instead of butter. We had them with grilled steaks for dinner. The next morning we had the leftover steak and potatoes with eggs for breakfast. Delicious!! Will definitely make these again~many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danky.mama"
},
"reviewBody": "So I am making these now and have figured out that if you don't flatten them out enough they will fall apart. I also think that a lower heat is better. My first batch was on med high and I couldn't flip them at all, I threw them out. I lowered it to med low at 5 min a side and they are perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rose"
},
"reviewBody": "Everyone loved this recipe....I did add 1 tsp onion powder since other recipes call for some onions and my kids don't like them. I also took the advice of some of you and added 2 TBSP of flour to help them stick together. Served with sour cream and homemade applesauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fasttyper888"
},
"reviewBody": "Very nice. The recipe is great. For me, I can add some things to make the more tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Couto"
},
"reviewBody": "Perfect. Next time I might add some bacon bits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "abreitbach"
},
"reviewBody": "Added the following: 1/3 C flour, onion flakes, garlic salt instead of salt. All told, this recipe is good, but a little bland for what I like. Wish I would have had a fresh onion to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amina Smothers Lessis"
},
"reviewBody": "needs more seasoning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia A. Cushen"
},
"reviewBody": "I remember my mother making these and could never find the recipe so grateful for this recipe. Was so easy to make and they were just like I remembered. Thanks so much I am making them today, I made extra potatoes so I could make them. Thanks again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I have tried several times to make these and they are not really crispy enough to pick up. Maybe this is the way thay are supposed to be and I just don't like them??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Baby_Ruth"
},
"reviewBody": "I've been eating these as well since a kid. You know I've never thought to add cheese. I've always added a lil' white onion. No onion this time, used your recipe. The cheese gave them a lil' firmer texture and they were wonderful. My husband normally doesn't care for these because of the center being soft, but he really liked these. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Clarissa Spehl"
},
"reviewBody": "Still on the lookout for the perfect potato pancake recipe! This fell apart too easily during the flip and just wasn't crisp enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sallie Tierney"
},
"reviewBody": "I resisted the temptation to tinker with this recipe before tasting it and I was glad I did. The one change: bacon grease for frying. Served with a dollop of sour cream on the side, it was excellent. Lots of potato/cheese flavor. Crispy on the outside, creamy on the inside. Nice contrast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEKITTY"
},
"reviewBody": "After following other readers' suggestions, I also added bacon pieces and scallions and they were delicious! They did fall apart easily if made too thick, but keep them small, flatten them out and let them crisp good and they're perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Norman Hastings"
},
"reviewBody": "We call these \"Potato Cakes\" and those made with raw grated potatoes are \"Potato Pancakes\" (like latkes). We add flour to the mashed potatoes and also dredge in flour before frying. We don't add cheese or onions or garlic (never tried that). My friend puts bread crumbs on them (I'm not sure if she also puts it IN them?), but they're good that way too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "My family and I really enjoyed this recipes. I added bacon bits and chopped onion and a smidge of flour. Very very nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "Thank you for the great recipe. My potato pancakes to out crispy on the outside and creamy on the inside. Loved the addition of cheese. The trick to these are to make sure the mixture is cold consistency. After adding all ingredients I place it back into the refrigerator for an hour. Then took and coated them in flour before cooking them in butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kasibee"
},
"reviewBody": "Is a very nice recipe to build from, and use your leftover potatoes. I did add the flour as others suggested and worked very well. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cookiemama"
},
"reviewBody": "I should have read the reviews before I cooked these...I was misled by the high number of stars. I wish I would have known to add flour or bisquick b/c without it these fall apart in the pan. My \"pancakes\" looked more like scrambled eggs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sav87"
},
"reviewBody": "These were so good! I did make a couple of changes though. My mashed potatoes were made with red potatoes and had little bits of the peel still in them. I decided to leave the peels and see what happened. I also added 1/3 cup of flour and a little garlic powder. I didn't have cheddar cheese so I used hot habanero cheese instead. I topped them off with a little sour cream and they were delicious! Great use of leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marisa R."
},
"reviewBody": "Yummy! These are a little tricky to get the hang of, sorta like real pancakes, the first few turn out a little funky but still good. I added chives from my garden to these potato cakes. Warning though, be careful how much salt you add to the cake recipe, depending how much salt you put in your original mashed potatoes. I didn't add any because my mashed potatoes were already seasoned enough in my opinion the first time around. Thanks for the recipe, I will come back to make these again when I am questioning how to use leftover mashed potatoes! Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wickie"
},
"reviewBody": "This is the first time I ever made potato pancakes for my husband and he LOVED it. I usually make mashed potatoes made with chives and sour cream and have left overs. I did add 3 TB of biscuick as someone else suggested to give it a lift .. YUMMY !! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fabfive"
},
"reviewBody": "These were great,I also added about 1/4 cup of flour. I also added garlic salt,bacon bits and green onions.They turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kel514"
},
"reviewBody": "For mashed potato pancakes, which usually lack in flavor, these were very good. I had a difficult time keeping the pancakes together. I didn't give it 5 stars, because I really don't think that potato pancakes really deserve five stars. That's just me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamison"
},
"reviewBody": "By far the best Potato Pancakes recipe I have found!! My only change was cut the salt in half and replace it with Onion Salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "This was a GREAT recipe! My husband loved them. It reminded him of when his father made potato pancakes when he was a child. I made the same changes as other reviewers. Adding 1/4 Bisquick to the recipe helped hold it together and adding the onions andn garlic salt made it very flavorable. Thanks to Deanne &amp; the other reviewers for making this a favorite in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "christian1"
},
"reviewBody": "the flavor was great when i added onion. but the mixture did not hold together well enough to flip and keep its shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "Excellent recipe. Will add a little flour next time, to give it a less mushy feel. Overall really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "My family loved this dish!!! It was very tasty!! The cheese added a GREAT flavor. The only thing I had to do different was add flour. When I tried to follow the original recipe... My mashed potatoes stayed mashed potatoes. When I added flour to the mix... they turned into golden brown goodness!! Thanks for sharing your recipe. We really enjoyed it!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb McCleary"
},
"reviewBody": "Yummy! I added milk and self-rising flour. Fry on low heat in a little bit of oil, you can see the tops start to bubble like regular pancakes, check for a golden brown color on the bottom and flip. Cook slowly (low heat) until browned. These came out crispy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robbin J Kostewicz"
},
"reviewBody": "This is a very good starter recipie for potato pancakes. So many personal taste modifications can be made. I did add 1/3 cup flour, 1 tsp each of onion &amp; garlic powder along with 1 tbs parsley. To cut down on the fat content, I used pam instead of butter, &amp; 2% shredded cheese. They are easily turned if cooked slow and allow to brown, pressing after turning. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "These pancakes were good, but extremely messy to make. I had a lot of trouble flipping them in the pan. I may try this recipe again and make some modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abbsyroe"
},
"reviewBody": "wow if i could, i would rate it 1000000 stars!!!!!!!!! it is great, especially if you add some basil on them. i used chedder and parmesan instead of just chedder, because i was almost out of chedder and didn't have enough. but the parmesan adds to the potatoes very nicely. oh and we didn't have potatoes so i used Idahoan instant mashed potatoes and it was awesome!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Joy"
},
"reviewBody": "This is the best way to use up leftover mashed potatoes! The recipe as is is a bit bland - at least I like to add green onions and pepper. It is one of those recipes you can alter in a million ways though - the base is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ARATMARIE"
},
"reviewBody": "I should have read the reviews about the flour, because I ended up with sticky, messy, hard to turn globs of potatoes. Tasted ok, but not worth the hassle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANNA_J"
},
"reviewBody": "When I made these as the recipe called I had a big mess. Turning them was almost impossible. I read the reviews and added flour and that made such a difference, they actually turned and looked like pancakes. I'm only giving 3 stars because as is the recipe isn't that great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTWhite"
},
"reviewBody": "Awesome way to use up leftover mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kraftykidd"
},
"reviewBody": "I used some frozen mashed potatoes left over from thanksgiving. I left out the cheese and added 2 tablespoons of flour. I also made a sauce with a teaspoon of capers, 3 tablespoons of mayo, a teaspoon of dijon mustard and 1/2 teaspoon of red wine vinegar. My parents really enjoyed them!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18028/potato-pancakes-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
"name": "Potato"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1545/side-dish/potatoes/potato-pancakes/",
"name": "Pancakes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18028/potato-pancakes-ii/",
"name": "Potato Pancakes"
}
}
]
}
}
, "about": [
]
}
]