				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Potato and Cheese Pierogi"
,"datePublished": "2019-04-03T23:27:44.000-04:00"
,"dateModified": "2022-07-14T15:53:06.000-04:00"
,"author": [
{"@type": "Person"
,"name": "BOB_E_72"
,"url": "https://www.allrecipes.com/cook/183600"
}
]
,"description": "This recipe is an Ukrainian one of my Great-Grandmothers passed down from the years. They are great with melted butter and sauteed onions, or fry if desired. They can also be frozen between layers of plastic wrap."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AWCumdGpoq9A114rNqVAUs3pNCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5969304-9d7bc02799b1453bbc9d30489225ea07.jpg",
"height": 1042,
"width": 1303
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5858996592001",
"description": "Classic Ukrainian and comforting cheese dumplings.",
"duration": "PT1M19S",
"name": "Potato and Cheese Pierogi",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/55ca4734-9e60-432e-bc3e-20b0b16e34c0/4537a282-c64e-44ff-8041-8144f16692ce/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:34:24.841-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Potato and Cheese Pierogi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "67"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "97 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "15 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "103 mg"
,"sugarContent": "1 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT120M"
,"recipeIngredient": [
"6 cups all-purpose flour",
"3 eggs",
"1 pinch salt",
"water as needed",
"5 pounds potatoes, peeled",
"1 pound processed cheese, cubed",
"salt and pepper to taste",
"onion salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "Combine flour, eggs and salt. Mix in a little water at a time until dough is somewhat stiff. Roll dough in small sections about 1/4 inch thick. Using a large biscuit cutter or drinking glass, make circle cuts."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/AWCumdGpoq9A114rNqVAUs3pNCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5969304-9d7bc02799b1453bbc9d30489225ea07.jpg"
}
]
,"text": "To make filling: Mix together potatoes, cheese, salt, pepper and onion salt. Fill each with 1 to 2 tablespoons of the potato mixture, fold over and seal edges. To cook, bring a large pot of water to boil, carefully dropping in one at a time; stir once. They are done when they float to the top."
} ]
,"recipeYield": ["60"]
,"totalTime": "PT130M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TomBoeding"
},
"reviewBody": "Easy direction"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean Lally"
},
"reviewBody": "This is an excellent recipe. I increased the yield to 36 due to the labor-intensive nature of preparation. I would highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delicate Flower"
},
"reviewBody": "These are wonderful! And relatively easy to make. Wonders upon wonders the recipe made as many as it stated. We did leave out the sautéed onions and put in a whole pound of bacon. The only problem was that I had my grandkids help me make them and I barely had enough left for my hubby’s dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "I had to make 3 batches of dough for 5 LB.s of potatoes, but is very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rudy"
},
"reviewBody": "Easy to follow steps, they tasted great. I pan fried after boiling with onion and butter served with sour cream. So delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Fahr"
},
"reviewBody": "We made these and sauerkraut pierogies. They turned out delicious. Reminds me of my childhood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cynthia Hocevar"
},
"reviewBody": "I add some of the mashed potato to the dough. Keeps it from getting tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "lol I did not make it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jo-Anne Kudzia"
},
"reviewBody": "You should add some sour cream to the dough and knead it about 50 times before letting it rest. The filling here is good but our family uses either cheer whiz with the potato mix or make your own combo with cheddar parmesan etc.. The dough is also good to fill with fruit but coat with honey so doesn't stick, or serve with any filling with sour cream. Yummy, ! Every family has their own recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAMB"
},
"reviewBody": "My Grandmother who was polish made this recipe the same way with one exception: our family uses Extra Sharp Cheddar cheese and Longhorn cheese mixed with mashed potatos. After we boil we fry up onions and butter and saute' the pierogi in. Makes a great side dish for the holidays (Christmas, Thanksgiving etc.) Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skeet"
},
"reviewBody": "I'm not a chef I just try to see if I can follow instructions. It came out just like my Ukrainian friend use to make them. Smothered in smoked sausage and butter. I had some filling left over so we had shepherds pie one day. I was surprised, they seemed to expand during the boiling process."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chrissy Campbell"
},
"reviewBody": "This is a good recipe but I think it's missing a step. After boiling (you can freeze some) but I always pan cook them for a bit with some butter and sprinkle some garlic and ranch powder on them. \n\nI would double the dough making ingredients, just wasn't enough. Other then that this recipe is lovely!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol West"
},
"reviewBody": "Shortcut for dough: Mix in food processor until small granules form and dough is workable. Run through pasta machine until desired thickness is achieved. Cut with cutter or large mouth glass. Fill and seal using a fork to press edges. Filling is much the same except for real cheese, chopped onion sauteed in butter and smooshed up with the cooked potatoes. I serve with cooked, chopped up bacon and more sauteed onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Candice Bobandice"
},
"reviewBody": "It's a good recipe, but like one other user mentioned you absolutely have to let the dough rest. I recommend letting it rest for a 15 to 20 minutes. If you try to use it right away you will seriously regret it ha ha, it's already very hard to use and not letting it rest makes it 10 times worse. Thanks for the recipe :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "carolyn"
},
"reviewBody": "Shred cooper sharp cheese instead of processed cheddar. It makes for a much more tasty filling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen Cousineau"
},
"reviewBody": "You forgot to say you need to mash up the potatoes and cheese should be grated not cubed! Lumpy pierogi is what you discribed here"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "My household uses this recipe pretty regularly. We opt out of using the processed \"cheese\", but only as a preference. For our family of four use cut it down to 20 servings, but during holidays we'll do a full batch. Either way it does not disappoint. Boil them up and finish in the fry pan or freeze them after boiling and"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Antoinete Demeter"
},
"reviewBody": "They rock"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelbyray71286"
},
"reviewBody": "Very good recipe! !!!! After boiling them I fry mine for about a minute on each side.... perfect!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Weed"
},
"reviewBody": "This is the one my Husband loves as it is an old family recipe similar to his mothers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline P Slattery"
},
"reviewBody": "My friend and I made a bunch of these last night and I loved them. \n\nWe ended up making 19 (I'd scaled the recipe down to 20) and used an empty wine bottle as a rolling pin so it was really fun! We also substituted Shedd's Spread for butter and it turned out fine.\n\nOne piece of advice she had from her memories of visiting Poland and watching family members make pierogies in the past was to wet one side of the inner dough like the seal of an envelope and then squeeze the edges together (one finger on the top, two on the bottom) to make a scalloped edge. This also pushed the filling in towards the center, making it easier to seal. \n\nBe careful not to overfill and make sure the potatoes don't have any large lumps because that can tear the dough. \n\nWe boiled them and topped them with some golden brown sauteed onions and garlic and I brought leftovers to work. A six way fight broke out at the office over who got the last one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Smith"
},
"reviewBody": "These were very good and easy to make. The dough was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PristyGirl"
},
"reviewBody": "tried these today used 3 cheese mashed potatoes with pan fried onions. They are yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori K. Bogren"
},
"reviewBody": "I used velveta for the cheese. Family loved them!! Even the left overs were warmed up and dipped in ketchup or ranch. Yummm!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brownie1"
},
"reviewBody": "I made this recipe today. They were good but you have to add more flavor to the potato mix or pierogis' will be bland. I added garlic salt and parsley flakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn Bartsma"
},
"reviewBody": "sauted onions and butter is the only way to eat them. We use sharp cheddar and leave out the onion salt. I could eat these all day long. I would have given a 5 star rating is they would have said cheddar instead of processed cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stephen"
},
"reviewBody": "The best pierogi I have ever tasted is, but of course my mothers who is ukranian. I have tried many others from resteraunts to authentic venders,but nothin compares. The cheese that she uses is a pressed dry cottage cheese &amp; potato mixture and to me its the only way to make them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Welgoss"
},
"reviewBody": "A FEW more TIPS, yes this is the basic recipe that works well. Do not over-work the dough or it will become tougher. Put dough in the refrigerator for about a 1/2hr. and it will not be as difficult to roll out as the elasticity will decrease. It should be served by melting butter or margerine and saute with onions, pour over pierogi before serving with sour cream on the side (or fry them for a a few minutes to get a slightly browned crust). Filling can also be drained cottage cheese or farmer cheese (which is better), sweet or sour cabbage, mushrooms/sauteed/w/butter or apricot or plum filling (more of a dessert) If edges don't seal properly, apply a little water to the edge with your finger, a good seal is necessary. Dough should be as thin as possible, not like ravioli!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lons65"
},
"reviewBody": "Just wanted to share a tip that I have learned after making Pierogis for the last 10 years. Cook the potatoes until soft . Don't use a mixer to mix up the potatoes ... use a RICER and pass all the potatoes through it, then add the cheese and whatever seasoning (I use garlic powder). Mix with your hands until the mixture changes color. Also, don't fool around with the wet spoon to seal the edges. User your fingers. Isn't that part of the fun of cooking??? Let the dough rest covered at room temp before making circles. Keep the size of the dough you are working with to about the size of a grapefruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eileen Violet"
},
"reviewBody": "As a Polish girl, I had to add my 2cents.....my mother (first generation Pole), God Bless Her, always used sharp cheddar, none of this \"onion salt\" stuff, keep it real, and served it smothered in sauteed onions and butter.......yum.....I just needed some tips on the dough......."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brittany"
},
"reviewBody": "Yes the filling was great with sauteed onions and also was about 3x as much as the dough. It was my first time making them and my boyfriend loved them! I will make the circles bigger next time so there is more filling, I cant wait to try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sloppy Chef"
},
"reviewBody": "Just reading the ingredient \"processed\" cheese makes me shiver. I have been using Farmer's cheese in my filling for over 20 years and I think it makes a huge difference in taste. This was the preference of my Ukrainian gramdmother, too. Also, I sautee finely chopped shallots in butter and add those to the filling as well. It adds more flavor than the onion salt (I think). The easiest way to fill them is to use a round biscuit cutter. Take the round cut out pieces and give them another quick roll in each direction and they will be ready to fill. Also, to seal tightly without having them leak, I keep a teaspoon in a bowl of water and very lightly moisten the inside edge with the side of the spoon before doing the \"flour pinch\" to close them. They freeze extremely well, but don't forget to separate the layers with either plastic wrap or wax paper! Any way you look at it, these are DELICIOUS! I can never get enough of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyDays"
},
"reviewBody": "I scaled the recipe down to 20 servings and there was still a ton ton ton. It wasn't too hard to make - there are a lot of people who say the dough is hard to work with, but it's not if you have enough flour on your rolling surface. There was definately about 3 times too much filling... I also added bacon and sauteed onions to the filling. It was soo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mariel 89"
},
"reviewBody": "I make pierogi every Christmas, and this recipe is similar. Just some tips to make things easier....after mixing dough place on floured board and put a bowl over it and let it rest for about 20 minutes. I use cheddar with the mashed potatoes, and also make a sauteed cabbage and onion filling. Boil and then saute in butter with onion added or not. Lots of work, but the whole family pitches in and we make enough for a few times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scoopdujour"
},
"reviewBody": "I just wanted to add some possibly helpful info for future pierogi-makers. My family is Ukrainian, and we make these every Christmas, sometimes more. I use 6 cups of flour, and can make 40-50 4-inch or larger pierogi. We roll a ball (fits in 2 hands, not too big) flat, then cut it into squares. We then rolleach square individually as thin as possible, put in about a tbs. of filling, and fold corner to corner. When pinching the edges, you have to smear and smudge a bit. I'm sure every family has their own recipe, but this way you don't have soooo much dough in each bite. I also jazz up my filling with browned onion, s&amp;p, and sharp cheddar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The dough is easy to make and works well. I just made potato and onion filling and it was fine. I just quartered some large onions and tossed them in with the spuds. then when mashing I added some minced garlic and extra salt and pepper to taste. THen just omitted the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Gutowski"
},
"reviewBody": "The first time I made these they were OK, but a bit bland. The second time I lightly sauteed some fresh onions and added that to the mashed potatoes along with some shredded cheddar. After I boiled them and let them cool slightly I sauteed them in garlic butter. Much better and alot more flavor. I will definately make these again. My husband's family is pure Polish and they liked them. Being an outsider I am happy when they are pleased with my cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer McClanahan"
},
"reviewBody": "This is like the recipe I use, but I use real cheddar and I add a big blob of sour cream to the dough.\n\nAlso, half of them I make with sauerkraut filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole Smat"
},
"reviewBody": "Very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Eshkenazi"
},
"reviewBody": "I made some of these directly according the recipe, some with green onions added and some were fried instead of boiled. the boiled ones without onions were a little bland--not the filling really but the dough was a little lacking in flavor. The fried ones were more flavorful and I definitely liked them better. The onions were a nice addition but I liked the ones without onions too. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cooking_Mom"
},
"reviewBody": "Good recipe, but double the dough or you are left with too much filling. Also, once they are boiled, I sautee some butter in a pan add fresh garlic and some dried or fresh parsley. Put the pierogi are in a bowl, pour butter mixture over and toss. Also can add a little crumbled bacon. Salt and Pepper to taste. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TCPOKIM"
},
"reviewBody": "I should have read the reviews first... cause I found out the very same things myself, the hard way. I put the recipe to 20 servings. I got 9 perogies out of the dough, and enough filling for 30. But they were big perogies - eough for 3-4 people. Even with real cheese, and lots of salt they are bland, but thats the way they're suppose to be - especially from Ukraine. I don't care for them, but my husband does, especially with sauerkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Meade"
},
"reviewBody": "They're kind of bland, but that's how pirogies are. Set it up for 20 servings, only had enough dough to make 9, but plenty of filling. Not bad for my first try though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emrilwannabe"
},
"reviewBody": "The company I ade these for said they were very good. I had never mae them, so it wasn't bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ethanismarsh"
},
"reviewBody": "very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WANTTOKNOW"
},
"reviewBody": "I made this once and my son keeps asking me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Mickey Kissell"
},
"reviewBody": "my husband like these alot. only thing is i had more potatoes than dough. will double dough next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23706/potato-and-cheese-pierogi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23706/potato-and-cheese-pierogi/",
"name": "Potato and Cheese Pierogi"
}
}
]
}
}
, "about": [
]
}
]