				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pressure Cooker Beef Stew"
,"datePublished": "2019-04-03T23:32:44.000-04:00"
,"dateModified": "2022-08-30T14:03:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MISSCANADA"
,"url": "https://www.allrecipes.com/cook/1046765"
}
]
,"description": "This pressure cooker beef stew recipe features tender cubes of beef cooked with onions, carrots, and potatoes in a thick gravy in just 30 minutes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/I0fgVm42R9Pe1OBEKvKiKfWP4-E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6446139-87df40dcf7a64983ae0efcd2574c7087.jpg",
"height": 2000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pressure Cooker Beef Stew"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "140"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "42 g"
,"cholesterolContent": "76 mg"
,"fiberContent": "6 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "900 mg"
,"sugarContent": "4 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"2 pounds cubed beef stew meat",
"1 small onion, diced",
"2 cups water, or more as needed",
"5 carrots, peeled and diced",
"2 cubes beef bouillon",
"8 medium baking potatoes, peeled and cubed",
"2 teaspoons cornstarch",
"2 teaspoons salt, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in the bottom of a pressure cooker over medium-high heat. (If the cooker has an insert, remove it, and cook directly in the bottom of the pot.) Add beef and onion; cook until beef is browned on the outside."
} ,{
"@type": "HowToStep"
,"text": "Stir in 2 cups water, carrots, and bouillon cubes. Close the lid and secure the pressure regulator. Heat until mixture sizzles, then reduce heat to medium and set the timer for 20 minutes. If you have an adjustable pressure regulator, set it for 10 pounds of pressure."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, place potatoes in a saucepan with enough water to cover. Bring to a boil and cook until tender, about 10 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Let pressure release naturally according to manufacturer&#39;s instructions, 5 to 10 minutes. (Mine must sit under cold running water for 5 minutes until the lid can be released.)"
} ,{
"@type": "HowToStep"
,"text": "Remove the lid and place the pot over medium heat. Bring to a boil. Stir cornstarch into a small amount of cold water in a small bowl to make a slurry. Stir slurry into stew; cook until thickened, 2 to 3 minutes. Add potatoes to stew or place in serving dishes and ladle stew over them."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lyecats"
},
"reviewBody": "Not bad for a few ingredients as it calls for. I would use it in a pinch. I agree that it should be dressed up some with bay leaves, pepper corns and red wine and additional veggies like mushrooms and peas. I also agree that perhaps the carrots get added 10 minutes in to the pressure cooking length of 20 minutes. It's a GF recipe which is a good thing for celiac."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elysummers summers"
},
"reviewBody": "This recipe is delicious. However, it is not necessary to run water for FIVE minutes (wasting precious water) to let your pressure cooker cool down. My mom used to use a cool wet cloth to start the cooling process. Or just let it cool on it's own, it only takes a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nick1129"
},
"reviewBody": "This isn’t the first time I’ve made beef stew in a pressure cooker but it’s been a while. My other pressure cooker died and I wasn’t going to replace it. I couldn’t stand it anymore. I missed my pressure cooker! I really missed making my own sauerkraut and faster corned beef. So, I got another one. I took into consideration some of the changes other people made. To my stew I added celery, garlic, green peas, tomato paste, a splash of red wine, and used beef broth instead of bullion and water. All these additions I had on hand. I cooked the potatoes with the stew of course. I thought it rather odd to cook them separately. The meat portion I cooked for 15 minutes, cooled the cooker, and added potatoes, celery, and carrots. Cooked another 10 minutes. Cooled again and added peas and flour (not corn starch) to thicken. It’s pretty much how I would make it if I hadn’t used a pressure cooker only that takes a lot longer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple to make and delicious. I added a little bit of cumin, oregano, and 2 bay leaves. I also used beef broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "david.fowler57"
},
"reviewBody": "added 1red , yellow orange and a jalepeno. peppers, more garlic. kicked it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Kilby"
},
"reviewBody": "i added sweeet potato as well a potato. Great to eat something with vegetables in it that tastes good as well. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Irons"
},
"reviewBody": "Wow! I am super impressed how well this turned out given that there are very few ingredients and the cooking time is so fast. I served over mashed potatoes. I added the carrots at the 10 minute mark, and they still ended up a little soft for my liking. I use a stovetop pressure cooker with a heavy jiggle weight. Next time I might put the carrots in at the 15 minute mark so that they only cook for 5 minutes. The only other change that was made was that I substituted beef granules for the bouillon cubes (1 tsp in lieu of one cube). I rate the recipe five stars due to its simplicity and great taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chefjoan"
},
"reviewBody": "Incredibly bland. Very tender way of cooking stew meat but added dry thyme, garlic, tomato paste, more bouillon cubes and a half cup of red wine before it had some real flavor. Thickened with a flour slurry, rather than cornstarch. Cooked quartered potatoes in the finished product rather than a separate pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "I cheated and used frozen veggies and canned potatoes since I had them all on hand. Also used a tad bit of tomato paste. Very good. Love one pot meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Palka"
},
"reviewBody": "Easy and tasty meal. Added crushed garlic for added flavor. Whole family liked. It didn't make 8 servings in my house though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Anna"
},
"reviewBody": "We would give this solid 4 stars if the meat was tender. My family found that the carrots and the meat needed to be cooked about 10 minutes longer . We would make this again with the adjustments as mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joseph hardy"
},
"reviewBody": "Recipe was good. I rinsed a can of sweet peas and added. Also baked a can of flaky biscuits and baked separately. Cooked biscuits, split, and put on top of hot stew.\nReceived comments as best yet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NicoleG"
},
"reviewBody": "Beef was a little tough and the gravy was light colored. Rather bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dr Michael C. Marrs"
},
"reviewBody": "i added double the beef (2lbs) cut into smaller pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Irma Trantham"
},
"reviewBody": "I didn't see the need of cooking the potatoes separately when having a pressure cooker is supposed to make it easier with one pot cooking.... so I chopped my potatoes and my carrots very small and put them in with the beef cooked it and it turned out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abi Kemp BenAsher"
},
"reviewBody": "loved it, had some veal broth saved and added instead of the water and boulion... but never did this in the pressure cooker, i am sold!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lora Johnson"
},
"reviewBody": "Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monib"
},
"reviewBody": "This is a very good base recipe. Of course I made it my own by adding 3 ounces of sliced mushrooms, one teaspoon of Worcestershire sauce, garlic and onion powder to taste and 1/2 cup of red wine. I pressure cooked it for 10 minutes; added the potatoes and pressure cooked it another 10 minutes. I think 8-9 minutes of pressure cooking for the potatoes because they came out really soft after 10 minutes. We will be making this again. So glad to find this pressure cooker recipe for stew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flyingfingers51"
},
"reviewBody": "Good recipe that lends itself to adaptation. We used less meat and more veggies...watching our weight and red meat consumption. Also cooked meat and onions ten minutes, then added potatoes, carrots and some frozen peas, brought back up to pressure for another ten minutes. It was a delicious meal on a cold winter's evening. And lots of leftovers, since there are only the two of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Howard"
},
"reviewBody": "Tasty. I browned flour dredged beef stew in the oil then added onions. I used beef broth and pressure cooked everything for 30 minutes on high. Quick release and then added 3 TBS corn starch with cold water to thicken. Added salt to taste. Loved the beefy flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kelly Honorato"
},
"reviewBody": "Easy and good, but not great, and needed more seasoning. I used the beef stew packet. May need 2 packets, instead of one. It would also help to know how to use the pressure cooker first, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Fung Chen"
},
"reviewBody": "Great taste, added extra herbs &amp; deglazed with white wine. Would reduce liquid next time, otherwise perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "NikiSixx09"
},
"reviewBody": "I followed this recipe to a T and it is downright awful! Make this recipe if you enjoy flavorless meat water. Yuck! \nI threw the entire pot out. I didn't even make my family try it because then my kids would NEVER try beef stew ever......"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alex Lush"
},
"reviewBody": "Good base recipe, I swapped the can of tomato soup for a large, diced tomato. Added some kale for some greenery. Ate it with some home made baking powder biscuits, it was a definite hit! Would cook the potatoes separately next time, not the biggest fan of their texture after pressure cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "madmoose123"
},
"reviewBody": "It was good. I added fresh thyme, 2 bay leaves, cup of peas, and frozen corn the second time I made this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ono4us"
},
"reviewBody": "Very yummy!!! I did add garlic, oregano and my favorite Bragg Aminos and Salt-Free Greek Seasoning to liven it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annette Kryger"
},
"reviewBody": "It was a family hit! I made two versions, one with mushroom added, and one without. Both went over very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Able-Wood"
},
"reviewBody": "If I'm being perfectly honest.\nI feel this recipe was meant to be blended and fed to infants as the author stated. It's most probably why others have made so many changes to this recipe. The veggies come out far to mushy.\nRather than go into how I fixed it or would improve it, I'll simply move on to a better recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Garry"
},
"reviewBody": "Excellent, simple, fast to make recipe. \nI made two changes. \n1. I could not find corn starch where I am located. Used one heaped tablespoon of corn flour which thickened the mixture perfectly\n2. I prefer to steam vegetables, less loss of nutrients (and it's also faster); so the diced &amp; sliced potatoes &amp; carrots were steamed then added with the bouillon cubes mix &amp; corn flour.\n\nAdded half a teaspoon of Himalayan pink salt. Final dish tasted great. Lots of smiles. Comfort food was mentioned by my friends. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna"
},
"reviewBody": "Added some black pepper and minced garlic. Meat and carrots were very tender and tasty. Cooked a pack of frozen mix vegs in the microwave and added it to the stew right before serving it. Family loved it. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "got tint"
},
"reviewBody": "I will keep this one for a quick fool proof meal! Mixed and matched some ideas from the first three reviewers! I added fresh garlic, a few dashes of Worcestershire , fresh ground pepper and salt, I also added potatoes and corn starch slurry the last 10 minutes and it was great! The only thing I didn’t do was sweet cornbread to complete the meal. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugar Skull"
},
"reviewBody": "I didn't need to thicken it with anything, the potatoes took care of that. I put a bay leaf, fresh oregano and fresh thyme in and everyone really enjoyed it. The pressure cooker scares me, but I sucked it up and all was well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Becker"
},
"reviewBody": "Perfect! I didn't change a thing, and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcin Kaczynski"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb McCleary"
},
"reviewBody": "You can play with this recipe so it's more to your families taste. I used no salt beef broth, a can of chopped tomatoes and a jar of salsa. Makes a good gravy !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eepie"
},
"reviewBody": "This is very good. I was looking specifically for a pressure cooker beef stew recipe, and I'm glad I came to this one first. It was super easy and resulted in a tender, tasty stew. I'll use more carrots next time, maybe twice as many, and possibly figure out when to add in some celery too. I do think it needed a little salt and pepper at the end, but it might not have if I'd used a bouillon cube as instructed instead of some beef broth I had left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susanrenee"
},
"reviewBody": "It was delicious, used beef broth instead of water, added frozen peas after it was all done. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryj2367"
},
"reviewBody": "I have made this several times. I put flour and seasoning in a baggy and toss my meat. Then I brown it. I add the onions and I add garlic. Then I use beef broth or water with beef bouillon cubes. Add carrots celery my potatoes and green beans or corn. When it's done I add quick or medium barley and cook for a few more minutes. And serve. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A pet Walker is in heaven."
},
"reviewBody": "This was awesome! I almost forgot how pressure cooker was so beneficial!! It makes tough meat so tender and flavorful!! I boiled potatoes and added to the stew and they all tasted awesome. I also cut beef in mouthful pieces, salt and pepper the meat first. Then sprinkle flour over the pieces and brown them. After adding the liquid it should start simmering. Then make sure to remove the brown foam on top. This is important. It will make your stew tastes a lot better. Once foams are removed then you put the lid on and let the pressure cooker work for you! Flavor was far better than the crockpot! I also added a little bit of red wine and beef broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KIMBERJS"
},
"reviewBody": "Made this recipe using the Instant Pot I received for Christmas. I modified the recipe by using beef stock instead of bouillon cubes. I tossed the meat in flour seasoned with Adobe and black pepper and browned it on the stove top using my Green pan, in order to reduce fat. I added a splash of Worcestershire sauce and a bay leaf to the pot. Based on other reviews, I cooked it on high pressure for 10 minutes followed by a 10 minute natural pressure release. Opened the pot and tossed in the potatoes. Cooked on high pressure for another 10 minutes then did a quick release. After removing the meat and vegetables, I used the saute setting to bring to bring the broth to a boil and then thickened it. It was an easy recipe to prepare and gave me practice using my new ePressure cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene Gaither"
},
"reviewBody": "Made this in my new Instant Pot and it was delicious! Meat was tender and tasty and the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "Pressure cooker problems. but will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christina Fredette"
},
"reviewBody": "Tasty and simple! I used Knorr stock concentrate instead of bouillon. Give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charish Siggers"
},
"reviewBody": "I made it but I used the Mccormick beef stew with herbs and onions slow cooker sauce and it was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Donaldson"
},
"reviewBody": "Very easy and very good. i did cook the potatoes in with the meat and carrots, they turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brian Goffman"
},
"reviewBody": "Though simple, I found this recipe bland and didn't like the results. Other pressure cooker recipes that include garlic, tomato paste, and sardines to enhance flavor are better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nashua Amateur"
},
"reviewBody": "Yum! I'm still trying to figure out pressure cooking, and I definitely had an epiphany while making this really easy stew. I pretty much followed the recipe, but added a little worcestershire and wine (and broth instead of bouillon). My bf bought onion soup mix, but I'm glad I didn't use it. Also at the end I threw in a drained can of spiced, diced tomatoes. It didn't need it, but it gave a bit of zing. Oh, and I threw the potatoes and celery into the last 10 minutes rather than dirty a separate pot, but I might try as written next time. My bf is already on his second bowl. Thanks for a satisfying and easy dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dmarx"
},
"reviewBody": "I used this recipe as a basis, but tweaked things a bit. I have an InstaPot electric pressure cooker. I too dredged the stew meat in flour. Sauteed a half of diced onion with the stew meat. So after sauteing the stew meat, I initially cooked it for 15 min, then added the potatoes and carrots. Followed by another 20 minute pressure cook cycle.. Didn't need to add the corn starch to thicken. It was perfect the way it was. Would definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilinda"
},
"reviewBody": "I am new to pressure cooking. Loved this recipe...quick and yummy! The only addition to the recipe I made was adding black pepper. Next time I will likely brown the meat before adding the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emmala88"
},
"reviewBody": "I did not follow the recipe to a t, but it was still amazing. I added a half a cup of red wine and mushrooms to the mix and it was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Otto"
},
"reviewBody": "best beef stew ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Crysel"
},
"reviewBody": "I did change step 5. Instead of corn starch I made a gravy seperately using 1/3 cup butter, 1/3 cup flour, and the broth that came from the meat. Then added to the pot and added the potatoes and stirred. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christina Ayad"
},
"reviewBody": "I made it exactly as instructed and carrots are mushy potato is unflavored and when mixed becomes mushy mess. edible but would think twice before making it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Islandartist"
},
"reviewBody": "Great basic recipe but definitely needed some added green colour! I added green beans, celery and course chopped green pepper- fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kiwipapaya"
},
"reviewBody": "Very tasty. My husband and toddler like it a lot. I added the potatoes in last 5 minutes of pressure cooker and it was great! I also coated with flour before browning, 2tps. Worcheshire and 1tbs. tomato paste. Yum. I also added mushrooms and celery during final cooking. Froze the extra for our little one. Will do this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberley Spath"
},
"reviewBody": "I used this recipe for my first attempt with my new pressure cooker, fabulous! Here is my version: (way easier)\n1 cup tomato juice with one cup red wine. I used zucchini and mushrooms. I added the potatoes 15 minutes into the pressure cooking time. I seasoned with thyme. amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Kept the original but made some additions to keep us happy! Switch out some of the potatoes for parsnips and turnips. Add veggies...grean beans (raw) corn and peas. A heavy sprinkle of allspice. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Tubbs"
},
"reviewBody": "I used an envelope of Lipton Beef soup instead of bullion and sea salt. My dad just had open heart surgery and this was safer for his health. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TonyaI"
},
"reviewBody": "I did this recipe today 12/3/14 and it was off the chain! as Mel B would say"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOANNZ71"
},
"reviewBody": "I pretty much made this as a base to my pressure cooker stew. I add several more ingredients in mine but this is a great start and is just fine with the recipe left alone with the exception of boiling the potatoes seoaratly. I agree that they add needed starch as well as soak up all the other flavore. I use my pressure cooker for 4 out of 7 son dinners. Love it! Love it!! Love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoRo"
},
"reviewBody": "I came here to find if there was a better stew recipe then mine, and I find this, I have making mine almost exactly this way for over 30 years.\nAt that time I just tossed everything together. This the best recipe, IMHO... I guess I will stop looking I hit Nirvana.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruthie Bowles"
},
"reviewBody": "This will definitely go in my regular rotation of pressure cooker meals, especially as the weather gets cooler. Its been rainy this weekend, so I felt the urge to make a stew. This is simple, but hearty and delicious. I added another pound of meat, 1 more cup of water, and an additional bouillon cube. This recipe is a great basis for a beef stew meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Hendrix"
},
"reviewBody": "Super easy and very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lauri"
},
"reviewBody": "excellent recipe! always looking for more pressure cooker recipes - so economical for time and cuts of meat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoJo"
},
"reviewBody": "Liked it but like to have the calories listed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe Jaques"
},
"reviewBody": "This is a very good base. The Pressure Cooker is amazing. I like to use just one pot when I can so everything was cooked in the pot. S/P on the meat then flour, I used beef broth instead of the bullion and water. I like my stew with red wine so I added about a cup of wine to the 2.5 lbs of beef. Once I heard it start I cooked under pressure for 10 minutes then released my pressure and added raw potato, raw celery and some frozen peas. Then back to pressure for another 10 minutes. Textures were perfect. I love a pressure cooker. Next time I will do no peas and maybe add corn and/or green beans. All in all, this is a great go to recipe that takes 45 minutes on a weeknight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lobels"
},
"reviewBody": "Was very good! First pressure cooker experience and will do again. Added 1/2 red wine to broth before closing lid to cook meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "i_was_drunk_when_i_made_this"
},
"reviewBody": "Very simple recipe for a quick beef stew that leaves open a lot of room for customization.\n\nI followed the recipe almost exactly, but for the following changes:\n\n- Replaced water with a can of beef stock\n\n- substituted equivalent amount of baby carrots to replace \"grown up\" carrots.\n\n- Added about 4 stalks of celerey (2\" pieces) with the carrots\n\n- Added some fresh ground pepper (a couple turns of the grinder, maybe 1/4 tsp), and a couple shakes of crushed bay leaves (about two whole leaves)\n\n- Didn't cook the potatoes seperately (why dirty another dish??) Cooked with lid on for 10 minutes. Cooled the pot and released the pressure, then added 4 peeled potatoes, halved, along with a 10 oz package of frozen peas, stirred and coated everything.\n\n- Replaced lid, cooked for another 10 minutes. Cooled pot and released pressure.\n\n- Served over egg noodles.\n\n\nSo in essense, added more vegetables, a tiny bit of spice, and cooked the potatoes right in the pot. Simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "allisonjo"
},
"reviewBody": "I used venison instead of beef and I added some gralic powder and italian seasoning. I also put some tips of the celery stalk. I cooked the potatoes right in with the pressure cooker, 10lbs of pressure for 12 minutes and the meat was nice and tender and the veggies not mush yet! Delicious...thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Curlyfry"
},
"reviewBody": "Easy and quick. Next time increase the broth and cut back on the potatoes. The meat was very tender and easy to eat, which is the most important thing. Thank you for posting this. It is a good, healthy throw together kind of meal, which is definitely welcome for a family of 3. It will go on my \"everyday\" list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pezzy0"
},
"reviewBody": "I used just one beef buillion cube, it was plenty of flavor for 2lbs beef"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Diva Contessa"
},
"reviewBody": "MAKE A DOUBLE RECIPE !!! SAVES GREAT!!\n\nadd 1/2 cup more liquid..4tsp cornstarch (TOTAL) 2 1/2lbs beef.... can of corn and green beans (Drained) save broth for veggie broth (optional)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HealthyHappyFit"
},
"reviewBody": "LOVED THIS RECIPE! After reading some reviews, I really liked what \"LilysNanny\" had to say about what she added. I decided that since my mouth watered after reading her review, I would do what she did. We loved it! My 3 yr old said he didn't like it, but he made me happy by eating almost a half bowl (minus the carrots). I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mayrag75"
},
"reviewBody": "This was my first time making Beef Stew and was a little nervous. But it was sooo easy to make and tasted delicious. My family is now looking forward to other recipes from this site. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krystalkai6986"
},
"reviewBody": "YUM! QUICK AND EASY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "This was delicious! I used lamb instead of beef. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "africangie"
},
"reviewBody": "I enjoyed this recipe and followed others' advice. I dredged the meat in flour with spices, then browned it, removed it, and fried an onion, plus a bell pepper and some garlic. I threw in a carrot, the meat, water, a bit of Worcestershire, and bouillon, then cooked under pressure for 10 minutes. The carrots were already done at that point, so next time I'll throw them in with the potatoes. After the ten minutes, I added 4 potatoes, 1 big sweet potato, a large zucchini, and a bit more water and cooked under pressure for another ten minutes. Finally, I removed some of the liquid and mixed it with some corn starch to thicken. I served it with homemade whole wheat bread, and it was a hit. Thanks for a simple, adaptable recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nelly Evans"
},
"reviewBody": "This is the 2nd time I make this, everyone in my family likes it, I also browned the meat in seasoned flour and added crushed garlic 3 or 4 cloves, then after browning I added 1 14 1/2 oz. Can of beef broth, 1/2 cup of water, 1tbsp worchestire, 1 tbsp of red wine vinegar,diced carrots, cooked for 10 minutes.\nAdded potatoes and peas, celery and checked sauce for taste, cooked another 10 minutes!\nDelicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Yum! I had venison in my freezer and didn't know what to do with it, so I decided to make this. I used 4 potatoes instead of 8, added an extra teaspoon of beef bouillon, added 3 large stalks of celery, and omitted the salt. I also added 2 tsp of Worcestershire sauce as another reviewer suggested. Instead of cooking the potatoes separately, I just pressure cooked the onions, meat, and carrots for 10 minutes; I then added the potatoes and celery and pressure cooked it for 10 more minutes. It turned out really nicely! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Great stew...Giving 4 stars cause the daughter didn't like it. The rest of the family loved it! I followed as directed except I didn't use the beef bouillon cubes. I had a packet of beef stew seasoning so I used it instead. YUMMY!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lottie Gilpin Bardoel"
},
"reviewBody": "Great base to start from. Modify as suits your preferences. I did follow the advice to add the potatoes and carrots for last five minutes, but this adds to the cooking time as the pressure cooker comes back up to steam. I might try to add some frozen to the bowl and serve the hot stew over top next time. They overcook in the stew. So nice to know you can cook stew meat in 20 minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "douggee"
},
"reviewBody": "Excellent, flavorful stew. I made it once as specified and the 2nd time made it for 12 servings but increased the vegetables instead of the beef and added a bay leaf. I need to eat more vegetables, lol. This recipe is especially good for those with electric pressure cookers (use the high setting) since no electric pressure cooker that I am aware of will go to 15 lbs of pressure as the stove-top models do. Regardless of the type of pressure cooker you use, just remember to not fill it over 2/3 full."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mayaclone"
},
"reviewBody": "Husband LOVE this. I added some fresh parsley and a bay leaf. Very good! Could be great with egg noodles instead of potatoes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "totallybeez"
},
"reviewBody": "Fast, easy and delicious. I added a little more bouillon than the recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "This was awesome! I only wish I had made more. There weren't any leftovers at all. I served 4 adults."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bazzle"
},
"reviewBody": "Way too much liquid. More like a recipe for beef soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jess144"
},
"reviewBody": "Excellent! I made a half recipe with 4 red potatoes, two cloves of garlic (pressed), and black pepper. I added the potatoes and garlic with everything else since I did not want to cook the potatoes separately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KELLIBO"
},
"reviewBody": "This recipe saved me from having to get take-out for supper: I had everything for stew, but forgot to get it started in time (I have a 5-hour no-stir oven stew recipe from Marcia Adams' \"Cooking for Quilt Country\" that I absolutely love because everything gets caramelized, but I just forgot to cut everything up). The timing is perfect; the only difference I made is that I roast my potatoes for the 20-minute cooker time after boiling them, since that's how my husband like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pj_martins"
},
"reviewBody": "I just recently bought a pressure cooker and thought I'd try this one. At first it didn't seem like it would stand out too much since there are no spices added, but this one still came out delicious, my favorite stew recipe by far. Goes great on rice. I did tweak it a bit by using 2 cups of beef broth instead of water and beef bouillon cubes, as well as adding a pinch of pepper before cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AceyDoubleYou"
},
"reviewBody": "This was my first time using my pressure cooker, and I was feeling a bit nervous about it. This, however, came out great. I actually wound up skipping the potatoes completely, and using about 2.75 lbs of stew beef instead. It was fabulous, and I will add the potatoes next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iluvfood"
},
"reviewBody": "Very good, thanks for the pressure cooker recipe! I added a little red wine with the broth and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth Grenier Shoupp"
},
"reviewBody": "This is so easy and good and quick. The only things I added: 1 clove garlic, chopped, 2 bay leaves, and used beef base instead of bouillion. Also don't use 8 potatoes, cause you'll end up with potatoes in chunky gravy....3 is more like it, imo. Delicious and fast, yet tastes like a 3 hour stew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAILICHI"
},
"reviewBody": "This recipe was awesome! I changed it a bit by using beef brother rather than water and bouillon, but everything else was the same. Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHOCK"
},
"reviewBody": "I like it. It's very similar to my Dad's recipe. I coated the beef with seasoned flour before browning it. I also used two cups of beef broth instead of the water and bullion cubes and cooked the potatoes with the meat, carrots and onion. I also put three bay leaves on top of everything..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Just call me Beck"
},
"reviewBody": "I had frozen beef stew meat and within an hour, turned it into a WONDERFUL beef stew. I defrosted the meat in the microwave before browning it. I used frozen carrots for simplicity. I cooked on high for 10 minutes, cooled to open and added potatoes and frozen peas...then cooked on high for 10 more minutes. I didn't even need to add the cornstarch. I had cut my potatoes small enough that when I stirred the stew, some of the broken off potato pieces thickened it enough to satisfy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommajana"
},
"reviewBody": "This is a great basic beef stew recipe....I made the following changes: canned beef broth for the bullion/water, 3 cloves of garlic(pressed), 2 sprigs of thyme, 1 TBS of dried parsley, and 5 meat soup bones. It is my new favorite beef stew recipe. Thanks for sharing it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CubanChickCooks"
},
"reviewBody": "I swear by pressure cookers!! I cook about 70% of my meals in them and proudly own about 7 (some vintage some new). They are the best cooking utensil ever! Hands down. Lost art indeed and I'm trying hard to bring it back! Visit my site at http://www.flanboyanteats.com for Cuban and latin fusion recipes cooked in the pressure cooker! Hope you enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HippieBev"
},
"reviewBody": "I forgot to put stew in the crock pot, so used pressure cooker to make dinner in time. May never go back again! Used ratio of 1# beef/1# carrots/3 large potatoes. Cooked 10 min, added potatoes, cooked another 10 min. Also added a couple of shakes of Montreal Seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Courtney Vogel"
},
"reviewBody": "I really enjoyed this recipe. It's right up there with the beef stew I make in a stock pot that cooks for 4 hours. So time-wise, this recipe wins. The only thing that I like about the other stew better is the red wine. The meat in this recipe is just as tender. Also, since this recipe has no wine, I was able to grind it up in the bullet for my 10 month old, who ate it up! To give it a little more taste, I put some hot sauce on my serving."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/75086/pressure-cooker-beef-stew/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/75086/pressure-cooker-beef-stew/",
"name": "Pressure Cooker Beef Stew"
}
}
]
}
}
, "about": [
]
}
]