				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Puerto Rican Tostones (Fried Plantains)"
,"datePublished": "1999-12-23T14:54:21.000-05:00"
,"dateModified": "2023-01-12T09:29:45.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Lymari"
,"url": "https://www.allrecipes.com/cook/24326045"
}
]
,"description": "Tostones are twice-fried crispy slices of green plantain that are lightly seasoned with salt for a delicious Caribbean-style appetizer or side dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DlGEIAWD4C0aSaeVTdl8hVUmldY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/662714-puerto-rican-tostones-fried-plantains-Melissa-Goff-1x1-1-8d283dbbc8f04576a9f9698ec8287560.jpg",
"height": 600,
"width": 600
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5843549560001",
"description": "Watch how to make crispy fried plantains!",
"duration": "PT1M1S",
"name": "Puerto Rican Tostones (Fried Plantains)",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/65c7223e-27af-4703-a6c2-2f226403c303/0cb25026-edca-4b22-a286-2b63839ae4df/1280x720/match/image.jpg",
"uploadDate": "2020-10-21T04:47:48.154-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Puerto Rican Tostones (Fried Plantains)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "131"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "136 kcal"
,"carbohydrateContent": "29 g"
,"fiberContent": "2 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "14 mg"
,"sugarContent": "13 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 green plantain",
"5 tablespoons oil for frying",
"3 cups cold water",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Peel plantain and cut into 1-inch slices. Fill a bowl with 3 cups of cold water."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a large deep skillet over medium-high heat; add plantain slices in an even layer and fry on both sides until golden brown, about 3 1/2 minutes per side. Set skillet aside."
} ,{
"@type": "HowToStep"
,"text": "Transfer plantain slices to a chopping board; flatten each one by placing a small plate on top and pressing down. Dip plantain slices in cold water."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/DlGEIAWD4C0aSaeVTdl8hVUmldY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/662714-puerto-rican-tostones-fried-plantains-Melissa-Goff-1x1-1-8d283dbbc8f04576a9f9698ec8287560.jpg"
}
]
,"text": "Reheat oil in the skillet over medium heat; cook plantain slices for 1 minute on each side. Season to taste with salt and serve immediately."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe and they came out delicious!!!! The only difficult part was peeling the plantain. I practically had to carve it out lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There are lots of food blogger like this But the best food recipe \" Puerto Rican Tostones (Fried Plantains)\" is yours. Thanks for giving me this wonderful blog. I will try to make it like you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Kuhn Maumenee"
},
"reviewBody": "I had never had plantains before - tried this recipe and I am a BELIEVER! Love them! Thank you for sharing such a wonderful and easy way to cook them. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrownSugar"
},
"reviewBody": "Wow!! so good, I made a dip with avocado just elevated the taste ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camila Cay Vázquez"
},
"reviewBody": "Pretty easy to make. I added adobo seasoning to the water, but you could add a little bit of salt or any other seasoning you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Beachler"
},
"reviewBody": "I did not use the water system as reading a couple of reviews. I did let the plantains get black. Only fried them in vegetable oil. Didn't need to add anything to them, are sweet as candy. Oh my, these are delicious. Hubby loved them too. Will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Katherine Ross"
},
"reviewBody": "Turned out really great, but I greatly reduced the cooking time. I do t know if my oil was too hot or what, but my first batch was black at 3 1/2 min per side. 2ish min per side seemed to work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisabeth"
},
"reviewBody": "I've had tostones before but I made them for the first time today. I thought they would be difficult but was pleasantly surprised by how easy and delicious they were! I didn't think to take a picture (they went fast) but they looked just like the picture. I didn't change or add a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn M. Knox"
},
"reviewBody": "These were quite good. In fact, these were the best I have ever made. I appreciate the tips from others regarding the when to use, or not use water. Since I made these and served them right away I skipped that step. Also, someone commented that plantains are not a type of banana. This is not true. They are very different in taste but they are from the banana family. I totally recommend this recipe. The crunchier, the better, in my opinion. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "In Venezuela we ate fried platanos as an appetizer. Cut diagonal strips 2inches long by about 1/4 inch thick. Fry until the outside is crunchy and the middle is mushy. Top with cheese and they will be gone as soon as they are cool enough to eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lina"
},
"reviewBody": "Simple, easy, in no time. The whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Preye Okah"
},
"reviewBody": "Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan Perez"
},
"reviewBody": "Reduce water to 1/3 cup sprinkled liberally with garlic salt. If possible use a better brand garlic salt and never fresh garlic. \nBTW - old timers never used plates for flattening. They’ll use a torn piece of brown paper bag or platano press. Good luck - the garlic salt brings it to a whole new and delicious level."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "littlemama"
},
"reviewBody": "As someone pointed out. It's in the beginning of the process to put in water. But if you want a little extra kick to it , add vinegar and salt to the water and let it sit for a little while before frying. And as suggested by Sanda Jz. pat dry. Make a garlic sauce on the side to dip them in. There are some recipes for garlic sauce for tostones on the web."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ofelia Garcia-Barcena"
},
"reviewBody": "I use yellow firm plantains instead of the green ones. They taste sweeter, crisp on the outside and creamy on the inside. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Barboza"
},
"reviewBody": "Put some sazón and adobo in the water. It gives it an amazing taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luz Ottens"
},
"reviewBody": "I’m Puerto Rican and have been making these for over 40 years. It’s a staple food like potatoes for us. We do make two types of dipping sauce. One is finely diced garlic ( a lot) into olive oil and the other is mayonnaise and ketchup. I know the mayo ketchup is now found in supermarkets but we use a little mor ketchup than the store bought. Hope you tru the sauces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "I like the taste (and would make them again), but boy what a mess it made in my kitchen with spattered oil. My guess is that the temp only needs to be on low medium, and as someone else stated, pat off the water with a paper towel before frying the second time. Perhaps dipping in water isn't even necessary.\n\nPS - What kind of oil is recommended?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjflats"
},
"reviewBody": "I skipped the water also. Super easy to make. Be sure not to cut too thick. Used green plantains this time and will try yellow next time. Great with a little salt and ketchup but I’m definitely going to try to make the mayo ketchup dipping sauce at some point too. New edition to family menu for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Espinosa"
},
"reviewBody": "I've been making these quite frequently over the past year or so and there are ways to make them a bit healthier. If you have a non-stick skillet/frying pan then you can just fry them in water instead. I usually salt them after they're done and then serve with ketchup, but you could use other sauces to dip them in - like salsas, avocado, etc. \n\nAlso, if you want to keep them ripe or rather prevent them from ripening too much, you can store them in the fridge up to a week or so and that will stop them from ripening too much. I like to buy them in bunches (6-10) at a time and then stick them in the crisper. Just take them out and let them sit for about 10-20 minutes before you cook them and they'll be much easier to peel and work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beachgirl57"
},
"reviewBody": "I followed the directions exactly. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony W. Watson Sr."
},
"reviewBody": "Great add on to the main dish and taste outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MikeGinnyMD"
},
"reviewBody": "Yup. This is how it's done. I feel like I'm back in the Bronx."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Connor Leon Pack"
},
"reviewBody": "Super easy to make! You'll definitely want to research how to peel plantains if it's your first time, as they aren't as easy as a banana. The final flavor is very similar to a potato chip, very starchy. Great with ketchup for you Americans out there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drew Ross"
},
"reviewBody": "I made them according to the recipe and they came out great. From what I read elsewhere the reason for dipping them in water is to make them crisp up better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dave"
},
"reviewBody": "I read many reviews after I made them exactly as recipe. Next time, I am going to use half butter and half oil for frying. Use black or yellow and black plantains. Cut them in thicker pieces, 1.5 inch diagonal slices. And fry 2 minutes per side. Then flattening by rolling a can over them sandwiched between wax paper. Then refry 1 min per side. Half I sprinkled with cinnamon sugar and half with garlic salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ber Mom"
},
"reviewBody": "They did not do it for me. I am not sure if I did something wrong or not. I am used to the restaurant style plantains and they are much sweeter and softer. I will keep looking. Thanks for the recipe anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darrah Karnes"
},
"reviewBody": "My plantains were A LOT more ripe than the typical green ones I usually see (and know now are what you're supposed to use). I thought you bought the green ones then were supposed to let them ripen before use lol. Anyway, I fried my very ripe plantains in coconut oil, in a cast iron skillet, then sprinkled them with sea salt when they were done. They were seriously great! These came out much better than the tostones I've had at Puerto Rican restaurants and from my cousins mother. I'm not sure if it was the recipe, that I probably used more ripe plantains than the others, or that I used coconut oil instead of canola or vegetable oil, but I will absolutely make these again following this recipe. Next time I'll try green plantains because I'm sure they'll be even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocolover"
},
"reviewBody": "So easy and delicious. As a plantain beginner, I was under the impression that plantains peeled like bananas do... just a warning, they don't! I learned that the hard way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grillcleaner"
},
"reviewBody": "Tostones are an awesome side dish. However I first fry them then I remove from pan. Then I smash them. And tip them in a bowl of water with adobo then re fry them. It just adds more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amcapili93"
},
"reviewBody": "Super easy!! Took maybe 5 minutes to make! Next time I'm going to cut them diagonally so that you don't end up flipping and watching so many little circles. I also put garlic salt on half and truvia on the other half to make it sweet and it was really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "angie c-moore"
},
"reviewBody": "I added garlic to my water and let the tostones soak for about a minute just to give a bit of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prmom24"
},
"reviewBody": "One of my familys fave! I do not think there's any of my kids that dont like tostones... My husband loves them too. My variation to the recipe is that after i peel and slice the plantain i put in water with adobo before frying , these gives them more flavor. after frying i use a tostonera to mash the toston a bit and then return to fry pan to crisp. Then just make a mix of fresh crush garlic with a bit of olive oil which i heat. We love it alone, with fried pork or chicken or just as a side with rice, beans and chicken. And by the way a plantain is not a banana, it is much larger and firm than a banana. The peel is very different too. When plantains become ripe you can slice and fry to make what is called Maduro . This is a sweet version though and you just fry once you do not refry.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aputler"
},
"reviewBody": "Great side dish. Followed LatinaCook's directions and they turn out fantastic every time. The bottom of a small can (like 4oz, etc..) seems to be a good size to flatten a 1 inch thick slice of Plantain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Viera Klauz"
},
"reviewBody": "My first time trying Plantain - Used a very ripe Plantain (almost completely black) - fried in coconut oil - flattened only half the batch to fry again and the others remained as sliced - the flattened plantain was firmer with a dryer centre - both methods tasted very sweet - will definately make again as it satisfied my sweet tooth to easily skip dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gypsie_j"
},
"reviewBody": "Tostones in English would be \"Twice Fried Platains\" (since you are frying them twice) \"Fried Platains\" are Amarillos/Platano Frito. I never used to soak the platains before, now I do. I soak them for about 2-3 hrs in salt water. I drain the water and pat dry w/ a paper towel. They come out crispier and tastier! :) If short on time, I do not soak them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "walther86"
},
"reviewBody": "Easy to make and a nice side dish to go with savory entrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxane Hicks"
},
"reviewBody": "Amazing recipe!!! make sure the plantain is very green. I love to dip mine in spicy humus yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bessy988"
},
"reviewBody": "awesome recipe, easy to follow, gave it four stars because i skipped the water step, freaked me out and don't really wanna deal with a house fire. the only thing is they did not come out crispy but that may be just my fault because i mistakenly turned down the heat on the wrong burner. will try again but besides that very nice recipe, pretty proud of myself, haven't made tostones from scratch in awhile. oh, and one more thing, i also put about a tbsp of salt and a tbsp of sugar in a cup mixed together and sprinkled them on top of the tostones as soon as i got them out the frying pan the second time, delish!! the sugar makes it even better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Troy E. Pelaar"
},
"reviewBody": "Plantains are not bananas, they are related but have a much higher starch content. They should always be cooked as they don't taste good raw, green or ripe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat Young"
},
"reviewBody": "I just wanted to point out to those having difficulty with this recipe is that a toston is never to be made with a ripe plantain....the texture will be completely different at that point you simply slice and fry them and they are what we call maduros....always use a firm GREEN plantain and you will end up with a crispy treat with the endulgance of a fry....also follow the recipe to the T yes you can soak them before you first fry them so they do not blacken, however it will ensure a crispier toston if you dip in salted water right before the second fry...hope this helps! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doristam"
},
"reviewBody": "Good stuff! Definitely let your plantains ripen fully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whtyegirl1"
},
"reviewBody": "Yummy - Hard to mess these up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melissa Goff"
},
"reviewBody": "well.....I totally don't know how to rate this. I want to 1st say, I've never in my life eaten plantains. So I really didn't know what to actually expect even having people give me an idea. One thing I waited until my plantains were nearly black skinned to be sweet. I followed the recipe but I used 2 plantains but left the amount of the oil and water the same. Another AR'er looked at the recipe and said she was worried about the \"dipping in the water\" then frying in oil. So I vowed I would do a few to try that way...and glad I did. They splatter so hard, so high, I was reaching for the splatter guard and said..nope. I'm not dipping anymore because it was crazy to do anymore that way. I salted the 1st few that came out and I have to say....didn't like that. And it really was just a dash of salt. Not like salting french fries. At that point I couldn't get past the salt taste. That's just me. Hubby tasted 2 &amp; was like \"weird &amp; interesting\" So I didn't salt anymore after that. I let 2 of my kids try that were around &amp; they both spit it out. They didn't like them at all. While they did have a sweet taste to them. That part was interesting. I ate a few, trying to keep an open mind, but all in all. I'm now worried about wasting 4 more plantains that are ripening, because no one else will eat them in my house after this. Interesting I'll give that. But can't say that I'd go all out &amp; make again. People who like them, will like this recipe. I just guess I'm not one of them. SO sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isapizza"
},
"reviewBody": "great they taste just like Mama would make them when we ran around the mountain in San Juan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarcookie"
},
"reviewBody": "My husband is puerto rican so we make these a lot. It actually took me a few tries to get the hang of cooking them by myself b/c growing up my mom only taught me how to make the fried plantain chips for eating like popcorn. These, on the other hand are great as part of a meal. Especially with rice and beans. Our sauce is just equal parts ketchup and mayo- so it looks pink. DH also likes to soak them in water and adobo after cutting to flavor them. I like this method of flavoring. I think it makes a big difference than just sprinkling on dry adobo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "superfifee"
},
"reviewBody": "This recipe is not exclusively Puerto Rican. I am Jamaican and we make the same thing. I never put water on the plantains and it is important that you do not cut them too thick when you fry them the first time. Pick pretty, green plantains. This dish is meant to be eaten with something flavorful like fish with onions, so don't be shocked at its lack of flavor. In Jamaica we eat it with herring, mackerel or codfish. This dish is served in many island countries, as well as Latin American countries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beanz"
},
"reviewBody": "Yum. So simple yet sooooooooo good! Best fried plantain I've had yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "catwhispererPhD"
},
"reviewBody": "Not so good. Perhaps it's just me and the fact that it's my first time making these. I'm not sure I can believe the nutritional analysis either. But when flattened they turned into messy dry starchy things and they didn't pick up the rest of the oil well- they were just a pile of mush. They looked and smelled good up until then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DGREENWOOD"
},
"reviewBody": "Well I had a bit of trouble with frying, removing, flattening and then re-frying. I'm not a co-ordinated person. BUT the plantains did come out good and made a nice side to the Puerto Rican meat patties we made from here. I gave it 4 stars only because for me, it is a lot of work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley B."
},
"reviewBody": "I did not use any water. I also added garlic powder at the end too. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Hobbling Gourmet"
},
"reviewBody": "My first time making my own. Very tasty. I added a few drops of agave syrup. Yum. I suppose you could use sugar or honey too. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "world/cooking/master"
},
"reviewBody": "Uses to much oil, try not covering it completly, taste sort of like french fries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geri Miller"
},
"reviewBody": "So good, and a nice starch alternative. The photo has the plantains sliced regularly, but I like to slice them slightly on the bias so they are longer, and they look prettier on the plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "My first taste of plantains and it was delicious!!! I probably used a plantain that was almost ripe because it had some black spots it just wasn't completely black. Definitely dry off the plantains after putting them in the water before you throw them in the oil. I sprinkled with salt the second they were done. What a yummy snack!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joannas922"
},
"reviewBody": "Yummmmyyyyyy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dariel Ruiz"
},
"reviewBody": "Just a few observations: 1. If you want to have a toston that is made like those in Puerto Rico you have to have green plantains (oh, and a plantain is not a banana. They are related, but are not the same. A plantain is much larger and thicker than a banana, even the plants are different). 2. The slices should be cut diagonally so the initial frying can cover the most area. 3. If you don't have a tostonera, a can or a plate can be used to squash the slice, 4. Once it is squashed it is put in salted water for at least 30 minutes, not just to prevent it from going brown, but to give the toston a very good salty taste. 5. Last you fry it until golden brown. 6. Some people make mayoketchup mix (mayonnaise mixed with ketchup) or olive oil with salt, lemon, and garlic or just sprinkle with garlic salt. Hope this has clarified some issues with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kTd86"
},
"reviewBody": "Yummy! They brought me back to Euador where my husband and I first met. I omitted the water steps as that just sounded dangerous to me. I used plantains that were yellow with black spots to get a sweeter taste and cut them about 1 1/2 inches thick. I also followed LatinaCook's suggestion of initially frying them for a shorter period of time--about 2 minutes per side. Then I drained them on paper towels before flattening them (I think it helped to cut down on some of the grease). Then I fried them again as the recipe called, drained and salted...my daughter loves these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pixelsicle"
},
"reviewBody": "It is better to put these in salted water before you fry them and only after they are dried. Also, the plantain \"smoosh\" better if they are cut at an angle, but that's just me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jukeone88"
},
"reviewBody": "EXCELLENT, COMO MI ABUELITA LO ACE!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "This was the first time my family had tried these. I liked them but my sons did not. I think I should have chosen a plantain that was a little more ripe. They had a sour taste to them. I dunked them in ketsup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetPea"
},
"reviewBody": "Very good, but not the quickest thing to make. The drinking glass worked just fine to smoosh them. I served them with Arroz con pollo and a salad, and Hubby gobbled them up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennmiami"
},
"reviewBody": "Just returned from Puerto Rico where we stayed in the mountains and my children discovered their love for tostones--these are exactly right! For people looking for the sweet plantains they have eaten in restaurants, sometimes called \"maduros,\" make sure that you note that this recipe traditionally calls for green plantains and is not supposed to be sweet. If you want to make the sweet kind use yellow-brown overripe plantains. I made that mistake when I first moved to Miami!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sagirl17"
},
"reviewBody": "these are great with chimichurri sauce! it's made from parsley, cilantro, garlic, lemon, and oil. look up the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AccidentalFoodie"
},
"reviewBody": "I followed this recipe to the letter, and it's fantastic. I tried a green plantain this time-- very subtly sweet, and, as another reviewer mentioned, great with garlic salt. I'm allowing another plantain to ripen, so I'll try the recipe that way as well. To mash the pieces, I put them one-by-one in between pieces of baking parchment, then put that in a wide, flat bowl, stacked another bowl inside of it, and pushed down a bit. I also liked the fact that this recipe didn't require a whole lot of oil, though I used an 8-inch stainless steel pan so the pieces would sit a little deeper in the oil. The finished product goes great with black beans and rice; I will definitely be making this recipe again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "These are awesome! I didn't use any water and my plantains were green. The trick is to hit them with salt the second they come out of the oil! \n\nI will definately be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marshall"
},
"reviewBody": "mmmm...I agree, don't need water and BUTTER is the way to go! I didn't add a spice at all and it was delish and just like I remember in Costa Rica."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Caroline C"
},
"reviewBody": "I always order fried plantains at the local Cuban restaurant, but they are completely different to how these turned out. Not sure how they prepare them but theirs are sticky and sweet, and kinda stick in your teeth. These were really dry and tasteless. Oh well, thanks anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kandiee"
},
"reviewBody": "Follow the suggestions of LatinaCook, this lady knows what she's talking about. They are delicious. Just DO NOT put them in the water(unless you want your eyebrows and kitchen to burn up)! I served them with Oxtails w/ Gravy and Jamaican style Rice and Peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookedup"
},
"reviewBody": "I love this recipe, thanks so much for posting it. I made this side for my boyfriend, who is from Puerto Rico, for dinner; he was shocked that I did them correctly. His family serves this side or appetizer with different meals and I love eating them. But this was my first time trying my hand at cooking them. A little hint, we lightly season the tostones with Adobo after frying- Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cook in CALIF"
},
"reviewBody": "My husband is Puerto Rican and he introduced me to these when we went to San Juan. I loved them and had to make them. I use a press that we bought in Puerto Rico, but it is just as easy to use a bottom of a glass. I also salt the water that I soak them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnne Flynn-Poeschl"
},
"reviewBody": "I used to get tostones for lunch all the time when I worked in Manhattan. I missed them (and all good food) when I moved to CT. I am so excited that I can make them at home! I made a mess of the kitchen though, and I set off the fire alarm with that last step! Thank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nemitz"
},
"reviewBody": "As far as this recipe goes. It is a great food. I like mine with some shredded cheese of your choice (I like Mozarella) and tiny bit of butter on each Tostone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "I love platano!!! Love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Jenny"
},
"reviewBody": "I LOVE TOSTONES!!! \n\nTo peel plantains: cut ends off, then cut down one side, then peel skin off while running under water.\n\nFor a little sweetness and tang, use plantains that have some dark spots. A fully ripe plantain (black) is too soft for this recipe, but experiment for different flavors (green is savory, like potato).\n\nYou can either skip the water step or dry thoroughly to avoid oil splatter.\n\nDip them in crema fresca (Mexican table cream) for an added treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chels and JJ"
},
"reviewBody": "*Great recipe. Use the green plaintains as a savory side- as it is not sweet yet. Use cajun seasoning at the end for a kick. \n*Use the dark colored (black) plantains for a sweet dessert or balance to your meal. Sprinkle w/ just a little cinnamon, dark sugar, and nutmeg.\n*For both green or dark plantains, try the thousand island recipe, or buy store bought.\n*After frying, flatten between wax paper w/ a roller. I do not dip in cold water because I will set my house on fire."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scottnyc"
},
"reviewBody": "I'm a gringo but cook like a good Latino! For a richer taste (less oily) use equal parts butter and oil. Also sprinkle with a little sugar at the end. Makes 'em so good they'll all be gone in no time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen "
},
"reviewBody": "It seems good, it's very simple, and it tasted great. I always add a garlic \"sauce\" to it. It's mashed up garlic with some salt, pepper, and oregano, or \"Adobo\", with some olive oil, If you use a garlic press, and let it sit in the olive oil for a while, it is the perfect sauce to go with these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "madball911"
},
"reviewBody": "I love tostones! I generally don't bother with a dip, just some hot sauce. Don't do the water step, too dangerous. To ALEXISCRUZ, chinola is passion fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DIEM"
},
"reviewBody": "It was good but not something I would do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste"
},
"reviewBody": "Delicious! I flattened them using the bottom of a coffee mug and refried them *without* dipping in water (too much oil splattered as a result...Ouch!). They were just as crispy as the water dipped plantains. Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LatinaCook"
},
"reviewBody": "Also known as Platanos Fritos o Patacones. I make these all the time but i do not soak them in water. I just peel the plantain, slice it crosswise about 1 inch thick, fry just a little (they'll look yellow-er), press in the tostonera (or with the bottom of a can) , fry again until cripsy and golden and then sprinkle with garlic salt. Yum!! Ignore the rating of the person who burnt them, that is not the recipe's fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSGYPSYLEE"
},
"reviewBody": "This is a great recipe for tostones. When I do the water dip before the second fry I use salt water instead of plain. It give the tostones a little extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "k_in_NL"
},
"reviewBody": "these were nice (served them as appetizers) especially with the dipping mayo/ketchup/garlic dipping sauce suggested by others. i tried the cold water step with one piece and my skillet went bananas (haha)! skip this step altogether. i couldn't tell the difference between the one i dipped in water and ones i didn't. will definitely make these again - great party food, i reckon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Allen"
},
"reviewBody": "I love PR cuisine! I have learned alot from a neighbor of mine and when we have these we make it with what she calls a secret sauce. The sauce is about 3 cloves crushed garlic,mayo and ketchup. Add to your taste along with a lil salt and pepper soooo good with the tostones!! Serve along side any dish or by their self awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "These tostones were so good!! The step about dipping in water is good to do because it makes them more crispier. I only bought one plantain at the store. Now I need to go buy more!! Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Santos-Vimos"
},
"reviewBody": "As a Puerto Rican, I know and love platanos as well. They're an easy side dish and can take the place of other sides, like rice or potatos. I don't bother with the water, just fry, smash, and re-fry. Just make sure you use the green plantains for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mcfly3"
},
"reviewBody": "Tostones are wonderful! Not heard of the 'dip in water' step. You would need to be very, very careful if you choose to do this, as it's the best way to begin a kitchen remodeling job if you are not careful. Hot oil and water are not friends at all :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shortkaik"
},
"reviewBody": "I love fried plantains. I didn't dip them in water like suggested, I didn't like the sounds of putting water in a frying pan. They still turned out excellent, and went well with a mix of ketchup/mayo that someone else had suggested. I will make these again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Forgemaster"
},
"reviewBody": "This is a variant of a West African dish in which plantains are cut into 1/4 inch thick slices and fried. I find that using peanut oil gives a sweeter taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "Yummy, Yummy! I soaked my plantains for 15 minutes in salted water, patted them dry and then fried them. I flattened them between wax paper with the bottom of a glass. Dip them in the water again, patted them dry and then fried to a deep brown. Salted them immediately after taking from the oil and served them with a traditional half mayo, half ketchup dipping sauce. They are SO good and really easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rayandshy"
},
"reviewBody": "just like i had them in costa rica--very, very easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "not good at all... burned plantains :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "OH MY GOD! THESE ARE EXACTLY LIKE THEY ARE IN THE DOMINICAN REPUBLIC. I LOVED THESE WHEN I LIVED THERE. IN THE DOMINICAN, THEY ARE MORE COMMONLY CALLED \"PLATINO FRITOS\"...MAKES SENSE, BUT I COULDNT FIND INSTRUCTIONS TO MAKE THESE, BECAUSE I DIDN'T KNOW, UNTIL RECENTLY THAT THESE ARE ACTUALLY CALLED TOSTONES. WHATEVER THE NAME....THEY ARE SOOOOO GOOD. THESE ARE GREAT FOR DINNER. I MAKE ONE TOSTONE PER PERSON, ACCOMPONIED BY FRIED SALOMI, WHICH IS ANOTHER DOMINICAN FAVORITE. CAN ANYONE TELL ME WHAT \"CHINOLA\" IS IN ENGLISH....POR QUE, SOY AMERICANA. LOL. I LOVE THIS JUGO (JUICE) IN THE DOMINICAN, BUT I CAN'T FIND THE \"CHINOLA\" FRUIT HERE. THANKS EVER SO MUCH FOR THESE INSTRUCTIONS. I AM IN HEAVEN NOW THAT I CAN HAVE MY PLATINO FRITOS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tostones taste great any time. Ask for Plantains at the supermarket in my experience they are qualitatively different than bananas, dont exactly taste great raw. they are longer, firmer, like a cousin of the banana, cooked while green for a firm crunchy taste, or when yellow with brown spots for a sweet taste. Make a tomato and garlic sauce for dipping, sprinkle with salt.. delicious! In some hardware stores you can find a tostonera, look in latino catalogs for it, it saves lots of time. its two boards with a circular indentation in the middle, made to squish the plantain in a perfect circle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chabely_k"
},
"reviewBody": "I have made these all my life and I love them. A nice twist (and probably my favorite) is to make them with a ripe plantain (in which case they're called \"amarillos\". For making amarillos, the plantain must be at least yellow or almost throwing to \"too ripe\"--close to blackening skin). Cut the ripe plantain into diagonal, long slices and fry them--keep an eye on them because they cook much, much faster--turn around and they'll be burnt!--and drain on paper towels. You can serve these with anything and are great solo. Because they're made with a ripe plantain, they're very sweet. My fiance doesn't really care for amarillos, but I wouldn't have my plantains any other way. I would give both of these a 3 kid rating because, depending on the kid, he or she will love the tostones/amarillos or just hate them. I grew up with them, so I simply adore them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Requires paying attention to the pan. A crispy \"tostón\" is a delicacy."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16768/puerto-rican-tostones-fried-plantains/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
"name": "Vegetarian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/264/everyday-cooking/vegetarian/side-dishes/",
"name": "Side Dishes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16768/puerto-rican-tostones-fried-plantains/",
"name": "Puerto Rican Tostones (Fried Plantains)"
}
}
]
}
}
, "about": [
]
}
]