				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpernickel Bagels"
,"datePublished": "2019-04-03T23:53:08.000-04:00"
,"dateModified": "2023-02-25T20:34:54.000-05:00"
,"author": [
{"@type": "Person"
,"name": "sueb"
,"url": "https://www.allrecipes.com/cook/2719400"
}
]
,"description": "Rye flour, cocoa powder, instant coffee, and caraway seeds are the secret ingredients to making pumpernickel bagels at home."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/wVuZE6c2ymlUq5Mt5Ef6C-t1cdA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5517311-pumpernickel-bagels-Carsons-Mommy-4x3-1-2000-0b21d44ca2014f7c80e15f91d3593a75.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpernickel Bagels"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "22"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "160 kcal"
,"carbohydrateContent": "34 g"
,"fiberContent": "4 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "285 mg"
,"sugarContent": "7 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1.25 cups warm water",
"1 cup whole-wheat flour",
"4 teaspoons active dry yeast",
"1 cup rye flour",
"0.5 cup molasses",
"0.33333334326744 cup unsweetened cocoa powder",
"1 tablespoon vegetable oil",
"1 tablespoon instant coffee granules",
"1 tablespoon caraway seeds",
"1.5 teaspoons salt",
"1.25 cups all-purpose flour",
"1 gallon water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine warm water, whole-wheat flour, and yeast in a small bowl. Let stand until the yeast softens and begins to froth and bubble, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Mix rye flour, molasses, cocoa powder, vegetable oil, coffee granules, caraway seeds, and salt in a large bowl. Add yeast mixture and all-purpose flour. Turn dough onto a floured surface; knead until smooth and elastic, about 10 minutes. Grease a large bowl."
} ,{
"@type": "HowToStep"
,"text": "Transfer dough to greased bowl; cover with a warm damp towel or plastic wrap. Let rise in a warm area until doubled in size, about 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C). Grease a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bring water to a boil in a large pot. Divide dough into 13 pieces; shape into balls. Press a hole into the center of each dough ball; pull dough to form a 1-inch hole in the center, keeping dough about 1/2-inch thick. Drop dough circles into boiling water, 3 or 4 at a time. Boil each side for 45 seconds. Remove with a slotted spoon and drain for about 1 minute. Arrange boiled bagels on the prepared baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake bagels in the preheated oven until just starting to brown on the bottom, 8 to 10 minutes."
} ]
,"recipeYield": ["13"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Whatevs"
},
"reviewBody": "Sadly, the dough failed to rise, although it formed without issues and was very stretchy. I put it inside cold oven hoping it was warm enough to facilitate rising, but absolutely nothing happened. Besides, it was too sweet for my liking. Bitter disappointment, although, it may not have been the recipe's fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joe S"
},
"reviewBody": "Followed recipe exactly as listed. Ended up with a congealed Mass so sticky and wet that you could not shape it into a bagel and then would dissolve in the boiling water. Added flour at the end to try and shape it but ended up with more of it sticking to my hands and just a wet mass"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric"
},
"reviewBody": "Delightful recipe. Didn't have the instant coffee but was still excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "npb1111"
},
"reviewBody": "It needs a lot more flour. Dough was sticky and gooey and could not be formed at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Hessler"
},
"reviewBody": "The texture is spot on for a NYC pumpernickel bagel. The addition of coffee in the recipe made for a bitter bagel. Nix the coffee, add more caraway seeds and a hint of brown sugar to make this recipe pop with flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tanya Ellison"
},
"reviewBody": "I thought the flavour of this dough was good as followed. the only thing I changed was adding 1/2tbsp of instant Starbucks because it is more concerned. I think the bagels would be very small if you made 13. I made 6 and thought that was perfect. I let them rest 20 minutes before boiling. I'm my boiling water I used 2tbsp of molasses and 1tsp of baking soda for a 9\" pot with 4\" of water. more traditional that way. I boiled one minute each side and let them dry on a floured towel. I glazed with egg white, does the bottoms in cornmeal and sprinkled the tops with curse salt. bake at 450 for 25 minutes, increase temperature to 475 and bake 5 more minutes. Turn the oven off and let sit 5 minutes. Open the oven and let sit 5 minutes more. nice chewy crust that way and soft inside. I would use the dough recipe again with the same changes to baking. If you don't want to mix by hand it does just fine in a bread machine on the dough cycle. I added a couple extra spoonfuls of bread flour to make it less sticky. that will depend on your humidity and how you measure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BethK"
},
"reviewBody": "Delicious and \"worth eating\" when they were fresh and warm. They were quite small - if I do this again, I will make about 6 bagels with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom12189"
},
"reviewBody": "This recipe is awesome. I love pumpernickel bread so I wanted to try some pumpernickel bagels and these are absolutely great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Romano Japitana"
},
"reviewBody": "These turned out good. They look great. The kneading took a while and had to add extra bread flour for the gluten to start to develop while kneading. But I’m not sure what they’re supposed to taste like because I’ve never had one before. I’ll try making these again but will probably use less molasses or substitute it altogether with sugar. The flavor of the molasses was a little too strong. Maybe it’s just me though since I’m not a fan of molasses. Haha. \n\n\nApologies for multiple uploads of the same photo. I can't figure out how to remove them. The photo didn't show at first, do i kept trying to upload.hehe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "my son didn't care for these. I thought they were ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eclarner"
},
"reviewBody": "It was a good recipe to my taste. I followed the recipe almost as exact. I got 12 small bagels out of this batch, so I imagine 13 would have been very small. I would reccommend baking a while longer than listed. The only things I changed were activating the yeast in brewed coffee (didn't have instant) and letting it rise in the fridge overnight. The taste was good, but some of my guests complained of a strong cocoa powder taste. Would surely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanaHohenstein"
},
"reviewBody": "Very good recipe I altered a couple of ingredients. I used malt barley instead of molasses and did not add the coffee. I also used olive oil instead of vegetable oil. I used bread flour in place of all purpose. \nI also added malt and baking soda to the bioling water. Was a little sticky I most likely will add the couple of teaspoons of vita flour next time. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "starlily185"
},
"reviewBody": "I liked this recipe, but I would suggest about 1/4 cup less water (then adding it as needed) and some sugar (about 1 tbsp.) to make it sweeter. Otherwise, a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jamespphoto"
},
"reviewBody": "My dough came out extremely sticky and when I boiled them they literally fell apart!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Eleen"
},
"reviewBody": "This is the first time I have ever seen a recipe for pumpernickel bagels in the UK. My husband has raved about them in New York where he visited a relative for many years. We went there as a family and tasted them when I saw this recipe I tried it straight away. These bagels are exactly what we had in New York a fantastic recipe and it's saves us a lot of money as we were getting them shipped over twice a year from a deli on the lower east side. A recipe well worth the effort double the mix and freeze half no problem. I added a lot more caraway seed because we love the taste of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TR6"
},
"reviewBody": "Have made this by recipe directions and we loved it, also have put my own touches to it. Our family loves dark rustic breads and flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Marie"
},
"reviewBody": "This was my first time making bagels at home, and wow are they tasty! I did not have coffee crystals, so I used brewed coffee in place of water. I was also out of molasses and subbed maple syrup. The dough was overly sticky so I ended up added extra flour during kneading ~1.5 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookiekisses"
},
"reviewBody": "I added 1 Tbsp. of brown sugar and 2 tsp. gluten. I also egged the top. The texture is amazing and they taste delicious. But, the recipe does not make 13 bagels unless you are making them tiny. I made 12 and they are equivalent to size as the minis that get sold in the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "southernfryedyankee"
},
"reviewBody": "This was my first time making these and these bagels brought me back to NY although I think a few tweaks could be made. I added 2 TSP of vital wheat gluten to the mix. If you have an efficient oven like I do I would drop the temp to 425 and cook slightly longer (if you have a baking stone that is a definite PLUS. I (personally would add more caraway seeds) I would definitely do a 1 egg and 3 TBSP water egg wash over the bagels after they have dried from the boiling water. The bagel insides were slightly wet in some places but because they were hot they continued to cook during the cooling process so don't be alarmed if they seem a little \"juicy\" in some places. They seemed to be lacking in something taste-wise but I just cannot place what as I have not been to NY in many many many years to have a REAL pumpernickel bagel. They definitely have the denseness of a classic pump bagel which was most certainly a plus. Overall if I can figure out what I am lacking and refine my recipe slightly there is absolutely no reason why these bagels would not deserve 5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dunk"
},
"reviewBody": "Great! Will make many more in the future. Used olive oil in place of vegetable oil and no coffee. Perfect!\nDave &amp; Sue"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alyse"
},
"reviewBody": "This recipe turned out very well. I added 1 tablespoon of brown sugar because I like my pumpernickel bagels a bit on the sweeter side, and it turned out well. Next time I may decrease the amount of ground coffee just because that flavor came through a bit strong for me, but it could also be the type of ground coffee I used. Also, with regards to the prep time, this definitely took me more like 45 min to prepare, and this wasn't my first time making bagels."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223557/pumpernickel-bagels/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1537/bread/yeast-bread/bagels/",
"name": "Bagel Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223557/pumpernickel-bagels/",
"name": "Pumpernickel Bagels"
}
}
]
}
}
, "about": [
]
}
]