				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpkin Cheese Bread II"
,"datePublished": "1999-11-12T14:56:06.000-05:00"
,"dateModified": "2022-08-29T23:17:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tina Andre' Fox"
,"url": "https://www.allrecipes.com/cook/34998"
}
]
,"description": "A wonderful surprise awaits you when you bite into this delicious bread: orange-flavored sweetened cream cheese, the perfect complement to this lightly-spiced pumpkin treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/smZGQ2smxEYmoSJYFGeuHaAeJkw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2688299-pumpkin-cheese-bread-ii-sporkism-4x3-1-badb041dda04420d8ee49e16d6e695d0.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpkin Cheese Bread II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "217"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "293 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "54 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "221 mg"
,"sugarContent": "27 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (8 ounce) package cream cheese",
"0.5 cup white sugar",
"1 tablespoon all-purpose flour",
"1 egg",
"1 tablespoon orange zest",
"1.6660000085831 cups all-purpose flour",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"0.5 teaspoon ground cinnamon",
"0.5 teaspoon ground cloves",
"0.5 teaspoon pumpkin pie spice",
"1 cup pumpkin puree",
"0.5 cup vegetable oil",
"2 eggs",
"1.5 cups white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease two 8x4 inch loaf pans."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, combine cream cheese, 1/2 cup sugar, 1 tablespoon flour, 1 egg and orange zest; beat until smooth. Set aside. Sift together 1 2/3 cup flour, baking soda, salt, cinnamon, cloves and pumpkin pie spice; set aside"
} ,{
"@type": "HowToStep"
,"text": "Place pumpkin, vegetable oil, 2 eggs and 1 1/2 cup sugar in a large bowl; beat well. Stir the pumpkin mixture into the flour mixture just until combined. Fold in the pecans if desired. Pour 1/2 of the pumpkin batter into the loaf pans. Spoon cream cheese mixture on top of this layer and then pour on the remaining batter."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 60 to 70 minutes, or until a toothpick inserted into center of the loaf comes out clean. Cool bread in pans for 10 minutes before removing to a wire rack to cool completely."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Millan"
},
"reviewBody": "I followed these directions. Next time I would increase the temperature to bake at 350 not 325. Took a lot longer to bake at a lower temperature. More than 70 minutes. Also, put more cinnamon in it then the recipe called for and take out the ground cloves. The recipe as is had a bland flavor. Wasn't impressed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "catcoooties"
},
"reviewBody": "This recipe is terrible. Followed the recipe and instructions to a T and the loaf came out over baked, chewy and so mushy on the bottom it fell apart when I took it out of the pan despite letting it cool thoroughly. I made this to take to a thanksgiving dinner my parents invited me to and I'm embarrassed to bring it now. This recipe needs to be severely reworked or taken down. waste of money and ingredients that could've went towards something edible. Stay away from this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nosocks"
},
"reviewBody": "Followed the recipe exactly and both loaves came out raw in the middle still. Put them back in the oven, still gooey and raw in the middle when taken out again. They came out very flat too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lhansil"
},
"reviewBody": "This was so good! I saw another reviewer had increased the pumpkin and eggs to make a 9x5 loaves. I did the same thing only increasing all the cake ingredients to make 3 - 8 x 4 loafs because I happened to have three of the disposable one. I increased the pumpkin to a whole can, 3 eggs, 2 cups flour and increased the spices to 3/4 tsp each. So, so good! This will be a recipe to go into my cookbook of favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rachel_anne"
},
"reviewBody": "It was fine, but no better than any other pumpkin bread I've tried. I thought it was really really sweet. Also, be careful with the portioning of pumpkin batter - there's not a lot and if you're not careful the top layer of pumpkin is pretty thin. Baked fine, good taste, just not sure the cream cheese adds anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARLA10"
},
"reviewBody": "This is a fantastic pumpkin bread. I adapted the recipe to make 1.5 of the original recipe (my loaves were a little short). Put the filling in a piping bag for easy and even layers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Bogaart"
},
"reviewBody": "I’ve made this twice. Both times, I had to substitute the orange peel for 1tbsp citrus concentrate (sea buckthorn) because I didn’t have orange and need to use up the sea buckthorn. I have made it both as a loaf and as muffins, since I have only one loaf pan. Both are amazing but muffins are easier for sharing with neighbours and sending home with guests. The loaf stayed super moist! I made anywhere from 3 to six muffins plus the loaf, depending on how much I wanted of each. The muffins took about 1/2 hr to bake. I also once substituted 1/2tsp extra cinnamon, 1/4 tsp ginger, and 1/4 tsp nutmeg for the pumpkin pie spice since I didn’t have any. It was amazing both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amanapants"
},
"reviewBody": "This is EXCELLENT! I cut the recipe in half and was positive I messed it up because the “top layer” of bread mix didn’t really cover all of the cream cheese layer and the cream cheese filling seemed to rise before the bread, but it all worked out and was amazing. I added about a quarter teaspoon of vanilla to the cream cheese filling and used a hand mixer to fluff it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Green"
},
"reviewBody": "This is a holiday favorite that I give to my bosses and close friends. The only thing I don’t do is add the orange zest cause I personally don’t like it. However, it is still awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christelstar"
},
"reviewBody": "I used vanilla instead of orange zest and made it into one loaf. Baked for an hour and 35 minutes. Turned out so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmeeks"
},
"reviewBody": "I’m am so very pleased with this recipe. This will be a fall-time staple from now on. The recipe is perfect as is. Next time I think I’ll throw in some toasted walnuts, raisins, and soak it in an alcohol simple syrup (either rum or a bourbon with an orange liqueur). Of course I’ll have to cut down on the sugar a bit. I’ll post a recipe whenever I decide to take this up a notch for a holiday treat. I’m just in awe of how delicious this bread is. I also had a little pumpkin purée left and made it into a face mask. Oh how I adore autumn!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Gerber"
},
"reviewBody": "Amazing!! My entire family LOVED this bread! I made the recipe as is (even though I considered not using the orange zest and adding vanilla.)\nMake the recipe as its written, it's perfect!!\nMy husband who typically doesn't like pumpkin things even loved it! KUDOS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "So delicious and moist! I made this as the recipe recommended except I added 1/8 tsp of almond oil because I love the smell as it bakes. I might reduce the sugar next time because it is pretty sweet, but if you want it sweet it’s fine as is. Comfort food at its best!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene"
},
"reviewBody": "Delicious! I substituted half applesauce for half the vegetable oil. Next time I will try substituting applesauce for all the oil. Liked the orange flavor in the cream cheese. I didn’t have an orange to zest, so I used orange extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alan Wiley"
},
"reviewBody": "Followed the directions to the T. Center middle top did not cook at all. Tasted to much like orange. I enjoyed it and so did my family. I know better for next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Bean"
},
"reviewBody": "Excellent taste, easy to make, adds a special layer that is impressive to guests. Will keep this recipe for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tweetybaby1199"
},
"reviewBody": "Amazing! Added more spice and dusted with cinnamon sugar. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Amazing! Added more spice and dusted with cinnamon sugar. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kleonard"
},
"reviewBody": "Made it for Thanksgiving last year..absolutely delicious and was requested to make it again, asap!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Cunningham"
},
"reviewBody": "This is delicious. I did not have cloves or orange zest. I substituted the orange for extra vanilla and substituted the cloves for 1/2 tsp cinnamon. I also added extra pumpkin pie spice and the tiniest smidge of cayenne powder to the cinnamon for n extra added spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Woods"
},
"reviewBody": "I made it just as the recipe called for and it was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karman"
},
"reviewBody": "This is a really good recipe. I wanted less sugar and less oil so I only used 1/3 cup sugar in the cream cheese filling, replaced 1 cup of sugar with 1 cup of applesauce, and subbed half the oil with applesauce. It still turned out great, and was super moist (and dense likely due to all the applesauce, which is OK with me). Next time I’ll add more spice and double the batter to make two full loaves— with this amount of batter My loaves were a bit short."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie Garrison"
},
"reviewBody": "Delicious and easy to make. I followed the recipe exactly as written. Everyone loved it but unanimously recommended that the cream cheese center be reduced by half. I totally agree It is so rich it overwhelmed my taste buds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denice Moscarelli"
},
"reviewBody": "Made this exactly as written and it was a HUGE hit! I've had people PAY me to make this for them because they thought it must be so difficult to do! Absolutely going to keep this in my fridge and freezer to enjoy whenever I get an urge for something a little sweet and a little tangy/spicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLCARLIN"
},
"reviewBody": "Great bread. Don’t be afraid to have the cream cheese layer thick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Ard"
},
"reviewBody": "A few minor changes &amp; baked it in a square pan. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZeroReject"
},
"reviewBody": "Delicious and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjm"
},
"reviewBody": "I have been making this for years now. It is always a hit around the holidays. I make lots of them for co workers and family. The only thing i do different is omit the cloves and orange peel. I had a little bit more cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer DeVault"
},
"reviewBody": "Very good. I had to make it again the following week because I loved it so much. I omitted the orange peel, cloves, and added vanilla to the cream cheese mixture. I wanted more cream cheese in the bread so the second time I made it, I doubled the cream cheese (you can see the difference in the side by side photos). This is definitely better served cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Delish. I made this for our annual ‘welcome fall’ dinner and it was a hit. I made it in a bundt pan as suggested by another review and It looked as good as it tasted. I followed the recipe for the cream filling but I did up the batter by another 1/2 and the amount for the pan was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trae Parker"
},
"reviewBody": "Amazing Recipe! Highly Reccomend The Orange Zest skipping it would leave the filling bland. I read reviews that said theirs came out flavorless and am pretty sure it’s because they used old spices. Spices do not last forever and after a year or so loose their taste and aroma. Replace your fall baking spices yearly and you will never have to worry about recipes coming out flavorless. It is also a really good rule of thumb to use fresh baking soda/powders because they absorb odors and whatever they have absorb can come out in your baked goods."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Megan Warren"
},
"reviewBody": "This bread needs more spice, it was kind of bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wwincolorado"
},
"reviewBody": "Nice variation to pumpkin bread, moist and rich. I added the pecans because we like them. Wasn't sure how much pumpkin mix to put on the bottom so layering takes some guess work. The cream cheese is thin so it was more pourable than spoonable making the top layer hard to position but it works. Swirled it a little to even the pumpkin mix out. Next time I'll double the spices for personal taste but wasn't disappointed as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherre Kimmel-Price"
},
"reviewBody": "I have made this many times and in multiple forms. \nI like spices. So I added twice the amount to the cake. I've also spiced up the cream cheese too which made it better in my opinion. Don't be afraid to play with the recipe and use as much of the spices you like. Everyone will love it! Trust me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NurseAnita"
},
"reviewBody": "This recipe was so easy to make and yummy! My family and friends raved over it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coleyq"
},
"reviewBody": "This bread was a big hit! I followed the recipe exactly except I did not have Orange Zest on hand so I added 1/4 tsp of vanilla. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah J."
},
"reviewBody": "Excellent pumpkin bread, made it with fresh, pureed pumpkin and followed the advice of another reviewer by substituting vanilla extract for the orange zest. Instead of two loaf pans I made it in a 9x13 cake pan, which turned out great and didn't affect the baking time at all. Next time I might cut a bit of the sugar and add more pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TUNISIANSWIFE"
},
"reviewBody": "as written, the amount of spice in this is very very bland. I needed to add much more spice and even then, it could have used more. Made this in a bundt pan and it turned out great. I don't know how this would make two loaves, however. It was just perfect amount for a bundt pan. The addition of the orange is beautiful, and compliments the pumpkin, adding another level of flavor to the cake. Because the batter is thick, it makes it easy for the cheese portion not to sink. I got so many compliments on this cake, and one who does not like pumpkin even commented that it was the best pumpkin based baked good they have ever had. thanks for this recipe. will make this as a regular part of the fall baking. Has a beautiful presentation. made a thin frosting to glaze the cake using confectioner's sugar, butter, and pumpkin spice creamer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diana Fox"
},
"reviewBody": "The flavor of the cream cheese mixture was fabulous. I found the bread did not rise very well. I think next time I would add some baking powder. Otherwise the flavor was wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blue Nutrition"
},
"reviewBody": "I have made this just like the recipe, without the cream cheese, low fat, with nuts, and more. They all came out great this recipe is amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy R"
},
"reviewBody": "I really like the amount of spice that is in this bread. For two loaves I thought the cream cheese layer was rather scant- came out much less than the pictures I saw of other people making their recipe. I also ended up over doing the bottom layer and then didn't have enough pumpkin to cover the cream cheese- thank goodness for swirls! The flavor was nice, but think I would have put more cream cheese and I generally like a denser bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Riley B. Hagel"
},
"reviewBody": "Okay. The flavor and presentation are AH-MAZ-ING. My changes:\n• I added 4oz extra cream cheese as mentioned in another review\n• Double the cinnamon\n• Used cloves and allspice instead of pumpkin pie spice\n• Added all the spices to the cream cheese mixture as well as into the bread batter \n• Doubled the amount of bread batter for 2 - 4\"x8\" pans....\nAnd yes, it tastes incredible. Hands-down the best pumpkin bread I've ever made or tried.\nHOWEVER....... \nThis recipe is very poorly written when it comes to the cook time!!! 60-70 minutes is NOT enough time - I have had mine baking for a total of an hour and twenty minutes, and they're STILL not done. Toothpick came clean and everything, but the centers are still clearly soggy - no firmness at all. Could be because I doubled and changed things, but even still.... \nSo as long as you bake it long enough, you'll enjoy this bread a TON."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Saxton Pressman"
},
"reviewBody": "Delicious! The cream cheese makes a difference. I think running a knife through it would have a wonderful effect. The bread is very moist. Definitely worth changing from my family recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "I added chocolate chips to the cream cheese!! Heaven in my mouth!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Meredith Wong Hughes"
},
"reviewBody": "Not bad, just not what I was hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Excellent, turned out perfectly. I made it as suggested but swirled the mixture before baking. Will definitely make again. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suegibson1960"
},
"reviewBody": "Very good and tasty. Very easy and quick to make even though there are 3 steps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tina"
},
"reviewBody": "Loved It! I actually made one bread and doubled the layers - Pumpkin batter; cream cheese filling; pumpkin batter; cream cheese and then the rest of the batter! I love the cream cheese filling, I actually used 12 oz. of cream cheese. Used vanilla (as suggested by reviewers) in place of orange zest - glad I did. Took a bit longer to cook (I have a small oven so as far as time to cook, I just kept checking on it every 15 mins. after an hr. of cooking which is probably why mine sunk in the middle). Will definitely make it again!\n\nNote: To GramChase - I had to spoon mine into the pan as you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystal"
},
"reviewBody": "I make this in mini loaves as part of my gift baskets I give to neighbors and friends at christmas. Its always a big hit!!! Do not omit the orange zest in the cream cheese it gives a beautiful citrus flavor that compliments the pumpkin. After I zest my orange I. Squeeze about a teaspoon of juice from it in the cream cheese and then in the pumpkin puree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alli"
},
"reviewBody": "This was super easy to make and tasty. I added mini chocolate chips to 1 loaf (also super tasty). The cream cheese layer was exactly what I was looking for, and similar to my favorite bakery's cream cheese-pumpkin muffins. I need to tinker a bit to up the PUMPKIN, though (possibly subbing some for some of the oil.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sporkism"
},
"reviewBody": "This really is the best pumpkin bread ever! I've made it many times. Perfect as written, but I prefer to add an additional 1/2 tsp of cinnamon, a pinch of nutmeg, and a little extra zest. Instead of loaf pans, I use a single glass casserole dish (the taller sides keep everything in as the bread rises) and it comes out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steb0022"
},
"reviewBody": "Delicious! I think the orange is a little strong but I love it! Next time I will try substituting some of the sugar with apple sauce to reduce the amount of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracydel"
},
"reviewBody": "followed the recipe and it came out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bountiful Baker"
},
"reviewBody": "I followed the recipe exactly, but had to bake the thing for almost 2 hours so the filling wasnt gooey. Even after the longer bake time, the loaf turned out floppy, the \"cheesecake\" filling was more of an egg custard, and the overall flavor profile was unappealing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "misschefgirl36"
},
"reviewBody": "I would post a picture but for some reason no matter how much I adjust it, it keeps telling me it's the wrong size. Don't get me wrong, the pumpkin bread itself turned out really good. Very moist and just the right spice. I had really high hopes for the cream cheese filling since the \"batter\" for it tasted so good before I actually put it in the bread to bake. However, I'm surprised no one mentioned in their reviews that the \"cream cheese filling\" in the middle is not a frosting like you would expect. It's more like a cream cheese and orange flavored batter that is baked into the bread. If you are expecting a cream cheese frosting in the middle then you will be disappointed like I was. I do agree that the orange zest in the filling really complimented the pumpkin flavor of the bread so I would highly recommend not omitting it like other reviewers have done. I think if it weren't for the orange zest this recipe wouldn't really stand out from other pumpkin bread recipes out there. Also a word to the wise: I did not find that it made enough batter to make two loafs like the recipe calls for. I went ahead and just put all of it in one 8x4 loaf pan. It filled it to the top. It didn't overflow and turned out fine. I wound up with a total baking time of an hour and 20 minutes because it was a larger loaf but of course bake times will vary depending on your oven. Next time I will follow the bread recipe but will use a different filling recipe and just add orange zest to it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yucagringa"
},
"reviewBody": "This was really really good. I made two last night and one my husband and I shared and there was a little bit left for him for breakfast. The other I brought to work and it is was finished before I could finish my review. Please do put a small amount of batter in the bottom of the pan as others said. I thought I did, but there wasn't much batter left to cover it. Turned out pretty though! I forgot to get a picture and now there is none left! Thank you Tina!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney R"
},
"reviewBody": "this is amazing. i didnt use the orange zest, and added extra cinnamon than called for, also added some nutmeg and vanilla ext. it turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "readingtchr"
},
"reviewBody": "Unbelievably delicious. It is our new holiday favorite. Not too sweet and has layers of interesting tastes. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingLikeCrazy"
},
"reviewBody": "Fantastic,! Made as directed....do not skip orange zest as some stated. This is what sets this cake above the rest; it is that \"wow\" factor that makes the spices pop."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb McCleary"
},
"reviewBody": "Baked this tonight. Did not have the citrus zest so used one teaspoon of vanilla in the pumpkin batter. I also substituted one teaspoon each of pumpkin pie spice and all spice. Oh my goodness, this turned out really good. Baked mine in a Bundt pan and it worked beautifully. It was good warm from oven and bet it will taste even better once cooled off and refrigerated. Husband wants me to bake this for a pot luck at his work ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trish-the-Dish"
},
"reviewBody": "Giving it a 4...it doesn't bake up very tall at all. I like my sweet breads to be tall and not a short loaf like this one. The flavor is good though...I wish I would have put in even more orange zest...the flavor is great. I'm not sure if I will make this one again, or not?\nUsed fresh processed pumpkin, not canned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeachMomva"
},
"reviewBody": "This was absolutely delicious. First time I have ever made pumpkin bread. My family loved it. Will be making for the holidays this year! So light not a heavy bread like some others I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EmWill"
},
"reviewBody": "This is very good. I didn't have an orange so used dried orange peel in place of the zest (not sure that could be anywhere near as good). The spice is perfectly offset by the cream cheese. \nI sent this to my freshman college student who couldn't come home for fall break. Just hoping it ships well (used a disposable ice pack, 2 day shipping). I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "I made this last Christmas and my co-workers and family loved it! I'm going to try as muffins combining with witchywoman's Cream Cheese Filled Pumpkin Muffins recipe ideas, and will return to rate again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leeann Latouche"
},
"reviewBody": "Absolutely moist and delicious!! I've been making it for about 2 years now, and always have rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Webb Clair"
},
"reviewBody": "The directions mention folding in the pecans, but there are none in the list of ingredients. One cup or more/less??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "justaNovice"
},
"reviewBody": "im not sure what happend here- ended up like a boat anchor! was only 2 inches tall in the pan after baking and was tough and solid mass of dough. worst bread ever! i did notice there is NO baking powder in the recipe but im not that good at this stuff [i can follow a recipe about it ] so i dint really think twice about it .. is this a typo?? baking soda but not baking powder ??? i read the comments because alot of people have helpful comments with typos and substitutions - but NOWHERE was the ommision of any ingredient to make this dough rise listed as a recommendation ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keeli"
},
"reviewBody": "Wow! super moist and nicely spiced and the cream cheese ribbon is just fun. I didn't have much hope for this when it came out of the oven so flat, but maybe just needed a smaller pan because the taste was fabulous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Barb Strong Rice"
},
"reviewBody": "Just popped in the oven and keeping my fingers crossed. Not enough pumpkin batter to give a good bottom and top layer. The batter tastes great, as does the raw filling, so hoping it works out. May have to double the pumpkin mix to make this really work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bizlas"
},
"reviewBody": "Wonderful recipe. The only thing I changed was I omitted the cloves and added 1/2 tspn more of pumpkin pie spice as well as a pinch more cinnamon. I also omitted the orange and added vanilla to the cream cheese mixture out of personal preference. Everyone loved it! Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerseymama"
},
"reviewBody": "Really, really delicious!! The orange is the perfect touch! I actually added vanilla, and also ommitted the sugar and made it with splenda, it was just as delicious as the sugar recipe. I also cut the sugar in half in the original and when it cooled I drizzled on cream cheese glaze like a dunkin donuts pumpkin muffin!! loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianeb"
},
"reviewBody": "It is in the oven now, and it smells great!! I left out the ground cloves and used little more pumpkin pie spice. Can't wait try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TTomeo"
},
"reviewBody": "This was pretty good. A little too much spice but I liked the additional orange in the cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Robbins"
},
"reviewBody": "I made this into mini loaves but they took forever to cook. In the end, I had to throw a couple away because they were still gooey, even though I had checked them with a toothpick. The flavor of the bread and filling was very good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "Delicious! Only advice I would give would be to make sure you flatten out the cream cheese portion before adding the top layer. I have made this three times and the last time I just kind of poured the cream cheese mixture on and then added the top layer of pumpkin....the cream cheese portion of the bread was too clumpy when I did that! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ralu Codruta Pascal-Buhaescu"
},
"reviewBody": "This turned out delicious and very moist. The orange zest really makes the flavor pop, I added ground walnuts to the batter and it all turned out to die for!!!!! I will definitely make this again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "henny penny"
},
"reviewBody": "this recipe yields too much filling and not enough batter to cover both loaves. what a waste of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "This was excellent! Followed the recipe step by step omitting the orange zest. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Navkiran"
},
"reviewBody": "This recipe is FANTASTIC &amp; exactly what I was looking for. I didn't add orange zest, ground cloves or pumpkin pie spice because I didn't have any one hand. I added a teaspoon of vanilla. And I only used half a cup of pumpkin pie filling (the canned one) so I was able to make 2 batches.\n\nDelicious!! Definitely recommend. Super easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbmontini"
},
"reviewBody": "love this recipe, it is a family and friend favorite. I personally prefer to not use orange zest and to not add an egg to the cream cheese mixture - but I make it both ways and certainly will eat my fair share anytime this bread is available."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Conderman"
},
"reviewBody": "This is excellant! Try to even layers as much as possible otherwise cheese comes to close to the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "senthere76"
},
"reviewBody": "This is an EXCELLENT recipe. I made it in small ceramic holiday loaf pans and gave as Christmas gifts. I also layered in a muffin pan for cupcakes. The first few times I made this I ended up with extra cream cheese mixture. Now I make another half batch of the pumpkin mixture and the proportions come out correctly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kattoys"
},
"reviewBody": "The aroma is wonderful! I also omitted the orange zest simply because I'm not fond of the taste of orange with pumpkin, cranberry, etc. I followed the other parts of the recipe. My only issue was that the bread on both sides separated from the cream cheese mixture as I tried to pull it from the cooled pan, and even more so as I cut into the loaf. I will assume the way the loaves turned out was a fluke and try the recipe again with my remaining pumpkin puree in another day or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee"
},
"reviewBody": "This was really really good. I read all the reviews and saw that a lot of people used vanilla extract instead of the orange zest. I decided to follow the recipe exactly as written and used the orange zest. I am so glad I did! It added such a wonderful flavor. I think without the orange zest it would have been very bland. It came out of the oven about an hour ago and already half of it is gone and there are only 2 of us eating it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Andre' Fox"
},
"reviewBody": "Thanks you all the nice reviews, but I have to tell you the orange zest is very important in this recipe. If your omitting it, your need to try it with it because it's what makes this bread so unique. Enjoy! Tina Fox"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "opensaysamy"
},
"reviewBody": "Delicious! I love the combination of tastes and textures. I didn't use the orange zest (subbed 1/4 t vanilla extract as another reviewer suggested), but I might have to try that next time. I sprinkled the top of the loaves with pecan chips, too. I do have to say that it was sort of a pain to make. It was hard to gauge how much batter to put in the bottom of each loaf pan.... I ended up putting way too much in the bottom of one pan and the cream cheese layer wound up closer to the top and didn't stay as moist as my other loaf, which had a much thinner bottom layer. As another reviewer stated, the pumpkin batter came out thick and it was tricky to spread the top layer on. And there was a LOT of clean up afterward. But overall, totally worth the frustration and the mess. : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zhou"
},
"reviewBody": "This bread was good but I thought it needed more spice. I didn't have any orange zest, so added 1/4tsp. vanilla as the other reviewer suggested and omit the cloves and up the cinnamon to 1tsp. I also didn't have 2 loaf pan, so I use 8x8 inch pan and worked out perfect. It took 70 mins. to cook. If I were to make these again, I'm gonna add a bit more spice and maybe throw in some walnuts or pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessielee1389"
},
"reviewBody": "This was really good. Just the bread without the cheesecake is a great recipe. The change I made was I made the cream cheese filling \"pumpkin cheesecake\" I added some of the pumpkin \"puree\" to the cream cheese mixture plus a couple pinches of nutmeg, cinnamon, and cloves. I also refrigerated the bread before we tore into it and I must say this is a nice COLD dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "I cut the recipe in half to make 1 loaf. I subbed Splenda for the sugar, egg whites for eggs, wheat flour for about half the flour and used additional pumpkin in place of the oil. It was a good recipe, but not outstanding. I liked how the spices stood out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "recipelover"
},
"reviewBody": "Excellent recipe. Very moist, sweet and perfect for entertaining. Very good the next day too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "truckergal 53"
},
"reviewBody": "Delicious flavor, good choice for a loaf!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "4kidsinthehouse"
},
"reviewBody": "I must have done something wrong. This was nearly tasteless. We salvaged it by topping it with spiced applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wisekiley"
},
"reviewBody": "This is my first time making ANY pumpkin bread, and I'm glad I chose this recipe. It's amazing!! I followed the recipe exactly, only, I only had two bread pans that happen to be different sizes so I had to compensate for that, but it still turned out great. I froze 1 loaf because we ate the first loaf within 2 days. It's that good! Thank you Tinafox!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Ashburn-Forest"
},
"reviewBody": "I LOVE this bread. I will say that I had difficulty with the layering so I swirled the cream cheese center. I am throwing out my pumpkin roll recipe and using this from now on. Much less work and absolutely delicious! Dense, perfectly sweet, lightly spiced and the loaves lookes really pretty coming out of the oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nici"
},
"reviewBody": "A yummy bread, that disappeared fast once my kids got into it! We loved the addition of orange zest. This doesn't rise much, but cooks evenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neenie600"
},
"reviewBody": "My family ate all the bread within 2 days. This is an excellent recipe. I also omitted the orange peel and substituted vanilla in the cheese filling. On the bread mixture I left out the gloves and doubled up on cinnamon. It was delicious and worked out well for me because I didn't have orange zest or cloves on hand. I also didn't have 2 bread pans, so I used the second half to make cupcakes. They cooked a lot faster than the bread and my family thought they were the best cupcakes they had ever had. They reminded me of the seasonal ones you can get at Starbucks, but at a fraction of the cost. Thanks Tina for sharing this recipe with us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dedwards"
},
"reviewBody": "I didn't care for the taste of cloves. The bread was moist and had a good texture. Next time I would eliminate the cloves or put less."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Cooley Davis"
},
"reviewBody": "Wonderful! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "val"
},
"reviewBody": "I make this with by doubling everything and then using one large (30 oz) can of pumpkin pie filling- then I omit the oil. I use the 1/3 less fat cream cheese and add a little vanilla. This makes 3 normal size loaves. Sprinkling the pans w/ cinn. sugar is delicious! We love this recipe- thanks for sharing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17968/pumpkin-cheese-bread-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
"name": "Pumpkin Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17968/pumpkin-cheese-bread-ii/",
"name": "Pumpkin Cheese Bread II"
}
}
]
}
}
, "about": [
]
}
]