				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpkin Pie Muffins"
,"datePublished": "2020-06-18T23:56:18.000-04:00"
,"dateModified": "2022-08-28T12:41:08.000-04:00"
,"author": [
{"@type": "Person"
,"name": "PChicki"
,"url": "https://www.allrecipes.com/cook/8602458"
}
]
,"description": "Transform all the ingredients for pumpkin pie into a muffin for a festive breakfast treat or snack during the holiday season."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OE-aIw3auBB-5jTDoOdsGD7zQ7o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1583822-pumpkin-pie-muffins-Buckwheat-Queen-4x3-1-3b8179de039b4b14a8f109ae3290c264.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpkin Pie Muffins"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "203"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "241 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "31 mg"
,"fiberContent": "4 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "336 mg"
,"sugarContent": "25 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 cups whole wheat flour",
"1.5 cups all-purpose flour",
"5 teaspoons pumpkin pie spice",
"2 teaspoons baking soda",
"1.5 teaspoons salt",
"1 (30 ounce) can pumpkin pie filling (such as Libby's®)",
"3 cups white sugar, or more to taste",
"0.5 cup vegetable oil",
"0.5 cup water",
"4 large eggs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 330 degrees F (166 degrees C). Grease 24 muffin cups or line with paper liners."
} ,{
"@type": "HowToStep"
,"text": "Mix whole wheat flour, all-purpose flour, pumpkin pie spice, baking soda, and salt together in a large bowl. Whisk pumpkin pie filling, sugar, oil, water, and eggs together in a separate bowl until just mixed. Stir flour mixture, about 1/4 cup at a time, into pumpkin mixture until batter is just combined. Fill muffin cups with batter just below the brims."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 30 minutes. Cool muffins on a wire rack."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dawn555"
},
"reviewBody": "As others have said I think you can safely substitute other flours for the whole wheat flour. I substituted 3.5 c. gluten-free flour for both flours and the muffins turned out great. In fact, they did not have a \"gluten-free\" consistency at all, so I'd say this is a fantastic recipe for that reason!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marilyndenisemorris46"
},
"reviewBody": "I loved making this recipe as I love pumpkin. I used fresh purée that I made, I also added pumpkin pie extract, pure cane sugar, and added chopped walnuts on top. Thanks for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennifer"
},
"reviewBody": "Good, basic recipe. Used pumpkin not pie filling mix, white flour and spices to taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LOVESUBLIME"
},
"reviewBody": "I halved this recipe so I could use a 15oz can of pumpkin puree. THESE ARE SO GOOD. I love that it has both white and whole wheat flour and very little sugar. I use my own blend of pie spices (cinnamon, nutmeg, ginger, allspice) since I find some pumpkin pie spice blends overpowering. I added 1/4c of oats and a handful of mini chocolate chips and theyre just divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Horvath"
},
"reviewBody": "These were so delicious! Perfectly moist. I had to make an adjustment with the flour because I didn’t have enough all-purpose flour on hand, and had no wheat flour. Using a suggestion from one of the comments, I used 3.5 cups of Bob’s Red Mill 1-to-1 baking flour. They didn’t taste gluten free or have that grainy texture that sometimes gluten-free baked goods get. They were so delicious, moist, and absolutely perfect flavor and sweetness. It made about 30 regular-sized muffins. My kids love them! We will definitely save this recipe and make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Pearlstein"
},
"reviewBody": "Amazing results! I switched out regular flour for equal amount of old fashioned oats, added 1.5 tsp of baking powder, and used just 1 cup of brown sugar (no white). Put it all into Kitchen Aid mixer &amp; mixed it on 1-2 speed. Then, used soup ladel to pour into greased muffin tins. Super fluffy and moist. Can't tell that there is oats in there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly Schneller"
},
"reviewBody": "Husband made. we had german cookie spice that he subbed for pumpkin pie spice (6 tsp instead of the called for 5). it was spicy. he was happy. I am now craving the Pfefferneusse that he promised me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessica Davey"
},
"reviewBody": "Followed this recipe appropriately and the muffins did not rise at all. They were sunken in and too moist"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheMadBaker"
},
"reviewBody": "This recipe was AMAZING!!! I'm not very good at baking, but this dish impressed my whole family! The wonderful thing about these treats is after you leave them out for at least 24 hours, they become even more moist and taste like autumn in every bite. I would recommend this recipe to anyone who loves pumpkin pie and is looking for a great dessert or breakfast muffin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Orr Thomas"
},
"reviewBody": "I took another reviewer's advice and cut the sugar for a 1/2 recipe to 3/4 c + 2 T molasses and added about 1/2 c raisins. They were sweet enough, but very dark and needed more raisins and some crunch, so I think I will cut the molasses to 1 T and increase the raisins and add some nuts next time. I also baked them for 30 min at 350 F and they still could have used a couple more minutes, even though my toothpick came out clean. In these days of instant read thermometers, I wish all recipes would give a temp instead of just \"clean toothpick\" as a sign of doneness. Much more objective and precise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just got done with my first batch. I am in love. Thank you so much for sharing this recipe. I had to substitute sweet potato mash (needed to be used up) and had the perfect amount for the full recipe. I also didn’t have wheat flour so I used the substitute another poster mentioned. This recipe is flexible and as a single mom I appreciate it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "These muffins are delicious! I halved all the ingredients but wish I had made a full batch. They are going fast! They are so so moist and true to the name. Like eating a slice of pumpkin pie. This one’s a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heathencat"
},
"reviewBody": "Quick and easy!! Whole family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moki Alonzo"
},
"reviewBody": "These turned out really good! I’m not a pro when it comes to baking so I was really happy how this turned out. Like another reviewer said, I used only brown sugar and all wheat flour since that’s all I had too and they turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi31078"
},
"reviewBody": "We really liked these! We ate them for breakfast all week"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christy Temple"
},
"reviewBody": "I really liked this recipe. I used the leftover puree mix from making a pumpkin pie. So I had already added eggs, sugar, condensed milk and pumpkin pie spice to that liquid. I cut down the sugar to one cup of brown sugar, as three cups of sugar seemed too sweet for me. In place of the pumpkin pie spices, I added 2 tsp cinnamon, 1/2 tsp ginger, 1/4 tsp nutmeg, and a pinch of ground cloves. Baked for 24 min at 350 degrees. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "France Pion-Steiner"
},
"reviewBody": "I was so excited to try this recipe so I followed it to every detail. With 10 minutes left i started to smell burning so i pulled the muffins out. All the bottoms and edges were burnt. I am so disappointed ; what a waste of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FreeCake"
},
"reviewBody": "Wow these are sweet. I recommend you at least halve the sugar in it. Other than that it was pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Olive G"
},
"reviewBody": "Amazing flavor but didn't dome as much as I hoped it would. We had run out of normal all-purpose flour, so I used 3 cups of whole wheat. I added 10 minutes to the timer since it still seemed a little bit undercooked, but those few problems still didn't keep me from giving it four stars. It is SO delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Lovasz-Bell"
},
"reviewBody": "Could not find a 39 oz can of pumpkin. Used the 29 oz can. Used half almond flour and half regular and coconut oil instead of vegetable oil. Added dark chocolate chips!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CathyAR"
},
"reviewBody": "I did make these two different times. Due to the shortage at the store's because of the COVID-19 I could not get wheat flour so all I had on hand was white flour so that is what I used. The first batch I made as directed except the flour, I used all white flour. They were very good but really sweet. I had a family Easter dinner to go to so I made these to take again I used all white flour and I cut the sugar back to 1 and a 1/2 cups. They were a hit. My grandson of 4 loved them. Thanks for winner recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nina Travinsky"
},
"reviewBody": "When I read the ingredients I balked at the amount of sugar. But I used 1.5 cups of white and 1 cup of brown, and left the rest of the recipe as is. I recalled another comment about the muffins tasting salty but I didn’t adjust the salt. I wish I had! 1.5 tsp of salt is too much, it’s enough for each individual muffin to actually taste a bit salty. I will try this recipe again and maybe halve the salt..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooker"
},
"reviewBody": "I made a half recipe to try. I also added a couple tablespoons of sour cream, a half cup of rolled oats substituted for some flour, and butter for the oil. I also added a dash of vanilla and almond extract. You would have to double all that for a full recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Reid"
},
"reviewBody": "AWESOME muffins! I did reduce the amount of sugar in them though - and they still tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Carlin"
},
"reviewBody": "TOTALLY awesome! Glad to find a recipe that used pie filling and not plain pumpkin! like others recommended, made minor tweaks by... added vanilla and cloves, cut back to 2c sugar using half white and half light brown, used milk instead of water, half white and half whole wheat for, was pleasantly surprised that the author's heavy use of pumpkin spice was spot on. it all worked. fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennchef"
},
"reviewBody": "We love these muffins! The only change I've made to the recipe is swapping in maple sugar for the sugar recommended. Just made them for the second time - these will be a cold-weather staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cake Mommy"
},
"reviewBody": "My family &amp; I were craving something for a cloudy fall day &amp; these were just what we needed! I didn’t have baking soda &amp; was honestly too lazy to get out of the house so I substituted twice as much baking powder instead. I also didn’t have pumpkin pie spice (I needed to go shopping apparently!) so I used 2tsp cinnamon, 1tsp nutmeg, 1tsp clove, &amp; 1tsp ginger. These turned out absolutely perfect. They stayed moist &amp; taste just like pumpkin pie. I paired half of these with a homemade cream cheese frosting which the kids loved. They made several dozen so I’ll be sending these to work with my husband since I know we won’t be able to go through them all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madeline Lee"
},
"reviewBody": "I replaced the white flour with instant oats, and the water with sour cream- SO DELICIOUS! If you like oat muffins, definitely try it! They could've used more oats, even up to double the amount, but the flavor was great and they were perfectly moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy N Brian Porlier"
},
"reviewBody": "Very easy, very moist and not overly sweet. I made a half recipe and still had enough for 18 muffins. I did find that filling the muffin paper 3/4 full worked best. Fill \"to the brim\" caused over flow and muffin pan clean up. (Isn’t that why I used the muffin paper liners?)\nGreat recipe that shared on Facebook giving proper credit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Merindy Morgenson"
},
"reviewBody": "These were amazing as muffins. They were light and fluffy and even the ones I made ahead the night before and put in the muffin tins and then refrigerated due to power outage turned out beautifully the next morning, though the dough saturated the papers some and were a little sticky on the bottom of the muffin tin. I really like that this recipe includes the whole wheat flour as well. I think it really adds body to the flavor. I didn’t have all of all the ingredients so I used 1/2 of required amount of brown sugar and 1/2 of white sugar as I was running a little low on sugar which also gave it a rich caramel flavor. And I used 1/3 of required oil as butter and 2/3 as vegetable oil (again, what I had on hand). I made homemade pumpkin purée by seeding and peeling a pumpkin, cutting it into pieces and boiling for 30-45 min with a cup of water in a covered pan over medium low heat. Then I drained the water off (I saved it to use it in place of the water in the recipe) and put the pumpkin in my blender jar to cool. After fully cool, I blended it until it was quite smooth. Then I transferred it to my nut milk bag (which I usually use to drain cheese curds) and drained it until it was more or less the consistency of store bought pumpkin puree. This made a very smooth and more or less equivalent puree to store bought, which I haven’t found here (Bangladesh) yet. \n Just FYI, this recipe did not turn out well at all as a loaf bread (it is a muffin recipe, not a loaf recip"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise Fontaine"
},
"reviewBody": "Good and always moist. All who have tried these have liked them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Scott"
},
"reviewBody": "My daughters and I have made these the past couple of years, they are always a hit. This has become a holiday tradition or friends look forward to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren Horn"
},
"reviewBody": "Really tasty and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Jo"
},
"reviewBody": "Scrumptious, delicious, moist, wonderful!! I added 1 cup raisins and 1 cup chopped pecans. Will make these again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RavensFan"
},
"reviewBody": "I made these this weekend for a winter wellness class I was teaching. They were very moist and yummy! I made a few adjustments - I used 1 1/2 cup brown sugar and 1 1/2 cup white sugar, used pumpkin purée instead of pie filling and added 2/3 cup coconut sugar, and replaced pumpkin spice with an essential oil blend of clove vitality, nutmeg vitality, ginger vitality, cinnamon bark vitality, and orange vitality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassy Pop"
},
"reviewBody": "I just made this, I loved it but i made a few changes. I didn't have pumpkin spice so I just used cinnamon and ginger (didn't have nutmeg or cloves), I used half brown sugar, half white sugar, and used slightly less sugar than called for, I used evaporated milk in place of the water, I threw in about 1 1/4 cup of chocolate chips (1/2 dark, 1/2 semi-sweet), and lastly I made it as a loaf. The only reason I'm not giving 5 stars is because I made changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Gayle"
},
"reviewBody": "These are great fun - and easy! There’s no need for a mixer, just two bowls, a whisk, and a spoon. I used extra large muffin tins, which made twelve muffins and one small loaf. This recipe is a good choice when getting the kids involved. It’s that easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "moomix"
},
"reviewBody": "Very easy and quick to make; so delishiously chewy and moist.\nThey were much too sweet for my taste, even after reducing the sugar... I would reduce the sugar by more than half if I were to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geipa"
},
"reviewBody": "Love these muffins and so did my family. I lowered the sugar and used evaporated milk for water as another reviewer. Made my own pumpkin pie spice (this site) and muffins were wonderful. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "This is an excellent muffin! I've made it twice and everyone loves these muffins. The recipe makes 24 regular-sized muffins and a small loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "The muffins had great flavor, but they were heavy and dense. Not sure I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lili7"
},
"reviewBody": "Nice moist muffin. Good breakfast muffin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Surratt"
},
"reviewBody": "Delicious. Nice breakfast for Thanksgiving which we celebrated TODAY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakerwoman"
},
"reviewBody": "Great moist flavourful pumpkin spice muffin recipe but it is way too sweet with the recommended sugar amount for our personal tastes. I am so glad I tasted the batter after adding a scant 1 and 1/2 cups of combined white and brown (not packed) sugars. I found it plenty sweet with that amount. I used pumpkin purée as I did not have any pie filling and I also added applesauce instead of the water cuz I had some to use up. The pumpkin spice amount was bang on for flavour. I added a tsp of vanilla as well. I have made this recipe into the large muffins as well as into two loaves and a dozen mini muffins. It is delicious as is or with raisins, pecans or walnuts added to them. I will keep this recipe as my recipe for pumpkin spice muffins or loaves with these variations. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMEE"
},
"reviewBody": "The only change i made was not using any whole wheat flour. I just didn't have any on hand. Instead i used 3cups all purpose flour. These turned out great and everyone raved. A lot moister than the usual pumpkin bread i make. I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb K"
},
"reviewBody": "I made 24 minis and 12 regular muffins and 1/2 the recipe. Added white choc chips to the reg sized ones, very good. Used almond milk instead of water. Nuts would be good too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "april"
},
"reviewBody": "These were good, but not great. The only difference to the recipe I made was using 2 cups of sugar instead of 3 ( still plenty sweet ). They were very moist and more like a pumpkin bread rather than a muffin in texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huss"
},
"reviewBody": "Was fantastic making 40 cupcakes 2 nights in a row"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "these are awesome and so easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZumbaJ"
},
"reviewBody": "Oh my goodness! Everyone was right, even as a pumpkin recipe lover, I will stop looking after this one. I doubled the recipe exactly as written and baked half as cupcakes frosted with cream cheese frosting, and baked the other half into loaves. Both ways were amazing! And I mean AMAZING. Perfect density, soft and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bevabee"
},
"reviewBody": "These muffins were very moist and i will probably make them again. I added applesauce in place of 1 cup of sugar to increase the moisture. I also added chopped pecans to add texture. I cut the amount of sugar in 1/2 because 4 cups seems too sweet. If you are using cream cheese icing, make sure to cut the sugar amount so the muffins aren't too sweet. If you are serving them without icing, I would keep the 4 cups of sugar as the recipe requires. People from my office loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggie78"
},
"reviewBody": "I used 2 (15 oz cans of 100% Pure Pumpkin) instead of the pumpkin pie filling...since it was cheaper. Since that isn't as sweet I added an extra 1 cup of sugar. My family also loves the quick oats so I added 2 cups of that as well. They turned out beautifully and are delicious! I will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "Great taste and very moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don Lawson"
},
"reviewBody": "Son Said needs rasins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "G8rMom7"
},
"reviewBody": "These came out really moist. I had previously made some pumpkin \"cupcakes\" but they ended up tasting more like dry muffins, so I thought I'd try a recipe that is for actual muffins. A few things...the recipe called for 30 oz can of Pumpkin Pie FILLING. I could not find that, and only had 2 x 15 oz cans of pumpkin so that's what I used. I suspect that is what made them super moist. I also used apple sauce instead of some of the oil (I didn't have enough apple sauce to use it instead). I will say, the recipe is easy to cut in half and next time I will do that. This made 24 full size muffins and I will end up having to freeze them...too much. But overall, I will definitely make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toots"
},
"reviewBody": "I have already made two batches of these, so good. My granddaughter called and asked me to make them for a school bake sale!! Will definitely be making more....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki L Anderson O'Brien"
},
"reviewBody": "I added the vanilla and milk to the batter. And topped the finished product with cream cheese frosting which made them so decadent that I thought I was eating a Nothing Bundt cakes treat! Moist and delicious describes these perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Stambaugh"
},
"reviewBody": "These were incredibly moist. I will definitely be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lmc"
},
"reviewBody": "Excellent! made 12 muffins and a small loaf. The loaf took forever to cook...almost 65 min. Got a little more brown than I like and haven't cut into it yet to see if it is done. Might stick to muffins next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "These are the absolute best muffins! I accidentally added a wee bit more vegetable oil but they came out so moist &amp; delicious! Took some to work and everyone loved them, not to mention how well they went over at home! Will definitely make these time &amp; time again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharlyn"
},
"reviewBody": "These were fantastic! I made some cream cheese frosting so they could be \"cupcakes\" for a party. They didn't last long, this one's a keeper! I only had white flour available, so that's what I used, but next time I will try the half wheat flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marg Reynaert"
},
"reviewBody": "This was fantastic. The only thing I did different was I put a cream cheese frosting on each"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cricket"
},
"reviewBody": "I used all whole wheat pastry flour because that is what I had. Also used 1c white and 1c brown sugar, even with that they were a bit sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Anderson"
},
"reviewBody": "I substituted a bean flour gluten free baking mix for the all-purpose and whole wheat flours and the muffins still turned out moist and held together well. With the cream cheese frosting, they are similar to carrot cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shellmichaud"
},
"reviewBody": "My tweaked version gets 5 stars.....Can't give 5 stars to original because I changed it up. I used 2 cups whole wheat Pastry flour, 1 cup all purpose flour, used real canned pumpkin so I upped the spices; cut Down the sugar to 1 cup firmly packed brown sugar and 1/2 cup white sugar, used apple sauce instead of oil, added 1 tsp vanilla extract, used milk in place of water, folded in 1/2 cup dry oatmeal and pecan pieces. **SIFT your dry ingredients, except brown sugar. Don't over mix batter- that causes chewiness/dense. Simple lemon icing drizzle was best (better than streusel I tried on part of batch)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandi Mora"
},
"reviewBody": "These came out perfect. Really moist and very flavorful. Definitely making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriT"
},
"reviewBody": "Very moist. Made about 30 regular sized muffins. Reduced the sugar to 1 cup white and 1 cup brown and threw in handful of golden raisins. Not a big fan of the amount of ginger in pumpkin pie spice, so I used 3 tsp cinnamon, 1 tsp nutmeg 1/2 tsp cloves and 1/2 tsp nutmeg. This would be good with walnuts or pecans, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly J. Robinson"
},
"reviewBody": "wouldn't change a thing -- AND I ALMOST ALWAYS DO! \nsuper-moist, flavorful, easy and simply divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miami89"
},
"reviewBody": "This recipe srvived the changes I made to it--I decreased the sugar to one c. white, 1/2 c. brwn and 1/2 c. liquid stevia. The liquid stevia makes it slightly gluey and I won't use it again. However, they were wonderfully tasty anyway and perfectly flavored. Next time I will skip the stevia and use a whole cup of brown sugar--I don't think it needs 3 cups of sugar--two is plenty. Edit: I've made these several times since and they are always well received. The last time I cut the recipe in half and used all whole wheat pastry flour. Just as tasty and stll made 12 good sized muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toops"
},
"reviewBody": "I saw this recipe and just had to try it. I followed directions. I used canned Pumpkin instead of the Pumpkin Mix as called for. I thought three cups of sugar was too much but not so. They are rich, moist, and have a somewhat chewy texture. I used seven teaspoons of ground spices, 3 cinnamon, 2 ginger, 1 cloves, and 1 allspice. I also added 1/2 tsp. of freshly ground nutmeg. The batter is generous. I made 28 medium cupcakes and baked at 350f for 25 minutes. I suggest reading the comments shared by other bakers. I will make a few small changes next time but nothing major. Cream Cheese frosting is a must. A sprinkle of course orange colored sugar makes a beautiful presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vivian"
},
"reviewBody": "After following the instructions precisely the mixture was way too thin. I cooked the first 12 muffins for 45 minutes and they were still sticky. I added about 1 additional cup of flour and cooked the second tray 45 minutes and they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jan Costea"
},
"reviewBody": "Instead of using pumpkin pie filling I used a 29 oz. can of plain pumpkin. I also cut the amount of sugar in half as 3 cups just sounded way too sweet! They turned out delicious! I also made up my own pumpkin pie spice blend; 3-1/2 tsp cinnamon, 1/2 tsp clove, 1 tsp ginger. Might make some cream cheese frosting when they cool!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nestor"
},
"reviewBody": "I made these ... followed the recipe but had to make my own pumpkin pie spice and ran out of white sugar so last cup was brown sugar. They were delicious ... I certainly would use these as a dessert but a little to sweet for breakfast!\nEasy to make and makes 24 muffins ... even better. some to freeze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Crow Trail"
},
"reviewBody": "Excellent recipe! Thank you for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Merryfield"
},
"reviewBody": "I've been making this for years. It is a great recipe. Kids like it too!\nYou can add raisins or nuts. I have even used bananas and added pineapple. \nFreezes well too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "melanie"
},
"reviewBody": "These Look Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dkhowellmo"
},
"reviewBody": "Wow! These are so yummy!!! And it made more than 24 muffins! Moist and just the right density. Next time I might add just a touch more pumpkin pie spice but it's pretty awesome as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momo3525"
},
"reviewBody": "Very good! I only had 2 eggs in the house, so I cut the recipe in half and followed recipe with the exception of using 3 teaspoons (or 1 T, just quicker to measure) of pumpkin pie spice rather than the 2 1/2 called for by the halved recipe. My yield was 12 muffins, perfect after 21 minutes at 350.\n\nThe recipe is upped to 5 stars if you add a simple streusel topping, which I did the second time. ( 4T cold butter, 1/2 C flour, 1/4 cup packed brown sugar, and 3/4 t cinnamon)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derek Niehaus"
},
"reviewBody": "These muffins are amazing! Definitely a keeper recipe! They are super moist and have a great pumpkin pie/pumpkin bread flavor. I made one minor alteration, I bought a cheaper, larger container of pumpkin pie spice at Rural King so I added 1 tbsp instead of 5 tsp (1 additional tsp) because I figured the quality would be slightly less than the expensive name brand. Other than that, no changes needed! It's perfect as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannen Wright"
},
"reviewBody": "Amazing! So moist and delicious! I changed a couple things in recipe: Used milk instead of water, added a teaspoon of vanilla, 2 cups sugar and 1 cup brown sugar, and just used all purpose flour. Baked at 350 for about 40 minutes (gas stove) and they came out perfect!! Def a new fall favorite and already have requests in for more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marinewifemomoffour"
},
"reviewBody": "We've made these many, many times since we discovered the recipe. Without a doubt, the best pumpkin muffins/bread recipe (except maybe the Downeast Maine pumpkin bread). We add a 1/2 cup of oats when we make the muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Berkley Sobey"
},
"reviewBody": "I just posted a review that I can't get back to fix. I just realized that I only used one can of 15 oz. pumpkin pie filling instead of the 30 oz. can that the recipe called for. I also didn't add the half cup of water. So it was probably too sweet because of that error and that omission. I will try it again the correct way!! Still a great muffin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Monika Lunan"
},
"reviewBody": "Unfortunately, these muffins completely stuck to the paper muffin cups.. Not enough oil I think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fudge Fanatic"
},
"reviewBody": "Great base recipe but as always, I made a few changes. I used 2 cups whole wheat flour, 1/2 cup wheat bran and 1/2 cup white flour. I put an extra heaping tsp of pumpkin spice (my own mix), reduced the sugar to 2 scant cups of brown sugar (still plenty sweet), subbed Greek yogurt for most of the oil and reduced the salt to just 1tsp. They're perfect with a nice, dense texture!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Martin"
},
"reviewBody": "Loved this recipe! I used half white sugar and half brown sugar. All I had was olive oil but it turned out fine. I didn't have wheat flour so I used unbleached. I might cut out some of the sugar and water next time since they were really sweet and moist. I wonder how it would taste with gluten free flour....Would be yummy with some sort of a cream cheese frosting if you feel like adding extra calories:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MerryChris"
},
"reviewBody": "I have never made cupcakes before! These came out great, super moist. I used pumpkin purée and added an extra tsp pumpkin spice. Wonderful, and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Arabella"
},
"reviewBody": "These muffins were yummy, though they could use less sugar. We made them for breakfast on Sunday, and they were a hit! They taste a lot like pumpkin bread, and are even better on the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Lee"
},
"reviewBody": "The only thing I might do next time is add nuts, yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "These were terrific! I have made them three times in the last 6 weeks. The first two times my grocery store did not have pumpkin pie filling so I added 1/2 cup more sugar and two additional teaspoons of pumpkin pie spice. The first time I did not have enough sugar so I used half brown and half white. The last time I made this recipe as written. All three times they were excellent! But I think I liked the 1/2 white and 1/2 brown sugar batch the best. These were incredibly moist and the most moist were the original recipe. I also tried dipping the tops in sugar after they cooled a bit. Wow, that gave it another way to serve it that was spectacular! I have also iced these with store bought cream cheese canned icing to make them more dessert like. Those were also good. This is so versatile and can be presented in many ways! The batter taste so good and yes I know you are not suppose to eat batter with raw egg in it but I could not help myself! This recipe made 30 cupcakes each time. Thank you so much for sharing it. I think I may try and bake it in a 13x9\"pan and see how it comes out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brookeroni"
},
"reviewBody": "these muffins were ok but not anything special. super sticky and way too spiced. it was like overkill. definitely reduce the amount of pumpkin pie spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wildflower"
},
"reviewBody": "1/2c white and 1/2c brown sugar. I didn't use pumpkin pie mix seasoning, instead I used cinnamon, cloves, and all spice to make my own. turned out yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snowfairie77"
},
"reviewBody": "At my preschool, we do a \"feast\" every year. The kids aren't too keen on pumpkin pie, and the muffins I made last year were just plain muffins...I found this recipe this year and I am in love! These were the perfect cross between muffins and pumpkin pie! Moist and delicious and a big hit! I made a double batch and made them mini size. We put home made cream cheese frosting and orange sugar sprinkles on them for a festive touch. I will be making them again next year. Also, my 14 month old just loved them plain for breakfast...never seen her cram a muffin in her mouth like that ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "durshi"
},
"reviewBody": "I accidentally used canned pumpkin purée instead of pumpkin pie filling (didn't realize until they were in the oven) but they still turned out great! I would have liked a bit more pumpkin spice but that was my own fault because I used the purée instead of the pie filling. I did need to bake for about 36 minutes instead of the listed 30 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ Marx"
},
"reviewBody": "These turned out really nicely. I had leftover sweet potatoes that had been whipped with orange juice and used them in place of to pumpkin. I also added some grated orange zest and the flavor is wonderful. It did take almost twice as long to bake as the recipe said but I am attributing that to the switch from pumpkin to sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amcolli"
},
"reviewBody": "Delicious! My favorite pumpkin muffin recipe. They came out really moist. I didn't change a thing on the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie Catani"
},
"reviewBody": "I added vanilla extract, 1 cup of oatmeal, used milk instead of water, used brown sugar instead of white &amp; cut the sugar by a third. My husband couldn't get enough of them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebeccaSLC"
},
"reviewBody": "This recipe was perfect, and perfectly easy. Living at high altitude, I never know if I'll have trouble with baked goods. This worked like a charm. No alterations necessary. Cooked beautifully in exactly the time suggested. I used half for muffins and put half in a 9\" round pan--that required about 45 minutes cook time. The flavor is pumpkiny and spicy, but not too much of either. I didn't find them too sweet. They are substantial but not dense. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nap2"
},
"reviewBody": "I made half the recipe, reducing the sugar to 1 cup of brown sugar, and did not add the water. The half recipe made 24 mini muffins that I baked for 25 minutes. They puffed up high and were moist and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "These muffins are so moist and flavorful! I had regular pumpkin puree not the pumpkin pie filling and only used all-purpose flour, but did not make any changes to amounts and they turned out wonderfully. Since my muffin pans are dark teflon coated, I turned my oven down to 300 degrees and cooked an extra 5 minutes. Too bad I have to give these away (although fortunate enough that I had enough extra batter to make 6 additional by filling the wrappers 2/3 full )"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/234646/pumpkin-pie-muffins/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
"name": "Pumpkin Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/234646/pumpkin-pie-muffins/",
"name": "Pumpkin Pie Muffins"
}
}
]
}
}
, "about": [
]
}
]