				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpkin Oatmeal Chocolate Chip Cookies"
,"datePublished": "2020-06-18T23:51:04.000-04:00"
,"dateModified": "2020-06-18T23:51:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ken Sherer"
,"url": "https://www.allrecipes.com/cook/529185"
}
]
,"description": "Pumpkin puree brings a colorful dimension to these tasty, chocolate chip oatmeal cookies."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Avjheh6YXqEuaYpaTZbFCuyR2Fc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4104427-69e269a5a9c24c04b28539234c082218.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpkin Oatmeal Chocolate Chip Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "199"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "128 kcal"
,"carbohydrateContent": "19 g"
,"cholesterolContent": "13 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "119 mg"
,"sugarContent": "12 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups butter, softened",
"2 cups packed brown sugar",
"1 cup white sugar",
"1 (15 ounce) can pumpkin puree",
"1 egg",
"1 teaspoon vanilla extract",
"4 cups all-purpose flour",
"2 cups quick-cooking oats",
"2 teaspoons ground cinnamon",
"2 teaspoons baking soda",
"1 teaspoon baking powder",
"1 teaspoon salt",
"2 cups miniature chocolate chips" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Beat butter, brown sugar, and white sugar together in a bowl until creamy. Add pumpkin, egg, and vanilla extract; beat until smooth."
} ,{
"@type": "HowToStep"
,"text": "Mix flour, oats, cinnamon, baking soda, baking powder, and salt in a separate bowl; stir into creamed butter until combined. Fold chocolate chips into batter. Drop 1 to 2 tablespoons batter for each cookie onto a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the edges of each cookie are lightly browned, 10 to 12 minutes."
} ]
,"recipeYield": ["72"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I just made these, wonderful! I added white and dark chocolate chips, then chopped pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Holder"
},
"reviewBody": "These are wonderful, and chef approved. Made these on Easter, my daughter took some to an Easter dinner party, they were a huge hit! One of the guests at the party was a chef. He said they were absolutely wonderful they stay soft and chewy. The only difference is I added pumpkin spice latte morsels instead of chocolate chips. This is a favorite among many!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "darth_bubbles"
},
"reviewBody": "I hate to rate recipes that I didn't follow exactly, but looking at this I could tell that 3 cups of sugar would be way too much. Also, I needed these to be egg free so didn't add the egg. I swapped one half cup butter for 4 oz applesauce to make it slightly healthier. Lastly, I mega increased the spices, about 1 tbsp cinnamon and 2 tsp of pumpkin pie spice. These taste well seasoned, as is they would have been bland. With my changes I will be making this often, with such a large batch I froze half of the dough balls. I like using a whole can of pumpkin, these seem like they are adaptable for changing the chocolate chips, different spices, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Marie"
},
"reviewBody": "Beautiful cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanna Darley Benson"
},
"reviewBody": "The best pumpkin cookies I have ever made!!\nI only changed a few things. I added a cup of pecans and 2 teaspoons of pumpkin spice. Everyone gobbled these up so fast!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perrywinkle"
},
"reviewBody": "This recipe yielded about 3 dozen very large, delicious, satisfying cookies. Amazing recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "These were quite tasty, and they even worked with gluten-free flour. I would’ve added more spices, perhaps additional cinnamon plus allspice, cloves and nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Jenkins"
},
"reviewBody": "Next time, I'll add 1 cup of chopped walnuts. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristina Becvar"
},
"reviewBody": "I really liked the texture. I made two batches, and after tasting the first I added more spice (cloves, allspice, and nutmeg) and I liked that extra flavor more. Overall a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Whitney Carson"
},
"reviewBody": "I halved this recipe because I had half a can of pumpkin pie filling I needed to use up, but it still made a lot of cookies. My boyfriend is a pumpkin spice fanatic and nothing I bake lasts very long at all so I expected the same from these. Although he SAID he liked them he also mentioned he may take some to work \"so he didn't eat them all\"-which he has never done before, so I suspect he isn't a huge fan. I found the consistency to be very \"breadlike\" and although it isn't awful it is pretty disappointing for a cookie. I used butterscotch chips because I thought it would compliment the flavors more and they are the best part of these (I almost always reduce choc chips in cookie recipes but definitely regret doing so with this recipe). Very likely will never make these again-with all the great oatmeal cookie recipes out there these are a bit of a bust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda J. Clifford"
},
"reviewBody": "This recipe was easy to put together and the flavor was delicious. The dough was sticky but it is pumpkin and it should be super moist. Waiting for them to bake is the worst"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pointe4Jesus"
},
"reviewBody": "Just make sure to mix the flour mixture in really well. Apparently I didn't, so the cookies from the bottom of the bowl had a lot less definition and spread a lot more. They're still yummy, just not quite the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FOOD123"
},
"reviewBody": "It Really Tasty! I would give it 6 star"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lawrence Bellmore"
},
"reviewBody": "Used fresh cooked pumpkin instead of canned, amazing recipe, will be using it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fedana"
},
"reviewBody": "Love it! Taking them to work for a birthday potluck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Scott Williams"
},
"reviewBody": "The cookies tasted biscuity. I would put less flour, and abit more shortening with the butter next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "Made it just as written. I think it was a little too much flour, I'd decrease it by a half a cup if I made it again. It was good for\npumpkin cookies, I'm not a big fan but my kids are and I made them for them. They did say they weren't like regular pumpkin chocolate chip cookies and they would rather have those. I liked these better, personally, they have less of a cake-like texture more like cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitzi"
},
"reviewBody": "Followed recipe with scant sugar amounts and plenty sweet. Recommend blotting pumpkin in a paper towel lined sieve...you’ll be amazed how much liquid drains off even the most solid pumpkin otherwise I imagine the dough would have been much too wet. Perfect amount of pumpkin flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lasmith0127"
},
"reviewBody": "These cookies are so delicious! A favorite of picky eaters, those that love a flavor burst, and even the simple flavor savors. Cook them a little less and they are move gooey with a little extra pumpkin punch, my personal favorite, cook them a little more and you get a fluffy picturesque cookie. The recipe is great for non extract measurements, a little of this and that and it still comes out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Lechleiter"
},
"reviewBody": "Great recipe, I cooked these for 25 mins in a jelly roll pan. Turned out perfectly. I also put my own spin on this. Still did 2 cups of filling, but used semi-sweet, and white chocolate chips, craisins and pecans. I'm calling them Thanksgiving bar cookies. And Everyone is loving them. Made them again for my kid's Thanksgiving party this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marxer"
},
"reviewBody": "I used dark coconut sugar instead of brown sugar and powdered sugar instead of granulated white sugar. Apparently, it doesn't matter, as long as it is sugar! I would definitely make it again. The cookies were a big hit at the office!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1 Nephi 8"
},
"reviewBody": "it was pretty good. My missionary companion and I made them for people we are teaching and awesome people in our ward who needed a treat. Our bishop told us to never make them again because they were so good. And our favorite homeless lady gave us the compliment of we will be amazing wives one day. They were just that good.\nI would highly suggest making dozens, because as our bishop stated: you can't have just one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari Kern"
},
"reviewBody": "I will definitely make these again. They were delicious. My 18 year old son even loved them (and he's not a huge fan of pumpkin) - Everyone I shared them with, loved how soft and chewy they were - SO good! Thank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Biker Chick"
},
"reviewBody": "Awesome flavor and these do spread out a bit so leave some room between them. I used a small ice am scoop and placed them 4 across and 3 down, baked for 30 minutes. I also used 1 cup chocolate chips, 1/2 cup crushed walnuts and about 1/2 cup of yellow raisins. They are cake like cookies and are fine alone but some frosting would have made them more awesome! Definitely try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene Schalper"
},
"reviewBody": "perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sewsugarqueen"
},
"reviewBody": "The spice lacking for pumpkin...needs some nutmeg ginger and double cinnamon. As per recipe it was moist but really lacking the pumpkin pie flavour. will tweek it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "I make jack o lantern cookies and couldn’t find my usual recipe so I cooked up a batch. Found them to be a little too cake like for my use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "I think this is a keeper!! My only suggestion would be to add more salt and spice as it needed a little more flavor. But otherwise this was great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bzmom"
},
"reviewBody": "Perfectly perfect. Baked beautifully, taste great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jello Vonnie"
},
"reviewBody": "I made three changes: I used Kosher salt. Not regular salt. I did not use mini chocolate chips. This is a robust cookie, and I used a more robust and larger chocolate chip. I used the Ghirardelli chocolate Premium Baking Chips \"Grand Chips\" semi-sweet chocolate chips. The chips are double the size of regular chocolate chips. \nThe other change I made was using Crisco shortening instead of butter. I used the standard exchange guidance printed on the can. ! 1/2 cups butter = ! 1/2 cups shortening plus 3 tablespoons of water. The chocolate chips gave melty chocolate flavor and positive distance from the indifferent quick cook oats and all that pumpkin. I used a two tablespoon scoop and I did not oil the cookie sheet The cookies came up fine from the hot cookie sheet onto a cooling rack. Next time I will use Kerrygold salted butter to see if that unifies and elevates this interesting cookie. and I will leave out the cinnamon or reduce the teaspoon to 1/2 teaspoon. The cinnamon needs to be \"quieter\" in this cookie to let the total flavors come together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TBal"
},
"reviewBody": "Easy recipe for a very tasty cookie. Don't make any changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine Ramsay"
},
"reviewBody": "Delicious cookie was moist but made a little too much batter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Vachon"
},
"reviewBody": "Great recipe! I made a few substitutions to make these a little bit healthier without sacrificing the taste:\n-replaced 2 cups of flour with Kodiak cakes mix. I divided the baking soda and baking powder in half, since Kodiak cakes already contain leavening\n-replaced 1/2 cup of the butter with 1/4 plain nonfat Greek yogurt. You probably could replace a bit more.\n-Cut the brown sugar to 1.5 cups and the white sugar to somewhere around 3/4 cups. Again, probably could reduce a little bit more, but not much less.\n\nThis made 7 dozen reasonably sized cookies for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephenie Castranelli"
},
"reviewBody": "YUM. YUM. YUMMY! Wonderful cake like texture. I added a 1/4 teaspoon of each of the following; ginger, ground cloves, nutmeg and allspice. Regular sized chocolate chip were used in the mix They baked for 13 minutes in electric oven at 375. Then cooled for 2 minutes on baking sheet before moving to a cooling rack. House smelled amazing and the cookies did not disappoint."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ash Pie"
},
"reviewBody": "These are my favorite cookies of all time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley H 121"
},
"reviewBody": "These are delicious. Made these for a Halloween party, and I could not stop eating them before we went! I had to bake a couple minutes longer, but they are chewy and perfectly cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Cat"
},
"reviewBody": "love these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "My family lloved them! I slightly changed it to: 1c butter, 3/4 c sugar, 1 1/2 c brown sugar &amp; 2 eggs. Would add a little more cinnamon or pumpkin spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neens807"
},
"reviewBody": "Great recipe for moist cakey cookies! I added a teaspoon of nutmeg for that extra autumn, pumpkin spice flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Budge Sotto"
},
"reviewBody": "I LOVE this recipe. I have been using it for years and honestly I don't think I have made any other type of cookie since! I love the heartier texture of these cookies over the typical cakey pumpkin chocolate chip cookies. It also tastes great using whole wheat flour, and I sometimes like to add some shredded coconut as well. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monster_meghan"
},
"reviewBody": "Great recipe! No changes were needed. The house smelled amazing while they were baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ola olszewski"
},
"reviewBody": "Added cloves, nutmeg, ginger, and all spice for more flavour. The texture was not good.. more like a muffin top as opposed to a cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Elle Davis"
},
"reviewBody": "No changes to recipe except I added ground cloves, it's super and makes a ton of cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrianne Jayne Young"
},
"reviewBody": "I made these cookies and loved the final product! I was looking for something with less butter and sugar and a little more wholesome, so these are the changes I made: 1) substituted 1/2 of the flour with wheat flour 2) used a mashed ripe banana in place of 1/2 cup of the butter 3) added a couple of extra teaspoons of cinnamon and added pumpkin pie spice 4) added walnuts and 5) did NOT add the white sugar. Overall, the texture was great, and these were a yummy and almost guilt-free snack for me and my kiddos. We keep them in the freezer and microwave for 30 seconds to make them warm. Plenty sweet and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ker"
},
"reviewBody": "Super easy to make! These are delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phil Strickland"
},
"reviewBody": "Delicious cookies! I love that they are moist and that they arn't cakey at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "argchild"
},
"reviewBody": "Will make it again. Subbed out 1/2 cup of the flour with 3/8 c of ground flax seed and 2T of gluten. Used ground nutmeg in place of pumpkin pie spice. Added in 2 T of whole pumpkin seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momof3"
},
"reviewBody": "Great flavor! I still found them \"cakey\" compared to other cookies, but the flavor was a hit. I took one reviewers advise and cut out the white sugar and changed one cup of white flour to wheat flour. My family loved them. The second time I made them, I added 1/2 cup flax meal, another egg, another 1/2 tsp baking powder, 1/2 tsp cloves, 1/2 tsp nutmeg, 1/4 tsp ginger and made them into muffins. Yum! This is a really versatile recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janeErn"
},
"reviewBody": "Very moist cookie. Made with white chips instead of chocolate. Would make them again but with more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherre Kimmel-Price"
},
"reviewBody": "This recipe makes a lot of cookies! \nI like spices so I doubled the amount. \nThese were a big hit. I made a couple of batches last year and they're on the list for this year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grammadeb"
},
"reviewBody": "Loved these cookies. Very light and soft. I swapped the vanilla extract and chocolate chips for raisins and maple extract, they were a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jtfids"
},
"reviewBody": "I used cooked pumpkin instead of a can. Very good and tasty. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol T"
},
"reviewBody": "Will definitely use this recipe again! Was looking for a cookie combining oatmeal and pumpkin and this is great. Omitted the chocolate but will try adding it another time. Like some other reviewers I wanted to add pumpkin pie spice but since I didn't have any I kept cinnamon as is and added 1/4 teaspoon each of ginger, allspice &amp; nutmeg. Would have also added cloves but didn't have any. Toasted the oatmeal because we like the nuttiness that adds. Many requests to add this recipe to the repeat list, definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat"
},
"reviewBody": "We love to make these cookies every Autumn! They are now a tradition for our family. Adding the oatmeal makes this recipe the best / better recipe than the others because the cookies are more firm - less cake like sticky. And it also makes 70 - 80 cookies depending on your size. We sometimes freeze the extras and save them for Halloween, Thanksgiving, or Christmas. Enjoy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenifer Good"
},
"reviewBody": "Great fall cookies! I added another egg &amp; swapped out chocolate chips for craisins. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snowgirl181"
},
"reviewBody": "I made a few substitutions: I used 2 cups white flour, 2 cups whole wheat flour, increased vanilla to 2 tsp , added an extra 1/2 cup of oats and added 2 teaspoons pumpkin pie spice. I also used white chocolate chips and toasted pecans. They are a perfect Autumn cookie. I took them to a tailgate and everyone raved about them and asked, \"who made those cookies? They are amazing!\" I will definitely make these again as this recipe replaced my other pumpkin cookie recipe which made a more cake-like and sticky cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Torsky"
},
"reviewBody": "Everybody, young &amp; old, loved them! One half the recipe made quite a few cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef pasgetti"
},
"reviewBody": "I would recommend cooking it for 16 minutes and greasing the cookie sheet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChickenWing"
},
"reviewBody": "Super yummy! Next time I will add pumpkin pie spice and walnuts for a more festive f"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Jordan"
},
"reviewBody": "This is the first pumpkin cookie I've ever liked. I used full size chocolate chips, and I cooked them longer 15-16 minutes, though some I forgot and left I around 20 were good in a slightly carmalized crunchy way. It has to be the oatmeal that is making the difference. Excellent texture, and easily switched for butter chocolate chip cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Welch"
},
"reviewBody": "Fantastic cookie that is soft and a little \"bready\", which I really like. I have a 4 year old gluten sensitive child and just substituted the white flour with a gluten-free mix. Usually this results in a grainy/gritty texture that I don't much care for. (Baking gluten-free is a real struggle especially when I can almost always tell the difference and don't like it). In this case, thanks to the pumpkin it comes across just fine. Will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keeli"
},
"reviewBody": "I'm something of a pumpkin freak so I've eaten and made a LOT of pumpkin cookies, but these were by far the best. Just enough oatmeal for texture without becoming an oatmeal cookie. I did increase the amount of spice, but that just personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Stover Camaret"
},
"reviewBody": "I added a little bit more spice to my taste buds liking and we thought these were moist filling cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trishak"
},
"reviewBody": "I added more spice, used old fashioned oats, and regular chocolate chips rather than mini. I got rave reviews at the church bake sale and was asked to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PLR"
},
"reviewBody": "These are great! Used half whole wheat flour, 1/2 cup each butter, coconut oil and applesauce. Used regular chocolate chips because I didn't have the minis. Not as cakey as other pumpkin cookies- would like to cut back on the baking powder to see if that makes them less puffy... will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "super yummy . cut out one cup of chocolate chips. Still thought there was plenty of chocolate for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauriegb"
},
"reviewBody": "To quote my son, \"these are unreal.\" I used half butter and half shortening and added a cup of raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Dunn"
},
"reviewBody": "oh so good! We like crunchy cookies at our house. I baked for the max time and there was just the slightest crunch on the outside. Only change was adding 1 tsp pumpkin spice in addition to the 2 tsp cinnamon. Next time I'll add more oats. thank you for this recipe. Marked as a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MiSSjHO"
},
"reviewBody": "Incredible cookies!!! I made these tonight, and followed the recipe to a T—no substitutions. I used a cookie scoop so they were all uniform in size. They fluffed up so nicely and almost had the consistency of muffin tops. Definitely will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eliza"
},
"reviewBody": "Fabulous flavor (I used my own pumpkin pie spice). I halved the recipes and used 1/2 c. coconut oil (solidified) and 1/4 c. butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kruglyk"
},
"reviewBody": "Very yummy. Like others, I used butter alternates (butter, coconut oil, and apple sauce), halved both sugars, and added extra oats. Even my husband enjoyed them, and he is not very into desserts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melee1959"
},
"reviewBody": "Delicious cookies! I did make a few changes but only to the final addition. I am not a fan of chocolate chips in pumpkin cookies so I substituted craisins. I also added walnuts. But the basic recipe is wonderful. Makes a large batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda King"
},
"reviewBody": "Just made these and they are delicious! I subbed coconut oil for the butter just because I had some that needed to be used. I bet you could leave out the chocolate chips and add dried cranberries and chopped nuts and that would be great too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Durant Ellis"
},
"reviewBody": "My husband just loves these pumpkin oatmeal cookies, he took some to work and a co-worker said theses cookies were the best he ever tasted. \nBecky Abbot, Me 2016"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheesecake Lady"
},
"reviewBody": "The whole family loved these. They were so good that my grandson asked if I bought these at the store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivi"
},
"reviewBody": "This became a family favorite instantly! If you like cake-y cookies, this is for you. I'm only beginning to learn how to bake, and this recipe was really easy to perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan F"
},
"reviewBody": "I didn't have quick-cooking oats so I used 1 cup of old fashioned oats. Very moist and great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AuntyMFromKansas"
},
"reviewBody": "Tastes wonderful! Not too sweet and a hint of pumpkin. I shall make these again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "These were just okay. I was surprised by the number of really great reviews. I followed a lot of the other reviewers' suggestions for increasing the oats and chocolate chips and decreasing the sugar. I even increased the pumpkin amount to give more pumpkin flavor, but overall, the cookie didn't taste that great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah White Bryant"
},
"reviewBody": "I've made this many times and LOVE LOVE LOVE these cookies and so does whoever I choose to share them with :)They are so moist and delicious. The only change I make is that I use Hershey's Cinnamon Chips instead of chocolate chips. Also, I sometimes add some ground flax seed. I usually cook a little longer than the 10-12 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angelica"
},
"reviewBody": "The first time I made them, they needed more time, they were way undercooked. So the second time I made them, I added 1/3 cup more oats and increased the time to 15 or so minutes. They come out soft inside with a slight crisp on the outside. For more flavor, try using pumpkin pie spice, the nutmeg added a little something extra. I always put a little extra spice in there. Also, I used a cookie scoop to get them in just the right size and shape. Try them with dark chocolate morsels or butterscotch chips, both excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hellmuther"
},
"reviewBody": "These have become a family favorite, especially around the holidays. I usually make a double-batch (roughly 15 dozen) and friends and family members snap them up within a day of me posting pictures of them cooling. My wife will take 5 dozen to her work and they are gone by the afternoon! Cream the butter and sugars properly and you'll have thick, but light, cookies that everyone will love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ken"
},
"reviewBody": "We did not care for these cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fluffjackie"
},
"reviewBody": "I made these as I needed to find a way to use up about a cup of steamed butternut squash as I had that leftover from making winter squash rolls. Like others, I halved the recipe as it makes a HUGE batch. We still ended up with over 4 dozen small-medium cookies. So, I used butternut squash instead of pumpkin, coconut oil for 2/3 of the butter, egg white only for the egg and regular size dark chocolate chunks. I omitted the spices except the cinnamon. My 8 year old daughter pronounced them - SOOO good. I didn't tell her they were made with squash. They really are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilynn Switzer"
},
"reviewBody": "These cookies were easy and taste great! Making them for a bazaar, this recipe made 90 cookies! I know several people who will have tasty treats this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Hohn"
},
"reviewBody": "Bomb cookies! I used Crisco butter sticks because it keeps the cookie shape, and well it's a cookie-might as well calorie commit! Dark chocolate regular chips and some pumpkin pie spice with extra cinnamon made these killer. MAKE THESE PEOPLE, life's too short."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eula Cook"
},
"reviewBody": "The first time I made them. I followed recipie, except I deleted 1 cup of brown sugar and added walnuts. Soooo addicting. It's a good thing I gave away 3dozen. Lol the second time I made these. T halved the recipie. Still using one egg . I upped the oats by half, used Apple butter instead of pumpkin, raisins instead of chips and walnuts. That's how versital this recipie is yum yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingwolf"
},
"reviewBody": "Perfect on this snowy day! I love the texture of the added oatmeal. A soft cookie with a chewiness to it. I used one teaspoon of pumpkin pie spice instead of the 2 teaspoons of cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seashelo"
},
"reviewBody": "These turned out awesome! I only made a few changes, because I ran out of stuff. I used 2 cups all purpose flour and 2 cups whole wheat flour. I decreased brown sugar to 1/2 cup (that's all I had on hand), but left white sugar at 1 cup (they were perfect...so no need for all the sugar, so I would definitely make them like this again. I also used homemade pumpkin puree, from our Halloween pumpkins. I also used both white chocolate chips and milk chocolate chips (again, all I had). They turn out DELISH!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LPR"
},
"reviewBody": "Cookies are delicious. I halved the recipe, substituted the chocolate chips with craisins and added 1 cup of chopped pecans. Beware! It is Difficult to stop eating them, but they are healthy, right? So dig in. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SNOWPRINCESS7284"
},
"reviewBody": "Followed recipe exactly. It lacked flavor. It didn't really taste like pumpkin--surprisingly. But I loved the texture, and they baked up great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugar Momster"
},
"reviewBody": "Om Nom Nom!!! I add 1/4 Tsp pumpkin pie spice and I use Hersheys cinnamon flavored chocolate chips for one heck of an addictive cookie! You'll love it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni Lenz"
},
"reviewBody": "I took the advice for other raters and I added 1 1/2 tsp of pumpkin pie spice. I used 1/2 cup of applesauce for 1/2 cup of the butter. I definitely would make the recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoannZ"
},
"reviewBody": "I love the traditional cake-like pumpkin cookies but wanted a recipe that was sturdier so I could mail them. These are it -- still fluffy but not so moist as the others. Kind of a cross between the traditional pumpkin cookie and a chewy choc chip cookie. The oatmeal almost disappears. I added more spices and used a whole bag of white choc chips. I flattened them with a wet butter knife and sprinkled them with orange sugar. I got 4+ dozen with half the recipe using a melon ball-type cookie scoop. They could be great bake-sale cookies if made extra large! Wonderful results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeKathy"
},
"reviewBody": "These were wonderful! Nice and chewy with the oatmeal (and all I had was old fashioned and not quick cooking and it worked fine) and seemed almost healthy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brittakay82"
},
"reviewBody": "I am not crazy about pumpkin, so I am a tough critic! :) I thought they were ok, they were light and not too heavy.\nRecipe rendered a ton of cookie dough and by the end of making it there was too much for the mixer to handle and I had to use a wooden spoon to get it all combined. I added salt bc I always like a little contrast to the sweet. All in all, pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Irish DiDio"
},
"reviewBody": "This recipe is delicious. But if you make it, cut all measurements in half. This makes enough cookies to feed an army. Bring some to a homeless shelter or soup kitchen or something. Also, use more oats. It definitely does not call for enough to call them oatmeal cookies. Walnuts and raisins make them better. And for more flavor, use pumpkin pie spice instead of cinnamon and a bit more vanilla extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Savage"
},
"reviewBody": "These were some of the best cookies I've ever made! They were *exactly* what I was looking for - a chewy oatmeal cookie with pumpkin and chocolate flavors. Next time, I might add some chopped walnuts or pecans. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Christmas"
},
"reviewBody": "Used a little more than 15 oz pumpkin puree (about 17 oz). Used margarine instead of butter... delicious!!! Cake-like texture; baking time was perfect at 12 minutes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228740/pumpkin-oatmeal-chocolate-chip-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/968/desserts/cookies/pumpkin-cookies/",
"name": "Pumpkin Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228740/pumpkin-oatmeal-chocolate-chip-cookies/",
"name": "Pumpkin Oatmeal Chocolate Chip Cookies"
}
}
]
}
}
, "about": [
]
}
]