				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpkin Custard Pie"
,"datePublished": "1999-11-17T08:54:27.000-05:00"
,"dateModified": "2022-10-04T17:30:56.000-04:00"
,"author": [
{"@type": "Person"
,"name": "SARALAUGHS52"
,"url": "https://www.allrecipes.com/cook/61623"
}
]
,"description": "This delicious pumpkin custard pie pairs a hot custard filling with a cold, unbaked pie crust, resulting in a perfectly textured dessert everyone will love!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/a559Dfuj_LoCCrHcG9qUInE7S8s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4576866-pumpkin-custard-pie-Sarah-Kennedy-4x3-1-3c92d7ed418e49d99a4b0954282c058e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpkin Custard Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "69"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "326 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "89 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "298 mg"
,"sugarContent": "20 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.75 cups pumpkin puree",
"0.75 cup white sugar",
"1 teaspoon ground cinnamon",
"0.5 teaspoon ground ginger",
"0.5 teaspoon salt",
"1 cup heavy whipping cream",
"0.5 cup milk",
"2 large eggs, beaten",
"1 (9 inch) frozen unbaked pie crust, thawed in the refrigerator, but still cold" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place pumpkin puree in a saucepan over medium-high heat; cook and stir until slightly dry and caramelized, 10 to 20 minutes. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Stir sugar, cinnamon, ginger, and salt into the caramelized pumpkin until well combined. Mix in cream, milk, and eggs until smooth. Pour into the cold pie crust."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until crust is golden brown and filling is mostly set except for a small spot in the center that jiggles when the pie is shaken slightly, 25 to 55 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven and allow to cool completely on wire rack before cutting."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GYPSY_DANCER"
},
"reviewBody": "I used the Pillsbury deep dish 9 inch, net weight 12 Oz pre-made crust. Prebaked according to package. There was about 3/4 cup of filling leftover. I baked the pie for 45 minutes with an internal temperature of 200 degrees F. I added a tiny bit of ground nutmeg and clove. It was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suebee"
},
"reviewBody": "The best pumpkin pie I and my mahjong group have ever had. Baked for 50 minutes. Excellent. Illbemaking this quite frequently"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delsean47"
},
"reviewBody": "Good Recipe, I changed a couple of things. Subbed Ginger for Nutmeg. Subbed Milk with French Vanilla Creamer. I added 5 Pads of Butter to the top of the Pie before baking, and sprinkled it with Cinnamon. Also an Optional thing I do is brush the crust with egg white so the bottom of the pie crust doesn't get too soggy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachell"
},
"reviewBody": "I made this pie using the following alterations, I used 3/4 heavy whipping cream, 2 tsps homemade pumpkin pie spice with a couple of extra dashes of cinnamon, and I used 4 cups of homemade puree and cooked to reduce it. Last but not least, I made a gingersnap pecan crust for the pie.... so good! Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelli"
},
"reviewBody": "I cooked the second one a little longer (2-3 minutes). It makes a very light, very soft filling. We liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swift44fl"
},
"reviewBody": "This recipe is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natishia M Curry"
},
"reviewBody": "I add Ripple Vanilla half&amp;half and Coconut/Almond milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mona Anne Carr"
},
"reviewBody": "Made 2 for Thanksgiving they went so fast. My pumpkin fans really love it. Making these for Christmas 4 not 2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Smiles"
},
"reviewBody": "Everyone raved about this delicious pie! Of all the recipes to try for pumpkin pie, I am really glad I settled on this one! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rockchalk"
},
"reviewBody": "We paired this recipe with a gingersnap crust and it was so delicious. The pie filling is smooth and the pumpkin flavor still is there but not in your face. This is my family’s favorite pumpkin pie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah"
},
"reviewBody": "I love the texture of this custard pie! I like to add freshly ground nutmeg to it. DO NOT use Trader Joe’s organic canned pumpkin - it’s much too watery. Libby’s canned pumpkin worked much better for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mickeyboy"
},
"reviewBody": "As did another reviewer I eliminated the milk and added an extra egg instead. The sugar made it unnecessarily to sweet in my opinion. The heavy cream adds sweetness on it's own. Next time i'll try eliminating the sugar and adding extra pumpkin and egg. The cooking of the pumpkin does help texture and reduces moisture. I'd have to do a side by side comparison with the traditional recipe to say which I prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancy"
},
"reviewBody": "I made this for a dinner for just four people and after all was cleared and we were in the kitchen all four of us attacked the leftover pie with spoons until nothing was left. Shameless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Basony"
},
"reviewBody": "This recipe became our favorite after trying it a few years ago! We will never go back to reg pumpkin pie.We sub sugar for splenda and it turns out great! I also make it crustless sometimes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Kennedy"
},
"reviewBody": "It was awesome! I used the whole can of pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leenie610"
},
"reviewBody": "For years I made the recipe on the can of pumpkin. Picked up a pie at a farm market and loved it. The following year they said the ladies who made the pie were no longer doing it. So I went on a search and found this recipe.. it is PERFECT! Creamy and smooth. No heartburn like some pumpkin pies. My go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aunt Amy"
},
"reviewBody": "The family go-to pumpkin pie recipe. Rich, creamy and most of all delicious!\nWe use the basic Crisco (butter flavored) pie crust recipe found on the label.\nAdded 1/4 tsp of cloves to filling too. \nAmazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Hammock"
},
"reviewBody": "Of course I tweaked it! I used cinnamon, ginger, cloves, nutmeg &amp; vanilla. I used half boiled custard &amp; half whole milk with a small amount of bourbon . What a delicious pie!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Markjlutz"
},
"reviewBody": "I adjusted the spices slightly as we enjoy clove with our pumpkin. \nTiming is way off for both the pumpkin and the pie. \nMore than double the cook time for the pies. \nTotally lost track of the time it took to reduce puree. \nSecond time: Everything worked, still took way longer than 10 minutes to reduce the pumpkin and took an hour plus to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Cournoyer"
},
"reviewBody": "Living in Mexico, the dairy products are a bit different. I used cream (almost solid) and half and half milk. I also used Coconut sugar instead of regular sugar. Wowza!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Welch Cossey-Brock"
},
"reviewBody": "I loved it and so did my family. Cooking the pumpkin made it rich and much more tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Lou"
},
"reviewBody": "I used canned pumpkin. The recipe was too much for my 9 in crust so I made a few mini pies too. I just mixed all the ingredients in a bowl with a mixer. I also baked it closer to 45 minutes. It was absolutely delicious! My husband found this recipe and requested it. He is a happy guy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vickytoriyah"
},
"reviewBody": "I've made this pie so many times over the years and love it! Yesterday, I decided to take a reviewer's recommendation and completely omitted the milk. I must say, I didn't think this pie could be any better, but it was! If you want a heavier/denser custard pie, leave out the milk. But for those who like it a bit lighter and fluffier, use milk. Although, I think the amount of milk it calls for is too much. It can get runny, and requires quite some time and refrigeration to set up properly (it can make your crust soggy). Trial and error is the journey to perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond Perry"
},
"reviewBody": "I scalded the milk and cream prior to mixing into the rest of the mix. I also cut the sugar to a 1/2 cup and no salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peanut725"
},
"reviewBody": "So delicious. This is the only pumpkin pie I make and everyone who tries it LOVES it. i get so many compliments. I follow the recipe exactly except that I use the large Keebler Ready Graham Cracker Crust (with 2 extra servings) and I bake it for about 45-50 minutes. I don't find that the pie is too watery but this may be because I cook it for almost double the time suggested in the recipe. It's possible that the other reviewers who found the pie didnt set didnt bake it long enough. And for the reviewers who said they omit the milk so it didnt overflow, buy the larger crust (like the one I use) and you'll have no problems. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anny Ray Raines"
},
"reviewBody": "Loved by everyone but I used pumpkin pie spice and 1 1/2 cups of heavy whipping cream instead of cream +milk"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kfairfield"
},
"reviewBody": "I will never make another pumpkin pie ever again. This was so good! \n\nI took another reviewer's advice and only added 1/4 cup of milk, and I still had a little extra filling. Honestly, I'm not sure it needs it at all. \n\nI did add a few drops of vanilla, 'cause why not, and just because my husband isn't wild about ginger, I only did 1/4 tsp of ginger and added one 1/4 tsp of nutmeg to keep the measurements accurate. Turned out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary y"
},
"reviewBody": "I tried this for fun to use up leftover pumpkin puree from another recipe. Followed the recipe exactly, it set beautifully and tastes amzazing. I ditched my old recipe (the one on the can;) and this is our permanent family favorite. My husband would be so upset if I didn't make it!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra C"
},
"reviewBody": "Excellent recipe......followed it just as specified. FYI though...there is no way this pie will cook in 25-30 minutes at 400 degrees. We pulled it out at 30 minutes, and the custard wasn't close to being set and the crust hadn't evens started browning. We let it go cook for another 20 minutes ( 50 minutes total cook time) and it was perfect. Used a pie crust cover for first 30 minutes and took it off for last 20 and it came out gorgeous. Completely set in the middle and it had turned a dark golden copper color.....and was absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artisanrox"
},
"reviewBody": "I made quite a few adjustments to this recipe. First, I didn't make it into a pie, I just made little custards. This recipe (one 15-oz. can of pumpkin puree) perfectly filled 4 little ramekins. I used a bain-marie (set the custards in a roaster and then poured 1 or 2 inches of water in the roaster).\n\nI used 3/4 c dark brown sugar instead of white, and it made the flavor HEAVENLY! I only used 1/4 cup milk because I see some folks had trouble with the batter being too thin. It was probably alright for me to use the entire 1/2 cup of milk because I really let the pumpkin get BONE DRY in the saucepan. This took a lot longer than 10 minutes. Maybe some pumpkin purees are more moist than others, and that's where the trouble is. Make sure your puree is really *really* dry. Mine easily clumped into a big ball in the pan before I called it done. I didn't have ginger so I subbed some pumpkin pie spice to go with the cinnamon that I did have.\n\nOther than that, the custards were wonderful, and they were even better the day after. I'll definitely save this one. This recipe is a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Granadas Perks"
},
"reviewBody": "About to try this recipe. Reading Barb72's comments, I'll separate the eggs, whip the whites, and then fold in. Perhaps that will lighten things up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "This pie certainly was delicious, and I chose it because I was looking for one without evaporated or condensed milk. I baked it 5 minutes longer than it said because it didn't look quite 'done' and even when it cooled it wasn't done. Became quite a soupy mess. Not sure if that had something to do with the 'cooking the pumpkin' step or what. I couldn't get mine to look caramelized, though I cooked it quite a while on the stove top. Will try again when I have heavy cream on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esther"
},
"reviewBody": "I ommitted the 1/2 cup milk. I cooked it for much longer than called for, until the centre was fairly firm. And it was GREAT! Most of the pie was firm, but the very centre just barely holds its shape when cut (almost like thick pudding). If you like your pie with lots of pumpkin flavour, lots of creaminess, and a soft texture, this is a perfect recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "singthepoems"
},
"reviewBody": "This recipe made a very smooth, creamy custard filling for my holiday pie. The spices weren't quite strong enough for me but that was easy to fix; I tasted the filling before adding the eggs and increased the spices, adding nutmeg and cloves, until the flavor was perfect. I liked the advice about chilling the crust, which kept the crust from burning while the filling set, and drying the pumpkin over heat kept the filling from being too wet. The final result got high praise from some VERY picky pumpkin pie eaters! This will definitely be my only pumpkin pie recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yashu"
},
"reviewBody": "I have been baking from scratch since I was a kid. (I'm 63 now) I learned from my Mom. With a couple modifications, this pumpkin custard pie really turned out excellent for me. As suggested by other reviewers, I omitted the 1/2c. milk. I found that I had to stir the pumpkin about 1/2 an hour over medium heat to get it to the desired consistency. A reviewer mentioned that theirs came out thin and soupy in the middle. I think that by cooking the pumpkin for 1/2 an hour on the stove, this problem is eliminated. I also baked my pie for 45 minutes, till the center was just slightly jiggly, and cooled the pie on a wire rack completely. The texture is phenomenal! I couldn't ask for better. I will definitely be making this recipe many, many more times. thank you Sara for this magnificent recipe.\nYashu"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alk02g"
},
"reviewBody": "I loved it. I thought it was a great spin on pumpkin pie, but I'd add more spices next time. The pumpkin-pie-lovers at the table weren't as big on it... it was too \"light\" for them to get their traditional fix. I think it would make a great parfait as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsjns"
},
"reviewBody": "Chose this for my holiday pie this year, and we were thrilled with its creamy goodness. Absolutely loved it! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitchendrama"
},
"reviewBody": "this is a pie that's meant to be thick and creamy. i've made this pie many different ways but i find that the pie comes out thicker and firmer when i use freshly baked pumpkin because the texture of the pumpkin is drier. it also taste so much better than when i use canned pumpkin. but using canned pumpkin or not, i omit the milk because the pie doesn't set. the bake time is definitely longer than the time posted in this recipe, i can't remember how long because i usually just check the firmness of the custard, maybe about an hour. this is the only pumpkin pie recipe i use and my family loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eileen Lee"
},
"reviewBody": "I changed it a bit - skipped the crust (just buttered a cassarole dish), skipped the 1/2 cup of milk because the mix already seemed so watery, and didn't use any of the sugar - instead I put in a bit of maple syrup. It was good! I ate it for breakfast, so I ate it cold. It set just fine, but I'm not sure if it's because I left out the milk or because I let it chill overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachell"
},
"reviewBody": "The only change I made was omitting the ginger and adding1 tsp of pumkin pie spice. Hubby loves this pie recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karmanitrate"
},
"reviewBody": "Really creamy delicious pie! I definitely prefer the richness of the custard pie rather than the plain ol' tired pumpkin pie that everyone seems to schlep at holiday dinners. I prefer mine with a touch more of ginger and nutmeg for an extra kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sarahandjack"
},
"reviewBody": "I did everything according to the recipe and my pie never set up. It stayed soupy. I brought it to my mother's house to see if she could fix it. We ended up just calling it pumpkin custard pudding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "laurentz"
},
"reviewBody": "The flavor of this pie was great, however the filling never set in the middle for me. I baked it for the recommended amount of time and let the pie cool overnight, however I still had runny filling in the middle, making each slice more like pudding instead of pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nessa"
},
"reviewBody": "It was okay me and my family made some changes like we added jetpuff liquid marshmallow which made it way better and changed some other things in there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancymcshane"
},
"reviewBody": "Pumpkin Custard Pie always gets rave reviews with my family, even from the kids who usually eschew pumpkin pie (mostly because they don't like the texture of the pumpkin mixture in the mouth). This firm, creamy pie has a more familiar \"mouth feel\" for kids so they eat it up.\nI usually substitute half of the cinnamon for 1/2 teaspoon of ground nutmeg (freshly ground is best, in fact I use freshly ground cinnamon as well)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Anne"
},
"reviewBody": "This is EXCELLENT Pumpkin Custard Pie, and it is gone as soon as it is cool enough to eat...LOL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "remhoff"
},
"reviewBody": "Very good recipe. I used pumpkin egg nog instead of milk and it tasted really good. The only problem was that I used a thick glass pie pan and the crust wasn't all the way cooked and it could've used 5-10 minutes more on the filling as well. I will try again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemary Mattson"
},
"reviewBody": "The only change I made was to put it in a graham cracker crust and less milk so that it didn't over flow. It was so good I am going to make the exact same pie for Thanksgiving. My picky 9 year old even liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda"
},
"reviewBody": "Our family has always preferred the custard pumpkin pie vs. the regular pie. It has a very mild flavor with a nice creamy texture. We made it exactly like the recipe called for - it turned out perfect. Make sure to let it come to room temperature before slicing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BARB72"
},
"reviewBody": "It tasted pretty much like regular pumpkin pie to me. I was hoping it'd be nice and light and fluffy, but it wasn't. Maybe I didn't cook it on the stovetop long enough, but I cooked it for a good 10 minutes. I'll try another recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAS666"
},
"reviewBody": "This is a very light and tasty pumpkin pie-a big hit with my family at Thanksgiving. In place of the milk, though, I used eggnog, which gave it an extra nice taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I made this for Thanskgiving dinner and everyone loved it. It was silky and smooth and just yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rindy"
},
"reviewBody": "Wow! This was good! I even forgot the sugar the first time and it tasted fine anyway. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VANILLATOAST"
},
"reviewBody": "Pumpkin pie is my favorite, and the one made from this recipe is the best I've ever had. I replace half of the cinammon with \"pumpkin pie spice\" ... I've always done that and I have no idea if it's better or worse that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZPAPILLION"
},
"reviewBody": "I've used this recipe for 3 years now and it is always a big hit. Lighter pumpkin taste than the average pumpkin pie, but creamy and very yummy! Needs time to set up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "nice texture and very tasty.. be sure to let it cool completely before cutting or it will be oozy..."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13858/pumpkin-custard-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/819/desserts/pies/pumpkin-pie/",
"name": "Pumpkin Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13858/pumpkin-custard-pie/",
"name": "Pumpkin Custard Pie"
}
}
]
}
}
, "about": [
]
}
]