				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Pumpkin Fudge"
,"datePublished": "2008-06-30T19:10:59.000-04:00"
,"dateModified": "2022-08-22T14:32:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Cathy"
,"url": "https://www.allrecipes.com/cook/Cathy"
}
]
,"description": "Creamy and smooth, this fudge is made with white chocolate chips, marshmallow creme, canned pumpkin, and just enough spice. It will please any pumpkin-lover!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/q2xBT1cza6BBykk26Cxgu7IV2UI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/pumpkin-fudge19-2000-80ba5aa5b2a94cf7a2f6eb79732215e9.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Pumpkin Fudge"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "455"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "256 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "9 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "71 mg"
,"sugarContent": "45 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"0.66666668653488 cup evaporated milk",
"2.5 cups white sugar",
"0.75 cup canned pumpkin",
"1 teaspoon ground cinnamon",
"1 cup white chocolate chips",
"7 ounces marshmallow creme",
"2 tablespoons butter, room temperature",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Line a 9x9 inch pan with aluminum foil. Butter the foil or spray with cooking spray and set aside."
} ,{
"@type": "HowToStep"
,"text": "In a 3-quart saucepan, heat milk and sugar over medium heat. Bring to a boil, stirring occasionally with a wooden spoon."
} ,{
"@type": "HowToStep"
,"text": "Mix in pumpkin puree and cinnamon; bring back to a boil. Cook, stirring constantly, for 18 minutes (see Editor&#39;s Note). Remove saucepan from the heat. Allow to cool slightly, 2 to 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour white chocolate chips in a large bowl. Pour fudge mixture over white chocolate chips. Let stand 5 minutes to allow white chocolate to soften; stir until smooth. Mix in marshmallow creme, butter, and vanilla until butter is melted and mixture is smooth. Pour into prepared pan. Cool, remove from pan, and cut into squares. Store in a cool, dry place."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was awful. The stirring for 18 minutes was ridiculous and this ended up a a big foamy mess. The taste was like a mixture of pumpkin and marshmallow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat Worden"
},
"reviewBody": "Wasn't sure I was going to like it because it sounded a little weird. But I loved it. And my friend loved it too and has been bugging me to make her more ever since."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zula"
},
"reviewBody": "I made this recipe using a microwave fudge recipe. That is the only way I ever get this or any fudge recipe to work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda Sprecher Schoenmann"
},
"reviewBody": "I suggest a medium 2-quart saucepan. Also don't let it stand after cooking but work fast to get it finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liberty or Death"
},
"reviewBody": "18 min on medium was too high on my gas stove. Next time I’ll go for about 10 min. A little crumbly but otherwise yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "I have never made pumpkin fudge before, we like the recipe but for some reason when it was all said and done, the fudge did not harden. It was mush. (I was sad) I'm not sure of I did something wrong or what. Maybe it could've set a bit longer or maybe put in the refrigerator for a little while. My family and I love pumpkin and wi be trying this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Riesse"
},
"reviewBody": "I thought I followed to a T but no, it seized once I added it to the white chocolate chips. Sort a tastes okay but it’s like a marshmallow square with pumpkin crumble inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SARAH Harrison"
},
"reviewBody": "I did make a few because I didn't have any baking chips. \nI followed all the instructions but mine didn't harden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Bonsteel"
},
"reviewBody": "Turned out perfectly and I didn't use a candy thermometer. I also used 1/2 tsp pumpkin pie spice and 1/2 tsp cinnamon. I added some chopped pecans too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Katie Budd"
},
"reviewBody": "It has great flavor. I did a half teaspoon each of cinnamon and pumpkin pie spice based on another review. But it did not set up like fudge. It will have to be eaten with a spoon lol. I followed the recipe exact so not sure what happened, I’ve never had a problem with fudge before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brenda Roughton"
},
"reviewBody": "I made it two times. Once doing the apx time to boil and the 2nd with a candy thermometer. Both times the mixture got past the softball stage too fast. It was a waste of money, all organic, and time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michael Greenhouse"
},
"reviewBody": "This recipe is great if you like to waste money and throw food away! 18 minutes is way too long and 239 degrees in the editors note is way to high. First batch followed to a T, turned the whole batch granular, TOSS! Second batch used accurate candy thermometer to hit 234 degrees. Did not set fully and was able to repurpose as frosting. I am a proficient confectioner/candy maker and I also use precision instrumentation as I also make my own soaps and need temperatures to always be just right. I think this recipe needs a bit of refinement but I have already wasted the time of two failed batches and this review so if I chance happen upon what you have wrong here, I will post with corrections."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Vince Ackerman"
},
"reviewBody": "I followed the recipe exactly, and NOT only could I NOT get the temp above 200 degrees (I even double checked with a meat thermometer), but it never set up. It tasted awesome, but what could I have done wrong to have it not (even close) set up?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "buckeyealum"
},
"reviewBody": "Followed the recipe exactly but it turned out more like taffy than fudge. The pumpkin spice flavor was ok but mostly, it was just sickeningly sweet. I had to throw it out. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teresa Fox Lamb"
},
"reviewBody": "I could only get the temp up to 210 degrees, so I made sure to stir for 18 minutes exactly and I stirred like a mad man the whole time. It failed! As soon as it started cooling it turned hard and crunchy. I think this needs less heat and less time boiling. It would have been good to have another indicator to tell when it was done cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tabkat"
},
"reviewBody": "I worked really hard on this recipe. It seemed to take forever to heat, because every time I turned up heat, it wanted to scorch. There is just such a small amount of liquid vs sugar, it was tricky. The white chocolate morsels took entirely too long to melt, even after I tried leaving everything in the pan (instead of taking it out as directed) and turning the heat back on the low. Next time I will warm the morsels first. I was afraid it would end up being \"over stirred\" but it seems ok.\n\nThe flavor is not bad, but just ok. I used fresh roasted pumpkin instead of canned so maybe that had something to do with it. I used an 8x8 pan and barely had enough to fill it. \nI will try again, because I always have a lot of pumpkin on hand, and maybe mix up the seasoning a bit, possibly using pumpkin pie spice or nutmeg.\n\nFlavor seems to improve as the fudge sets, so we will see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vickyq1"
},
"reviewBody": "Turned out great! Made three batches and all of them turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "I just made this and haven't tasted it yet. However, it would have to promise to be the fountain of youth for me to make it again. How can you stir this for 18 minutes, getting it to 239 degrees, without it splattering all over you and burning your skin? There must be a way because everyone else did it. I cook 7 days a week... I'm not new. This was a pain to make. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kj Bennett"
},
"reviewBody": "I've made this twice, and it still has yet to set up right. It remains kind of sticky and shiny, more like marshmallow cream than fudge. I swear I followed the recipe exact and it's just not working. any tips?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tucoma"
},
"reviewBody": "It does not set - waste of time &amp; supplies. Would not recommend - you will just be wasting money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DEBBIER01"
},
"reviewBody": "I followed the recipe exactly but it did not come out looking like the picture. it was too soft. I dont make fudge often and should have know better. I picked this recipe because it didnt use temperatures. but now i realize you really need a candy thermometer to make decent fudge. Also, I love sweet, but this was entirely too sweet even for me. maybe less marshmellow fluff would have made it firmer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Dooley"
},
"reviewBody": "I found pumpkin spice morsels and tried them... Phenomenal! First batch didn't set (my fault) so I invested in a new Candy thermometer and presto. I will be making this again... Count on it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay Bulinski"
},
"reviewBody": "It was very good! I substituted milk for white chocolate. My husband and sister loved it. It takes a long time to get the temperature above 220 F, but don't give up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kristens"
},
"reviewBody": "It's fudge, but it's like pumpkin pie-scented marshmallow fudge. It wasn't the pumpkin pie-flavored pumpkin treat I was really looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "This recipe did not work for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney Holton"
},
"reviewBody": "Fantastic! I added a tiny bit of nutmeg...... I will be repeating it again today. need to make more!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynnster"
},
"reviewBody": "Excellent recipe! I brought this to a Thanksgiving dinner and everyone loved it! The only change I made was I used my own pumpkin purée because I grow my own sugar pumpkins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jlnordeen"
},
"reviewBody": "I followed the directions exactly and it turned out a gooey mess as I see many others have complained about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "pfarley68"
},
"reviewBody": "I just made this recipe, I followed the directions and yes I know what a rolling boil is. It's cooling now but I can tell that it didn't turn out right, first of all the white chocolate chips wouldn't even melt all the way even though I boiled the mixture for 18 min and checked it with a thermometer. The flavor is great but it has a grainy texture. I will make pumpkin fudge again but not this recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally"
},
"reviewBody": "I love the pumpkin flavor and they were a big hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TL Peters"
},
"reviewBody": "Followed directions exactly and the 18 minutes seemed way to long, consistency seemed about right around 8 minutes. The minute I added white chips it firmed and started to harden while I tried to stir in vanilla.Then it was unworkable crystalized and hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Purple Lady Bug"
},
"reviewBody": "DELICIOUS!!!\nThis might become a new tradition!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Liz Marnell"
},
"reviewBody": "I've made fudge since I was a teenager. I've tried this recipe twice, and used a candy thermometer to measure the heat, and it still hasn't turned out. It has AMAZING flavor, but is very soft and doesn't set up like fudge. I absolutely love the flavoring, so I will keep trying, but this is a mess. Maybe I need more chocolate. Somewhere along the way I'm making a mistake as a lot of people have had this be very successful. And I wish it had worked for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boo Martin"
},
"reviewBody": "I love this fudge... stumbled across the recipe a year ago and it became my favorite. I followed the recipe and its really easy and fun to make and the house smells divine while I'm cooking it. I've never had a problem with it yet, and if I did its so yummy I would still eat it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aurora Montano"
},
"reviewBody": "I followed the recipe for all but one ingredient, I used vanilla syrupe instead of vanilla extract, only because I did not have vanilla extract and my fudge came out creamy and tasty but did not hold together very well and I think it's from the syrupe I used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WickedBeaver"
},
"reviewBody": "I made this as listed, but with the addition of a couple smidges of pumpkin pie spice, a extra large handful of white chocolate bits &amp; a little over a cup of chopped walnuts. It was a hit as a Thanksgiving dessert. The added white chocolate helped the fudge keep from melting in a small kitchen that had an oven running for over 5 hours. The consistency was still perfect after having sat in that hot room for over 3 hours.\n\nOh yeah, &amp; I used foil under it &amp; it did not stick at all!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karen Janicki"
},
"reviewBody": "I followed the recipe to the letter, I even set a timer...it turned out aweful. It was sticky, hardly able to remove it from the pan, and gritty at the same time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Peterson"
},
"reviewBody": "I will definitely be making this again. I followed directions exactly except I added a whole 11.5 oz bag of white chocolate chips and 1 tsp of pumpkin pie spice. Mine didn't stick to the foil at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Denton Campbell"
},
"reviewBody": "I have made this several times and it's one of the most requested by friends and family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mikie Daugherty"
},
"reviewBody": "I've made this several times with other recipes. This time it turned out delicious but for some reason it bound up when I added the chips and vanilla. Followed the recipe to a T, not sure where I went wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine Maucher"
},
"reviewBody": "It was a bit time consuming with how long you have to watch and boil, but then again I did not look for a quick/ easy fudge recipe. The only thing I changed was the cinnamon. Instead of 1 tsp of cinnamon, I did 1/4 tsp cinnamon and then 1/8 tsp each of ground clove, ginger and nutmeg. I felt that gave a little more of the pumpkin pie type flavor. Also, I did find that just taking the fudge off the heat to add and melt the chips took an extended amount of time, so I will maybe next time put it back on low heat to melt the chips a little faster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tina Hall Starcher"
},
"reviewBody": "Followed recipe to the letter and it was runnie and was like pumpkin carmels , this recipe has to much pumpkin, use half cup of pumpkin and it turns out great! Great if making pumpkin carmels!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "msfrizzle"
},
"reviewBody": "Had a friend who made this fudge just last night. She told me where she got the recipe and like a lot of reviewers, had the same problem with gooey/sticky fudge. She followed the directions, however upon reading the recipe above, it lacks a serious piece of information that would aid people in cooking a delicious batch of pumpkin fudge. Particularly for those who are new to the fudge making process. The recipe should include after adding the marshmallow creme, bring to 220 - 230 F or to the soft-ball stage if you have a candy thermometer. That would greatly aid people in not having gooey fudge like my friend did, had she known to get it to the right temperature. Otherwise, it was a yummy fudge even gooey. Though if you do want something more pumpkin pie flavored, I would recommend adding some nutmeg and clover into as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delana Gray-Lewis"
},
"reviewBody": "I made this and it was an absolute hit. No one could believe this fudge was made from pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Amy Kaufman"
},
"reviewBody": "I just made today hoping for a much better turn out. I am an experienced baker and fudge maker and followed the directions and yet I have a unset pumpkin fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chef Ala Bohn"
},
"reviewBody": "18 minutes on the stove turned this into a brick. We laughed when we were trying to cut this up and dig it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary W"
},
"reviewBody": "Made recipe as written. Absolutely love the flavor! Love that it is not too sweet. Set up beautifully. Used parchment paper for lining so sticking was not a problem. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jthurle2"
},
"reviewBody": "I tried using fresh pumpkin and it did not set up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "wynona Burnett"
},
"reviewBody": "I did not have good luck with this fudge, I cooked it for the 18 Min. and it hardened in the pan and set up like a brick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chandra Newsom"
},
"reviewBody": "I love it. I did use a candy thermometer, and had to cook it longer than the 18 minutes. I also added ground cloves and pumpkin pie spice, and used the whole bag of white chocolate chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "minnie"
},
"reviewBody": "Followed the recipe exactly...came out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Torres"
},
"reviewBody": "Thank you to Amandams27 for your review! I was sure to bring my mixture to a boil each time as stated and set my time! My husband said this recipe took him home to the Dominican Republic as it resembles \"dulce de leche\" but with pumpkin. My only issue was burning my hand with some of the mixture transferring it to my dish. Absolutely delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "I was about to give this a really poor rating. I made this exactly as written. After 4 hours chilling, it was a large sticky mess, with the (heavy good quality) foil stuck to it. I planned to serve this at a party, so painstakingly removed the foil, piece by piece. I was able to cut it somewhat, but my friends and I laughed about it and called it \"pumpkin poi\" because you had to scoop the gooey caramel-like substance and eat it with your fingers. The next morning, inexplicably, the leftover poi had turned to fudge. You could cut it and pick it up and it was lovely. Important advice: make this one day ahead of time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Salcido"
},
"reviewBody": "I tried this recipe for the first time and got the gooey stuff some of you were talking about. I went to a website that discussed how to fix fudge. Apparently I didn't get the mixture to the right temp during the rolling boil stage. The website suggested I put the gooey stuff back in the saucepan with a little evaporated milk and get a candy thermometer to a temp of 230 degrees. I immediately saw the difference the second time. Once I reached this temp I added a little powdered sugar, pumpkin spice, and wow! It began to set once I put it in the pan. Skipped the foil and lightly sprayed a pan like you all suggested. I wasnt going to give in because the gooey stuff tasted so good. Hope this helps, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "solvera"
},
"reviewBody": "If there was a rating higher than five stars I would give it. Amazing!!! I do like to substitute pumpkin pie spice for half the cinnamon but that's just personal preference. I could eat the whole pan myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medic50"
},
"reviewBody": "Fantastic flavors, just started trying to make fudge and had some success and some horrible failures. This recipe is foolproof and easy to make if you stick to the directions. Everything went according to the directions and fudge set perfect. Great pumpkin taste and texture. Will try adding some pumpkin pie spice or nutmeg next time for a little more complexity in the flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Heather Baker"
},
"reviewBody": "I followed this recipe exactly step by step, exact measurements, exact times etc. despite my better judgement because it seemed like an awful long time to cook sugar products, and sure enough it was. I'd suggest people use their judgement on the cooking times, not the recipes times. It isn't always user error like some would like to claim just because theirs came out fine. Some stoves may burn hotter than others and different brands of the ingredients could make a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMMICHELLE"
},
"reviewBody": "PERFECT!! Very easy recipe and really nice pumpkin flavor -- everyone loved it!! One lady at the picnic came up to me and said, \"Thank you for giving me the opportunity to try your pumpkin fudge!\" LOL Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "xxxxcherryred"
},
"reviewBody": "The flavor of this fudge was excellent, but it was the texture that I didn't care for. The cook time was entirely too long. As soon as I poured the fudge into the pan, it began to set, and it set so hard that when I'd cut into it, pieces would crumble. Eighteen minutes of a rolling boil is excessive and brings the temperature up way higher than 234, where it should be. I would be willing to try this recipe again with cooking adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen"
},
"reviewBody": "Very good, not so sugar sweet like most fudge. Used super chunky peanut butter because I prefer nuts in my fudge. Also added a tsp of almond extract and drizzled melted chocolate on top. Delicious!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Catholic Girl"
},
"reviewBody": "I followed the recipe to the T, even used a candy thermometer as the print version in the magazine suggested. I ended up with something between soft-ball taffy and fudge. Too sticky to roll into taffy and wrap in waxed paper or parchment, after being cut, it re-melts back into a blobby mess. I'm going to try heating it enough to reuse it on some \"turtle bars.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rarepurl"
},
"reviewBody": "Mine came out soft and stuck to the tin foil and these ingredients are not cheap! It should have been specific on temperature and what to do, it makes fudge loom too simple when there are so e intricate steps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dnw4"
},
"reviewBody": "My whole family liked this fudge. My 2 year old keeps asking me to make her some more. It was gone within a few days with 4 of us eating on it. I think I'll make it for Christmas as well. It has that creamy pumpkin flavor that you get with some pumpkin pies. It's a great alternative to chocolate. I made this following the directions exactly as written, and it turned out wonderful! I had no trouble with the fudge sticking to the foil or being too sticky. I will definitely make this again &amp; again...&amp;again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "First time making fudge ever and this turned out great! My fudge boiled well before the soft ball stage on my thermometer (boiled at around 225) so I went with the instructions. I found this to be almost painfully sweet, but I don't normally eat fudge. The pumpkin flavor is awesome, and I might add more cinnamon next time. It helped to have everything measured out and ready to pour. Next time I will stir everything before even adding to the pot, or use a whisk. It also took longer than expected to get the white chocolate to melt. I sprayed the foil and the fudge came out easily. Overall a great recipe for a first attempt at a new method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "camz1gma"
},
"reviewBody": "The direction to \"Bring to a rolling boil. Cook, stirring occasionally, for 18 minutes.\" ???? Holy Cow. Made the candy brick hard. Did she/he mean \"8 minutes\"?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker lover"
},
"reviewBody": "Amazing. Did it with bittersweet dark because I didn't have any white chocolate. Also made evaporated milk with almond milk and it came out perfect and a little healthier. !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nicola"
},
"reviewBody": "This did not set for me. I followed the recipe and did not change a thing. The only difference I can see is that unlike other ppl I did not use a candy thermometer. Maybe it just didn't get hot enough? It does turn unto a pumpkin caramel and might be good for dipping apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Smith-Manley"
},
"reviewBody": "I tried making this a few weeks ago and it didnt set, the flavor was awesome though ! I am going to retry it again today, my mistake was not letting it boil long enough, very important..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anabell913"
},
"reviewBody": "This turned out exactly as expected. I brought it to work and it was a huge hit! I made a double batch so I let it boil for 30 minutes and the consistency was perfect. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BONNIEBROWN"
},
"reviewBody": "I made 6 batches of this recipe yesterday for Holiday gifts. I DID have trouble with the first batch because the following is not clear. \"Bring to a rooling boil. Cook....\". I didn't know what was meant by 'cook'. After reading all the reviews again, I tried again with success. After it came to a rolling boil, I turned the heat down to low and let it sit and bubble for 18 mintues. Then it turned out perfect. I also found it easier to use a wisk to incorporate the new ingredients to the pan. I used the wooden spoon to stir it during the 18 minutes of cooking time. I didn't change any of the ingredients and it turned our smooth and delicous. The only thing I might do next time is drizzle some white chocolate over the top just to make it look pretty. The color of the fudge is not a 'pumpkin' color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLVernon"
},
"reviewBody": "This came out great. I was completely intimidated by this recipe but then figured worst case it goes down the sink if it is yucky. I followed the cooking instructions exactly. I have a weird stove so I had to play with the flame so the boil was steady and not burnt but it worked great. I also took the advise and nixed the cinnamon in favor of Pumpkin pie spice and put about a teaspoon and a half. I can see how the pumpkin makes the texture just a smidge less cream than I'm used to with fudge but I do not care. This stuff is already cut and packed because I will sit and eat all of it. Thanks for the reviews and tips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jodi Willie"
},
"reviewBody": "Taste was good but turned out like the consistency of caramel dip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "I've tried this twice now &amp; it turned out great both times. It is as little labor intensive, but the results are well worth the effort. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Guzauskas Ruby"
},
"reviewBody": "Gave it 5 stars because of ease and speed of preparation. I made this twice in as many days. First I used some reviewer tips (cooked to 240F before adding chips), but it didn't satisfy my taste panel (family)--too hard and barely any pumpkin taste (too much spice and sugar taste). Second time I followed basic cooking instructions (only 18 minutes w/out thermometer) but used 1 cup of pumpkin and omitted vanilla. Got more orange color, texture was smoother and it tasted more like pumpkin. The white chocolate chips already have vanilla flavor, so you don't need to add any extra vanilla flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helain"
},
"reviewBody": "Tastes great! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Fisher (Loki Puppy)"
},
"reviewBody": "Absolutely phenomenal!!! I brought these to a potluck at my work and got several compliments ranging from \"now that's what pumpkin fudge should taste like\" to \"its like taking a bite out of a pumpkin pie\"! Be careful with how much of the white chocolate chips you use, otherwise it tastes a bit caky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vababe"
},
"reviewBody": "I love this recipe. I used a thermometer and cooked it to 230, which takes quite a bit longer than 18 minutes on my stove. Although it set quick it came out slightly dry. I have also made this recipe with 1 tsp of pumpkin pie spice and prefer it that way actually."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Momof2"
},
"reviewBody": "This fudge did not work for me. I followed it to a T but no go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Delicious but mine did not turn out as orange as in the picture. I wonder how to get it to come out a little bit softer. It was hard to cut and usually fudge is a little softer than mine. Not sure if I cooked it too long, I cooked at a roiling boil for exactly 18 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allie"
},
"reviewBody": "Very easy recipe! I followed it exactly (hit a little snag with the 18 minutes cook-time: it took me 4 minutes to get all the Fluff out of the container! So I adjusted the boiling time to 18 minutes after the last ounce of Fluff went into the mixture). Took a good amount of whisking at the end to make the mixture creamy &amp; uniform but it set perfectly in the pan, at room temperature left out on the table. I used regular Reynolds wrap &amp; it came out just fine. A couple hours after it cooled I cut it into 1\" squares &amp; left them on the foil. Can't wait to bring it work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mstex7"
},
"reviewBody": "I made a batch for a pumpkin recipe contest at my church and I won! Everybody raved about how good it was and that they had never heard of pumpkin fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "debbthebee"
},
"reviewBody": "I make a lot of candy; in other words I should know how to make this recipe and even using a timer and candy thermometer it turned out a goey disaster and never set up properly. I am disappointed as the idea was a nice one just poor in practice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "janco"
},
"reviewBody": "I did just as the directions said but the fudge never congealed - it stayed like pudding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Biker Chick"
},
"reviewBody": "I followed the instructions exactly except I added more spice 1t cinnamon, 1/4 t each of ginger, nutmeg &amp; cloves and it tastes just like pumpkin pie ! So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oneemt2"
},
"reviewBody": "Tastes like pumpkin pie! I followed the directions exactly. The boil was not a hard and fast boil and not a soft rolling boil, I kept it in between and stirred only occasionally. I had no problems with the fudge sticking to the foil because I used the foil to lift the fudge out of the pan, then peeled away the sides. Easy! I have a history of not being able to make fudge, but this turned out perfectly. Everyone at work today is raving about it. The flavor improves if it's allowed to set a few hours after cooling. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "YUM. This was my first time making fudge, and I was really intimidated, but I followed the directions exactly and am now happily munching on the result. So good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LGraceWohl"
},
"reviewBody": "This is the best fudge I've ever made and I've been doing fudge every holiday season for years. I substituted semi-sweet chocolate chips instead of white chocolate (we're not fans), and it came out perfect. Not a bright orange, definitely a darker color but once you taste it this makes no difference! Oh, and like some other reviews mention, you HAVE to boil the mixture for at least 18 minutes for this to thicken enough, otherwise you will have caramel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "peggy"
},
"reviewBody": "The reviews were right, it did not set and would not come free from the foil. Use the release foil and maybe it will work. White choc did not melt so use small chips or chop them. So I had to cook it more to melt chips and it did not harden up. What a waste. I found better recipes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Fulton"
},
"reviewBody": "I loved this recipe! I did not use a candy thermometer, just followed the directions. The only change I made was that rather than lining my pan with foil, I used \"pan lining paper.\" That's the stuff with foil on one side &amp; parchment paper on the other."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Burr"
},
"reviewBody": "This is soo good! I love pumpkin everything, and I could eat this all alone! Better than pumpkin pie! I will definitely be making another batch because everyone wanted the first one. My kids ate it, and they don't eat anything when I say its pumpkin. I did use the foil, it made cutting much easier. Very impressed, thank you so much for sharing this! For those who are having trouble with this recipe, it may help to make sure you have everything measured and ready ahead of time, it boiled much quicker than I thought it would so be ready with the other ingredients. Definitely worth another try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Clare Cooper"
},
"reviewBody": "I also got goo, which I'm trying to figure out a good use for. I used Reynolds Wrap and all name-brand ingredients (no generics), and followed the directions carefully. Disappointing, but am encouraged by the other reviews to try it again - if the goo is any indication, it'll be really tasty fudge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christi Loomos Garza"
},
"reviewBody": "This was great. So easy and great taste. My kids were asking me to make more as soon as it was gone. I did use a pumpkin cookie cutter and they came out super cute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Boyd Wimberly Minor"
},
"reviewBody": "This' is added to my many favorite pumpkin recipes. Such a delightful change from chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BRTW"
},
"reviewBody": "Too sweet for my taste but others that tried it didn't seem to mind."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Randol"
},
"reviewBody": "I absolutely love this recipe.make it all the time.. i even tried to double it but that didn't work out to well... it was a caramel goo o well i learned my lesson.... super yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nathan Hughes"
},
"reviewBody": "I just made 2 batches of this. The first batch did not turn out so well. Too thin. For the second batch I boiled a little more aggressively and stirred a little less frequently, and it looks amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "YUM! I made this fudge for the first time this week, and it is SO GOOD! I did use pumpkin pie spice instead of just the cinnamon, and it turned out beautifully. I spray my foil with a bit of Pam, and the fudge came right off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mara Z"
},
"reviewBody": "YUMMY. I made two pans of this for my wedding reception. The first pan I didn't let cook for 18 minutes. It turned out fluffier than the second pan but still set up fine. I got many compliments and it was EASY."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamg"
},
"reviewBody": "Great fudge!!! Followed the recipe just as it was written and it turned out perfect. Did not use a thermometer, just set the kitchen timer and that's it. Will definitely make this again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/9432/pumpkin-fudge/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
"name": "Candy Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
"name": "Fudge Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/9432/pumpkin-fudge/",
"name": "Pumpkin Fudge"
}
}
]
}
}
, "about": [
]
}
]