				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick and Easy Goulash"
,"datePublished": "2000-08-07T07:23:23.000-04:00"
,"dateModified": "2023-01-27T17:49:46.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Adriane"
,"url": "https://www.allrecipes.com/cook/24320738"
}
]
,"description": "This hearty goulash with egg noodles, beef, and cheese recipe is a comforting homemade meal easy enough to make on a busy weeknight or for new cooks."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_pgY69hPOHDJY3xIfLGr1WRBHtQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1122290-quick-and-easy-goulash-Kristin-Nielson-Price-4x3-1-8e2b482e40614d2da19f788084fbb9f5.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick and Easy Goulash"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "80"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "885 kcal"
,"carbohydrateContent": "101 g"
,"cholesterolContent": "163 mg"
,"fiberContent": "10 g"
,"proteinContent": "43 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "1314 mg"
,"sugarContent": "22 g"
,"fatContent": "35 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (12 ounce) package egg noodles",
"1 pound lean ground beef",
"1 (26 ounce) jar spaghetti sauce",
"1 (15.25 ounce) can whole kernel corn",
"1 onion, chopped",
"1 cup shredded Cheddar cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add egg noodles and cook until al dente, 8 to 10 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "Brown beef in a skillet over medium heat; drain extra grease."
} ,{
"@type": "HowToStep"
,"text": "Mix in spaghetti sauce, corn, onion, and cheese with the beef over medium heat. Add in noodles and stir together to heat through."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim E"
},
"reviewBody": "This was pretty good! I substituted mixed veggies for the corn. Pretty tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ohmommameyaw"
},
"reviewBody": "My kid was poo pooing the dish while on the stove. Then took his first bite and said, “That’s not bad mom!” We had a winner... my other two kids liked it as well. Will make it again but will add more flavor-what flavor exactly not sure... I’ll figure it out. I wanted to make it just as the recipe stated so I’d have something to go on should I need to doctor it up. I really appreciated how easy it was to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaclyn.D"
},
"reviewBody": "Followed the recipe and everyone LOVED it! Only thing i did a bit different was reduce the onion before adding it. otherwise I LOVED it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcella Mendez-Ward"
},
"reviewBody": "We added this to our meal rotation! I add the onions and some chopped green peppers while Browning meat. Also I use Italian cheese and elbow macaroni or any other pasta I have on hand! Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meshababy24"
},
"reviewBody": "I think this was tasty I added diced can tomatoes and shredded cheese. Once it was cooked on the stove I popped it in the oven @350 for 20 minutes that way it was cheesy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moosenms"
},
"reviewBody": "I LOVE LOVE LOVE this dish! Easily a new favorite!! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michell"
},
"reviewBody": "This was very good! While browning the burger I seasoned with Italian seasoning, pepper, garlic powder, and crushed red pepper. I also added mushrooms and substituted the egg noodles for elbow. Otherwise made exactly as written and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NEbluejay"
},
"reviewBody": "A bit bland and somewhat dense. I'll make it again though and probably add some bell peppers and maybe Italian sausage to dress it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zolotoi"
},
"reviewBody": "Excellent! My kids love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Nielson Price"
},
"reviewBody": "This recipe was so good when substituting the ground beef with Johnsonville ground Italian sausage! It reminded me of a recipe my grandmother used to make when I was growing up. I left out the cheese and let the family decide if they wanted to top their dish with it instead - I have some non-cheese eaters. I also pre-cooked the onion in a bit of olive oil before adding, browning the sausage in the same pan. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Emily!"
},
"reviewBody": "This was really good and easy to make. My whole family liked it. We left the cheese out and made it our choice if we wanted cheese. I think that the serving size is a bit off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darthegirl"
},
"reviewBody": "It was great. I didn't have enough spaghetti sauce and it was still amazing! My boyfriend loved it and was like \"Those leftovers are my lunch for work tomorrow!\" :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine A"
},
"reviewBody": "Very good! Looking for a recipe for \"this kind\" (vs. Hungarian) of goulash that my mother used to make us when I was a kid. My son is gluten free so I subbed Ancient Grains quinoa elbow noodles instead - first time I've used them and they were DELISH! I remembered mom's being less \"Italian\" so I used 2-14 oz cans of small diced tomatoes in juice instead of spaghetti sauce, and I used mozarella instead of cheddar. Added garlic, salt and pepper to taste. It was SO good! I like celery in mine so I sauteed some celery and put it in my serving, knowing my son might not eat it if he saw too many veggies. He loved it, and usually he won't try anything new!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "don'tlovecooking"
},
"reviewBody": "This was the easiest meal to make...needed something new to do with ground beef and my kids didn't want meatloaf again...I made minor changes based on what i had..seasoned the meat with onion flakes, garlic powder, seasoned salt and pepper..used the spaghetti sauce and cheddar cheese with elbow macaroni..The only complaint my 6 year old had was the corn...he isn't a fan of corn in anything so i don't count that..would definitly make this again.. soooo easy, fast and good!! Glad i found this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaybubbles99"
},
"reviewBody": "Husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CS"
},
"reviewBody": "So easy, even the kids could make it! We usually also add peas or a cup of mixed veggies. Extra paprika and a little brown sugar doesn't hurt to give it the more \"goulash\" flavor instead of the \"Italian\" flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "We're on a super tight budget this week so I made this and bent it to stretch to feed the four of us at least for two dinners (feedng one hungry husband, two hungry growing boys and one mother) and at LEAST one lunch. I used organic spaghetti sauce and I added one very large red pepper, one cup chopped fresh mushrooms and a mess of fresh garlic that I sauteed in olive oil before adding in the rest of the ingredients, as well as adding in one can drained petite diced tomatoes. I also threw in some dried basil and dried oregano. The boys and I really liked this and along with homemade dinner rolls, this made a filling meal that stretched very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicolekrystyn"
},
"reviewBody": "This was really quick and easy! I didn't have an onion, so I just used a whole bunch of spices. I was skeptical, especially by its appearance, but it was really tasty with some hot sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vicki9792"
},
"reviewBody": "Good- cut the meat down to 2/3lb. and added peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "I love recipes that you can throw together! Love it. Made it for lunch, and I sauted the onions with the hamburger.I made a rue with the grease from the hamburger, 3 TBSP. worked. I didn't have spagetti sauce, so I used tomatoe sauce and a pk. of brown gravy seasoning with a cup of chicken stock,[ give or take] and a can of drained corn. Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lara K"
},
"reviewBody": "I used elbow mac and two cans of diced tomatoes and 1 can of sauce. I added lots of spices to the meat. Great hearty food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen Troyer Stout"
},
"reviewBody": "I wish I would have looked at the ingredients closer before I made this (I was in a hurry &amp; wanted something quick), I would have realized that it's just spaghetti (just a different noodle) with corn. It was ok, but I wasn't impressed. 2 stars because it was easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Root"
},
"reviewBody": "We were a little leary about this when we looked at the ingredients, but we tried it anyway! I added pepperoni and fresh garlic, but other than that I followed the recipe and we LOVED it! We all ate seconds, my husband couldn't stop talking about how delicious it was! We'll definitely be adding this to our favorites! It's a full mean in one dish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "momofthreeboys070910"
},
"reviewBody": "This is a good meal that goes a long way. I changed it up a bit. I used ground turkey and no yolk egg noodles. Used a really good flavored salsa and added some parmasean cheese. Thanks so much for this simple, good and cheap recipe. If only my 3 year old liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mllugenbeel"
},
"reviewBody": "Made this when short on time- used multi colored Wacky Mac spiral noodles. Couldn't have been easier. Everyone LOVED it!! Will definitely add to my \"use again pile\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "d. parker"
},
"reviewBody": "Great quick recipe. Try adding a little sugar to the mixture. It gives it just a bit of sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Picky boys loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mechelle Banville"
},
"reviewBody": "Made last night for supper was a keeper we liked thanks I made these changes elbow macaroni, more ground beef (about 1 1/2 lbs) cooked onion and fresh grated garlic with meat, added can of kidney beans mixed together with tomato, basil and garlic spaghetti sauce put in 8 x8 glass bakin dish put chedder and 4 cheese mix on top and about half cup spagehetti sauce on top and covered and baked yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VidaVila"
},
"reviewBody": "Great recipe. I used several of the suggestions and combined them. I added sliced squash, cooked the onion with the meat. I seasoned the meat with salt, pepper, garlic, basil leaves. I used one can Italian stewed tomatoes, and 2 13oz jars of different flavored spaghetti sauce. It was a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BREN1226"
},
"reviewBody": "This was very tasty. I did add salt &amp; pepper and a large green pepper to the mixture. Next time I'll double this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chanelle"
},
"reviewBody": "Have made this once before and am in the process of preparing it for dinner tonight. It is very easy and quick! Also very filling!! Great for a mom who is suppose to be on bed rest!! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Samantha Heetderks"
},
"reviewBody": "I was very disappointed with this dish especially after the reviews. All I thought this dish tasted like was spagetti with corn added to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "limeofurelife"
},
"reviewBody": "Tasted like homemade hamburger helper with a MUCH lower sodium level. I added green peppers and some garlic powder. Super easy and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WendyLady09"
},
"reviewBody": "Great recipe! I needed a last-minute dish and found this using ingredient finder. I used ground turkey instead and didn't have an onion but used onion powder. I used a kicked up spaghetti sauce too. Not gourmet but such a great comfort food! Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rae812"
},
"reviewBody": "My husband liked this a lot, but I wasn't impressed. I was expecting something with a richer beef flavor. It didn't taste anything like the goulash we had in Budapest. It tasted like spaghetti to me. I did take some of the suggestions listed in other reviews, but I don't plan on making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jenabowen"
},
"reviewBody": "The recipe was fine, just not our taste. I did follow the suggestion to use some spices while browing the meat - that helped. Also threw the onion in with the meat. It made a good, hearty winter evening's meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CYNDIDH"
},
"reviewBody": "I used to make almost this exact recipe when I was growing up... so I was happy to come across this one since I'd forgotten exactly what the ingredients were. My recipe was slightly different, though, so I adjusted this one to match it. Instead of egg noodles, I used spaghetti noodles. I added minced shallot and minced garlic while the meat was browning. To the sauce (I used a jar of maranara) and corn, I added garlic powder, onion powder, Italian seasoning, dried basil leaves, minced rosemary, and salt to taste. After the noodles were cooked and drained, I put all of them in the bottom of a casserole dish and mixed about half the sauce in with them so they wouldn't stick together. Then I layered 1.5 cups of cheese over the top, then spread out the rest of the sauce over the cheese. I baked it at 350 degrees for 20-25 minutes. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deanna Hamann"
},
"reviewBody": "Very simple and quick recipe. I would recommend for anyone who is pinched for time. The whole family ate it up. The only changes I made were: like many others I cooked the onion with the meat, and also I served corn on the cob as a side dish so I made an extra one to cut off the cob and put in instead of canned corn. Next time I will probably try adding some additional seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "katiesun"
},
"reviewBody": "I added Italian seasoning and garlic to this recipe, and it was great, but still just a little bit bland. Very easy and quick to make, though, and that's really important to me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jesslspence"
},
"reviewBody": "This was super yummy – I used some of the other suggestions and cooked the onions with the meat and added a bunch of seasonings to it. I also added a can of potatoes chopped up and some shredded carrots. My Very Picky 4 year old loved it – she thought it was spaghetti and didn’t even notice the extra veggies she was getting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Darcy Smith"
},
"reviewBody": "I thought I was the only one to make goulash like this! I love this recipe and change it up some by adding Taco Seasoning mix with the ground beef. Gives it a lil kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "C WHITE"
},
"reviewBody": "fast and easy. terrific for a quick dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Clonan"
},
"reviewBody": "ALTHOUGH I AM BOTH AN AVID COOK AS WELL AS BAKER, I JUST WANTED A QUICK, EASY GOULASH RECIPE......TOO COMPULSIVE TO FIGURE OUT MYSELF........THIS ANSWERED THE BILL PERFECTLY. THE ONLY CHANGES I MADE WAS TO USE GREEN PEPPER INSTEAD OF CORN &amp; LOW CARB PENNE INSTEAD OF NOODLES. EXCELLENT, A TRUE CHILDHOOD COMFORT FOOD FOR MY HUBBY &amp; ME! THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kirkie1109"
},
"reviewBody": "Very tasty, better than I expected. I made a few changes and used ground turkey, penne noodles and added mushrooms, green pepper and garlic...YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMPCOOKING"
},
"reviewBody": "We love this recipe...with a few changes. Elbow noodles insted of egg noodles and I hate onion, so I use onion powder and garlic insted. Easy and basic...what more could you ask for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "C.N. Peek"
},
"reviewBody": "Great recipe. I used manwhich instead of spaghetti sauce and added italian seasoning. Definitely quick and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DANASTRUNK"
},
"reviewBody": "I bit bland for my taste but a good base recipe to start with. I subtitute italian sausage for the ground beef. For the sauce. I use 2 cans of diced tomatoes (drained) and one can of tomato sauce. I let the sausage simmer with the sauce for 10 minutes or until it thickens. The diced tomatoes gives the dish texture and substance that it needs. I also added some fresh garlic. With these changes my husband LOVES this dish and its pretty simple and easy for me. I love those type of dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THARRETT"
},
"reviewBody": "This is by far the best goulash I have ever made, but here are some things I will change the next time I make it: First, the onions do not cook through that well when mixed with the sauce so I will fry them up with the hamburger, and change the cheese to mozzarella. Do add a ton of spices to your meat when frying it if you have a bland sauce. The corn makes this so yummy! Also, I used ground venison instead of hamburger (My husbands a hunter) and elbow macaroni. A+ super recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSSCHEPP"
},
"reviewBody": "This is a family favorite. My kids and my husband just eat it up everytime I make it. Very quick, very easy, and very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rene'"
},
"reviewBody": "This was quick and easy and made with ingredients that most people have on hand. My kids enjoyed it. This will be a keeper and made for quick easy meal and works good for the picky eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkreeves"
},
"reviewBody": "EASY AND QUICK! My two most favorite things! Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAWNOPFER"
},
"reviewBody": "entire family loved this one, we topped it with a little bit of mozzarella"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Whiting"
},
"reviewBody": "Very tasty, and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doc_farms"
},
"reviewBody": "I thought that this was great. I did it exactly as the recipe said to do, and it had the perfect taste. My husband is a really picky eater especially on our spegetti sauces, and he loved it. So I think as long as you use a sauce that you like, you shouldn't be able to find any faults with this one. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Troy H Covey"
},
"reviewBody": "this was really good lasted along time i set it up for 10 serving last 15 will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WINGSANDHALOS"
},
"reviewBody": "We really enjoyed this recipe! I think next time I'll add a can of stewed tomatoes, but otherwise it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ROWAN12"
},
"reviewBody": "Overall, this was a good basic goulash recipe. The flavor appeals to kids because it's not very strong, but next time I will probably cut back on the cheese a little bit for more of a tomato flavor and add some oregano and basil. It was quite good for the effort required! -Allison"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOPE16"
},
"reviewBody": "This was a great recipe- esp. since I am living overseas and many of the ingredients included in traditional recipes are hard to come by. It was quick, easy, and wonderfully tasty! I recommend topping it with some extra cheese on your plate."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22994/quick-and-easy-goulash/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17046/soups-stews-and-chili/stews/goulash/",
"name": "Goulash Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22994/quick-and-easy-goulash/",
"name": "Quick and Easy Goulash"
}
}
]
}
}
, "about": [
]
}
]