				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick Coffee Cake"
,"datePublished": "2000-03-20T18:36:33.000-05:00"
,"dateModified": "2022-07-14T15:49:29.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Stephanie"
,"url": "https://www.allrecipes.com/cook/24328437"
}
]
,"description": "This coffee cake is wonderful, the cake itself it moist and delicious while the topping is slightly crunchy and sweeter. Together, they make a delightful combination that you will surely enjoy!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-5reKbmY9g5JTMWH-ub7E6KLvAQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/37716-291a56c3c07b4bd9886ecb679716303c.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick Coffee Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "296"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "268 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "29 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "225 mg"
,"sugarContent": "21 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"1.5 teaspoons baking powder",
"6 tablespoons white sugar",
"0.5 teaspoon salt",
"0.33333334326744 cup shortening",
"0.5 cup milk",
"1 egg",
"0.5 teaspoon vanilla extract",
"2 tablespoons butter, melted",
"0.5 cup brown sugar",
"2 tablespoons all-purpose flour",
"0.5 teaspoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C). Grease and flour a 9 inch square pan."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl mix together the flour, baking powder, sugar and salt. Cut in the shortening with a pastry blender to the size of small peas."
} ,{
"@type": "HowToStep"
,"text": "In a separate small bowl, beat the egg well, then stir in the milk and vanilla. Add the egg-milk mixture to the flour mixture all at once. Stir carefully until just blended."
} ,{
"@type": "HowToStep"
,"text": "Pour batter into prepared pan and spread evenly. Drizzle top with melted butter."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl mix together brown sugar, 2 tablespoons flour and 1/2 teaspoon cinnamon. Sprinkle on top of cake. Bake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center of the cake comes out clean."
} ]
,"recipeYield": ["9"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cheffeelove"
},
"reviewBody": "Giving this a 1 star review bc someone needs to read the negative comments and fix the recipe! I shoulda woulda coulda red the reviews first bc I had same issues. Batter is too stiff and definitely needs 1/4 c more milk. Coffee cake topping the way they want it prepped? Nah, mix the butter in the brown sugar, cinnamon and flour mixture, then apply."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sam Wood"
},
"reviewBody": "The actuAL cake is more like bread, not refined enough to be a cake. The recipe is not written well as I discovered while making itl. The list of ingredients is missing needed \"shortening\" which only appears in the directions. I had to improvise during the baking process. Overall not worth the time or expense to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A. "
},
"reviewBody": "I am a huge coffee cake fan, though I have never made it before. This cake was AMAZING. I followed the recipe exactly, besides adding a touch more cinnamon to the topping mixture, and it was delish. The top and sides were cripsy and the flavor was excellent. I baked mine for 15 minutes. The cake did not rise much but cooked well. Personally, I would almost double the topping mixture. Some reviews said to mix the butter with the topping, put it on, and then drag a knife through it. I think I'll try that, but really this cake is wonderful as-is. Besides being delightfully delicious, this cake was also super quick and easy to make! It hardly takes anytime to prepare and is an awesome last minute choice. I highly highly recommend this coffee cake. I am already going to bake another since the first didn't last long. I loved it! ❤❤❤"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pureevil6667"
},
"reviewBody": "Very good. I doubled the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arthur"
},
"reviewBody": "I had many many roasted almonds, so I ground them up and added them after drizzling the butter under the topping. They were a hit. Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger Denney"
},
"reviewBody": "Absolutely perfect! Followed recipe. Light and fluffy, full of flavor. Huge hit with extended family on Christmas morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mae"
},
"reviewBody": "The end result was pretty good, but if I had followed the recipe as written it would have been a fail. Not sure why things happened differently for me. When I mixed the wet and dry, it was not a pourable batter - more like a dry shaggy dough that wouldn't absorb all the flour. I had to double the milk to get the right consistency. For reasons that are too wordy for a review, I'm pretty certain I didn't measure incorrectly. Even after doubling the milk, it was hardly enough batter to cover the bottom of a 9\" pan. I ended up using a 9\" round pie dish because it tapers at the bottom, and therefore has less surface area. That actually worked out well. The next issue is the topping... Where I'm from in New England, the defining characteristic of coffee cake is the cinnamon crumble on top. As written, the topping isn't a crumble, more like a dusting. I mixed the butter in with the topping, and that worked out well, but still wasn't the crumble I wanted. Next time I will add more flour to the topping (at least a quarter cup.) All of that being said, with the changes I made it came out very good. I did not add more sugar to the batter as others did, and I don't think it needed it. The flavor was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CharlieBrown64"
},
"reviewBody": "Took reviewers advice. Added more sugar and milk. Turned out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’m generally attracted to recipes that measure sugar content in tablespoons vs cups. Unfortunately, I hadn’t read the reviews here before beginning; and, as per my usual, cut the sugar content (in this case, by 1 T.). That was a mistake. I agree the cake needs additional topping, but with less flour. Luckily, I had Reddi-wip on hand, which made it a sweet enough dessert to enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eagle-serwah"
},
"reviewBody": "Very easy to make and very tasty. Went in minutes! I read the reviews and added a bit more milk and sugar. I added some water too. I learnt that adding water to cake mix makes it more fluffy and it worked. I definitely will be baking this again in a short short while! I also tried marbling it by mowing the cinnamon bit into the cake and it looked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Doug Slager"
},
"reviewBody": "The flavor is OK. Recipe is poorly written (pour the batter in twice!). It's not batter either - it's dough.\n\nUsed butter instead of shortening and that's probably the only thing that saved it from 1 or 2 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steven Iannuccilli"
},
"reviewBody": "Really good cake but the recipe is written either wrong or it’s just confusing. When making the crumb part you add the melted butter to the brown sugar mixture. Otherwise really tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren Limauge"
},
"reviewBody": "It was pretty good, not great, but quick and easy. I prefer my New York Crumb cake recipe but this was decent. Kids liked it. I did think it made a light moist cake with a good crumb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Troy Carrington"
},
"reviewBody": "This recipe is horrible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbmcneiol"
},
"reviewBody": "It is a good cake with a great topping. I used 1/2 cup of sugar and 3/4 cup of milk. The batter was thicker than I expected and I had to switch to a smaller pan. I was surprised that it took only 15 minutes to bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Katsina "
},
"reviewBody": "My daughter loved making this with me - it was easy. But kinda bland. Needs more cinnamon. I used butter substitute instead of shortening and cut back the sugar slightly. Too much flour in the topping. I'll add more cinnamon and add nuts next time, maybe a streusel topping. I also would cook it at a lower temperature. Still, it's nice and simple with a cup of coffee on a Sunday morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fran"
},
"reviewBody": "I increased the ingredients by half. I also added a little more milk to thin the batter. Added chopped pecans. It was wonderful. The next time i make it I will not 1 1/2 times the brown sugar and cinnamon. Served it warm. I also drizzled frosting made with butter, powdered sugar and milk over the cake. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kyra Gensel"
},
"reviewBody": "Cake was very fluffy, but not as sweet as I would have liked. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Browett"
},
"reviewBody": "I made this vegan for my daughter, and it was easy and delicious! I switched out the egg for \"Bob's Red Mill Egg Replacer\", the butter for Earth Balance, and the milk for soy milk. It was absolutely delicious! Easy if you need to switch out ingredients due to lifestyle, or allergies. Also, I used a 9 inch round cake pan instead of a 9 inch square pan. I plan on making this again. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mommaofmany"
},
"reviewBody": "I made a number of changes, but this basic recipe is great. I doubled all the measurements and used a 9x13\" pan. I upped the sugar in the cake to 1 cup, cut in 1/2 cup lard AND 1/2 cup butter, added 1/2 cup plain yogurt along with the milk, added a bit more vanilla. For the topping, I doubled everything except the flour. I baked it at 425 for about 22 minutes. It came out wonderfully and was well enjoyed by our Wednesday evening prayer group."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "NewEngland37"
},
"reviewBody": "I've made this three times exactly as written and it is not a great or even good version of coffee cake. I know, I know, tons of other reviews that bestow its greatness, but for us, it just didn't cut it. The dough is very overworked given the instructions and there is no need to do the temperature adjustment. The cake is bland, it needs more vanilla and/or a smidge of salt, it needs help!\n\nI've also made this with some modifications of my own, as well as incorporating some from other reviews; still not the bomb of a coffee cake that I am on the hunt for. Will keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Michael Yerian"
},
"reviewBody": "Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith Mikhael Weitzel"
},
"reviewBody": "I've made this several times and it always turns out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pat Phillips"
},
"reviewBody": "I am not sure why people rate recipes five stars, when they then list how they had altered the recipe. I just pulled this out of the oven, and the brown sugar appears to be just sitting on top and burned in spots. Oven is new and true...have not had problem with other recipes. Recipe was not edited. Said to pour batter in pan, at two different times. I agree, that I would mix the butter and brown sugar together, next time. Will give it three stars here. Will change it up if it tastes better than it looks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Brian Satterfield"
},
"reviewBody": "This batter sucks, it was way too thick. I wish I would have read the reviews first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rinda Webb"
},
"reviewBody": "i made this recipe in a muffin tin. It was good but heavy. I figure it is because i used buttered shortening instead of regular shortening. I also used the melted butter like the recipe calls for. I think this is good recipe but make sure that when you use the shortening it is regular not buttered or do not use the melted butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms Kelley"
},
"reviewBody": "For the effort this takes it was quite delicious.I doubled the topping and followed everything else to the T.will be making this again.thanks so much for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alzena"
},
"reviewBody": "It was wonderful! I didn't add any extra sugar like other reviewers did; I made this in a bind! I didn't realize I didn't have any milk, so I used coconut milk instead, and added 1/4 cup more so it would have a more cake batter-like texture. You couldn't even taste the coconut milk! The cake was so fluffy, and the topping was just delicious. I added pecans on top as well, and mixed the topping with the butter beforehand. Our guests loved it, there is none left! I definitely recommend it, and I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "It was very good! Here are some changes I made:\n\nI used half the sugar and probably could have made it with even less.\n\nI made a little extra topping and integrated it in the mix then put the rest on top. Gives it more flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Marti"
},
"reviewBody": "I loved this recipe it was pretty easy and really yummy. I did make a couple changes, instead of using shortening I used coconut fat and a bit of butter. Also for the topping I melted a but of butter and drizzled over the top as in the recipe, then I melted more butter and mixed it with the brown sugar mixture and put it on the cake . it was really good, and the topping sort of drizzled down the bottom of the cake in some places. It was really tasty, and everyone loved it. I will definetly be keeping this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Culinary mom"
},
"reviewBody": "So moist and delicious! The only thing I changed was I added 2 extra tablespoons of Sugar - I will absolutely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "olga"
},
"reviewBody": "doubled the recipe, didn't change a thing other than bake it at 350F for 25 mins. Was perfectly done in that amount of time. Was just ok. Was expecting something amazing after reading all the reviews, so I was quite disappointed after tasting it. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRocandJordysMom"
},
"reviewBody": "I was searching for a coffee cake recipe and this fit the bill! It was so easy! I made the recipe as written. It was wonderful! The cake was so light and the topping was sweet and crunchy. I could taste the butter too! I baked it for 15 minutes. I did not find it dry. I will definitely make this again. To the people who altered the recipe, the cake portion of a coffee cake is not supposed to be sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ava Long"
},
"reviewBody": "This coffee cake is amazing! I love the texture and I've made it several times already. It is perfectly moist, not excessively sweet, and the tastes only becomes better and better with a few days. \n\nI would recommend doubling the crumb top recipe, I think the original is a little bit skimpy. I added nuts on top of the topping for a supplement of pazazz! \n\nDO NOT DOUBLE THIS RECIPE, though. Every time I have doubled the recipe, the bottom had to be burnt in order for the inside to be cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DonnaD10"
},
"reviewBody": "I followed the recipe without reading any reviews or suggestions. We liked it as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillian Ocampo"
},
"reviewBody": "I made this as written only doubled the topping. I wish I had left it alone as I think it would have been better. This is a coffee cake. It is not meant to be really sweet and this was perfect and the topping would have been enough as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CASTILLOCA"
},
"reviewBody": "\"Awesome\" and \"super yummy\" were the comments I heard from the family on this one. We followed B Spradley's review: doubled the sugar, added 1/4 cup more milk, and dragged the topping into the batter to mix it in a bit. I didn't have shortening, so used stick margarine. We made it vegan by using Uncle Bobs egg substitute, soy milk, and margarine. It took about 30 minutes total to bake for some reason (10 minutes longer than the recipe called for). I poked the middle with a wooden skewer to test for doneness, and when it came out clean, I pulled it out of the oven, let it cool a bit and firm up for about 10 minutes, then served it nice and warm. Super delish! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole Lynn Madison"
},
"reviewBody": "I added the extra sugar and milk as many suggested on the reviews. It does taste very much like Drakes Coffee Cake, only better as it has none of the additives. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Morton"
},
"reviewBody": "After reading several of the reviews I decided to alter it to their opinions as well as my own taste preferences. I added 1/4 cup milk to the batter. Plus 1/4 cup more sugar and 3 Tablespoons brown sugar. As well as 1 tsp. cinnamon and 1/4 tsp. nutmeg. (the nutmeg gave more depth to the flavor.) I also upped the vanilla from 1/2 tsp to 1 1/2 tsp. If using medium egg, increase to 2 eggs instead of 1.\n\nI used a greased and floured 9 x 13 air bake pan. Spread cake mix evenly into prepared pan.\n\nI didn't pour the butter over teh cake. Instead added melted butter to topping and use 3/4 cup brown sugar. Mix melted butter, brown sugar, cinnamon (double cinnamon for topping) add 1/4 tsp. nutmeg until well blended. Sprinkle evenly on top of cake . If you have any bare spots lightly sprinkle plain brown sugar over top of cake. I also dragged my knife through the cake mixture, after it was in pan and topped. That allowed the crumble mixture to go through the top layers of the cake. In the air bake 9 x 13 I baked it for 18 minutes at 425. Enjoy warm out of the oven moist, and deliciously full of flavor. \n\nI will be making again can't wait to try one of the other reviewers opinion of adding chopped nuts. Apples or any other choice of fresh fruit could be used in conjunction with original toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanieisfabulous"
},
"reviewBody": "This was really, really good. I doubled up the recipe. The cake batter tasted a little too \"unsweet\"so I added 1/3 cup light brown sugar &amp; also the same amount of white sugar. I don't use shortening so I substituted canola oil. I also made an extra batch of crumble (I am a sugar addict). My husband loved it &amp; he said the best dessert I have ever made. He's not into sweets either! I am making two more today as thank you gifts. This tasted better the next day. The cake needed time to cool and the crumble to set,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C_Lynn"
},
"reviewBody": "I really liked this coffee cake. The crumble topping was excellent! I would use this recipe for that alone! It did take much longer to cook than what was suggested in the recipe. I did add blueberries to the batter, and it was a moist yet wonderfully textured coffee cake! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kat York"
},
"reviewBody": "I added extra sugar and milk like everyone else did and doubled the topping. I added 1/2 of apple juice . Its also good when you half the batter and put a can of apple pie filling in the middle. Poured the rest of the batter on top, added the topping and it was a hit. Just an idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Lamers"
},
"reviewBody": "Made this with Gluten Free flour and used 9 tbsp sugar instead of the called-for 6 tbsp. Made 1.5 times the topping. Very good! It was a little sweet for me, so next time I would make it with the original 6 tbsp sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Costa Rica Von Heilberg"
},
"reviewBody": "I made a lot of changes. I added to dough 1/2 C chopped, dried and reconstituted bing (sour) cherries (20 min soak in hot water, 1/2 t cognac and 1/2 t vanilla -- you could use 1 t amaretto or almond extract. Dry thoroughly between paper towels). To dough, I added the zest of 1 lemon and sprinkled 1/2 cup sliced unsalted almonds on top before baking along with the melted butter and sugar. I omitted the cinnamon. I used 2 t baking powder rather than 1-1/2 and baked it in an 8x8\" pyrex baking dish at 425 deg F for 20 minutes in the center of oven. It was heavenly!!!\n\nDespite some of the reports of dry consistency in some of the other reviews, mine came out quite moist, perhaps the cherry addition was helpful. I highly recommend this recipe. Please try my changes and let us know if you liked it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy"
},
"reviewBody": "Delicious! I was a little bit worried when the batter barely covered the bottom of the pan. I was making it at party and several friends said that it was to thick and that when they had made coffee cake it was layered and thinner, they said that mine might be more like bread. However when i took it out of the oven it dissapeared mysteriously within minutes. The cake was moist and delicious and the struesel on top was perfect. One change that I made was using butter rather than shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joan"
},
"reviewBody": "I'm giving this 5 stars for what it is, a quick coffee cake. That being said, my husband and I thought it was very good. I made the recipe as written. I used coconut oil instead of shortening, and added some macadamia nuts to the topping. It was moist and sweet enough. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Walker"
},
"reviewBody": "Quite tasty. Only thing I did differently was add a 1/4 tsp nutmeg along with the cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Sky"
},
"reviewBody": "It was great and I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "I really liked it. I just followed some of the other recommendations. I added more milk and mixed the melted butter with the topping before adding it. I also added a pinch of all spice and cinnamon to the dry ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mrs. Snell"
},
"reviewBody": "I made this cake this morning for something quick to go with our Thanksgiving dinner. I have to confess, though, that I followed the recommendations from other reviewers also, increasing the sugar and milk. While this sort of makes the recipe a whole new one, I'm reviewing to say thank you for the base recipe. It's delicious and I'm sure I will make it again with the modifications. Happy Thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Horsnell"
},
"reviewBody": "Everyone love this coffee cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lin Collins"
},
"reviewBody": "Didn't alter anything with cake part of recipe but with the strussel; WHO on this planet puts only 1/2 t cinnamon in anything? One might as well not bother putting any in at all. Make up your own, triple it and it's a good cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzie"
},
"reviewBody": "I have made this so many times and it's always a request when friends or family visit. Super easy and I don't change anything about it. I LOVE LOVE LOVE this recipe and You will too!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Begonia "
},
"reviewBody": "Very easy and quick. I also increased all ingredients and made it in a spring foam pan. Be sure to cook it a bit longer. I also added some baking powder and skipped the sugary topping. That way it can be a less guilty breakfast cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brianne Caughy"
},
"reviewBody": "I will be making this again! Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ncdee"
},
"reviewBody": "I just made this coffee cake..hubby just had a small sample and said delicious..I did add more milk and sugar and a dollop of sour cream and doubled topping..the cake part very moist but light the topping is crunchy..I will be Making this often...ten stars...thank you...best coffee cake recipe and fast and easy to make..would love to can the baking aroma!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "Has anyone made this with added fruit? pls let me know what fruit and how it worked out. ...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Andres"
},
"reviewBody": "With extra milk added (about 1/4 c.), this really is a perfectly simply coffee cake. We also use brown sugar instead of white in the cake itself, which gives it a bit different flavor and texture. When it comes out of the oven the line where the cake meets topping is like they mixed together, and the result is yummy! It's usually gone in less than a day at our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexi Grogan"
},
"reviewBody": "This coffee cake tastes amazing....when it finally comes out of the oven. I made a layer cake so I doubled the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kasaundra Marry Anna Layman"
},
"reviewBody": "I agree with other users that this recipe needs to be tweaked. I wish I would have read the reviews before i made it. The cake is a little dry and flavorless. Next time I will add more milk and sugar to the cake and make more of the topping so that I can cut a little of it into the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherrie"
},
"reviewBody": "This is a great recipe for Sunday morning when I want something sweet for breakfast. I do not like real sweet cakes so I thought the amount of sugar was perfect. The cake portion of the recipe is great as is, you could top this with almost anything. Not quite a pound cake and not quite a typical cake. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GenaRN"
},
"reviewBody": "I've made this many times with these changes: I always double it and use a 9x13 pan. I use mayonnaise instead of the shortening and it keeps the cake moist and tender. I use 1 cup of sugar in the cake (doubled recipe). A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amie Devlin"
},
"reviewBody": "I love love this coffee cake! I followed everyone's directions and added double sugar and double topping and more milk. I also ended up putting a half a cup of bisquick and a cup of four instead and it came out so amazing!!!!! really crumbly/spongy it was perfect! I also added nutmeg to the topping that was a great idea! I ended up having to bake it more than double the suggested time but it didn't burn edges were crisp though which I like!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fictionalhuman"
},
"reviewBody": "Based off the original recipe, I would say I liked this cake. However, when I tried it with the recommendation of others in the comments, adding an additional 2/3 cup of sugar and extra 1/4 cup milk, I LOVED this cake. I would have given it five stars had the original recipe had these changes to it. I also doubled the brown sugar topping, but that is just because I like it extra thick on my coffee cake. Overall, I highly recommend, but go ahead and make the slight changes everyone suggests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shoey Shoey"
},
"reviewBody": "I tried this recipe this morning making it gluten free and it was awesome!! I doubled the recipe when I made it, substituting my gluten free flour for the all purpose flour. Other than that I made no changes and it was very moist and delicious! I have saved the recipe because no one had a clue it was gluten free and they all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CINDY3539"
},
"reviewBody": "This is a good base recipe, a little tweaking and it's great. My cake was very good &amp; moist, but I did make some changes. Instead of shortening I used mayonnaise. I also used 1/3 cup of sugar. In the topping I doubled the cinnamom. I would definately make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kris"
},
"reviewBody": "Yum! Super fast, easy. Switched brown sugar for white (just because that is what I had) also added about 1/2 cup chopped pecans to the topping. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emily Onestar"
},
"reviewBody": "The cake part turned out perfect but the edges burned and so did part of the topping. I think the temp. was to high. I don't think I will use again nobody in my house liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrianne"
},
"reviewBody": "Quick, simple and absolutely amazing! The cake is moist, the topping is a little crunchy (and crumbly-beware parents), and the whole is all around delicious. Unlike the other reviewers, I actually cut the sugar (about 2/3 of what is called for) but added about a half teaspoon of cardamom. It turned out so well that this will be my go-to coffee cake recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Turned out perfectly. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "epic"
},
"reviewBody": "This recipe makes a great, easy coffee cake. I did make a couple of modifications, however. First, I doubled the sugar, which gives it a nice, sweet flavor. I also used buttermilk instead of milk. This makes a moist, sweet cake with a delicious topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenniferdori"
},
"reviewBody": "Fast, easy, and tasty. Just what I was looking for! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Taylor"
},
"reviewBody": "So, so very delicous! I added my own secret ingrediants and the Coffee Cake came out so delicous. At first I was sceptical, then tasted the cake. All I got to day is OMG!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Linda Thompson Gebelein"
},
"reviewBody": "I should have read the comments. My husband tasted the coffee cake for me and said it looked and tasted good but was very dry. I wouldn't make it again without paying attention to the comments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "This recipe is great, I've. Made it many times and it always comes out excellent. Someone said it was like Drakes Coffee cakes and they were right! I like to add more cinnamon and more sugar into the cake batter as well. Try this and you will want to keep making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "This was good but very dry. I can't blame the recipe entirely though becuase I read the ingredients but not the instructions, and creamed my sugar with butter (I don't use shortening), than added the egg and dry ingredients. I think this made mine a bit too light, but the taste was still great. I had to stop my husband from eating the whole pan. Next time, I'll follow the instructions and see if it is a bit more moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine B"
},
"reviewBody": "Aside from increasing the milk to 3/4C I followed the recipe exactly. I do agree that the topping is a bit dry, and would probably add the melted butter to the topping instead of putting it onto the cake. I don't see the problem with adding the flour to the topping as it is such a small amount. I will definitely keep this one around for a quick tasty dessert, and might try some variation like adding coconut or oatmeal to the topping as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanja Hall"
},
"reviewBody": "I followed the tips of doubling the surgar and adding extra milk. Yum, what a great cake. I also, as one review suggested, melted the butter and stirred in the brown sugar and added the flower and drizzled it on top that way and then with a knife cut the topping into the cake a bit. I also added chopped pecans an skor pieces to the top. Served warm with ice cream or on its own, it's so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monrovia"
},
"reviewBody": "Wow! This one is a gem! Followed the suggestion of many and doubled the topping and added a few more tablespoons of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this recipe several times. My husband, my 15-month old daughter, and I LOVE this coffee cake. The first time I made it I followed the original recipe. It was a bit on the dry side. The next couple times I added 1/2 a cup of apple sauce. This gave it all the moisture that was lacking in the original recipe. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith Morton"
},
"reviewBody": "I've made this recipe several times. My husband, my 15-month old daughter, and I LOVE this coffee cake. The first time I made it I followed the original recipe. It was a bit on the dry side. The next couple times I added 1/2 a cup of apple sauce. This gave it all the moisture that was lacking in the original recipe. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "klesser9"
},
"reviewBody": "texture is a little tough despite proper cutting in of shortening and not over mixing . Flavor of dough is more like a pancake-- speaking of which, was disappointed that it was rather flat-- only rose to about 1 1/2 inches. I had to make extra streusel just to make it interesting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WendyS"
},
"reviewBody": "Delicious, versatile and everyone loved it. Can't ask for more! Next time I will pour half the batter into the pan, then sprinkle the topping mix (which I doubled) then repeat layers and swirl with a knife."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariam Babiker"
},
"reviewBody": "Great recipe... I have been saving it till my day off diet , and i am glad i did.. I did ehat others suggested 2/3 cup sugar in the batter, add 1/4 cup milk too. Made like a crumble on top but to be fair i simply eyed it and pressed the crumbs in a little.. It is sooooooo good... Easy and great :) i am enjoying it right now with a cup of tea, my friend had a slice and asked if she can have a slice to eat in the car coz she was running late :) oh i forgot i used ghee instead of shortening .. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "juzzi"
},
"reviewBody": "I'm confused by this recipe, where is the coffee in this cake? It may be a South African thing but our coffee cake actually tastes like coffee. Also had issues with step 4 &amp; 5, how can you pour the batter into the pan if it's already there?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stasia Blake"
},
"reviewBody": "I came home from work and suddenly I was hit with urge to bake something. Well, I was hoping for a quick recipe that didn't require alot of exotic ingredients and I think this recipe was just what I needed. I already had everything I needed, it doesn't take a long time and the reviews from others were very helpful.I took the advice of adding extra vanilla (no such thing as too much as far as I'm concerned)and extra milk, but I think I put too much because it was a bit moister than I had intended. Will make again and add only 1/4 cup extra milk. Try it when in a pinch, I think you'll like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jade"
},
"reviewBody": "i tried it and it was really good...yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRECKLE"
},
"reviewBody": "As almost everyone else here, I added an extra 2/3 cup sugar. I also doubled the amount of topping and halved the flour ratio for the topping. That said, this recipe was top-notch! Definitely make it again. Super easy and super-fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smilingmom"
},
"reviewBody": "Made this recipe as written except used butter instead of shortening and used 2/3 cup milk. For the topping,I used about 1.5 tablespoons flour and 1 teaspoon cinnamon. I also added about 1/2 cup chopped walnuts. Baked it in my toaster oven and it came out great. Cake was not too sweet and will use it often for cakes with rich frosting/icing. Next time will try chocolate chips and coconut in the topping to give it a german chocolate twist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shannon H Elia"
},
"reviewBody": "I agree that this is a good basic coffee cake recipe. I made the recipe as is. A true coffee cake is not overly sweet so the recommended sugar is a good amount. I believe I will use this as a base recipe for many variations to come."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twoyorkiesmom"
},
"reviewBody": "So simple and easy!! Taste great too!! Did add a little more milk as reviewers recommended and mixed the melted butter with the brown sugar, flour and cinnamon topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elbee"
},
"reviewBody": "I've made this twice now and it is perfect. Do not add any sugar -- it is quite sweet already. I can't imagine what it would taste like with more sugar. Also, it is light and fluffy with just the right amount of substance for a coffee cake. If you find it dry or heavy, I suggest beating the egg really well (as per the instructions). Great cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "the original recipe is the best...I might add some walnuts to the topping , but that is the only change"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peas with Honey"
},
"reviewBody": "Really nice basic, fast coffee cake. I used whole wheat flour, real butter, and coconut sugar in the dough, sucanat for the topping (and just made a crumble rather than melt the butter, extra cinnamon of course!) The dough wasn't sweet, but this made a LOT of topping, too much topping, really so I didn't even notice the dough. Next time I'd sweeten the dough slightly more but reduce the topping (and I like a lot of topping). What I like best about this is it went from mixing bowl to oven to table in about thirty minutes, and with my passel o' hungry men waiting, speed is of the essence! Oh, last thing, this really did take a lot of extra milk. I'd guess I went with closer to a cup of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gnatilly05"
},
"reviewBody": "Made as directed - turned out delicious! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YumMonger"
},
"reviewBody": "Came out pretty good. I took some advice from other reviewers and added a bit more milk and sugar, not much though. Cake was still a little dry but good. If I make it again I'll add more flavor by mixing additional sugar and cinnamon into the batter itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "szath"
},
"reviewBody": "For years I've been searching for a recipe that would produce flaky coffee cake, not cakey cake. I tried all kinds of complicated recipes but was disappointed time and again. This recipe was perfect. We're trying to cut back on sugar so I used only 4T sugar in the batter (figuring the topping would make up for the less sweet cake). I also poured the butter over the topping mixture (I don't like the topping to be dry). It turned out perfect - sweet, flaky but moist. The whole family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoxStar"
},
"reviewBody": "Very good with a the adjustments suggested by B Spradley: Double the sugar. Add another 1/4 cup of milk. Mix melted butter with topping mix and drag through batter. \n\nI also sprinkled in a handful of walnuts. Delicious! Definitely a winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianne hennenfent"
},
"reviewBody": "I made a few modifications to this recipe because without them I thought it tasted like a box cake mix , so I added 2 tbsp rum, doubled the vanilla, added 6 tblsp brown sugar and a little more milk and an additional egg, fantastic and great for last minute company because it is so fast to make!!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/19093/quick-coffee-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/389/desserts/cakes/coffee-cake/",
"name": "Coffee Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/19093/quick-coffee-cake/",
"name": "Quick Coffee Cake"
}
}
]
}
}
, "about": [
]
}
]