				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick and Easy Hamburger Stroganoff"
,"datePublished": "2019-04-02T03:04:11.000-04:00"
,"dateModified": "2022-08-28T06:30:53.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Denny"
}
]
,"description": "This hamburger stroganoff recipe uses canned cream of mushroom soup and cream of chicken soup for an easy beef stroganoff to serve over egg noodles."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/puhCk0PXqzB2cIQVkfCyoXkk3Jw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3833903-quick-and-easy-hamburger-stroganoff-Amanda-Miller-Irby-4x3-1-b3b26be386474913b0433a4d88f5fead.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick and Easy Hamburger Stroganoff"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "281"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "655 kcal"
,"carbohydrateContent": "68 g"
,"cholesterolContent": "141 mg"
,"fiberContent": "4 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "1765 mg"
,"sugarContent": "5 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (16 ounce) package egg noodles",
"2 tablespoons butter",
"1 onion, chopped",
"1 pound ground beef",
"1 tablespoon all-purpose flour",
"1 (4.5 ounce) can sliced mushrooms, drained",
"1 tablespoon garlic salt",
"1 (10.5 ounce) can cream of mushroom soup (such as Campbell's®)",
"1 (10.5 ounce) can cream of chicken soup (such as Campbell's®)",
"1 cup sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes; drain."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, melt butter in a large skillet over medium-high heat. Sauté onion in hot butter until tender and translucent, about 5 minutes. Add ground beef in small chunks; cook and stir beef until browned and crumbly, 5 to 7 minutes."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle flour over beef mixture; cook and stir for 1 minute. Stir in mushrooms and garlic salt. Pour in mushroom soup and chicken soup; cook and stir until heated through, about 5 minutes. Stir in sour cream until smooth and heated through, 2 to 3 minutes more. Serve beef mixture over cooked egg noodles."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dBob_808"
},
"reviewBody": "This was easy to make and although not exactly a flavor explosion, a thoroughly satisfying comfort-food meal. I bet it will taste even better when reheated for leftovers so I'm looking forward to that. Thanks to the other commenters who suggested minced garlic instead of the powder and also the addition of some Worcestershire Sauce. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Schmid"
},
"reviewBody": "This is a great recipe quick and easy And I never use anything salt but I’ll use garlic but not garlic salt just keep that in mind nothing salt they can add there own"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine"
},
"reviewBody": "I make this frequently. I only gave it 4 stars because I make changes. I’m not a fan of onion pieces so I reduce the amount of diced onion and add onion powder to add the flavor. I use fresh garlic (1 clove diced) but would have no problem with garlic powder, I don’t use garlic salt because I like to control the saltiness in my dishes. I also use fresh sliced mushrooms and cook them with the onion and garlic. I add 2 tbsp of Worcester sauce before the flour, cause who makes stroganoff without it? I suggest tasting as you add any spices. This recipe can get pretty salty. I tend more towards pepper. I also add the sour cream after I turn off the heat so it doesn’t break. My family, including my picky autistic son, loves this dish! Oh, sometimes we feel spicy and will add siracha at the table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan Coffman"
},
"reviewBody": "I made this for dinner and everyone loved it. They cleaned their plates. Was simple to make, inexpensive. Will be making it again. I added a little salt and pepper towards the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandy Howard"
},
"reviewBody": "I loved the idea of how fast it took to make this. My only comment I have is it was a little bland. I added Worcestershire sauce, garlic, basil, and a little more salt and pepper. My husband is a picky eater and he liked it alright. I will try Italian sausage for more flavor next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tom Ward Sr"
},
"reviewBody": "It was pretty good I believe the frozen hamburger I had was less than a pound though however it didn’t seem to effect the taste only the color was lighter than the one shown with this recipe plus didn’t have garlic salt so I used garlic power and table salt instead and we added pepper to our individual servings. I would make it again 😊 We mixed what was left with the noodles for a easy warm up lunch or leftover dinner?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Moskal"
},
"reviewBody": "Holy cow yum!! My elderly dad said it was like his mom’s"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve been making a similar version of this recipe for over 35 years. Here’s my variation. I cook meat and onion at the same time, along with 1 Tablespoon fresh minced garlic. Upon adding the flour, I allow it to cook for about 3-5 minutes stirring frequently so it doesn’t burn. I find this helps the flavor. Then, I add the mushrooms. And cook another minute or so. Next, I add a can of cream of mushroom soup - no cream of mushroom - cooking for up to 10 minutes at a medium low temp. I then add a cup of sour cream (full fat if you want a richer flavor). Once that is mixtures thoroughly hot, I remove from heat and stir in 1 table if chopped Italian parsley. Then I serve it over noodles with a sprinkle of parsley on top. My family goes nuts over this every time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "H4rley Quinn78"
},
"reviewBody": "This was good but I wish I would've read some of the reviews before making it. This was WAY too salty!! Definitely don't put the full 1 TBS of garlic salt. If anything, add only 1/4 top garlic salt or use minced garlic. Other than that, it was pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Cagan-Teuber"
},
"reviewBody": "I never cook with ground beef. I always use ground turkey. That way, very little excess fat to drain or soak up with the flour. This is a wonderful recipe with the turkey and garlic powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Obviously a typo in the amount of garlic salt. I used a teaspoon. I also added a teaspoon of paprika and a half cup of beef broth, more for color than anything else, and a can of peas and carrots for a more complete meal. Looks better stirred, with a bit of chopped parsley. Not bad for a quick evening meal, which I believe lives up to the intent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BruceB"
},
"reviewBody": "Overly complicated. My Mother's recipe was to brown the hamburger, add a 4oz can of mushrooms drained (sliced or pieces),add a can's worth of sherry, cook until sherry has evaporated. Turn off heat. Mix in sour cream to taste and serve over either noodles or rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RDC"
},
"reviewBody": "This is a great recipe for something quick, easy, &amp; satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mrp1845"
},
"reviewBody": "I've been making Stroganoff for over 45 years. At first, I would use ground beef and added bacon cut into 1\" strips while browning the beef, and serve it over rice. As I got older, I began twinking the recipe. I switched to ground turkey and turkey bacon (no grease) and add the onions, and let brown. Lower the heat and add a can of [lite] cream of mushroom soup, add spices to taste, cover, and let simmer at a low heat for 10 minutes, stirring occasionally. Cook noodles/rice &amp; pre-heat over and prepare garlic bread. Finally, stir in [lite] 8-12 oz sour cream and enjoy. Now, instead of ground turkey, I use spicy turkey sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David"
},
"reviewBody": "I made this with Venison, heart healthy cream of mushroom and cream of chicken. I used 1 tsp garlic instead of garlic salt and light sour cream. Had to omit the mushrooms for my son and it needed a little more salt added at the table. I have to have black pepper in everything so the shaker was applied! Turned out pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yeow!!! Way too salty! Maybe that tablespoon should be a teaspoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie DeLara Pasipanki"
},
"reviewBody": "This is a really good base for stroganoff. I had to substitute gluten free soups for the cream of mushroom and the cream of chicken. We felt like it needed a bit more flavor, so I added a tablespoon of Worcestershire and a tablespoon of dijon mustard. I also used the liquid from the mushrooms to add the cornstarch (substituted for flour to keep it gluten free)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BIGDADDYWF"
},
"reviewBody": "Anyone with common sense will not add a TBSP of garlic salt. I split the TBSP half garlic salt, half garlic powder. While not too visually appealing it was tasty and I enjoyed it. No one was super crazy about it but said it is something they would eat again. I think when you are the one doing the cooking, you tend to rate it higher. Pretty simple to put together. I did have to thin the sauce a little so I used a couple splashes of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna M"
},
"reviewBody": "So glad to find this recipe. It was one of my favorites from a church cookbook over 40 years ago, and it got lost during a move. It is a little salty, so I use fresh garlic and add salt to taste. Otherwise I make it as written. My daughter grew up loving it and now my grandkids love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Osterhout"
},
"reviewBody": "I make this at least once a month since I found it!! I do add 2 tbsp. worcesteshire sauce &amp; about 1 soup can of milk to cover the pound of noodles, but it's an easy,(if not that healthy) comfort food for the Fam!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather Lynne Anderson"
},
"reviewBody": "My family found this ok. I used garlic powder as was suggested, but ended up adding garlic salt and worcestershire when we ate. It was very bland for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Centrailia"
},
"reviewBody": "First off let me start by saying I made it with a few changes. Instead of the chicken soup I used Cream of Broccoli. (didn't have chicken) The meat I used was left over roast and already seasoned so instead of the garlic salt I used garlic powder. I didn't bother with the flour because the dish is thick enough without it. Instead of noodles we used mashed potato's....yum, yum, and I added a bit of worchester sauce. The changes I made are not huge I honestly don't think it made a difference in the taste from the original. This is one recipe I will definitely make again, it is so easy and fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "Pretty good. I added a dash of Worcestershire sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LSinon"
},
"reviewBody": "I made it as is, and it was delicious! It was a bit salty though, so next time I will try with garlic powder instead of garlic salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristianBulkowski"
},
"reviewBody": "This recipe is low cost and tastes amazing. I'll admit I had two bowlfuls of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Naomi Gardner Shelton"
},
"reviewBody": "Too salty. I think the recipe should have called for 1 tsp of garlic salt instead of 1 tbsp. And why the cream of chicken soup, it makes it too white. Mine wasn’t brown lije the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howard Webster"
},
"reviewBody": "It turned great. Used garlic powder instead of garlic salt, fresh mushrooms, next time fresh garlic. Quick and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SRVCookie"
},
"reviewBody": "I’m known for my beef stroganoff from scratch. Honestly, I think this is a lot easier and tastes just as yummy and comforting. The little ones like this better too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mousielove"
},
"reviewBody": "I've made a version of this since 1967, when I learned to make this in school. To save on calories, use plain yogurt and 1 cup is more than enough - try 1/3 cup and see! I also add paprika."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Klan"
},
"reviewBody": "I make this usually in the winter...I simmer onion, garlic, and chopped celery And celery leaves in with the ground beef and mushrooms. I like Morton's Nature's Seasons.....doesn't need extra salt if u use this....I don't like alot of salt and this doesn't make it \"Salty \" but flavors nicely. Instead of chicken soup...I mix the mushroom soup with low sodium beef broth. Can also add a dash of gravymaster or beef bouillon. Then thicken it a little with cornstarch and broth.....or water....Very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "encore432"
},
"reviewBody": "Pretty bland, overall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristine Harris"
},
"reviewBody": "I love beef stroganoff and making it with hamburger was still great. Adding the mushrooms is a must if you like them. Next time I’ll add more onion and maybe some green onions for extra flavor and plate appeal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nop Chayabutr"
},
"reviewBody": "excellent and easy. used granulated garlic instead of garlic salt. mixed in some milk to thin it out. added only 3 Tbs sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Easy to eat, but the sour cream overpowers it. Also might need some salt actually as I replaced the garlic salt with minced garlic. I added some Worcestershire sauce too and overall was decent. Just not great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Hughes"
},
"reviewBody": "I didn't add mushrooms because my son hates them and used more ground beef than called for...but this recipe is easy and delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Smith"
},
"reviewBody": "Per recipe. Tasty . I'll make it again. Much better than boxed I've eaten for 20 years"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lillia Nielson"
},
"reviewBody": "Wonderful and easy, thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQ KM"
},
"reviewBody": "Amazing basic and quick recipe took 20 to 30 mins to make, a GRAND SLAM at home. I seasoned the ground beef well like I usually do to taste, added 1 can of water and 1 can of chicken broth in addition to the can soups, this cut the salt and thickness still leaving it creamy, added sour cream and black pepper to taste and added the 2 tablespoons of unsalted butter last for a richness to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Quick and yummy! used garlic powder instead of salt and added some worcestershire sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sean"
},
"reviewBody": "WAY TOO MUCH GARLIC SALT! The meal was very salty and ruined it. We didn’t care for the mushrooms and would go with cream of chicken only. The rest was fine. Just a bad recipe as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cp361"
},
"reviewBody": "Easy to through together with some leftover hamburger we had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Ann B"
},
"reviewBody": "I really wanted to like this, but it was just ok. Other reviewers said it was bland, so I made some adjustments with spices. I added minced garlic to the onions while browning. Then I added salt, pepper, Lawry's seasoned salt, and 3 dashes of Worcester sauce (as suggested by a reviewer). Do not add the flour. It was so thick I had to add 1 cup of milk to thin it down a bit. The cream of chicken soup ruined it. Use all cream of mushroom. Nothing helped. \n Hubby liked it though. I'll look for a better recipe, as I won't be making this again. Not to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "winterhexe616"
},
"reviewBody": "Delicious and so quick and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "It's ok. Do not need 1 Tbls. Gatlic salt. Way to much salt. Does not replace real stroganoff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cody Kwallek"
},
"reviewBody": "Amazing recipe for a quick dinner, and doesn't take too much time to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Swope"
},
"reviewBody": "Delicious! Only change was to use fresh mushrooms instead of canned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mocowgirl56"
},
"reviewBody": "I made no substitutions on this recipe it turned out fantastic! Tasty, easy, inexpensive and a fantastic comfort food! This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artist"
},
"reviewBody": "Recipe is best if made with good 80/20 fresh hamburger meat. I buy mine from Braums. I halved the recipe, using only the can of mushroom soup and no sliced mushrooms (I don’t like). A little too rich and I will decrease the sour cream to 1/3 cup next time. This recipe will become a staple on our menu. Simple, quick, economical and good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Stewart"
},
"reviewBody": "Loved it. I added some Worcestershire sauce just to pick it up a bit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sylvia Waters"
},
"reviewBody": "I'm cooking for 2 so omitted the cream of chicken soup. I also added garlic and this is a keeper recipe! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MJRice"
},
"reviewBody": "This is a really good recipe for a quick and easy stroganoff dish. The only changes I made were doubling the cream of mushroom soup, omitted the cream of chicken soup. I added a little Worcestershire sauce, ground mustard, and a cup of beef broth to thin it down a little. I simmered it for a while to reduce the moisture and added the sour cream. It ended up with a perfect consistency, and tasting awesome. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momcaja"
},
"reviewBody": "I have made this recipe many times! It has become a regular in our house!! Super easy and tasty!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kandy Prentice"
},
"reviewBody": "Great recipe! Thank You!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lenore"
},
"reviewBody": "Delicious and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandapanda"
},
"reviewBody": "I made this tonight, and my family just loved it. It was slightly salty, but very good. Would lower salt content by using garlic powder and salt to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryAnne Art"
},
"reviewBody": "The whole family said it was a \"Hit\". I substituted plain yogurt for the sour cream. Served with steamed broccoli ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mj Gray"
},
"reviewBody": "TRUELY IS QUICK AND EASY!!! GOOD &amp; CREAMY tasting. I did add almost another whole pound of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eric Bell"
},
"reviewBody": "Delicious. I’ll cut the garlic salt in half next time and add my favorite Chardonnay. Otherwise delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danna & Kevin Walter"
},
"reviewBody": "Turn out very good! Only added a bit of celery. Have plenty left and am going to freeze it. Will need to add possibly a bit of milk as i like it more wet. I would suggest to prepare the noodles later in the process, as they cooled down some. Thanks, this is very similar to an old college standby meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Summer Blake"
},
"reviewBody": "salty, so reduce that. Only had two cans of cream of chicken so it looks disgusting but is actually tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Taylor"
},
"reviewBody": "Excellent! Easy! I followed the recipe, but reduced the sour cream just a bit as a few people suggested. I omitted the flour because it was too thick and added a bit of milk to thin it some. Very tasty. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Silva"
},
"reviewBody": "The best simple beef stroganoff ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "I had to improvise because I didn’t have an onion. So instead I used Lipton dry soup (onion and mushroom) and added dry onion dip to the sour cream. Everyone liked it. (I didn’t add any spices since I figured the Lipton soup probably had enough)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed"
},
"reviewBody": "Tasty, easy to make, and quick. with two cans of soup, it was salty so next tie I’ll use garlic powder instead of garlic salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Marie Barnett"
},
"reviewBody": "Followed others advice and trained the hamburger and omitted the flour. I used minced garlic, two cans of cream of mushroom instead of cream of chicken, and fresh mushrooms. Great basic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "t7winMom"
},
"reviewBody": "It was easy &amp; delicious, *almost* as good as my mom’s recipe! I made this as directed, then after tasting (before the sour cream), it seemed a bit bland. I added 1.5 tsp salt, 1 Tablespoon black pepper (seems like a lot, but the sour cream mellows it), &amp; 5 shakes of Worcestershire sauce. PERFECTION!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandi"
},
"reviewBody": "I was a little concerned initially with using cream of mushroom and cream of chicken together, but I’ve used them together in other recipes and the dish has turned out great. So I decided to give it a try and I’m glad I did!! I really like this recipe!!\n\nCouple of things I changed for my own tastebuds though 1) I don’t like mushrooms, so I omitted them 2) I didn’t use garlic salt just because I’m pregnant and don’t need the extra salt and garlic salt tends to be vary salty! I did however, use a little kosher salt, fresh ground pepper and garlic powder while browning the hamburger 3) I doubled this recipe and used the family size cans of both soups. Worked like a charm! 4) I omitted the flour because I missed that step and honestly if I had a little milk (ran out this morning and forgot to get more before coming home) I would have added just a smidge to thin it out some. 5) I only used about 3/4 - 1 cup of sour cream (in a double recipe) because I’m not a huge sour cream fan. But hands down, this is the best stroganoff I’ve ever made!! I love it!!! Thanks for a great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jonk"
},
"reviewBody": "I used dry fried chanterelles, and elk burger. Served over rice one night and noodles the next. A great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Wideman Henry"
},
"reviewBody": "Good food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Carson-Wass"
},
"reviewBody": "This was amazing..... turned out great.... we added garlic powder instead of garlic salt....... think it would of been better with the garlic salt...... but all in all it was an amazing dish..... will definitely be making this again...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glynda Pool"
},
"reviewBody": "It was very thick so I added half a cup of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Nunyah"
},
"reviewBody": "Family LOVED this and it was so easy! I pretty much followed the recipe however I used rehydrated dried morel mushrooms pre sauteed in garlic salt and butter and used wild game burger. The sauce was a little thick as others stated so I added some of the water that the morels rehydrated it to thin it down. YUM! And so easy!! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allison Murphy Bass"
},
"reviewBody": "This is a easy and yummy recipe! I needed to use the ground beef in the fridge and I had all the ingredients on hand. Definitely a keeper recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Roth"
},
"reviewBody": "quick and easy. Kids loved to dip breadsticks in the sauce. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Howard"
},
"reviewBody": "Super easy recipe that's perfect for a weeknight. It's also inexpensive to make and fills up the whole family. The only thing I did different was ad a mixture of beef broth and soy to the ground beef but only because I was out of Worcestershire"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karenc"
},
"reviewBody": "Did not use fresh onion. Added 1/2 package of dry onion soup mix in with the canned soups. No flour needed. Will add fresh mushrooms next time I make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn"
},
"reviewBody": "Excellent! Only “change” is we doubled the mushrooms, because we like them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Marie"
},
"reviewBody": "Perfect 20 minute meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna"
},
"reviewBody": "Quick and easy to make and sooo delicious! Clean up was a breeze"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMAGNAH"
},
"reviewBody": "Very creamy. I have to be honest but when I make something like this I don't measure. I just throw stuff in. The only change I made was I used real garlic instead of powdered, otherwise I used all ingredients listed. Very, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cjwaggs"
},
"reviewBody": "Added a little extra garlic salt. Easy, quick and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juanita"
},
"reviewBody": "Very good kids loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodie"
},
"reviewBody": "Quick,easy &amp; delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Ayotte"
},
"reviewBody": "Will make again. Was Great. only cganged was a added a packet of brown gravy to the ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzybaker"
},
"reviewBody": "I made it without the extra mushrooms and the addition of the sour cream at the end, and it was still so good! \nI did add some frozen peas and corn, just for a little extra something to consume, and eye-appeal for my picky eater :) it worked! \nThe family enjoyed it, too. I didn’t salt the egg noodles enough when I was boiling them, but that was not the fault of the recipe, just a personal opinion. \nGreat, easy and fast recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Larson Rauch"
},
"reviewBody": "My picky eater had a second helping. Enough said!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick W-O"
},
"reviewBody": "This is by far one of the best hamburger stroganoffs that I've ever had. I followed the advice from other reviewers and used garlic powder instead of garlic salt. I also used very lean ground beef and drained the grease instead of adding flour. The sauce is definitely thick, but it's absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C.L. Nelson"
},
"reviewBody": "I have been cooking this delicious recipe for years. My husband always loves it. Garlic and salt should be added to taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janell"
},
"reviewBody": "Easy - and Very delicious!!! Even my picky 7 &amp; 4 year olds liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yankeegirl"
},
"reviewBody": "Have been making this for years. We love it, and friends that my kids bring home love it too. More than one Mom has called and asked for the recipe. So easy, and I always have the ingredients on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roy Darby"
},
"reviewBody": "Definitely quick and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty Hamilton"
},
"reviewBody": "I thought it was really good! Much better than the recipe I learned growing up! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Nagle"
},
"reviewBody": "This recipe has become a family favorite. I find this to be a quick week night dinner. I made the recipe as written. The only change I made was in the cooking order. I browned my drained, canned mushrooms in the butter first until they released moisture. I removed them to a plate. I browned the meat in the mushroom flavored butter, and continued as per the recipe. I have also made this using 2 cans of cream of mushroom soup. It is delicious too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is from the old red Betty Crocker cookbook I got as a wedding gift in 1972. It was one of the first recipes I ever made for my husband and has been a family favorite ever since. It uses ingredients we usually have on hand, Is hearty and quick to make. When I’m being “good” I make myself something else, as I lovingly referred to this as “cholesterol casserole”!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "america5151"
},
"reviewBody": "This is from the old red Betty Crocker cookbook I got as a wedding gift in 1972. It was one of the first recipes I ever made for my husband and has been a family favorite ever since. It uses ingredients we usually have on hand, Is hearty and quick to make. When I’m being “good” I make myself something else, as I lovingly referred to this as “cholesterol casserole”!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I added a half of can of beef broth, overall tasted good for an easy and quick meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Sills Stokes"
},
"reviewBody": "Very quick and easy. Very good flavor. A grest meal for bust families"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Stotter"
},
"reviewBody": "Really easy and delicious. Bit salty and realllly creamy (which is fine), so I’ll reduce the garlic salt a bit and cut down the sour cream a little next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "I’ve made this a thousands times without cream of chicken and thought, why not?\n\n‘Cause it’s chicken and hamburger, that’s why. It was disappointingly “chickeny” instead of the creamy dish I love, and yes, very salty even when using garlic powder. While I don’t mind cooking with condensed soups, this double whammy made it very...cafeteria-like. I’ll stick to only using cream of mushroom in the future."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/240773/quick-and-easy-hamburger-stroganoff/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17123/main-dish/beef/beef-stroganoff/",
"name": "Beef Stroganoff Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/240773/quick-and-easy-hamburger-stroganoff/",
"name": "Quick and Easy Hamburger Stroganoff"
}
}
]
}
}
, "about": [
]
}
]