				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick Gnocchi"
,"datePublished": "1999-02-08T20:10:21.000-05:00"
,"dateModified": "2022-07-14T16:18:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sandy Metzler"
,"url": "https://www.allrecipes.com/cook/24327952"
}
]
,"description": "Make tender, delicious gnocchi using instant mashed potatoes to slash prep time. Blend egg, salt, pepper, flour and mashed potatoes into a dough, cut into bite -size pieces and cook in boiling water. Serve with the sauce of your choice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/89sS-mNPlicXbO93wpeghxR2e44=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/454856-2e16027a2e4246ca80c8e199d32bbe61.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick Gnocchi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "492"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "462 kcal"
,"carbohydrateContent": "91 g"
,"cholesterolContent": "93 mg"
,"fiberContent": "4 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "1225 mg"
,"sugarContent": "1 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup dry potato flakes",
"1 cup boiling water",
"1 egg, beaten",
"1 teaspoon salt",
"0.125 teaspoon ground black pepper",
"1.5 cups all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place potato flakes in a medium-size bowl. Pour in boiling water; stir until blended. Let cool."
} ,{
"@type": "HowToStep"
,"text": "Stir in egg, salt, and pepper. Blend in enough flour to make a fairly stiff dough. Turn dough out on a well floured board. Knead lightly."
} ,{
"@type": "HowToStep"
,"text": "Divide dough in half. Shape each half into a long thin roll, the thickness of a breadstick. With a knife dipped in flour, cut into bite-size pieces."
} ,{
"@type": "HowToStep"
,"text": "Place a few gnocchi in boiling water. As the gnocchi rise to the top of the pot, remove them with a slotted spoon. Repeat until all are cooked."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These tasted like dumplings with no real potato flavor. I used Bob's Red Mill potato flakes which do not have any chemicals or additives. I added 1/2 tsp of garlic powder and needed only 1 cup of flour so I obviously did not overdo it with the flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just a great idea. It works--very good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Quick, easy and very tasty!! I love gnocchi, but it can be time consuming boiling the potatoes, draining, ricing, then mashing. I've been using this recipe for over 20 years when I just want Ted to make a quick batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Pretty good results. I double the recipe but in TOTAL doubling it i used 1 3/4 cups of flour, added a teaspoon of garlic powder, black pepper and a tablespoon of dried oregano also replaced the water with vegetable stock for added flavor. Curious if I could make it without the flour and substitute Pea Protein Powder. Thoughts?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephkurls"
},
"reviewBody": "I followed the suggestions made by others and added some seasoning - garlic, oregano, basil and cheese. I followed the rest of the recipe as written. I didn't use 1.5c of flour all at once but I’d say that I used that total by the time I was done kneading and rolling the pasta. Great and easy recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bgpalmer"
},
"reviewBody": "People need to get over their ideas of instant mashed potatoes. I make these with the name brand flavored potatoes. The package calls for 2 cups of water but I use a half cup less water and they are a better consistency. I used the garlic and parmesan flavor and my family loved them. I will try other flavors also. One of the easiest dishes ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Spear Niekerk"
},
"reviewBody": "Made with our 5 year old. Easy. Fun. And delicious! Wish I had taken an after pic but we all ate them up so quick. Will definitely make again and double the recipe. Didn’t have any left to try to freeze; maybe next time! Thanks for such an easy gnocchi recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David Devlin"
},
"reviewBody": "Recipe is fine. Mine tasted mashed potatoes. I think I didn’t put in enough flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Tumeo"
},
"reviewBody": "I’ve quick recipe. I used it in a chicken gnocchi soup and they worked great! These are sticky to work with and will stick together if improperly stored waiting to boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSIESKI"
},
"reviewBody": "My kids LOVE this and ask me to make it all the time! Nothing can beat true gnocchi made with potatoes, truffle oil, sage and butter. But - when you don't have time for that, this is a great option! I follow the recipe exactly, but will try adding some spices to the dough as recommended by others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeanT"
},
"reviewBody": "Excellent idea, very easy....I have a dairy allergy, so if you do as weel, be sure your instant potatoes are dairy free....some brands do have butter or mik incorporated into the flakes..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Champion"
},
"reviewBody": "Made this for the first time and followed the recipe, although quadrupled the batch due to my headcount. The kids were skeptical at first but wanted to help which sped things along. Adults and kids loved it! Served with a creamy pesto, which was perfect. I highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anita T"
},
"reviewBody": "I made this yesterday and was pleased with the results. I doubled the recipe so that I would have enough to freeze for another meal. I added the last cup of flour gradually, since I was concerned that the result would be too dry. The taste was very good. I have made ricotta gnocchi in the past, and prefer the lighter texture and flavor of the ricotta. But this version made with potatoes was tasty, and easy. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bourdie 1979"
},
"reviewBody": "so good. I think putting it in the fridge for 5 minutes after the dough process might make it a little easier to cut as mine were a little goofy shaped. also I threw some garlic in the water when i boiled. definitely added some flavour!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gail Herbest"
},
"reviewBody": "I made these this morning, reminds me of perogies in texture, the only taste that your going to have is with whatever sauce or seasoning you use, I am still trying to figure out why one reviewer said they were labour intensive, they are not. The thing that took the longest was waiting for the potato to cool down before adding the egg, they are super easy to make , I used only about a cup of flour and the rest I used to flour the board as needed for rolling, I gave them a 4 because of the ease, They would not be a favorite dish of mine but I would make them again if I needed a little something extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Lemerande"
},
"reviewBody": "First time making this! Went through reviews and took note... I doubled the batch and froze the 2 nd one freezing them on a cookie sheet first. I agree that you don’t need as much flour and mix it in slowly. I added Italian seasoning, garlic sat and pepper. They were super soft and delicious!!! I used a hamburger/ tomato sauce and it takes great. I will try a chicken/Alfredo sauce next time. Definitely recommend this as it is super easy to do and the results were fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "really quick and really yummy....use it all the time for chicken gnocchi soup....EVERYBODY luvs it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mastolzenbach6"
},
"reviewBody": "really quick and really yummy....use it all the time for chicken gnocchi soup....EVERYBODY luvs it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MY4KIDS"
},
"reviewBody": "This is very delicious. I am 100% Italian and I grew up eating homemade pastas. However, I was not as ambitious as my grandmother was so I usually bought my gnocchi frozen foods isle of my grocery store. I just recently decided to try my hand at homemade pasta making and I dove right in. I bought all sorts of pasta attachments for my Kitchenaid mixer and I became a homemade pasta making maniac. With all of the attachments that I have, I do not have one that makes gnocchi or cavatelli. I came across this recipe and decided to try it. I'm glad I did. It went together so very quickly. The hardest part was waiting for the instant potato and water mixture to cool. The rest was a breeze. They took about 8 minutes to start rising to the top of my boiling water but I think that it was because I cut them just a bit too big. But, boy, were they good....and filling! I served these with my grandmother's homemade tomato sauce and her homemade meatballs recipes. A little garlic bread on the side and MMM MMM good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Angel Lotus Song"
},
"reviewBody": "Wasn’t too thrilled on this one. The gnocchi itself was a bit bland. Also I’m not sure what I did but the dough was very difficult to work with. It was too soft and too dry at the same time. It was very hard to roll. Constantly felt it was going to fall apart while cutting. After it was done cooking the gnocchi itself was really soft. Too soft. Next time I’ll try making with actual potatoes instead of instant and try again. See if that makes the difference because my friend made me some homemade last week and it was so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tally"
},
"reviewBody": "Quick and super easy to make, used it in chicken gnocchi soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zackmania"
},
"reviewBody": "My grandmother would have had a heart attack if she knew I used instant potatoes, but it works. Made these for the family and they were in awe that we had fresh pasta, and I was happy that it wasn't labor intensive. Great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AllieM7"
},
"reviewBody": "Absolutely delicious and a much faster and simpler way to enjoy homemade gnocchi! It’s extremely hard for me to find gluten free gnocchi in stores, so now I can make it myself without all the extra mess and fuss. (I subbed Trader Joe’s gluten free all purpose flour using the same measurements and it turned out spectacularly). Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Fast and tasty, and like everyone else has said, if you didn't know there were boxed potatoes in there, you'd never guess it! Big fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "This was my first attempt at making homemade gnocchi. I did use homemade mashed potatoes because i had leftovers in the fridge. Overall they were super easy to make and delicious! My Italian mother-in-law who makes everything from scratch was thoroughly impressed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennawinborne"
},
"reviewBody": "Really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kichijoji"
},
"reviewBody": "I've never made gnocchi the long way, but this was a *very* simple and straightforward recipe! I will change a few things next time: 1) Gradually adding the flour in rather than all at once - it was really hard to get a uniform dough consistency otherwise. // 2) Rolling the dough way thinner than what I interpreted a breadstick to be; my gnocchi were almost doughnut-hole-sized (lol) // 3) Starting before I'm hungry - the recipe took closer to 1–1.5 hours than 15 minutes, for anyone who's about to try this for the first time. Really excited to tweak my approach and try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickersnickers "
},
"reviewBody": "I made mine egg free (using Ener G Egg Replacer) and it worked! Very impressive recipe! Super fast and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Pollick"
},
"reviewBody": "Love this recipe! I use it all the time in soups. It can resemble a dumpling (depending on how much flour you add) and makes a wonderful substitute for noodles or pasta because it holds up so well when reheated (even after being frozen!) My leftover pastas always get gummy and fall apart. I've never used it with sauce on top but I can definitely say that in soups and stews it's an awesome pasta substitute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moore"
},
"reviewBody": "excellent recipe! Will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I made it exactly as the recipe was written. Put them in a homemade chicken soup in place of my usual homemade noodles. Super quick and easy to make. I don't bother making special fork marks in them. Just roll em out in sticks, whack 'em in chunks, and throw them in. In soup I didn't bother to preboil them. I will make these again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JINOTEGA"
},
"reviewBody": "This was quick and easy. Not quite like real potato gnocchi but for the ease it was great. I used a package of dried potatoes with four cheese flavor. I think it may have been too strong. Maybe just garlic if I do this again. They weren't as chewy as I prefer. I only used one cup of flour, and I wonder if more would have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kevin"
},
"reviewBody": "This is a simple and delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "alexheyhihey"
},
"reviewBody": "Really unpleasant, dough-y, raw tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MJ"
},
"reviewBody": "I don't know if i made it wrong , but i found that this recipe took 2 hours to make, it was very labor intensive, and the results were less than impressive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Annie Rodkins González"
},
"reviewBody": "The gnocchi were much too tough. Also, it took quite a bit longer than the stated 15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ellie Baum"
},
"reviewBody": "They were a little bland and not as fluffy as I'd like them so next time I will change the shape and maybe replace salt with onion salt. Definitely easier than using potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheiberg"
},
"reviewBody": "This has been our go-to recipe! It's extremely inexpensive and tastes incredible. I've been pairing it with a rose sauce and bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gia Maria"
},
"reviewBody": "Since there is no leavening at all in this recipe, the gnocchi came out so dense and heavy that I had to pull them out of the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alexa Cox"
},
"reviewBody": "I made this, first time making them! I probably should have spiced them up a bit more but I did enjoy them however I can definitely taste the instant potatos"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BelisaMazzara"
},
"reviewBody": "I come from an italian family that makes gnocchi from scratch, so adding boxed mashed potatoes to the recipe was kind of hard to take. I am pleasantly surprised with the results! I made it all in the food processor adding spinach as well. Then I finished working the dough slighly more on the table with extra flour. It turned great! My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ree Green"
},
"reviewBody": "FANTASTIC. Simple. Followed the recipe precisely - I used a double steamer to keep them warm as I pulled them out of the pot in batches and threw a little olive oil in both pots to keep the pasta from sticking. DON'T follow the instant potato box. Stick to what is written here and you'll love the outcome. Made a nice meat marinara sauce with sliced sweet Italian sausage for them. Will be a keeper go-to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRIS13JOSEPH"
},
"reviewBody": "Very easy using dough hook on kitchenaid mixer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Howell"
},
"reviewBody": "3 tbsp cottage cheese. Instead of egg . I was out. Lol but turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theo Giamo"
},
"reviewBody": "These have to be in great Italian sauce with delicious meatballs.Very light and will not feel bloated after eating these. Loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "boo"
},
"reviewBody": "Tasty cook time varies in how large you cut them. Bi used a Rose sauce &amp; a little parmesan cheese to top it. Very nice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cmaya P"
},
"reviewBody": "So easy and so delicious! We made them and threw it right into the chicken and gnocchi soup on this site, even my 10 month old baby couldn't get enough of these! Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "John “JR” De Crotie"
},
"reviewBody": "If this had been slightly lighter it would have been a 5 so my 4 stars is more like a 4.5 \n\nI added extra cracked pepper and minced basil, and extra salt. following exactly they come out a bit heavy, but if you add a bit less flour and knead very quickly they come out fluffy.\n\noverall i loved this recipe. better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn Peterson"
},
"reviewBody": "Excellent! Been making this for years now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AOSWALT"
},
"reviewBody": "Loved loved loved this!!!! I used a sour cream and chive dried mashed potato flakes and it really made it good!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jake"
},
"reviewBody": "These came out really good after I changed the recipe and added a second cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Wolfe"
},
"reviewBody": "As I was adding the flour, I kept thinking that the amount couldn't be right, that it was way too much. I was wrong! It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsFisher0729"
},
"reviewBody": "Such a wonderful and quick way to make fresh gnocchi! We loved it and will make it again. Well written recipe with a delicious final product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rani Ness"
},
"reviewBody": "My family loved these quick gnocchi! It's so nice to hear that some Italian grandmothers out there 'cheat' this way too! - - - - - I smile with them when I enjoy these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Dellascio Bodisch"
},
"reviewBody": "Excellent recipe I added pesto gouda cheese to the potato mixture along with Italian seasonings as some suggested. Freeze the cheese and grate it in. Served with tomato cream sauce.Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eva Fridy Rector"
},
"reviewBody": "We have these alot, as I have never had any success making gnocchi from real potatoes, and I don't like store-bought. I had trouble the first few times with over-mixing the dough; I learned through trial and error to mix the ingredients until just combined, then dump the whole mess onto a floured board and \"squish\" it together with my hands until it can be rolled and cut. Too much flour is the kiss of death for gnocchi-better \nto leave them just a tad sticky rather than add too much flour and turn them into gluey little bricks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avocat"
},
"reviewBody": "I used less flour and added some Italian seasoning. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avocat"
},
"reviewBody": "I used less flour and added some Italian seasoning. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kymbrown1"
},
"reviewBody": "I eat tons of store bought gnocchi and the prices just went up dramatically so I wanted to give this a try. A lot of reviews talked about the texture...some said they were too doughy and some said they were too tough. I know to cook the gnocchi I buy you only need to allow them to float to get the dense chewy traditional texture but I actually prefer to boil them for a long time to get the fluffiest texture possible, most of the time. I found this recipe to actually be too soft and mushy, which is not the same. Also, many people commented on how bland these are but the ones I buy, all of them, are always really bland so I thought that was supposed to be the case so the gnocchi can be paired with pretty much any sauce flavor you like, kind of like couscous. I make everything from pesto sauce to cooking them in chicken broth and then using the broth to make a sauce so the starch from the pasta helps thicken the mixture. These were indeed very bland but that's how I like them. If I could figure out how to get the texture right, I would make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sai"
},
"reviewBody": "i tried to make gnocchi without the egg\nthe final product came out perfect\nenjoyed it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamaralynn"
},
"reviewBody": "Fantastic recipe!! Took me from start to finish 30 minutes to make with left over sauce. We like our gnocchi on the lighter side so only used 3/4 cup flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I must preface this review by saying I have never had gnocchi nor made it before. This is my first attempt. I must say that I like the end product although the process was a little confusing for me. I think the dough won't look like a bread dough but it would still work after you place it on a well floured surface. I think mine ended up a little tough because I kept kneading it and adding flour to it, expecting it to look like a bread dough..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyfoodie14"
},
"reviewBody": "OMG! I love gnocchi! This recipe is fast, simple, and delicious. Thank you for sharing. I made mine exactly as instructed with a creamy gorgonzola mushroom sauce, topped with grilled chicken. It was divine! Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwieberg"
},
"reviewBody": "These were great..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ali"
},
"reviewBody": "Very quick and convenient recipe. I hold back about 1/4 cup of flour per batch for dusting my rolling surface. It keeps the gnocchi from getting too floury and dense. What's also great is I can cut up any uncooked leftovers, put them on a parchment paper covered tray spaced so they don't touch, and freeze them for cooking another time. It makes the next time all that much faster. Cooks up beautifully from frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "samanda"
},
"reviewBody": "This was good! I know the purpose is \"quick\" gnocchi but we always like to have the ridges in our gnocchi - it's worth the extra time. As per other reviewers, we didnt use all the flour, added italian seasons and used a herb potato flakes for extra flavour. Yummy! Will be coming back to this recipe with the above updates."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alina Lounsberry"
},
"reviewBody": "The gnocchi was simple and easy to make... tasted good too..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "This is my second review of this recipe, mostly of the technique. I just made this for the second time, but this time I used some leftover potatoes I'd made last night (Sally's Spinach Mashed potatoes from this site). I wasn't sure if it would work because of the added ingredients in the potatoes. I warmed the leftovers a little to loosen them up, and following this recipe's proportions (adding the egg, and then the flour a little at a time once it neared the dough stage), it made awesome spinach gnocchi! I made it early in case it didn't come out, but I will serve this for dinner tonight with an Alfredo sauce. The upshot is--this recipe is fantastic and forgiving. Don't be afraid to play around with it. Thanks again for sharing, Sandy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Renee Harkless"
},
"reviewBody": "Very time consuming even when 2 people were doing it and it was very messy and tasted like u boiled mashed potatoes and but it in soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CURBKICKER"
},
"reviewBody": "This was great! Pretty quick, easy to cook and delicious. The only reason it got 4 stars was not everyone LOVED them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Honour Musuku"
},
"reviewBody": "This was pretty easy to make but the texture wasn't as dense as I would've liked it. Will try again and increase potato flake to flour ratio."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hiserodtm"
},
"reviewBody": "Awesome and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca H"
},
"reviewBody": "Great shortcut recipe for gnocchi! I followed the recipe almost exactly, except I just added flour as needed and have no idea how much I used (but probably less than 1.5 cups), and I incorporated some chopped fresh sage from my herb garden into the mix. Once cooked, I pan-fried them in some butter and more sage and they came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annabel Eyrick"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "milakegrl"
},
"reviewBody": "I loved this recipe! I love gnocchi-I've only had from restaurants. The thought of all the potato work scared me away from trying to make it at home so when I saw this recipe I thought I'd try it. SOOOOO glad I did! I only needed about half the four, I didn't use pepper and I added onion and garlic salt. My huband tried them first and said they were better than restaurant-I didn't believe him until I tried them myself-they ARE better!!! Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mellie65"
},
"reviewBody": "This was such an easy recipe. Made my first batch I doubled the recipe and added some parsley and garlic to give it some flavor and color. They came out so good I sauted them in butter and garlic added some fresh parsley and the juice of 2 lemons and some fresh parmesan cheese. Amazing!! I immediatly made 2 more double batches to share with friends. These are so awesome. Everyone loved them! Thanks for the recipe Sandy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ttreml3"
},
"reviewBody": "We made this vegan-style with egg replacer due to allergies, and it turned out great! We put it in the chicken gnocchi soup recipe on this site, and my kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libby Myrick"
},
"reviewBody": "Getting ready to try this. It said you could freeze them. Do you freeze after cooking or just the dough?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rxmichele"
},
"reviewBody": "So easy, and turned out great. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin DeYoung Bolt"
},
"reviewBody": "I love these! So simple to make and taste amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Fletcher"
},
"reviewBody": "easy to make and filling to eat! My family of 10 loves these with some spaghetti sauce and some parmesan cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "My family loved these. I used Idahoan brand and they were just as good as fresh. Even better for me because it took about 1/10th of the time I usually spend prepping fresh potatoes. Idahoan brand already has salt in their product, though, so taste before adding more salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molissa"
},
"reviewBody": "I loved the quickness of this recipe. I think I will add some parmesan cheese next time. I think it would be great with vodka sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WawaLee"
},
"reviewBody": "Family favorite now! The kids LOVE it and even suggested that we have pizza another night, when I said gnocchi was the plan today! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whitney Owens Hemsath"
},
"reviewBody": "I tried using potato beads (LDS cannery kind) instead of flakes and they turned out pretty tasty. I cut my salt down to 3/4 tsp because it seemed like a lot, and they were fine, though next time I'll try the full tsp. The only other change I made was the amt of flour. I only needed 1 cup of flour to get a stiff dough. 1 1/2 cups would have made them way too dense. I had some left over hunts spaghetti sauce, so I made a simple roux/white sauce, dumped in the hunts and some italian seasoning, and it was a pretty tasty improvised creamy tomato sauce, and was the perfect compliment to the gnocchi."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Phyllis Trinke Funk"
},
"reviewBody": "They turned out quite well, but the three star rating is because they were fairly bland. I imagine the flavor is supposed to come from the sauce. I will try them again and the next time will add a bit more spice. More pepper, a bit more salt and maybe some garlic powder as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Excellent. I used a Kitchen Aid mixer for this. I put 1 cup of flour,1/2 cup of parm cheese, some salt, pepper, a tad of onion powder, and cilantro flakes into the mixer bowl. I let these mix by themselves for a minute or two. I then boiled up a cup of water and added 1 cup of instant flakes to it. Mixed it really good and let it cool for a few minutes. I then dropped one egg into the mixer bowl, and then dropped the mashed potatoes into the mixer bowl. I let it mix on a low setting until it started to clump up and turn to a sticky dough. Take it out and then add and sprinkle as much flour to the dough ball as you need to get it to the desired consistency. I managed to get about 20 gnucchi pieces with this amount. I drop a small hand full into the boiling water, stir gently and let them boil for about 3 min. This makes them nice and firm but still easy to chew. I suppose if you let them boil for a shorter time they come out softer. Depends on what you prefer. I made a simple olive oil sauce with minced garlic, salt, pepper, and a small amount of hot pepper flakes and cooked them in the sauce for 2 min. Finally I topped with more parm. Came out perfect. I was cooking for two and we wish we made a little more. I would double the recipe and if the dough makes too much just freeze it for later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristalyn"
},
"reviewBody": "This was so good! I've will never go back to old-fashioned, real potato gnocchi. I made this recipe exactly, except I added 1/2 c. grated parmesan and 1/2 tsp. nutmeg. Because of that, I used slightly less flour than called for. Also, I made it about 8 hours in advance, refrigerated it, then rolled and cut it just before boiling it. I would completely recommend you try it! Just as good as real potatoes and 100 times better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EDever"
},
"reviewBody": "Super easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizlitchford"
},
"reviewBody": "Still really light and really good, even made with mashed potato flakes!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannie"
},
"reviewBody": "Thank you Sandy for this recipe.....We just finished up dinner and the Gnocchi was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AllisonJuliann"
},
"reviewBody": "Great, quick, and easy, cheap but sophisticated! Great with Paul Newman Sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wildcat02"
},
"reviewBody": "Made according to recipe - delish! Use a really tasty spaghetti sauce to spice it up! yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dreamwriter411"
},
"reviewBody": "So good, and so easy! Be sure to roll the gnocchi thin. I added seasonings to the dough, and served the gnocchi w/ sage brown butter. The best thing you can possibly do with instant mashed potatoes :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sayre C"
},
"reviewBody": "Made it with instant sweet potatoes to test out for a side for Thanksgiving. They were very light! I just did a browned butter sauce, but will use some gravy on them for Thanksgiving. My 3 and 5 year olds ate them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCGBishop"
},
"reviewBody": "This is great! It's still a bit of work, as working with dough always is, but it's worth it for fresh gnocchi! So delicious! I made a double recipe for my husband and I and we froze half of it... the serving size is about perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charliegirl"
},
"reviewBody": "Such an easy recipe. My daughter who is 5 had a great time making \"her\" pasta. She gobbled it up. I served it with a cheese sauce. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie Laird"
},
"reviewBody": "I love this recipe, i made a chicken soup with it a while ago and tonight im making noodles with recipe with cabbage, potatoes and dried beef mmm cant wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maureen Fipke"
},
"reviewBody": "I use leftover mashed potatoes and get a better texture to the Gnocchi, more like the real thing."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11760/quick-gnocchi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11760/quick-gnocchi/",
"name": "Quick Gnocchi"
}
}
]
}
}
, "about": [
]
}
]