				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick and Easy Tater Tot Casserole"
,"datePublished": "2019-10-26T00:46:08.000-04:00"
,"dateModified": "2022-07-14T18:15:57.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tammi"
,"url": "https://www.allrecipes.com/cook/24328702"
}
]
,"description": "This is a quick and easy tater tot casserole the whole family will love, especially those picky eaters!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fvXSyyHW93DdSBvP7rOdQrmSCnY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3107518-d2d98aaabe4c4c42a56b2df3f1a3512e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick and Easy Tater Tot Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "210"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "509 kcal"
,"carbohydrateContent": "47 g"
,"cholesterolContent": "62 mg"
,"fiberContent": "4 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "1385 mg"
,"sugarContent": "5 g"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound ground beef",
"1 pinch garlic powder",
"salt and pepper to taste",
"1 (32 ounce) package tater tots, thawed",
"1 (10.75 ounce) can condensed cream of mushroom soup",
"1 (10.75 ounce) can condensed cream of celery soup",
"1 (10.75 ounce) can milk",
"1 pinch garlic powder" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Crumble ground beef into a 9x13-inch baking pan. Sprinkle beef with garlic powder, salt, and pepper. Cover beef with tater tots."
} ,{
"@type": "HowToStep"
,"text": "In a bowl, stir together mushroom soup, celery soup, and milk. Pour the soup mixture over the tater tots and beef and sprinkle with additional garlic powder."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 60 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jay Thomas"
},
"reviewBody": "Many have been concerned that this recipe uses raw hamburger. The hamburger seems not to be done after cooking the amount of time according to the recipe. this is due to the hamburger being cooked anaerobically (without air.) This leaves the hamburger looking pink, but it is fully cooked. If you check the temperature and it is between 170 to 180 degrees, it's done. I add dried onion and garlic to the soup mixture. I also reverse the soup and the tater tots layers. We the tots to be browned and crunchy. I adjust when to add the tots so they don't burn. See the tater tot cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "Casseroles cooked using raw hamburg? There are a lot of recipes like that out there. At the very least, the hamburg should be super lean and the casserole should be tightly covered during most of the bake time. Safer to cook first and pour off fat. I did make this, but I used 85% lean hamburg, precooked it first and poured off the fat. Also added some chopped onion and garlic to the hamburg mixture. Was good, but I didn't make it exactly as written. This is supposed to be a quick dump and go recipe, but it doesn't work as written with raw meat, for safety reasons. Just my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i added velveeta cheese sliced up from block added french fried onions to top it was a hit at my home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SAMMY"
},
"reviewBody": "real fast and good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryan Coward"
},
"reviewBody": "I used frozen hash browns. It was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yvonne"
},
"reviewBody": "This was great but I followed reviewer's suggestions about cooking meat ahead and adding onions. I also used cream of chicken soup instead of celery and added a blip of dijon mustard, ketchup and worcheshire to the sauce. I used ground turkey and then cauliflower/broccoli tots for the topping. It came out good but kind of salty so I will look for ways to cut that down in the next meal. This did please two teen boys and their dad so for that I am grateful. It's hard to find a single dish that will make all of them happy. Me, I'm eating a salad, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I usually don’t make changes to a recipe when I make it, but felt the need to do so with this one. I browned the burger with 1/2 onion and a large clove of garlic. I then mixed the soups and milk with the burger. Not sure what was meant by a can of milk, so I used a can of evaporated milk. I put this mixture in bottom of casserole dish, then topped with an 8 ounce package of cheddar cheese. I layered the frozen bag of tater tots on top. Baked for one hour. The cheese is what made the casserole. Without it, this would of lacked flavor. Leftovers are good but tots get a bit mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LaurieL"
},
"reviewBody": "Made as directed added about a cup of shredded cheese before baking, then sprinkled crispy fried onions halfway through the bake time. Was tasty but too goopy. Next time will use just one can of soup and half can of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Christensen"
},
"reviewBody": "So great, family loved it. Cook meat first, I added onion and garlic and soup (used cream of chicken instead of cerlery) together. Topped with cheese and then tater tots. When almost done I added more cheese on top of tots. Served with sour cream. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "yvonne mp"
},
"reviewBody": "No changes. I found it a little bland , Maybe I will add a little more Taco sauce and some salt and pepper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan R "
},
"reviewBody": "I gave it 5 stars because I think it's a great dish and anytime I have made it everyone loved it. \n\nI was making this long before it was posted to this site. Most of the reviews are several years old and I don't know if and when people check the reviews. I just had some comments to make. Any recipe that you try should always be adaptable for your family. The ingredients in this recipe are just that and you should always season to your familys tastes. It only calls for a pinch of garlic powder. This makes a lot for no more seasoning than a little garlic powder and salt and pepper. I have gotten used to using onion and garlic powder since my husband doesn't like onion. I have to slip it in anytime I can and if he can't see it he doesn't know it's there. I have always cooked the meat before combining the ingredients. I also usually use more than one pound of ground meat since you are putting it in a 9X13 dish that isn't a lot of meat. It is much better if you season the meat but not with salt. I noticed someone commented on saltiness and I had that problem and learned to use the low sodium soups and WATCH the cheese because that adds salt also. You may want to try different kinds of cheese if you have a problem with saltiness.\n\nWhen I put it together I put the cooked, seasoned meat on the bottom and top that with some frozen mixed vegetables cover that with the soups mixed with the milk and sprinkle some cheese over the soup. Add the tater tots on top and I usual"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Pace"
},
"reviewBody": "My Family loves it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Patricia Hynoski"
},
"reviewBody": "I followed the recipe, no changes. It was too greasy since the ground beef cooks in the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cambria_Mae"
},
"reviewBody": "My family enjoyed this casserole, I added onions to the ground beef and topped it with cheddar cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave Lawlis"
},
"reviewBody": "Hmm....after reading several different recipes for this dish I'm beginning to wonder if the trailer park where my momma done raised me up was located in a parallel universe because we always added the meat to the pan raw (after combining it with dry french onion soup mix). In fact that's how I still make it. It always forms this wonderful/frightening solid sheet of more or less boiled meat that serves as a sturdy foundation for the more wobbly parts of the dish. And at 375 F I've never had a problem with the meat not getting cooked in under an hour. I know that any foodie would become apoplectic at the idea of not browning meat, but hey, it's a freaking casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betsy Barnhouse"
},
"reviewBody": "An easy dish to make, and I followed suggestions from top remarks. Kids loved it and will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "berger24"
},
"reviewBody": "I used ground chicken and a can of condensed cream of cheddar soup and a can of cream of mushroom. That's what I had on hand so it's what I used. Came out very yummy. I added my own roasted garlic seasoning to the meat and I cooked it before putting it in the pan and adding the tater tots to it . I also a couple of handfuls of sharp cheddar cheese to the mix of meat and soups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jodi24"
},
"reviewBody": "I liked it , I didn’t make any changes . I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "handc0208"
},
"reviewBody": "Really satisfying comfort food dinner! Couple of changes...didn't have the two cans of soup as I thought I did, so in addition to the one can of cream of chicken soup I had on hand, I improvised and added a can of cream corn. Actually, it gave the dish a nice added flavor! Also, I accidentally put the tots on before the cheese, but it worked out great anyway. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALTIMETER"
},
"reviewBody": "I made two 9x13 casseroles with the changes to the recipe. This was an excellent base recipe. We love veggies and did not want to have to serve any sides with this. So I ended up using the following: 1 lb ground beef and 1 lb ground turkey (both lean). Cooked and drained. I added the following veggies finely chopped, and sauteed (may look like a lot but veggies cook down quite a bit): 1 1/2 lb fresh spinach, 2 bunches green onions, 16 oz broccoli slaw, 16 oz fresh cauliflower, 2 green bell peppers, parsley, cilantro. Mixed meat and veggies together seasoned with cumin, garlic powder, chili powder, pepper, tiny bit of salt *even using the healthy request lower sodium soups it does have a lot of soduim already; as do the tots. \n\nFor the soupy mixture I used 2 cans of cream of mushroom, 1 can cream of celery and 3 cups milk, added handful of cheese. Layered bottom with sparse amount of tots, put meat/veggie mixure, poured some of the soupy mixture; covered with 2nd layer of sparse amount of tots, then put rest of soupy mixture on top. Baked at 375 for 40 minutes; added handful of cheese to the top, baked another 10 minutes. \n\nThe tots end up soaking up the soupy mixture, as did the meat/veggies. I did not have enough of the cream of whatever cans to follow the recipe exactly, that's why I increased the amount of milk. Also had to be sparse on the tots since I only had one bag. So incredibly delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Pongratz"
},
"reviewBody": "I made this for supper and it was great! I modfied it alittle. added to the top of the tater tots a can of green beans then the sauce and topped it with cheese. turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy;)"
},
"reviewBody": "Can I give this 6 stars ???? Wow this was good !!! I made a few changes and I know that's annoying when people do that but even without the changes I don't see how this could've been bad. Here's what I did: I cooked a pound of ground beef and layered it in a 9x13, then sprinkled with garlic and pepper (I had already salted while cooking), then I added I can each low fat cream of chicken and cream of mushroom, layered chopped green onions, shredded fat free cheddar cheese, and then tatertots and sprinkled them with salt and garlic, then added a thin layer of cheese and green onions on top. I cooked at 375 for 1 hr. The only thing I wasn't crazy about was that the cheese on top came our kind of crunchy instead of melty and I think that's due to the type of cheese I used. Maybe next time I won't use the fat free cheese on top.... and there will be a next time!!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Manda"
},
"reviewBody": "It was really good , you definitely have to brown the meat before adding it , and I used a can of the fiesta nacho cheese soup along with cream of mushroom and added a cup of sour cream it was a great alteration!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah Krueger Foerster"
},
"reviewBody": "I made many of the adjustments mentioned in the reviews with tremendous success. \n\nWhile eating the yummy goodness, one review I read came to mind over and over again, this person continued to find the dish exceedingly salty, even after many adjustments. My family realized the tator tots themselves could be the culprit. We don't eat them often so I think our palates are a bit more sensitive to their salt factor. Not sure how to remedy this other than try different brands of tator tots and cut back the salt all round.\n\nReally though, this is a fine recipe. Our son even asked to have some for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carol Price"
},
"reviewBody": "Made it exactly like the recipe. Very bland. Will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizzy Kesler-Hunter"
},
"reviewBody": "Followed the first most helpful review and family loved it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KrystalRose09"
},
"reviewBody": "Notes: do not thaw tator tots first. Cook the hamburger before putting in casserole dish. \nMix-in options:\nAdd veggies (French cut green beans) to soup mix. \nMix mushrooms in soup mix. \nSubstitute cream of celery for cream of chicken. \nTake out the hamburger or lessen it. \n6 oz Sour cream\n2 cups Corn flakes\nMore shredded cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HappyHuman"
},
"reviewBody": "Our tweaks were Montreal steak spice (along with garlic powder) on the beef, and cheddar cheese soup. My wife got home wanting comfort food and this fixed her right up. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Albright"
},
"reviewBody": "I added a sprinkle of Lawry's on the meat while it was cooking...just a dash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Endlalicia"
},
"reviewBody": "I agree with browning the hamburger meat as well. You have new cooks looking at this recipe and they wouldn't have known to brown the hamburger meat. This is the first time I've ever made this and I had no clue that you should have browned the meat first. You need to be more precise if your going to post recipes on the Internet. No Bueno"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsley01"
},
"reviewBody": "Absolutely Amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Bell King"
},
"reviewBody": "I couldn't add a pic fast enough, lol kids love it!!! added cheese at 30 min mark...may do 20 next time. overall great dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda Foley Babb"
},
"reviewBody": "I brown 1 1/2lbs of ground beef with an onion in a dutch oven. Drain. Add ground beef and onions back to dutch oven. Stir in 1 can of Beefy Mushroom soup and 1 can of Golden Mushroom soup. Mix it well with the ground beef. Add a layer of grated parm, a layer of shredded cheese (your choice) and top with tater tots. I set the oven to the temp for tater tots on bag. Bakes in 25 to 30 minutes. Quite tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DB"
},
"reviewBody": "I added garlic and onion while cooking the ground beef, and then added some bell pepper and broccoli near the end. I used a can of cream of celery and cream of chicken (what I had on hand) and put a little cheese on top before placing in the oven. (didn't use any garlic powder) It turned out super yummy, with lots of flavor! I put a little hot sauce on my piece for a little extra kick but it was good without it. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoneStarCanuck"
},
"reviewBody": "Good recipe, here is what i changed up and my three boys like it.\n\n1. Brown 75-80% lean ground beef in pan along with 1-3 cloves of crushed garlic (I use about 2 Tablespoons of pre-crushed squeeze garlic) - We love garlic! add a pinch of pepper.\n\n2. once brown, add 1 can of Campbell's Cream of Mushroom soup (10oz or about that size).\n\n3. add about 1tsp of Worchester sauce, 2tsp of Heinz Ketchup, 1/4 cup of milk, 1 cup of shredded mild cheddar (or Mexican blend) we like Sargento because it is real :), stir everything.\n\n4. add about 1-2 cups of frozen corn or other veggies, we like corn because it is not green :)\n\n5. put it all in a 9x13 pan layer on tater tots\n\n6. I convection bake for 25 minutes at 400-425\n\n7. take it out and add a layer of cheese then put back in oven for 2-4 minutes to late the cheese melt and form a layer (1-2 cups of cheese\n\n8. Let cool on counter for a 5-15 then serve. we like Garlic toast to go with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Parker Manchee"
},
"reviewBody": "Family Staple!!! My sons favorite dish! You can use chopped chicken instead of beef, or even sage sausage (especially at breakfast). Yummy no matter how you cook it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kisavirgo"
},
"reviewBody": "I added fresh mushrooms and about a teaspoon of minced (in the jar) garlic to my meat and onion. I think it can do without the cheese to save calories. I used a 8x10 casserole dish and used about 1/3 of a bag of tots. Oh and i added a layer of frozen peas. This is a very good comfort food kind of meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ironchefnot"
},
"reviewBody": "yes but traded cream of chicken for mushroom very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBY"
},
"reviewBody": "This is a very good recipe. the only difference I do occasionally is add 1 jar gravy (or homade if I happen to have it) for one of the cans of soup. YUM!!!! Plus I add a small bag of frozen veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi Lori"
},
"reviewBody": "Yum! You gotta try subbing Cheddar Cheese or Nacho Cheese Soup instead of one of the other soups! Amazing! I did add some chopped onion and garlic while browning the meat and added a layer of frozen mixed vegetables and instead cooked on 400 degrees for 30 minutes and the taters browned nice and crispy. I didn't understand why it needed to cook for 1 hour when the only thing that needed to cook were the Tater Tots? Tossed a handful of shredded mexican cheese on top! I let everyone season with a seasoned salt &amp; pepper blend at the table for their own taste. I added a photo of the glorious outcome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen Bear"
},
"reviewBody": "It was awesome! Mixed everything in the skillet with the cooked ground venison and then added 1/2 cup mild cheddar to the mix and after baked for only 20 minutes, adding more mild cheddar on top for 3 minutes until melted. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pansy77th"
},
"reviewBody": "Really Enjoyed this... \nI hate mushroom soup so I just added 2 cans of cream of chicken soup and 1 cup milk in bowl... Added COOKED beef... Mixed well and added it to pan.. Added a layer of cheese on top.. Topped with tator tots and a few sprinkles of cheese...\nBaked @ 375 for 60 min..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tsend"
},
"reviewBody": "My family loved this. After reading other reviews...I added chopped onion when browning the meat, changed the cream of celery soup to another cream of mushroom(that is what I had on hand), and I have no idea how much tater tots I used because I had a huge bag from Sam's Club and so I just covered the top. I didn't stir the tots into it so they were still crunchy which we all loved the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KristenFromVegas"
},
"reviewBody": "This is a great base recipe. I made a few tweaks to the original. I added chopped onion to the ground beef and seasoned them really well with kosher salt, pepper, onion powder and garlic powder. I also layered in a bag of mixed frozen veggies and used cream of chicken soup instead of cream of celery. I skipped the can of condensed cream to have a thicker sauce. You also don't need to thaw the tater tots beforehand. With an hour cook time they'll be plenty hot when they come out. My super picky husband loved this dish and had three helpings. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vicki"
},
"reviewBody": "oh we all love this...i live alone and when i make it the nieces and nephews want to know lol ...i do add a tsp of soy sauce to the soup mixture..and put shredded cheese on top during the last 5 mins of cooking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather L Ten Eyck"
},
"reviewBody": "My family LOVED this! I did make adjustments. My family doesn't like garlic so I left it out. I used ground chuck. Browned it first, then blotted out the grease on paper towels. I then mixed the meat with 1 can condensed cream of CHICKEN and 1 can condensed cream of CELERY soup in the bottom of my casserole dish (I didn't want to thin out my sauce so I didn't use milk). I added one can, drained, corn, spread around. I sprinkled on 1.5 cups shredded cheddar. Then I arranged a bag of EXTRA CRISPY tater tots on TOP of everything. Don't pour the soups over the tater tots unless you are going for shepherd's pie/soggy tots! Cooked for 40 minutes and then added 1 cup shredded cheddar on top of casserole over the tots. Cook for 20 more minutes. The only thing I would do differently next time is use one of the cans low sodium soup bc it was a bit salty. This casserole was WONDERFUL!!! Tried this again, but wanted less salty. Didn't have reduced sodium soups, so I used half can on CC. Didn't help enough. I will leave out altogether next time and MAYBE add a 1/4-1/2 can milk. I also wanted crispier cheese/tators so when I added the extra/topping cheese, I increased oven temp to 425. Added FF onions to a portion for kids durning last 5 minutes. The tots and cheese topping were crispy and AMAZING!! Disappointed at the saltiness still. Will work on that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JKHummel"
},
"reviewBody": "Tater tots should be the last thing added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Romayne Grassel"
},
"reviewBody": "I was weary of the ingredients, but after reading all the reviews, I had to go for it.... Especially with all of my super picky eaters. But our family of 8 loved it. I followed the first reviewers recipe and it turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "I basically did the same thing as \"Heatherina\" (but added some blanched peas) and this dish was perfection! Nothing better than meat, potatoes and cheese. Great comfort food. The kids love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schmooiewho1"
},
"reviewBody": "This is a great recipe. I added corn to it and omitted the garlic powder (didn't have any) . I also browned the hamburger with half an onion before mixing ing. together. So comforting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "All in all it was a pretty good dish. I took into some consideration the reviews of others, instead of milk, added a cream of chicken also. Browned the hamburger meat beforehand and also seasoned it with garlic and onion. I also added a can of Rotel with added cilantro to it and cheese in the last 10 minutes. Family liked it also. Great recipe if you buy too many tots :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kittypodz"
},
"reviewBody": "I used 85% lean beef, and this dish came out really greasy. Next time I'll be sure to use a lot leaner beef. I also halved the recipe, but instead of using only half of each can of soup, I used the whole can of cream of celery and half the can of cream of mushroom. I mixed it into the beef, instead or pouring it over the top. It came out very good, despite the grease!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanwrap"
},
"reviewBody": "I've made this casserole about a hundred times, and with a few different variations. I used to use the Breakfast tater-tots, and with great success... but I found the small regular hashbrowns work really well, cause you can mix it with the soup base and really blend the flavours. It makes for great leftovers, and amazing for families. I like the cream of mushroom but I actually have better results with cream of chicken and celery. And I add a bit of corn too for extra flavour. Happy Cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHEFEEYORE"
},
"reviewBody": "This is similar to a recipe I always used but couldn't find mine but once I seen most of it I could recall where I added or changed.\n\nBest thing to do is season your ground beef while it is in the browning processing. Add salt, pepper, onions, green peppers, and 1/2 Tbsp of minced garlic (or use the 1st pinch of Garlic Powder).\nBeginner Cooks use minced garlic left it tends to burn quick in a hot pan and leave a bitter taste.\n \nAdding a package (2 cup size pkg) of Shredded Cheddar Cheese (or your choice type shredded cheese) is a MUST. \nI also mix the tater tots, hamburger, soups, seasonings of choice, 1/2 to 3/4 the pkg (1-1 1/2 cup) of shredded cheese and milk in bowl til the tots are coated then place in the baking pan and top with remaining shredded cheese the last 20 minutes of the baking time.\n\nFor Health Nuts or Low Sodium version:\nUse Ground Chuck (at least a 90/10) or you can use a lean meat like ground chicken or ground turkey. I use Sea Salt vs table salt when cooking. This way I use half the amount of sea salt vs when using regular table salt. Cream of Mushroom &amp; Celery soups I get the Healthy Request or Low/Less Sodium versions. I also use skim milk with my cooking. (You can always add more salt to your taste level but you can't take it out.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "James Luvaas"
},
"reviewBody": "Used cream of mushromm and chicken, 2% milk and bag of mixed veggy's. Veggy's was the best flavor it had. Added more salt and pepper wasn't bad. It wasn't the best, but not bad either. Will make again with added spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DMS2010"
},
"reviewBody": "Seriously? The Recipe is lacking the cook and drain part - maybe u know to cook it bc you had had it before somewhere? Who knows but I don't necessarily think it's cooking 101"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DSSAND"
},
"reviewBody": "I did cream of chicken instead of celery. I also added 1 cup of sour cream. I added a cup of shredded white cheddar cheese during the last fewm minutes of baking. (A WISCONSIN THING). Then at the end of baking we broiled for about 4 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "speeddemon"
},
"reviewBody": "My family loves this dish. I did omit the cream of mushroom and cream of celery to cream of chicken, no milk, added frozen corn and shredded cheese. Tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna Holmes"
},
"reviewBody": "Hubby and I loved it, just a basic yummy hotdish. Cream of celery is a nice touch I would not have thought of to use in a hotdish. We also did beef and ground pork for a nice extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harmqueen"
},
"reviewBody": "I made this with cubed ham that I browned with celery, onions, and the garlic. I also used unthawed extra crispy tater tots and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMP"
},
"reviewBody": "My husband says excellent! I used 1 can cream of chicken and 1 can cream of mushroom soup instead of celery. I used 1 cup of 2% milk instead of canned milk. And I followed others recommendations and added shredded cheese. Absolutely delicious! Perfect meal for a cold winter day..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CookinB"
},
"reviewBody": "This is a cheap meal, not classy, not that great. I think I always use too much of something because my tots are always soggy. I will keep making it, because it's cheap and I like tater tots. Ketchup make it better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nadine254"
},
"reviewBody": "very good. I used cream of chicken and cream of mushroom, mixed it with the ground beef and the seasonings then added the cheese and the frozen tater tots. The whole family loves this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Robbins"
},
"reviewBody": "For an extremely easy recipe, it has an extremely good taste! I use two cans of mushroom soup instead of using the cream of celery. I love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "crystalcooks"
},
"reviewBody": "Not to our taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Britt"
},
"reviewBody": "very good family loves this one did make some changes cooked hambuger with salt ,pepper, and diced ongin used 1 can of cream of mushroom soup and 1 can of cream of chicken with 1 cup of 2% milk blened the soups and milk together then added to beef when it was done put the tater tots on frozen waited till almost done turned on the broil to get the tots crespy the added the cheese and some bacon bit and let it melt served with green beans and a dolop of sour cream yummy even my boyfriend who is more picky than my kids loved it so I know it was a winner tonight"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "fuentec"
},
"reviewBody": "I thought this receipe was ok. Fortunately, My kids love tater tots and LOVED this recipe. I added fresh green beans and shredded monterey cheese. The onion cooked in the ground beef definitely makes a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktm"
},
"reviewBody": "Easy &amp; great !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Schleicher"
},
"reviewBody": "Easy and Excellent!! I used ground turkey cooked with chopped onion, added chopped garlic (from the jar - 1 tsp), used seasoned tater tots, and sprinkled french fried onions over meat before adding tater tots and liquid mixture. Ate with frozen peas and family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise"
},
"reviewBody": "I combined this and another recipe and it turned out great. All I did was add one small bag of frozen mixed vegetables, 3/4 cup shredded cheese and leftover meatloaf. It was filling, tasty and different."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "All men love this recipe! I add shredded cheddar and make layers, tater tots, cheese, meat then cover with soup mix, layer again, bake and then cover with cheese on top at last 10min. So easy to make and always a crowd pleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rudy"
},
"reviewBody": "family love it... will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~*Brandy Lee*~"
},
"reviewBody": "Good base recipe. With some adjustments it came out to be a great kid-friendly casserole. I used ground turkey instead and cooked with minced garlic and a diced onion. After draining, I added both soups and milk to the mixture along with some frozen mixed veggies (steamfresh halfway cooked) added the pepper and some italian seasoning. Put mixture in baking dish and covered with frozen tots. Baked for a bit then added shredded cheddar and some more italian seasoning. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Meehan Westenberg"
},
"reviewBody": "Funny, I've been making a similar version of this for years, and I have never browned the meat first. I cook it for 1h15m at 350 and a meat thermometer shows the meat is well over the 165 degrees it needs to be. I don't know why you need to cook it so long if you have already cooked the meat. I'll continue not browning it - why the extra step and dishes? Just thought I would share that it definitely works, a 350 degree oven will cook it for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StephieBoo"
},
"reviewBody": "I just made this for the first time but have always loved tater tot casserole. At first when I poured the sauce over it didn't seem like there was a whole lot and also the meat didn't fully cover the bottom like on the sides but I think in the end it was fine. I put green beans in mine but might try it with peas next time, didn't care too much for green beans in it. Also if I would have been more prepared I would have sprinkled more cheese on top as I only had a little left I think it would have made it better. I didn't leave it in for the full hour but probably should have, I think the tater tots would taste better if they were more crispy. I love this recipe though it's easy to make and doesn't take long at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "breezyd15"
},
"reviewBody": "4 Stars based on the fact that this is a great starter recipe. A few extra steps and I never new how good tater tot casserole could be!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty"
},
"reviewBody": "I can't believe some people didn't brown the hamburger first. Common sense! This recipe is wonderful and very kid friendly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KitchenHazard"
},
"reviewBody": "I really like this recipe for its ease. I also appreciate that it can be changed easily. I like to add garlic, onion, salt, pepper, and a little bit of cumin to the ground beef while I'm browning it. I also add cheese and a mix of veggies. We've also done it with turkey or chicken, using broccoli and carrots for the veggies....very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHEREEB"
},
"reviewBody": "this is always a winner with everyone in our family....they eat it all up.....i do add onion to the ground beef when browning and I also put a layer of cheese on top of the ground beef as my family loves cheese ...one other thing after pouring the soup mixture over the tater tots, I make sure and shake the the pan to get the mixture to go down in the casserole.....thanks for recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "anw506"
},
"reviewBody": "I thought this was a decent basic recipe for Tater Tot Casserole but I enhanced a little. I seasoned my hamburger with a chopped onion, pepper and salt. Instead of cream of celery, I do cheddar cheese soup. Instead of milk, I do 1/2 cup sour cream. I also include 2 cups of shredded cheddar cheese. I then combine my hamburger, soups, sour cream, 1/3 of my cheese and add seasoning salt, pepper and garlic powder. I put my tater tots on the bottom of a greased 13x9 pan and put 1/3 of the cheese over the tater tots and then layer my beef mixture and put the remaining 1/3 cheese on top. I bake at 350 degrees for 45 minutes to 1 hr or until cheese is bubbly and lightly browned on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Cruitt Bricker"
},
"reviewBody": "Like others before me suggested, I cooked the hamburger first, used cream of chicken instead of celery and put one cup of shredded cheddar cheese on top of the meat/soup mixture before adding tater tots to the top. The biggest addition I made to this recipe is that I used a packet of Lipton Onion Soup mix to the meat and soup mixture to give all the flavor we needed! We really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "char"
},
"reviewBody": "this recipe was okay. I added onion,celery,can of green beans and some shredded carrot to the meat mixture. I think it was still too much potatoe. I think next time I will add less amount of tater tots and more cheese on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LoveMy3Boys"
},
"reviewBody": "It was edible which is the best thing I can really say about this. The flavor wasn't bad but I did not like the texture, really it was a mess of beef and soup topped with cheese and soggy tots. Dont know what I expected with the recipe but it was more than I got."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Hopkins Fitzherbert"
},
"reviewBody": "I have made this recipe a number of times. I agree with other reviewers that it is a little bland but I notch up the garlic (I LOVE garlic) add onion and yes I brown the meat first. I use ground turkey and low fat cream of mushroom and chicken soup and just fill one of the cans with skim milk to add to the mix. My husband, who has issues with spicy and tomato based food really likes this one. I thought of putting veggies in the dish as others have done but I think I like it with a veggie on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda J Brown"
},
"reviewBody": "I have made a version of this recipe for years. My kids and I love it although my husband is not a fan. The only change I make is that I cook the casserole and when the tater tots look almost completely done I take out the casserole, layer with sliced cheese and cook approximately 5 minutes or until the cheese is melted. It is super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie Joy"
},
"reviewBody": "I totally followed Heatherina's review and it was a 5 star! Yum!! =) Thanks Heather for the tips! The cheese makes it so much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chuckg"
},
"reviewBody": "the reviews are wrong. You don't have to cook the meat 1st. Also I added another 1/2lb. of ground beef and a can of cream of chicken. Extra garlic is always good, and tons of shredded cheese on top about 10 minutes before its done. Very versatile recipe. I add Chili beans under the tots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brooketriestocook"
},
"reviewBody": "This is a really good recipe; however, I added cheese and a bit more garlic powder than what it called for. I would also suggest adding onion as the other users have said. Also, the tots do not need to be thawed - mine were not and turned out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mary"
},
"reviewBody": "I made this for our monthly church soup kitchen I adjusted the recipe to feed 120 people. This was perfect...everyone loved it..great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "Because this recipe is on the bland side, I can see this being very kid friendly, but for our tastes I needed to punch this up. I took the advice from others by adding onion, lots more seasonings, green beans, cheese and even fried onions. And yes, I did indeed brown the meat. Still I found the dish to be just fair at best, however, it was eaten so I've no complaints. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "I like this recipe. It's versatile and easy. Do brown the meat before baking. My own variation to this recipe includes switching the mushroom soup for celery soup (I'm not a fan of shrooms at all) and adding 8 oz light sour cream for some tang along with the garlic powder. I also salt and pepper the meat while browning it for some additional spice. You could add a pinch of onion powder, too, if you wanted. I think next time I'll add some vegetables to the mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angala"
},
"reviewBody": "I usually read the reviews before making anything, but today I didnt. It crossed my mind to brown the meat first but I thought since it doesnt say too in the recipe-then I would be fine, It actually came out just right. I used turkey meat instead and a used alot of garlic powder and added onions, oh i also put cheddar cheese on top. The tater tots are kinda soggy. not as crunchy as i would of liked, but i will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NewCookie"
},
"reviewBody": "I added a few more seasonings,browned the meat first and added cheese. I got mixed reviews from my family.One person added ketchup and the other just ate it. But I thought it was ok. probably wont make it again but it was easy and worth a try&gt;&gt;&gt;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sequoia183"
},
"reviewBody": "We really like this recipe, add a bit of cheese and a bit of onion but that is it! (oh yea, I BROWN the meat also)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPRUCHNIC"
},
"reviewBody": "Made minor changes but was a hit with the family!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Green Witch"
},
"reviewBody": "This is a recipe that has been so common since I was a kid that it didn't occur to me people hadn't heard of it. Maybe it's the Minnesota hotdish thing! The way we make it is to brown the hamburger first in a skillet, then crumble into a 9x9 inch pan for every pound of hamburger. Layer 1 can of cream of mushroom soup over the hamburger, than a vegetable (most commonly used is orn or a vegetable blend) than you only have to bake in the oven for as long as it takes the tater tots to brown. Cheese is good on it but that was never added when I was a kid. I like to throw some feta in after its done. One thing to remember is that if you double the hamburger, double the soup, veggies, etc. Easy and REALLY good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn"
},
"reviewBody": "My families favorite dish. Cheap, easy, and delicious. Many different ways to jazz up. But this recipe is perfect. Great dish that both kids and adults will ask for more. Good reheated as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billy's Mommy"
},
"reviewBody": "The recipe is by far my famlies favorite recipe for tater tot casserole! Even my picky husband loves it. The garlic is a wonderful touch. The meat does not need to be browned first as it would get over cooked. Perfect! Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Godiva4280"
},
"reviewBody": "I might suggest using a few less tots"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24520/quick-and-easy-tater-tot-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
"name": "Vegetable"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17661/main-dish/casseroles/vegetable/tater-tots/",
"name": "Tater Tots&uml;"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24520/quick-and-easy-tater-tot-casserole/",
"name": "Quick and Easy Tater Tot Casserole"
}
}
]
}
}
, "about": [
]
}
]