				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Quick and Easy Shrimp Scampi"
,"datePublished": "1999-07-20T10:49:16.000-04:00"
,"dateModified": "2022-07-14T16:05:08.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ching"
,"url": "https://www.allrecipes.com/cook/24322104"
}
]
,"description": "A delicious and quick way to enjoy shrimp - even on a busy weeknight!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/d1AOWqvQVGJKpooz_JhqS2_rRHc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/805024-957d73d970114bae9a81031573a8b700.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Quick and Easy Shrimp Scampi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "198"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "892 kcal"
,"carbohydrateContent": "108 g"
,"cholesterolContent": "203 mg"
,"fiberContent": "6 g"
,"proteinContent": "43 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "456 mg"
,"sugarContent": "6 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"1 pound linguini pasta",
"0.25 cup butter",
"5 cloves garlic, minced",
"1 pound medium shrimp - peeled and deveined",
"1 cup bread crumbs",
"0.5 cup white wine",
"1 lemon, juiced",
"0.25 cup light olive oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of salted water to a boil, add pasta, and cook until al dente. Drain pasta, and set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large skillet, melt butter over medium heat. Add most of the garlic, keeping some for later. Coat the garlic completely with butter. Do not let the garlic brown. Add shrimp, and toss to coat. Immediately remove pan from heat; shrimp will not be cooked yet."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle the shrimp with breadcrumbs (enough to coat the shrimp), and transfer the entire mixture to a medium casserole dish. Pour wine and the lemon juice over the shrimp. Cover, and bake at 350 degrees F (175 degrees C) for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove cover, and bake an additional 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "In a small saucepan heat olive oil with remaining garlic. Toss the pasta with the olive oil and garlic mixture. Serve the shrimp over the pasta with additional lemon slices on the side."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti Marie"
},
"reviewBody": "Absolutely delicious, and easy to make. The only thing I would change is add a little more butter and wine or use less bread crumbs. It was a very enjoyable dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "MPEBLE"
},
"reviewBody": "This didn't turn out well for me. Far too much breadcrumbs. Maybe it would've worked had I spread the shrimp out on a cookie sheet and broiled them. As it was, the breadcrumbs made a paste and stole all the flavor away from the shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jeanine Nichols"
},
"reviewBody": "Followed the recipe. My family really didn't like it . I want to make it again but will definitely leave out the wine and just sprinkle breadcrumbs lightly. At the end to get the crust on it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy T."
},
"reviewBody": "This was a very tasty, fast, and easy dish! I followed the advice of one reviewer who said to cut back on the breadcrumbs. Good advice, because typically I haven’t seen a lot of Scampi recipes calling for breadcrumbs anyway. They were a good addition however because a little amount added body to the sauce. I also cut back on the pasta and did 1/2 lb like was suggested, also a good call. I didn’t cut back on the garlic though, because we’re garlic lovers and to me, there’s no such thing as too much garlic. I added some green onions and basil to the sauce while cooking and I cut back a few minutes of cooking time in the oven. Glad I did, they were cooked just right! The olive oil and garlic added to the pasta before adding the shrimp was a nice touch. I’ll make this one again and not cut back on the lemon as much. Or just add more to taste after plating the pasta along with some green onions on top. Great recipe! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Longo"
},
"reviewBody": "Fast &amp; very easy! My first attempt at scampi. I will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana Hickman"
},
"reviewBody": "12/31/19 - Followed the ingredients list (doubled the sauce) but cooked shrimp on stove top, was very good fresh. I'm not sure how it will heat up as leftovers but the initial recipe is great as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ccnc513"
},
"reviewBody": "Good flavor but way too many bread crumbs. It would also do well without the pasta and olive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sanja"
},
"reviewBody": "I’ve made this for my family twice and they loved it each time. I substituted chicken broth for wine as someone else recommended and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Alex"
},
"reviewBody": "This was the bomb! My family loved it and it was super-simple to make. I adjusted the recipe by using jasmine rice as the bed instead of linguini. I also added a couple of extra of garlic cloves and completely eliminated step 6 as the extra oil and garlic was unnecessary since there was plenty of liquid to flavor the rice. It was superb! I will be making this again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wilma Shirling"
},
"reviewBody": "This was good. I did a half lb of fresh shrimp, garlic and a half, same wine, less lemon juice. For the bread crumbs, i mixed mmm small bowl of panko with non salt seasoning. Lemon pepper, garlic powder the shrimp got lemon pepper and old bay. Did the butter garlic in a cast iron griddle very slow and mixed tht with shrimp in glass pan. Into oven. Keep close watch! Shrimps cook quickly it was delicious! Thank you for this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ree"
},
"reviewBody": "This was a pretty easy recipe. I always have frozen shrimp on hand. I did as others said and used 1/2 lb linguine (i am feeding 2), less lemon juice, 3 garlic, 1/4 cup bread crumbs to start. I did use a tad more shrimp so i needed a bit more bread crumbs. It didn't stick that much to the shrimp but kinda clumped up for the most part. Maybe I will coat them separately not mix together all in a bowl next time. I also sprinkled w Parmesan at the end. \n\nThe coating of linguine w olive oil and garlic didn't really do much for us. I might next time do a Garlic Red Pepper Noodles to go with this. The sauce thickened up some for us because of the breadcrumbs as i did not add any flour.\nHubby loved the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNIFER322"
},
"reviewBody": "We spent a lot of time looking for something that tasted good...like we were at a restaurant. This is the closest we've found. \n\nThe first time we made it, we followed it exactly. It was too much bread crumbs to our liking . We did use chicken broth instead of wine. \n\nWe have made modifications to the recipe, but it is all by looks and preference vs measurements. For instance, we cook the shrimp in the oven as we normally make a LOT at one time. We mix olive oil into the butter. We add parsley flakes and we LOVE garlic and have added more garlic into it. Even though we did make modifications...the base flavor was what we were looking for. We also tend to make more of the broth/sauce because the pasta will soak it in. \n\nWe've been making this recipe every 6-8 weeks for probably about two years now. LOVE it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Jakubiak Cadan"
},
"reviewBody": "Made this tonight for dinner. absolutely delicious! will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shaflid"
},
"reviewBody": "I made this as- is, but when I make it again I will: \n1. Thaw the shrimp first.\n2. Cut the wine by half.\n3. Cut the lemon by half.\n\nThe crumbs were soggy due to too much liquid, but it was all tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dossetee"
},
"reviewBody": "I made it using large shrimp so it needed a little longer cooking time. Also needed to use less bread crumbs. They seemed to overwhelm sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dmor"
},
"reviewBody": "simple and tasteful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjak15"
},
"reviewBody": "Very good. Might try a little less breading next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Blackbottomcupcake"
},
"reviewBody": "The flavor was good but the bread crumbs were way too gooey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "I did this receipe but I used frozen shrimp and chicken broth as opposed to wine. It gives it that same taste and my family and friends raved about it. I used a little more seasoning for my shrimp. As for the bread crumbs for a thickening don't over do it. If you use to much you won't have any juice left because the bread crumbs get thick as it sits. I don't have an exact amount just by eye. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mari428"
},
"reviewBody": "Made this for my husband, he loved it. Said it was better than restaurants and has bragged about it to his friends :P This dish has made me look good. Definately will make again, and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BramptonMommyof2"
},
"reviewBody": "Very good tasting dish. But 5 cloves of garlic was too much.I reduced it to 3 and reduced the pasta to 1/2 pound. I want shrimp too. Not just pasta. Also reduced the breadcrumbs. !cup was too much. I need to taste shrimp,not bread. Overall very good. I would make this again and would make it with rice next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kim H"
},
"reviewBody": "OK, gang. I haven't left a review in a year or two, but had to on this one. I'd cut the pasta amount in half and either eliminate the bread crumbs all together or cut it down to a 1/4 or 1/3 cup. I also tried Panko instead of bread crumbs. They turned to a white mush. It was disgusting looking. There also was barely any sauce. What a waste of time and ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marisol Fernandez"
},
"reviewBody": "My husband loved it!!! said better than restaurant. I found that I only needed half cup or less of breadcrumbs, rest was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JohnsWifey09"
},
"reviewBody": "Delicious! My husband and I loved it. I let the shrimp marinate for about 30 minutes for extra flavor before cooking. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diamond"
},
"reviewBody": "I love this recipe! The only thing I did differently was use much less bread crumbs and about half the butter. It was so yummy. Everyone loved it. I also added some parsely at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephicus"
},
"reviewBody": "This was very delicious! I've never made shrimp scampi before, and decided to make it on a whim a couple weeks ago. This was an extremely easy recipe. I like to follow a recipe pretty closely the first time I try it, so I went with the raw shrimp. Luckily our grocer provides veined shrimp and all I had to do was shell it. I thought the garlic was fine, but I'm a fan of garlic and like a lot of flavor. The only problems I had were that the breadcrumbs stayed soggy, so I may reduce some liquid next time, and there seemed to be too much pasta to the shrimp. I will either double the shrimp or reduce the pasta the next time around. Still greatly enjoyed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "skychick"
},
"reviewBody": "I re-read the recipe three times and still can't figure it out. Ths was the worse use of good ingredients I've ever made. Really wish I had just used pasta, shrimo, garlic, and butter. If you are gonna try this I would use about 1/10th of the bread crumbs, that's all you taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RachelReed"
},
"reviewBody": "Slightly too \"shrimpy\" tasting. Good, but you really need to cook the shimp in the oven about 10 minutes longer to get it done. The noodles needed A LOT of salt. The family loved it, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Lyn"
},
"reviewBody": "Excellent! Did not use all of the bread crumbs, next time I might try to cut the the butter back to half a stick. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rd78565"
},
"reviewBody": "This was wonderful! I cut back the bread crumbs to 1/2 cup and only used 1/2 of the lemon for juice at first. I served it with the left over lemon slices so individuals could juice to their taste. A little fresh parsley and fresh ground pepper at the end finished off a simple, wonderful dish.\n\nDefinitely cook/toss the pasta, sauce, and shrimp together for the last minute or two on the stove. \n\nNext time I might try adding mushrooms and capers to the sauce to add more depth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rbkosmo"
},
"reviewBody": "Loved it! I had leftover cold shrimp and needed a quick dinner, so I only made the shrimp and served it over a bed of lettuce. Yum! Next time, I'll try the recipe as written with Linguini"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Angela"
},
"reviewBody": "Really easy and really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bill Karnes"
},
"reviewBody": "This was a great recipe but I did add 1/4 c. of grated Parmesan, All in all, a Wonderful meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Damaris"
},
"reviewBody": "I loved this recipe! The only thing I did differently was I added a handful of Parmesan cheese and sprinkled salt and pepper, parsley and a little bit of fresh cilantro. I also used a little more than 5 garlic cloves. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brownie1"
},
"reviewBody": "I made this recipe for dinner and it was delicious. No leftovers. I reduced bread crumbs to 1/2 cup and just a few sprinkles of lemon juice. No need to add 1 whole lemon juice. Didn't have white wine so I didn't add to the recipe and it was still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lisak"
},
"reviewBody": "The garlic, butter, wine and lemon was right, but the bread crumbs were just wrong. Soggy and weird."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "connie viney"
},
"reviewBody": "Faboulous and easy !!! Did not change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MB"
},
"reviewBody": "This is the best recipe! I didn't have fresh garlic so I used garlic powder and it was still sooo good!! I tripled the butter, dbl the wine and used extra bread crmbs. This is the recipe I will use from now on =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dee Michniak Pennington"
},
"reviewBody": "I think the measurements on the bread crumaabs is way off. Notice the picture does not show the parsley nor is it listed in the menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coellofamily"
},
"reviewBody": "This dish was so amazing! I doubled the shrimp and crushed saltines instead of breadcrumbs. It turned out great! I added a little chicken broth to the pasta because I was afraid there wouldn't be enough sauce to give it flavor. It was amazing! I will use this recipe again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "csmith714"
},
"reviewBody": "soggy bread crumbs would wait to add for last 5 minutes next time, overall a bangin' dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mswithms"
},
"reviewBody": "I read all the reviews and made it my own. I took 2lbs shrimp that was already cooked deviened and frozen.*walmart Rinsed in cold water for 5 min as directed on the shrimp bag. In the mean time cooked 1 lb linguinie. Took the 1/4 c butter and 6minced garlic and melted in the micro. then poured the butter mix in a pan. Added the shrimp and tossed. simmered on low about 8 min while the linguini cooked. I ground up Fiber one cereal (hungry girl tip) and used for bread crumbs.. used 1/2 c of the cereal crumbs, tossed in the pan. Added the cooked noodles. Poured in 1/2 c chicken broth and cut up a fresh lemon and squeezed over the pasta mix. That in itself was the best kick to this. I am not a garlic fan, and this was one of the best meals I have had in a while. Delicious. Quick and a definate keeper will make again! thank you for sharing your recipie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Quita143"
},
"reviewBody": "This was great, if you really like garlic (and I do!). I'll be hanging on to this recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi Fenner"
},
"reviewBody": "Yum!!! Definately a keeper at our house!! The only thing I did different was used frozen shrimp instead of fresh and I served it with mashed potatoes instead of the noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Hope and Tim"
},
"reviewBody": "this should be named Shrimp Casserole, not scampi. the dish is dry because it's baked - i would recommend not baking. The shrimp also lack flavor from this recipe without salt and pepper. Also the breadcrumbs do NOTHING except make mush. go for a traditional pan-fried scampi instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chorusgirl3"
},
"reviewBody": "Real tasty. Nice creamy sauce. I dipped my green beans in it. Cooked it on the stove top and skipped the breadcrumbs. Came out amazing though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hurriken"
},
"reviewBody": "I tried a scampi recipe with breadcrumbs last year that was awful. I was a bit nervous about this one but the reviews were so good I decided to risk it. This recipe was delicious! It would have been nice if it had a little more sauce, but I may try adding more wine next time. Yes, there definitely will be a next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tsvitak010103"
},
"reviewBody": "awesome! Husband loved it! Very easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria C. Sanchez"
},
"reviewBody": "Made this last night. It was a easy quick fix. Family loved it. I used seasoned breadcrumbs and left out the wine since i didnt have any but it turned out great. I also made extra garlic butter sauce and tossed the linguini in that instead of the oil. Great recipe! This ones a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cataurus"
},
"reviewBody": "It was just o.k. Needs salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lilian"
},
"reviewBody": "Recipe was easy,delicious, and bread crumbs really made the difference to my meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LovingFoodInNYC"
},
"reviewBody": "Quick &amp; easy yet the recipe comes out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn L."
},
"reviewBody": "I gave this a 4 mainly based on flavor and ease of making. I read the prior reviews and decided to follow the recipe, except use 2 pounds of shrimp and cut back 1/2 the bread crumbs. I found that I still had to take the shrimp out of the oven before it was crisp to prevent overcooking. I think the problem is too much wine, next time I will use just 1/4 cup. The flavor was great and after I mixed the shrimp with the linguini, I didn't even notice that the wine/lemon/breadcrumb mixture started out kinda gooey. I will definitely make this again, the family loved it! One other note is to make sure to pat your shrimp dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MICHELLETHECHEF"
},
"reviewBody": "mmmmm...I made this for my husband and I, and it felt like we ate out at a restaurant. It was so yummy and I served it over thin spaghetti. I didn't even have lemon juice, so I left it out. Next time, I might broil the shrimp for a little bit just so the bread crumbs get a little crunch to them - but that's just a thought. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAUR1E"
},
"reviewBody": "This was fantastic. Made it as exactly as stated in the recipe. Easy and delicious. Loved the flavors. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Gina"
},
"reviewBody": "I did not care for this recipe. I'm giving it two stars only because I'm giving the benefit of the doubt that I made a mistake but I'm pretty good at following a recipe and so it's doubtful... I don't reccomend this nor would I make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinBug"
},
"reviewBody": "Very, very good! The first few bites I thought the wine was a little overpowering, but as I kept eating, it all tasted wonderful. I did cut the breadcrumbs down quite a bit, just a light sprinkling. I also served it over thin spaghetti as I'm not a big fettucine fan. Absolutely delicious, thank you! Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "This was fabulous! It was eaten so quickly, I didn't get a chance to get a photo to post! I am so impressed with this recipe. I have not had much success with cooking with wine in the past, but this was perfect! Thanks for a fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lunalady"
},
"reviewBody": "really good, simple and quick. although I made it simpler and quicker by skipping the baking part and just adding the wine and lemon juice to the pan right after adding the shrimp, wait 3-5 minutes (or just until pink), add a handful of the breadcrumbs, a little fresh tarragon, and done! (I can't stand overcooked shrimp) I also threw in some frozen peas to the cooking pasta right at the end for color. Probably took 30 minutes total (minus cleaning the shrimp!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NMO6"
},
"reviewBody": "Made this last night, followed others advise on the breadcrumb amount and just used afew tsps, otherwise this came out fabulous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BERNADETTELATTIG"
},
"reviewBody": "This recipe is great! I wouldn't change a thing except on the amount of breadcrumbs that are called for. Instead of scooping out a cup as the recipe calls for, you should just take tablespoon by tablespoon, sprinkling the breadcrumbs on until the shrimp are coated. A cup of breadcrumbs is too much. Otherwise, this recipe makes the best shrimp scampi my husband and I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "We did not care for this, my boyfriend, roommate, and I followed the recipe exactly. I think the problem was the bread crumbs so maybe leaving those out would have helped. We served the shrimp and pasta separately and ended up taking the pasta, adding parmesan cheese, salt and pepper and eating that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeneral"
},
"reviewBody": "This is a great recipe that I turn to often. I've made adjustments too: a little more garlic because we love it, a little less breadcrumbs. I also sprinkle a liberal coat of parmesan cheese on top before baking, and turn the broiler on it for the last couple minutes so it's nice and bubbly and just starting to go brown. It's a great light meal that tastes delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heidi DiSavino"
},
"reviewBody": "Tasty, but the breadcrumbs were way too overpowering and pasty. Next time I'll try with half the crumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momofjil"
},
"reviewBody": "I can not hardly rate this recipe. I had shrimp, garlic, oil and butter but not much else! I followed the directions but substituted Sprite for the Lemon Juice (mine had gone bad). Since I discovered I did not have bread crums, I had a few of those roasted Veggie crackers, I crushed those and used instead. It was very yummy even with the changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PNC"
},
"reviewBody": "This recipe was awful. There was way too much bread crumbs. The lemon and wine was strong. My family didn't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELDOE"
},
"reviewBody": "Great Recipe thanks I added Bay scallops and omited the wine I did not have any used some mushroom broth instead I used rice pilaf as the base I also made a alfredo sauce and put in the shrimp mixture. it all turned out really good I will try this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tyrone"
},
"reviewBody": "I followed this recipe, but made my own variation to it. I sauteed all the ingredients listed and added 2 tablespoons of Worcestershire. It was quick, easy, and even my 1 year old liked it. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steffani911"
},
"reviewBody": "I thought this was fabulous. I never follow a recipe exactly, but I used all the ingredients listed but in different amounts. I only used about 1/4-1/3 cup bread crumbs and skipped the oven altogether by doing it all in a skillet. Very good. Seems like most who didn't like this you can find the reason in the reply. I will make this for guests and feel like they'll love it. Give it a shot just watch the bread crumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jody"
},
"reviewBody": "This was good, but maybe a little too much wine and lemon. Just my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UPENDI1"
},
"reviewBody": "This is absolutely the BEST scampi recipe EVER - as is - no changes needed!! My husband loved it! Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cookinme"
},
"reviewBody": "I went back and forth between three and four stars so I guess it's three and a half. I followed the directions, doubling the sauce and the shrimp (we live in Maine and had fresh Maine shrimp, which is smaller) and I just used half a cup of bread crumbs. It was still creamy. But it was mising something....not sure what. I will probably make this again and play around with the seasoning. Thanks Deborah for a good dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jo H."
},
"reviewBody": "I would do as reviewer monchichi suggests if you'd like to give this recipe a try. After all, it is tried and true. I followed the recipe EXACTLY, and it was awful. Way too much lemon juice! A slimy mess. And the shrimp weren't completely cooked. I used frozen uncooked shrimp, but my oven tends to run hot, so I figured it would even out. We had to microwave the meals before eating them. Yuck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JNANTHA"
},
"reviewBody": "This recipe was easy to make and my family loved it. I was a little skeptical about using bread crumbs, but I'm glad I did. It was the perfect combo. I also realized the next day that I forgot the lemon, but no one else seemed to feel like anything was missing from it. This is a great one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lc"
},
"reviewBody": "I thought this was very good. I omitted the wine since I didn't have any and used 6 garlic cloves instead of 5. Also, reading the other reviews, I put just enough bread crumbs to cover the shrimp in the pan - certainly nowhere near a whole cup. Definitely recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Teff"
},
"reviewBody": "I think this would be better if there was a sauce on the pasta. It was way too bland. Thanks anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "I did not care for this. Maybe I did something wrong??? Everyone else seemed to like it.... The recipe called for WAY TOO MANY bread crumbs. The shrimp turned out \"doughy\" (from too many bread crumbs). Also thought the lemon and wine mixture was too overpowering and the pasta was very dry. I made this dish for friends, and luckily was able to salvage it (my bf and I shook off the bread crumbs as best we could, stuck the shrimp on skewers and grilled them). My bf thought that the breadcrumbs were odd (shrimp de joghne is prepared with breadcrumbs, not scampi). This recipe is not for me. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tara Lazar"
},
"reviewBody": "This recipe was delicious but I honestly did a lot of tweaking to get it to our liking. I used eight garlic cloves instead of five. I omitted the breadcrumbs and the entire oven process. Instead, I cooked the shrimp in the sauce for five minutes and then removed them from the heat. I used additional butter at the end instead of olive oil, and I employed Lidia Bastianich's tip of cooking the pasta in the sauce for the last minute or two. (There was not enough sauce leftover for bread dipping, but I could have added some pasta water to the sauce.) When I tasted the sauce by itself, I thought the lemon and wine too overpowering, but once the dish was put together and sprinkled with grated romano cheese, it really was very good. I liked this recipe because it was quick for a weeknight dinner, but I will be trying other scampi recipes before making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cath in Georgia"
},
"reviewBody": "This was good but,nothing special though. Would probably look for another recipe just to try and compare before making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bssanborn"
},
"reviewBody": "not bad, but needs some spice--oregano, basil, red pepper flakes-would add about 10 seconds to the prep time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "swhopp"
},
"reviewBody": "I had never made (or eaten) shrimp scampi before but I made this for my mom's birthday since it's her favorite. Everyone enjoyed it. Not knowing what to compare it to I would say that I wish there was a little bit of sauce in the scampi pan to spoon over the pasta (or dip bread in). Overall I thought it was good. My boyfriend who thought he was going to hate it said it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zfamily"
},
"reviewBody": "Yummers! This was really good. I may have put a little too much garlic in mine but it was still good. I also used this for catfish and it came out very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylen"
},
"reviewBody": "I used rice vinegar instead of white wine and it was still an amazing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dianah"
},
"reviewBody": "I gave this a three stars becase it was good But the bread crumbs made it so dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JenniDG"
},
"reviewBody": "There was not much flavor at all. I did as others suggested and added white wine, while cutting down on the broth..it was just bland.\nI even added chicken breast to give it a little something, but it did no good. I will not make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cdubay"
},
"reviewBody": "This dish was delicous. It was quick and easy to prepare, which was great after a long day of work. I did tweak the recipe a little bit. Instead of using the bread crumbs, I used a Tbsp. of corn starch mixed with a Tbsp. of water. Mixing in slowly, the sauce thickened to a creamy texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PANIELI"
},
"reviewBody": "This was awesome! I doubled the shrimp since my husband loves it, added a little bit more butter, but kept the crumbs the same. I substituted 1/2c chicken broth for the wine. I had about 20 cloves of garlic since my husband love that too. This turned out phenomenal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Awesome! Restraunt quality! Everyone loved it! Thanks for the recipie. Will definatley use again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "FANCY112"
},
"reviewBody": "The recipe is a good base if you listen to the other reviewers suggestions it is a pretty good dish I couldn't give it 4 stars because following the recipe alone I can't say that I would have been a happy camper, if you don't listen to anything else REDUCE the breadcrumbs best tip that has been given towards this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BONF"
},
"reviewBody": "I am the only one in my family that likes shrimp. I didn't want it to be very heavy so went light on the amount of sauce and oil. It was great and a simple recipe for one person."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LORAS32"
},
"reviewBody": "quick, easy, taste great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My kids love shrimp scampi, they hated this recipe. The bread crumbs ruined the taste of the garlic, they don't work together here. Needs pepper and other spices. Use a different recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "NAMIE"
},
"reviewBody": "This turned out to be a real glob of food. Too thick, no scampi sauce for pasta even tho I used more wine, lemon juice and olive oil when I saw how thick it was. 1 Cup of bread crumbs MUST be a mistake! A real waste of time and food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NicoleK"
},
"reviewBody": "Simple, yet tasty pasta dish. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALEG"
},
"reviewBody": "Great recipe, I use precooked frozen shrimp, defrosted. Works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "FOODGU1"
},
"reviewBody": "Honestly, I wasn't impressed with this dish - it didn't come out as good as I was expecting it to after reading all of the positive reviews. In my opinion, the wine was just WAY too overpowering. Per reviewer suggestions, I decreased the amount of garlic to 3 cloves, decreased the bread crumbs to 1/4 c. and decreased the amount of pasta to about half of what the recipe called for. I'd suggest also cutting back on the amount of wine and lemon juice as well. I won't be making this again but good luck to those who may - I hope it satisfies your taste buds more than it did mine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPEEDIEGIRL"
},
"reviewBody": "I found this recipe to very easy and very tasty. I read the commets of the people before me, the problem with the wine is that you have to let the alcohol from the wine cook off which takes a few minutes after that you should be fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THis recipe, to me was WAAAAYYY too winey! It overpowered the taste of the shrimp! Next time, I'll add way less wine, more butter amd just the same amount of garlic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I can't recommend this recipe. If you are looking for true Shrimp Scampi, this doesn't even come close. I suggest doing it the old fashioned and more messy way of frying the shrimp in a frying pan with lots of garlic, small amount of wine, lemon, and white pepper. I'd also forget the oil in the pasta, it was much too greasy. Sorry...."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12814/quick-and-easy-shrimp-scampi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/13292/main-dish/seafood/shrimp/",
"name": "Shrimp"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15853/main-dish/seafood/shrimp/shrimp-scampi/",
"name": "Shrimp Scampi"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12814/quick-and-easy-shrimp-scampi/",
"name": "Quick and Easy Shrimp Scampi"
}
}
]
}
}
, "about": [
]
}
]