				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Raspberry Pain au Chocolat (Raspberry Chocolate Croissants)"
,"datePublished": "2019-04-02T02:47:22.000-04:00"
,"dateModified": "2019-04-02T02:47:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "allison125"
,"url": "https://www.allrecipes.com/cook/351270"
}
]
,"description": "Flaky puff pastry is filled with chocolate-hazelnut spread and all-fruit raspberry spread in this delectable treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Q17Mn1NbZAs8E9t0lP8UOUY1C7o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6224694-d27613edf05e4fc79204ab83fddbdb7c.jpg",
"height": 1875,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3740692676001",
"description": "These raspberry chocolate croissants are elegant and delicious!",
"duration": "PT2M13S",
"name": "Raspberry Pain au Chocolat",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/3a33e5f4-7b60-41d8-a38d-3af47ba0309f/c328a668-2cd4-4c8c-8d58-8656d4a8cc24/1280x720/match/image.jpg",
"uploadDate": "2021-07-25T12:03:14.504-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Raspberry Pain au Chocolat (Raspberry Chocolate Croissants)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "91"
}
,"cookTime": "PT18M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "189 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "10 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "76 mg"
,"sugarContent": "6 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (17.25 ounce) package frozen puff pastry, thawed",
"6 tablespoons chocolate hazelnut spread",
"3 tablespoons all fruit raspberry jam",
"1 egg, beaten",
"0.25 cup confectioners' sugar for dusting" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Unfold the puff pastry sheets on a lightly floured surface. Cut each one into thirds along the fold lines. Roll each strip of dough out to about 16 inches long, and cut strips into thirds."
} ,{
"@type": "HowToStep"
,"text": "Spread some of the hazelnut spread onto one half of each rectangle to within 1/2 inch of the edge. Spread about 1/2 teaspoon of the raspberry jam over the hazelnut spread. Brush the edges with egg, and fold over the other side to enclose the filling. Press the edges firmly to seal. Repeat with the remaining rectangles. Use a sharp knife to cut 5 slits across the top of each pastry, and place them on baking sheets, spacing 2 inches apart."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Q17Mn1NbZAs8E9t0lP8UOUY1C7o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6224694-d27613edf05e4fc79204ab83fddbdb7c.jpg"
}
]
,"text": "Bake for 18 minutes in the preheated oven, or until golden brown. Cool on racks. Dust with confectioners&#39; sugar when cooled if desired."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT38M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tonya"
},
"reviewBody": "I used Ghiradelli melting wafers as the chocolate due to nut allergies. 2nd try went better than the first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Meinen"
},
"reviewBody": "Worked great! So easy and so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Very easy. Great flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Daddy"
},
"reviewBody": "I loved these croissants. The flavor was great, and they were so easy to make with the frozen puff pastry. I got 18 done in an hour with little fuss. The longest part was getting the crust properly defrosted before I could work with it. I would absolutely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Haggard (WCHS)"
},
"reviewBody": "So Delicious. It took longer for the puff pastry to thaw than I expected. But that was the only drawback."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "It was ok &amp; better cold than warm from oven. I liked better without the chocolate hazelnut spread. Won't be making again cause we like the recipe better with cream cheese filling &amp; jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tedders"
},
"reviewBody": "Very easy and delicious. Next time I am going to make with only jam and a lot more of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Butler04"
},
"reviewBody": "These were delicious and pretty easy. I did add the egg wash to the top in addition to the edges which I liked. I forgot to add the confectioners sugar which probably would have been even better and I clearly didn't seal them well enough since a few leaked the jelly and didn't look as pretty...but that was my fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "This was my first time using puff pastry and these were so simple. They turn out so fancy looking and everyone wants one! Mine were done in 14 minutes so keep a close eye. Followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ree112"
},
"reviewBody": "I will make it again and I will cut out with a cookie cutter to make sure they are all even."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Natalie Taylor"
},
"reviewBody": "The taste is very good, however. It comes unfolded and then becomes burnt-looking, ugly and hard to clean up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Harding"
},
"reviewBody": "These are soooo awesome! Easy and beautiful. I’m sure I’ll be making these many more times. Thanks for the recipe! I like extra chocolate so I sprinkled some dark chocolate chips in too that I chopped up in the food processor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda Breton"
},
"reviewBody": "my husband loved them, but they qere not crispy, dont think i cooked long enough. and my filling came out., i need practice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Street"
},
"reviewBody": "Pretty easy to make. I would try a couple twists to this though. I would use a pepper jelly like raspberry jalapeño to give it a little surprise bite! Also might add a egg wash to the top and sprinkle with raw sugar before it's baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Made recipe exactly as stated, very easy and family and friends enjoyed. They were all gone in 2 days, will be making again! Posted photo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fermata4638"
},
"reviewBody": "The Beans ( ages 8,7,6) loved these, although the grown-ups found them too sweet.Unanimous that Mimi can make this again, as according to the eldest bean ithese were 'the best dessert ever!' Made exactly. As written. Thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr Farnsworth"
},
"reviewBody": "This is a great recipe. Easy to make and delicious. I made these for a small party and my guests could not believe I didnt buy them from a bakery. Very light and tasty. I added a little more raspberry to the mix but that was just personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marlee"
},
"reviewBody": "A wonderful and simple recipe. Very subtle flavors. I noticed several reviewers had problems putting these together so I watched the video prior to making my first batch and had no issues with it. I've tried this as written and with several other fruit flavors and all of them have been very good. We did like the raspberry best though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DivineAira"
},
"reviewBody": "meh too basic. quick but taste very store-bought"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosie-0-Toole >^..^\u003C"
},
"reviewBody": "These were a hit with us. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FunwithFood"
},
"reviewBody": "Excellent recipe! Love it! I had never worked with puff pastry before and it was easy to work with. These look professional when done, like those from a bakery/pastry shop. Flavors were great together. I may try strawberry pastry filling in place of the raspberry jam as I love chocolate and strawberries. Thanks, allison125, for the great recipe! I plan on trying many fillings and having fun with puff pastry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "What a little delectable treat these are! I found that I had everything in the house too, to pull them off. I made 1/2 recipe as I only had 1 sheet left of the puff pastry. For the nutella, I mixed up some homemade. I found it was actually quite easy and tasted not surprisingly better. The flavors balance well in these. I found rolling the strips out to 16\" a little hard, so I rolled them to 15\". That made them easier to cut into 3 even pieces anyhow. The directions are very precise and I had no problem with them sealing. Only thing was I had to take them out after being half way done to cut the lines deeper. It appeared, I hadn't cut through the dough far enough. I did 3 lines with their size. I would make these again. Super easy, pretty, and good flavor. ty Happy Valentine's Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doubletigers"
},
"reviewBody": "These are soo good and so easy to made. I made half with raspberry jam and nutella and half with banana and nutella. I made them smaller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "artingal"
},
"reviewBody": "Fabulously easy! We always have several jars of Nutella at our house because we all love it. My 11-y-o daughter helped me make this and the results were finger-licking good. You can be very creative with this recipe: fold the dough in triangles, or make these little gems a little bigger: whatever you prefer. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sofiamarie"
},
"reviewBody": "They're delicious. They look very fancy. I kind of eyeballed everything and they were still wonderful! Added a few dark chocolate chips to every roll. I'll definitely be making these again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BramptonMommyof2"
},
"reviewBody": "Made these yesterday!!!!! Company came over unexpectatley and devoured them in 30 minutes. So good. Only one thing took only about 14 min in \nmy oven .Watch very carefully or they burn underneath. So yummy.Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacolyn "
},
"reviewBody": "I cannot rave enough about this easy and yummy dessert! I made these for guests who each ate 3 or 4 in an hour. They just couldn't stop eating them. I was hoping to have quite a few as leftovers, but there were only 2 left. I made several changes as others suggested: I didn't worry about exact measurements for rolling the pastry, I just kept a general rectangle shape; I didn't measure the nutella or the jam (I used raspberry and strawberry preserves, but the raspberry was the best.); I crimped the edges with a fork; used an egg wash on them before putting them in the oven; used parchment paper on the pan; and checked them after 13 minutes. One or two of them were a little messy on the parchment paper, but it didn't matter, because they tasted so good that people ate them anyways. Definitely serve these with coffee and on plates with forks, because they are messy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LatinaCook"
},
"reviewBody": "These are great. I've made them as instructed in this recipe but I've also made them a bit different with great results. I have used chocolate chips instead of the spread and cut the pastry in circles rather than squares. However you decide to make them, these are really cute, nice and flaky, easy and they look elegant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweettoooth"
},
"reviewBody": "This is a really great recipe! I did half with the raspberry and half replaced with peanut butter. I couldn't decided which went faster! My only qualm is that the directions for cutting the puff pastry can be a little difficult to understand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Ohhhh"
},
"reviewBody": "This is so good and so easy! Whenever I make this, someone invariably asks for the recipe. I always keep these simple ingredients in the fridge now, for unexpected guests or last-minute get togethers, and they are always a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JIMVY"
},
"reviewBody": "My kids loved these. Very easy, very elegant and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "abapplez"
},
"reviewBody": "These little gems were loved by all. I was in a huge hurry and wanted smaller/mini pastries so I just cut along the fold lines in the pastry and then divided each of the three strips into four equal squares. I dropped 1 teaspoon of seedless red raspberry jam and 1/2 teaspoon of nutella near the edge of one of the shorter sides and rolled them up tight. Place them seam side down on parchment and pushed them down a little to make sure they stayed rolled up. These are so fast and easy with yummy results. I will use this recipe often. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlynn1123"
},
"reviewBody": "This was great, followed the instructions except modified the filling: I used Cadbury dark chocolate and broke into bite sized pieces. I took these to an Easter brunch and they were a huge hit! I will definitely make them again, perfect size too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betsy"
},
"reviewBody": "Very good. My son ate Pain au Chocolat every morning when he lived in France. We tried making them from scratch and it tasted more like a baking powder biscuit. These were flaky and tasty, just be careful that they don't burn on the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAURAMELINDA"
},
"reviewBody": "These were very good! I liked the ones with just a little raspberry jam the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annabelle"
},
"reviewBody": "These were really easy, and very elegant looking at the end. 18 minutes was way too long in my oven, so you might start checking at 13 minutes or so. I would recommend them for an easy, tasty, elegant brunch item or dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandi Warren"
},
"reviewBody": "These are delicioussssss!!! I made these with raspberry-pomegranate jam, which is my all time fav!! Everyone at work loved them!! Thanks for sharing, Allison. This is a keeper, as all your recipes are!! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Very good. I don't have puff pastry and am too lazy to go get some, but I do have crescent rolls, so I used two cans of that to make these. I had to bake for less time--10 min to be exact--18 min is way too long for crescent roll dough, but otherwise this recipe doesn't really need to be adjusted. I'm sure it's better with puff pastry, but in a pinch this works great. Very good flavor combo, too. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Brunk"
},
"reviewBody": "These were such a hit. They look like they came from a bakery and were so simple to put together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie S"
},
"reviewBody": "Next time I think I will do something instead of Raspberry Jam. But good idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mb"
},
"reviewBody": "I'll give this a 4. I didn't particularly like it. I used Nutella, I guess I don't like it. But everyone else just loved and raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari"
},
"reviewBody": "TO.DIE.FOR!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "These little pastries are divine. And, you can really use any kind of filling you want -- although the Nutella and raspberry jam is SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma Mayhem"
},
"reviewBody": "So easy, but looks like you've spent all day in the kitchen. I would recommend using the eggwash over the tops of each bread, gives it a nice golden color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RWARNER"
},
"reviewBody": "Outstanding! In order to prevent the jam from seeping out during cooking, heat it in a saucepan and add cornstarch. Once the jam cools completely (very important!) it will have a much thicker consistency and won't seep out while baking. The first batch I made I rolled out too thin which presented 2 issues...the pastry didn't puff much while cooking &amp; the dough was very fragile since it was so thin. They still tasted great! I made mine more \"bite sized\" so I sliced the pieces smaller. Second batch was awesome!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danielle Place"
},
"reviewBody": "These little guys are easy to make, taste great, and look impressive! The only thing I'd say to watch out for, is making sure you don't make the slices too long on the top of the pastry, or the raspberry preserves will spill out and make a mess of everything (a few of my guys didn't quite make it)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Thank you for posting a simple and quick croissant recipe. I'll be making this again soon and will try different fillings also. Just a note, the egg wash to seal the edges is really important to keep filling inside. I forgot to do it on one croissant and the filling leaked out across the tray."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffani"
},
"reviewBody": "really good. I dropped the raspberries and just used hazelnut spread instead after the first two batches. Always a crowd-pleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoveNCyprus"
},
"reviewBody": "Very good, will make again. Used half the pastry with the chocolate/raspberry filling, and half with feta cheese/ greek olives. Was happy with both the sweet and savory versions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHERI63MI"
},
"reviewBody": "Excellent recipe!! I used seedless red raspberry jam and a really good quality black cherry and blue berry jam (the black cherry was better then the red raspberry, not overly sweet) As far as the filling, I think more is better. I ended up with a good heaping teaspoon of the chocolate spread and just a little less then a heaping teaspoon of the jam. I did some with just plain jam, but everyone seemed to prefer the chocolate spread. I also dusted the pastry with a coarse sugar and everyone loved it. Don't worry about the sizes being so precise, just cut the sheet into three strips at the fold and each strip into three again, give them a little roll and fill. Thanks for the great recipe Allison."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Brunin"
},
"reviewBody": "These were fantastic! I took them to my office for Bastille Day and everyone loved them. They were so easy and beautiful, it almost doesn't seem fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mallinda"
},
"reviewBody": "These turned out very well and were not difficult to make. People were surprised that I hadn't bought them at a bakery. The crust is flaky and crisp and the filling is good. I would recommend being generous with the filling. Some of mine had more than others, and the ones with more tasted better. Some may bubble out on baking but it doesn't really matter.\nJuly, 2019--These won first place in the pastry category at the Salem, VA fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MANDT2"
},
"reviewBody": "Loved the Nutella and raspberry jam, but felt the puff pastry overwhelmed the filling. This site has a recipe for crepes with Nutella and bananas, garnished with whipped cream and strawberries. I think I'll try that with some of the remaining Nutella."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joannealexis1250"
},
"reviewBody": "This was okay, I don't think I will make it again. Add alot of jam, and chocolate. Then drizzle a glaze over them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aminarose"
},
"reviewBody": "super easy and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Samantha Gibson"
},
"reviewBody": "i'm making this for my French I class in the 8th grade. I love chocolate and raspberries put together. I also used the canned croissants cause the other thing looked to hard. Then i used the chocolate spread that goes on ice cream in stead of the Novella or whatever and it still worked out the same.GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannamelissa"
},
"reviewBody": "Fast, easy, and yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Sooooo great! We have dairy allergies in our family, so I make my own chocolate spread with about 1 large bar of dark chocolate and a tablespoon or two of non-dairy margerine - melt together and mix. This is such an easy, quick and delicious recipe that never fails to impress!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CSPHD"
},
"reviewBody": "Awesome! And didn't take long at all! Instead of cutting individually, I just rolled one sheet of puff pastry onto parchment, lightly scored the sheet so that I knew where to place the spread &amp; jam. Then I rolled out the other sheet on parchment. Egged around sheet #1 and then put sheet #2 on top. Cut with my pizza wheel and I was done! Took about 30 mins including the baking time :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "Simply delectable. I think I'll try drizzling a little icing on them and using an egg wash next time - there will definitely be a next time! Certainly guest-worthy. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tito Sheindlin"
},
"reviewBody": "really good and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMOH"
},
"reviewBody": "Holy Cow! These are awesome, and so easy. Honestly the hardest thing to do is spread the Nutella (don't laugh, it was a little tricky to spread). I brought half of these into work with me and my co-workers were so impressed when they found out that I made them. They thought I had gotten them from the local bakery! I can't wait to make these again, I'll need them to keep my status as favorite new employee ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariam"
},
"reviewBody": "i made these especially for my brother because he is a huge fan of pains au chocolat. He loved them so much! they were very easy to make. I used mixed berry jam, and half of the dough I only used nutella without the jam. really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leila"
},
"reviewBody": "These were great. Everyone loved them. They are NOT difficult, so please don't be discouraged! Some tips: flour your countertop and pin when you roll out the pastry. Lay down one third of your sheet at a time so the others don't get in the way. Don't be concerned about exact measurements: just lengthen and widen the pastry with a few strokes of your pin, keeping it in a general rectangular shape. Don't bother to measure the Nutella, you can eyeball it. Less is more here; you want it to be a hint of flavor, you don't want people to say \"Mmm, Nutella and raspberry jam!\" Spread the Nutella quickly, as it dries out after several strokes and becomes more difficult to spread. It doesn't have to be pretty; nobody can see the inside. If you go all the way to the edge, no worries. The jam measurement seems to be just right for the size pastry. When you fold em up, crimp the edges with a fork; if filling squeezes out, oh well. A few strokes of egg wash along the top and sides. Make sure you use parchment paper as the filling may overflow in the oven and be a huge pain to scrape off the sheet. And voila! Quick, easy, delicious... this pastry will impress, and you don't have to let on how painless it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FUNCook!"
},
"reviewBody": "Awesome! So what if it's not authentic? My friends thought these were the best pastries they'd ever had, and they couldn't believe I made them! Thanks!! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jody1"
},
"reviewBody": "So easy, elegant and delicious! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMGRUHLKE"
},
"reviewBody": "Wow! So simple and yet so elegant and delicious! I used a mixed berry all-fruit and 2 squares of Hershey milk chocolate as suggested in a review--great idea and a lot easier than spreading Nutella or investing in a whole jar. I think one person above didn't realize to cut pastry rectangle in thirds across, not lengthwise! So before adding filling, pastry size will be about 5 &amp; 1/2\"x 3 &amp; 1/2\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MOONNOODLE"
},
"reviewBody": "I'm giving this 3 stars because although it was good, it was very difficult to put together despite the short list of ingredients and instructions. First of all, prep time was way under calculated. For example, just rolling out the pastry took 30 minutes to get it to 16\", then cutting it into strips. And just try putting the chocolate to \"within a 1/2 inch\" when the strip itself is only 3/4\". This part took another 30-40 minutes which put me over the 40 minute prep time listed. Then it didn't say which way to fold the pastry - lengthwise or shortwise? I picked shortwise and it was ok but I kept getting chocolate mixed up with my egg brush and that made the pastry ugly. I think this must just be my complete inexperience with pastry-type cooking but this was way too much work and frustration for the end product, which didn't get hardly any comments from the party-goers I brought them to - except for the kids - they thought they were great! My husband liked them too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zeus"
},
"reviewBody": "This recipe was baked by my son for a project in his high school French class. A great recipe, easy to follow and comes out looking like something in a real French Bakery!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I made these for a few friends, and they all raved about it. To really simplify this recipe, use packaged, refrigerated crescent rolls. They come preshaped and precut, so the only thing to do is roll them out and pull them apart. Spread the topping on, and roll. I also warmed the hazelnut spread for a few seconds in the microwave to make it easier to spread. Total prep time was no more than 10 minutes this way, and cooking time was 8-12 minutes (as per directions for crescent rolls). Very fast, very easy, and great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Fronius"
},
"reviewBody": "Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AGGIEAMY"
},
"reviewBody": "I made this and just put four or five squares of Hershey's Chocolate Bars in and prepared them according to the instructions. FABULOUS! Better than you can get at some coffee shops. If you have leftovers they reheat well in the microwave and have with a cold glass of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly"
},
"reviewBody": "These are so yummy! Very simple to make yet so elegant. I think these will be great served with coffee for breakfast! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "mmmmmmmmmmmmmmm... I make this easy recipe for brunch. Doubled it for 8 people and watched them disappear. I also made with nutella only or substituted bittersweet chocolate chunks with similar results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shishkabeenie"
},
"reviewBody": "incredibly delicious and wonderfully simple! i changed the recipe by making a thick, homemade raspberry coulis rather than use the jam, and this dessert sang!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/84393/raspberry-pain-au-chocolat-raspberry-chocolate-croissants/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/84393/raspberry-pain-au-chocolat-raspberry-chocolate-croissants/",
"name": "Raspberry Pain au Chocolat (Raspberry Chocolate Croissants)"
}
}
]
}
}
, "about": [
]
}
]