				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Real Wisconsin Fried Cheese Curds"
,"datePublished": "2006-07-11T12:17:26.000-04:00"
,"dateModified": "2006-07-11T12:17:26.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Markg238"
,"url": "https://www.allrecipes.com/cook/1978927"
}
]
,"description": "These cheese curds are beer battered and deep fried, and make for a real Wisconsin treat. A perfect way to enjoy this melty gooey irresistible snack."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UcxQLikpx-fxgVsIV3jrpeLbZIg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2435777-real-wisconsin-fried-cheese-curds-Allrecipes-Magazine-4x3-1-a2376eb0c97042bb8c5cda083da9fd53.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Real Wisconsin Fried Cheese Curds"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "105"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "370 kcal"
,"carbohydrateContent": "7 g"
,"cholesterolContent": "83 mg"
,"fiberContent": "0 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "436 mg"
,"sugarContent": "1 g"
,"fatContent": "31 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 quarts corn oil for frying",
"1 cup all-purpose flour",
"0.75 cup beer",
"0.25 cup milk",
"2 eggs",
"0.5 teaspoon salt",
"2 pounds cheese curds, broken apart" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat corn oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Whisk together flour, beer, milk, eggs, and salt to form a smooth, rather thin batter."
} ,{
"@type": "HowToStep"
,"text": "Place cheese curds, about 6 or 8 at a time, into the batter, stir to coat, and remove with a wire strainer. Shake the curds a time or two to remove excess batter."
} ,{
"@type": "HowToStep"
,"text": "Deep fry curds in hot oil until golden brown, 1 or 2 minutes. Drain on paper towels; serve hot."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Holy heck! DEElicious! The -only- criticism: measurements are off. In my case it took 2 1/2 cups flour to do the trick keeping the coating on the curds. Otherwise 5 stars all day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I like them a lot, however I did follow some other suggestions like the waiting for set them amount to get room temperature for them sweat took them out tossed them in the flower and I put them on a baking sheet put them in the freezer and I got my grease hot enough, when I first scooped up my first batch put them in the grease together and they seem to stick together so after that I just put them in one at a time in the grease so no sticking together but I had to place them in there one by one I also think they could used some fresh garlic and been better, I tried garlic powder and they didn’t much garlic flavor so next time I’m going to use the fresh garlic in the batter and I think they will be a lot better then they already are. ❤️❤️😘😘."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cathy Moklebust"
},
"reviewBody": "They totally melted in my fryer. The cheese melted out of the coating and made a mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "alicia0731"
},
"reviewBody": "These did not turn out at all. Cheese melted and seeped through breading before they were done!! What a mess , 🤔"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The most delicious recipe! I like my cheese curds on the crunchier side, but this recipe definitely took me back to my roots. I used Garlic Herb curds instead of original and it made it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HR Visser"
},
"reviewBody": "No changes! Fluffy, cheesy masses! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tweety78230"
},
"reviewBody": "I made these yesterday, using both of the suggestions: letting them sit to room temperature and flouring them before battering, and freezing them after battering. They still stick to my fry baxket; I had to scrape out every batch. By the time I was done, I thought I had ruined a $10 fry basket.\n\nI was ready to give this one star, but I served it anyway, and it was a hit, so three stars. I think I'll look for another recipe next time, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiernejm"
},
"reviewBody": "Perfect, just like the state fair"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idahomort"
},
"reviewBody": "So I made a half batch, kind of winging the batter recipe (and still ending up with what seemed like more batter than a regular recipe would make. I froze my curds (which were roast pepper and garlic infused! Yum!) for about an hour beforehand, breaking them up before they went in to freeze. I also double breaded them, dipping the frozen curds into beer, then flour, then the batter before going in to the oil. Turned out great! Had to do the entire production in two or three runs through the fryer, due to not wanting to overcook the first in and having the melty cheese run out. So I put curds in until the first in was nicely browned, then fished them out as they were done before starting the next batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adrienne Reilly"
},
"reviewBody": "I agree a bit with tcoeguy, the batter is very thin and my curds spread and stuck together. We added a tablespoon of flour to the second round and they cane out SO much better. Definitely stick to 6-8 per batch, or they will stick together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Vandenburg"
},
"reviewBody": "First attempt and they are OUTSTANDING!! Followed recipe (used Corona beer, yuk). Will play with different types of beer and will likely half the recipe ingredients so not so much waste. \nOverall, EXCELLENT! Thank you for sharing this!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeff Hutton"
},
"reviewBody": "Not good. The batter was way too watery and didn’t coat at all. Nearly doubled the flour before it started to stick and even then it didn’t work well. Would not recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick Staunton"
},
"reviewBody": "This is a great recipe. Tastes exactly like getting them at the fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernie Lueck"
},
"reviewBody": "Awesome recipe! Better than any fair curds I’ve ever had. The entire family devoured them. I used the batter on some chicken breasts which turned out tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "yeoboseyo"
},
"reviewBody": "Perfect fried cheese curds with no changes needed to the recipe. When there’s no State Fair, these are just like being there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tresia Adams Hoffmann"
},
"reviewBody": "Used Sprite for a non alcoholic version. I liked it a lot. Will definitely use again. I just wish the cheese curds browned faster than than the cheese melted in the oil, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reelko"
},
"reviewBody": "Added garlic salt, pepper and paprika to the batter for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "They came out great! I followed the recipe exactly and it worked. I was really scared to try it because it seemed that most people were saying the recipe wasn’t working. I did batter the curds and then put them in the freezer. We went for a walk so they were in there almost 2 hours. As soon as I got home I heated up the oil took them out of the freezer and lightly re-battered them again. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lantern"
},
"reviewBody": "We took our cheese curds out of the refrigerator an hour before cooking them. I dusted them with flour. I mixed the batter I put the batter by it self in the freezer for about 15 minutes. I put the batter on the cheese curds and put in the freezer for another 45 minutes they cooked beautifully in pan with canola oil. I had batter left over, so I tried it on broccoli, asparagus and pickles! They also turned out fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny Grubb Hatcher"
},
"reviewBody": "These were fantastic!! Followed the recipe pretty much exact but used vegetable oil because it's what I had. We added some seasoning to the batter based on other reviews but did everything else as stated. Cooked them in a pot on the stove over med-high, didn't have a thermometer so just had to watch them and adjust temperature as needed. You can tell when you drop them in if they are browning up quickly or if you need to up the temp a bit. Definitely a keeper of recipe! Would be perfect for shrimp or other things as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlene G Gambler"
},
"reviewBody": "The only thing I would change is don't add salt...a lot of the other ingredients has salt in them or sodium... I cook without salt and my food is awesome without all the sodium... I tried the cheese curds deep fried without the extra salt and they are fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lovely"
},
"reviewBody": "Very messy I think I will freeze them next time before I fry them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jla4444"
},
"reviewBody": "Great recipe! \nI did make a few suggested changes however.\nI made the batter as stated.\nI took out the cheese curds from the fridge and let warm up for a while. I put them in a zipper bag and added cornstarch, about 1 tablespoon, just enough for a thin coating on each curd and shook like crazy. I then, in small batches placed in the batter and coated the curds. I took the curds out of the batter with a slotted spoon, draining excess batter and placed on a cookie sheet pan and placed in the freezer for about 10 minutes and blast chilled. After chilling, just long enough for the batter to slightly form to the curd without dripping...I re-dipped them in the batter. A 2nd coating of batter! Put in the freezer again to chill the batter to the curd so it's not dripping; another 10 minutes, give or take. Don't freeze solid just chill so batter isn't dripping. When chilled place curds in small batches in your pot of hot oil (I suggest using an oil with a high smoking point). Don't over crowd your oil. Watch closely! Seriously only a minute or two and they are golden and done. Place on paper towels to drain and enjoy. Be careful they are hot! But delicious!\n*NOTE: you can add seasoning to your liking too. When you put the cornstarch on the curds add Paprika, Onion and garlic powder and cayenne pepper if desired. I just eyeball it. You can add the same seasonings to your batter as well if you want."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Brian"
},
"reviewBody": "Really good! I recommend freezing cheese curds over night before deep frying them. This will help them hold together in the 375 degree oil for 2min.\n\nAlso, refrigerate batter overnight. Again, to help cheese curds hold together while being fried in hot oil. They’ll still come out hot, but most importantly, intact. \n\n(Only fry a small hand full 4-7 at a time)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jace Cochese Theilman"
},
"reviewBody": "Go with 1 cup of beer instead of 3/4 and it's golden. I also don't use added salt. The curds are salty enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Medora Jensen"
},
"reviewBody": "I made these and shrimp tempura at the same time. I accidentally put a batch of curds in the tempura batter and they got very messy. This beer batter worked great and tarted amazing. I are too much though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anniemack"
},
"reviewBody": "I used wonton wrappers to contain cheese than battered and deep fried use this for cheese sticks also. Wrap, bread and fry. Works great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamzin72"
},
"reviewBody": "My family &amp; I really liked them. They were definitely right up there with some of the other fried cheese curds here in Wisconsin. I fried some with the regular yellow cheddar cheese curds &amp; then some with the white cheddar &amp; jalapeno curds. I froze the cheese curds ahead of time, broke them apart, battered them &amp; then put them in a pan with hot oil on my stove (while still frozen) for about 2 minutes for each small batch. None of mine stuck to anything. I honestly think freezing them before frying, helped with the cheese not oozing out while they were frying, like they did with the room temp or refrigerated ones. We will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dave Lewis"
},
"reviewBody": "Nope. the recipe as written is not good. I had the same problem where the cheese just sunk to the bottom into a giant mass. if the curds need to be frozen the recipe needs to be amended to include that. if the courage need to be dredged in flour the recipe needs to include that. as written this turned out disastrously for us. no"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tkeyah Daley"
},
"reviewBody": "I made this on a whim after buying some cheese curds from a famers market. I love beer battered foods but alas I don't drink. So i had to buy a pack of Yuengling and hoped for the best. After reading some of the other reviews, I coated the curds with cornstarch first before battering, but I didn't freeze them and it didn't seem to make them melt out, so the cornstarch is enough. However, if the oil isn't at 375 or hotter, I found that they took too long to cook and eventually the cheese would evaporate into the oil. \n\nI also used peanut oil some that's the best oil to fry with. \n\nI suggest taking them out if you notice a tiny bit of cheese escaping. That pretty much means it's done.\n\nSo the best way to make them is to have the oil hot enough and I also found that going straight from the batter to the oil made the batter fry up more smoothly and beautifully. If you batter them first and let them sit a while the batter isn't as full and smooth. \n\nI found it overall to taste delicious and highly recommend eating them as soon as they get out of the oil. It tastes best when hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Snowden"
},
"reviewBody": "Followed several others' suggestions; taking the individual curds and rolling them in corn starch certainly seemed to seal them well. Freezing after battering is a must in my opinion, had almost no leakage or mess! Great flavor, and will have to say they're better than the State Fair curds this year. Could be because I now live in Oklahoma instead of Ohio?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tamera W."
},
"reviewBody": "After reading some of the previous reviews we did add a little more seasoning to the batter. Gave the curds a shake in some corn starch, before battering/freezing for 45 mins. All the cheese melted or just plain disappeared. Only cooked for like a minute or just past. We had wonderful tasting \"shells\" of curds. Did use canola oil, not sure if that is at fault or not, but would like to know before trying to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob"
},
"reviewBody": "This recipe is always a hit. I've been told that these curds are \"Better than the state fair.\" which is a big compliment in Minnesota."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1bigtexan"
},
"reviewBody": "Followed the recipe and they turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lillie Moore"
},
"reviewBody": "The recipe as is doesn't work well, the cheese was leaking out of most of them. I finally started dusting them with flour before battering them and it worked much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Matthew Kroll"
},
"reviewBody": "Followed recipe exactly and this was the result. Melted cheese all over my deep fryer basket."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "The batter was flavorless and all of the curds melted :-("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BarbieBrown"
},
"reviewBody": "So my husband is from Wisconsin so thank you I’m from bermuda I didn’t even know what these things were his mom sent every month"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Laura Parsells Pasatiempo"
},
"reviewBody": "I made a batch today. The first batch was a disaster. It seemed the longer I let the curd sit in the batter the better they fried. It makes a mess! If you dont take them out in time they pop and cheese gets everywhere. They were tasty. The family thought they tasted similar to those we had in Green Bay, Wi. I would look for a different recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janet m"
},
"reviewBody": "This was an amazing recipe. I saw a review that said it was nothing but a mess...I’m thinking the oil was not hot enough? I had no problem and it tastes really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "yucky! waste of good curds"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLYFV75"
},
"reviewBody": "I have only had cheese curds at a bar in Minnesota. so when I bought since in Wisconsin, I had to try and impress my in-laws by making home made cheese curds (I'm from California, not known for fried cheese curds ??) I followed this recipe to a Time, and they were a huge hit, outstanding!!! I'd you're using a deep fryer don't use the basket, they'll stick. just plop them in. if yours didn't come out I'm guessing you didn't follow the exact recipe. my daughter loved them so much she keeps requesting them for our CA family. I'll be making them this week!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clayton Richard Duncan"
},
"reviewBody": "This is an awesome recipe, made them many times. 2 tips.\n\n1. Freeze the curds first\n2. Dust the curds with corn starch before battering. I use a ziploc makes it easy corn starch can go everywhere.\n\nOh and one other thing, get the oil as hot as possible, but don't burn it. I know its expensive, but coconut oil is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dlviols"
},
"reviewBody": "I must not have done something correct. These \"things\" couldn't have turned out any worse. Followed the directions to a T. As a lot of other reviewers who rated these low, I spent more time scraping the cheese from the deep fryer than cooking these things. Back to the drawing board."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smoky Mcpot"
},
"reviewBody": "Amazing Wisconsin cheese curd recipe here. One big thing you should note is that the cheese curds should be battered and frozen for at least 2 hours before putting them in the oil. I tried making them not frozen and ended up with cheese splattering out of the batter and made a big ol mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brioli"
},
"reviewBody": "Don't fall for the reviews that are bad...either the grease wasn't to 375 or they got scared and added more flour. I almost did because the batter seems so thin but did a trial run with them at room temperature. lightly dusted them with flour, that helped the batter stick, and they were left out over night, separated out, and at room temperature on parchment to absorb the moisture...this probably helped too...I don't know but they were perfect and the recipe just needs some added salt and seasonings. I followed the advice of some other reviewers and added a bit of paprika, garlic powder, pepper, and extra salt. first time making them and did about 5 at a time (didn't crowd) and used oil thermometer to stay at 375. Fried in coconut oil. DO NOT freeze, you will lose the squeaky freshness but if they are grocery store bought, it's already gone anyway :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookingmama"
},
"reviewBody": "After reading many of the previous reviews, I added some extra spices (cayenne, garlic and onion powder). I did not freeze or let the curds sweat. I kept them in the frig until I was ready to cook them. They came out fantastic! A definite make again for my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amina Angela Love Lawrence"
},
"reviewBody": "I added a little bit extra flour to thicken it, but other than that, it was perfect and reminded me of home, Minnesota."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Courtney Kaleel"
},
"reviewBody": "I've tried countless times to make cheese curds at home (I live in Wisconsin and they can get pricey at restaurants). The first couple times it ended up with a huge mess and burnt cheese stuck to the bottom of the pan. \nThe trick to them not melting all over the place is freezing them first. Completely frozen. The batter has a chance to cook before the cheese gets too melty and leaves the batter. Mine still end up melting out a bit and not restaurant quality but it soothes the cravings. \nThis batter is the perfect thickness though doesn't have much of a flavor. Add seasoning if you're into that kinda thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grace"
},
"reviewBody": "Just made this and turned out very well. Second batch the cheese melted out of the batter. I think this was because I let the oil cool down too much. Also I made the batter with Gluten free 1 to 1 flour for our daughter. Did not brown up as much as I would have liked but still tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gman"
},
"reviewBody": "I loved these curds. People have said before that theirs didn't work so well but I think I know the problem. I've made these two times recently. One time with canola oil and one time with corn oil. The corn oil worked great but the canola just couldn't keep the batter stuck to the curd. I think all the problems people are having is just the oil, not that they messed up and ingredient or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shannon Catherine"
},
"reviewBody": "After following every step, my friend and I could not figure a way to stop the cheese from melting. I used an indoor deep fryer and when I placed the cheese curds into the fryer, the batter and cheese would melt almost instantaneously and stick to the bottom of the fryer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy1104"
},
"reviewBody": "I put the curds in a single layer on a pan and froze them for 45 minutes. My curds were 3 days old from the dairy, so they were not extremely soft and wet. I also added about 1 tsp of Franks Red Hot sauce for a little zip. I heated my peanut oil to 375 and did the rest as the recipe stated. I was concerned the batter looked thin, but once I got it in the oil in turned a nice golden color and the cheese did not ooze out. I cooked mine on the side burner of our grill as I grilled Wisconsin brats that were boiled in Wisconsin beer...of course! I am proud to be a Cheesehead!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karin"
},
"reviewBody": "This is a light and crispy batter that's perfect for cheese curds, vegetables and fish! Don't be put off by how thin it is. It sticks perfectly to food and assures a fabulous result. I don't use any other batter. It's delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BadgerSteve"
},
"reviewBody": "Good for a basic fried cheese curd. I'm from Wisconsin and know a good curd. This batter didn't have much flavor and some of the curds leaked out before the batter had a chance to crust around the cheese. Best tip is to freeze your curds before putting them in the batter. Then drop the battered curds into the oil - shaking the basket immediately so they don't stick to the bottom. I'll keep looking for a better batter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAT22FAN01"
},
"reviewBody": "My Wisconsin born crew won't eat cheese curds once they've been refrigerated. I always wondered what to do with the leftovers. NOT ANYMORE! These tasted as if I we bought them at the fair. No tricks, no changes, just absolute deliciousness! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Jennifer Ruddat"
},
"reviewBody": "After reading all the reviews I followed the recipe as listed. I made sure to use corn oil and flour the curds before their oil bath. Turned out perfectly! Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4-square"
},
"reviewBody": "I have eaten them many times and they are phenomenal. Can anyone suggest the best beer to use?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules Lynk"
},
"reviewBody": "Tastes just like the Minnesota State Fair deep-fried cheese curds! Great when you can’t make it to the fair."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "After you batter, FREEZE the curds for about 30-60 min (I did 40 min). I did it both ways. The batch I froze turned out amazing!! The batch I didn't freeze, was very messy, stuck to the bottom of the basket and all the cheese oozed out. I also sprinkled Cajun seasoning over a few. Yum! Here are the steps I used:\nI brought the curds to room temp. Lightly rolled them in flour right before I battered them. Placed them on a wax paper-lined cookie sheet. Froze them for 40 min. Put them in the fryer basket and lowered the basket into hot oil. I just kept my eye on them and when they were golden brown, took them out. PERFECT! Dip in pizza sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Inf1n1tydxc"
},
"reviewBody": "This is not the proper batter for WI curds. Just tried it after reading reviews and instructions to a t. batter is far too thin. will not allow a deep fry application. (It's a BIG BIG mess) and cheese leaks out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angeljeng82"
},
"reviewBody": "This was my first attempt at making this dish so I worked slowly. I added a dash of black pepper for taste. My first batch all looked \" deflated\" but tasted good. On a whim, I added one more step before frying: roll in breadcrumbs. This gave them a finish more like fried mozzarella or hush puppies and also prevented the cheese from overcooking and deflating. I love them like this but realize this may break tradition too much for hard core curders!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ldiana Tisdale"
},
"reviewBody": "Are the people having trouble with the recipe using cheese or cheese curds? I did not know there was a difference I thought it was the repie name but there is a difference. Looking forward to ordering some real cheddar cheese curds then trying this recipe. We had them for the first time at wild wings and fell in love but they are expensive at the restaurant. Yummm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Sciborski Saddler"
},
"reviewBody": "These were amazing...made just as the recipe said and they turned out perfectly! The kids ate them as fast as I could make them!. Initially when the curds were put in the fryer they would stick to the bottom. But I stirred them and that helped! I will definitely use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Simmons"
},
"reviewBody": "My sister and I made these and they were sooooo good! I did add some garlic powder, paprika, season salt and pepper to the batter and we froze the curds overnight. Oh and we didn't use beer because we didn't have any, we club soda instead. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Crain"
},
"reviewBody": "Outstanding! I'm from Wisconsin so was able to pick up fresh farmer's market cheese curds. Followed the recipe exactly as written. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MikeB"
},
"reviewBody": "Very good recipe. I had no problem with the batter sticking on, or cheese oozing out and I didn't do anything other than what the recipe said. Used sunflower oil and a pan on the stove so I had complete control over oil temperature, maybe that helped. Agree that it could use a little more taste--maybe some dill or something else, it doesn't need to be spicy necessarily. Everyone still liked them, but I felt it just needed a little extra something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "briqsteez"
},
"reviewBody": "Perfection, made these for my fried cheese curd skeptic mother and she loved them. I'm from Iowa so I used Hansen's (a well known Iowa Dairy farm) white cheese curd's and they were delicious. We will definitely be having these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Julian Twisk"
},
"reviewBody": "I live 10 minutes from Wisconsin and we have the best deep fried cheese curds the world at the Minnesota State Fair. I thought these were delicious. The batter is nice and light and coats really well. I used a Hefeweitzen beer. Yum! I used Ellsworth Cheese Curds, made in WI and they are really good! If you do not have an electric deep fryer, invest in an instant-read digital thermometer so you can keep your oil temperature correct. Too hot or too cool and your curds will not fry well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janjan"
},
"reviewBody": "I tried fried cheese curds like a month ago for the first time at a local fair in Florida. I love cheese n have tried cheese curds but not fried omg I'm in haven with this recipe it turned out perfect. I ordered cheese curds from Wisconsin :-) paid more for the shipping than the actual cheese but it was worth it. The curds came out perfectly nothing sticked to the pan just Perfect. Flavorful way better than the one at the fair. Thank u for this awesome quick recipe:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msmel"
},
"reviewBody": "Canola oil over heats compared to other oils (I have made the same mistake in the past with other recipes). So, reduce the heat...might help. Or use the recommended oil. Second, when using wet batters it is best to lower them into the hot oil with a metal slotted spoon vice putting them in the basket then lowering in...helps prevent sticking. Hope this helps...cause these are the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tammy"
},
"reviewBody": "Excellent! I accidentally used full bottle of beer instead of 3/4 C. so first batter was runny... Added 1/3 C. flour to thicken and remaining batches were perfect! One minute max in fryer at 375 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "the eatery"
},
"reviewBody": "So most defiantly different tasting but I think that might have be due to the oil I used. Very simple recipe and can be made easily no matter who tries. This was my very first time making and having fried cheese curds nonetheless they came out really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina Herrera"
},
"reviewBody": "Cheese fan here, went to a Gouda factory (Oakdale Cheese in California) to get my curds. I did not let my curds sit out, they stayed cool until ready to dip. I added garlic parsley salt to half of them after frying, and some season-all salt to the rest, this cured the bland flavor. I think I am going to season my batter just like I do with my other fried foods. A bit before and after adds so much flavor! Use your favorite seasoning and you can not go wrong with these cheesy delights! \n\nI could not figure out a faster way to fry them all separately, so so I plopped them into the fryer in groups. It still turned out good, a giant tear apart cheese ball! \n\nOh and I used peanut oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilyschmidt13"
},
"reviewBody": "As a born and bred Minnesotan now living in Los Angeles, I was truly depressed to miss the State Fair (for the first time ever!) this year. I knew what I had to do -- replicate those little golden nuggets of goodness. And this recipe is AMAZING. I feel like I just left the Mouth Trap in the Food Barn. BUT it's very important to a) let the curds sit until room temperature and sweating and b) coat the cheese in flour before dipping in the batter. Don't be shy about coating them, it makes the batter stick when in oil. I also used twice the amount of salt because...hey, it's the fair. Now, if I could only figure out how to replicate Sweet Martha's cookies..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JaniceH"
},
"reviewBody": "For my first attempt at fried cheese curds it went very well. First ones in fryer melted. Dusted with flour and from there on, no problem. Agree they need a little more kick. Added some pepper, cayenne, and garlic powder as mentioned in reviews, but next time will add the full amount suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Salome"
},
"reviewBody": "Not the best I've had, but certainly the best I've ever made. The batter was pretty runny. But for the most part, they were pretty good. I wish the cheese wouldn't fall out so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trippw88"
},
"reviewBody": "I'm form Wisconsin and just have to say these are great!! Very close to the curds at the fair, I just added a little extra salt but I am a salt lover..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sandra C"
},
"reviewBody": "Cheese sunk to the bottom and stuck to the pan. I tried it several different ways but they all sunk. Maybe I need a special fryer. I did use the batter for thick mushroom slices and they were very good. Very little batter stuck to them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingmama"
},
"reviewBody": "As a WI dairy farming family, we had to try this. It was terrific! The taste was everything we had hoped for. We used fresh Mullins Cheese Curds. We laid them out flat on a cookie sheet in the freezer for a few minutes before dipping them in batter. This keeps the cheese from puddling in the hot deep fryer. I also topped them with another sprinkle of salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mommak"
},
"reviewBody": "Not bad, but not the best cheesecurds we've had. We live in Wisconsin, so we know our cheese! The batter is just a little thicker than we like it to be, and it was pretty blah tasting. I think it would just need more seasoning the next time around, but definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pleasuredeal"
},
"reviewBody": "like the batter a lot. Just the right tickness. \nOriginal recipe is very good as is, but if you would like more kick to it, following is a suggestion.\n\n1 TSP of cayenne\n1 TSP of black pepper\n1 TBS of paprika\n1 TBS of garlic powder\n\nNow this may seem like very spicy, but really it is not other than just a nice kick. It may be because the batter is only a thin coat and you dont pick up that much spices.\n\nNext time we will try with cajun spices.\nEnjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tcoeguy"
},
"reviewBody": "I hate giving this a bad review because I see the other good reviews and it makes me wonder if I did something wrong, but I followed the directions, and this was a train wreck. \n\nI used an indoor deep-fryer for frying. I had the cheese curds sitting out for a day before I used them, as others suggested, and coated them lightly with flour. I made the batter just as it is written and it looked like a thin pancake batter. \n\nI placed 6-8 of the battered cheese curds into the wire strainer that gets dipped into the grease and the curds immediately stuck to the bottom of the strainer. Those were ruined. Then I just plunked the battered curds directly into the oil, and that wasn't much better. The cheese almost immediately starts to ooze out of the coating and into my deep-fryer oil. It made a gigantic mess of my deep-fryer. \n\nAfter it was all said and done, maybe half of the curds I made actually retained their cheese (I did not over-cook them), and the ones that did retain their cheese weren't good.\n\nIn fairness, I admit I used canola oil instead of corn oil because that was what was in my deep fryer. After attempting to make these, I will have to replace the oil because it got destroyed. A LOT of the batter came off the cheese curds while frying. \n\nMaybe I did something wrong, but I love cheese curds and I will not try out this recipe again unless someone can tall me what I did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malina"
},
"reviewBody": "I made these using a ranch dill white cheddar curd. My family, living in SE MN and growing up on cheese curds, decided these were the best curds they have ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Tkachuck Gillenwaters"
},
"reviewBody": "We love cheese here in Wisconsin and cheese curds, especially. I am on a low-carb diet and am missing my snacks, but this recipe saved the day - these are the REAL DEAL, YUM!! To go low carb, I substituted canola oil for vegetable and coconut flour for all-purpose flour and they still tasted great. Thanks, Mark"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsoofie"
},
"reviewBody": "Are you kidding me??? These we SOOOOOOO good--just like at the fair. The trick is to find cheese curds--not so easy in my area. Not so healthy, but when something tastes this good, who cares?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skie2blu"
},
"reviewBody": "I made half a batch of these for my boyfriend (born &amp; raised in WI!) and he loved them! It was my first \"Fried Cheese Curd\" experience, but they were fantastic and I would definitely make them again.\n\nOne trick I read elsewhere - let the curds get to room temperature &amp; they will sweat a little... use the moisture to your advantage and coat them with a little flour before battering. It makes the batter stick a lot better!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216711/real-wisconsin-fried-cheese-curds/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
"name": "Cheese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216711/real-wisconsin-fried-cheese-curds/",
"name": "Real Wisconsin Fried Cheese Curds"
}
}
]
}
}
, "about": [
]
}
]