				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Real NY Jewish Rye Bread"
,"datePublished": "2019-04-03T23:54:13.000-04:00"
,"dateModified": "2023-01-12T09:20:35.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Dad's world famous"
,"url": "https://www.allrecipes.com/cook/7344577"
}
]
,"description": "This delicious rye bread is flavored with sour pickle juice and caraway seeds to create a crusty, unique-tasting loaf of New York-style rye bread."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rBWqpkXxRDJ7tPaHbTZu1og6jR8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7856765-real-ny-jewish-rye-bread-Patti-4x3-1-ea84b22dc1bc4ef59e89694dddcdcc99.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Real NY Jewish Rye Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "270"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "148 kcal"
,"carbohydrateContent": "23 g"
,"fiberContent": "3 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "191 mg"
,"sugarContent": "1 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 cups unbleached bread flour (such as King Arthur®)",
"1 cup dark rye flour",
"3 tablespoons dry potato flakes",
"2 tablespoons caraway seeds",
"1.5 tablespoons demerara sugar",
"2.5 teaspoons instant yeast",
"1.5 teaspoons sea salt",
"1 cup warm water",
"0.25 cup canola oil",
"0.25 cup sour pickle juice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place bread flour, rye flour, potato flakes, caraway seeds, demerara sugar, yeast, and sea salt in the bowl of a large stand mixer fitted with the paddle attachment. Turn mixer to low and thoroughly mix dry ingredients. Beat warm water, canola oil, and pickle juice into dry ingredients."
} ,{
"@type": "HowToStep"
,"text": "Switch to the dough hook attachment and beat until dough is rough and shaggy-looking. Cover bowl with plastic wrap and let rest for exactly 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove plastic wrap and knead with the dough hook until smooth, firm, and only slightly sticky, 6 to 8 minutes. Turn dough onto a floured work surface and knead until smooth, 1 to 2 more minutes."
} ,{
"@type": "HowToStep"
,"text": "Form dough into a ball. Lightly oil a large bowl, place the dough in the bowl and turn to coat. Cover the bowl with plastic wrap, set into a warm place, and let rise until nearly double, about 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Grease a 5x9-inch loaf pan. Turn dough onto a lightly oiled surface, shape into a log, and place into the prepared loaf pan. Cover with a cloth kitchen towel and let rise until top of dough has risen slightly over the top of the pan, 60 to 90 minutes."
} ,{
"@type": "HowToStep"
,"text": "Place rack in the middle of the oven; preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake loaf in preheated oven until golden brown and cooked through, about 35 minutes. The internal temperature of the bread should be 190 degrees F (90 degrees C). If loaf browns too quickly, cover loosely with a tent of aluminum foil with the shiny side out. Remove loaf from the pan and cool on a wire rack."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT205M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I found the bread to be salty and sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raloesing"
},
"reviewBody": "Followed recipe exactly - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "So wonderful! I always double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy O"
},
"reviewBody": "I have made this rye bread multiple times and it is perfect. I do not use the potato flakes and I don’t think they are missed. This recipe is easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made one loaf following the advice of folks who said that more of both flours were needed. Big mistake! So, I made it again today and with the amount of flour I needed to have for it not to be too sticky, it came out to 2 1/4 Cup of bread flour and 1 1/8 Cup of rye flour. The amount of extra flour needed in a recipe is dependent on the humidity of the flour and the air of your kitchen. Be careful about using too much flour off the bat! I used instant mashed potatoes for the potato flakes and Mt. Olive pickle juice that comes in 2 oz. (1/4 cup) bottles - exactly what the recipe calls for. I had ordered the demerara sugar via Amazon. It was easy to work the dough this time and it rose nicely. Texture and color great. It did not have quite the aroma of store bought rye bread. But it tasted like rye bread and more like the store bought when I toasted a slice of each. This is a good recipe to start with. Next time I might use 3/4 cup of water and 1/2 cup (two of those little bottles) of pickle juice. I think the difference in the aroma was how much pickle juice was used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "FABULOUS actually made 3 qts pickles yesterday so had juice. BEST thing the 190 degree internal temperature hint. looked done at 35 but needed 40 minutes. Texture , flavor great. A very forgiving dough for novice baker but longtime cook. Nice if you are doing something else as lot of proofing steps . I made pot roast at same time. WILL MAKE AGAIN"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The water to flour ratio is wrong! It should be about 3 1/4 cups I multiplied this recipe for four loaves so I could share some. Good thing my career was baking and noticed that ratio was off! Dough is resting now. Maybe I can post again with pictures later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I don't know what happened, but I followed the recipe exactly. It rose beatifully for each rise. I put it in the oven and sprayed with a little water for the rise. After 25 minutes, it had deflated by 2 to 3 inches and was now a flat top. I would appreciate any help as I love rye bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The recipe was easy to follow. It laid out the process well. I may have manipulated the dough too much when I made it into a log. It rose to slightly over the pan, but there was little oven spring. It tastes really good, but is a little dry. My sourdough rye has a lot more moisture. I will try this again, thanks. CP"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dutch Redman"
},
"reviewBody": "Amazing rye bread! Making my second loaf this morning, omitting the caraway seeds as per my wife’s request. I make bread almost daily, and although we do have a stand mixer, I choose to use the Armstrong method to make bread… by hand. Too easy! After the first rise, I formed the dough into a log and placed it on a piece of parchment paper on a cookie sheet and let it rise in our microwave with the underneath light turned on… perfect for proofing bread. Once the loaf had doubled in size, I brushed the loaf with an egg wash, then carefully picked it up by the edges of the paper and transferred it to a preheated pizza stone, paper and all. Easy peasy! Resulting loaf was beautiful and the crumb was not too delicate. Nice to have a rye bread recipe I can count on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this bread 3 times now. Don’t have Demerara sugar or potato flakes; I use standard granulated sugar instead, did without potato flakes. Everything else was done per this recipe. It comes out excellent every time! As far as flavor, the caraway seeds and pickle juice obviously are essential. As far as texture, this mix of flours works well, not too dense and not too soft. If I want rye bread, this is my go to! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Best ever. Made a few recipe changes and added another 1/4 cup BF. The dough was tacky but it may have come around without adding it. I will add both BF and Rye in poportion next time if I do add. Actually I am baking another loaf today. Being a sourdough lover, I cut the yeast back to a bit less than half Teaspoon and added 100 g sourdough starter. Baked at 350 as directed. I proofed it for 4-5 hours but could have gone another 30-60 minutes. Will do so next time. Got a huge loaf and it was super good as I love rye. This makes fantastic toast but I like it as is with just butter. Plan to used it for sanwiches. This is a fantastic loaf to play with a bit and also I used Guinness dark beer rather than water. Not sure how it changed anything but it was a 10+ loaf so will continue with the Guinness. This is a very forgiving loaf and no matter how you make it you will have good bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Bread is good, only had kosher dill pickle juice to use, work ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roger Baron"
},
"reviewBody": "I used organic whole wheat and rye flour and potato starch instead of flakes without caraway seeds - light and fluffy and plenty of rye flavor - delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Regina's Kitchen"
},
"reviewBody": "Was skeptical about adding pickle juice, but I couldn't believe how great the bread turned out. Now I always have pickle juice in my fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gealeanmurray"
},
"reviewBody": "This turned out fantastic! I did make two slight alterations. 1- I couldn’t find madura sugar so I used molasses instead. 2- I added the liquid ingredients to the mixing bowl, and then the mixed dry ingredients to the liquids. This helped make sure better incorporation. Otherwise, this recipe is perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Fallis"
},
"reviewBody": "I didn't have potato flakes or demarara sugar on hand and swapped for corn starch (yes, this can be used as a potato flake substitute for texture) and white sugar in equal measurements. The dough rose beautifully, baked up golden and tasted perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! I have made it several times any it always comes out great. I do add vital gluten 1 1/2 tablespoon and I soak the caraway seeds to soften them in the pickle juice and oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kentstar"
},
"reviewBody": "Made this delicious bread today! Oh my! So good! I did make a couple substitutions as I didn't have all the right ingredients on hand. I used 1 cup each of dark rye, all purpose white, and Whole Wheat flours. I had to use Kosher Dill Pickle juice and used regular granulated sugar instead of the demerara sugar. The bread came out fantastic! I will be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillcoopjill"
},
"reviewBody": "Made exactly as written.... omg.... best rye Bread EVER! I did not need to let the two rises go for as long as the instructions said.... so, my time was cut by 40 minutes.... couldn't stop eating it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "catmom"
},
"reviewBody": "FIrst off, changes to recipes should NOT be allowed in rating the recipe. You want to change things post your own recipe! Rye flour is quite different as it doesn't have any gluten (and neither do potato flakes BTW), so either bread flour (which has added gluten) or adding gluten flour to all purpose flour is needed. The 30 min rest after mixing is also needed. This recipe was so easy, so well written, and the loaf came out perfectly! A lovely grain, soft, sliced well. I did use a glass loaf pan for this, where with other breads I would form a round. I will be making this often, doubling the recipe. Second time around I didn't have pickle juice, and added blackstrap molasses and whole caraway seeds, which I liked a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent and quick rye bread recipe. I followed the recipe almost exactly. The only thing I substituted was the demerara sugar. I used cane sugar instead. I live in the desert and didn't expect to need to add more flour, but I did. The dough was too sticky and wet. I estimated I added approximately 1/4 cup more flour. I used half rye and half bread flour. Tonight we are using the bread for leftover corned beef sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Used the bread maker, set to Dark. Measurements are spot on. I always launch the yeast first, mixing it separately with the sugar and water to get it started. Substituted light brown sugar. Result was crispy crust and decent chew. ROUND 2: Then I made it again and made it even better! This time I let the machine mix it and first rise, but I proofed the dough for the second rise on a lightly oiled baking sheet and cooked it in the oven. I put an egg wash over it to glaze the crust and scored the top. Also, I increased the caraway seeds to 3 tablespoons.. I also added a tablespoon of white vinegar to the pickle juice to increase the sour element. Perfection. Reubens tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank Young"
},
"reviewBody": "I followed the recipe exactly and have made it using a mixer and in a bread machine. The bread turned out fantastic using both methods. I used the basic cycle in the bread machine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erik"
},
"reviewBody": "This is perfection. Follow the recipe for a perfect result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jj8527"
},
"reviewBody": "Love it. It came out great even though I made an error. I completely forgot to rest the dough when it got to a shaggy stage. So, I just took it out of the mixer after it had been going for 5 minutes or so. I continued to knead by hand for another 5-10 minutes then did my first rise, then shaping and second rise. Came out great. I added my photos to the others. Worst thing about it is that I eat way too much of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jane.kibe12431"
},
"reviewBody": "This is the best rye bread I ever made ! Delicious flavor. I didn't have pickle juice so I used apple cider vinegar. I no longer need those other recipes for rye because I'll never use the others. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I absolutely loved the flavour of this bread...wondering if the pickle juice is the key. I was disappointed in the texture which was too much like a fluffy white bread. It would never be able to withstand juicy smoked meat! I made it twice, both times without potato flakes (didn't find a need to reduce the water) and with extra caraway. The first time I used 2 cups bread flour, 1 cup rye flour as per recipe. The second time I thought I might make it denser with 1.5 c of each flour. The loaves looked and tasted identical. I am wondering about reducing the yeast to inhibit the rise a bit more. Outstanding flavour though! Was reading up a bit on flours and was surprised to find that Canadian AP flour has a higher protein content than U.S. AP flour. Some articles suggested that it is very close to U.S. bread flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zerocattle"
},
"reviewBody": "Followed the instructions as written and found it to be quite delicious and a little fluffy, but everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Lee"
},
"reviewBody": "This recipe was pretty interesting with pickle juice and potato flakes. I made it for fun, not expecting much based on reviews, but WOW. \nFollowing directions exactly, my loaf did not rise the first time around so I added some additional yeast dissolved in warm water and sugar, added enough additional flour to soak it up, and sent it through my bread machine on Rapid Loaf to see what would happen. \nIt DID rise the second time and came out beautiful. The crust is crisp, the inside tender with a medium-small crumb. \nMy loaf is best made as toast which really brings out the flavors. Not toasted it doesn't taste as good. \nI will make this again with the intent of toast, not fresh sandwich bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooker"
},
"reviewBody": "Great recipe! I have made it a few times exactly to the recipe. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwrogers1"
},
"reviewBody": "This turned out great! At the last minute I realized I didn't have bread flour so I made this with regular AP flour. To adjust for the AP flour, I used just a tiny bit less water. I otherwise followed the recipe exactly. The flavor is good, the texture is good. Makes great toast! I'll make this again, and will try it with bread flour next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauren.quinn23"
},
"reviewBody": "This is by FAR the best rye bread recipe, let alone bread recipe in general! Pickle juice is key, the acid lends yeast a helping hand in the rise and makes the crust unbelievable, also caraway + pickle juice is an unbelievable flavor pairing. KUDOS! Will be using this for the rest of my bread eating life thank you very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Brown"
},
"reviewBody": "I've tried many rye bread recipes over the years; this one is my favorite. First time, I didn't have pickle juice, so used vinegar. Later, when I used pickle juice, we preferred the vinegar. Thanks for the fantastic recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie Knight"
},
"reviewBody": "I added 1 tablespoon of dried minced onion and 1 teaspoon black pepper; also used the Previously-recommended 2 tablespoons wheat gluten instead of potato flakes). And since I make bread aLOT, I buy yeast in bulk so used 1 tablespoon instead of the 1 packet equivalent.\n\nThe kitchen aid was used to mix and rise. I just covered the bowl with plastic wrap after coating my hands and rubbing the dough all over first.\n\nI let it rise almost to the top, then turned it out and kneaded it a little. I didn’t need any flour at all either. The consistency was just perfectly lovely.\n\nI put it in a deep loaf pan and let it rise again in the oven. When it was domed nicely and several inches above the edge, I left it in the oven even during preheating and cooked it 35-40 minutes until it was 190 inside. \n\nBest rye bread I’ve had bar none. Adding the juice was brilliant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "Good recipe that I will make again. The bread is soft, like the sandwich loaf you would get from a grocery store. That isn't what I expected. But, unlike the artisan bread I normally make it lasted several days without going stale. \n\nI didn't have potato flakes, but I found some dried hash browns that I used. I soaked them in the hot water before I made the rest of the bread. I did not find any chunks in my bread. \n\nI used kosher pickle juice. \n\nI added a tablespoon or so of gluten flour to up the chewiness. I might add more the next time around. And I think I will leave out the caraway or grind it. We like caraway, but this didn't really need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howard Weiss"
},
"reviewBody": "My only problem is that after final rise when I take it out of the oven it flattens out. Not sure why..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keric Funk"
},
"reviewBody": "Amazing... simply amazing! I made this recipe in my stand mixer and finished hand kneading for a couple minutes. I found the original recipe and added back the caraway seeds (2 tbsp) which added the authentic flavour I was looking for. Bread was soft and had nice crumb structure. I will make this for the rest of my life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Short n' Sweet"
},
"reviewBody": "Followed the ingredient list exactly. I used by bread machine to make the dough, removed it and formed it into a round loaf, let it rise and baked as directed. It was soooooo good. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "habenaroman"
},
"reviewBody": "I had to add extra flour. Made 2 medium-sized loaves. Awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Estes Annie"
},
"reviewBody": "Made this at 8000 ft using 1/3 cup plain mashed potatoes instead of the potato flakes and 2 T. More water. Baked it in a 13x 3 \" pan for 15 min @ 375 then 25 minutes at 350. Took it out of pan and put on lowest oven rack for 3 more minutes. Dough was not terribly sticky like some rye bread recipes. Thanks for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Pnw"
},
"reviewBody": "Great recipe. Makes a very tasty Rye to be proud of. Yum yum yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellvee"
},
"reviewBody": "So Easy and Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momar"
},
"reviewBody": "Don’t change a thing on this recipe. Follow the directions exactly, even if you don’t know when it’s “rough and shaggy-looking”. Dough will be sticky when the 8 minute machine kneading is done. Don’t worry, hand knead it for 2 minutes and put it in the greased bowl. I’ve made it twice and will never buy store rye again. Thanks Dad’s world famous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "Made this last week Hubby didn't care for the pickle juice. I loved it so much, I'll make it again for myself! Different from other ryes, but really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kconeill"
},
"reviewBody": "Made as directed. This is excellent. Very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Allender"
},
"reviewBody": "What an amazing loaf of bread. The crust was tender and it had a soft crumb.\nI proofed my yeast with warm water and a little honey. I processed the dough in my bread machine and baked it in a loaf pan in the oven.\nI used dillpickle juice which I could taste but the kids could not.\nI will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuciW"
},
"reviewBody": "Great, easy to follow recipe! First time making rye bread. Rose beautifully. Followed directions exactly. Prettiest loaf of bread I've ever baked! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Byrne"
},
"reviewBody": "This bread was the very first loaf I have ever baked. \nI added extra oil in the baking pan and ended up with a beautifully crunchy and buttery bottom crust. \nI’m making a second load right now. \nThis loaf will definitely get you laid. Especially if your date is Jewish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Wright"
},
"reviewBody": "This is a very good rye bread. If you want a nice crust on the outside, put a shallow pan of water on the low rack in your oven. The steam will help the texture and it will be a perfect loaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan M."
},
"reviewBody": "Delicious as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mom in LA"
},
"reviewBody": "The flavor is good but the crust is wrong. I may try it in a Dutch oven or straight on a cookie sheet for a chewier crust all over. In a loaf pan it is soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen Hoyt"
},
"reviewBody": "I activated the yeast with the sugar and warm water before adding it. This is the best loaf of bread I’ve ever made and am kind of ridiculously proud."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Whitman"
},
"reviewBody": "This bread is great! Like the author I too live in the Tri-State NY, NJ CT region. There are so many really good bakeries here. This bread would be at home in any of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "violin69"
},
"reviewBody": "This recipe is a keeper. The last time, I attempted rye bread with another recipe, it came out dense. This recipe had a great rise and wonderful flavor. I did alter how I added the ingredients by making a poolish with the rye flour, water, and yeast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juleigh Barringer Miller"
},
"reviewBody": "Really good rye bread. I have recently discovered that if I bake with heritage wheat I am able to tolerate the gluten. I have been gluten intolerant for 10 years. This is my first attempt at making rye bread since my discovery. I am so looking forward to a roast beef sandwich with this bread and smoked horseradish sauce. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Artocopus"
},
"reviewBody": "Delicious, authentic take on Jewish rye. Very good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BellaSings"
},
"reviewBody": "Super simple recipe. I just started baking about 6 months ago and I've made this bread several times; it's always perfect. I'm always swapping out an ingredient for something I already have in the house (e.g. rapid-rise yeast instead of regular, dark brown sugar/ not demerara, dill pickle juice instead of sour) - no problems. It's always yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta Henson"
},
"reviewBody": "Very good and tasty, nice and light."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "This came out great. The only change I made was to cut the caraway seed in half as it seemed like a lot... and the family really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennette Greed"
},
"reviewBody": "Excellent recipe. Thabk you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne"
},
"reviewBody": "This is one of the best breads I ever made. It makes the best pastrami sandwiches. Ham egg and cheese sandwich, And my favorite Collard green melt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Lauterio"
},
"reviewBody": "This recipe is perfect. I made it exactly like the recipe says and the bread came out so good. I would use a large loaf pan because it has a lot of rise. This is definitely a keeper I will be making it over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elsa Sand"
},
"reviewBody": "Rye bread is my all-time favorite and for some reason I’ve never made it until today. Thank you, thank you, for the wonderful recipe. I had to take a taste while it was still warm and it’s amazing. I may have added a little bit more caraway seed because I thoroughly enjoy that but other than that your recipe was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "John Z"
},
"reviewBody": "ok no, NO, this wasn't' even close to the seeded rye bread from Grossingers or loaves used in NYC delis. Too light and fluffy interior, too dry (but almost chewy enough) crust. \n\nI followed the recipe to a tee, but this was really disappointing. \n\nThe only reason I'm giving a two vs. one star is I live in a warmer climate and perhaps some compensation in rising and baking times is warranted. But even given that, it might make a better loaf but not a NY-style rye bread!\n\nOn the plus side, good way to use pickle juice you'd otherwise just flush down the drain ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harry"
},
"reviewBody": "I believe this is the best rye bread I have ever had. Better than any bakery I’ve been to and I will definitely never buy off the shelf again. Followed the recipe to the letter and it turned out perfect!\nThanks for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jhagge1"
},
"reviewBody": "I’ve made this twice and the loaves got HUGE! The expansion makes it very fragile. Bread slices fall apart when spreading condiments on them! Could this be because of the large amount of oil? I usually use half the amount for a white sandwich loaf. Otherwise, great tasting loaf! Good enough to make a third attempt. I will lessen the oil next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Shea"
},
"reviewBody": "Don't leave out the pickle juice! Made this as written and it's amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JPN"
},
"reviewBody": "Okay, I am sure it is just me but I've followed this recipe twice and both times ended up with bricks so I'm asking for some advice. The dough doubles in size on the first rise - great. I put it in the 5x9 pan and wait 90 minutes but it never rises over the top per the recipe. I bake it and it actually shrinks in the oven instead of rising! I use fresh instant yeast - one packet which says it's 2 1/4 teaspoons. I know the recipe calls for 2 1/2. Would 1/4 tsp make that much of a difference? I am thinking of adding two packets of yeast and trying again. The bread tastes great but is unusable for sandwiches, etc. Help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William"
},
"reviewBody": "I followed the recipe with the exception of helpful tip from the comments. I Reduced water by 1/4c since I did not have potato flakes. Delicious! Crusty outside with soft inside. Mine did not get as dark as the picture I saw so next time I’ll try it at 415F temp for the first 15 min and then go down to 350F. I already do that for another bread I make and it works great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L2Y2"
},
"reviewBody": "This rye bread is incredible. It's probably the best rye bread I have ever had. So easy to make. I am at high altitude (7800 ft) and it rose very quickly. I adjusted the proofing times down by 25%. No other adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I've made this recipe a few times and it is great. I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNN39SCAF"
},
"reviewBody": "excellent bread!!!! very easy, just takes time, but so worth it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Bense"
},
"reviewBody": "I did make a few changes. I didn't have potato flake so I decreased the water by 1/4 c. as another reviewer suggested. I also do not have the sugar called for so I used light brown sugar and that worked just fine. \n\nIt's the pickle juice, folks! Wow! I will be buying mashed potato flake, and now I have to buy more caraway seed because I don't have enough to make another loaf, and this one is going to disappear in a New York minute!\n\nHonestly, thanks for posting this recipe. Going forward, I may use this recipe as a jumping off point to make our own marble rye bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seanmat70"
},
"reviewBody": "This is great bread! I was skeptical at first, but dang it turned out pretty darn good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charlesb"
},
"reviewBody": "Fabulous recipe. One of the best rye breads I’ve ever had. I made a couple small alterations. I lightly toasted the caraway seeds before mixing into flour. I added 1 tbs. diastatic malt powder, I omitted the potato flakes, and lastly I used a preheated pizza stone to bake on instead of a bread pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WONDERFULLY DELICIOS! Dough is not bulky so you may have to knead in a little more flour to get the dough right and the gluten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "princesshexx"
},
"reviewBody": "WONDERFULLY DELICIOS! Dough is not bulky so you may have to knead in a little more flour to get the dough right and the gluten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Wells"
},
"reviewBody": "Made exactly as written. Excellent. Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joane"
},
"reviewBody": "Perfect loaf of rye bread! I made it in my bread machine. I used turbinado sugar and dill pickle juice (what I had on hand). Great crust and bread is spot on rye. I won't even try other recipes. This will be my go to for true rye."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Philip"
},
"reviewBody": "My 1st time baking bread; so some small challenges/changes for next time : It was very sticky taking it out of mixing bowl, my wife suggested adding a little more flour and mixing again...that worked. My bread pan was slightly smaller than 5x9; I think I'll do it on a baking sheet next time. I find the suggested amount of caraway seeds was insufficient; so I'll double up next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Relle Zimann"
},
"reviewBody": "This is so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RhondaDoubleU"
},
"reviewBody": "I am a brand new bread maker &amp; this was the FIRST yeast bread I have ever made (I've been tinkering with sourdough for about a month). I literally created an account on this site just so I could review this stellar recipe! If I can make this turn out well, you certainly can.\n\nFollowed the recipe &amp; directions exactly, using instant yeast right out of the freezer(!), &amp; my efforts were blessed with a beautifully browned, lofty loaf of the most delicious bread with a nice tender crust &amp; pillowy interior. We cut into the loaf for dinner &amp; there was only about 1/4 left by the end of the meal (with only 4 of us eating). \n\nSealed the remaining 1/4 loaf in a ziploc bag with all of the air squeezed out, &amp; it's just as fresh today as yesterday, so this would be a great make-ahead recipe or one for gifting.\n\nThe lack of weighted measurements was no problem whatsoever. Don't be tempted to omit the pickle juice, you won't taste it at all but when you mix it into the other ingredients, you'll immediately be hit with the exact aroma you recognize as Jewish Rye Bread! If you're on the fence about whether this is an exceptional recipe - just make it &amp; see for yourself. \n\nTo Dad's world famous: THANK YOU for sharing this recipe with the world!!! It's a gem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I am a new bread maker and am really enjoying it. This was my sixth recipe and the best thus far. I made it yesterday and made Reuben sandwiches from the bread for my family today. Everything was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edelkind"
},
"reviewBody": "I loved it! I was hesitant to use \"pickle juice\" but having tried to make a good kosher rye (like Katz's bakery in Monticell, N.Y.\" and failed for over twenty years, I decided to give it a try.\n Oh my God! It is delicious. The only thing that I \"added\" to this was to brush it with a cornstarch/water glaze to make the crust shiny and \"crusty\". \n My son's have devoured half of the loaf already.\n Thank you sooooooooo much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Really good rye bread and easy to make. I used sauerkraut juice instead of pickle juice because that was all I had. Great addition to our quarantined day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "Very salty, could be the pickle juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renato P"
},
"reviewBody": "So incredibly easy and makes an amazing loaf. Only drawback is that it won’t last more than an hour. We made it with Danish Rugkerner that we ground ourselves instead of rye flour. We also didn’t do it in a loaf pan but instead made it into a free sitting loaf (like a sourdough or pain de campagne) and It was simply amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia"
},
"reviewBody": "I have made this bread 3 times. It is great. The last time I wanted dill rye but couldn't find a recipe that sounded as good so I used this recipe and added 1 and 1/2 tablespoon of dill weed. It turned out great. I did freeform."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peri Tobin"
},
"reviewBody": "Delicious bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "I made no changes to the recipe. My husband went bonkers over it! He said it was the best rye bread he has ever eaten. I made another loaf and had my husband deliver to our daughter. My granddaughter was there visiting and the two of them ate the entire loaf because it was so good! I will definitely be making this more often!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GemmyGems"
},
"reviewBody": "I didn't have pickles for the juice but I used a scant 1/4 cup of pickle relish and it was great. It gave great flavor and you didn't see it in the bread. I made it with the dough hook in my kitchen aid and baked it in a homemade cloche. Really came out like the NY Rye I grew up with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessimc"
},
"reviewBody": "The only I did that differed from the recipe was that I did not add any caraway seeds-didn’t have any. It was so delicious ! The crust was crispy, not hard. The inside was so tender and light! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dad's world famous"
},
"reviewBody": "Thank you Howard W. for the perfect presentation to my bread recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathleen"
},
"reviewBody": "I was very happy with this recipe. It was the first time I made it so I want to make a few little timing adjustments, but overall, I would give this 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "This is hands down the best rye bread I’ve ever made! It’s a keeper! The only change I made was adding 1 TBSP of blackstrap molasses. The texture was soft and chewy, the flavour was great, and it made a delicious sandwich! My husband loved it. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ela from Ohio"
},
"reviewBody": "The recipe is infallible. The bread is divine. I have to tear myself away from eating another slice. I used an egg wash on the top. My husband and my neighbors love the bread too. Skipped the caraway seeds, because I dislike them. Kneaded by hand for 10 minutes. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRWNYZ"
},
"reviewBody": "Always a big hit! The secret is the pickle juice. \nOne thing I do wrong is add too much yeast at times. I must remember that. Kind of fell in the middle but, in spite of that, still was a wonderful tasting bread...great toast too."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230396/real-ny-jewish-rye-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
"name": "Whole Grain Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15034/bread/yeast-bread/whole-grain-bread/rye-bread/",
"name": "Rye Bread"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230396/real-ny-jewish-rye-bread/",
"name": "Real NY Jewish Rye Bread"
}
}
]
}
}
, "about": [
]
}
]