				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Real Homemade Tamales"
,"datePublished": "2001-03-29T12:40:32.000-05:00"
,"dateModified": "2023-03-20T07:34:13.551-04:00"
,"author": [
{"@type": "Person"
,"name": "SADDIECAT"
,"url": "https://www.allrecipes.com/cook/270523"
}
]
,"description": "These tasty tamales are made from scratch with tender braised pork in an easy chile sauce, wrapped in a traditional dough and corn husks, and steamed."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/s4ak-WFOMsFK-vHkX2dRIKw12Mg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/417213-54e4b869e0ed4b4b925a1365eef7ed2e.jpg",
"height": 600,
"width": 600
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1794053210001",
"description": "There's nothing quite like authentic Mexican tamales. These are rich and satisfying.",
"duration": "PT6M13S",
"name": "Real Homemade Tamales",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/8e1cde0f-0d56-4c22-bf5f-8a85aa2ff04e/4d4b0d5e-a5ee-4acb-8ca5-034652f04ba5/1280x720/match/image.jpg",
"uploadDate": "2021-03-11T01:44:01.237-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Real Homemade Tamales"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "304"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "236 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "37 mg"
,"fiberContent": "2 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "401 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["Mexican"]
,"recipeIngredient": [
"1.25 pounds pork loin",
"1 large onion, halved",
"1 clove garlic",
"4 dried chile peppers",
"2 cups water",
"1.5 teaspoons salt",
"1 (8 ounce) package dried corn husks",
"0.66666668653488 cup lard",
"1 (10.5 ounce) can beef broth, or as needed",
"2 cups masa harina",
"1 teaspoon baking powder",
"0.5 teaspoon salt",
"1 cup sour cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make the filling: Place pork, onion, and garlic in a Dutch oven. Add enough water to cover and bring to a boil. Reduce heat to low and simmer until pork is cooked through, about 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make chile sauce: Use rubber gloves to remove stems and seeds from chiles. Place chiles in a saucepan with 2 cups water. Simmer, uncovered, for 20 minutes. Remove from heat and cool."
} ,{
"@type": "HowToStep"
,"text": "Transfer chiles and cooking water to a blender and blend until smooth. Strain mixture into a bowl and stir in salt. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Shred cooked pork and mix in 1 cup chile sauce. Reserve remaining sauce for serving."
} ,{
"@type": "HowToStep"
,"text": "Prepare husks and dough: Soak corn husks in a bowl of warm water until softened, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "While the husks are soaking, beat lard with 1 tablespoon broth until fluffy. Combine masa harina, baking powder, and salt in a separate bowl; stir into the lard mixture, adding more broth as needed to form a spongy dough."
} ,{
"@type": "HowToStep"
,"text": "Remove husks from water and pat dry. Spread dough out over husks to 1/4- to 1/2-inch thick."
} ,{
"@type": "HowToStep"
,"text": "Place 1 tablespoon pork filling over center of each. Fold the sides, top, and bottom of each husk in toward the center to enclose dough."
} ,{
"@type": "HowToStep"
,"text": "Arrange tamales in a steamer basket. Place over simmering water and steam for 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/s4ak-WFOMsFK-vHkX2dRIKw12Mg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/417213-54e4b869e0ed4b4b925a1365eef7ed2e.jpg"
}
]
,"text": "Remove tamales from husks. Drizzle with remaining chile sauce and top with sour cream, or mix sour cream into chile sauce first for a creamy sauce."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT210M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy S Chatham"
},
"reviewBody": "I used the cooking water from the pork roast for the masa mix. No need to open a can of beef stock! Other than that, I love this recipe and have been making it at New Year since 2013."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phillip"
},
"reviewBody": "First time making tamales. I watched several videos and read through the recipe many times. The filing was great though I used roast instead of pork or chicken. The masa did not have any flavor and was crumbly after cooking. I did put some of the hot sauce in the masa, but I guess I did not put enough? I mixed the lard and some beef broth for a long time before adding the dry ingredients. Still the masa did not keep its form, was dry, and tasted like flour. the masa I used is called \"Masa Brosa\" Harina De Maiz Instant Corn Masa. Hopefully I used the right kind. I steamed them for an hour, but when I removed the husk, it did not come off cleanly. Anyone know what I did wrong ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big Dog"
},
"reviewBody": "I made this as written, except I used 4 bone-in pork chops that were buried deep in my freezer, and they are fantastic! I doubled the recipe and it yielded about 50 tamales. Next time I'll make more sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgie3!"
},
"reviewBody": "I made this for the first time a few weeks ago. My family all went nuts!! I took my first batch to my nephews party and those 12 tamales lasted about 3 minutes. I made them again for my brother...he ate 6 in about 15 minutes (alone with some refried beans and rice). He said, \"You got it Sis!\" That is a definite OK from him. Now all I hear is when are you going to make tamales again? Followed the recipe except for one thing. I used guajillo peppers instead. ABSOLUTELY DELISH!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IFortuna"
},
"reviewBody": "Pork loin is too lean, use pork butt or pork picnic roast. Also add, cumin, oregano and chile powder, mild or hot or a mixture to the pulled pork. This gives the meat color and looks more appetizing than just old gray meat. Make a little gravy out of it by adding the pork cooking water to the spices and a very small amount of whatever flour you like. Mix and pour over meat then wrap in the corn meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jayna lou"
},
"reviewBody": "Thanks to your recipe and a few of the comments, my homemade tamales are even better than those I get from the little old lady selling them from the back of her van!! (I live in a predominantly Mexican neighborhood). Thank so much to you and everyone who chimed in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patti"
},
"reviewBody": "These are excellent! I have been making Tamales for 20 years, this year we moved and I didn't have my recipes, so I used this one. I make my own masa because my husband is gluten free. If you want great Tamales I saw yes, try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caya Holguin"
},
"reviewBody": "I love this recipe. I made the mistake of adding the sour cream into the Masa recipe. Well things happen for a reason. They are delicious. My mom even asked me for this recipe For 32 tamales I added 1 cup of sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anna Lamb"
},
"reviewBody": "I will try again as my first batch turned out very dry. I followed directions to a t and took the masa to the consistency in the video but the masa was dry dry dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "I lived in NM for 30 years and make tamales every year. I always add garlic and dried oregano to both the meat (I always use pork shoulder or butt) and the chili sauce. I also use the pork cooking liquid in my masa mix and always lard. No need to the the corn husks. Just leave a 3\" \" tail\" to fold up. If packed well, standing upright in the steamer, they will hold fine after steamed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "L8tD"
},
"reviewBody": "I've been making tamales, or at least helping since I became school age. First, please go through these many reviews for seasoning suggestions as this recipe has no seasoning and such your tamales will be bland and tasteless. Make sure to boil your chilis with onions, garlic, cumin and other seasonings you choose. To make your sauce use the meat stock. Note that the call for sour cream is not traditional and seems odd to me. Perhaps as a topping, maybe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Baer"
},
"reviewBody": "Helpful hint:\nPut a couple pennies in the bottom of the steamer. When your water level is too low you’ll hear the pennies rattling. Time to add more water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "The recipe and video were perfectly timed, especially if any note taking is planned. It might even be worth making our own masa, given the excellent directions and simplicity of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lsalafia"
},
"reviewBody": "These tamales were a lot easier to make than I thought. I was so pleased with the taste and flavor. I used a little less corn paste than directed, I like a more meaty bite to my tamales. A very simple recipe packed with flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JustMe"
},
"reviewBody": "My family loved this recipe, but I thought it was a bit bland. Next time I will be sure to spice it up with green chilies. I used beef instead of pork and cooked it in a crock pot on the low setting overnight. turned it off when I got up 5 hours later. That gave the meat time to rest before shredding it just before making the dough at noon. These take a lot of time to make, but well worth the effort if you plan for it. Husband is now demanding I make these at least once a week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Klei Custodio"
},
"reviewBody": "First time to make tamales and my family loved it! I didn't know how to spread out the masa dough properly so it came out mostly meat but still loved it. I put the pork overnight on a slow cooker with spices and onions and garlic and a new mexico dried chili pepper. I took advice from other reviews and combined them, I was slightly worried that it would come out a mess but it didn't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Hallam"
},
"reviewBody": "This is a really great recipe. The flavor came out great. The salt is a very important piece in this recipe. Many people who make tamales don’t use enough salt which can make them taste bland. I mean, you definitely don’t want to overdo it, but do not skimp on it. The salt brings out the good flavor in the masa and also in the pepper puree. \nI had to improvise because I couldn’t find any corn flour in the two stores on my island. I just blended down some cornmeal and it worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Drew Espinosa"
},
"reviewBody": "I followed this recipe which was my first time making tamales. Its a dish I’ve wanted to make for a long time and something I would like to perfect. They came out delicious, my family enjoyed them. However, I do plan on adding additional ingredients to the masa as some of the other reviews and my cousin have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sade Morris"
},
"reviewBody": "It was delicious! My boyfriend-who is a chef-tried it first and once he got quiet and kept eating I knew that this was a solide recipe. I used pork (as recommended) for mine and jackfruit for my boyfriend! This is now my go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victor"
},
"reviewBody": "My first attempt at tamales. I followed this recipe except in place or shortening I used lard. I thought they were great. But to my surprise friends and family raved about them. Many comments such as “best tamales I’ve ever had”. Thank you for posting such a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bob Butler"
},
"reviewBody": "Used chicken. Added salsa because it really needed about twice as much red sauce. I recommend using twice as many California chilies.\n\nThey are great! It took a bit longer than expected but most of that time was simply cooking time. Prep time seemed tedious. If you can, have help as many hands make for light work.\n\nAll in all, great success my first time making tamales. I shall make them again. Next time with green chilies, cheese and green sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wlradun"
},
"reviewBody": "Used butt roast and mild peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spiritvamp"
},
"reviewBody": "Whipping the lard makes all the difference. So moist. The only change would be the flavor of the masa. It can be very bland if not seasoned properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen wilkerson"
},
"reviewBody": "This was fabulous. I used chicken and pork. I did use chili sauce and broth in the dough as well as adding cumin. The hardest part for me was wrapping but they turned out so good. The tip on a ball of dough floating in water to know if it was right worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen G Simmons"
},
"reviewBody": "awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRattray"
},
"reviewBody": "I make these all the time. The family neighbors and friends love them. Excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wanda Rothwell"
},
"reviewBody": "I loved this \"easy\" recipe......I say easy because it took me 3 days to finish haha!! DAY 1: Cooked the pork butt roast I was using for about 8 hrs. on LOW in the crock pot with seasonings &amp; onion. DAY 2: Heated the crock pot on HIGH and once heated removed the meat and put in separated covered container to refrigerate over night. Leave remaining broth in crock pot on LOW. DAY 3: Season the broth in the crock pot. I used chili pods, salt, pepper, cayenne pepper, cumin, a bit of chili pepper (Just all amounts to my taste) Set crock pot now on HIGH for a good couple hours---then pour the broth/brine from the crock pot in to a sauce pan. Return the pulled back to the crock pot and heat on HIGH add as much of the broth as desired to the pork. Other then the above I followed the masa dough recipe as directed, using my broth of course. But OHH Nooo---What do I do, I don't have that much needed steamer pot RIGHT?? Ladies...cough couch, let me tell you a little trick.....Take any tall stock pot you hopefully own and ball up tin-foil (around the size of a baseball ) and set in the bottom of a dry (tall) stock pot (you will need to make several of these balls depending size of your stock pot keeping in mind we only want the steam to be able to escape up through the different vents holes from the balls) , add water and put on your stove (I have a gas stove and had it on 4). Set your tamales standing up right with folded end sitting on the balls of tin foil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mysnugglebug"
},
"reviewBody": "Way too much masa and lard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ashley Marie Narvel"
},
"reviewBody": "For a first time tamale maker this was excellent. However there are some things you can do to make it easier. I used the instant masa you just add water to. Also the pepper sauce wasn’t really needed. It also doesn’t specify how long to soak corn husk and little details like that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rayanne DuChane"
},
"reviewBody": "Loved the filling. Great flavor !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Squirrele"
},
"reviewBody": "This recipe is really good, but I changed things up a little. So instead of using a Dutch Oven, I used a crock pot and cooked the meat overnight. Then after the chili’s boiled and cooled, I mixed the sauce with the meat (after I shredder it) and cooked in the crock pot for about 4 more hours, until the meat has cooked the sauce in and flavor is just right. Then I continued the recipe as is, but used Crisco Shortening instead of Lard. They still taste Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Bouchard"
},
"reviewBody": "as easy as it gets for tamale's. great flavor. don't change the recipe. substituting oil for the lard is a no no. all my friends want more all the time but they don't ever show up to help make them. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adeline Weitknecht"
},
"reviewBody": "I would like to begin with the fact that I am a first time tamale maker and because of what I had in the house, I used this recipe as more of a guideline, but my dad and I really enjoyed the tamales, they had a great flavor and the one hour cooking time was perfect. I used a broccoli steamer in a pot and parchment paper to wrap them. I also added water several times to keep the bottom of the pot from burning, (do not pour the water on the tamales!) I used canned chicken and cooked it in a pot with onions and chilli powder and because I had corn meal on hand, I used a cup of that and subbed out 2 Tbsp for corn starch. This worked very well. I also subbed out some of the butter in the batter for broth, I beat the butter (almost melted) into the broth and then mixed in my dry and beat that too to fluff it up. It was tricky to spread, so I used my fingers. I put more than a Tbsp of meat in each and pressed the edges of together like a parchment-wrapped perigee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jen1101"
},
"reviewBody": "The family loves it, I don't like tamales and hate making them.... but it makes the family happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bonestorm II"
},
"reviewBody": "One thing- the ratio of pork to Masa is off in this recipe. if you make it as written you will likely have a quarter pound of pork +/- left over unless you're really packing it in there! \n\nOtherwise, while there's always room for improvement, this is a very serviceable recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jinsol Hong"
},
"reviewBody": "My family loved it, I would live to make it again. It would be nice to make extra chili sauce to go with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Monique Mealue"
},
"reviewBody": "the changes is use less masa and cook it a little longer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ethan Hautman"
},
"reviewBody": "great tasting unlike some of the comments made below made about it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Heins"
},
"reviewBody": "Additional notes. You may have to double or triple the recipe for the dough, unless you want only bite size tamales."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rio Mi Love"
},
"reviewBody": "It turned out pretty good. I would have used more chili sauce, and I did end up with more masa than the filling as well. Though, I think it was just my bad teqnique. Will try again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marina Peña-Olvera"
},
"reviewBody": "Almost everything came out perfect. I don’t what I did wrong but the masa tasted like it was too lemoney or like it went bad or something? Any help or suggestions will be appreciated TIA"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmyrose"
},
"reviewBody": "I LOVE tamales and have always wanted to make them myself but everyone says it's such a long and tedious process. I found this recipe and decided to give it a go! I put my pork in the crock pot on low overnight so by morning it was falling apart. \n\nWhen I started pulling all of my ingredients out to make the tamales I noticed I missed a vital ingredient. Lard. I found several other sources online that said other fat substitutes would be okay so I used bacon grease and butter. My husband is Hispanic and said the masa tasted amazing so I'd say it was a successful substitution. \n\nA popular review for the recipe suggested that you needed to soak the corn husks for at least an hour so that's what I was going to do but after soaking for about 10 minutes the husks were very soft and plyable. The recipe wasn't clear if you were supposed to gently separate the husks before putting them in water or just throw a whole chunk in. I separated mine so perhaps that's why they softened so fast. And honestly, it only took a couple of minutes to separate enough husks for the tamales.\n\nIt did take a few tries to get the right consistancy for the masa to spread out on the corn husk. The review I mentioned earlier said it should spread like peanut butter and while I never got it quite to that consistancy it did spread pretty easily over the corn husk. I also had trouble getting to the recommended 1/4-1/2 inch thickness. I felt like the harder I tried to make a thicker tamale the smalle"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrystalCooker"
},
"reviewBody": "It was awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cora Van Dyk"
},
"reviewBody": "100% worth the time and effort. I made double since tamales freeze well for quick lunches. It was a bit tough to find the right ingredients in New England but you can get the husks on Amazon. I ended up using dried red chiles from the Indian market and used a bunch of them instead of the large dried peppers since I could find any in this area. Also, I used the broth left behind from the pork in the masa which turned out beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cosette Paseka"
},
"reviewBody": "Only needed the masa recipe and this was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebrites"
},
"reviewBody": "We had a ton of barbecued pulled pork left from a pig-roast, and a wedding to help cater... viola! Lots of labor, but what a wonderful outcome! I live in northern Spain, where no one´s ever tasted Mexican food, and assumes it´s all red-hot chili peppers... these tamales were a revelation to the whole village! I shall be making them for many fiestas to come, I think..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Smith"
},
"reviewBody": "Excellent recipe and although a lot of steps - pretty easy. I made it once to recipe specs and the second time I made it, I added salt to my peppers and a pinch of sugar when I was blending them to take off that bitter edge. Don't make the dough with anything but lard - this is one place you don't want to ruin the flavor and texture. Don't want extra calories? Skip the sour cream. And the flavor of the dough isn't supposed to be super exciting - it's not a dumpling, it's ground corn meal to wrap meat. The sauce and meat is where you get your flavors. I understeamed mine then baked \nthem with the sauce and cheese (just to melt the cheese) and was supremely satisfied."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Octavia Snow"
},
"reviewBody": "I made these twice, once using this recipe. And the second masa I made, was from a different masa recipe. \n\nWhich I ended up substituting for because the original ingredients for the masa is incomplete. \n\nThe meat portion of the recipe I used and the substitute masa recipe to complete this dish. \n\nFinal result was spectacular though, three stars because of the wasted ingredients and time this is a task for one person. \n\nAlso, I did eventually watched a youtube video of how to load the masa and its meat contents. You don't need to get that exact. \n\nYou spread it all over leaving the pointed end clear of masa, then you fold one side of the leaf over then fold the next leaf on top of that leaf then fold the end that was not covered with masa up. \n\nStand them upright with folded leaves against each other in a pot tight together (I don't have a tamale steamer) but this worked just as well. \n\nKeep in mind you need to keep a watchful eye like every 15mins check your water levels which needs to be kept at least one to two inches. You can end up burning the leaves if the pot runs dry. I scorched my leaves but it didn't effect the flavor really. \n\nThis takes a lot of time.\nI started too late in the day to begin. I learned two lessons though so next time number one. I will start in the am and not in the afternoon. And number two; if its just one person making these, like myself. It will be better taking two days rather than one day to make these. Applying masa is the most time consumi"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Janette Suber"
},
"reviewBody": "Can someone tell me how to make tamales filling that is like extremely mild, not bland, but so mild you barely notice any heat? Please? I want to make a red sauce using tomatoes and a pinch of roasted chili powder. Will that work? How can I flavor it up if that will work?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anorris7"
},
"reviewBody": "Having grown up in So Cal, I know what types of Mexican food I like. This tamale recipe is about as close to home as I've ever had. Don't substitute anything for the base recipe and be sure to use lard. I topped with melted cheese, tomatoes, and salsa. YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNA B."
},
"reviewBody": "This is my go-to tamale recipe! I do add spices (cumin, chili powder, chipotle powder, and garlic) to the masa dough and the filling for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "choppychick"
},
"reviewBody": "I used this recipe as a guide, but subbed shredded chicken breast and chicken stock for the pork and beef broth, and used butter in place of the lard. My 12 year old son helped make the tamales and enjoyed it. Great to make ahead on the weekend and steam for an easy weeknight dinner. Rave reviews from everyone, from the picky 5 and 8 year olds to the 50+ crowd. I will make variations of this recipe frequently! Yum! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Machelle"
},
"reviewBody": "Fantastic recipe, and do freeze well. I made them the weekend prior to serving. I made 4 times the recipe and almost got about 10 each batch. Steaming takes longer, and don't over fill the steamer basket to reduce time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pikakitty69"
},
"reviewBody": "I was craving these for the longest time and I had no idea what place sold them so i decided to make them on my own. Sounded great. So i did.They turned out pretty nice. Although the chicken ended up a little dry. I would suggest added chili powder and a little bit of hot sauce. Also a little bit of oil to the shredded chicken so that its not so dry. Also the way that she makes it isnt right. You want to spread the chicken along the dough pretty well so it fills the whole tamale and then wrap it. Also you will most likely need to make more dough batches than that. I made 8 batches of dough just to use all my corn husks. Other than those minor things i think the recipe was pretty great! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corey pearson"
},
"reviewBody": "Delicious. I improvised a little on the pork, but the tamale dough was perfect. Definitely make sure to mic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry L Fraser"
},
"reviewBody": "I read most of the reviews and put more spices in the mix. Not spices to heat the taste but to give it more complexity. Cumin, chili powder, oregano and basil. Not a lot, I also heated a small bit of meat and dough in microwave to see if the tamale would be flavorful. I used the pepper sauce and roast juice to moisten the batter. The chili paste that was left from draining away the liquid was added to the filling. The liquid was reduced from cooking for about 10 minutes to make it thicker. Family said it was a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debi224"
},
"reviewBody": "I added the juice from the meat as well to keep the masa at a smooth consitencey These came out \" just like grandmas!\" Thank You"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicklas Jensen"
},
"reviewBody": "Great basic recipe. I just used my drippings from my pork to flavor the masa. I also cooked my pork in a crockpot. I used two cans of domestic beer and some beef stock paste, bay leafs, garlic, large onion, and lots of salt/pepper. I have found the more flavor you give the masa the better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Aydee"
},
"reviewBody": "I'm not sure where this recipe would be considered authentic but I have never tasted Tamales like this. The masa mixture is blah and the meat is bland. You'll definitely need to up the seasoning in both the meat and masa maybe try adding oregano and bay leaf or two, and please please use the broth from your meat for the masa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat shortridge"
},
"reviewBody": "I made these and they were delicious. This was my first time making tamales so i was a little nervous. I used the broth from the beef , which was already seasoned with onion, cumin, chipotle powder, ancho chili powder, new mexico chili powder, and couple others, and put it in the masa. The masa should resemble peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Adrianna Bowyer Anderson"
},
"reviewBody": "The dough came out very wet and sticky. I didn't like this particular tamale dough recipe very much. The instructions are confusing as they are typed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JessieB"
},
"reviewBody": "It was easier than I first assumed, but I do have a few notes. For one, if you have a slow cooker, use it. The meat cooks within 2 hours on high, and it shreds easier than tissue. I used pork *tender* loin as well, which wasn't too expensive. (3-4 bucks for 1.27 lbs) I threw in some extra cloves of garlic (it's my favorite aromatic!) as well. Rather than prepping the peppers to go directly into the filling, I threw dried peppers in with the meat and water to infuse it, then threw them away. This was a smart move, as it was still very spicy, but not \"ruin your mouth forever\" spicy. We also added basically every spice in our cabinets, including chipotle grind, paprika, cumin, giner, curry, and more. Certainly added the punch it needed. After picking out the meat, I picked out the onions and garlic to be pulverized by a food processor, and threw the peppers away (if you like things super spicy, you could savage a few, remove the seeds, and throw them into the processor). Then we used the cooking liquid for the dough. You absolutely have to double or even triple the dough recipe if you want to use up all your meat. I over doubled it and we still had a little meat left over, and I was filling them generously. Don't worry if your dough doesn't pass the float test. Ours wouldn't float but still came out okay. It also had the texture of cookie dough or pie crusts, but balance masa and liquid so that the consistency works for you! Also I certainly suggest rolling them up like a cigar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Haydee"
},
"reviewBody": "Loved this recipe! I purchased pork asado already made and I used a can of red enchilada sauce with a jar of ChiChi's salsa which I mixed into the meat. I did season the meat more with salt, adobo and cumin. I took a hint from several people here that mentioned whipping up the lard with a little broth to start. Then I slowly added a little more broth and some of the masaca flour. I alternately added both. You want the dough to be slightly sticky. Just a tad firm. Take a pea size dough and if it floats in a cup of water you're good to go. Then I took my soaked husks (I allowed mine to soak for about 3 hours) and laid a small amount of the dough, topped with meat, rolled up, folded one end up and stood them all in my steam pot. Quick and easy to assemble! Great taste!! Will never buy pre-made tamales again. These were excellent! Oh. I also added shredded meat from a rotisserie chicken. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sheila Turner"
},
"reviewBody": "Taste ok but bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "No changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mama cita"
},
"reviewBody": "good recipe: Add diced green chillies to masa with a little enchilada seasoning: cook and drain small amount of chorizo to meat mix of your choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L_Song"
},
"reviewBody": "It's great! My family love it. It tastes better with hot sauce. I used the meat juice to replace broth. I also added 1 cube of chicken bouillon in the meat juice when make mesa dough. I also replaced lard with butter simply because I didn't find lard at the grocery store. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigcock"
},
"reviewBody": "Dis be so god dam good...you heard me. All the white woman all on me for this....I say no no no white woman. Then i proseed to destroy dat ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DrRohl"
},
"reviewBody": "Used this recipe yesterday to make some homemade tamales. Being in the UK made getting access to some ingredients difficult, but I was able to make my own masa using Maseca brand masa harina from MexGrocer.co.uk and made chile sauce with dried Ancho and Arbol chiles (bought from Tesco) instead of those listed in the recipe.\n\nFollowing other people's suggestions, I made a few other changes: I seasoned the pork (shoulder) with salt, cumin seed, cumin powder, and a little mild chili powder while it cooked, and then made my masa using the pork broth and some of the left-over chile sauce (I also blended the onion and garlic from the pork cooking with my chilies for the sauce).\n\nSteaming the tamales was the easiest part, but I wasn't sure if they were working right. Mine leaked a bit (steamer wasn't deep enough to stand upright, so I laid mine flat), and the masa kept seeming far too soft, but eventually I followed the advice that they would be done when the corn husk peeled away cleanly, and the masa firmed up within a few minutes of removing from the steamer. \n\nIn all, this was excellent. A LOT of hard work, but I'll be sure to make a gigantic batch next time to freeze a bunch for later, and I'll also split the work across two days (meat and chile sauce one day, masa and tamale making the next). I'm definitely looking forward to improving this next time, and to experimenting with some other filling options!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy M"
},
"reviewBody": "I've made tamales three times using this recipe and they always turn out great. I always buy a pork shoulder from Sam's Club which comes with two roasts about 7 pounds each. I cook both roast at the same time. I use a pork Carnitas recipe from A/R for one roast which I then add the one cup of chile pepper water to the 1.5 pounds of pork for the tamales. I then use the rest of the roast for tacos (with the chile pepper water), enchildas, buritos, etc. The second roast I season more traditionally and serve it a number of ways from pork roast to pulled pork BBQ, etc. The Tamales always get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Greta Swanson"
},
"reviewBody": "Use the broth for the masa. \nI fry the meat up after it has been boiled and shredded with a little vege oil. Chop the meat up while frying. Yes, chop!\nSteam the tamales for 30-40 min.\nMy ex mother-in-law taught me this. She made these every year at Christmas. Her family was from Mexico."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina777"
},
"reviewBody": "I believe this is the recipe I used last Xmas , I hope it is because the masa and the meat came out 100% Fantastic, I just got myself a nice pressure cooker going to put the pork inside Yummy , I will try a few in the cooker and see how they come out only because its a little time consuming to assemble, but well worth it. If all goes well with it, I will let all know. Thanks for this tamale recipe. Im glad I saved this they came out awesome from last year will try again , almost similar to moms masa, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Mendoza"
},
"reviewBody": "After visiting The Tamale Place in Indianapolis I wanted to do tamales. However, don't limit yourself to just one flavor. Make some generic meat fillings ( stewed chicken, beef, and pork). Next, make some sauces ( I like mole, salsa verde, and spicy picante) you can them mix and match the meat and sauces for a bounty of tamale goodness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dgoldman"
},
"reviewBody": "I make all my tamales with Coconut oil instead of the lard, less calories and you can not even tell the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "hilder"
},
"reviewBody": "This is a good solid STARTING recipe. \n\nThe changes I suggest are using chile GUAJILLO. Place the meat, the onion, a HEAD of garlic, 2 tbsp salt per lb of meat, 2 bay leaf, 1/2 tsp cumin. cover by at least one inch of water. Cook overnight for best results, but until tender is fine. \nTake all the solids, cooled off a bit, blend and strain. it should be thick. shred meat, you should need no more seasonings, but check for salt. heat, add chile/ seasonings mix until slightly moist or 1/4 of the mix. \nGet your Masa, in a large bowl, strain the broth. while broth is still warm, Mix 4 c masa, 3 c broth, leftover chile mix, 1 cup of lard. pour leftover chile mix and 1 cup broth, mix add broth to masa 1 cup at a time. when you can poke it and make a dent, add 3/4 cup of lard , and mix until slightly spongy. take a piece of dough, press it to the back of your hand. if any masa sticks, you need more lard. add 1/4 cup, mix, try again, make sure you scrape the bottom often. it should be spreadable, if not, add more broth \nTake the husks, and soak them in hot water. at least 45 min. no more than 4 inches wide a the bottom, tear the bigger ones to desired size. save the small pieces. every husk has a smooth and a bumpy side. choose the slickest side. you can use a spatula or big metal spoon (takes practice) and spread the masa on until it covers the leaf OR\ncut a ziplock bag open. place under y"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ReneeB"
},
"reviewBody": "I followed the recipe and made pork and chicken tamales. My grand kids love them them and wanted more. I am making a batch today. Also, liked them with fresh salsa. A real hit in my house. Thank you for sharing this great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ken545"
},
"reviewBody": "Can you substitute crisco shortening for the lard"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Loved these. Made with water this time, next I will try broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trose"
},
"reviewBody": "Thank you this is a really great recipe . It's sooo yummyyyyy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashleigh"
},
"reviewBody": "I adore this tamale recipe. Each time I make it it is such a hit! I brought some to school and one of my teachers (who was married to a Hispanic and spent years among Mexican and Cuban cultures)said they were the best she has had, and many of my Mexican friends (whose parents often don't speak English, so I know their food is authentic!) said these are just as good as their mothers make. Point is, THEY ARE GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geebz"
},
"reviewBody": "This was great and made me feel accomplished at my first attempt at tamales. The masa-lard-chicken stock (didn't have pork) mixture turned out really well. The chicken in the chili sauce was so awesome. I will keep working at the recipe and by the time my kid comes home, i can try it out on him, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamaluvzcooken"
},
"reviewBody": "I just made these for my husband's birthday dinner tonight. Everyone loved it! I read some reviews before putting the recipe together and used some of the suggestions posted. I simmered the onions, garlic, and chilis with cumin, paprika, salt, and pepper for about 20 minutes. Then I put the meat in along with a can of beef broth. I made the masa with the broth from the meat. Both the masa and the filling was delicious! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard B"
},
"reviewBody": "I made the recipe yesterday. I did tinker a bit,I used a standard 14.5 oz can of beef broth in the Masa and used Maseca ( instant corn flour). I tested it on my wife's caregiver this morning. Patricia is a Hispanic woman from Oxaca, Mexico. Married with four children and a growing adult husband. I gave her a tamal and after one taste, she ate it all. Her comments; Great flavor, could be a bit hotter. Also, a hint on rolling. Soak the husks over night. Trim the overlong tails just a bit. Use the smooth side to spread the masa. Lay flat,spread masa. fold the left side over, fold the tail up toward the center and fold the right side over. No need to tie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "thecritic"
},
"reviewBody": "Followed recipe and some reviews however the mesa tasted dry and bland it was bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kdwood"
},
"reviewBody": "Great recipe. Great results. Very time consuming, but well worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I like this recipe. I do change the preparation of the meat. I cook it in the oven. I prefer the roasted pork to the boiled. If there is still cooking liquid in the pan after the meat is done, I use it in the Mesa or I reduce it down and add it back to the meat. I also prop my tamales up so that they are standing when steaming. I simply lay my steam basket on it's side and stack the basket until it is full. If there isn't enough tamales to fill the basket (which I always make extra) you could fill the empty space with left over corn husks or something to keep your tamales from falling flat. If my tamales are not sitting up, the filling tends to flow out of the husk. I would not be afraid to season my pork with extra seasoning....I like my tamales with a lot of flavor. I also keep the pepper sauce on the side, not everyone likes it in the meat at my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fer7"
},
"reviewBody": "I remember my grandma making tamales from scratch, I always loved to help her and I learned the process. The recipes themselves are not that complicated, it's the time and work it takes what makes it tedious. The original dough is made out of dry corn kernels, boiled in an alkaline water solution made with \"lime\", no, no the kind of lime you squeeze, construction lime, you know, the white powder they use to make plaster and stuff, believe it or not. The result is \"nixtamal\". Once the corn is tender is whashed, some people peels the skins off the kernels, then is put through a grinder and the result is the \"masa\". Most of us don't have the time, patience or equipment to do it this way. What I do is buy the \"maseca para tamales\", it's coarser than the one for tortillas.\nSome tips for the best masa you can achieve is to use real lard, the one they scrape off the pig's skin, not the processed lard, it's hard to find but it's worth it, look for a Hispanic meat market, they usually have it. Always whip the lard until fluffy before incorporating to the dough. Always use the stock you have left from boiling the meat for your filling, it will taste way better than store-bought stock. Mix mix mix, by hand, use the cold water method to make sure your dough is ready. The basic rule for 1 kg of maseca is 1/2 kg of lard, 1 tablespoon baking powder or sodium bicarbonate (AKA baking soda) and 1-1/2 - 2 cups stock, +- as needed. Shot me an email if you need filling tips or recipes.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carmen"
},
"reviewBody": "I haven't made them yet, but does anyone know that would be a healthier sub for the lard?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tleigh1955"
},
"reviewBody": "I made this recipe today and first of all, going to take longer than 35 minutes to prepare this. Second, two hours is not long enough to cook the meat to shred. There are many too many things to go over that did not work out. I would not recommend using this recipe for tamales. Go to a more involved one and plan on spending a few hours to accomplish your goal. It will be worth it in the long run."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Hardy Cunningham"
},
"reviewBody": "Im only giving this 4 stars because I had to make a lot of changes. As written it is very bland and heavy. The first batch I made the masa turned out very plain and heavy too. I made another batch the next day and I made many changes based on others input. I cooked pork shoulder with an onion and a whole head of garlic, separated. I used the pork broth to mix with the masa. To the chili sauce I added an onion and 6 cloves of garlic and some chili powder and cumin and lots of salt, blended it all up and mixed half with the meat and half with the masa. I also added sliced pickled jalapenos to the meat mix. I also like to add 1 black olive and a thin slice of potato to each tamale after I put the meat filling on the masa. My 2nd batch turned out so well. I also made some with a strip of green chile and cheese, they were yummy too. Im so glad I finally decided to make some tamales on my own. I cant wait to experiment with other fillings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cowgirl"
},
"reviewBody": "Made this today, was great! One tip we found was to use a small piece of plastic wrap to smooth out the masa onto the corn husk. Worked awesome!!! :) Also, no need to tie, just fold into thirds. Put the masa down from the bottom about 2/3 up the husk, smooth out with plastic wrap, put a small line of filling down the middle, fold one side over filling, then fold over other side. Masa will overlap but it's no problem. Then fold top down. Easy Peasy! :) Thanks for a great recipe!! Oh yeah, put the folded side down near the water, and the open end towards the top, worked like a charm! :) Thanks everybody else for sharing tips!!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "I like this recipe very much. In answer to Pat's question, I use parchment paper instead of corn husks and just fold them up. I've done it both ways and actually prefer the paper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lin"
},
"reviewBody": "Fabulous, and easy to follow. It is definitely labor intensive, but several dozen tamales later, my freezer is stocked and a good dinner was had by all. The only suggestion would be to check the water you do the chiles in, and if it's bitter (mine was) use fresh water for blending the dried chiles. I also followed a readers suggestion and used a pork butt instead of a loin, much more tender and flavorful. Thanks for taking the time to post this !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squeakers215"
},
"reviewBody": "The good: despite a few substitutions this recipe held up (fresh serrano and jalapeno peppers instead of dried, chicken instead of pork, shortening instead of lard, and the addition of cumin).\n\nThe bad: Don't listen to the reviewer who said coffee filters work as wrappers. I did (thinking that I could get rid of a huge coffee filter surplus) and suffered for it. Using coffee filters is a TERRIBLE idea!! Here are the problems that I had:\n1. The filters are not as waterproof as corn husks, so when you steam the tamales the fat in them will liquefy and leak out. When the water in my steamer cooled there was 1/2 inch of fat on top of the water for a double batch of tamales. This also means that the surface of the tamales will feel greasy and grease will get all over your steamer.\n2. The coffee filters bond to the masa so when you want to eat them you end up peeling off the outer layer of masa. If you try to avoid this by removing the wrapping while tamales are cold it is impossible to remove without leaving paper on the tamale.\n3. Because the coffee filters bond to the masa the normal test of doneness (seeing if the masa is still sticking) is useless. This means that you need to take a tamale out and actually eat it to figure out if it is done or not.\n\nDespite the fact that my tamales are probably now low fat they are still pretty tasty. They were better after sitting overnight because the flavors melded together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Dunlap Johnson"
},
"reviewBody": "These were amazing, I followed the recipe exactly and added cheese sauce with the other mole. I will make this again as this was a learning process and I made a huge mess and will know better next time. My picky family loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lulu"
},
"reviewBody": "Wow! It came out better than I expected! It needed to be steamed much longer than 1 hr. When I checked it after an hour, the dough was not as soft as I would like, so I steamed it longer. I think I steamed it for another 2-3 hrs. It was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia Martinez Guerra"
},
"reviewBody": "When making tamales, the corn husks need to be in HOT WATER! And you need to use the SMOOTH side of the husks. Prevents dough sticking to husks when cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eye like salsa"
},
"reviewBody": "Outstanding please double recipe if you want to freeze some. Anyone attending your SUPERBOWL party will talk about these and, good luck trying to make them leave. I did add 4 Jalepenos for a little heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ"
},
"reviewBody": "Great recipe! I did make a few changes as well. I added 3 T cumin to the meat, used the broth from the meat in the masa and used a large can (27 oz) of Hatch chilies instead of the dried chili pods. I lived for thirty years close to the Mexican border and these were every bit as good. Thanks for the great recipe. We doubled it and it made 42 generous tamales."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/34512/real-homemade-tamales/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17504/world-cuisine/latin-american/mexican/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16080/world-cuisine/latin-american/mexican/main-dishes/tamales/",
"name": "Tamale Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/34512/real-homemade-tamales/",
"name": "Real Homemade Tamales"
}
}
]
}
}
, "about": [
]
}
]