				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Real Strawberry Frosting"
,"datePublished": "2019-04-02T02:56:44.000-04:00"
,"dateModified": "2023-01-09T15:37:09.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Candice"
,"url": "https://www.allrecipes.com/cook/candice100"
}
]
,"description": "This strawberry frosting uses 4 simple ingredients, including fresh strawberries, for a gorgeous-colored, naturally flavored icing with no gelatin."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1KuU22LKazhrfCkmzKLl-wWybtg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5154435-real-strawberry-frosting-AllrecipesPhoto-4x3-1-5667bc53a03c494d89823d88f763324f.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Real Strawberry Frosting"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "453"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "177 kcal"
,"carbohydrateContent": "22 g"
,"cholesterolContent": "27 mg"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "82 mg"
,"sugarContent": "21 g"
,"fatContent": "10 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dessert"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"1 cup fresh strawberries",
"1 cup butter",
"3.5 cups confectioners' sugar, sifted, divided",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place strawberries in a blender; purée until smooth."
} ,{
"@type": "HowToStep"
,"text": "Transfer strawberry purée to a saucepan over medium heat; bring to a boil, stirring often, until reduced by at least half, about 20 minutes. Remove from heat and cool completely."
} ,{
"@type": "HowToStep"
,"text": "Beat butter with an electric mixer in a bowl until light and fluffy. Beat in 1 cup confectioners&#39; sugar until combined. Beat 2 tablespoons cooled strawberry purée and vanilla extract into butter mixture until just blended."
} ,{
"@type": "HowToStep"
,"text": "Beat in 1 cup confectioners&#39; sugar until combined, followed by 2 tablespoons strawberry purée. Repeat this step once more."
} ,{
"@type": "HowToStep"
,"text": "Beat remaining 1/2 cup confectioners&#39; sugar into mixture until just blended."
} ]
,"recipeYield": ["18"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was great, sweet put delicious. So i didn't get the seeds I strained the puree and them blended it one more time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana King"
},
"reviewBody": "Hey I’m making a chocolate/ strawberry cake and I’m wanting to make some strawberry frosting my cake can I make the strawberry purée that I need for my frosting a day ahead of time?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect strawberry icing!!! Made as directed except I didn't measure my strawberries. Used about a pound. Wonderful, fluffy, flavorful icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Followed the recipe, the result was grainy and way too buttery. There was barely enough to cover a 2-layer cake. It did have a real strawberry flavor, which is why I gave it 2 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Cook"
},
"reviewBody": "The taste is off the chain!!!! I only used 1/2 cup of room temperature butter and about 3 cups of confectioner sugar. So glad I tried this recipe. I had no intention of purchasing store bought frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilma Bohaczyk"
},
"reviewBody": "I followed the recipe as written and this frosting is so delicious. Made a wedding cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Came out great. Recipe is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrs goodwrench"
},
"reviewBody": "Made this frosting with a 'doctored' boxed cake mix. This frosting put it over-the-top. Rave, rave reviews from people at the party. I did use less sugar (about 1 3/4 cup) and less butter (1/2 c.) and added small pinch of salt. It made enough to frost a 13 x 9 pan with plenty of frosting. This recipe is a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elisofonb"
},
"reviewBody": "Buttercream came out really awesome tasting!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polarbyte"
},
"reviewBody": "Very buttery. I would suggest not having this anywhere near heat (like the Midwest during summer.) Otherwise, love the fact that it's not very sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Daniella Wachtel"
},
"reviewBody": "Pretty good just very sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angie"
},
"reviewBody": "Now THIS is the VERY VERT BEST strawberry frosting!!! I was able to frost 22 cupcakes with some left over. Definitely going to keep this one. I didn't have to add anything to the recipe or deviate from it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Silver"
},
"reviewBody": "it was so taty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GIMom"
},
"reviewBody": "Yes it is a WONDERFUL recipe! My only advise is to have patience while reducing puree' and use more strawberries than recommended. (I used a full pound and came up with about 9 tablespoons of puree). Oh which I only used a total of 7 T's. It's delicious. My gratitude to the creator of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess Johnston"
},
"reviewBody": "I’ve never written a review for a recipe, but I had to write one for this. My brother absolutely hates frosting and has never found one he likes; he avoids frosting, scooping it off and eats the cake. For this however, he ate the frosting FIRST. He said it was the best frosting he’s ever had. Like others have said, reduction is the key to a solid frosting. I would compare the taste to Häagen-Dazs strawberry ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irena"
},
"reviewBody": "Amazing!! I've made this recipe multiple times and I love how fresh and sweet the strawberries are in this buttercream. I put it on top of a chocolate cupcake, what a treat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tiffany"
},
"reviewBody": "The flavor was good, but this ended up being a mostly watery clumpy mess for me. I followed the recipe as written, but it didn't turn out very well. It could be my inexperience, but it's not worth the effort for me to try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MaryBeth"
},
"reviewBody": "Overall the frosting is ok. I made it as written and felt that the amount of strawberry purée the recipe made only allowed me 2 Tablespoons total. The recipe calls for at least 4 Tablespoons. It tasted VERY buttery and needed more strawberry flavor. If I were to make this again, I would increase the amount of strawberries to 2 cups and maybe a dash of strawberry extract. The frosting was also extremely thick and needed to be thinned quite a bit so I could pipe it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Krainski"
},
"reviewBody": "We doubled it and reduced the strawberry puree for longer than the recipe said closer to 30 minutes. We also strained out the seeds. Amazing fresh strawberry taste on our yellow cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Love this recipe! Some of it made it on the cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bianca"
},
"reviewBody": "Followed the recipe to a T and it came out perfect. I even tried it with a blueberry reduction and the colors were beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theburgerexpert6"
},
"reviewBody": "I used raspberries instead of strawberries and this came out fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassandra Keefer"
},
"reviewBody": "My goal was a natural but intense strawberry flavor. I am already very well-versed with basic buttercream, and just needed to add flavor. I did a test batch today, using just 1/2 stick of butter and something like 2 cups of sugar--I never measure for buttercream, as I find it can change a bit from time to time, and my goal consistency may as well. I strained my puree (after reducing and cooling), and added a touch of salt after finishing. Definitely glad I strained, and will always do so. This is very good without the salt; I only added it to test the idea. I like it both ways. I think I will reduce the puree more, for a stronger flavor while, hopefully, slightly thicker consistency. I tend toward VERY strong flavors, always. I think this recipe is wonderful as-is though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Real Strawberry Frosting by Candice. Yummy, but thin so I added an 8oz block cream cheese = strawberry ice cream flavored frosting! :) 'Syrupy so folded in two cups whipped cream (1c before whipping). Less strawberry flavor, of course, but it kept its shape well enough to frost cupcakes. I don't know that there is a \"problem\" with this recipe, but maybe less butter would help the lack of firmness - &amp; not add cream cheese or whipped cream. BONUS: http://allrecipes.com/personal-recipe/63277383/strawberry-dream-cake/ ... Celeste's! ... Note4Me: Less sugar. Subbing cream cheese for half butter is good.ME:1/2c butter,8oz creamcheese,1/2t vani,1#confec.1/8t salt,alittle less than half c puree. Like straw icecream a la frosting. Yum, but kind of srupy.A nonsugar thickener or just have to keep it refrigerated. For nonsugar,maybe 2c berries pureed, add 1c confec. Allow to \"juice\" fifteen minutestohalfanhour.Reheat &amp; thicken w 1T cornstarch Cool.Cream together butter&amp;cc.Add 2Turee&amp;1/2tvan then alt equaling 1#sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ccolborn"
},
"reviewBody": "Very good! Easy to make ! I’ll definitely be making this again. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moka"
},
"reviewBody": "Delicious! I used 1 1/2 cups of frozen strawberries and thawed them overnight in the refrigerator. After blending them smooth, I reduced them on the stove for at least 30 minutes. I put in 1/2 teaspoon vanilla extract and 1/2 teaspoon almond extract instead of the full teaspoon of vanilla, and I included a pinch of salt. I did put in the final 1/2 cup of powdered sugar. This recipe was just barely enough for one dozen cupcakes. I might make more next time to ensure I have enough. \n\nGreat recipe! I used this buttercream to top white chocolate-vanilla cupcakes for my daughter’s first birthday!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "I wanted to do a frosting other than the proverbial vanilla or chocolate buttercream I usually make and decided on strawberry. So glad I found this recipe! It is delicious and simple to make. I used it as a frosting for a cake recipe I also found on this page using self rising flour. Both were a big hit in my house! The next time I make this I will use more than the one cup of strawberry because I love intense flavors and I wanted more strawberry taste. This recipe is going on my favorites list!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hayeskid"
},
"reviewBody": "Loved this recipe! Cooking the purée gave a very sweet, strong, and non-watery strawberry flavor. I’m looking forward to experimenting with other flavors using this technique."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoveAllThingsFrosting"
},
"reviewBody": "Scrumptious! I could easily taste the strawberry and it was very sweet! Went perfectly with my strawberry cupcake filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leanne Mentz"
},
"reviewBody": "I loved the flavour, however it kept separating so I just added a little more icing sugar and beat it well. It seemed like too much butter so decreased to 3/4 cup. Still tastes very buttery. But good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Taylor made cake"
},
"reviewBody": "It tasted to buttery. I love the idea of this however. So I added another cup of powdered sugar and 2 more tablespoons of strawberry reduction. It still wasn't what I was hoping for. I'll keep trying"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee Bakes"
},
"reviewBody": "I made this frosting for white cupcakes and everyone, including me loved it! I will definitely make again! I added a little less sugar but you definitely want to reduce the blended strawberries as directed to get that potent strawberry flavor! Don’t shorten the cook time on that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Anna Amrock"
},
"reviewBody": "Generally, I avoid making bad reviews because I find it rude but this recipe did not work for me what so ever. I made an account specifically just to note that this recipe should be avoided. I followed the recipe very closely because I know strawberries can be watery and I did not want my frosting to fail. Nope, had to more than triple the recipe by adding copious amounts of powder sugar and butter to get the thick consistency I needed in order to pipe it onto my cupcakes. Normally I have no issues with All Recipes but this one is a fail."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kByerly"
},
"reviewBody": "This was amazing. I follow the advice of another reviewer and added about a half to a cup more of strawberries to purée and a pinch of salt. I also added a teaspoon of strawberry extract for a little extra oomph. I cooked the purée a little longer to make it a bit more concentrated. It came together beautifully. I used it between layers of a strawberry sponge cake that had chocolate ganache topping, and everyone raves about how delicious it was. I had a little extra left over and set it out in case anyone wanted extra, and it went fast! Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC Duffy"
},
"reviewBody": "Granddaughter loves strawberry, we had some cake mix, some fresh strawberries, and some cupcake papers, so we made it up...this frosting was GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Made it-ROCKED it!!! The frosting turned out delicious!! I put it on top of a made from scratch yellow cake for my son’s 10th birthday - he loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "issalyn"
},
"reviewBody": "fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rylee"
},
"reviewBody": "I'm sorry to have to give a 1 star review.... but this went down hill fast. I was mixing the strawberry puree to the butter and it was just a slop it would not thicken at all :( I did not want to add more sugar because it was already very VERY sweet..I tried adding cream cheese (soft) but it did not help I added more butter and sugar but it was no help.. I tried adding heavy wiping cream and it still did not help I had to dump it and am know looking for a new icing for my cake :( :( :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Delicious and easy to make as long as you have time for the reduction. I doubled the amount of strawberries and reduced it for longer so it was pretty thick but frosting consistency was good. Haven't actually tried it with the cake yet but am looking forward to that!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephc"
},
"reviewBody": "This icing is by far the best I’ve tried and it’s easy to make and easy to work with. I am your average baker so this is a great recipe for everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quito Misak"
},
"reviewBody": "This strawberry frosting was the star of my strawberry cake. Better than the cake part, itself. It had a very wonderful clear fresh strawberry flavor. Honestly, I was surprised how lovely the flavor and color was! Like one commenter, I used almond extract instead of vanilla, because I love almond extract. The almond only accentuated the strawberry flavor. It didn't overwhelm it.\n\nI prefer weight measurements for some ingredients. Since \"1 cup of strawberries\" is a slightly ambiguous amount, I can say that from the success of my icing, I'd recommend using about 250 grams (8.8 or even 9 oz) of hulled strawberries to make the full batch of the puree. I didn't exactly time the simmering time, but I did reduce by at least half. It was pretty deep red when it was done, which gave the icing the lovely color.\n\nI used sifted Swerve confectioner's sugar substitute in place of regular confectioner's sugar to keep the sugar grams down. I used slightly less Swerve (that is supposed to measure 1:1 with regular confectioner's) than the recipe called for. I'm sure with regular confectioner's sugar the frosting is equally if not even yummier, if that is even possible. One might want to taste with a little less confectioner's sugar. Nicely ripe strawberries may or may not necessitate the additional sweetness, as long as the spreadability is just right.\n\nThe photo of my cake, attached, is of a small 6\" single layer cake. [I made a few.]"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marla"
},
"reviewBody": "Wouldn’t change a thing on this recipe. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Mac"
},
"reviewBody": "This icing was so delicious. My husband raved about it. I modified to my taste...used 1 1/4 cups of butter , 1 cup of confectioner sugar and 1 1/2 cups of pureed fresh strawberries. It was a little runny but tasted out of this world."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sondra"
},
"reviewBody": "Great flavor and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Prince"
},
"reviewBody": "I made this delicious fresh strawberry buttercream and it was so good. I will definitely make it again.\nThank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Tooth"
},
"reviewBody": "It was great! Tasted like strawberries! I did add ground up freeze dried strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica B"
},
"reviewBody": "This frosting was very good. The only change I did was not add it in 2 tablespoons at a time. As some reviewers said, it didn't look like enough. I just added it all in at once and it was perfectly fine. If you think it's not enough, don't even worry about it. I also substituted the vanilla for almond extract. I'll definitely make this again. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylie"
},
"reviewBody": "This is delicious! It was very easy to decorate with this icing. I put it in the fridge for 30 minutes before I frosted the cupcakes so that it would be firm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Roper"
},
"reviewBody": "I absolutely loved this recipe. I hate artificial strawberry flavor and wanted something without it... Thats how I landed on this recipe. One tip I've figured out is to make it a few days prior to using it, as the strawberries become even sweeter and more flavorful when they sit in the fridge all mixed up. Just dont forget if you do this, you will need to bring it out to room temperature before frosting with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "magical_selan"
},
"reviewBody": "As is, this frosting was WAY too runny. I added an extra cup of confectioner's sugar, and when that didn't work I also added a pack of softened cream cheese. That was what finally made the frosting pipable. Tasted good, but can't give it 5 stars because I needed to modify it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Maxey Goris"
},
"reviewBody": "Puts artificially flavored strawberry frosting to shame! So fresh tasting! Good with chocolate or lemon cupcakes. Don’t miss cook’s note that the longer you reduce purée the more intense the strawberry flavor will be. Definitely worth the extra time for that flavor punch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This is awesome! I made cupcakes and wanted raspberry frosting and this worked well. Maybe a tad thick, however holds its shape nicely. YUM!!! You need to make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Delicious recipe made with fresh strawberries. Even people that normally don't like buttercream loved this recipe. So glad I found it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica"
},
"reviewBody": "This was AMAZING! I made this exactly as listed and it was delicious. 1 batch is just enough for one 9x13 cake so don't lick the spoon until you are done decorating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIZZYJEN"
},
"reviewBody": "AMAZING! Goes perfect with the strawberry cupcake recipe I found. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A-Chef-In-Progress255"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "This was super-fantastic! I, too, used more strawberries than just the 1 C. And I added 1/2 tsp of strawberry extract. It made more than enough for a 2-layer 8” cake. And it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Sprik"
},
"reviewBody": "Loved this icing will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "This was absolutely amazing!!!! Used 1/2 less sugar other than that perfect recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gregory Buhler"
},
"reviewBody": "I made this a week ago and will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janetevelyn"
},
"reviewBody": "I picked this recipe as my 3 yr-old grandson wanted pink icing and I didn't want to use red food color. I loved the fresh strawberry flavor of this icing. I did start out with 2 cups chopped strawberries. After puree step I had 1 cup. I cooked the puree about 20 minutes, strained it in and sieve, and ended up with slightly over 1/2 cup puree. Although the recipe asked for about 6 Tb. puree, I ended up using almost all the puree. I only added 3 cups total confectioner's sugar. It was really really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ayla Novemsky"
},
"reviewBody": "Delicious strong strawberry flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tasha Talbot-Douglas"
},
"reviewBody": "I was really hoping this would be full of strawberry flavor and i was sadly disappointed. Although the frosting was smooth, light and fluffy it lacked any flavor other than butter. I reduced the strawberries and allowed them to cool after straining the seeds out. I follwed the recipe exactly this time around. I do plan on giving it another go, next time increasing the amount of strawberries, and possibly adding some dried strawberries to really give it more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Della Delk Ligon"
},
"reviewBody": "Refreshingly delicious and the fresh purée strawberries made it perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "navy mom"
},
"reviewBody": "Excellent recipe, I did add more strawberries but the recipe was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Beck"
},
"reviewBody": "Excellent buttercream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joselyn Vasquez"
},
"reviewBody": "I liked it! The strawberries give it a nice natural pink color!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Balax"
},
"reviewBody": "First time ever doing frosting, I added another 1/2cup of strawberry pure to make the strawberry flavor bolder, maybe next time I will go lighter on the sugar since it was too sweet for me, but that’s just a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spoons"
},
"reviewBody": "A granddaughter wanted strawberry frosting for her birthday cake and this fit the bill to a \"T.\" Great flavor (depending on the quality of the strawberries. Well worth the time to make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CRP"
},
"reviewBody": "It had a decent strawberry flavor but the butter taste overwhelmed it. Next time I will make it with half butter, half shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Sherwood"
},
"reviewBody": "I made this and followed the instructions. I maybe had slightly more than 1 cup of strawberries to start, but otherwise didn't change a thing. I didn't strain the seeds out or anything. We loved it! We used it to top vanilla cupcakes for my daughter's first birthday. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle McCoy King"
},
"reviewBody": "Amazing flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Gaudioso"
},
"reviewBody": "Very Real strawberry flavor, a little sweet, but overall a solid recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EnglishProf"
},
"reviewBody": "Absolutely delicious. Followed recipe as is, no substitutions. Piped some in between layers and iced around the sides and top; the rest is setting up in the fridge for a bit so I can pipe on some flowers. Fluffy, not too sweet, and although it does have a few strawberry seeds in it, that, to me, just gives it authenticity. You can always strain them out as other reviewers have suggested. I have been cooking and cleaning all day, so I didn't bother!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hope "
},
"reviewBody": "I made this my own kinda way tasted amazing. Used 2 cups butter 2 cups stawberrys about the same sugar was creamy and rich just loved it i always play around with recipes and use them as a guideline"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Amazing and easy! I used frozen strawberries because I live somewhere where there's only hard strawberries. I blended them in the blender with a little water and followed recipe. Make sure you end up with exactly 1/2 cup of strawberry puree. This frosting is slightly soft but the consistency is well enough. It really has a very strong strawberry taste which I love. It makes a big amount though, more than I needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abby W"
},
"reviewBody": "We love this frosting. We've made almond, lemon, and strawberry cakes to go with this frosting and it never disappoints."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina L"
},
"reviewBody": "Best frosting I've ever made. I did increase the amount of the strawberry puree because I wanted it to be REALLY strawberry. Also added a touch of almond extract which helped enhance the strawberry flavor. As for it being too sweet, something I've learned over the years is to add just a touch of salt to buttercream frostings to cut the sweetness and balance flavors. It turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jwoop"
},
"reviewBody": "This is definitely worth the extra effort it takes to make it! My new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marshall Alum"
},
"reviewBody": "Perfection! Don’t be fooled into thinking you need any alterations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kwaiting4J"
},
"reviewBody": "Awesome! Goes great on chocolate cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Smith"
},
"reviewBody": "Ooooooh my gosh, this recipe was sooooooo good!!!!!!!!!! There are some people who have been critical of this recipe and critical of the texture and the flavor, but I could not have asked for a better strawberry frosting recipe. It was so delectable and sweet and yummy and I even dreamt about it's amazingness last night. Highly recommended!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "I made the recipe for 65 cupcakes. I made three different kinds including strawberries, blackberries, and lemon for a fairy birthday party! Wow the frosting was a hit. The parents told me they had three cupcakes so they could try all three frosting flavors! The 8 year old like the lemon the best. I like the strawberry the best!\n\nFor the Lemon Icing:\nI did more of a citrus blend of 2/3 orange juice and 1/3 lemon juice. I made sure there was pulp in the reduction and then strained it all out before it cooled.\n\nFor the Berry Icing:\nI did reduce down until quite thick and then strained out the seeds. I recommend straining the seeds, otherwise the texture is not so great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Timothy Chavez"
},
"reviewBody": "Tastes really fresh... I added a couple of raspberries to purée and it, in my opinion, took it up a notch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "Was worth the effort. I don’t care for the flavor of strawberry extract. This was REAL strawberry flavor. I did add a few drops of red food coloring to enhance the color. Kids and adults loved it. My granddaughter wanted chocolate cupcakes with strawberry icing. I served the left over sauce with ice cream ... and the cupcakes, of course!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pappap"
},
"reviewBody": "No changes loved it superbowl sunda"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randi M. Kosiewska-Short"
},
"reviewBody": "I will definitely make this again (maybe strain the seeds next time - even though the little ones didn’t complain). Only made a half batch because I paired it with an orange -chocolate frosting for an alternating chocolate/vanilla confetti layer mini cake. STRAWBerry frosting between the layers and then both on the outside, opposite ends, blending around the center line halfway up the side. My 6 year old helped and it came out better than us novices could have hoped. Thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Excellent recipe. Of course I made adaptations. Took an extra 10 min to strain the seeds out. The flavor is amazing. Added a little HWC to make it smoother as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Snow"
},
"reviewBody": "My son loved it! He requested it for his 8th birthday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joko"
},
"reviewBody": "This tasted very fruity but it was hard to pick out strawberry as the flavor specifically. I added about 3/4 ounce of ground freeze dried strawberries and that really made the flavor more distinguished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delish! Made for my daughter’s birthday cupcakes. Followed one reviewer’s suggestion and added 1/2 c more strawberries and 1/4tsp of almond extract. Will use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Beverly Wiggins"
},
"reviewBody": "This frosting did not do well for me. Went exactly like recipe. I will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stephanie Richards"
},
"reviewBody": "This recipe was way too sweet. I only used 1.5 cups of sugar and it still overpowered the strawberry taste. It wasn't terrible, good place to start, will make some changes next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BelindaRN"
},
"reviewBody": "Came out beautifully! I ended up doubling the recipe and used all of a 32oz bag of confectioners sugar, 8 tbps of the reduced strawberry purée, added some almond extract. I thinned the frosting out with some whole milk and whipping cream. Key is to have ALL your ingredients room temperature and your buttercream will come out smooth! :) Beautiful pink color with absolutely no food coloring. Great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I cut it down b/c I did not need as much as it made. It was still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Kuijpers"
},
"reviewBody": "Unbelievable strawberry flavour.! Fresh creamy and just sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bridget Moore"
},
"reviewBody": "I have to rate it a 4 because I did modify it a bit, but it's AMAZING!!! I'm so happy I found the recipe on a whim and decided to try it. I am not a huge fan of strawberry frosting, but I made lemon cupcakes and it went perfect with them. I used 1 2/3 cup sugar vs. the 2 1/2. It doesn't need any additional sugar in our opinions. I also didn't puree the fruit when it was done-I just used a potato masher in the pan while cooking the berries. :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa"
},
"reviewBody": "Loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristal"
},
"reviewBody": "This was so sweet and happy tasting. I think the next time I make it I will add just a little lemon juice."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220816/real-strawberry-frosting/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/79/desserts/",
"name": "Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
"name": "Frostings and Icings"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220816/real-strawberry-frosting/",
"name": "Real Strawberry Frosting"
}
}
]
}
}
, "about": [
]
}
]