				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Real Chiles Rellenos"
,"datePublished": "2019-04-02T02:53:14.000-04:00"
,"dateModified": "2022-07-26T00:08:24.000-04:00"
,"author": [
{"@type": "Person"
,"name": "*Fat~Dog~Lane*"
,"url": "https://www.allrecipes.com/cook/2697863"
}
]
,"description": "Chiles rellenos, that classic Mexican dish of cheese-stuffed fried peppers, is made from scratch in this recipe. Make the stuffed peppers ahead of time and freeze; then take out and fry another day to make your dinner preparation easier."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_nY0cWpsQSHqjoTa8gPhCAeCiFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4562945-real-chiles-rellenos-Allrecipes-1x1-1-f540a5c0d9b04bfab658ebbd395ec3da.jpg",
"height": 940,
"width": 940
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5566842153001",
"description": "Crisp, light and full of cheesy homemade goodness.",
"duration": "PT1M59S",
"name": "Real Chiles Rellenos",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9ecac271-e005-4919-afd3-b8c31a4d3165/ca14d01d-6ea6-4df2-b547-e6d935ccb42a/1280x720/match/image.jpg",
"uploadDate": "2023-02-03T15:37:03.853-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Real Chiles Rellenos"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "195"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "424 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "91 mg"
,"fiberContent": "5 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "1240 mg"
,"sugarContent": "7 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"4 large poblano peppers",
"0.5 cup shredded mozzarella cheese",
"0.5 cup shredded Monterey Jack cheese",
"0.5 cup shredded Cheddar cheese",
"0.25 cup all-purpose flour for dredging",
"1 (14.5 ounce) can Mexican-style stewed tomatoes",
"1 tablespoon vegetable oil",
"0.5 onion, chopped",
"1 clove garlic, minced",
"1.5 cups chicken broth",
"2 tablespoons distilled white vinegar",
"1 teaspoon dried Mexican oregano, crushed",
"0.5 teaspoon ground cumin",
"0.5 teaspoon black pepper",
"0.5 teaspoon hot pepper sauce (such as Cholula®)",
"0.125 teaspoon ground cinnamon",
"0.33333334326744 cup all-purpose flour",
"0.5 teaspoon salt",
"5 egg whites at room temperature",
"1 egg yolk, beaten",
"0.25 cup all-purpose flour for dredging",
"1 cup oil for frying, or as needed",
"sour cream for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven&#39;s broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil, and place the peppers onto the prepared baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, 8 to 10 minutes per side. When the peppers are about 80 percent blackened, place them a plastic bag, seal, and allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Cut a slit lengthwise into the side of each pepper, and remove seeds and veins. To reduce spiciness, rinse out any remaining seeds with water. Pat the peppers dry with paper towels."
} ,{
"@type": "HowToStep"
,"text": "Mix together the shredded mozzarella, Monterey Jack, and Cheddar cheese in a bowl until thoroughly blended. Divide the cheese into 4 portions, and squeeze each portion lightly in your hands to make a cone shape. Insert a cone into the slit in each pepper, and pin the openings closed with toothpicks. Dredge each pepper in flour, dust off the excess, and place on a small baking sheet lined with parchment paper or waxed paper. Place the peppers in the freezer for at least 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "To make sauce, blend the stewed tomatoes in a blender until pureed, and set aside. Heat 1 tablespoon of vegetable oil in a saucepan over medium heat, and cook and stir the onion until translucent, about 5 minutes. Add the garlic, cook and stir for about 30 seconds, and pour in the pureed tomatoes, chicken broth, vinegar, oregano, cumin, black pepper, hot pepper sauce, and cinnamon. Reduce to medium-low, and simmer the sauce until reduced by half and thickened, about 20 minutes, stirring often."
} ,{
"@type": "HowToStep"
,"text": "Preheat an oven to 200 degrees F (95 degrees C), and warm a platter in the oven."
} ,{
"@type": "HowToStep"
,"text": "To make batter and finish the chiles rellenos, mix 1/3 cup flour with salt in a bowl. In a separate bowl, beat the egg whites with an electric mixer until the whites form stiff peaks. Lightly mix the egg yolk and flour-salt mixture into the egg whites to make a fluffy batter. Remove peppers from freezer and coat them in flour again; shake off excess flour, and dip each pepper into the egg batter, using a spoon to gently but completely coat each pepper with batter."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_nY0cWpsQSHqjoTa8gPhCAeCiFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4562945-real-chiles-rellenos-Allrecipes-1x1-1-f540a5c0d9b04bfab658ebbd395ec3da.jpg"
}
]
,"text": "Heat frying oil in a heavy cast iron skillet over medium-high heat until the oil shimmers. Gently lay the coated peppers into the hot oil, and fry on both sides until the batter is golden brown and the cheese filling is hot, about 5 minutes per side. Remove peppers to warmed platter while you finish frying. To serve, ladle a generous spoonful of sauce onto plate, and place pepper on sauce. Serve peppers hot with a dollop of sour cream."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vanessa Moore"
},
"reviewBody": "My family liked it. I just need to add more cheese &amp; cook them longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "This was my first time making pablano peppers, so I didn’t make the sauce. A couple things I learned, you can roast the peppers in the air fryer. My model has shelves rather than a basket, so it can roast 8 at a time. I cooked them for 20 minutes total at 320°, turning them over every 5 minutes. Next time I will only cook them for 15 minutes. I will also make a single slice and remove the seeds before I cook them. Mine were a little soft after cooking and steaming, which made cleaning out the seeds without tearing the peppers impossible. 😢 I put them in a Ziplock gallon bag and let them steam for 20 minutes. They were still too hot to handle, so I let them cool outside the bag for 5-10 minutes. The skins came off easily and I wore kitchen gloves to be safe. I also added a pound of cooked ground beef and onions with the cheese, then added more cheese on top. I thought my first attempt was just okay the day I made them but they were great on the second day! They were a little more spicy and the flavors blended. I will definitely make this again and follow the instructions next time.🤷‍♀️ Five⭐️s!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amateur"
},
"reviewBody": "This recipe is a keeper! The notes I made are to add more cumin and also blend the onions and garlic into the sauce because I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Howard Shmuckler"
},
"reviewBody": "I MADE NO CHANGES BUT I DID MAKE A GREAT FAUX PAS. I WAS PREPARING THE 4 RELLENOS FOR MY WIFE AND MYSELF FOR DINNER. THEY LOOKED SO GOOD I HAD TO TAKE A LITTLE TASTE. BY THE TIME MY WIFE GOT HOME I TOLD HER, \"LOOK WHAT I DID. I MADE US EACH A (ONE) CHILI RELLENOS.\" SHE SAID HER'S WAS SO GOOD WHY DIDN'T I MAKE HER TWO?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MaeBDemented"
},
"reviewBody": "These are similar to the ones my mom always made, only she didn't use cheddar and the filling was mostly papas and ground beef, with a little bit of cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Ferg"
},
"reviewBody": "My husband, who loves Chiles Rellenos in restaurants, will never order them again. He has never had them as good as these. I made your recipe using several tips from reviewers. The tips are: 1. Mold the shredded cheeses around a tablespoon of cream cheese; 2. Don’t over roast the poblanos, they become mushy; 3. You can use regular oregano, and I used Hunt’s Seasoned Diced Tomatoes in Sauce for Mild Chili; 4. I cut way back on the cinnamon and cumin. I’m a little sensitive to cumin; 5. I used 4 egg whites and did not whip till dry but just before that; 6. I added 2 yolks (why not?); 7. Just dipping the chiles in the batter did not work well, I did a combo of dipping and spreading the batter; 8. Spoon hot oil gently over the chiles before flipping to the second side. The batter slightly cooks and it will stay on; 9. IF there are leftovers, re-heat on foil in 375 F for about 6 minutes to preserve the crispy crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "char"
},
"reviewBody": "Well written instructions and Excellent flavors! Thank you so much for sharing this sensational recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Minnick"
},
"reviewBody": "A real winner! The sauce is excellent too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "First attempt at Chile Rellenos, these were awesome! The batter was phenomenal and stuck even though I think I over-grilled the peppers I cheated and puréed a jar of salsa then added all other ingredients and cooked down. It was PHENOMENAL! I made Mexican rice and it was as good a meal as I’ve had in any Mexican restaurant!! I’m planting Poblanos and maybe Hatch Chile’s if I can find them this Winter. (I’m in South Florida) and I’ll be making these Often!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brother William"
},
"reviewBody": "These are really delicious, and the supper light, crispy batter and slightly spicy salsa really sing together. Next time I'd skip the steaming step to keep the chiles a bit firmer, as they tended to come apart when filling them with cheese. I'd also use a chunk of cheese rather than grated for a stronger cheese presence. I would probably keep the stuffed peppers in the freezer longer, too, perhaps an hour to make dipping them in batter easier. I would also cut the vinegar in the salsa to 1 Tbs or omit it entirely, as tomato by itself is plenty sour. I separated egg whites and egg yolks to beat the whites, but I blended them all back together to make the batter. I used fresh Hatch chilies rather than poblano, simply because these were readily available."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Savoie"
},
"reviewBody": "This is a delicious recipe. I used Anaheim chiles, chipotle tomatoes, and smoked black pepper. Otherwise, I followed the ingredients and instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vparize"
},
"reviewBody": "This has a lot of steps and while I was making it I thought, “I’m probably not going to make this again”. But, after tasting it, I will most certainly make it again. :-) I ended up holding the stuffed chile in my hand, spooning batter on top of it and placing the batter side down in the oil. Then, I spooned more batter on top. I thought the cheese would explode out, but it didn’t. I used home grown chiles. I want to try this with hatch chilies when they’re available, too. Yummy! (I made them gluten free by using GF all purpose flour. They tasted just as good!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Scott"
},
"reviewBody": "So good and very authentic tasting. I will char my peppers a little less next time to keep them from getting too soft and tearing. I might also make more of the delicious sauce. Other that that, I wouldn’t change a thing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "onabender2"
},
"reviewBody": "Super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margery Aukstikalnis"
},
"reviewBody": "These were far better than any i have had in any Mexican restaurant. The cheese mixture was dry and wouldn't shape so I added a couple tablespoons of cream cheese. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ljmarsden"
},
"reviewBody": "These turned out light and fluffy. Everyone enjoyed them and look forward to me making them again. These did take a long time to make, with roasting and seeding the poblanos. I’m hoping that since this was first time I made them, it will be faster next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brutusbc"
},
"reviewBody": "We really enjoyed it. It is very intimidating and quite a mess to clean up, but worth it! I made a few adjustments according to what I had. I used a 10oz can of Rotel Tomatoes instead of 15 oz Mexican stewed tomatoes. I also used regular oregano. I grilled 4 poblano peppers. I used a 2 cup bag of Old El Paso 3 pepper shredded cheese. I used Frank's Red Hot Sauce. Rather than blending the tomatoes, I put all the sauce ingredients into the sauce pan and used my immersion blender on all of it and made it ever so slightly chunky. Medium High was too hot for my stove and oil and my 4th pepper burned. I'd dial it back a bit in the future. By the time I was putting the 3rd pepper in there, the first one was getting over done. It will take some practice to get the timing down, but I will do this again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Campbell"
},
"reviewBody": "I had never even tried a chile rellenos but my husband asked me to make them and this is the recipe I picked - it made me a winner!! It was so good!!! It is very time consuming - it took me about 2 1/2 hours start to finish, but it was well worth it! I did double the recipe and we ate four, froze four. Next time I will make twelve !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Boettcher"
},
"reviewBody": "To make this Keto Friendly, I used Almond flour to dust the peppers with and I didn't add any flour to the egg mixture used to batter the peppers. \nI also used Colby/jack cheese instead separate cheddar and Monterey jack cheese. \nI increased the Mexican oregano to 2 tsp.\nI increased the cumin to 1 Tablespoon (we love cumin!!!)\nI increased the black pepper to 1 tsp.\nI only used 4 extra large eggs instead of 5 and had exactly enough egg mix for the 4 peppers. If I were using large eggs, I believe the call for 5 eggs would still be right but with extra-large eggs, 4 is plenty.\nWith the increase in seasonings, the flavor was perfect.... Not too much. I think if I would have used the quantities called for in the recipe, it would have been a little too mild in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Page"
},
"reviewBody": "These are, in my opinion, the best and most authentic recipe I’ve made. It takes a bit longer, but you won’t be disappointed. They are better than most restaurant’s.\n\nThanks for teaching me the correct way to coat them. It makes such a difference! The sauce is incredible, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri Smith"
},
"reviewBody": "I made them as receipe was , and they were very very good , I cant wait to make them again, \nThank you \n Sheri Smith"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Hampton-Amos"
},
"reviewBody": "Absolutely delicious!! I made extra sauce for a chili relleno casserole. Definitely using this recipe again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Mama Ray"
},
"reviewBody": "This turned out great! I used a dozen smaller poblanos fresh picked from the garden. Prep time is accurate, I started sauce and batter while chiles were freezing. Next time I would prep and freeze the chiles ahead to save time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luvtocook"
},
"reviewBody": "Great authentic Chile Rellenos. This dish is a little time consuming but worth the effort. This is by far the best way to make em."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hfrasernc"
},
"reviewBody": "OK people - this recipe is off the rails. Yes, it took hours and lots of work, but this recipe is so well written and very clear on all of the steps. We followed them almost to a T - We ended up putting 1/2 Monterey Jack cheese stick into each chili instead of the cheese mixture described here. the sauce is AMAZING! I will be making that again for other things - would probably be good on enchiladas. Anyway - go for it - these are the best Chile rellenos I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ferguson"
},
"reviewBody": "These were outstanding! A lot of work, but so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Alaniz-Sessions"
},
"reviewBody": "I tried my hand at making fresh Chile rellenos using this recipe...roasted the chiles, made the sauce and added some taco meat and sauce to the cheese stuffing. It was a big hit! Also, had leftover batter, meat and cheese so I made some fritters by mixing them all together and frying them. The littles and Gramma enjoyed those with a little sauce topping them.\nThe sauce is fabulous and I'll be keeping this recipe around for a long, long time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gunkaloo"
},
"reviewBody": "Made exactly minus the Mexican stewed tomatoes as I could only get regular. Very good and came out great. Need to practice my battering step but otherwise excellent. The sauce that covers it was great but took about and hour to simmer down to a thicker consistency. I'd suggest to start it while the chilies are roasting in the broiler and then cooling. Get it thickening right away. Really a restaurant level taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Giambo"
},
"reviewBody": "OMG ! FANTASTIC ! Half way through l had a little panic attack ..... however directions, plus video, got me through! Everything was better than any restaurant. I made one change, l added one 4 oz can chopped green chilies to the sauce at the time l put all ingredients in the pan. I served this with a instant pot Mexican rice and Mango Sriracha coleslaw kit. DO NOT MAKE THIS WITHOUT THE SAUCE ! I almost skipped it thankfully l didn't!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shanna"
},
"reviewBody": "I really like the sauce and added some beef but it would have been good without it. This was really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele McClellan"
},
"reviewBody": "I followed this recipe exactly as written. This is my husband's favorite Mexican dish. The first time I made it, he said it was the best chiles rellenos he has ever had. Last night when I made it again, he said it was the best dish he has ever eaten!!! It's a bit tricky to make, and the second time around I really nailed it. Thank you for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha Sines"
},
"reviewBody": "Tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dayle Faria Riddle"
},
"reviewBody": "Loved this recipe and came out perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LumberJack"
},
"reviewBody": "This is my wife's favorite Mexican food. Made this last weekend and she was elated. She said it was as good as any she'd had anywhere. My family told me I had permission to make this again anytime. Recipe was easy to make with the exception of the battering process. I had a difficult time getting it to stick. They turned out great but didn't look as good as the recipe photos. Practice makes perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mocha71"
},
"reviewBody": "Along with others....this is a lot of work...but worth it!!! Really tasty - it is the real deal if you like \"Rellenos \". I put shredded chicken and cheese for the inside. I also decided to use my deep fryer (350) instead of the cast iron skillet to fry. I did cook my sauce in the cast iron skillet to ensure good flavor. The family really liked the entire meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "otheraimee"
},
"reviewBody": "Wow, is this good. Does take a long time from start to finish but almost immediately got ingredients for the next batch. Made as directed and will not make any changes. I don’t think you’ll have much problem if you use a different blend of cheeses however. Planning to try this out with jalapeño peppers soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ms. Sicily"
},
"reviewBody": "The Best Recipe Ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jason"
},
"reviewBody": "They were better than my favorite dining out place to get Chile’s rellenos! And this was the first time making these I have had them at about 5 different places!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Banker"
},
"reviewBody": "I thought this recipe was delicious! I made the Chiles Rellenos and sauce with mexican rice and corn tortillas. Instead of freezing, I went right into breading the Chiles Rellenos. To bread them I put them in flour, egg mixture, then flour again. I also baked them instead of frying, 420 degrees for 15-20 minutes. Came out great and will definitely make them again. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharlene Jennings"
},
"reviewBody": "Would make again! Takes some work but soooo worth the effort. Taste, taste, taste as you cook!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Cuilty"
},
"reviewBody": "well worth the effort in making these wonderful Chile Rellenos"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Anderson"
},
"reviewBody": "The sauce alone is worth making this recipe. I had some late season yellow and red bell peppers that I added but excellent. The egg batter had great color and fried up very nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maytee Renteria"
},
"reviewBody": "Delicioso!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Howl Pendragon"
},
"reviewBody": "The sauce calls for WAY too much cumin. And a lot of the steps given for the chiles are unnecessary. There are much simpler and better ways to make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LauraAnne"
},
"reviewBody": "My first attempt at making chile rellenos and they turned out awesome! The red sauce was delicious. This recipe is worth the time to make it. Followed as written except I used up small amounts of mexican type cheeses I had in the fridge. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jabguit"
},
"reviewBody": "I've made these 3 times, but with a couple of tweaks to the main recipe. Instead of the 5 egg whites and 1 yolk, I used 3 eggs, separated and prepared as in the recipe. Instead of flour I used masa harina or corn flour for a more authentic flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill L"
},
"reviewBody": "Didn't make the sauce as we used green chile from our favorite local restaurant. Also used egg roll wrappers to help better contain the peppers and cheese. Worked like a charm. Quite a bit of work; but worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coho"
},
"reviewBody": "It was the first time ever making Chile Rellenos and this recipe was delicious! It takes some time but way worth it. I used Queso Fresco and Mozzarella and it was perfect, nice and creamy sprinkled a little Cotija on top and it was so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THEBUGSMOM"
},
"reviewBody": "I have never had chiles rellanos before so I have nothing to compare them to, but OMG these are AHHmazing! I did not change anything. It took me a good two hours but it was so worth it! Everyone is right - the red sauce is definitely worth making for other recipes as well. I wish there were more stars because this recipe deserves them. Thank you for the great recipe and teaching me how to make something my Mexican food aficionado of a husband loves as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Shouler Baird"
},
"reviewBody": "I will make these again! Instead of making the sauce, I used jar salsa but spiced it up with extra cumin and cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene"
},
"reviewBody": "This was my first attempt at making chile rellanos and my family and I loved loved loved it. The only change I made was I used New Mexico green chile but followed everything else to the T. Awesome recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmdawn"
},
"reviewBody": "This recipe turned out great, the only change I made was to puree the sauce after I cooked it. We ate our first serving without pureeing and thought it would be better without the chunks of onion and that was the perfect thing to do. My DH said it was better than our local restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Severance Ney"
},
"reviewBody": "An abundance of our garden's poblanos led me to this recipe, and it did not disappoint! It was involved but not complicated. Having lots of fresh tomatoes too, I used them to make the sauce. I added in some fresh jalapeños and banana peppers and omitted the hot sauce. The sauce was amazing. My mouth is watering just writing this. For the cheese mixture I used what I had on hand: 4 oz of cream cheese, mozzarella, and sharp cheddar. Don't whip your egg whites too dry like I did, though. It makes coating the chiles a challenge. I'll make it again, but not tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "corbagava"
},
"reviewBody": "I used only the sauce portion of this recipe. I did make a few adjustments along the way. I used homemade chicken broth and I added half of a fresh jalapeño diced to the onion garlic mixture. I added the mix to the tomato and puréed all. I also added brown sugar and simmered it until it was a thicker consistency. I added a small handful of finely chopped cilantro a few minutes before I was ready to serve. I felt the sauce needed the extra cooking time and sugar to eliminate the bite from the tomato. It was delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Salome"
},
"reviewBody": "Made this and liked it, thought it could use more hot sauce or something in the cheese, fiddly to make as the coating has to be applied not just dipped but overall satisfied my craving for chili rellenos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Ann"
},
"reviewBody": "So nice of you to share this recipe, it is better than what I have had in restuarants! I followed the recipe carefully and found that the chlies were easy to peel, and the batter was perfect--some recipes don't add flour to the egg mixture, and I think this made the batter easier to work with. The only thing I did differently was that I put less oil in the pan (half canola, half olive oil) and fried the chiles on either side, medium to slightly less than medium heat about 10 minutes per side til they were browned. No need to then drain them on paper towels. Also, next time, I think I would put less mozarella and more cheddar. I didn't make the sauce, used a 10 oz can of red enchilada sauce that I simmered on the stove while the chile rellenos were cooking, maybe I'll have time to try the sauce next time. Really great recipe, many thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ShellBelle"
},
"reviewBody": "I had the darndest time pulling the skin from these Chile's and ended up with torn peppers. I couldn't fry, so I baked them instead and poured the sauce which I added meat to on top. They tasted really good. I decided the baked ones were probably better for me than fried so I might give this a second try. Meanwhile, I'll keep ordering these at my favorite Mexican restaurants. They're worth every dime!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cornbread81"
},
"reviewBody": "These were great, really enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KerryElizabeth"
},
"reviewBody": "This was fantastic. Chile Rellenos is one of my favorite dishes and I have eaten my way across Oklahoma, Texas, New Mexico and Arizona! This is as good as ANY I have ever had, and, my husband agreed. For planning purposes, I think I would roast the peppers and make the sauce one night, then do the rest the next. It is a bit time consuming, but nothing about this recipe is hard or complicated. I made Cilantro Lime Rice to go with this and we were in heaven. A+++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cortezdelp"
},
"reviewBody": "I am making them for the second time. Both times I used Anaheim chilis and stuffed them with thin slices of Monterey jack cheese. I skipped the freezing step and they turned out fine. Do you mix the egg yolks with the flour mixture and then add to the beaten whites? This seemed odd but the batter turned out fine and stuck better than other times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MichelleG"
},
"reviewBody": "Loved the chili relleno but the sauce was too sweet for our taste. Would make again with a different sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda May"
},
"reviewBody": "I don't know if I did something wrong but the Chili's themselves the breading part had almost no flavor and all I tasted was a poblano pepper which is perfectly fine but I was thinking it would have more flavor on its own without the sauce. I will definitely try this again adding in some different seasonings to maybe kick it up a little bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hgriffee"
},
"reviewBody": "The sauce was delicious as is, but when I made this again with 1 large diced tomato, some oregano, cumin, salt, cinnamon, sriracha, and 2 tablespoons of salsa and it tasted so much fresher. A few of my peppers always seem to fall apart a bit after roasting them, but the batter seals the filling in quite well so when you fry the peppers everything stays together! Will definitely make this again, thank you for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quiet-one"
},
"reviewBody": "Made this recipe tonight and everybody loved it. The tomato sauce was fantastic. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Very good and very authentic recipe! I avoided the freezing stage by using French fry-sized pieces of Monterey Jack and cheddar in place of the shredded cheeses. I had enough meringue to coat 6-8 chilies, so if you're going to take the time to make 4, why not make 8 instead? Poblano peppers are not particularly spicy, but the inch closest to the stem can be, so be careful! I suggest that you broil the chiles as close to the flames as you can get them. When I made these, I think some of the peppers were over-cooked because they started to split. A faster roasting probably would have avoided this outcome. I also used a clean paper bag instead if plastic because I don't really like the idea of putting hot things into plastic. Who knows what plasticizing agents come out of the plastic and into your food with the heat? As long as the chiles are well floured, you can ensure that they stay closed by coating them with the meringue and immediately frying. Overall, this recipe had wonderful flavor and a beautiful presentation. Now, if only I could find a super Mexican rice recipe . . . I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vavoomy"
},
"reviewBody": "This is a great recipe. Yes it is a lot of work, but totally worth it. This is the same recipe my mom got from a Mexican friend years ago, so I know this is the real deal. The instructions were clear and direct. I do agree with another review stating this recipe is more suited for an intermediate to advanced cook. It was tough to get the timing right for the peppers along with the sides for this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Michael Alvarado"
},
"reviewBody": "The 3 cheeses suggested for this recipe are completely wrong, the only type of cheese used should be Enchilado cheese. There are only 5 easy steps for chile rellenos trust me I've been making them for over 20 years now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Freeze"
},
"reviewBody": "THIS WAS THE BEST CHILI RELLENOS EVER..even better than most Mexican restaurants I've been to! I too, was very intimidated by the \"list\" of ingredients, just get over it! lol..I've made these several times now and freezing the peppers and sauce ahead of time is very time saving. I changed nothing! My husband loved them, my son, (40 yrs old) said I should get an award for best dish EVER!! So, thank you Fat Dog Lane for the best recipe EVER!! Sincerely, Melanie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "josiearizona"
},
"reviewBody": "I just tried this recipe and my kids and I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bodidR"
},
"reviewBody": "OK, lets be very clear. What you put in the peppers influences the taste, but its the SAUCE that's amazing and makes this all worth it. Leftover sauce is good for just about anything, burritos, chips, eggs, anything! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Phillips"
},
"reviewBody": "This is a favorite in our house, we eat them every May 5th and I get excited about it months in advance :) My husband ate authentic homemade mexican food for a couple years and recommended I swap the tri-cheese blend for queso fresco. There wasn't any at the store so I bought Cotija cheese instead and it was so amazing I've never gone back! (way better than using monterey jack). I've also heard my mother-in-law say that the batter can be too eggy so I omitted 1 egg white from it (so I use 4 whites instead of 5) and I like it that way. They can be time consuming so I often prep the peppers the day before then leave them covered in the freezer overnight. My husband says they are the best he's ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kymbrown1"
},
"reviewBody": "One thing you can do instead of freezing the peppers is to simply remove the seeds before you roast/blacken them. Don't run them under water, just use a paper towel to rub the blackened skins off so you retain all the flavor. I use queso quesadilla with great results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Webber Akre"
},
"reviewBody": "FINALLY! I have found a true to form recipe for rellenos! My whole family loves these, including the 7 year old. When I separate eggs for other recipes, I freeze any leftover egg whites so I always have them around. The sauce in this recipe is really special. That little bit of cinnamon sends the flavor over the top. Make the effort...such a great dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Harvey"
},
"reviewBody": "Labor-intensive, but worth it! Definitely agree that if you're going to do 4, you might as well do 8, or 12."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Speaks"
},
"reviewBody": "Totally delicious. Followed pretty much exactly. 45 minutes prep time is dreaming, though. Plan ahead, but do make this. Also, doubling the sauce would not make you sad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Haddad"
},
"reviewBody": "Fantastic. The sauce was to die for!! I'm going to try using it with other recipes. Wish I had used rubber gloves when I peeled and cleaned the peppers because my hands burned for awhile. Well worth the extra time and effort to create a really really good relleno. Next time I'm going to take one persons advice and make a bunch of peppers and extra sauce and freeze to be used as desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "Soooo good!!! \nEveryone I've ever made these for say they are the best they have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RReid"
},
"reviewBody": "Easier than it seems. Just time consuming. Absolutely delicious. I did the roasting and stuffing and freezing part a week b4 i finished the rest of the recipe. Very very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buckeyehc"
},
"reviewBody": "I added a bit of cream cheese to the cheese mixture to keep it together, which made it easier to work with. I also did not have enough of one kind of oil so I had to combine a mishmash of coconut, canola, and avocado oil. It worked! This was even better than in a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marvels51"
},
"reviewBody": "I've made these twice now and they are a lot of bother but totally worth it! I agree with another review - make extra to the stuffed stage and have that part done and in the freezer. I've also used canned enchilada sauce for leftovers and it wasn't bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LynnNM"
},
"reviewBody": "I tried this recipe when I was out of the red chile powder I needed to make my favorite red chile sauce for rellenos. I've been making homemade Chile Rellenos for over 30 years now and make the batter for the rellenos pretty much the same way as this recipe. It takes a bit of work but the results are delicious and not the least bit heavy or greasy . I tried the sauce recipe here but in my opinion, it was too tomato-y and did not work well with the relleno. Out here in New Mexico we (strongly) favor a sauce made from pureed red chiles, using no tomatoes, cinnamon, etc. for our rellenos. So, for the battered chiles, I give this 5 stars. I give the sauce 2 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynnell Taylor"
},
"reviewBody": "These are the best! We LOVED them. I recommend having at least 2 cooks in the kitchen though because I did it by myself and it was a LOT of work. However, they are so good it's worth the work and I've made them twice now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alma"
},
"reviewBody": "I think that Chihuahua cheese is the only cheese to use for chiles rellenos. I will stick to the way I make them. Much simpler and better tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harrietvane"
},
"reviewBody": "Excellent recipe! My first attempt at this dish--using a different recipe--was a disaster, but this one came out perfect. I think it works best as a 2-day project: stuff and freeze the peppers on day 1, make sauce and fry peppers on day 2. \n\nOne modification I made was to dip the flour-dredged (still-frozen) peppers in beaten egg before applying the batter coating. I think this helps to seal up cracks in the peppers, preventing leakage of filling, and makes the batter adhere better. And make sure to choose peppers with the stems still attached! The stem makes a great \"handle\" to lift and turn the peppers when frying them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lelamarie_jones"
},
"reviewBody": "My husband was impressed. I thought it wasn't worth the time, but he wants it again. I will leave out the cinnamon next time. And, my peppers tore on me while peeling the skin off. Made it harder to stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwright114"
},
"reviewBody": "Just finished cooking this wonderful recipe and eating it! Amazing! Perfect texture on the batter, flavor is wonderful, and the sauce is just what it needs. Added a little sugar to the sauce (1-2 teaspoons) Just the right little zip to the taste. I also used Rotel Tomatoes for the stewed tomato for some heat. My husband is on his second one and loving it! Served with refried beans with cheese sauce and chipped onions on top. Will make this many times in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teara1"
},
"reviewBody": "I tried this recipe for my mother's birthday, it was beyond delicious! I got rave reviews from my whole family. Will make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Chilis Rellenos is my wifes favorite dish. She won't go into a Mexican Restaurant if they don't have it on the menu. We haven't had Chilis Rellenos this good since last going to Zihuatanejo MX. These were every bit as good as those in Mexico!!! Time consuming to make, but I have a feeling whenever we can find Poblano Peppers...She'll want it at least once a month. I'm going to start making them ahead and freezing them as suggested. I did not use the cheese listed. We bought some good Chihuahua Cheese. Melts fantastic and tasted great. I highly recommend this recipe and can't wait to make it for my wife again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "I added ground beef cooked &amp; spiced with chili powder, salt &amp; pepper to the cheese filling, and I left the stuffed poblanos in the freezer for a couple of days. I ended up adding a little water to the flour - egg yolk mixture before folding it into the stiff-peak beaten egg walks so everything would fold in together. Came out tasty &amp; spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa in New Orleans"
},
"reviewBody": "The real beauty of this is that after step 3, you can freeze these babies and wait until another time to finish cooking them (and the sauce). I do use other cheeses - no cheddar or mozzarella cheese at all! I have been making these for many years, and this recipe is almost identical to mine, with the exception of the cheeses. The only 'tip' I would add is that when you start to fry the peppers, lower them very carefully into the hot oil and before you flip them, spoon some of the hot oil over the top of the egg mixture coating the peppers, otherwise, when you flip the pepper all of the batter will splatter off. Thanks \"fat dog\" for a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmfred"
},
"reviewBody": "I loved it but my daughter didn't care for the texture. I will definitely make it again! Thank you for the awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Persin"
},
"reviewBody": "The good? It was ALL good. It took some work but most of it was in the side dishes and, since my electric mixer is on the fritz, I had to whisk the egg whites the old fashion way. My arm still aches.\n\nWould I do it all again? Absolutely!\n\nI was a little taken aback about putting the stuffed peppers for \"at least 30 minutes,\" but I soon discovered that it is an integral step. It makes handling the once floppy peppers a breeze.\n\nBottom line is it was a bit of work but the result was well worth it. I've paid $25+(each person) for these at a restaurant and they weren't as good. This recipe might cost $12 (plus sides) to feed 4.\n\nGo for it and make any personal adjustments to your taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "firefly"
},
"reviewBody": "I really liked these, but my husband thought they were to spicy. I used green chiles from a friends garden. I too had tiny holes in my chiles from removing the seeds, but cheese didn't spill out. I baked mine because I do not usually fry or deep fry. I will try frying next time. I could not make the sauce because I sent hubby to the grocery and he forgot the stewed tomatoes. Served with spanish rice and sour cream. I will make these ahead and freeze them until ready to use to cute down on prep time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cole8587"
},
"reviewBody": "A different texture then what you would find in a Mexican restaurant but still truly amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "OMG...these are awesome!!! I used Hot Hatch Peppers and the heat was perfect. Also, I didn't freeze before frying and they were perfect! The batter is light and crispy. Thank you for sharing this wonderful recipe with the world:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reena"
},
"reviewBody": "The BEST relleno recipe I've ever had. Yes - it was time consuming... but it was simple! Amazing flavor! The freezer trick was perfect. The sauce was unbelievable. Love love love this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lys"
},
"reviewBody": "This recipe is amazing! I've had my fair share of attempts at making chile rellenos and they have never come out as perfect as these do. My dad orders chile rellenos everytime we go to a mexican restaurant and he claims he has yet to find any that will beat these. I think the sauce also really makes the dish, it's delicious. :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214088/real-chiles-rellenos/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214088/real-chiles-rellenos/",
"name": "Real Chiles Rellenos"
}
}
]
}
}
, "about": [
]
}
]