				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Red Velvet Cupcakes"
,"datePublished": "2009-11-03T20:13:42.000-05:00"
,"dateModified": "2023-01-03T14:14:46.000-05:00"
,"author": [
{"@type": "Person"
,"name": "McCormick Spice"
,"url": "https://www.allrecipes.com/cook/mccormickspice"
}
]
,"description": "These red velvet cupcakes are soft, moist, and buttery. They&#39;re topped with a homemade tangy vanilla cream cheese frosting for a gorgeous sweet treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/R03ssv2jH5Xg2qfGzyTVtWIRb-A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5789703-f0c4b179200b43a5bcd1ef90748c29fe.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Red Velvet Cupcakes"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "1542"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "277 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "58 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "174 mg"
,"sugarContent": "28 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2.5 cups flour",
"0.5 cup unsweetened cocoa powder",
"1 teaspoon baking soda",
"0.5 teaspoon salt",
"2 cups sugar",
"1 cup butter, softened",
"4 large eggs",
"1 cup sour cream",
"0.5 cup milk",
"1 (1 ounce) bottle McCormick® Red Food Color",
"2 teaspoons McCormick® Pure Vanilla Extract",
"1 (8 ounce) package cream cheese, softened",
"0.25 cup butter, softened",
"2 tablespoons sour cream",
"2 teaspoons McCormick® Pure Vanilla Extract",
"1 (16 ounce) box confectioners' sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Line 30 muffin cups with paper liners."
} ,{
"@type": "HowToStep"
,"text": "Make cake: Mix together flour, cocoa powder, baking soda, and salt in a medium bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Beat sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, about 5 minutes. Beat in eggs, one at a time. Mix in sour cream, milk, food color, and vanilla. Gradually beat in flour mixture on low speed until just blended; do not overbeat. Spoon batter into the prepared muffin cups, filling each 2/3 full."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into a cupcake comes out clean, about 20 minutes. Cool in the pans on a wire rack for 5 minutes. Remove cupcakes from the pans; cool completely."
} ,{
"@type": "HowToStep"
,"text": "While cupcakes are cooling, make frosting: Beat cream cheese, butter, sour cream, and vanilla extract in a large bowl until light and fluffy. Gradually beat in confectioners&#39; sugar until smooth."
} ,{
"@type": "HowToStep"
,"text": "Spread or pipe frosting onto cooled cupcakes."
} ]
,"recipeYield": ["30"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kirstenpoel"
},
"reviewBody": "The consistency of the cupcakes were good but the flavor was really lacking. The frosting was good but a little runny and needed extra powdered sugar to thicken it up. They were ok but didn’t have the red velvet flavor, just a lightly sweetened cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnnaBowman"
},
"reviewBody": "I chose this recipe because I wanted a red velvet cake without the nasty flour frosting, I \"brewed\" the cocoa before mixing it into the batter, and... wow. This might be the best cake I've ever made. I heated the 1/2 cup milk in the microwave for 2, 30-second bursts, then stirred in the cocoa and let it sit while I followed the remaining instructions word-for-word. I wanted a cake, not cupcakes, so I divided the batter between two 9-inch rounds and baked at 350F for 45 minutes. I'm at about 4000ft altitude, for what it's worth. I haven't tasted the completed cake yet, but one lick of the batter was enough to convince me I'd done something right. If you're looking for a red velvet cake recipe that's moist and flavorful, give this one a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these for a colleague's birthday and they tasted so horrible I couldn't get myself to bring them to the office. I followed the recipe exactly to ensure I would be able to leave the most accurate review, and I mixed the batter very gently to avoid overmixing. The cake itself is almost flavorless. The cocoa is mild like a classic red velvet, but there is nothing to cut through it or add any extra pizzaz other than the icing, which is far too sweet given the amount of confectioner's sugar. The sour cream adds some decent moisture, but as a nontraditional ingredient for red velvet, it doesn't add much of anything other than that. The use of regular flour also totally threw this cake off, making the cake almost chewy in consistency. These cupcakes ended up being overly dense, flavorless, and relied far too much on a just-OK cream cheese frosting. Use the New York Times red velvet recipe instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is my go to sweet treat for any gathering, it is always a fan favorite. Best cupcake recipe I've ever tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made these for my brothers birthday and he loved them. They turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved them there were light and fluffy easy to make they are not overly sweet and the cream cheese frosting is to die for! This is my go to red velvet cupcake recipe. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BakerBee"
},
"reviewBody": "Let me start by stating that red velvet is good but not one of my favorites, so I truly never made it before. I tried this recipe and it was meh/ok based on comparisons to red velvet cupcakes I have eaten in the past. The taste and texture just weren't quite right....So, I began my intense research and learned a lot in my quest for the best red velvet cupcake recipe: Red velvet must be made with cake flour, have buttermilk, vinegar, butter and oil in the batter in order to have the best texture as well as taste as it should - imho. No sour cream. No over beating the batter, need to barely beat it in fact. Red velvet cupcakes do better made with baking powder, not baking soda (not mandatory but baking powder gives the cupcake a slight dome shape, not flat like with baking soda). I also learned that this recipe calls for a bit too much cocoa. I found a perfect recipe elsewhere. My cupcakes made with the recipe from another site came out moist, delicate and velvety as they should be - perfection!! I will never need another red velvet recipe in my life now. I am sure this one is good enough but I am a crazy perfectionist when it comes to baking. It's just a hobby for me but I can't serve things that don't meet my ridiculously high standards in taste. Oh, the frosting here is good for a heavier cream cheese frosting. I found a lighter one , on this site, that pairs better with my delicate cupcakes. One more thing... I baked mine at 335° and that was the perfect temperature!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "proudmomto2"
},
"reviewBody": "This is our favorite cupcake recipe! We omit the red dye so we call them “brown velvet” cupcakes ;) I can’t speak to the icing for the recipe because we have a favorite whipped cream recipe that we found on this site, but the cupcakes are top notch! My hubby who doesn’t even like chocolate loves these cupcakes! Definitely fills 30."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rose Allison"
},
"reviewBody": "Very good flavor and moist the frosting was nice too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "krirod17"
},
"reviewBody": "Great recipe. Definitely needs some more information regarding storage! Ya'll please don't forget to refrigerate your cupcakes! If you don't like cold cakes, take them out about 45 minutes before serving. The frosting was a bit too runny for me. I added 2 tbsp of cornstarch to mine, and it thickened to just the right consistency. Mangia!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "goalcollector91"
},
"reviewBody": "It tasted fine but needs more sugar. It requires too much food coloring because of the amount of cocoa being added and I don't like the sour cream it would be better with butter milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PumpkinPie"
},
"reviewBody": "These turned out all right. Not exactly how I'ld want them but still.\nNot red. I used a pot of red gel and I used a lot and the batter still didn't turn out red like the picture. I later bought a bottle of super concentrate red liquid (for icing) which might have made a difference because it was powerful stuff.\nDry. Not sure why...lots of eggs, sour cream. This should have been more moist.\nTaste - no complaints here. Tasted chocolatey. Don't skimp and buy the cheap cocoa powder. I used Fry's\nI will try a different recipe next time just to see."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "omcneal1"
},
"reviewBody": "Great Recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ARBethany"
},
"reviewBody": "Giving this 4 stars since I didn't make the frosting for the cupcakes and therefore can't rate that part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This was horrible. I looked over the recipe as much as possible to figure out where I went wrong but I couldn’t figure it out. It tasted too salty even though I put less than asked, and it was not nearly sweet enough to be considered a cupcake. The frosting was okay I guess, but the cupcakes were unable to be salvaged"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Pisarczyk"
},
"reviewBody": "They came out absolutely perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Doggo"
},
"reviewBody": "It said it made 30, but somehow I only got 17 so I have a whole bunch of frosting left over. The cupcakes barely rose, and it stuck to the cupcake linings a lot. When I tried one, the cake was pretty gross. Way too much cocoa powder. Now I feel sick to my stomach. The frosting was pretty good but a little sweet for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TALIAH WRIGHT"
},
"reviewBody": "amazing! made more than 30 cupcakes. would recommend making a little more icing though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pmobley"
},
"reviewBody": "I always debate between an oil based and butter based red velvet cake. This cake was moist and amazingly delicious. This is hands down the best red velvet cake I’ve made. The reviewer that said it wasn’t moist must have left something out. This cake had sour cream and milk! It has to be moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blessed Baker"
},
"reviewBody": "I made the recipe as stated. I will probably put less vanilla in the frosting next time. I like the cream cheese flavor to shine. One of the best red velvet cupcakes that I have tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "The lazy Gamer"
},
"reviewBody": "The recipe did not turn out at all, was not velvet, had a cracked top of the cupcake, and did not taste good. Would not recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEANW615"
},
"reviewBody": "The cake portion of this recipe is stupendous, probably one of the best I've ever made. But I'm really (really) disappointed in the frosting which is a runny mess, nothing like the pictures. It's more like the drizzle you put on top of a cinnamon bun. I couldn't get it to thicken even when I whipped in powdered egg white. It's also way too sweet, the immense volume of sugar drowns out the cream cheese and vanilla flavoring in my opinion.\n\nBummer because I made this recipe for a birthday party and now I'm going to have to serve the cupcakes on a plate with frosting on the side to be drizzled over, since it will all run over the sides of the cupcake papers if I put on more than a teaspoonful. \n\nI'd make this again but I'll definitely use a different buttercream frosting recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Souheir"
},
"reviewBody": "I followed the I instructions to the dot. The cup cakes were super dry. The icing was on point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Tuning"
},
"reviewBody": "Came out amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "timelocked"
},
"reviewBody": "Terrific recipe as-written.\n\nAlso works well with 3/4 c. oil in place of the butter, if you're like me and forget to check the fridge before starting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fatimah Bajerai"
},
"reviewBody": "I followed the recipe exactly as is, but reduced the sugar by half. I also did not beat the sugar and butter together (forgot to read the instructions) but it turned out good! I'm not a huge fan of red velvets, but this one was the best I've had so far. Moist, fluffy, not incredibly sweet. Gotta keep in mind there's a lot of sugar in the icing too. \n\nPS: I love that you can adjust the measurements by how many servings you're making on this website!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Nowinski"
},
"reviewBody": "Okay. The first time I make this recipe, I loved it BUT it wasn't quite perfect. However, it was the best recipe I have come across in 20 years. Not wanting to give up, i read the reviews. I took the advice of others and made some modifications which included the following: used cake flour, 1 c buttermilk, 2 1/2 t vanilla, 2 1/4 c sugar. I also added a T of Wilton red velvet flavoring. These modifications were based on reviews of others. Turned out PERFECTLY. Better than any bakery. I will use this recipe forever. Highly recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cherry"
},
"reviewBody": "I loved it and my family did to, the only thing that I change was the sour cream and did plain yogurt instead"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Tastes great and looks cute, but there was a little too much batter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Azucena Barocio"
},
"reviewBody": "I helped my daughter make these per my son's request. The recipe was straightforward and easy to follow. The cupcakes did not rise and the taste was not what I expected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaylee"
},
"reviewBody": "The cake was really good but the frosting was not. Ended up using a different cream cheese frosting recipe and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brooklyn"
},
"reviewBody": "No problem the recipe is simple I like that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanie Scoles"
},
"reviewBody": "This is the best recipe I have ever made. It is legit my favorite thing to bake and everyone loves it when I make them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAVANNAH PARKS"
},
"reviewBody": "UTTERLY DIVINE. I love baking . I've used this site many times and I've never been disappointed. However, I used 1/4 cocoa powder instead of 1/2. cupcakes were moist and soft, and the icing was amazing . Also, with my mixer, you dont need to beat the batter on level 5, level 2 or level 3 will do. This makes 30 cup cakes. I made 12, and used the remaining batter for a cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ma Ru"
},
"reviewBody": "I had to make a few changes to the icing (added milk and more butter) but they turned out very well. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookBookGuy"
},
"reviewBody": "Read the first step..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Johnston"
},
"reviewBody": "so soft and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabrielle Watson"
},
"reviewBody": "Me and my family loved the cupcakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Izzy"
},
"reviewBody": "Suprinsingly for cupcakes, these did not take that long to make but unfortunately that was the only positive thing about them. I followed the recipe exact for both the cake and icing. The cake was extremely dry and not very flavorful. For the icing, it tasted amazing but it was so runny that I had to put them in the fridge as soon as I spread them on or else they would drip down the cupcake liners. I tried to make it thicker by putting my electric whisk on a higher speed and adding more icing sugar, but it made no difference. Personally I would not make these again, and I had high hopes for the outcome after reading all the reviews but they did not reach my standards."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny"
},
"reviewBody": "The taste of these cupcakes were perfect to me, it was just that they felt really filling, or heavy and dense. To make the cupcakes more airy, I would recommend only using the egg yolks, and when the batter is done, beat the whites and add them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johanne Trudeau"
},
"reviewBody": "I have made this recipe several times and have even made it as a cake. Rave reviews all around. So moist and tasty..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teodora Sasaran"
},
"reviewBody": "Great recipe will make again. The recipe made more then 30 cupcakes though. I would add a teaspoon of vinegar and change the amount of flour to 2 1/4 cups. I baked it at 325 degrees and left it for 25 min. I would also double the amount of frosting because it was not enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emerson egbert"
},
"reviewBody": "Amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brenda Martine"
},
"reviewBody": "A little dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Becca Lee Cash"
},
"reviewBody": "The cake was on point but the icing or frosting was unusual and sour. Maybe I did it wrong but we did not like the frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Brown"
},
"reviewBody": "Easy simple tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vikkidawn"
},
"reviewBody": "These were a big hit for my son's 22nd birthday. I didn't have enough sour cream and substituted with vanilla yogurt. \nDelicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dominic DeMark"
},
"reviewBody": "Wow. This was such an amazing recipe. The only modification that I made was having 2 1/4 cup sugar instead of 2 cups to make it a little more sweet! I also had to add a little bit more Powdered sugar since my icing was a little too wet for my liking. If you are looking for thicker icing and easy to decorate with, I would suggest using about 24 ounces instead of the recommended 16. Other than that, amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tina Willson"
},
"reviewBody": "The cupcake \"batter\" when I made it following the recipe was so thick it felt like I was making cookies. A fourth a cup of milk as well as 1tpsp of vanilla and 1tbsp of coca powder(to try to keep it from going too bland) later it was at least pretending to be cupcake batter. The resulting cupcakes were dry, bland, and dense. The frosting was also sickly sweet. The only reason I'm not giving this 1 star is because I altered the recipe and prefer to give it the benefit of the doubt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rocela"
},
"reviewBody": "excellent recipe. Easy to make and great taste, not tarty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terra Christensen"
},
"reviewBody": "No changes besides the dye!! (We did green for at pattys) And I only got 25 cupcakes not 30 so the nutritional facts were higher."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Torogirl"
},
"reviewBody": "I’m not sure what happened to my cupcakes.. I tried to follow the recipe with the modification but my cupcakes were so moist that they practically fell apart...was I supposed to add the the one cup buttermilk &amp; the sour cream ? My husband liked them &amp; Loved the frosting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leigh Johnson Qualls"
},
"reviewBody": "Incredibly moist and delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Used up two packs of cream cheese for my frosting cause one wasn't enough (i guess the size differs in each country).\nDidn't use full bottle of color, used about 2 1/2teaspoond.\nThese cupcakes were amazing and a big hit to my customers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GinnySapphire"
},
"reviewBody": "So bland I followed the recipe to the letter. Should have read comments first for other reviews"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanMcD"
},
"reviewBody": "Wow are these delicious! I took it a step further and filled them with the filling used in \"Cream Filled Cupcakes by Grace W.\" The cake itself was moist and velvety, not over sweet and a good chocolate flavor. You need to try this recipe and decide for yourself. Thank you Grace for sharing a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cara Richardson"
},
"reviewBody": "The cake recipe was delicious. I added more confectioners sugar till I had really nice sturdy peaks. Followed the icing recipe initially and found it too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dannia Pommer"
},
"reviewBody": "The cake was great but I really didn’t know how much food coloring to add so them came out chocolate instead of red"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kaye Valenzuela"
},
"reviewBody": "The frosting was way too sweet and didn't keep its form"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "that_jayna_girl"
},
"reviewBody": "They were delicious! They took about the time the recipe calls for and it was worth it! They were very good and the frosting made it even better. These are definitely a make-again! Definitely try this on a night you have some time, because they do have to cool in order to put the frosting on, otherwise the cupcakes will crumble"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimi"
},
"reviewBody": "These are cute and fun to make. The cream cheese icing tastes great but it's too thin to pipe or take on a design. I still added some extra touches to make them adorable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beach Babe"
},
"reviewBody": "I made these as gifts and ended up making them into mini-Bundt cakes. So good! I think next time I will try less flour and a touch more buttermilk (I used buttermilk instead of regular milk). They were a hit and I’ll make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ijanae Hunt"
},
"reviewBody": "this is the best recipe app ever!!!!!!!!1"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jals Hal"
},
"reviewBody": "I ATTEMPTED THIS AND IT TURNED OUT TO BE A DISASTER. HIGHLY UNRECOMMENDED."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Best frosting ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Best frosting ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YellowFish"
},
"reviewBody": "No changes made! I was worried that the cupcakes would turn out too dry since a few of the reviews mentioned that but I had no problems. The cupcakes were moist and flavourful and the frosting was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hina"
},
"reviewBody": "They came out moist and yummy :) My friends liked them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne McPherson"
},
"reviewBody": "Omg this is the best and easiest red velvet cupcakes recipe! I made a double batch and was short about 1/2 cup of flour so I added pancake mix to make the difference and they are delicious and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naughtyspider"
},
"reviewBody": "No changes needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plainjj"
},
"reviewBody": "OMG the best ever!!! I made almost 100 mini Cupcakes with this recipe. Moist. flavorful and so easy to fill the cupcake liners. The batter is fairly thick which made it easy to do with NO MESS! This recipe made 98 mini cupcakes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cath_b"
},
"reviewBody": "We made exactly as written here, no substitutions (except we opted to not use food coloring) in cupcake recipe or frosting recipe and it came out yummy, moist, fluffy and brown. The frosting was not very sweet either but then again, we all have different levels of sweetness preference. \n\nThis is not my first time to make red velvet cupcakes but I wanted to try using sour cream as oppose to the buttermilk that I have been accustomed to using. \n\nThis is also very easy to make as my almost 10 year old made it herself. Very pleased with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Damon Jones"
},
"reviewBody": "I have been baking for over 30-years. I have attempted countless time to perfect cream cheese frosting. For the past decade, I just avoided cream cheese frosting altogether. Ladies and gentlemen, this IS it. I, personally did not try the cake. However, I served decorated versions of this recipe at a large gathering. EVERY ONE absolutely LOVED them. I received so much praise, I was embarrassed and left. I am praised on my baking efforts regularly and am proud of them so this give you a good idea of how crazy people were about them. I will make them again this weekend for my family. I followed the recipe without substitution and baked cake in oversized cupcake pans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amelia Helms"
},
"reviewBody": "I l.o.v.e. this recipe and have for so long. It’s a little moist &amp; fluffy with a great velvet flavor!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "guera"
},
"reviewBody": "Followed cookinmama’s modifications and they turned out great! Everyone truly loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "????Arthur"
},
"reviewBody": "They tasted more like chocolate muffins ( didn't put icing on ) than red velvet however family still enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heachan11"
},
"reviewBody": "These cupcakes were a hit at my office, i was surprised how much food dye the recipe called for but the color turned out a nice deep red. Keeping this recipe for future use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sparkle77"
},
"reviewBody": "I did a half recipe for my family for a birthday. Out of the oven cooled, the cupcakes were a little dry. The frosting was a little runny. The recipe could have used a little more cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Dickerson Cowden"
},
"reviewBody": "Will make it again. Very moist and tasty. I personally liked it because it was not overly sweet. Even my pickiest eater loved it. I did not modify the recipe at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari-Ann Grant"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ProBaker0323"
},
"reviewBody": "These cupcakes are great, mine came out a little dense. I am pretty sure that I baked them for too long though. I did not like the icing ONLY because it was not thick enough to pipe onto the cupcake and it has to stay refrigerated or else it will melt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Tan"
},
"reviewBody": "Followed the advice of some reviewers by increasing the sugar. Too sweet for me. Think will stick to the recipe next round. Love the frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Molly Robinson Couto"
},
"reviewBody": "Mine turned out light brown like chocolate, not red like the traditional red velvet. The flavor is good, and the texture is spongy and nice...but seems like the recipes that use vinegar get the true red color better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frances ZiyiFan"
},
"reviewBody": "No modification made to the icing - taste good but too runny"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Morton"
},
"reviewBody": "Moist and easy to make. I made these with my 10 year old and they were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bevan glynn"
},
"reviewBody": "it tasted good but i do not like food color"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Hill"
},
"reviewBody": "They were delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Klaudia Kukla"
},
"reviewBody": "Made it with NO modifications and they turned out amazing! Would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Reid"
},
"reviewBody": "If I made changes it wouldn’t be a red velvet cupcake. Our son (38) declared 30 years ago if it didn’t have the cooked frosting it wasn’t a ‘real’ red velvet cupcake. So we always have the cooked frosting??!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hvpeace68"
},
"reviewBody": "It was an easy recipe to follow. Makes a lot of cupcakes. 24 regular and 12 mini cupcakes. I ran out of regular cupcake tins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wizerz"
},
"reviewBody": "Tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Esparza"
},
"reviewBody": "Delicious!! My grandkids loved them. The cupcakes were moist and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jruby85"
},
"reviewBody": "The frosting is a bit soft. Will try a different frosting that can hold better. The cake was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jed Ham"
},
"reviewBody": "I loved this cupcake though it tasted more like chocolate . \nand I used my recipe of icing you can find it on allrecipes \nit is titled \"My families favorite cream cheese icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gina Uebel"
},
"reviewBody": "I'm not a fan of red velvet but my daughter requested and everyone seemed to like them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Italian Chameleon"
},
"reviewBody": "I love these!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/212429/red-velvet-cupcakes/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15595/desserts/cakes/red-velvet-cake/",
"name": "Red Velvet Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/212429/red-velvet-cupcakes/",
"name": "Red Velvet Cupcakes"
}
}
]
}
}
, "about": [
]
}
]