				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Refreshing Cucumber Lemonade"
,"datePublished": "2020-06-18T23:39:28.000-04:00"
,"dateModified": "2022-08-31T15:24:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DASHKAYDOT"
,"url": "https://www.allrecipes.com/cook/599259"
}
]
,"description": "Lemonade with cucumber juice is a unique way to serve this homemade summery drink. Serve cold or over ice garnished with lemon and cucumber slices."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/COq6hxBBRDwE-wU7w2evXLy5ncA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/240115-30763c1e632b47939490f03e1e541d5a.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Refreshing Cucumber Lemonade"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "66"
}
,"cookTime": "PT5M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "141 kcal"
,"carbohydrateContent": "46 g"
,"fiberContent": "8 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "8 mg"
,"sugarContent": "26 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 cup water",
"0.5 cup white sugar",
"1 cucumber, sliced",
"6 lemons, juiced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make the simple syrup: Combine water and sugar together in a saucepan over medium heat; heat until just about to boil and sugar has dissolved. Place in refrigerator until cool, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Blend cucumber in a blender or food processor until mashed into a pulp. Pour cucumber pulp into a fine mesh strainer placed over a bowl; allow to sit until you have about 2/3 cup of cucumber juice in the bowl, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir simple syrup, cucumber juice, and lemon juice together in a pitcher. Serve cold."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yooperdenise"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it! Added more h2o tho. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liv"
},
"reviewBody": "I used limes instead of lemons because, yeah, you've heard it before, that's what I had on hand. My husband and I absolutely loved it -- tart and fresh and delish. I strained the pulp from mine, but he thinks that's such a waste so he drinks it pulp and all. I've made it twice now and will do it again regularly. Thanks for the great idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becki"
},
"reviewBody": "I did not make any changes. Great the way it taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakinglover"
},
"reviewBody": "I loved it! But i did make it different instead of lemons I used limes and add more water and more sugar as necessary. I found it too bitter with lemons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs.Clark14"
},
"reviewBody": "AMAZING!!! \nI made mine a different way but the same ingredients.\nFirst I blended 3 large cucumbers with 3 lemons (without peeling) and a sprig of fresh mint, added water to blend smoothly. Next I strained and added to a 1 gallon pitcher. Added water to fill and sugar to taste. That was it. Very simple and fast. My family loved it ESPECIALLY my kids who are always hard to please!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhonda"
},
"reviewBody": "This is a great recipe. I followed it exactly as written and my husband and I both loved it. So refreshing! And what a great way to kick lemonade up a notch. Also a great way to use up the cucumbers from my husbands garden! I can't wait to make this for friends and family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Torre Hoffmann"
},
"reviewBody": "This took a decent amount of work to make. I used a pretty big cucumber and I couldn’t get any more liquid out of it than 1/3 cup which was half the amount it was supposed to make. So I didn’t have as much lemonade as I would’ve liked. If I had a juicer for the cucumber it would’ve helped. The final product was delicious and refreshing. Very tart and very sweet though, so I’d suggest adding 1/4-1/2 cup of water at the end to dilute the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather Savage"
},
"reviewBody": "I like the flavor of the cucumber with the lemon, but I felt there was too much lemon. It almost immediately gave me heartburn from the acid. I did use bottled lemon juice (1-1/2 cups, per recommendation of another user.) Next time, I will reduce that to 1 cup and see if it is better. I had to add more sugar this time to help with the sourness of the lemon, but I may not have to when I reduce the amount of lemon juice. I had a large overgrown cucumber from the garden to use up. I got about 3/4 cup juice from it, and put it all in. Then I added the lemon juice and simple syrup - no need to cool down for a long time. I put this all in a 2-qt pitcher, added about 1qt ice cubes and filled the rest with cold water, then stirred. The ice melts and cools down the drink very fast, and the water to flavors ratio was good. I have some mint and basil in the garden. I am going to try placing some leaves in individual glasses of this to see how it tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula876"
},
"reviewBody": "I used bottled lime juice instead of lemon juice, because that was what I had. The syrup is a no-no, especially with a diabetic in the house, so I sweeten it by the glass with Stevia and everyone can sweeten to their taste. I will definately make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mckenzie cook"
},
"reviewBody": "this wasn't that good and was WAY too sweet, basically just wasted a bunch of ingredients"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kal L'Amity"
},
"reviewBody": "I peeled my grown cucumbers before blitzing. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Two Foodies Who Travel"
},
"reviewBody": "I'm in love! I tasted it BEFORE I added Skinny Girl Cucumber Vodka and it was perfect. The vodka was a fun addition. I used lots of ice and topped off my drink with some sparkling water. This will happen again and I can't wait to share."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chef Boy R Drew"
},
"reviewBody": "It was good but I found it a little too bitter tasting. Had to add an extra half cup of water to mellow it out a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carissa alva"
},
"reviewBody": "It was way too sour and needed to be watered down quite a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ma4009893"
},
"reviewBody": "i loved it and i will definitely be making it agian"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Starkat"
},
"reviewBody": "Love this recipe over ice with vodka. It's already 95 degrees and humid in Texas. This was the perfect refresher. Made a couple of gallons for a party and had rave reviews but no leftovers! Use a juicer on the cucumbers to get about 2 cups of juice. Added 1 1/2 cups lemon juice from Meyer lemons. Make a simple syrup and add to taste. Dilute with water until just right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nanciemartin"
},
"reviewBody": "Very good and refreshing followed recipe exactly but added alot of ice to mixture to dilute and I just really liked the flavor I was thinking of maybe adding some mints leaves next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jeff"
},
"reviewBody": "A little difficult to strain with a coffee filter. It was refreshing, with a twist on lemonade, but before drinking too much you should also be aware that cucumber is also a natural laxative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "miriamco"
},
"reviewBody": "Delicious!! I had to add water because it was too sweet. But overall it was amazing, very refreshing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad"
},
"reviewBody": "I made this earlier and loved it! As a reviewer had mentioned about using Steevia that is what I had done. I didn't feel like the hassle of making the simple syrup. \nI used a blender for my drink and found out that there was no need to strain it. (Personal Preference). I added ice into the lemon juice/cucumber juice and blended it up.\nI will make this again, although next time I will peel the lemon and blend everything together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeriBerry"
},
"reviewBody": "Delicious with Pimms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MDCherryBlossom"
},
"reviewBody": "Wicked good! I made this two weeks ago for our Easter cookout/bbq and it was such a hit! I am trying to wean my family off of sodas and get us moving towards more water. I think lemonade is a nice compromise. I always have cucumbers and lemons on hand, so I was glad that I didn't have to buy anything. I made the simple syrup first and then put the cucumbers through my food processor. They were nice-sized cukes, so they yielded a good bit of juice. Pro-tip: I used the pulp in my smoothies, so nothing was wasted! You could also make dressings or use the pulp in burgers, meatloaf, stock, or soup. The only thing I may try next time I make this is blending the entire lemon including the rind. I've done that before with other specialty lemonades, so I'm interested in seeing if it works here. I combined all of the ingredients with water and didn't have to add any extra sugar! YAY! I added ice to the pitcher which helped those who were skeptical enjoy it more. My batch had a perfect blend of the cuke and lemon. Neither overpowered the other. This was so refreshing! It will be a summer staple in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Smith"
},
"reviewBody": "I make this almost everyday we all love it!!! Great Lemonade..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MoreCoffeePlease"
},
"reviewBody": "I have made this several times since finding the recipe and love it. I have added more water to get the flavor I wanted. I also mix a cup of water with the unpeeled cucumber in the blender to make the blending process easier. I don't mind a little cucumber pulp getting through a mesh strainer, but putting a coffee filter in my strainer creates a more refined drink. This also goes nicely with Grey Goose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frugal Grandma"
},
"reviewBody": "This is really good. Great way to consume those extra cucumbers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "woainie"
},
"reviewBody": "The recipe is great but I added more water and cut down the number of lemon. The recipe alone is quite sweet so I made some adjustments but overall it's a good recipe. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ad-lib Cook"
},
"reviewBody": "Hubby thought this recipe sounded odd and asked me only to make a small batch. Too bad...cuz all 4 of us really liked this and it was gone at one meal. Took other reviewers' advice and added lots more water. A great way to use up all those garden cukes!\nJuly 8, 2012 New season of cukes..made this again using limes/lemons/cuke and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Goddard"
},
"reviewBody": "I didn't have fresh lemons, so I used the bottled, Real Lemon. I found it to be rather tart, so I added a bit more water and sugar to taste. We all found it very refreshing and a nice change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Savage"
},
"reviewBody": "Here's how I make a full pitcher: 3 gallons of water; 2 cups of cucumber juice; 1 1/2 cups lemon juice. I have a juicer so it makes it a little easier to get the cucumber juice but I use bottled lemon juice. If you use sugar, it's 2 cups of sugar to make the syrup. I'm getting away from using sugar so I skip making the syrup, add the water, cucumber and lemon juice to a pitcher. I'm using Stevia to sweeten by the glass. For me, one packet works perfectly. My husband likes his a little sweeter so he uses 1 1/2 packets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wanderinggypsy"
},
"reviewBody": "my husband and i loved this.it was served at a dinner in the summer and we enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justynajd"
},
"reviewBody": "I made this for a bridal shower and it was a huge hit. A couple of women asked me for the recipe. Very refreshing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sarahjoy414"
},
"reviewBody": "This was really good! I am giving it four stars instead of 5 because it seems the measurements are way off. I made four servings of this recipe and had to add enough water to make a full quart of lemonade. I also used bottled lemon juice because that's what I had on hand, and it worked great. I didn't want to throw away the cucumber pulp so I used it to make a salad dressing my mixing it with plain yogurt, lemon juice, salt, pepper, garlic, and dill. It turned out pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Cakes"
},
"reviewBody": "Very refreshing and just the most perfect summer drink. I will make this again. YUMMO! Thanks Dash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MK!"
},
"reviewBody": "This was ok - I needed to water it down ALOT and it was still pretty sour. Not sure if I'll make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nica36"
},
"reviewBody": "Overall too strong... too sweet and too sour. Adding water didnt help. I threw it out. Also, really bummed that so much of the cucumber is wasted... an awful lot of pulp and nothing to do with it in this recipe... my daughter says she'll make bread with it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicole1980"
},
"reviewBody": "I made this for Mother's Day. It was good, however I ended up diluting the mix with 2 cups water to tame the sourness of the lemons and make more servings. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "eliminohpea"
},
"reviewBody": "The cucumber adds a curious taste, but there's not nearly enough sugar. I've added quite a bit and it's still not enough to counter the tart and bitterness of the lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingQueen"
},
"reviewBody": "Does anyone know if you leave the skin on before blending the cuc's? Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gts5098"
},
"reviewBody": "Yum! Tastes like a sweet tart"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookinRN"
},
"reviewBody": "I didn't have lemons on hand so used bottled lemon juice. I also misread the water &amp; ended up doubling the lemon juice &amp; sugar and used 2 quarts water. Wasn't too sweet and wasn't too cucumber either... pleasant. Nice alternative use for the abundant amount of cucumbers I have from the garden!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "Doubled the recipe and used bottled lemon juice. The initial taste was off to me so I added a liter of 7 Up? Or was it Sprite? I forgot which one but the result was quite tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thegarden"
},
"reviewBody": "It's a little bit of work to make but it's fabulous! It too was a bit too sweet so I added some water and no problem. Really good! (And just for the record if you don't have fresh lemons and use lemon juice in a bottle, 1 lemon = 1/4 cup, therefore 6 lemons = 1 1/2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brklynn225"
},
"reviewBody": "Sounds delish and I can't wait to make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyByrd"
},
"reviewBody": "This lemonade is delicious. It was a little strong and sweet for me, so I added water and ice to it, but very easy to adjust to taste. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ma"
},
"reviewBody": "great recipe very close to the one a local restaurant serves where i first experienced this most refreshing combination it does take a lot of cucs and lemons to make a gallon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spicy Chef"
},
"reviewBody": "I love this recipe its refreshing when very cold. Cucumbers all come in different sizes and thicknesses (heard this one before?), So I would use 6-8 inches of the middle of a nice ripe one. Id use an english cucumber only because i find it more subtle or fresh tasting. Use Big Juicy Lemons if you plan to splash in some Grey Goose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shantif"
},
"reviewBody": "As soon as I read this I ran into the kitchen and made it. I had 6 lemons that needed to be used ASAP and several cucumbers I had just picked from my garden. This is very refreshing and delicious. You must love cucumbers, however!!!! to like this it is very cucuberish tasting. My family really like it. I will make it again. All mine needed was a splash of water to dilute it a bit. Next time I will double the recipe, it is so good I need more."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/197751/refreshing-cucumber-lemonade/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/77/drinks/",
"name": "Drinks Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2817/drinks/lemonade/",
"name": "Lemonade Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/197751/refreshing-cucumber-lemonade/",
"name": "Refreshing Cucumber Lemonade"
}
}
]
}
}
, "about": [
]
}
]