				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Restaurant-Style Prime Rib Roast"
,"datePublished": "2019-04-02T02:48:57.000-04:00"
,"dateModified": "2022-07-13T00:17:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Barbara Conrad"
,"url": "https://www.allrecipes.com/cook/1965371"
}
]
,"description": "Learn how long to cook prime rib with this easy recipe for succulent and juicy rib roast, an impressive main dish for holidays and special occasions."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z4YeLYqLrl-EL7OGBBZzzb9Z8Rg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6177485-restaurant-style-prime-rib-roast-Emma-Crawford-1x1-1-a4b7b1a2d2b040b8abf4906b882bd223.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2270052430001",
"description": "See how to make the perfect special-occasion roast.",
"duration": "PT3M4S",
"name": "Restaurant-Style Prime Rib Roast",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/42318716-1f2b-45a1-b7a9-59c7650f9eb5/51fc338c-5bac-4342-a2e4-63b10e71ae6a/1280x720/match/image.jpg",
"uploadDate": "2021-03-06T11:49:22.294-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Restaurant-Style Prime Rib Roast"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "461"
}
,"cookTime": "PT270M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "870 kcal"
,"carbohydrateContent": "6 g"
,"cholesterolContent": "171 mg"
,"fiberContent": "0 g"
,"proteinContent": "44 g"
,"saturatedFatContent": "31 g"
,"sodiumContent": "458 mg"
,"sugarContent": "0 g"
,"fatContent": "73 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (14 pound) roast-ready prime rib roast (ribs cut off and tied to roast)",
"aluminum foil",
"0.75 cup all-purpose flour",
"2 teaspoons freshly ground black pepper",
"2 teaspoons salt",
"2 teaspoons paprika",
"1 teaspoon onion powder",
"0.5 teaspoon garlic powder",
"0.25 teaspoon celery seed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Remove rib roast from the refrigerator. Allow it to come to room temperature for about 3 hours, depending on its size."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C). Line a roasting pan with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Place rib roast onto the prepared roasting pan; blot with paper towels. Sift together flour, pepper, salt, paprika, onion powder, garlic powder, and celery seed into a bowl. Coat roast all over with flour mixture."
} ,{
"@type": "HowToStep"
,"text": "Roast in the preheated oven until cooked to your desired degree of doneness, about 4 1/2 hours (20 minutes a pound) for medium-rare. An instant-read thermometer inserted into the center should read at least 120 degrees F (49 degrees C) for medium-rare, 130 degrees F (54 degrees C) for medium, or 140 degrees F (60 degrees C) for well-done."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/z4YeLYqLrl-EL7OGBBZzzb9Z8Rg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6177485-restaurant-style-prime-rib-roast-Emma-Crawford-1x1-1-a4b7b1a2d2b040b8abf4906b882bd223.jpg"
}
]
,"text": "Cover roast with aluminum foil. Let rest on the counter in a warm spot for 30 minutes to 1 hour before slicing."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT490M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stone"
},
"reviewBody": "Used the recipe twice in the last month. Once for my lady’s birthday and for New Years dinner for my family. EVERYONE raved over it! Highly recommend this recipe that Barbara submitted. I’ve tried other recipes, never again! This is my go to!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Arnie Phillips"
},
"reviewBody": "425 degrees is too high. I had a 20lb roast @20 mins per lb = 400 minutes = 6.66 hours. I used a meat thermometer at 3 hours and it was already over cooked. Also, I cooked it at 375 degrees. Definitely not restaurant - style"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Horrible recipe. Way to high a temperature for a roast. I made it as written, used a 9 lb roast. Set the oven for 3 hours at 425. Took it out after 2hrs, 45 min. Roast was well done. Not good at all. Someone needs to go back and rethink this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Boolie125"
},
"reviewBody": "I found this recipe after literally purchasing a 14-pound prime rib for which it was originally written. Like many readers, my tried-and-true method for roasting prime rib is 'low and slow' but I'm always game for experimenting and this recipe grabbed my attention. I followed the recipe EXACTLY as it was written except I reduced the roasting time to 15 minutes per pound as several reviews mentioned - and which was still a bit generous for my 14-pound roast. Here's my evaluation: Pros: 1. This recipe definitely produced a moist and flavorful prime rib 2. The flour-based crust looked impressive and gave it a nice \"restaurant quality\" appearance 3. Faster than 'low and slow' if you're pressed for time Cons: 1. The roast \"snap, crackled and popped\" for several hours leaving my oven in need of a good cleaning. 2. In my experience, the flour coating did not \"lock in\" the juices although the roast was moist. I had at least 1.5 cups of sizzling drippings left in the roasting pan after my 14-pounder was done cooking and didn't need it for gravy as I had made a red wine orange sauce the day before. 3. My prized All Clad roasting pan was a mess coming out of the oven - the juices had splattered the sides, handles and leaked beneath the foil, leaving all but the exterior covered in a baked-on, sticky brown film. I thought it was a goner but was able to save it with an SOS pad, Barkeeper's Friend and 15 minutes of scrubbing. Not something you want to be doing as you're waiting for your guests to arrive. 4. The floured crust was flavorful and \"showy\" but is prone to crumbling off when slicing if you're going for anything less than thick \"restaurant style\" slabs of meat. I prefer an authentic seared crust that is meatier-tasting and that also allows for carving thinner slices. Overall: There are a number of good recipes for prime rib and THIS IS ONE OF THEM. However, I'm a bit fastidious about my kitchen equipment so this recipe takes a back seat to searing + 'low-and-slow' which also produces a delicious roast but with no mess. With that said, smaller roasts may not be as messy and the 425 degree oven should not deter you from giving this a whirl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "margaretryan002"
},
"reviewBody": "Awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greyday"
},
"reviewBody": "I have been making this roast to the exact directions for almost 10 years now and the only thing I do that is not listed in the directions is stick in a digital meat thermometer set to beep at 120 degrees. It is perfection every time. Whether it is a 5 lb. roast or 14 lb. roast, you go by the thermometer. Two roasts can be the same weight but one may take longer, or less time. Two ovens set at 425 degrees can be right on or way off. Use a thermometer. A $100 roast is too precious to leave to chance. Barbara thanks for giving my family the most enjoyable prime rib we have made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ben Ayres"
},
"reviewBody": "Tasted great, and I liked the crust, however, I read some of the other review, and adjusted the time and temp. I started at 425 for 30 minutes, then lowered the temperature to 350, and cooked (a whole prime rib: seven bones) for a total of 3 1/4 hours (plus 30 minutes tented rest period), and the centre still came out medium. Not a hint of rare or med rare on the roast. I think that 2 1/2 - 3 hours would have been more than enough time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stacey Kraft"
},
"reviewBody": "I cooked a very small 3-4 lb roast..\n It did turn out beautifully but I agree with someone who said 425 is way too hot. Either that or shorter cooking time is needed. I'll use this recipe again but will test the meat temp much sooner, at around 10-15 minutes per pound to be sure I get the more rare finished roast that we all like. Loved the simplicity of this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "Delicious! I followed the recipe cooking for 15 minutes per pound with the temp of 425 degrees. I moved my racks so it sat a little lower than halfway from the middle of the oven. No smoking from the drippings as some people reported."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Schick-Cormier"
},
"reviewBody": "Was delicious, but the temp must be turned down to 325 after 30 minutes otherwise it would be way overcooked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Nolte"
},
"reviewBody": "Here it is Christmas Eve. I put a 3.25 lb rib roast in a 375 degree oven for 45 minutes, then 20 more, now 20 more. It's still too rare. I followed the directions closely. I'll know next time to put it in longer. The sad part is that I only knew it was too rare after cutting it, so that blew the juices right out I'm sure. I like medium rare, but this isn't even close. Thankfully it's just my husband and me waiting for dinner to finish cooking. I must be doing something incorrectly. I hope it tastes good when it finally gets done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FLYINGSCOT4"
},
"reviewBody": "Excellent recipe for a relatively large rib roast, and it works as directed. I have no doubt that Barb spent a long time perfecting her technique. When I was young in the late '50's, I worked in a famous prime rib restaurant. This recipe is close. Our roasts were dredged In seasoned flour, seasoned again, rested in our meat cooler overnight, brought to room temperature, reseasoned,and roasted in what we called a \"medium hot\" (400 - 425F) oven. We roasted over 15 full (\"109\") seven rib roasts daily, often more. The differences in flavor between a high end Prime Rib restaurant are multiple. We used only what was called \"top choice\" beef, the equivalent of today's \"Prime\" grocery store beef. Our beef was dry aged by the purveyor for over 30 days and extra aged by us for another 30 days. Our roasts were all around 20 lbs after the shrinkage that occurs during aging. \n\nIt's always important to remember that it is difficult to duplicate restaurant quality in a home kitchen considering the differences between home and professional kitchens. What is most important is enjoying the tastes of home and professional kitchens. We can come close, though, as Barb has. Way to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "ccnc513"
},
"reviewBody": "Outside was tough due to the quick cooking at high temperatures.... lower the temperature and cook slower"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Theuer"
},
"reviewBody": "I have made this about 8 times now. Never once have I been disappointed. Excellent Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wandering1"
},
"reviewBody": "Perfect every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEOK"
},
"reviewBody": "AWSOME! Easy to make. It did get to Medium-rare much faster than anticipated. We just went with the flow. \nVery authentic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Omg is this good. Better than most restaurant prime rib!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve B"
},
"reviewBody": "Hello, First a huge thank you to the author for posting this recipe. . \n1. Temperature of 425 was 100% spot on perfect. \n2. Fifteen minutes per pound was spot on perfect. my 9.1 pound roast was at 120 internal at EXACTLY 2.25 hours. I know this because I USED A MEAT THERMOMETER. \n3. seasoning with flour was 100% spot on. all the juices were sealed inside the roast. make the full amount for a 14 lb roast and REALLY pack it into the roast all over. \n4. I used my turkey roasting pan with rack for this roast to suspend it over the pan. Due to the flour keeping all the goodness inside, there was almost no pan drippings. Some reviewers complained about smoking flour. Obviously the RAW DRY flour would burn. To stop that from happening just add 1 can of beef broth to the bottom of the pan. That one small can of beef broth combined with a small amount of rendered fat was enough to completely STOP any raw flour from burning. I cannot tell you how happy my guests were when i cut into that roast in front of 7 people at the dinner table last night. The ends were perfectly done medium well. As I sliced into this beauty the doneness became rarer and rarer until the center which was a perfect rare. I had cuts of meat to satisfy everyone's taste. \n(end cut for me please)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John P"
},
"reviewBody": "I’ve tried several recipes before, but this was so easy and turned out literally postcard perfect! Great flavoring even on a boneless prime rib roast. Everyone took seconds! Making French Dips with the little amount of leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Haines"
},
"reviewBody": "Fabulous flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingrid Johanson"
},
"reviewBody": "Ignore the poor reviews - I followed this recipe to the letter for an Easter dinner of prime rib. The 7.5 lb rib roast cooked for 2.5 hr at 425 degrees in my convection oven. I took it out when the interior temp was 115, tented it until it reached 125. \n\nAbsolutely delicious. Use a thermometer to take the roast out at the desired temp - 115 was great for a range from medium to medium rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don Ousley"
},
"reviewBody": "Best PrimeRib I ever cooked or eaten. I had to add 1 tips of each to the rub. It was great. I also put Carrots, Onions and celery, Garlic in my roasting pan. Aujus was fabulous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Sitzes"
},
"reviewBody": "I followed the recipe exactly, But I started the 5 1/2 pound roast at 450' for 20 mins then reduced the temp to 300' it cooked for 3 1/2 hrs, Then I let it sit covered in foil for 30 mins. it turned out cooked to Medium ( the needle of my thermometer seemed to be stuck at 500') a little more then I preferred. but my hubby said it was perfect ! There was no juice for gravy so I grated up a few garlic cloves, fried it up with about 2 tablespoons butter until it was fragrant then added concentrated beef broth, cooked this up for a few more mins then added 1 cup of cold water and in another cup of water I added cornstarch mixed well then as I stirred , I added it to the pan.and made gravy. it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anna Kitty Shipley"
},
"reviewBody": "I used this method but changed the flour mixture on a boneless 5.5 pound prime rib. The roast was moist and tender and the middle of it was still red and medium rare. My husband loved it just that way. I cooked my portion a little longer and it was just right. I will do this again, with some perfecting. I used 1/4 cup of regular flour, 1 1/4 teaspoon of Herbs de Provence herb mix, 1 1/2 teaspoon of sea salt and 1/2 teaspoon of ground black pepper. The roast cooked 90 minutes to reach medium rare on the meat thermometer. It rested under foil for about 45 minutes before we sliced it. Take care when inserting the meat thermometer. This cut is very marbled. One reading shot the temperature reading up to 140, so the thermometer may have been in a fatty area."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greg"
},
"reviewBody": "no changes made, great recipe made the horseradish sauce. yes will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryLee"
},
"reviewBody": "Came out perfect! Followed the directions! 17 minutes a pound @425 . Perfect med rare on ends and rare in the middle.I\nThank you!\nML"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "setasmith"
},
"reviewBody": "It was great, I had 14 lb Prime rib, followed directions exactly came out perfect!!! everyone loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Peterson-Redmond"
},
"reviewBody": "I followed your recipe exactly cooking it to a temperature of 120 degrees on a meat thermometer. I let it rest for 45 minutes before carving. Unfortunately the roast was more medium-well than medium-rare. I think the problem was cooking it at 425 for the entire time. Next year I think I’ll brown it at 425 or 450 for 30 minutes and then reduce the heat to 350 for a more gentle roasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "Delicious &amp; easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Patty Woodard"
},
"reviewBody": "I did exactly as instructed, checked the temperature on my meat at 4 hours in (still needing another hour and a half according to the 20 minutes per lb as advised) and you cannot imagine my despair as my roast is 159 degrees ... I just ruined a $100 piece of meat with 20 people coming for dinner ... there isn't a word to describe how upset I am. The coating and seasoning looked fine, adding the flour did add a nice crust, but if you use this recipe, do NOT leave it in the oven for as long as it claims and check the temp every 20-30 minutes because I don't want what happened to me to happen to anyone else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SeeCwriter"
},
"reviewBody": "I had a 5-lb boneless prime rib roast and followed the recipe exactly. It took 1-hr to reach 120F. The outside of the roast looked a pale white when I pulled it out. Not the dark brown crusted fat I normally get. And 120F is NOT medium-rare. It's RARE!. The thing is still walking around at that temperature. The flavor was on the bland side. I won't be using this recipe again. There is just nothing to commend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannine James"
},
"reviewBody": "I, too, was skeptical of keeping this at 425 degrees until the desired interior temp was reached (I've always done the 450-then-reduce-to-350 technique). My roast was much smaller, about 4 lbs. I used a temp probe and it took about an hour. I also coated it with the seasoned flour--excellent crust. I lined the pan with foil and didn't expect much juices, per other reviews. But there was some, and some fond. So after removing the roast, I added some water to the pan, heated, and gently loosened the fond with a wooden spoon, then discarded the foil. I added a little more water and saved it for gravy another day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan Campbell"
},
"reviewBody": "So good, very easy and less guesswork than the traditional high heat then low heat method, especially if your dealing with getting ready for alot of company. Flour coating seems to seal in the juices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRELLA72"
},
"reviewBody": "Absolute perfection!!! Cooked our prime rib roast exactly as recipe states. So tender and perfectly cooked! Thank you!! Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kathryn"
},
"reviewBody": "Ruined a $340 17lb prime rib roast! Cook time/temp is way off! We had a meat thermometer in, but trusted your directions and when we got back from Christmas Eve service, the roast was at 170 degrees! 425 digress at 20 minutes per pound is flat out bad advice. For years I’ve used the 500 degrees for XXX minutes then shut the heat off, wait 2 hours method. This year I tried something different and ruined dinner. We have a Thermador double oven and I keep a separate thermometer in there as well. I followed your instructions. So irritating!!! Thanks for the beef jerky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Noble"
},
"reviewBody": "Amazing!! First try at a prime rib roast, so easy and good! I followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amy To"
},
"reviewBody": "Delicious. I will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Colorado Scott"
},
"reviewBody": "did not like the flour added to the rub. Would cut it back or try a new recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandman"
},
"reviewBody": "This is the first prime rib roast I've done that turned out great! i followed the directions as stated, allowing for a smaller roast (3lbs) and man, it came out jist right. i never realized coating it would make such a difference. i wanted to take a picture, but everyone was so hungry we forgot lol. Next time (and there will be a next time!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karlene"
},
"reviewBody": "I’m very fussy about how my prime rib is prepared. This recipe is excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Orloff"
},
"reviewBody": "Just as good if not better ritzy restaurants!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelowna Joan"
},
"reviewBody": "I would cut down time to 15 min if using a small roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael St Bernard"
},
"reviewBody": "exceptionally well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Avina"
},
"reviewBody": "It was absolutely delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geniu Mecanic"
},
"reviewBody": "I followed the recipe exactly as written and it was one of the best rare to medium - rare prime ribs I've ever had. I read a lot of comments and people that leave it bad reviews are not using a thermometer, they are trying to cook by timing it. It is very simple, cook it until the internal temperature is about 5 degrees under what you want it to be and let it rest. If you use a thermometer it will turn out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phyl"
},
"reviewBody": "First of all, for those folks that have a 14 lb. rib roast, ya'll are in a different tax bracket than me. Ha!! Mine are 1/2 the size, so I half the recipe, and I am telling you, this recipe is OFF the chain. INCREDIBLE ! Delicious, moist, flavorful. I baked it a little longer, as I don't like mine too pink. PERFECT. This recipe is now my go-to for prime rib roast. Why mess with perfection?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherese G"
},
"reviewBody": "I've used this recipe for my last three Easter dinners and can't wait to use it again! The size has changed from year to year and sometimes the seasonings do as well but I've always followed the cooking instructions to a tee. My family loves this prime rib and I love making it for them. I'm sure there are others who have different opinions on how to 'properly' prepare a prime rib to which I say, 'Bravo! Post a recipe like this user did and I'm happy to try that one, too. Just maybe maybe not for Easter!'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAMPDOG"
},
"reviewBody": "Changed cook time to 10 minutes per pound and just turned off oven and let roast sit undisturbed for 2 hours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Made exactly as recipe described. It was absolutely delicious!!!! It was difficult for me to correctly estimate time as I only had 2.5 roast and new meat thermometer. Regardless, I ended up with medium and medium rare roast which is exactly what I wanted. There were enough drippings to make gravy but didn’t want anything this time. Will always do prime rib or any other “good” cut of roast this way. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenneth"
},
"reviewBody": "The crust was great! I made it just like the recipe. I would add a little spice the next time around but the method was spot on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maryann"
},
"reviewBody": "Easiest way to cook a rib roast. Turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Ralston"
},
"reviewBody": "Since I have made this for Christmas two years ago, I have been tapped to make it this year, and likely next. While I only did a 4-1/2 to 5 lb rib, it served perfectly BOTH times. Simple recipe with seasonings and everything (other than the rib) already on hand. I like my steaks and prime rib simple. Less is better to me. A work colleague was making prime rib for her husbands birthday for the first time this week, and I suggested this recipe. She made it and said it turned out perfect, although they did use their favorite mesquite seasoning mix . Now her husband wants it all the time. She even bought a thermometer. How cool is that? To which, I will try mesquite flavoring next, but this is definitely a favorite here and amongst visitors. And two years ago, it was my first time making prime rib also, at 52 (Gee, it's weird saying that). Thank you Barbara!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Doyle"
},
"reviewBody": "cooked at the temp listed but it cooked too fast. We like med rare but was more like med well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaybells"
},
"reviewBody": "I’ve been making prime ribs for years...usually in the smoker...but this recipe is the best I’ve ever made. I used my own seasoning combination and I was attempting med-rare...but I let it rest in foil for about 2 hours and it needed up well done. Made an au jus for it and it was delicious. This will be the go to recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "First time making prime rib, and this recipe had good flavor. Would make again. Took out of the oven at 125 or so and it was over cooked for medium well. Temp rises a lot while it rests. Next time, I’ll take out sooner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "latruk"
},
"reviewBody": "I made a butter and herb coating as suggested by chef John and cooked to medium rare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "debra baumhauer"
},
"reviewBody": "You ruined my dinner party! My prime rib was sooooooooo over done !! It was ineatable! You said to cook it 17 or 18 minutes per pound. I decided to cook it 16 minutes per pound and 10 minutes less than you recommended. It was still over cooked !!! Terrible!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbaum"
},
"reviewBody": "Great basic recipe, husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RH Chile Papa"
},
"reviewBody": "I got an excellent result from this recipe! When I am cooking a rib roast indoor from now on, instead of twisting one up on a spit over a wood/charcoal fire, like I prefer, I will definitely be re-using this method. My family members like beef cooked medium to medium well. And following the recipe fairly closely, that what we got. I went with about 20 minutes per pound at 425 degrees (convection mode on), for a 9 lb., 3 rib roast, after having let it sit at room temp for about 5 hours. (Probably stick with 15 min./lb. for med./med-rare.) I reduced the flour to 1/2 cup, which was more than enough to coat this size roast. However, I kept the original seasoning amounts the same as written and further added a heaping tablespoon of my favorite beef rub blend to the flour. For ease of carving when cooked, I cut the meat almost entirely off the bones and then tied the meat and ribs back together (before coating with flour). As stated in other reviews, pretty much only fat renders off of the meat, and it does smoke mightily, so I highly recommend lining the roasting pan with foil. Using an instant read thermometer, I pulled the roast at 140 degrees internal temp and let it rest on its serving platter lightly draped in foil for a half hour before cutting. The meat remained juicy inside and the rendered fat made a great roux for gravy. All were impressed with the result."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann Martello Walledom"
},
"reviewBody": "Did not change the recipe. It was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamela bodo"
},
"reviewBody": "turned out wonderful even though my oven seems to cook a little hotter than it should. More medium than medium rare but delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma Crawford"
},
"reviewBody": "I have made SEVERAL Rib Roasts this is the one that I really liked. It came out of the oven looking like it was coming out of the kitchen at my favorite place to go out to eat it. I took it out of the oven when the internal temp reached 120, I tented it and sat my thermometer to go off when the temp reached 140, it took about 30 minutes or so. I will never understand why people rate these recipes without trying them first. There is no other way to make one as far as I'm concerned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "john b 5423"
},
"reviewBody": "ive been making it for years. 18 to 20 lbs every time. as to the conflicting reviews : I cook 425 one hour then 325 for 1.5 to 2 hours. mine is rare. i set it on a rack in the pan. I hit 120 and remove it. If i missed it i leave it uncovered longer before i foil it. It is pink from end to end. but i pack it well with the mix. In years past less mix on the ends gave me a variety if wellness. i never noticed the smoke some experience because i cook it in my garage. NOT ALL STOVES COOK THE SAME this is not a Ron Popiel set it and forget it recipe ! YOU NEED A MEAT THERMOMETER! I agree with others if you havent tried it yet your two cents isnt needed. this works for me very well ! thank you -jb"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "recipemaven"
},
"reviewBody": "Over done roast! 17 lbs. I brought roast to room temp. Cooked at 425, 15 minute per lb which would have been 4 h and 23 mins. Meat is well, way over done. Very disappointed and I read the reviews to bring to room temp and cook for 15 mins per lb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lincoln Miller"
},
"reviewBody": "I wouldn't use this technique again with my standard oven. I confirmed that the oven was indeed 500 degrees when I popped in the prime rib. So after the initial 35 minutes baking, and then two hours sitting in the oven (never opening it at all), the oven was barely warm and the meat was only warm; the center was just 115 degrees. A bit too rare for us. Perhaps with a higher quality oven that is better insulated or something, this technique would work great, but now we're stuck with an underdone roast and a cold oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cc"
},
"reviewBody": "On his first bite, my son said \"Oh wow!\". Excellent roast. I only let it sit out of the fridge for an hour, so it took longer for the roast to cook - 2 hours for 5 lb roast. Took it out at 120 degrees. Let stand 45 minutes and it was exactly 140 when carved. If you want more pink, take it out before 120."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jeff Blair"
},
"reviewBody": "Followed recipe exactly and it came out completely overcooked. I was skeptical about the time suggested and even with cutting it 30 minutes short it was well well well done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Marie"
},
"reviewBody": "What a great recipe! I ended up with the perfect prime rib ever. I roast a prime rib every Christmas but I'm not usually satisfied with the final taste when slow roasted. This has fabulous flavor and was cooked perfectly. I made some very minor changes in the procedure. I had a 10lb roast and the night before I covered the whole roast with sea salt and left it uncovered in the fridge over night. I took it out of the fridge 2 hours before cooking in an attempt to bring it to room temp. I roasted it using the 15 min/lb method. It was cooked to 120 degrees Fahrenheit in just two hours. So watch your roast carefully after an hour and a half (though my oven may run hot, I don't know). \nMeet was moist and perfect. I highly recommend this method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "Just made this for Christmas dinner, followed recipe exactly, put it in a preheated oven at 425 and pulled it out an hour and a half later when meat thermometer hit 110, foil wrapped then wrapped with beach towels until company showed up an hour later, My roast was reading 128. This is the best prime rib roast I have ever made,my guest complemented how juicy it was, the flour crust did exactly what other people have said, it sealed the juices in . Whom ever said 425 was too hot, or it burnt the roast, they probably did not keep an eye on it. My compliments to whom ever posted this recipe. I will always use this recipe, Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nora Truscello"
},
"reviewBody": "The best prime rib. I was nervous keeping the temperature as high as suggested, but I did. I used a tent of aluminium foil to keep roast from being to dry. My roast was half the size of recipe, so I cut time in half. It turned out perfect!! This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna"
},
"reviewBody": "THANK YOU THANK YOU THANK YOU....not only to the lady who posted this recipe but to all of you who did reviews. I followed this recipe and never have I ever made a more perfect prime rib. My husband and guests could not stop complimenting me on how perfectly cooked and juicy it was. I had a 4.5 pound prime rib, and roasted it for 1 hour in a convection oven at 425. It was perfectly rare to medium rare which we love. The best part for me though, was pulling it out of the oven and hearing this amazing sizzling sound. It was absolutely amazing hearing all the juices sizzle in the prime rib and not one drop of juice was in the pan. Thank you everyone!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jason Coursey"
},
"reviewBody": "Never cooked a rib roast before. Followed the recipe to a tee, according to recipe, my roast should be medium rare at 120 degrees at 425 degrees for 4 hours and 7 minutes. I cooked for 4 hours and more like 195 degrees and charred. Whoever made this recipe must have been on crack. Avoid like the plague. If it wasn't for turkey, Thanksgiving would have been ruined...thanks a lot.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jason Eisbrenner"
},
"reviewBody": "Cooking time was way too long. Cooked it for only 2 hours and it was well done already. Quote disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hulia"
},
"reviewBody": "After searching so long for a good recipe. I came across this one and it was great. Made it for last years Christmas and it was delish. Making it again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ishenkir"
},
"reviewBody": "I did 15 minutes per pound and added double the garlic and salt. Turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenda Mailer"
},
"reviewBody": "I always read the reviews and I almost passed on this because of a few bad reviews ..and im so glad the good outweighed the bad because my prime rib turned out perfect ! Thank you for sharing your amazing recipe !! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "I made this for our family thanksgiving this year. My family loved it! Didn’t change anything, did recipe as is, and it was perfect. I will be making it again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ejd"
},
"reviewBody": "Rubbed with garlic first but otherwise followed directions for rare prime rib - big hit with all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cornfed"
},
"reviewBody": "I'm from a cattle ranch, so would like to think I know beef. This was excellent. The only thing I would change is to leave out the table salt. The other spices offer plenty of salt. It was tender, perfectly rare inside with a good crust outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SMOORE1313"
},
"reviewBody": "I have been cooking for over 40 years but Prime Rib intimidated me. Since it's my husband's favorite I decided to try it. So glad I found this recipe! I followed it exactly and it was a big hit with everyone. My husband was still raving about it the next morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TruffleCream"
},
"reviewBody": "My oven temperature is properly calibrated, so it held 425 degree temp. My roast was 15.75 lbs. I let it stand for 3 hours out of the fridge. I used exact ingredients for crust. It was on center rack in my oven. Roast should have taken 4.5 hours at 17 min./lb. II was skeptical about cooking at a high temp for the duration of cooking time. I wanted medium-rare. Checked it at 4 hours. The crust was burned and the meat temp was 160 degrees! I hurriedly removed from oven, and let it stand for 30 min. Entire roast was Well Done. If I use this recipe again, I will reduced temp. after initial cooking at 425 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KMAN"
},
"reviewBody": "I’ve made this several times generally around a 8-9 pounds and it comes out very good I’ve read several reviews and some old school HOME cooks still cook in the 70s for example: never cook above 350 or only cook at 200-225 this is old teaching. As a professional Chef in the restaurant we use high temps. We brine with herbs and seasoning first 24 hours then put a Dijon mustard and well seasoned floor over the roast. This insures a great roast extremely moist even when well done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debegraz"
},
"reviewBody": "All I can say it Wow! I used this recipe on a 7lb. Prime Rib. I followed the recipe exactly. There was about 1/2 cup of the seasoning mixture left over which I used to mix with the drippings later for gravy. Giving this the name, \"Restaurant Prime Rib\" is spot on, as it has that wonderful, flavor on this outside and a bit of a coating that is just delicious. The end cut was flavorful and done, and as I sliced through towards the center each piece became more towards the medium to rare. There was literally the perfect doneness for every person at my table. I received rave reviews on my dinner which I served with baked potatoes and cauliflower. I won't make it any other way again; Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wynnkin"
},
"reviewBody": "so easy. couldn't taste better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nancy"
},
"reviewBody": "Not sure what I did wrong but this expensive cut was not melt in your mouth tender at all. Followed recipe and used meat thermometer but tough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matthew Aboody"
},
"reviewBody": "Seasoning recipe spot on, but if you cooke it at 425 for 20 min a lb it will be medium to medium well. I cooked it for 30 min at 425 then turned to 300 for about 20 a lb. for mid-rare"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "5 lb boneless roast. Used proportionally less seasoning (1/4 c flour....and 2 Tbsp Tastefully Simple Ultimate Steak Seasoning). I set timer for 1hr 15min (15 min per pound). The timing was perfect, temp read 120 degrees! I covered it with foil and laid a towel over the top for the resting period. It was fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissyu"
},
"reviewBody": "Delicious! 15 minutes per pound is perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joanne"
},
"reviewBody": "Perfection! No adjustments needed. I am a cook and baker but have never tried prime rib. It is now a family favourite. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jojo"
},
"reviewBody": "It was very easy and turned out great. 1st time to make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ghanold"
},
"reviewBody": "I followed the recipe as instructed (425 degrees for 1hour and 25 minutes for a 4.8 lb. roast) and it produce the best prime rib I've ever made at home. Very juicy and had a nice crust. It rivals some very good prime rib I've had at some excellent restaurants...... Thank you for sharing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ghanold"
},
"reviewBody": "I followed the recipe as instructed (425 degrees for 1hour and 25 minutes for a 4.8 lb. roast) and it produce the best prime rib I've ever made at home. Very juicy and had a nice crust. It rivals some very good prime rib I've had at some excellent restaurants...... Thank you for sharing!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gary Cassady"
},
"reviewBody": "Not a fan of the flour in the rub. It clumped in the pan and burnt over the cooking time. Don't need it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Vogt"
},
"reviewBody": "WOW!!! This was my first time making prime rib. I followed this recipe exactly. I did a 6 lb. boneless roast. We all like our beef rare and medium rare. I did 15 minutes per lb. on 425 per the instructions. I did check my temperature at 1 hour and 15 minutes. It was at 113 degrees so I removed it and tented it well for 45 minutes and it was perfect. One of our guests was a former chef and she was impressed with how good it was. Thank you for this outstanding recipe. I will never use any other! ***NOTE*** READ all the instructions and the very 1st review which is from the author. 15 minutes per lb at 425. It is that simple and that easy. Ignore the original recipe time for cooking as it is marked wrong for the 425 temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mamafapp"
},
"reviewBody": "Prepared and cooked my 6lb boneless prime rib, just as the recipe says and it came out perfect! I cooked it for 1 1/2 hours(15 min per pound) Don't alter the temperature, 425 worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamamel"
},
"reviewBody": "I made a boneless prime rib roast that weighed 5.10 pounds, and I followed the directions exactly. It was my first prime rib ever, and it turned out very good. I roasted it for 20 minutes a pound, but in the last 30 minutes I started to check the temperature every 10 minutes (I was scared it would overcook). I took it out at 123 degrees, tented it for 20 minutes, and it went up to 143 degrees. My tips: I really rubbed in the flour mixture, so that there wasn't any loose flour lying on the roast to burn in the high heat. I did have some smoking at the end as the fat rendered off into the pan, but I expected it and had my vent fan on high. I also baked it on the rack between my center and lower racks, so that the roast was not too close to any of the heating elements. The outer crust was perfectly brown and the inner meat just to our liking (between medium rare and medium). There is obviously more than one way to make a good prime rib, but this one worked great for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bob K"
},
"reviewBody": "Followed the directions to a T with a 5.5 pound roast. Extremely disappointed. Roast was dry, not medium rare except in isolated areas and way too much “grey” around the edges. Won’t make this again using this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tbarb"
},
"reviewBody": "Perfect roast and I love the crispy edges"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chezgery"
},
"reviewBody": "Best recipe you'll ever use for prime rib! I've made it for 3-years for Christmas and have fantastic results and got OMG! raves. It's that good. Only I've learned to roast at 15-minutes per pound, works for me, and use an instant read thermometer for a perfect roast for the preferred doneness. And make sure you let the 'whole' roast come up to room temp. Very important for desired results."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/139890/restaurant-style-prime-rib-roast/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
"name": "Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/139890/restaurant-style-prime-rib-roast/",
"name": "Restaurant-Style Prime Rib Roast"
}
}
]
}
}
, "about": [
]
}
]