				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rhubarb Cherry Pie"
,"datePublished": "1998-04-22T12:19:46.000-04:00"
,"dateModified": "2022-08-08T11:41:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Annabelle Magee"
,"url": "https://www.allrecipes.com/cook/24321093"
}
]
,"description": "Fresh or frozen rhubarb is combined with cherry pie filling in this easy two-crust pie."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xnybWOXDE2WCrP3qTqq9cLFTzLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1027696-c0c19872533a4412bc40ba997180cdb6.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555516261001",
"description": "See how to make sweet cherry and rhubarb pie.",
"duration": "PT2M",
"name": "Rhubarb Cherry Pie",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/ab36abce-6d6e-44e6-a0fb-c749972e24bd/65d78b5f-4605-4ba0-a956-391e46e9bb50/1280x720/match/image.jpg",
"uploadDate": "2021-07-18T07:29:57.921-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rhubarb Cherry Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "78"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "287 kcal"
,"carbohydrateContent": "54 g"
,"fiberContent": "2 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "132 mg"
,"sugarContent": "21 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 cups chopped rhubarb",
"1 (21 ounce) can cherry pie filling",
"0.75 cup white sugar",
"2.5 teaspoons quick-cooking tapioca",
"1 recipe Pastry for double-crust pie (9 inches)",
"1 tablespoon white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine the rhubarb, cherry pie filling, sugar, and tapioca in a large bowl. Let stand for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour filling into unbaked pie shell, and cover with pie crust. Brush top with milk, and sprinkle on sugar."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xnybWOXDE2WCrP3qTqq9cLFTzLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1027696-c0c19872533a4412bc40ba997180cdb6.jpg"
}
]
,"text": "Bake at 400 degrees F (200 degrees C) for 40 to 45 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a fabulous pie though I probably ended up using more rhubarb then it asked for maybe double. I’ll probably always make this instead of using strawberries because it is so easy and I have found it fool proof. I also like the addition of the sugar top it just makes it special."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kmstendahl"
},
"reviewBody": "Better than strawberry rhubarb pie! Who knew? And that is saying a lot as grow our own strawberries and rhubarb on the farm. The perfect amount of tart and sweet. This is the second time I have made this recipe and no changes are needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb M"
},
"reviewBody": "The combination of cherry and rhubarb is very good, but I found this recipe too sweet. I still ate too much of it. The can of filling in my Canadian grocery stores was smaller than 20 oz so I increased the rhubarb. I will definitely make this again because it's super easy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie D Ostic"
},
"reviewBody": "Delicious! Easy! Used rhubarb from my garden, and because there were no fresh cherries and I don't like baking with frozen, instead I used strawberries and raspberries. Deep dish crust to hold all the fruit. Awesome. Also, used only 1c of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Suzie"
},
"reviewBody": "It was WAY too sweet. The cherry pie filling is already sweetened. No extra sugar is needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste"
},
"reviewBody": "Great recipe! I used 3 cups frozen rhubarb and 3 cups frozen sweet cherries. I did not have tapioca, so I used about 2 tbs flour. I know I made a lot of substitutions, but that is what I enjoy about using allrecipes.com I can get the basics and then add my own ideas. It turned out fantastic, just enough tartness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Akey Matthew"
},
"reviewBody": "Excellent favor, made with a strussel topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stormie"
},
"reviewBody": "I made the pie recipe as written. It was awesome. I don't like cooked strawberries, so this pie was perfect. I made 2 pies for our Family Reunion and anyone who ate the pie, wanted the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T. Wood"
},
"reviewBody": "This was the best cherry pie I have had. I used 3 C of frozen rhubarb and 1/2 cup sugar. Everything else was the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany N Eicher"
},
"reviewBody": "My family all loved this!! I was searching for a way to use cherries and rhubarb, this was JUST the thing I was hoping for. I did use flour instead of tapioca to thicken it as I do not have tapioca on hand. It set great. I think I used about 5 or 6 tablespoons."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wans"
},
"reviewBody": "i made this pie yesterday and am making another one today! It was delicious and raved by all who ate it! I used a bigger can of pie filling (30 oz) and 3 cups rhubarb, increased the tapioca to 4 tsp. The filling could have been more \"thick\" but the taste was amazing! Today I am making another one and I used 1/4 cup tapioca.... the filling was much thicker when I poured it in the crust. Am anxious to see how it turns out... perfect is my guess!!!!! Can't wait! No ice cream needed with this pie... it's taste is enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion Saucier"
},
"reviewBody": "This is a must have when the rhubarb is in season!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Matson"
},
"reviewBody": "This recipe is awesome. I put Streusel on the top instead of pie crust. With the purchase of our house we inherited a wealth of Rhubarb plants in the yard, think the previous owner liked to can. I just wanted to find something to do with all this Rhubarb, not generally my favorite, I wanted something to take away from the tartness. I used it in conjunction with the Cherry Pie Filling Recipe from this site. I used an extra cup of cherries and had too much filling but the extra will be heated on the stove for popovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRmaggy"
},
"reviewBody": "This was really yummy! Made it exactly as written. Wish I would have let it cool longer, but I never have the patience and so it was runny, but oh so worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebeccaJames"
},
"reviewBody": "This pie was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bshorse"
},
"reviewBody": "I have made this recipe numerous times. I won grand prize with it at a Rhubarb Rhevival contest. Also donated one to a medical fundraiser auction. It brought $375!! People in my area know my pies &amp; this one quickly became an all-time favorite. If your rhubarb is of the tarter variety, it won't be overwhelmed by the cherry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Wilson"
},
"reviewBody": "This recipe is a definite keeper! My boyfriend loves cherries and pie. We had some rhubarb lying around that I needed to use up. I made this recipe to the T and it came out perfect!! I could not imagine changing anything. Will be makin this one again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grampnana"
},
"reviewBody": "This was a great way to use our rhubarb. Being stingy with our rhubarb (having just brought some down south from Iowa and cleaning and cutting about 6 cups), I added a drained can of tart cherries to the cherry pie filling, which allowed me to still use only 2 cups of rhubarb. As did Betty Boop, used 8 tablespoons of flour in place of the tapioca, since we had none. Quite tasty and a change from our usual strawberry rhubarb or plain rhubarb pies. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Roy"
},
"reviewBody": "This is the best rhubarb cherry pie I have ever had. Although I made some changes. I added 3 cups rhubarb and a Gala apple diced small. I added the extra rhubarb from other suggestions. The reason I added the apple was due to the fact I used a 10 inch pie plate and there wasn't enough filling to fill the pie. It is on my list of keepers. Thank you for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anush"
},
"reviewBody": "Sooo good! Used 2.5 cups rhubarb and almost one cup of sugar, since my pie dish was deep and used the butter crust recipie from this site since didnt have shortening. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauraellenk"
},
"reviewBody": "I made this pie for Thanksgiving this year. I loved it, and so did my guests!!! I was lucky enough to have frozen some rhubarb this summer - homegrown rhubarb gave it the extra kick I like. This really was a wonderful pie, and I will definitely make it again. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Townsend"
},
"reviewBody": "Great! I came across this recipe when trying to find out what to do with ingredients I had in freezer and I'm trying to clean it out right now. How perfect for me!I used 4 cups pre pitted frozen cherries and about 1 1/2 cups frozen rhubarb. I personally don't care for any pie so I have not tried this, however the pie eaters I do have are loving it. I did let it sit in front of a window for about 4 hours with a cool breeze coming in over it before serving. I asked my pie eaters if they liked it better the first or second, they answered \"yes\". I could see that it definitely has set up more within a days time. Will make again. Editing my review I did try some of this pie because I couldn't believe how much they said they liked it but didn't seem to be eating it all that quickly. Very sweet and I can only bet it's because of our tree that gives the sweetest cherries. If using fresh cherries may want to taste them and adjust sugar accordingly. As a sidenoted it's been requested by the pie eaters to have this available for the weekend. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "btobey"
},
"reviewBody": "This pie was SO incredibly easy--just mix up the few ingredients--and it came out great! I really liked the cherries and rhubarb, a perfect combination of sweet and tart. I did add a bit more rhubarb as some other reviewers had suggested (about 3 cups total), and still, there was not a lot of filling, so I wouldn't recommend using a deep dish pie plate. I would also suggest serving this pie cold and/or letting it cool and serving the next day for the best texture. Overall, a wonderful, easy recipe--my husband said \"delicious!\" :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LK"
},
"reviewBody": "This was Delicious and will make it again and again! The only thing I would do next time is add more rhubarb...GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jolley900"
},
"reviewBody": "Could not have been easier to make and it turned out really good. I let mine sit for over 4 hours and the inside was still just a touch runny so i would say make this a day in advance and let it sit in the fridge overnight before cutting it. Will have to make another one as I have all the ingredients and my rhubarb plants are in full swing. Will try my make ahead suggestion and update my review with the results. UPDATE - changed from 4 to 5 stars. let sit overnight in fridge and it set up beautifully plus the flavors were even better he next day YUM. making another one this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Barrenger"
},
"reviewBody": "I have been making this pie for about 15 years. I always add about 1/4 to 1/2 tsp almond extract. Also, intead of tapioca I make a base of cornstarch and water thickener with a little rhubarb that is chopped fine. I seem to get a little more flavor this way by cooking it down first and then adding the rest of the rhubarb and canned cherries....yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nell"
},
"reviewBody": "Easy. Really yummy. Big hit with our family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen N"
},
"reviewBody": "Simple. Set up perfectly while baking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AndyW"
},
"reviewBody": "Slightly disappointed; this tasted more like cherry than rhubarb :/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aopiuofc"
},
"reviewBody": "The perfect blend of sweet and tart. I used frozen rhubarb from our garden and a \"lite\" cherry pie filling. Pair this with \"Ruth's Grandma's Pie Crust\" recipe on AR for a truely outstanding pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NORTHWESTMOM"
},
"reviewBody": "This was delicious. I hope we get enough rhubarb this year to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARWILSON"
},
"reviewBody": "Excellent, simple recipe! I found everything to be well proportioned, maybe a little sweet. Rhubarb gives the cherry a more complex flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie's Kitchen"
},
"reviewBody": "This pie has amazing flavor! I added about 1/4 tsp of cloves, it enhances the flavors wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Conrad"
},
"reviewBody": "A very tasty pie. I omit the tapioca"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joyce"
},
"reviewBody": "This is my all time favorite pie. I like almond extract with cherry so I added 1/4 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dena M"
},
"reviewBody": "This pie tasted wonderful! I had frozen rhubarb so I thawed it a bit in the microwave before adding it to the rest of the ingredients. I think the tapioca was a bit noticeable in it after cooking. Perhaps I will try letting it sit a bit longer next time. My family all loved this pie!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanna J"
},
"reviewBody": "Fantastic- super easy and delicious! Not usually a fan of cherry pie, but this was great. Everyone who ate it loved it as well. I have tons of rhubarb and didn't know what to do with it- now I'll be making this pie often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scurl"
},
"reviewBody": "i used a cherry pie filling i made myself rather than the canned stuff, but otherwise it was fantastic with no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Brunk"
},
"reviewBody": "I was hesitant because I'm not a fan of rhubarb. But it, along with cherry, are 2 of my Dad's favorites so I made it for him. It was really good! I used a deep dish so I increased the rhubarb to 3 cups and the sugar to 1 cup. Also, I used frozen since I couldn't find fresh and it worked fine. I also used light cherry pie filling. I think I could have used a bit more sugar, but it passed my Dad's taste test."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alexis"
},
"reviewBody": "it was the best pie i'v ever tasted!!!! i really recomend it to every one! easy to make to!great pie so make it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CocoBean"
},
"reviewBody": "I used frozen rhubarb and the pie was very yummy! Nice change from the traditional rhubarb/strawberry combination. This one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris W"
},
"reviewBody": "I caught my 7 year old cutting into this pie for breakfast! When I teased him about it - he said it was really his 2nd piece. As he puts it \"who knew rhubarb could be this good\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara Fischer"
},
"reviewBody": "My Dad simply could not get enough of this pie! So easy and so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOANNEH2"
},
"reviewBody": "excellent...wow I like it better then anything else with rhubarb,, have made several times and everybodys asking for a copy of the recipe... thank you for sharing it's made it beyond 5 and way above 10 in our book..... thanks for sharing...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLANGLEY"
},
"reviewBody": "Wow This is Awesome! The only thing I did differently was to add about another 1/2 cup of Rhubarb. I cant say enough. Thanks Annabelle for this treasured recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAK3G"
},
"reviewBody": "This was very easy and delicious. I used Pilsbury ready made pie crusts and baked in a deep dish pie pan adding a little more rhubarb and it worked well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JStOnge"
},
"reviewBody": "This is an amazing pie! If you like strawberry rhubarb pie, you will like cherry rhubarb, too. It was quick, easy and everyone loved it so much I had to make a second pie the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae"
},
"reviewBody": "Sold at a pie auction and was told it was the best pie they had ever eaten! Followed recipe exactly - no changes necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs Marilyn"
},
"reviewBody": "This pie is delicious and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAK"
},
"reviewBody": "Wonderful! Super quick. This pie was a nice change from Strawberry Rhubarb (I hate cooked strawberries). It was sweet and tart, very pretty. I cut out pie crust hearts and placed them over the top instead of a full crust. Very \"valentiney\". Make sure the pie is cool before you cut it and it doesn't run!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa H"
},
"reviewBody": "This was an okay pie. My grandmother used a similar recipe, instead of the instant tapioca, she used the regular small pearl tapioca. I will try that next time and maybe dark sweet cherry pie filling. This pie was a little too tart for me. Thank you though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STACY L."
},
"reviewBody": "I made this pie but did not get to taste it. I gave it to my Dad and he thought it was wonderful. I did not use a top crust, but instead used left over topping from the rhubarb strawberry crunch that I made the same day. He thought it was great and even asked to have more rhubarb in it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "When strawberries are not quite there but the rhubarb is abundant -try this !\r\nI altered the recipe by using 3 cups of rhubarb,\r\n1 T. tapioca, and 1 t. cornstarch .\r\nIf you like it sweeter, use a full cup of sugar.\r\nI also made a crumb crust -- cut 1/4 cup butter into 1/4 c. sugar mixed with 1/2 c. flour, and stir in 1 yolk.\r\nA very easy and great way to use up that can of Cherry Pie filling !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This pie was awesome!!! I made it in a 10 inch deep pie plate so I had to add another two cups of chopped rhubarb. Also, I didn't have tapioca in the house so I used flour 8 Tbsp. and it came out just fine. Everyone loved it, not too sweet nor too tart! This is definitely a KEEPER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flashsmith"
},
"reviewBody": "Everyone went WILD for this. Even the kids said Mom, you've got to freeze our rhubarb so we can have this pie in the winter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCOLE75"
},
"reviewBody": "I made this pie for a family gathering - everyone loved it! I will definately be making this pie again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DURUBY11"
},
"reviewBody": "I came across this recipe while looking for Strawberry Rhubarb and thought I'd try it. What a surprise. It was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Love it!!!Just use a lattice crust on top instaed of a whole crust. Delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pamjlee"
},
"reviewBody": "One of the best pies I have made! A nice mix of the sweet and sour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This pie was wonderful! I put a crumb crust on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good and easy to make. I like the contrast of the sweet and sour taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emi"
},
"reviewBody": "Excellent! A slice of heaven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good balance of tart and sweet, and easy to make - a bit runny though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aileen Arvo Maeltzer"
},
"reviewBody": "Deliciously tart! :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12128/rhubarb-cherry-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12953/desserts/pies/fruit-pies/rhubarb-pie/",
"name": "Rhubarb Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12128/rhubarb-cherry-pie/",
"name": "Rhubarb Cherry Pie"
}
}
]
}
}
, "about": [
]
}
]