				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rice Cooker Rice Pudding"
,"datePublished": "2020-06-18T23:50:53.000-04:00"
,"dateModified": "2023-02-12T06:04:12.000-05:00"
,"author": [
{"@type": "Person"
,"name": "ASTROPHE"
,"url": "https://www.allrecipes.com/cook/150704"
}
]
,"description": "Cook rice pudding in a rice cooker in under 30 minutes with four simple ingredients: milk, rice, sugar, and cinnamon, then chill and serve it cold."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7IjUy0bol7d9ajYjM9d56-0GRBg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/969229-rice-cooker-rice-pudding-Sugarplum-4x3-1-378e2396e8344dd18d63e5684f0cf613.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rice Cooker Rice Pudding"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.2",
"ratingCount": "46"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "310 kcal"
,"carbohydrateContent": "66 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "1 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "103 mg"
,"sugarContent": "37 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"8 cups skim milk, divided",
"2 cups short-grain white rice",
"1 cup white sugar",
"0.5 teaspoon ground cinnamon" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir 5 1/2 cups milk, rice, sugar, and cinnamon together in a rice cooker. Cover and cook for one cycle until tender and creamy, about 20 minutes. Stir in remaining 2 1/2 cups milk."
} ,{
"@type": "HowToStep"
,"text": "Transfer to a bowl and let cool to room temperature, about 30 minutes. Cover and refrigerate for 1 to 2 hours before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "Disaster. Cut recipe in half because I was concerned about the quantity of milk called for and it still boiled over and ruined my rice cooker. Sugar and milk everywhere. Mess!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoachWinzie"
},
"reviewBody": "I made this with a holiday feel! I used egg nog instead of milk!!! It was amazing! Had to add a little water and kept an eye on it bc the liquid kept trying to bubble out of my rice cooker! The kids LOVED it and my youngest, who is 9, said it was so good he could eat the whole pot, LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momolovelove"
},
"reviewBody": "I changed it up a bit...Came out delish . I used whole milk instead and I added 1 drop of vanilla extract and for the suga I did 2/3 white sugar and 1/3 light brown sugar. Then at the end i added 1 can of half can of sweetened condensed milk and I can of evaporated milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rachel T. Mann"
},
"reviewBody": "I love the thought of doing this in my rice cooker, but it boiled over, made a mess and after the 1 cycle rice was still a little crunchy. It took forever in the rice cooker, but the taste was good. Just wish it wasn't so messy. Maybe try this recipe on the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Val Med"
},
"reviewBody": "The recipe looks good. Cooked it and I had the same problem, the milk steamed out and with the sugar in it put a seal on the lid. \nI have a mess to clean up, and it didn't finish cooking the rice so I had to go another cycle and add more milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Gibson-Ellis"
},
"reviewBody": "Excellent, omitted the sugar and added raisins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "I cut the recipe in half and added a pinch of nutmeg. I also used almond milk because I can’t tolerate dairy. It was yummy! I’ll use more cinnamon next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kristen H"
},
"reviewBody": "It's boiled over in the cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dolly Sundstrom"
},
"reviewBody": "I read reviews and other recipes and tried to remake the recipe in a way that would avoid the problem of boiling over. \n I first cooked the rice in the rice cooker. Then I added 1/2 Cup of sugar, 1 t. of vanilla, and 1/2 C. raisins (1 Cup is super sweet--but the vanilla, cinnamon and raisins allow you to use much less). Then I added 3 Cups of half and half to the rice cooker with the hot rice in it. I stirred it well. \n I cooked it for 20 minutes, and then turned it on the 'Keep Warm' setting for another 20 minutes (or until it was thick.)\n It makes about 5 Cups with 1/2 Cup sugar total, which is fairly low in sugar for a dessert. This recipe also works with brown rice, is filling, and inexpensive to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Audrey La"
},
"reviewBody": "Boiled over and made a mess.\n(8 cup rice cooker.)\n\nFinished on \"congee\" for 10-15 minutes.\n\nIt's unclear if only cooking in \"congee\" mode would work since I lost a good amount of liquid both by the boil-over and by opening the lid. \n\nFurthermore, this recipe calls for over 7 cups of milk -What?- I skipped the last 2 cups.\n\nI added salt and a good splash of orange blossom water and extra cinnamon.\n(I probably lost some with the liquid)\n\nThe end result was good pudding and a sticky kitchen.\n\nIf I redo it. I would probably start with 2 cups of rice/ 3 cups of milk on regular white rice mode. And add milk at the end if needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KarenJean"
},
"reviewBody": "I like the simplicity and my family likes the texture and taste. My rice cooker will spill out the liquids a bit so I put it on a cookie sheet when I do the recipe. I probably need a larger size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Quiton"
},
"reviewBody": "My rice cooker is much smaller than what the original recipe calls for, so I halved the recipe. Also, I used 2% milk, because that is what I had on hand. \n\nThe milk boiled over and ran all over my table, however I don't know if there a away to prevent this, especially in the design of my rice cooker. Even with the boil over mishap, it turned out tasting fine, even my picky eaters liked it.\n\nI am giving it three stars because the milk over flowed, even when I accounted for space in my cooker, and for the fact that this turned out to be more of a sweet rice than a pudding. If it had been more creamy I would give it a higher rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "David Oviatt"
},
"reviewBody": "Tasted good.... wife liked that it required me to clean the stove after it blew up the first time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bethany Nickless Meyer"
},
"reviewBody": "Curious about this recipe, which some folks have had success with. I saw that some people had theirs boil over, so I put a wide, shallow bowl under my rice cooker, just in case. \n\nI used 2 3/4 cup of milk, 1 cup of rice, and 1/2 cup of sugar. My rice cooker was well below capacity. I routinely use 2 cups of rice and use water up to the max fill line. \n\nIt still boiled over. Milk came out into the bowl. I let it keep cooking, figuring I'd add the excess milk in at the end. I stirred it and it was undercooked, and brown on the bottom. When I added the boiled over milk back in it was soupy. \n\nNo one wants soupy, undercooked, yet still scorched rice pudding! I probably could have salvaged it, but I didn't bother. \n\nDoes milk boil over more easily than water? Because the proportions were fine and my pot was not overfilled. \n\nI would like to know how folks have made this recipe work for them. I don't know the exact capacity of my rice cooker, but I'd say it's medium-sized. It can certainly handle one cup of rice! \n\nI'm a fairly experienced cook and open to suggestions. I have an old family recipe for rice pudding that I can use. I'm just sick of doing it that way, ha! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanette Anderson"
},
"reviewBody": "Turned out great I halved the recipe because I have a 4 cup rice cooker, I did add 1/2 stick butter, after 20 minutes I added the rest of the milk along with vanilla and dried cherries(thought I was putting in craisins) still turned out great and no boil overs (I did put the rice cooker on top of a glass plate just in case.........YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DoNotCook"
},
"reviewBody": "I made this recipe against all of the reviews that stated their rice cooker overflowed. I thought they must have had a little rice cooker, so I went ahead to cook in my XL Aroma rice cooker. I even halfed the recipe, but had the same result.\n\nAfter I cleaned the mess, and cooled the \"rice pudding\", I tried some. It was not horrible, but nowhere near as tasty as my usual recipe that I make on the stove top.\n\nIt did not turn out to be a rice pudding for me, more like a rice &amp; milk snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shadd4521"
},
"reviewBody": "I used 2% milk, and instead of making it for 8 servings, I made it for 6. I found there wasn't enough cinnamon in it, so I threw in an extra sprinkling and added some nutmeg (equal to the cinnamon) for some extra flavour. \n\nI also threw a small amount of butter in to keep the rice from sticking as well as a pinch of salt and some vanilla extract. No issues with boiling over, but I did check on it about 10 minutes in to stir it, then again 5 minutes later. \n\nFlavour-wise, I think it would have been a bit bland if not for the extra cinnamon and nutmeg, but I definitely found it needed a bit more sugar for my tastes. Otherwise, this was a nice base recipe to work from!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Denise Kasz Willmarth"
},
"reviewBody": "What a mess!!! The rice did not cook as well as I would have liked. The milk boiled over and spewed everywhere. Make it in a pot instead!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cmf1016"
},
"reviewBody": "I made it in my zojirushi rice cooker, which has a porridge setting. The amount of liquid to use is indicated in the cooker. No problem with it boiling over. I used almond milk, perhaps that helped.\nWhen the porridge cycle was done, the rice cooker was very full and the rice was cooked, but didn't have enough liquid, so I moved the pudding to a pot and added more almond milk for the final step. I also added vanilla and slivered almonds. Served with home-made strawberry sauce to rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "forhealth"
},
"reviewBody": "I also added vanilla and dried cranberries (Crazins--if that's how you spell it). A little extra flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MAND"
},
"reviewBody": "Listen to other reviews that says it boils over. I only put in 4 of the first 5 1/2 cups milk in, I was cooking it in 10 minute increments, keeping my eye on it while making a cheesecake. I turned my head and it overflowed up through the steam holes, down side of rice cooker inside &amp; out, all over the burner plare &amp; under where I cannot clean. There wasn't a spot on my cooker not covered in a sticky mess. I was so sad. I cleaned as best I could before I tried to save it. Added 2 more cups of milk-one at a time 10 minutes apart. Didn't use more than 6 cups milk, hard to say how much overflowed &amp; I lost. Just kept cooking &amp; stirring every 10 minutes until rice was cooked. It was bland, so I added 1 tsp fresh ground nutmeg &amp; 2 Tbs bourbon, it still turned out really good. The recipe probably should be halved, I have a large newer rice cooker with scalded milk under the hotplate which I cannot get to in order to clean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "Cut the recipe down and it still overflowed. What a waste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "icequest"
},
"reviewBody": "I've made this recipe 4 times now; the first two times I followed the directions and used short grain and sweet rice respectively. I did have significant boil over with both attempts. However, when I reduced the milk amount to 2cups for the other two attempts, no boil over occurred; also, I only added 1.5cups of milk afterwards and this gave me the consistency I had desired. Thank you for sharing this rice cooker recipe ^_^"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Catherine Watts"
},
"reviewBody": "I was only cooking for myself so I quartered the recipe. It boiled over and made a huge mess, and the rice is not completely cooked. It was horrible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heba Mahmoud Elsabaa"
},
"reviewBody": "i increased the amount of the milk a little, and it was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SValis"
},
"reviewBody": "Very simple easy recipe. I used Mexican raw sugar. I might add a pinch more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "beckala"
},
"reviewBody": "Will have to try again, because I think it'll be better with only 1 cup of rice. I used the Japanese style short grain rice used for sushi and Chinese porridge (starchy) - Nishiki. I read the other reviews about the cooker boiling over, so I set my mini (single dorm-style) cooker in a lasagna pan to catch the overflow. I also covered the top with paper towel to prevent the splattering. I added the last 2 cups of milk towards the end, when it was getting scorched on the bottom, but the consistency wasn't creamy enough for me. Taste was fine, especially with the vanilla, but it was too dry otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Colleen Brown Bellows"
},
"reviewBody": "I halved the recipe and it still boiled over. Also, the rice could have cooked longer. This might be good using a different brand rice cooker. Mine is a black and Decker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clayton Giovanni M."
},
"reviewBody": "I'm using a rice STEAMER, I halved the recipe (4 servings) and had to run the machine through 2 cycles. I will add vanilla and SUGGEST salt. I used short grain rice due to my inventory. All came out great! BUT before you add the second round of milk, add in your cinnamon at that time. If not serving it immediately, but making some for later at home. Be ready to just add in more milk!! I'm fine with it..and love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kane"
},
"reviewBody": "o.k. so my rice cooker couldn't handle this one. After 20 min the rice was still completely raw and then when I checked again 15 min later, milk had overflowed all over my counter. And the rice was still hard. So I stirred it and added more milk, let it cook a bit more. the cooker went off, then i added more milk, let it sit with warm, still hard rice, then added 1/2 cup water and set it back to cook - I was pretty determine - and it popped again, rice still had a firm center - not really al dente yet. so I'm typing this while my 4 year old and I was to see if the rice will soften. the taste is good, its already a bit burned, but not really burned so that it tastes bad. I also added a couple teaspoons of orange blossom water to add flavor - that's what I normally do on the stove top. I would recommend to anyone out there to cook the rice in water first in the cooker and then add the milk, I think that would work much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JJG"
},
"reviewBody": "It will boil over, unless one uses a 24 to 36 cups rice cooker. Milk tends to boil over when heated"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ljf"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lemondragon"
},
"reviewBody": "I did not care for this recipe. Disappointing! \nAnd it boiled over and made a sticky mess all over the kitchen counter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christina Ahern"
},
"reviewBody": "Boiled over 3 times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Martha Galan"
},
"reviewBody": "I cut back the recipe to a serving for three and the milk boiled out of my rice cooker. I have a small rice cooker but thought it would work. So after an hour my rice still isn't cooked. Make this with pre cooked rice instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kamren Harris"
},
"reviewBody": "This seemed to be a easy way to make a great rice pudding in a rice cooker. It didn't turn out so great for me. The milk boiled over and out of my rice cooker. It was quite a mess to clean up. I didn't think I would have the boiling over issues that others reported due to my large cooker. The final product was far from what I had expected. The flavor was good, however the texture/consistency was not what I would associate with pudding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sugarplum"
},
"reviewBody": "I liked the taste of the end result of this but had issues with the preparation. I cut the recipe in half and it still spilled over after about 20 minutes. I had to take the lid off my rice cooker to keep if from spilling over. It took close to an hour to thicken up and finish cooking. I didn't need to add any extra milk at the end. The husband really loved it and that is saying a lot because he normally hates rice pudding! I am giving it 4 stars because it really did taste good but next time I will not attempt to cook it in a rice cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holiday Baker"
},
"reviewBody": "I thought this tasted pretty good. Although, my rice cooker is a smaller one and so I halved the recipe. I also added 1/2 tsp. of vanilla and about 1/4 cup of raisins. Half way through I stirred it and when I came back to the kitchen it has sputtered milk onto the counter. I am going to assume that was because I didn't put the lid on just right. It was quick and easy to make and not overly sweet. I just added a little milk to my bowl and didn't measure it. It is good plain too. I still though prefer the creamier stove top rice pudding that has eggs also added. However, this was still a fine treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thomas_k"
},
"reviewBody": "Turned out great using whole milk and the automatic setting on my Aroma rice cooker. Cooking time was closer to one hour on automatic. I considered not adding the additional milk at the end but was glad I did as the rice soaked up the milk for a more creamy result. Also added a teaspoon of vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lee Schauer"
},
"reviewBody": "Perhaps I have a different kind of rice cooker than others who reviewed this (though I really don't think I do...), but it simply did not cook the rice completely. Truly disappointed as it would have been so easy to make rice pudding had it worked. I even gave it a second shot and set the cooker at a longer setting, to no avail. Look for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrashley"
},
"reviewBody": "I had just tossed some rice in the cooker to make rice pudding when I came across this recipe. I ran back to the kitchen and tossed in the remainder of the ingredients. When I started my rice I had put in 1 can of coconut milk for the liquid,which is about 2 cups. I put in 2 cups of milk and the sugar and spice. It turned out really, really great. I couldn't be happier. I love recipes that are quick, easy and have great results. This is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer"
},
"reviewBody": "This is THE perfect recipe for a rice pudding using a rice cooker!!! Simple and super delicious! I don't like rice pudding too mushy, so I cut the 2nd addition of milk way down... I now plan to make this dessert for my family's Christmas gathering! Tks for this awesome recipe!!!!- it's a keeper in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueF"
},
"reviewBody": "Simple &amp; delicious! I was craving rice pudding this morning and wanted to use my rice cooker, so when I came across this simple recipe I had to give it a try. I used the recipe for 4 servings and when I added the remaining milk after the cook cycle was complete, I also stirred in 1/2 tsp of vanilla and 2 chopped Jumbo Medjool Dates. I am enjoying a small warm bowl of it now and it is fantastic! I plan on chilling the remainder, and I can't wait to try it cold."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228474/rice-cooker-rice-pudding/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
"name": "Custards and Puddings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14442/desserts/custards-and-puddings/rice-pudding/",
"name": "Rice"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228474/rice-cooker-rice-pudding/",
"name": "Rice Cooker Rice Pudding"
}
}
]
}
}
, "about": [
]
}
]