				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rich Dark Fruitcake"
,"datePublished": "1998-04-21T13:37:54.000-04:00"
,"dateModified": "2022-08-22T14:30:16.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Carol"
,"url": "https://www.allrecipes.com/cook/Carol"
}
]
,"description": "This is my mother&#39;s very old recipe, at least 60 years old. My mother baked this for my wedding, and it sure is delicious and also a great Christmas cake. This is a very long recipe, but well worth the trouble. You can substitute a cup of drained maraschino cherries for the candied cherries, if you like."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/HdGZz4nST9Imi5ytxpLX1_bt8cw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2793034-163d6055ee464cb6982b37b0cff00a04.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rich Dark Fruitcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "35"
}
,"cookTime": "PT270M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "451 kcal"
,"carbohydrateContent": "80 g"
,"cholesterolContent": "86 mg"
,"fiberContent": "4 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "177 mg"
,"sugarContent": "40 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"6 cups golden raisins",
"3 cups dried currants",
"1.5 cups pitted dates",
"6 cups raisins",
"1 pound candied mixed citrus peel",
"0.5 pound candied cherries",
"2 cups almonds",
"2 cups butter",
"3.25 cups all-purpose flour",
"3 teaspoons baking powder",
"0.5 teaspoon baking soda",
"0.5 teaspoon salt",
"2 teaspoons ground allspice",
"4 teaspoons ground cinnamon",
"1 teaspoon ground nutmeg",
"0.5 teaspoon ground cloves",
"1 tablespoon vanilla extract",
"1 tablespoon almond extract",
"2 cups white sugar",
"12 egg yolks",
"0.5 cup molasses",
"12 egg whites",
"0.5 cup grape juice",
"0.5 cup strong brewed coffee" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Wash and dry the raisins and the currants. Wash, dry, pit, and chop the dates. Chop the raisins and the citrus peel. Slice the cherries. Blanch the almonds, and slice them lengthwise. Combine fruits and nuts in large bowl."
} ,{
"@type": "HowToStep"
,"text": "Grease and line 3 standard Christmas cake pans (these round pans are at least 3 inches deep and come in a set of three sizes- 5, 7, and 9 inch across) with 4 layers of heavy waxed paper, or 3 layers of brown paper. Grease again. Preheat oven to 275 degrees F (135 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Sift together flour, baking powder, soda, salt, and spices onto a piece of waxed paper. Remove 1 cup of this flour mixture, and combine with fruit and nuts. Mix until fruit is well coated."
} ,{
"@type": "HowToStep"
,"text": "Cream the butter until fluffy. Add extracts. Gradually add sugar, mixing until creamy. Beat egg yolks until light and lemon-colored, and beat into the butter mixture. Stir in the molasses, and beat together well. Add half of the remaining flour mixture, and blend thoroughly."
} ,{
"@type": "HowToStep"
,"text": "Beat egg whites until stiff but not dry; fold into batter. Stir in lightly the remaining flour mixture alternately with grape juice and coffee. Add floured fruit and nuts, blending in until fruit is well distributed."
} ,{
"@type": "HowToStep"
,"text": "Turn batter into prepared cake tins, filling each about 2/3 full and spreading batter evenly. Bake in center of oven. Bake small cake 2 1/2 hours, medium cake 3 1/2 hours, and large cake 4 to 4 1/2 hours. Remove from oven and allow to stand 5 minutes, then turn out on wire rack to cool."
} ]
,"recipeYield": ["40"]
,"totalTime": "PT360M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonivia Hanna"
},
"reviewBody": "I make this every year with a few variations, half of the raisins and currents, brown instead of white sugar and i use a can of crushed pineapple. This recipe tastes closest to my grandmothers so getting the taste and the quantities right is great. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heather umlah"
},
"reviewBody": "To add to my comment, the last couple of years I halved the recipe, since the family is now scattered. Still makes enough to give 2 small ones as gifts and keep a good sized one for me. I triple line and bake them right in Christmas tins from the dollar store. Once they cool I remove the paper and put them back in the tin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose G"
},
"reviewBody": "I've made this recipe for a few years after having tried multiple other recipes. Everyone loves this fruitcake. Even if they don't like fruitcake. I get requests for this every year. This year, I wasn't able to find the recipe. I made a different recipe and didn't like it as well and knew my peeps would not either. I resolved that if I could not find this recipe, I was not going to make fruitcake this year. Thank goodness I found it! Now, I'm back in business. I wrap each loaf in cheesecloth soaked in about 1/4 cup of rum and \"feed\" it occasionally. Yum. Thank you for posting!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanna Hemenway"
},
"reviewBody": "The absolute best fruitcake I ever tasted"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kari Wilson"
},
"reviewBody": "This was a good recipe. I added a cup of walnuts to the recipe and found it had better texture for my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I am not a huge fruit cake fan, but this cake was just phenomenol it was light ans tasty and my family absolutely loved it. I will definitely make it again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It is the same recipe I have made for years, it is delicious, I just made 13 of them last week as I give them to my family for Christmas!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ednabaker"
},
"reviewBody": "It is the same recipe I have made for years, it is delicious, I just made 13 of them last week as I give them to my family for Christmas!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "itza"
},
"reviewBody": "I didn't make any changes. The cake is very rich and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianeB"
},
"reviewBody": "My husband thinks this is the best fruitcake he's ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Primeau-Jones"
},
"reviewBody": "I found this recipe 16 years ago on line, and made it for my 3 tier wedding cake! fabulous! I make it every year for Christmas and everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois"
},
"reviewBody": "This cake is a lot of work but it is worth it. I cooked it using several loaf pans. It took under 2 hours to bake. I followed the rceipe except I did soak the raisins in 1 1/2 cups of dark rum overnight. Then later I added a 1/2cup rum instead of coffee. My husband said this receipe was better than his mother's! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo"
},
"reviewBody": "Next time, less raisins, more candied peel, otherwise PERFECTION!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BooBoo"
},
"reviewBody": "This is the best Xmas cake recipes I have ever used."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lux"
},
"reviewBody": "I made this cake for Christmas... I used Dark Rum instead of fruit juice and made the coffee really strong (used instant coffee). I used maraschino cherries, dried apricots and added walnuts and pecans. It is absolutely delicious. Everyone is enjoying it already. I also used Blackstrap Molasses and a cup of brown sugar instead of 2 cups of white sugar. Excellent... Highly Recommend to Everyone!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meika Ungricht"
},
"reviewBody": "I always use this recipe because the proportions work well for a lot of cakes. I modify it a little bit, using as much fruit and nuts as will fill a kitchen-aid mixer bowl, and I like to add chocolate chips. And I sometimes use coffee and orange juice or just orange juice, instead of grape juice and coffee. I usually pour it out into 10 mini loaf pans, and usually have enough batter left over for one large loaf pan as well. And I soak them in some combination of whiskey, rum, citrus brandy, and Frangelico."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georgie"
},
"reviewBody": "used this recipe for my wedding cake the only thing different I did was soak the dried fruit in sherry and brandy for two weeks the guests went home wanting more so thankyou super dobor cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dwight"
},
"reviewBody": "This is a good fruitcake, but it's nothing like I expected. My grandmother made a DARK fruitcake. This one is not very dark at all. I searched my dad's house for her recipe and found a really old cookbook that had a similar recipe to this one. The difference is it calls for 4oz. of dark unsweetened chocolate squares. When I told my dad he remembered her putting bakers chocolate in her cake. Her cake never lasted until new years. The book also used Mace in the spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nellstrum"
},
"reviewBody": "This is just like my Mom's, sometimes she would change the fruit. Mom would say just add the dried fruit you like. It was always delicious. My family likes to serve it with cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mueni"
},
"reviewBody": "I made this two years ago, it was fabulous! I lost the recipe and have been looking for it ever since. So glad I found it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "American"
},
"reviewBody": "PERFECT!! Soo goood!! A MUST try! I made as stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "devon"
},
"reviewBody": "this is an awsome recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I made this fruitcake for Christmas last year because my family and I love dark, spicy fruitcakes but noticed too late (after using about $15 worth of ingredients - since I doubled the recipe to make some little ones as gifts) that the amount of cloves it calls for is excessive, at least double what would be adequate. Also, as others discovered, it required at least an hour more baking time than the recipe states, so I put a pan of water on the lower oven rack to keep it from drying out. The texture was fine but the heaping helping of cloves gave it a strong medicinal taste that overpowered the other flavors. My mom likes spicy fruitcakes, too, but she also noticed this. I'm only using two teaspoons of cloves this year instead of the two tablespoons called for and am sure it will come out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beverley powers"
},
"reviewBody": "this is great moist and rich I iced it using almond flavour I would give more stars if possible"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wes Boyd"
},
"reviewBody": "OMG!!! This will win over a fruitcake hater!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SkyCook"
},
"reviewBody": "Had a hankering to taste the flavor I remembered from my childhood in the late '50s from an Irish aunt who made fruitcakes and you hit it right on the button.\nThanks ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharonl1"
},
"reviewBody": "I made this recipe for Christmas; I gave one of the cakes to my mom, she and my father love it. She gave some to her friends and they all say the cake reminds them of their mother's fruitcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "daisyk"
},
"reviewBody": "My parents have a hallmark fruitcake made in Texas, the memory of which I was working against in making this recipe at my father's request. Given that there are only three of us sharing Christmas, I halved the recipe and took some liberties because of what we had in the kitchen, as well as trying to match the Empress Fruitcake of Yore. I added dried apricots and some withered blueberries, because of what we had on hand, and omitted the sultanas and currents, going heavier on dates. I also substituted pecans for almonds. My father also wanted the taste of burbon so I soaked the raisins in burbon for a few days, drained them well and used the burbon-raisin juice instead of coffee and grape juice.\n\nI suggest that you read the recipe carefully for the myriad of steps -- beaten egg whites, beaten egg yolks and the flour mixtures all in separate bowls that converge quite quickly. It makes for a BIG project and heavy clean up.\n\nThe recipe also calls for three differently sized \"Christmas cake\" pans, the like of which I've never seen and do not see the reason for -- it's not a stacked cake, after all. I used loaf pans and baked the minimum 2 1/2 hours. I used two layers of greased brown paper but only on the bottom of the pans; after running a sharp knife around the greased edges, the cakes dropped out easily.\n\nThe next time I make this (and I think I will -- it did, essentially, match that acme of fruitcakes from my childhood) -- I won't chop the fruit and nuts as small as I"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meebe"
},
"reviewBody": "This fruitcake is delicious but costs a fortune to make - definitely a once a year item!\n\nI soaked dried cranberries in rum (instead of currants) and used half white sugar and half brown sugar - other than that followed recipe.\n\nI made a couple of cupcake size ones to taste and the big one is wrapped and in the freezer for the holidays.\n\nThe cupcakes tasted superb......."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I 1/3 the recipe and baked the cake for 2 and a half hours.The cake is moist and has a nice flavour. I didn't like dates so i replaced them with cashewnuts instead. I didn't change anything else. Good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CyBrazil"
},
"reviewBody": "This is the best fruitcake - ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "U3616234"
},
"reviewBody": "best fruit cake !!\n\nI cooked this fruitcake for my sister who is the fruitcake-mania. it will be great taste after ageing 1week. \n\nI marrinade dried fruit with bourbon for 3 days and simmer it for 20 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PHEATHERQYLL"
},
"reviewBody": "Having lost my mother's recipe years ago, I was thrilled to find this one so close in content. With a few changes, I'm back in business. Thank you so much"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7401/rich-dark-fruitcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1530/desserts/cakes/wedding-cakes/",
"name": "Wedding Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7401/rich-dark-fruitcake/",
"name": "Rich Dark Fruitcake"
}
}
]
}
}
, "about": [
]
}
]