				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rita&#39;s Eggs Strata"
,"datePublished": "2020-03-04T23:58:16.000-05:00"
,"dateModified": "2020-03-04T23:58:16.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Kandi Byrd"
,"url": "https://www.allrecipes.com/cook/781601"
}
]
,"description": "Cheddar and Monterey Jack cheeses are layered between slices of buttered bread and baked in a savory custard in this make-ahead breakfast casserole."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UDk7XCG1xYmWJFBtke8EoxP9AO8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/69623-cbd36365d7a34f00ae0230404fb36fe3.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rita&#39;s Eggs Strata"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "62"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "458 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "214 mg"
,"fiberContent": "1 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "20 g"
,"sodiumContent": "910 mg"
,"sugarContent": "4 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"10 slices stale white bread",
"0.25 cup butter, softened",
"3 cups shredded Cheddar cheese",
"3 cups shredded Monterey Jack cheese",
"8 eggs, beaten",
"2 cups half-and-half cream",
"2 cups milk",
"1 teaspoon brown sugar",
"0.25 teaspoon paprika",
"1.5 teaspoons salt",
"0.5 teaspoon ground black pepper",
"0.125 teaspoon cayenne pepper",
"0.5 teaspoon onion powder",
"1 teaspoon mustard powder",
"1 teaspoon Worcestershire sauce",
"1 tablespoon chopped fresh parsley for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Spread butter onto one side of each slice of bread. Cut into quarters. Lay half of the bread, butter side down, in the bottom of a 9x13 inch baking dish. Top with half of the Cheddar cheese and half of the Monterey Jack. Layer the remaining bread over the cheese, and top with the other halves of the cheeses."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, whisk together the eggs, half-and-half, and milk. Stir in the brown sugar, salt, pepper, cayenne, onion powder, mustard powder, and Worcestershire sauce. Pour over the cheese and bread. Cover, and refrigerate at least 6 hours, preferably overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Bake the strata uncovered for 1 hour in the preheated oven. Let stand for 10 minutes before serving. Slice and garnish with fresh parsley."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kandi Byrd"
},
"reviewBody": "This is actually my recipe! Still delicious and still our Christmas Morning tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ValMarie"
},
"reviewBody": "This is great recipe as is. At times I put a layer of a finely chopped onion between the layers of bread. Also I cut the crust off because then the strata looks more like a soufflé as it bakes and poufs up! It can impress people as you bring in the dish to your dining room to serve! At times I make it with other kinds of cheese if I happen to have that on hand. Today I used jalapeño Monterey Jack I didn’t have six hours to allow it to rest so I used a simple inexpensive white bread as it soaks the milk - egg quickly and allowed it to rest for 1.5 hours. With this the bread completely ‘disappears’ and it truly looks like a soufflé."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmz"
},
"reviewBody": "used 12 slices of bread, not 10; can also use croissants or french bread - whatever you have on hand.\n\nused 10 eggs, not 8."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Damion Hallstrom"
},
"reviewBody": "Add ham or sausage to make it even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary"
},
"reviewBody": "I made this for Easter brunch. What I did was split it into 2 8x8 pans. In one pan I made it just as directed. In the second pan I added cooked ground sausage. I increased the oven temp to 350 and they cooked in 1 hour 5 minutes. My guests loved them. The one with sausage was entirely gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Parris Graham"
},
"reviewBody": "I made this for my son's graduation party brunch. Everyone loved it! I followed the recipe exactly without changes. People thought I'd worked so hard, but it was incredibly easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeNJ"
},
"reviewBody": "This recipe is GREAT!! Made this a few yrs ago for a brunch &amp; everyone loved it. My daughter is hosting a brunch next week &amp; I was asked to bring this dish. The only change I made was 2 cups each Cheddar &amp; Monterey Jack - NOT 3 cups. Try it - you &amp; your guests will be glad you did. Dee NJ"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carie Warrick Miller"
},
"reviewBody": "I liked this recipe, but nobody else in my family did. My husband cooked the strata according to the recipe and thought it was done. Both he and my son tried it, but it was nowhere near being done and I think that ruined it for them. I then cooked it for another 1/2 hour and I liked it but they wouldn't try it again. I had high hopes and think that if the cook time were adjusted it would have been more successful for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "Overall I really liked this casserole. I did think it was a bit salty so that's the reason for the 4 star rating. Next time I'll reduce or omit the salt. I used a mixture of 2% and skim milk, reduced the cheese by 1 cup, and just buttered the bottom of the baking dish with 2 T of butter rather than buttering the bread. This was still very rich and my guests all complimented it and many went back for seconds. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "indygirl1991"
},
"reviewBody": "This is really flavorful, but like some of the other reviewers, I found that it needed more than an hour in the oven. I wasn't sure whether to use my glass 9x13 or my metal cake pan 9x13, so I chose metal which may have been a factor in the cooking time. I did cover it loosely with foil but removed for the last few minutes, and I kept it in the oven for 1 hr and 10 minutes. It could have gone longer, but that would have made me late for the staff meeting for which I was making this recipe. Everyone loved it, and some came back for seconds! I will definitely make this again. I used Italian bread sliced in 1/2\" sections, and I also lightly buttered the sides of the casserole dish. I used 2 cups each of sharp cheddar, Monterey Jack, and a Mexican blend of shredded cheese (store brand). Also, I used organic eggs as I think their taste is superior, and whole milk for added richness. I substituted chili powder for the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLES"
},
"reviewBody": "I cut this this recipe in half and put it in a Pillivuyt 2 quart white souffle dish. The only change I made was that I used thinly sliced french bread (and baked in a convection oven). In one hour it came out perfect! No over-browning or burning on top, no need to put in a water bath or use foil. I'm just sorry that I didn't take a picture. Served with fruit and bacon. Seasonings in this recipe were delicious. Thanks for sharing, Kandi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "I think this had really good flavor, but my kids didnt like the consistency of the casserole with the bread. They thought it was too mushy (and it was thoroughly baked). I probably will keep all the seasonings the same when I repeat, but will opt for making a casserole that just has eggs in it so they will eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roshica"
},
"reviewBody": "Very good! I added crumbled, cooked sausage and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krsms"
},
"reviewBody": "The brown sugar and Worcestershire sauce gave this\na unique appealing flavor that I hoped it would. I added some chopped ham and about half of the cheese. You could easily add mushrooms, cooked sausage or a vegetable like broccoli. This will be my go-to egg strata from now on. Thanks Rita."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Anderson DiNoto"
},
"reviewBody": "Love this recipe! It's been my go-to recipe for brunches since 2005! My husband's family requests it every year. The only modification I do is to add some very thinly sliced deli ham in the layers. Yummmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I have tried many egg strata recipes in the past, for Easter Breakfast. This one is the best!! Thank You"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oclocal"
},
"reviewBody": "This has become our traditional Christmas morning breakfast. I cook about 3/4 lb. of bacon, crumble/chop it and add it to the layers of bread and cheese. I also chop up an onion and add that to the liquid mixture. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "I made this for a brunch and it was a big hit. I've made several stratas before and this is one of my favorites (and I didn't change a thing). Everyone thought the flavor was great so I'm surprised by the people that gave it a low rating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zekko"
},
"reviewBody": "Makes a really great alternative to the typical 'egg and cheese' bakes/stratas. The seasonings are great, and there's great room for play with the recipe. I made it with egg substitute, and replaced the half-and-half with 2% milk, sprinkled in some chopped onions, and sprinkled some pre-cooked bacon (the kind you buy cooked) on top, and the bacon crisped up nicely while baking. Cooked uncovered, didn't require much more than 1hr, though I broiled it for a few minutes to crisp/brown up the cheese on top. Will DEFINITELY make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LalaBeansMom"
},
"reviewBody": "I made this Christmas morning and being that it was the first strata I ever made I was pleased with the results. I thought it turned out beautiful and with great flavor. My husband had a problem with the texture but I thought it even tasted good cold. Kudos to the chef, dont think I'll ever try another strata recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "I'm giving this a 4 star becasue I did make a couple minor changes...I cube the bread and simply layer breadcubes, cheeses, and egg mixture. I also added cubed ham to the dish and left out the paprika &amp; cayenne papper. FABULOUS recipe - almost identical to one my family has been making for years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "This was excellent! Made it for a holiday brunch and it was a hit! Although it has a lot of cheese, the cheese is not overwhelming. I suggest pressing down the strata with a spatula after you assemble it to make sure all the egg/milk/spices etc are absorbed by the bread. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Catherine"
},
"reviewBody": "This was delicious and a hit with my overnight guests on Christmas. I added sausage (browned bulk) as others did. The only modifications I would make next time are 1) use a slightly larger dish than 9x13 (grease overflowed a little when baking, making a mess in my oven) 2) use a bit less cheese (unless you're omitting sausage/meat). Forgot to mention that I omitted brown sugar since it called for so little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANE107"
},
"reviewBody": "This is wonderful, and easy to make variations. We went with an Italian theme, using 2 cups of shredded Italian blend cheese, 8 oz fresh mozzarella, one small zucchini, sliced thin, 1/2# Tofurky brand Italian Sausage, slice thinly. I had an abundance of leftover hamburger buns, and I dried them completely before making this dish. Oh - also added 1 1/2 cups seeded fresh tomatoes. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMKING1"
},
"reviewBody": "I've made this multiple times already and it's a family favorite. I'm getting ready to try it with added meats and veggies. I bet it will be even better. But my family always requests I make this when we do special brunches. It's easy and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Outstanding! I added steamed spinach; mushrooms would be good too. I also toasted fresh bread and baked it 1 1/2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "basg101"
},
"reviewBody": "This makes a nice brunch dish. It's particularly flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Gunnink"
},
"reviewBody": "I made this recipe just as it called out except I added one thin layer of cubed pre-cooked smoked ham. I am not much of a cook, but this was easy, delicious and everyone wanted the recipe. It felt great to have the best tasting food at the party. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Griggs"
},
"reviewBody": "I had a Strata recipe for an 8x8 dish, but needed more (didn't want to double my recipe for some reason). \n\nRita's Eggs Strata is THE STRATA for an 8-1/2 x 13 dish. \n\nBut alas, every chef has to mess with perfection.... I added 1 pound of browned breakfast sausage to which was added 1/2 medium chopped onion and 1/2 medium chopped green bell pepper - and a small can of drained mushrooms.... mmmmmm.\n\nThe additions are not necessary... but I believe toasting your bread first (don't just rely on day old being dry enough) is the key to a great quality strata with just the right consistency.\n\nThis was the best strata I ever made... and was twice as nice the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindz"
},
"reviewBody": "This was amazing! The only thing I did was add a package of frozen spinach (well-squeezed) in with the first cheese layer. It's nice to find a strata recipe that doesn't call for meat. This did take two hours to cook, instead of just one as the recipe calls for, but that could have been because I added the spinach; not sure. I made it for breakfast the morning after a bachelorette party, and it was perfect. Makes great leftovers, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clark610"
},
"reviewBody": "Phenomenal! I made this for mother's day brunch. I cut the half and half down as a previous reviewer did. The crowd raved over this. I added bacon and chopped green onion to the dish. It was gone in minutes and guests asked for the recipe. I cannot wait to make this again and experiment with add-ins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wilco"
},
"reviewBody": "So simple to make! There was a panic when we couldn't find our tried and true strata recipe. Turning to the Internet, I my mom found this and it turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby"
},
"reviewBody": "Unlike a lot of recipes, this one lends itself to improv.\n\nI reduced the servings to two, and made it in single serving dishes. I made it in the morning, and just compressed the finished strada to make sure the bread was soaked. I added broccoli and onions (removing the onion powder), and used soy milk instead of regular (it was all we had). And I used grainy bread. \n\nIt was still fantastic--now that's a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "Delicious! I wanted to make this in my large casserole dish (a little bigger than 9X13) so I used 12 slices of bread and 2 more eggs. I also added 1 1/2 cups of chopped ham and 1 cup of chopped onion, layered like the other ingredients. It was the perfect amount for the dish. I also cut the crusts off before baking - maybe not necessary, but I wanted it to look elegant. It took a lot longer to bake than 1 hour, but I had two in the oven at the same time (2 hrs. total bake time). I did loosely cover it with foil for the first hour and the browning was just right. Everyone loved it and I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trish M"
},
"reviewBody": "Made this for xmas morning...it wasn't savory...it was rather bland and GREASY. I didn't even use all of the cheese suggested in the recipe. Maybe my tastes have changed, but I won't be making this again. Sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Wright"
},
"reviewBody": "I've made several of these breakfast type casseroles for special occassions ove the years an this is by far the best. It's filling and fluffy at the same time! I followed the directions as written and it worked well. I get lots of requests for this recipe (from young and old alike)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This recipe was exceptional!!! I put it together on the fly, wondering if all the ingredients would blend to make something wonderful (because they seemed questionable for me:) and the flavor was amazing! I used sourdough bread because that's what I had and the dish turned out fluffy and firm. It really was easy and delicious, recieved very well, and the recipe was requested..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Taylor"
},
"reviewBody": "I made this for Thanksgiving morning and everyone enjoyed it and told me to be sure that I save the recipe. The subtle changes in seasoning were what made this a keeper. It isn't overwhelming, but different enough. \"Egg dishes can be kinda boring, but this one was good.\"\n\nI added 1/2 pound of bacon and 1 pkg of pork sausage (because I had them on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Wonderful for a family brunch! This tastes just like a recipe my mom use to make.\n\nIf you want it to be less fattening, cut back on the cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wpbfl"
},
"reviewBody": "I too added peppers, sausage, and mushrooms. The dish still tasted very bland to me. It actually tasted better cold the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOUSIE206"
},
"reviewBody": "My first strata - it was easy to make and quite tasty. I will definitely make it again and mix/match ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtgraham"
},
"reviewBody": "I have made this recipe three times and it turns out great every time. I like sliced french bread best, either toasted lightly in the oven or left out for a couple of hours. We have added sauage and onions for a tastely variation. Great meal for a large crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Stuart Derosier"
},
"reviewBody": "1 word - AWESOME!!! \nAdded a layer of cubed ham steak and it was a big hit. Versatile to add your favorite ingredients if you choose!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JODI"
},
"reviewBody": "Served this to my husband and picky stepchildren Christmas morning. Everyone loved it! This will become a tradition in our home for Christmas morning. I added chopped ham, mushrooms and green pepper although it would have been delicious without, also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "This had a good flavor but needed work so I am giving it 3 stars. I recommend more butter, using french bread, and putting a cover on until the last 15 minutes so that the cheese doesn't burn. You will need more than 1 hour to cook this. I also recommend adding meats or vegetables like ham, sauteed spinach or mushrooms that have been pressed to remove water. The savoury flavor is a 5 though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "I made this for a large group and got great reviews on it. I added ham, green peppers, mushrooms &amp; green onion to mine &amp; baked 15 minutes longer to make sure it wasn't runny. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Fudge"
},
"reviewBody": "Made this for Mother's Day brunch and it was very good. Served it with chopped green onions which saved it from getting too bland. Be sure to have an \"add on\" or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an awesome recipe. Your diners will always ask for seconds. I added some chopped ham on the first layer plus some chopped green onions (and deleted the onion powder). SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anichka"
},
"reviewBody": "Made this for Christmas morning. Easy prep, and it was delicious. Everyone enjoyed it, even my picky brother. Next time, I may try to throw some spinach or other vegetables in for variety."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CSBSIX"
},
"reviewBody": "Sorry! Didn't like it....kids wouldn't eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AMSILVA"
},
"reviewBody": "This was a very easy recipe. I changed it to have a mexican flair by using 4 blend mexican cheese and 2-4oz cans of diced green chile peppers and 1 tsp. of taco seasoning. I'm sure the original is awesome as this came out pretty tasty. I'm not sure if a strata is usually this custardy, maybe I'll use a denser bread next time. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MLELAND"
},
"reviewBody": "This was a great, quick and easy stratta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefjudge"
},
"reviewBody": "Just Fabulous. \r\nI wasn't sure where the recipe was going with the worchestershire sauce and all that savory stuff, but boy oh boy, this comes together to make a dish that is very tasty and classier than all those Sunday brunch easy-cheesy egg creations. I will keep this close at hand for future reference, YUM!\r\nBe sure and use a firm bread, I didnt have any stale bread so i just left mine out for a couple hours to dry out. The thing I liked about this is that you make it the night before (or longer), and it lets you make other wonderful fresh things to go with it, a great helper for that spectacular brunch you are planning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "Really good and great for a crowd. I also added breakfast sausage that I had in the freezer. Thanks Kandi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCLONGACRE"
},
"reviewBody": "This was an excellent choice for breakfast the morning I graduated from Washington State University. I had all my family and friends over, and the feedback was incredible! My Mom and I loved it so much we are making it again now for Christmas morning breakfast. We did make a small change by splitting the recipe in half, making one have the way Rita would, and in the other half we added sausage. EXCELLENT RECIPE....HIGHLY RECCOMMEND!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/58492/ritas-eggs-strata/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1307/breakfast-and-brunch/eggs/breakfast-strata/",
"name": "Breakfast Strata Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/58492/ritas-eggs-strata/",
"name": "Rita&#39;s Eggs Strata"
}
}
]
}
}
, "about": [
]
}
]