				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Roasted Pork Loin"
,"datePublished": "2000-06-18T08:59:44.000-04:00"
,"dateModified": "2023-03-02T14:06:00.173-05:00"
,"author": [
{"@type": "Person"
,"name": "Kathleen Burton"
,"url": "https://www.allrecipes.com/cook/24324989"
}
]
,"description": "Succulent pork loin roasted with garlic and rosemary and basted with a white wine pan sauce makes a flavorsome and impressive main dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OfAXfkfDR6s1Ml61M6qY5l1OyNA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21766-Roasted-pork-loin-step4-111-fe7a75491a784b88bb9659951761ef85.jpg",
"height": 1125,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688035079001",
"description": "See how to make a succulent, fragrant pork roast with garlic and rosemary.",
"duration": "PT2M39S",
"name": "Roasted Pork Loin",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/03/19/21766-Roasted-pork-loin-115.jpg",
"uploadDate": "2021-03-04T15:02:25.527-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Roasted Pork Loin"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "1373"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "300 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "71 mg"
,"fiberContent": "0 g"
,"proteinContent": "23 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "58 mg"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"3 cloves garlic, minced",
"1 tablespoon dried rosemary",
"salt and pepper to taste",
"2 pounds boneless pork loin roast",
"0.25 cup olive oil",
"0.5 cup white wine" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xCu17q1EB8IEvIF4lPUKRGhaFC0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21766-Roasted-pork-loin-step1-108-fff000262c044153a1b8ccd4d69e1d65.jpg"
}
]
,"text": "Gather all ingredients."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dig8ZM0Kvqi8YA-dHkIJ8cIU_sY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21766-Roasted-pork-loin-step2-109-6c03b5be890f42728a582e756815965e.jpg"
}
]
,"text": "Crush garlic with rosemary, salt, and pepper in a mortar and pestle to make a paste."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IeSms6wXFExg0KltIpy2FbC5cAo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21766-Roasted-pork-loin-step3-110-9715c4e941324ce9b3ae34229cd152e4.jpg"
}
]
,"text": "Pierce meat with a sharp knife in several places and press garlic paste into the openings. Rub pork loin with the remaining garlic mixture and olive oil. Set into an oven-safe pan."
} ,{
"@type": "HowToStep"
,"text": "Place pork loin into the preheated oven, turning and basting with pan liquids every 30 minutes. Cook until the pork is no longer pink in the center, 90 minutes to 2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Remove roast to a platter and keep warm."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OfAXfkfDR6s1Ml61M6qY5l1OyNA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21766-Roasted-pork-loin-step4-111-fe7a75491a784b88bb9659951761ef85.jpg"
}
]
,"text": "Place pan onto the stove over medium-high heat and pour wine into it. Heat wine and stir to loosen browned bits from the bottom of the pan. Simmer for 3 to 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Slice pork loin and serve with pan juices."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candi"
},
"reviewBody": "I followed the directions and it was delicious! Even my picky child loves it. I will be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Yechout Kiserow"
},
"reviewBody": "So juicy and tender! I used my own pork seasoning but I did everything else according to the recipe. This was so much better than I expected! It was the best pork I ever made. It sliced nicely, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TDiddy"
},
"reviewBody": "The meat was done to perfection, moist to the max, and the rosemary garlic EVOO rub worked wonders!!! Even the gravy was 2 thumbs up, again thanks to the herbs. I think next time I may try 375 for some additional browning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The resulting loin roast was great. It stayed juicy, was tender and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elcmom"
},
"reviewBody": "This was excellent! In our area of Pennsylvania, pork and sauerkraut with mashed potatoes are a New Year's day tradition and I've had it for almost 30 years since my husband loves it. Personally I always found the whole plate of pale white food to be bland and not my favorite but kept it going ;-) Since it was just 4 of us this year and one doesn't eat pork, I looked for something to change it up. I had a 3 lb roast and I used some of the suggestions from others: - Doubled the recipe and used fresh rosemary (6 Tbsp for the doubled recipe. - Used a small food processor and instead of 1/4-1/2 cup of olive oil I probably used 2-3 Tbsp to create a paste. - Paste went into the holes I made and the rest was rubbed all over an hour before roasting. I'd do it the night before next time - with a coating of olive oil as a base. - Roasted it at 350 degrees with 1/4 cup Chardonnay (it was open) in the pan, basting every 30 minutes and adding more wine when it boiled down. - It took 1 hour 15 minutes to reach 145 degrees internal temp. I thought it was a little dry although the family didn't so might take it out 5 minutes sooner next tine. -Wrapped it in foil and let it rest for almost 30 minutes when the rest of the meal was ready. It was still hot and very moist. - Took the drippings and scrapings and added 1/8 cup of Chardonnay and boiled it until was reduced. This au just was served on the side and was fantastic. The three of us thought the pork was excellent and full of flavor. I was a little concerned about the rosemary and garlic overwhelming the flavor of the meat but it didn't. Served with mashed potatoes (and pork gravy), sauerkraut and roasted carrots and it was wonderful. My husband had leftover pork on a roll later in the day so clearly didn't mind changing up the tradition! Definite repeat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Moats"
},
"reviewBody": "Our family loved this recipe and I think I will make it like this every time! Yummy 😋 and it was so juicy! Another great recipe 'ALLRECIPES', keep up the good work!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Was very good. Very moist. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Boyd"
},
"reviewBody": "Such an easy way to may pork loin roast. Worked just like the recipe said. I skipped the garlic and added a bit of white pepper along with the black pepper and salt. I think the key is putting the drippings over the roast every 30 minutes. So moist and tender. I will definitely do this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tender and juicy. My family loved it. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chourney"
},
"reviewBody": "I roasted a 3 lb loin, rubbing the rosemary/garlic paste on the outside. No wine, just chicken stock so I worried the wouldn't be enough flavor - so I finely minced a tbsp of fresh rosemary and added it to the pan drippings from the roasting, along with what had fallen off the outside of the meat. Added 1/3 c more stock and a 1 tbsp cornstarch/water slurry and heated the mixture until thickened. Poured gravy over the sliced roast and served gravy on side. Very happy family &amp; gravy was terrific on the roast vegetables I had prepared. word of advice: be sure not to cook the pork past 145F, it very well might be too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy, quick and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "Have made this recipe many times as it is seriously simple but full of flavor. It comes out perfect every time. I do however apply a bit of technique. I sear the loin on all sides to seal the juices inside and then cover it with aluminum foil and bake it. I remove the foil in the last ten minutes of baking. To thicken the pan juices a bit, I just add 1/2 tbsp to 1 tbsp of unsalted butter. If the pan juices reduces too much, add about 1/4 c of chicken broth. Have made it again and again and will continue to do so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There is a rule in my house... \"Do NOT lick your plate!\" This was so good that I gave them permission to lick their plate! I got the same reaction from everyone (almost at the same exact time), \"Keep that recipe!\" Needless to say it was a huge hit! I have never tasted anything as tender as this. One thing though, it took me almost 3 hours to cook this. At 350 it took 2 1/2 hours for the inside to be done, but it was still super tender and extremely moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caro"
},
"reviewBody": "Omg amazing!!! I followed someone’s suggestion and simply put all ingredients for the paste into the blender! (Not the oil) Then used a small portion for the insertion…once done added the oil in the blender with the remaining paste…then rubbed it all over!! We used a large piece from Costco 7lbs cut in 2! Side by side in pan! Made 4 times the ingredients! (1/3was fresh Rosemary- the rest dry rosemary) Used chicken broth instead of white wine and once mixed in with pan drippings, transferred to a pot and added mix 1/2&amp;1/2 of cornstarch to water to thicken the sauce! So so so yummy!!! A new family favourite! Easy to make, my ten year old made it! Love the video demonstration it was very helpful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin Middaugh"
},
"reviewBody": "Good taste, but the roast wasn't as tender as I hoped, and it didn't brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "john brandetsas"
},
"reviewBody": "Cooking time is WAY TOO long. I pulled mine at an hour and it was already at 155 F. My fault, should have known better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Wong"
},
"reviewBody": "I love it, it turns out very delicious and juicy , it look so good as soon as it came out of the oven i start slicing the roast an start eating so I forgot to take picture. the only thing I didn't make is the sauce it is very tasty already so I skip the sauce ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Lis"
},
"reviewBody": "My pork loin came out fantastic! The big part I was worried about was the roasting time because mine was just over 1 pound! I cut the remainder of my 1/2 loin into chops. Many of the other recipes said to cook until my thermometer reached 165°! I’m so happy I used your recommendation of 145° because it would have turned into a brick!!! Lol Besides using rosemary, I also used some thyme and parsley. I wish I would have made the holes in the meat to insert some of the garlic mix because I only rubbed it on the outside. It wold have been more flavorful your way but I was in a hurry. I made more of the garlic rub and poured it all over my side dish of potatoes, carrots, onions and parsnips. I baked it alongside of the roast. That finished first so I took out the roast and raised the temperature to 425° which was the way it should have been roasted. Your recipe will be placed in my best of section in my recipe box!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VAFamilyCook"
},
"reviewBody": "Made it exactly according to the recipe, and it was delicious! My whole family raved. We love the pan juices over the tender pork. Five stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "niejabend1"
},
"reviewBody": "Did not like it, but husband said it was OK. I thought it was rather boring and a waste of a nice loin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added a lot more garlic and substituted red wine for the white. It was very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beth40dfl"
},
"reviewBody": "I did make a few changes. Added beef paste, \"Better than Bouillon\", a 1/2 tea honey, a little more Rosemary and 1/4 tea of Thyme"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dldcns"
},
"reviewBody": "This was an easy and very tasty recipe. The added wine at the end was a great finishing touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMB4LIFE"
},
"reviewBody": "This recipe was excellent! I used more garlic. My boneless pork loin was just under 3 lbs and I cooked at 350 convection roast for 1hr 10min. It was perfect and really tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancymariedavies"
},
"reviewBody": "This is a delicious recipe. Easy to make, no weird ingredients and can be adjusted for time and oven temp. 5 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happyhomemaker"
},
"reviewBody": "Love it. I double the marinade and rest at least 3 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steffy1245"
},
"reviewBody": "It's so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Hart"
},
"reviewBody": "Delicious! Make exactly as written and we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "flason"
},
"reviewBody": "Prep ahead bachelor. I enjoy cooking and eating well! Cook the pork loin to 135 internal with an oven cable probe that starts in the loin and announces “rare beef” 135 degrees. You meal is done!’ Take it out! Let it cool. When it’s cool enough to cover with plastic- do. Then let it come to room temperature. Remove the roast and do the pan sauce. Photos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Polska Mary"
},
"reviewBody": "I made this for the 1st time today, and it is a “keeper”. The taste of the rosemary and garlic was exceptional, and infusing this paste into the meat, followed by the overall rub with it and the olive oil, brought this “over the top”. My husband couldn’t stop praising the end result, and we don’t have pork roast often. This deal changes the game!! Happy in southern Delaware!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luci"
},
"reviewBody": "Easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vicky DiNicola"
},
"reviewBody": "The temperatures are all wrong in this video and recipe. Cooking to 160 will result in an overcooked, dry roast! Instead, roast until an internal temp of 148 has been achieved. At 350 this will take about an hour to 75 minutes for a 2.5 to 3.0 lb roast. Remove from oven and wrap roast in a tight foil packet for 20 minutes before carving. The internal temp should rise to around 155 which is where you want it to be for a juicy, succulent pork loin! Other than that the recipe is perfect, although I also added a tsp of onion powder to my garlic Rosemary wet rub. Soooo flavorful and juicy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Adam"
},
"reviewBody": "awful recipe! thanks for ruining my dinner! i got the biggest loin in the grocery store and i checked it after 50 minutes at 350 and it was at 190 degrees! you dont cook loin for an hour! what a joke! this should be corrected to 35 minute cooking time and check after 25-30 minutes. google really let me down bringing me here. very bad recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evelyn Fraley"
},
"reviewBody": "great - I used fresh grated ginger also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kyokonoito"
},
"reviewBody": "I baked in the cast iron pan. It got little be dry so when I pour sauce it made all good. When I made a sauce I add little be soy sauce, miso paste and honey and sugar ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pirate59"
},
"reviewBody": "Only change I made was last 5 minutes under the broiler. Fantastic. Thanks Kathleen!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Humes"
},
"reviewBody": "I bought a 2# garlic &amp; herb infused pork loin and prepared per recipe. I did add about 1/4C of water to roasting pan it was delicious &amp; letting it set for 10-15 minutes before carving kept the meat very moist. Looking forward to sandwiches tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "M Ken"
},
"reviewBody": "Way too much rosemary. Dominated the whole flavor. Maybe a 1/4 TEASPOON of rosemary. My (2) each one pound pork loin for a total of 2 pounds was done in 45 minutes at 350°f"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Townsend"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kblumthal"
},
"reviewBody": "I tried the super simple recipe with great results! the aromatics smell While it was baking was incredible. I used a remote cooking thermometer And set it to the recommended 145 degrees. The timer went off right at 57 minutes. My roast was 2.2 lbs. served with small potatoes that I roasted along with it and a side of asparagus. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SteveIn44444"
},
"reviewBody": "I had a large pork loin in the fridge and wanted to try something different with it. I used garlic, salt, black pepper, and dried lemon thyme from the garden (since I didn't have any rosemary) and used moscato for the wine (my wife likes those sweet wines). It was excellent! I'm not a huge fan of pork, but it was tender and flavorful. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gaylene"
},
"reviewBody": "Thought I had rosemary and I didn't. I'm hoping that's what made the difference because I didn't find this to have very much flavor. Not a huge fan of pork loin anyway, but made it for my husband."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole"
},
"reviewBody": "I added 3 more cloves of garlic, just because I love it. May family said it was very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Zack"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Stephens Meyer"
},
"reviewBody": "This was a good recipe. I do suggest cooking it a little longer than it says. It was not super tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsh"
},
"reviewBody": "I love this recipe. It is so simple and just plain delicious. I make two small tweaks, however. I always use crushed rosemary rather than the longer leaves. And I add a light coating of Panko breadcrumbs which stick perfectly with the oil and add some more texture to the crust. But, the recipe is great with or without my changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Atkinson"
},
"reviewBody": "I would not recommend following the suggestion of the top-ranked helpful review where the reviewer suggested cooking this covered with a little wine in the pan. The meat came out rubbery and the fat cap on the pork was not even remotely rendered. I'm also confused about how any roast recipe does not start with searing the meat on all sides first. In addition to the underwhelming technique, the rub on the outside was just plain boring. I'm ok with trying recipes again and making tweaks if it didn't come out just right the first time, but for this recipe there's just nothing exciting enough to motivate me to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leora"
},
"reviewBody": "Delicious! I’m not a very good cook, so I’ve always made pork roast in the crockpot with sauerkraut and strayed away from “fancy” recipes. But I bought a pork loin by accident and decided to try this recipe. My finicky son loved it! It has a delicious flavor and the meat is incredibly tender. No more pork in the crockpot for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEMCEM519"
},
"reviewBody": "Best Pork Roast ever, followed other\nsuggestions and seared Roast,\nAdded Onion, Carrots and Mushrooms,\nused fresh Rosemary \nHad a 3 pound Pork boneless roast\nand cooked for 2 hours.\nPERFECT................."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mar see"
},
"reviewBody": "This was a thanksgiving hit! Easy to make too! Next time I need to make two because one wasn’t enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grandmaskitchen"
},
"reviewBody": "My favorite way to make pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie"
},
"reviewBody": "This pork was very juicy and tasty. I didn’t have garlic cloves so I used garlic powder. It did not make the paste that the recipe talks about. It was pretty runny but still made the roast taste yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Marie"
},
"reviewBody": "It was so good the family has asked for it again this week..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Weeden"
},
"reviewBody": "Delicious! I will make this again, thanks!!\nThe recipe is easy, the video is helpful to a first-time pork roaster. The time is mostly hands-off in the oven, with occasional turning. Prep was fast.\nI modified it by making a gravy (chicken stock, corn starch) with the deglazed sauce (after the the wine and pan bits stove-top instructions). \nThe gravy was a bit rich for my 2 year old, got by 4 year old loved eating it like Mommy: mashed potatoes, a bit of pork, and a touch of gravy-- a forkful of wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brian Grannan"
},
"reviewBody": "Very easy to follow. Tasted pretty great! Friends loved it but was a little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Henderson"
},
"reviewBody": "It is hard to please everyone in my family with 5 kids who all have different tastes, but this pork roast was a hit for everyone! Everyone wanted a second helping, even my 5 yr old who barely eats anything but pb&amp;j."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tinsdale"
},
"reviewBody": "This is easy and absolutely delicious! Really gives the pork roast a great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jim Della Volpe"
},
"reviewBody": "Ummm Good. It was a hit. I tweaked it a little, and omitted the crushed garlic . I skipped the Rosemary , but I scored it and studded it with cloves, Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Collins Love"
},
"reviewBody": "This is easy and so delicious. Our entire family raves about it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spryte Bryant"
},
"reviewBody": "I forgot to add salt or pepper -- liked it anyway. Used fresh rosemary from the garden. Delicious. Had to leave it in longer to achieve the internal temperature I wanted, but it still came out juicy and tasty.\n\nWill likely make it again sometime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linette8"
},
"reviewBody": "Perfect as is. Just the right blend of garlic and rosemary. I roasted carrots and an onion in the same pan too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "Perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Weekes Sowers"
},
"reviewBody": "We really liked this dish! I followed directions and the only change I made was putting the wine in the pan with the roast, covered it with foil and cooked it for a hour and a half. I used the drippings to make a gravy. It needed to be watered down a little, thickened and was so yummy over the roast and mashed potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Holbrook Shipman"
},
"reviewBody": "Flavor did not penetrate the meat very well, even with stuffing the slots. But the meat was very juicy and tender"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BudandJan Dragoo"
},
"reviewBody": "Rosemary really enhanced the flavor. Go easy though. It is easy to dominate the dish with the Rosemary. We had leftovers for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "The roast was delicious. I did add a couple of changes to the existing recipe. Took an onion and Grated it fine and added the onion juice and about a teaspoon of onion to the filling. I also took fresh ginger and grated fine, about 3/4 teaspoon, and added to filling as well. Resulting flavor was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lgood55"
},
"reviewBody": "Honestly, I just put this in the oven. But had to comment. I will guess that the 1/2 C. White wine is to sip on while it cooks - I've read the directions 3 times. No where does it say where or when to add the wine :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura B"
},
"reviewBody": "This was the most delicious and tasty pork loin I have ever made. I added only one ingredient...dijon mustard to the paste. \n\nI flipped it every fifteen minutes and basted it with the pan juices. Cooked for one hour at 350 degrees, covered with foil, except for the last ten minutes I took the foil off.\n\nCan't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nightowl"
},
"reviewBody": "Simple yet delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika H"
},
"reviewBody": "Love this recipe. Blended oil and rosemary and added onion flakes to a paste. \nmarinated loin for 3 hours. Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leroy Levine"
},
"reviewBody": "Hot dam this was excellent doubled the sauce and added flour to thicken went amazing work mashed potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meldis"
},
"reviewBody": "DELICIOUS! I used garlic powder instead of whole garlic (it's what I had) and just mixed all the spices into the olive oil and rubbed that into the meat. I then poured the remainder over all and then did the same with the wine (I've used both drinking wine and cooking wine, which has more salt). Either way it came out beautifully! I did have to cook it at least 30 minutes longer, and my oven is small so that's saying something! Just keep checking with a meat thermometer and you'll be fine!\n\nI've also done this on the stove with chops, letting them simmer in the juices on a covered skillet after browning, and they were wonderful as well! And the juices are delicious on vegetables!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "walloongirl"
},
"reviewBody": "Denny loved this. I would use more garlic and fresh rosemary next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Denny loved this. I would use more garlic and fresh rosemary next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan R."
},
"reviewBody": "Super easy and even the picky kids ate all of it. Had to cook for a little longer to reach temp but only 10 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BZ"
},
"reviewBody": "Made this for a dinner party and everyone loved it. I will definitely make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CJ Bird"
},
"reviewBody": "The recipe was easy and pretty good followed as is. However the rosemary was overpowering in my opinion. I’d you less next time or maybe use Herbs d’Provence in place for flavor that didn’t overwhelm the pork. I will probably try searing the pork loin as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sue DiSisto"
},
"reviewBody": "um, OK, I am not good at cooking meats. I've learned to use a thermometer and I try to go with the recipes as stated. I also read several reviews to capture the nuances. No one told me that pork tenderloin comes with 2 long pieces. Do I treat them separately? Do I twine them together? Did I get the wrong piece of meat? Someone said to throw veggies next to the meat, with the wine. Somehow my meat got too much liquid and I didn't get roasted loin, I got boiled loin! I had put the timer on for 1 hour, to check. The meat was very overdone. Also, do you cover it or not? Some people are covering their roast, the video doesn't. I didn't. I will try this recipe again because I know I did something wrong and I know this can be very good. I will twine the meats together, use very little wine and no veggies, no cover, and start checking the temp of the meat earlier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "patgal"
},
"reviewBody": "so easy and delicious! my oldest was annoyed after working a long day and commuting home to see this for dinner. but once he had it, he looked at me and said save the recipe, it's a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "Excellent flavour and so easy to make. Will be sure to use meat thermometer next time as it was a bit over done, 2.5 lb @ 350 for just one hour. As we have a gas oven might need to lower temp to 325."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny Shepherd"
},
"reviewBody": "I've made this one nearly a dozen times now, I love surprising my wife with this mid-week. It's incredibly easy to make, and wonderfully fragrant and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandie"
},
"reviewBody": "This is my favorite recipe for pork loin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Roast came out perfect. Added red potatoes, &amp; carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessica s"
},
"reviewBody": "Simple and easy and came out perfectly cooked. Fresh rosemary might have made it better but, otherwise, I have no complaints"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "South Davis"
},
"reviewBody": "I cooked it too long. I should have flipped it after 30 mins then checked the temp at 1hr. Mine was a hair dry, but overall everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "tHIS RECIPE WAS EASY AND EXCELLENT. NO CHANGES NECESSARY. THANK YOU"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaylee Price"
},
"reviewBody": "Just made this for the second time in a month! This was amazing, and I didn't even make the wine sauce. We didn't like the sprigs of rosemary (I had to use dried), so next time I am going to try using ground rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine Conner"
},
"reviewBody": "It was very easy to make. I only had red wine so I left it out of the recipe. It was so tender and juicy. I served it with pork grave lightly on the port loin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "onelot"
},
"reviewBody": "Easy yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erinosu"
},
"reviewBody": "I first had the pork loin in the crockpot for about 2.5 hours and noticed it was not cooking through so I put it in the oven for about 45 minutes and it turned out so moist and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "This was absolutely delicious. I didn't change a thing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gigi"
},
"reviewBody": "I used a spice rub of rosemary, thyme, basil, oregano and parsley (equal parts each). In my mini food processor, I mixed the spices with three cloves of garlic and a little olive oil. I then rubbed the paste all over the roast and let it marinate in the fridge for a few hours. I baked per the directions using a meat thermometer. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kevin Carroll"
},
"reviewBody": "Loved it except to much garlic. Nice Chang to just salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mflain"
},
"reviewBody": "Moist, tender, and delicious made as recipe directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "patricia Robertson"
},
"reviewBody": "Very good. I like garlic and rosemary. I had fresh rosemary growing in my yard, so I tried to use it. I don’t recommend it. It was very hard to crush with the garlic and oil. I tried using a mortal and passel with limited success. I also didn’t have the wine, had to leave it out. But all things considered, it was very tasty. My advice, follow the directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Stone Hanson"
},
"reviewBody": "Left out the wine and roasted the pork with potatoes and large cut onion and garlic cloves. Afterward, made gravy with the drippings. My family raved!! Very tender and flavorful and will definitely make this again and again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geankar"
},
"reviewBody": "Great dish, and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "evelyn"
},
"reviewBody": "The roast was moist. I didn’t make any changes. The wine sauce was too thin. If I make it again I would add some flour to make the sauce thicker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bob Rhodes"
},
"reviewBody": "I made it my Cosori Air fryer. Cooked at 350F for 20 minutes. Could have gone for a shorter time. Slightly overcooked (internal temperature 170F). But really tasty!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21766/roasted-pork-loin/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/677/main-dish/pork/pork-roast/",
"name": "Pork Roast Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21766/roasted-pork-loin/",
"name": "Roasted Pork Loin"
}
}
]
}
}
, "about": [
]
}
]