				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rolled Buttercream Fondant"
,"datePublished": "2019-04-02T02:48:01.000-04:00"
,"dateModified": "2023-01-07T23:29:44.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Kelley"
,"url": "https://www.allrecipes.com/cook/1567922"
}
]
,"description": "This rolled buttercream fondant recipe uses shortening and confectioners&#39; sugar for a buttercream flavor with the appearance of traditional fondant."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/VS7nOlDidbg3GcPlY7XtfQzag40=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/708132-rolled-buttercream-fondant-My-Hot-Southern-Mess-1x1-1-16f0052ca8b84e4189f122e82f7eaa12.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1711452388001",
"description": "This rolled buttercream fondant tastes just like buttercream frosting.",
"duration": "PT3M21S",
"name": "Rolled Buttercream Fondant",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/cd821688-eca1-4a47-8c25-2aebf9811764/7aab50a9-8d1e-4676-8f29-5c72e81f565e/1280x720/match/image.jpg",
"uploadDate": "2021-07-24T12:39:10.721-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rolled Buttercream Fondant"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "747"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "140 kcal"
,"carbohydrateContent": "26 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "31 mg"
,"sugarContent": "22 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup light corn syrup",
"1 cup shortening",
"0.5 teaspoon salt",
"1 teaspoon clear vanilla extract",
"2 pounds confectioners' sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, stir together shortening and corn syrup. Mix in salt and vanilla flavoring, then gradually mix in confectioners&#39; sugar until it is a stiff dough. If you are using a stand mixer, use the dough hook attachment. Otherwise, knead by hand. If the dough is sticky, knead in more confectioners&#39; sugar until it is smooth. Store in an airtight container at room temperature or in the refrigerator."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/VS7nOlDidbg3GcPlY7XtfQzag40=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/708132-rolled-buttercream-fondant-My-Hot-Southern-Mess-1x1-1-16f0052ca8b84e4189f122e82f7eaa12.jpg"
}
]
,"text": "To use: Roll fondant out on a clean surface that has been dusted with confectioners&#39; sugar until 1/8-inch thick. Drape over frosted and chilled cakes and smooth the sides down, or cut into strips to make bows and other decorations."
} ]
,"recipeYield": ["45"]
,"totalTime": "PT10M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAINE-MOMMY"
},
"reviewBody": "Was perfect and very easily to use. Taste great, too. I have used this several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Ann Bittle"
},
"reviewBody": "I was hoping for a quick buttercream frosting that I could also make into fondant with the addition of a few ingredients. This is NOT it. I don't even know if this would be palatable, being made from shortening instead of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ambersuzui"
},
"reviewBody": "This was very easy and rolled well. The taste was a hit but it did have the tendency to crack a little more than others I have tried"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooker11"
},
"reviewBody": "How many pounds does this make?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "YaYa24"
},
"reviewBody": "Other reviewers were right about the greasiness of this fondant. I chilled it overnight and it remained very soft. I did manage to get it on a six inch cake and it held up okay. The taste isn't bad, but the texture was that of melting taffy. I made some cupcake decorations, but I had to leave them overnight with a fan on to firm up, and after they were on the cupcakes a while they began to get very soft. I doubt that I will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Wade"
},
"reviewBody": "I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "G.C.A. DiY"
},
"reviewBody": "Texture when eaten is like a greasy \"AirHead\" Candy. Great for cookie decorations, cut outs, etc. Easy to make BUT it really is TOO GREASY. LOOKS WET; was pretty good FOR draping over a carved/sculpted cake....i just wish it didn't look so greasy. TASTE GOOD TOO THO :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Richards"
},
"reviewBody": "Slightly greasy and cracked. It was my first time however. But it was easy to work with and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Keely"
},
"reviewBody": "Very greasy, needed a lot of extra confectioners sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tazisalady"
},
"reviewBody": "easy to make, you don't burn your hands on melted marshmallows and it tastes great. rolled out easy and was able to do it 1st time I tried. even made some not so great roses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kerripm"
},
"reviewBody": "I followed the recipe as listed. However, when I tried to cover the cake, the fondant started cracking and falling apart. I tried removing the fondant, re-rolling and refrigerating but the same thing happened. The fondant tasted great, however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jennifer Chiappisi"
},
"reviewBody": "I'm a fairly new cake-maker, but have successfully applied store-bought fondant to cakes and made creations for cakes out of store-bought fondant, so keep that in mind with my review.\n\nI followed the recipe to the letter, save for adding a little bit of Wilton Butter Flavor to help make it taste a little better. It did help, but the end result still tasted a lot like Wilton's newer fondant so I wouldn't say that this recipe was a huge improvement over store-bought fondant. It may have been a teeny bit better, but that teeny bit didn't help it enough to overcome it's faults.\n\nAs far as pliability and being able to use it, this fondant recipe was horrible. I had it in the fridge for appr. 3 hours before trying to flatten it and place it on the cake. I also used it straight on our cold granite countertop (with indoor temperatures at appr. 73 degrees) in hopes that would help. I placed a good amount of powdered sugar on the counter before rolling it out but it still stuck to it. Unfortunately, rolling the fondant made the shortening greasiness ooze out of it and immediately absorb all that powdered sugar and start sticking to the counter.\n\nI won't be using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayatri"
},
"reviewBody": "I used golden syrup instead of corn syrup - not sure if that's why it was more sticky and needed more time to set in the fridge. But once it did, was perfect. Used it on cupcakes and cookies for my son's birthday, and all the shapes held despite it being a humid day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cb"
},
"reviewBody": "Very good!! This was my first time making and using fondant. Gave it a 4/5 because i changed the recipe a tad, i only used 1/4 teaspoon of vanilla instead of a whole because i had no clear and had to use regular therefore i didn't want the colour to change too much from white. The colour barely changed with the quarter teaspoon and its still as sweet and flavourful as any other fondant. I kept mine in the fridge overnight.\nJust a tip; let sit out of fridge for about 5-10 minutes before handling. Stuck perfectly and smoothly to a lightly iced cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Brittney Ann"
},
"reviewBody": "If you're looking for a good fondant recipe, then don't try this. Way too greasy and it rips easily. It tasted alright, but I had to throw it away (was not salvageable) because I couldn't even get it on the cake it kept ripping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Virginia Barber"
},
"reviewBody": "Don't waste ur time!!!!!!!!... this is the most awful recipe I have ever followed in my life!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Hallena Hinkle"
},
"reviewBody": "When looking for a fondant alternative I stumbled across this recipe. I gave it a go and realized that the more you knead it, the more the oil from the shortening leaches out. The rolled buttercream can't hold up under moderate heat and lacks the \"stretch\" factor that traditional fondant has. Rolled buttercream also lacks structural integrity and I wouldn't suggest using it on anything you hope to pass off as professional. This is okay for something as small as a cupcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikayla"
},
"reviewBody": "Hello I'm 14 and made this and it worked really well. I made shapes out of it for bio class and it worked really well. At first it was greasy but I put it in the fridge and it worked out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Poore-Jennings"
},
"reviewBody": "tasty! More difficult to handle than regular fondont though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAnBfflo"
},
"reviewBody": "I made this recipe exactly as shown, and (in my opinion) is the only edible fondant I've ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "toireanna williams"
},
"reviewBody": "The fondant did taste great but it was greasy I tried flour to it and it did finally do as it was suppose to I think the grease should be cut in half though but I like this recipe other wise"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TXBaker2014"
},
"reviewBody": "Lots of trouble with this recipe. It was NOT easy. Very greasy, and continued to absorb gobs of sugar, corn starch, and flour trying to get it to firm up. I wondered if the shortening should be cut in half? It was oozing shortening. Maybe my room temp was too high (80)? Took hours to get it right, but it did finally firm up with tons of flour added while rolling. Like others have said, I did also use wax paper to roll it out, as well as a silicone placemat-- worked great to fold it onto the cake afterwards. A little saggy after I pressed and dusted it, popped it into the fridge without any cover, and it firmed up nicely overnight. I would try another recipe next time. Surely it's not this hard to make your own fondant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bluerider"
},
"reviewBody": "Definitely delicious! I reached the \"silky play dough\" stage around 1.5lb sugar, and should have stopped there. I stayed true to the recipe and used the full 2lb. Probably why I had so much cracking :( I'll make this again! Check out youtube vids on fondant marbling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Colette 'Roxanne' Maimone"
},
"reviewBody": "I made a couple adjustments, one because of ingredients I didn't have, and another because I had read other reviews and was trying to think about how to overcome some shortfalls of the recipe as written. First, I used honey in place of the corn syrup, because of not having the latter. It's a well-established substitution, so I doubt anything fundamental changed about the outcome because of it. Second, after I added the amount of confectioner's sugar called for, I began to add flour until the desired consistency of the dough was achieved. I think it absorbed some of the greasiness better than continuing to use sugar. True, it was still a bit greasy, but plenty workable. This was my first time using fondant or anything like it, so I won't pin down any flaw in my cake decor on the recipe, rather on my inexperience. tl;dr recipe worked just fine, but isn't superb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Willow Sullivan-Skotko"
},
"reviewBody": "this fondant is so greasy yuo can barely use it not only was it greasy but it cracked fell apart and stuck to everything i tried all the tips shown in the reviews and nothing helped i let it set for two hours i even tried refrigerating maybe in a dryer climate than where i am would make this better but as it stands i won't be using this recipe again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RaeAnn Clark-Edwards"
},
"reviewBody": "I have been reading the reviews on this recipe and am game to give it a try... I see that is serves 45.... OK, so how does this break down to serving size for an 8-9 inch round double layer cake or 2 8X8 square pans.... you get the idea thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ZeeQ"
},
"reviewBody": "The consistency for this fondant is too greasy and keeps falling apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nordia Henriques"
},
"reviewBody": "It tasted good but was to difficult to handle it cracked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeani"
},
"reviewBody": "I can see this going well on a cake, it was a perfect consistency even when rolled thin. I followed this recipe exactly with no problems. I've seen this type of coating before and wondered what it was. But now I would have no trouble making it again as well as coloring it. VERY Satisfied."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amber Graham"
},
"reviewBody": "I am SO very glad that I used this recipe on my \"practice\" cake for my son's first birthday. I read the poor reviews and thought that if I were really careful and followed the advice of the people writing good reviews that I could make it work. WRONG!! All of the things that other people are saying are 100% true - too greasy, impossible to get onto the cake and non-recoverable with more sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ziffer"
},
"reviewBody": "Easy to make and tasted great! Good recipe for aspiring kid bakers. Enough for 3 or more colors to make awesome creations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Picky Eric"
},
"reviewBody": "Ill stick with store bought"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CaKe!"
},
"reviewBody": "looks easy but I've never made or used fondant before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jhddock1"
},
"reviewBody": "I made this strict to recipe, but I added food coloring to make it blue. I'm not sure if that caused an imbalance somewhere, but the fondant ended up either too greasy to roll or fell apart as soon as I tried to put it on the cake. It tasted great, but I'm going to stick it in the fridge overnight before trying again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "chihaya"
},
"reviewBody": "Too greasy, too soft, hard to mold shapes. not really good for decoration."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "alviciar"
},
"reviewBody": "I did not care for this recipe. i have a customer who needs fondant without the use of gelatin, so i thought i would try this recipe again.i have made three different batches using all of your recommendations and it just won't firm up and it keeps tearing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "purrplekitti"
},
"reviewBody": "This came out very greasy.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Irma Didllana Escobar"
},
"reviewBody": "the worst recipe i have tried. kept tearing. so crumbly at first. then very soft but kept cracking when kneading."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivette"
},
"reviewBody": "Easy to prepare and it cost less to do it yourself instead of buying the one that is already made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KellyLynn"
},
"reviewBody": "This fondant does not handle very well. And yes! It's very greasy. It does not have the pliability to handle covering a cake well. It does not allow you to roll it out very thinly, but its good for making on cake applicaes. And it does taste much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Leigh Anne Brown"
},
"reviewBody": "It gets a tad crumbly as you add more powdered sugar to put it on a cake. Since you put a buttercream crumb coat on anyway, fold in about 2 tablespoons of that buttercream and you have a more elastic, easier to manage fondant!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "C S"
},
"reviewBody": "Wanted to try something other then my go to marshmallow fondant...BIG mistake! Made marshmallow fondant after all. I would not recommend this if you like a firm fondant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Baehm"
},
"reviewBody": "I made this for my sisters birthday cake a day ago and it was the first time ever making fondant and It came out perfect. It tasted a lot like butter cream frosting but really sweet but not as bad as some people said it was going to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dreya"
},
"reviewBody": "It was too greasy and would either stick to my rolling pin or stick to my smooth surface."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liajna"
},
"reviewBody": "This recipe was quick, easy and saved me lots of money on having to buy fondant. Most importantly it taste way better than the store bought fondant. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "berrimp"
},
"reviewBody": "I have been in search of a fondant recipe and I found it!!!!!!!! I only made half at first cause I have wasted a lot of sugar and shorting and corn syrup etc... making fondant. this one worked great and 1/2 was enough to cover the cake I am making. thanks so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shrezlatiana_99"
},
"reviewBody": "Good recipe but you could substite the vegetable shortening with unsalted butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Faaiza Saif"
},
"reviewBody": "Greasy when rolling out. I think it was because of the shortening. I had used vegetable shortening. i wouldn't suggest it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emi768"
},
"reviewBody": "Very easy for my first attempt at making or even using fondant! I cut out small shapes to decorate cupcakes. Can't wait to try and cover a cake with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "This_is_me"
},
"reviewBody": "It was okay but it had a really salty taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fyrlys"
},
"reviewBody": "This is REALLY easy to make, and it's fairly easy to work with. I couldn't get it to roll out right on its own so I rolled it between two sheets of wax paper. My kitchen is kind of hot so before I put the fondant on, I popped it in the freezer till it was more firm. As far as the flavor, I liked that it took salt since that gave it a little more taste than pure sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BrittanyD2214"
},
"reviewBody": "I LOVE THIS!!! Have never used fondant before and it was amazing!!! I used a rolling pin to roll out up and get in on my cake, worked perfectly!!! Well be using this for the rest of my life!!!! :) :) :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Tastes great, but very greasy and soft. Trouble holding sculpted shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kenyshasmith"
},
"reviewBody": "Amazing! I will never make birthday cakes the same again. My son trey wanted a Jake and Neverland pirate cake....I always make our cakes but when making my own icing it would always bleed or blend the picture. Found this recipe and loved all the tips everyone wrote helped ALOT: rolling f.icing in between 2wax papers making it easier to roll flat and not stick. 2. Use Betty crocker Gel colors cake decorators in order to dye the icing . I made fondant then divided in bowls and added colors needed in each bowl. 3. Take time don't rush! I stayed up until 3 am. All kids sleeping plenty of time to work. Love this recipe and way it makes cake look smooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Seerat Qureshi"
},
"reviewBody": "It tastes just amazing! I have tried it 4-6 times but it becomes very oily and cracks a lot when i roll it on to the cake. I tried using extra icing sugar, some cornflour and also tried to roll it on the wax paper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "evilobaker"
},
"reviewBody": "I did not care for this recipe. It kept cracking, and was to oily. I could not even get it off my work space with out it ripping, no matter how much sugar I put under it. I eventually got it on the cake but, it was cracking and lumpy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sweetmajestic27"
},
"reviewBody": "Made the fondant. greasy could taste the salt and kept breaking apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Nuesse"
},
"reviewBody": "This is a great recipe! Only a couple things I added 1/2 tsp butter flavor &amp; 1/2 tsp of almond flavor. I've also found the best shortening for icings is the cheap walmart brand shortening (not the vegetable) it doesn't leave a greasy after taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melbee"
},
"reviewBody": "NOT a good recipe if you are trying to cover a cake entirely. I could barely get off working surface without it falling apart. There is no strength or elasticity to this \"fondant\". No matter how long you let rest, place in fridge or adding extra sugar- it does not help. Stick to small cut shapes and decorations with this recipe. Dies taste better than traditional fondant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasmin"
},
"reviewBody": "Great! My first cake useing fondant very easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becca1324"
},
"reviewBody": "This worked AWESOME!I added blue and pink coloring and made my little girls b-day with this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Mosley/Columbus, Ohio"
},
"reviewBody": "This recipe was very easy to follow &amp; came out perfect! I had.never made nor worked with fondant before &amp; you would have never known ;) I will be using this recipe throughout my baking career FOREVER!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "merdelwalter"
},
"reviewBody": "I did not care for this recipe. I ended up using a buttercream frosting instead of fondant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Fleet"
},
"reviewBody": "This frosting was easy to use and tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britteny"
},
"reviewBody": "I love this recipe it worked so well and so much easier then marshmallow fondant especially for a beginner like me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mbrenn"
},
"reviewBody": "As other reviews have said, this fondant was very greasy. The taste was good, but I will not use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Baking34"
},
"reviewBody": "This doesn't taste like buttercream fondant. My family just took it off. Made this other fondant. It was gone as soon as I could say \"banana\". Just letting you know what I think"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndieB"
},
"reviewBody": "I loved this recipe! It was really fast and super easy! I did not have any clear vanilla so I just used regular vanilla. That worked too. I used the fondant to create little leaves and stems for my apple cake pops. I made the leaves and stems and then refrigerated them for about 5 minutes. Then, I put them on the cake pops. The whole process took me less than 20 minutes start to finish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mich"
},
"reviewBody": "Not that good, had to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carone"
},
"reviewBody": "Tasty! Everyone always loves it! Not hard or dry like some I've had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sara8342"
},
"reviewBody": "I do really like this recipe! There is a fine line though between it being too greasy, and then cracking if you add too much sugar. This fondant makes it easy to mend areas that have cracked since it is so soft, but because of the softness you just don't get the firm clean look of regular fondant. If you are going for a very clean and even look you may want to chose a different recipe. If taste matters to you more than look (it usually does for me :)) then this is the recipe for you because it tastes ten times better than regular fondant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did not care for this recipe. I want to make a fondant cake for my daughter but it was so greasy, unable to fold, always crumbled and I did not care for the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cdander2"
},
"reviewBody": "This recipe did not work for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Keane"
},
"reviewBody": "I agree with the reviewers that said this comes out a little greasy. I think if you really know what you're doing, this isn't a great recipe. If, however, you're a newbie, the \"greasiness\" allows you to work with the fondant a TON, which can be a good thing. I was able to incorporate a lot of powdered sugar as I worked with this and figured out exactly what I wanted to do. Overall, it really is okay, but I'm going to look for another recipe for next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sookie Fae Halliwell"
},
"reviewBody": "Very disappointing. Even after coloring it dark green it had a white film on it. I added a TON of sugar (another half almost!) and then it was crackly. Not pretty, and not tasty. My son gave me a pitty \"it's good.\" but I could tell he just didn't want to hurt my feelings. I couldn't roll it this enough because it was flaking apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SixPoundSkillet"
},
"reviewBody": "Thank you for a fondant recipe that doesn't require expensive chemicals. I wasn't able to wrap it around my rolling pin per the video, so I rolled it flat onto a cookie sheet, chilled for 5 minutes, and flipped upside-down onto my cake. I found it easier to do larger shapes than details, this fondant wants to go jagged if you're not doing straight lines or using a cookie cutter. Overall, I am grateful for this simple recipe designed for those of us who don't rely on gizmos and gadgets and chemicals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sweth"
},
"reviewBody": "I did not care for this recipe. It was so greasy and ripped every time I tried to use it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkrystyan"
},
"reviewBody": "I have used this recipe for the past 3 years to make my daughters birthday cakes. The only thing I can say is that the fondant tastes so yummy that i have to hid it from my husband or he eats it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jonidlg38"
},
"reviewBody": "No matter how many times I kneaded the dough, it still broke apart once I rolled it out and tried to lay it on the cake. I think it asked for way too much shortening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Bettelyoun"
},
"reviewBody": "Loved it!!! Definetly will use this over and over again. My daughter went nuts over it on her bday cake, and my family loves it too. Its quick, simple and fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Fruitchannel"
},
"reviewBody": "The fondant didn't taste like buttercream frosting to me, it tasted a little weird. It is easy to use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Six Little Feet"
},
"reviewBody": "I have previously used marshmallow fondant with great success. My daughter is not a fan of the taste of that though so I used this recipe.BIG mistake. It is greasy and fall apart to easily. There was no way to decorate a four layer cake with it. It is like play-dough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BBQMAN"
},
"reviewBody": "A fondant that doesn't taste like play dough. Fantastic to work with and incredibly cheaper to make than most recipes I have tried previously. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this recipe and it did not come out correct at all! It was way too greasy and it just fell apart when I tried to move it to the cake. One second I would be rolling it out and adding a little powdered sugar at a time to try to get it to stop being sticky and greasy but it seemed like what ever I did nothing would help. I am not super experienced in fondant but this was really bad. On the brighter side it did taste very similar to buttercream frosting, so if you can get it to work for you then more power to you and a good tasting fondant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B7family"
},
"reviewBody": "Exactly the look I wanted and even taste great!! I did tweek the recipe and used butter flavored shortening because it was all I had. My kids love buttercream frosting but I wanted the look of fondant. I JUST started baking 'pretty' cakes and I will keep using this recipe. -Tif"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cakelady13"
},
"reviewBody": "This recipe didn't work for me and I'm a professional baker. It was so soft and sticky I could not use it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "krystalgurrola29"
},
"reviewBody": "This was my first fondant cake and it really didnt taste that great i was really hoping for the buttercream taste and it didnt taste like buttercream. I did like that after needing it for a while that it was very easy to use. i didnt like that it was so greasy but it did give it a great shine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bloodymouth"
},
"reviewBody": "Just made this recipe. It was very easy to make but I don't think it tastes like buttercream, it tastes more like divinity. I like divinity but was disapointed as I was expecting a buttercream flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan F"
},
"reviewBody": "This is exactly what I've been looking for!! For years, I've made the Allrecipes Best Rolled Sugar Cookies recipe in combination with a basic buttercream (butter + shortening + vanilla + confectioner's sugar + a splash of milk). While the flavor was always fantastic, it has always bugged me that I could never get a smooth and neat looking cookie like with fondant. Plus, the buttercream never sets, so the cookies weren't stackable.\n\nEnter this new Buttercream Fondant recipe. This has the flavor of buttercream and the moldability of fondant! I found that I was able to roll the fondant pretty thin, and use my cookie cutters to get the exact shape of the cookies, and then just place them on top of the cookie with a thin layer of traditional buttercream underneath to help it stick. I took the advice of several reviewers and used half butter and half shortening for better flavor, and added food coloring while combining the corn syrup/butter/shortening. \n\nA few times, I had trouble lifting the fondant onto the cookie without it being a little flimsy and tearing. I found that it helped to work on a sheet of parchment paper on a cutting board, so I could stick the whole thing in the freezer for a few minutes first, making it firmer and much easier to pick up and move onto the cookies. I only found it to get greasy after handling it a lot.\n\nMy taste testers seemed pretty impressed by my new fancy stackable cookies! I'll be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "garzars"
},
"reviewBody": "I followed the instruction, and it came out very greasy. I would add more sugar, and it would look good, then I would roll it...greasy all over. It was a pain and a half to put on the cake. The fondant began to rip. The only thing it had going for it, is the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "trekkie"
},
"reviewBody": "I did use only 1/2 cup of shorting like other people have said. It tasted great, but I had a hard time putting it on the cake which is why am giving it 4 starts; it was easy to fix it just toke a lot of time. It was not greasy at all. The only other problem that I had was coloring the fondant. I will use it again. \n\n I did double the recipe because I made a 4 tier cake that where the cake size is 9 inches each."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bianca Zahedi"
},
"reviewBody": "I did not care for this recipe. I didnt like it, it tasted good but it looked like a big glob of bubblegum. At first I thought it turned out great. I wrapped it up &amp; put it in the fridge for a few days before I made the cake. But when it came time to use it it was so greasy. It would not roll out, I spent 3 hours trying to fix it. I added confection sugar to try &amp; make it less greasy &amp; pliable to no avail. Desperate to fix it, I even tried to incorporate melted marshmellows which actually helped alot. In the end I got the top of the cake covered, the rest tore off the edges. My cake turned out alright, I improvised, but I was dissapointed with the fondant itself. It was my first time so it could just be I need practice, but personally I will try a marshmallow fondant next time. It did taste good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smellyprincess"
},
"reviewBody": "my first time with fondant. i ended up adding an extra half bag of icing sugar to get rid of the greasy appearance. i've never actually tasted fondant so i couldn't tell you if it turned out properly. to my husband and i, it tasted like candy corn (the orange, yellow and white candy you get at halloween). it was really easy to use,especially with a fondant roller so that i could make sure that the thickness was even. i found that using it with chocolate butter cream icing on a chocolate cake was way too sweet, but i'm definitely going to make it again to use to decorate sugar cookies. i think it will be perfect for this and lessen the amount of the time it takes to decorate. i'm also excited about using it to decorate the gingerbread house at christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paloma"
},
"reviewBody": "I used this recipe to make fondant for the first time ever, I got great comments on the taste, everyone ate all the fondant on their slice (which is great because fondant usually has a weird after taste) that's not the case with this recipe. The only problem is that I found it very hard to handle, it kept tearing apart and it was too greasy, next time I'll use less shortening for sure, hopefully that will make it easier to handle too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gabinator4"
},
"reviewBody": "Not usually a big fondant fan, but this is very easy to make and use, and tastes good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Uj"
},
"reviewBody": "Greaat Recipe! I ran out of confectioners sugar so I used flour instead to keep it from sticking! But it worked just as well! I will upload a picture also! The pink one with the bow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "klhalma"
},
"reviewBody": "It is really hard to work with. I had a lot of trouble draping it over my cake. I kept getting holes in it, so I had to roll it thicker, but then it just weighed down my cake and made it look frumpy. Wish it were stiffer. I tried more confectioners sugar to stiffen the fondant. Adding more sugar made it fall apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Destiny Maxwell"
},
"reviewBody": "Too Greasy. I couldn't roll this out at all, and I even tried adding LOTS more sugar. I ended up using my usual fondant recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "GaufresBrules"
},
"reviewBody": "This recipe just did not turn out. The first time I tried it, it was very greasy, despite chilling it before use, and when I tried to pick it up after rolling it, it completely fell apart. The second time, it was more pliable and not as greasy, but the same thing happened. I'm not sure if it's something I did or it's hust this recipe or what."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/93157/rolled-buttercream-fondant/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
"name": "Frostings and Icings"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2417/desserts/frostings-and-icings/fondant/",
"name": "Fondant Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/93157/rolled-buttercream-fondant/",
"name": "Rolled Buttercream Fondant"
}
}
]
}
}
, "about": [
]
}
]