				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rosemary Shortbread Cookies"
,"datePublished": "2020-06-18T23:11:58.000-04:00"
,"dateModified": "2022-10-04T18:34:07.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Abigail"
,"url": "https://www.allrecipes.com/cook/1333449"
}
]
,"description": "A very Victorian recipe! The flavor improves with age, keeping for about a week."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/maN3S6RyZAt31qn_DswkCBbFgcI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/756527-rosemary-shortbread-cookies-CookinBug-4x3-1-209e0bc8e1524d6ea7574f7b45d08c2b.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rosemary Shortbread Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "194"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "118 kcal"
,"carbohydrateContent": "11 g"
,"cholesterolContent": "20 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "17 mg"
,"sugarContent": "4 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT80M"
,"recipeIngredient": [
"1.5 cups unsalted butter",
"0.66666668653488 cup white sugar",
"2 tablespoons chopped fresh rosemary",
"2.75 cups all-purpose flour",
"0.25 teaspoon salt",
"2 teaspoons white sugar for decoration" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the butter and 2/3 cup of sugar until light and fluffy. Stir in the flour salt and rosemary until well blended. The dough will be somewhat soft. Cover and refrigerate for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees F). Line cookie sheets with parchment paper."
} ,{
"@type": "HowToStep"
,"text": "On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into rectangles 1 1/2x2 inches in size. Place cookies 1 inch apart on the lined cookie sheets. Sprinkle the remaining sugar over the tops."
} ,{
"@type": "HowToStep"
,"text": "Bake for 8 minutes in the preheated oven, or until golden at the edges. Cool on wire racks, and store in an airtight container at room temperature."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT95M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used regular table sugar, didn't chill or roll dough. I just put mine through a cookie press and sprinkled with colored sugar. I baked them until edges were golden. The texture was light and delicate. I read somewhere that just smelling rosemary lowers cortisol levels (the stress hormone). So I made them for someone who was grieving. I put 2 half sticks of butter at a time, upright in ramekin in my microwave for 20 seconds on 40% power after leaving butter on counter for 3 hours. Perfect for blending with the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsKeeton"
},
"reviewBody": "These cookies were absolutely amazing. We made them for our Christmas cookie boxes and they were such a pleasant surprise. One thing that I am going to try this year is letting the dough warm up just a bit after being in the fridge before trying to work with it and roll it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Ann"
},
"reviewBody": "These taste delicious but they spread and didn't retain any shape for me when I baked them. Does \"white sugar\" mean \"confectioner's sugar\" or granulated sugar? I used granulated and it didn't go well for me. Maybe I'll try with powdered sugar next time, or a little more flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Alexander"
},
"reviewBody": "A Christmas favorite for me! I love introducing people to the subtle flavor of rosemary shortbread ! The recipe works well with lavender also!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Machelle"
},
"reviewBody": "A keeper. Made a batch with Lavender, another with Rosemary and am planning on trying one with Orange peel. I made these when my family was gathered for my dad's funeral, and they were promptly devoured even with a plethora of other dessert options."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MountainLovinGal"
},
"reviewBody": "Wow, these were absolutely delicious. I grow my own rosemary. Fun fact: rosemary is in the Evergreen family! Freshly cut, it's pretty strong, so I cut the amount to 1 Tablespoon, and it was perfect! I got rave reviews. They shipped well, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nadinepmcinnis"
},
"reviewBody": "I also had trouble making a dough despite using the full 1 and a half cups of butter. It was too dry. I resorted to adding cooking oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hawkwind 1980"
},
"reviewBody": "I only had 1 c of unsalted butter on hand, so I used one stick of salted as well as the two of unsalted and omitted the salt from the recipe. They turned out quite well, and they are very tasty with lemon curd spread on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "This is one of the best cookies I have ever made. The recipe is easy and the flavor is perfect. Great at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jo85celina"
},
"reviewBody": "Delicious I added the zest of 2 large mandarin oranges to mine. Really added to the experience"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "Simple and delicious, the kids and adults loved these cookies equally"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Blake"
},
"reviewBody": "Very good cookie. I agree with other reviewers on not cooking them too long. I topped them with a sprinkle of flake salt on my last batch. I also added double rosemary because I love rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon"
},
"reviewBody": "So good -- nice subtle rosemary flavor; not too sweet. (But don't forget the sprinkle of sugar on top -- I almost forgot &amp; put a bit too much, but still delicious.) Dough is sticky so need plenty of flour when rolling out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Thomson"
},
"reviewBody": "They came out great! I love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mariève MacGregor"
},
"reviewBody": "I made lemon zest sugar for the whole recipe and it balanced beautifully with the rosemary and smells like heaven! All you do is peel the yellow from the rind of the lemon (remove any white bits) and blend well in a food processor with one cup of sugar until well incorporated. It will take On the consistency of brown sugar. Use recipe measurements as indicated and the extra as topping. It’s super aerobatic and brought the flavour to another level."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashley michelle"
},
"reviewBody": "I made an account just to rate these cookies!! They are seriously delicious and my new favourite. Everyone loved them at the Christmas party as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krisinda Averette-Thomas"
},
"reviewBody": "These were fantabulous and turned out great! \nI had a friend give me a gift. Previously she’d mentioned she saw a recipe somewhere and these sounded good. \nI scoured the web and found a few recipes before settling on this one. \nThese are crisp on the outside, buttery melt in your mouth savory goodness!\nI made sure to chill the dough for a while.i only rolled into a log and sliced. Beautiful specks of rosemary. \nI usually don’t like savory but these were AmazeBalls! \n They would be awesome with a lemon glaze or lemon peel added. These wear fantabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "It's my favorite shortbread recipe, but when you make the dough, it's really hard and crumbly. In my experience, you have to add some milk before you can use it.\n\nI've made this about three times, but I like it best when I replace the rosemary with Chinese five-spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly"
},
"reviewBody": "Deliciosas!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Burk"
},
"reviewBody": "I rolled the dough into two logs, wrapped in parchment, then refrigerated for an hour. I sliced the cookies, sprinkled each cookie with very finely chopped rosemary/sugar mixture, and then baked for about 9 minutes. I took the cookies to a Victorian Christmas Open House; they were a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Kachur"
},
"reviewBody": "Easy to make and people rave about them. A delicious cookie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nematar"
},
"reviewBody": "I’m so glad this recipe is still on here! I found this one years ago and have been adding rosemary to my shortbread ever since. However, I have been experimenting with as many different shortbread recipes as I could get my hands on. And with every one I have tried I have been disappointed, thinking, ‘Oh— that original recipe was so much better!’ Then this morning I had a hankering for cumin shortbread cookies. I tried some store bought ones from a local Indian grocer recently and loved them, so I bought my own (whole) cumin seeds and on a whim decided to look up ANOTHER shortbread recipe, since none of the ones I’ve tried recently have been satisfying— and I find myself here! Thank you so much for this recipe ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy McBride"
},
"reviewBody": "Outstanding as written. Even better when you add the zest of one orange. Melts in your mouth. Frequently requested at church gatherings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Moncsi"
},
"reviewBody": "If you add a little less flour it will come out very delicate, spread thin and “fancy”. Easy and sophisticated receipt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Rebecca Plotnikoff"
},
"reviewBody": "Might wanna double check the temps! Just burned mine because both temperatures said Fahrenheit. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sukismom"
},
"reviewBody": "Wasn't sure what to expect but these are wonderful and not too sweet. I patted the dough into a 9 x13 pan and refrigerated before baking, then cut them into squares. Will certainly make again, thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carol Galayda"
},
"reviewBody": "They tasted fine but literally melted when baked. They didn’t hold shape at all. Came out fragile and broke apart."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis"
},
"reviewBody": "I, too, love rosemary and wanted a simple cookie to offset all the richer ones. Even though I was afraid to get hairy eyeball reactions from my crowd (Rosemary in a cookie??!), I was pleasantly surprised by how everyone loved them! I had a bit of trouble rolling them out, but next time I'll make them into logs and slice them. Much easier and not nearly as finicky as rolling into 1/4\" thickness and slicing into neat rectangles. I got every shape under the sun between rectangles, squares and circles. But that made them interesting. Also, I glazed them with a lemon glaze and that really put them over the top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sapphie"
},
"reviewBody": "I made this exactly as stated except I left the rosemary out and put on icing. These cookies are a MUST if you’re looking for soft sugar cookies that can be cut!!! For best results, roll and cut these cookies on parchment paper, or a substantial surface, before you put them in the fridge. Also, make sure you only bake for 8 minutes, so they stay soft. They turned out AMAZING and beautiful! As the recipe states, they get better with age. I put “Quick and almost professional buttercream icing” on top and Christmas sprinkles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gram nay"
},
"reviewBody": "Thank you to whomever realized there wasn't enough butter! I've been making these for years finding them very crumbly, no longer! I made a batch with Earth Balance butter for vegan friends, they were such a hit I had to give them all the recipe. The only thing I noticed is that the color was a little paler - but my friends don't know - shhhh :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacque Gutman"
},
"reviewBody": "These cookies are light and have a delicious rosemary flavor! I used dried rosemary and added an extra tablespoon. They go great with coffee or tea, and I will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette"
},
"reviewBody": "Everybody who tries these cookies loves them! I add a liitle extra rosemary, but the recipe is great as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Swanwick Conant"
},
"reviewBody": "I make this as written several times a year, my favorite cookie by a mile!!! It is nice that I have huge rosemary plants year round here in GA, fresh rosemary is definitely the way to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danny V"
},
"reviewBody": "Love this recipe for the savory flavor. However it blended up a bit too dry to stick together. I added a teaspoon of water to make it gel together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn H"
},
"reviewBody": "Made some red white and blue short bread cookies. I used Sage instead of Rosemary, and 1/3 cup brown sugar with 1/3 cup white sugar to add some richness. They turned out excellent firework cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mongolodge"
},
"reviewBody": "Great recipe. Both savory and sweet. I rolled into 2 logs wrapped them in plastic and put them in the fridge for 1hour. I then cut discs. I baked as directed. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chucker999"
},
"reviewBody": "I really like these cookies and the way the hous smells like the holidays when they come out of the oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elle00"
},
"reviewBody": "This recipe is easy and the results were great 2 tweaks, I rolled the dough and sliced it as per another reviewer’s suggestion NOr did I sprinkle the top with sugar I just prefer a less sweet cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenny"
},
"reviewBody": "Absolute perfection . Can be frozen, thawed, and enjoyed later too! Perfect recipe as is !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Tamura Guerrero"
},
"reviewBody": "I added a couple of tablespoons of lemon zest to give it a slight lemony flavor. I also used gluten-free flour once and it came out great, but a little easier to fall apart so I would suggest a couple of things: roll out the dough to at least 1/4 inch thick or even thicker and let them cool to harden on the baking sheet before transferring them to a serving plate. \n\nI've made this twice and everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heather h"
},
"reviewBody": "These were amazing!! I did add some lavender as well and the combo was dynamite. Defiantly going to make again really soon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fat Cats"
},
"reviewBody": "Great recipe! Simple instructions, basic Ingredients. We used lavender flowers instead of rosemary. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KateMay87"
},
"reviewBody": "These are fantastic and easy to make! I like to add almond pieces instead of the rosemary, but may try the herb version around Christmas. I roll out the dough and cut with cookie cutters, leaving them about 1/2 inch thick, then I bake for 10 mins. Makes about 28-30 cookies that way. Great no-fail shortbread recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve Coates"
},
"reviewBody": "I have made these a lot lately and they are never long going. People love the sweet and savory flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "editorinla"
},
"reviewBody": "The flavor is great, but I agree with others who have said the dough is unworkable. It was just pure crumble, and it wouldn't stick together. I think there must be something off in the ratios of the ingredients. I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shirley"
},
"reviewBody": "best shortbread ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "These cookies are so savory, buttery, and delicious!!! I added an extra 1/2 stick of butter because the batter was so dry. It was still fairly dry afterward but once you squeeze it into balls and work with it, it becomes much easier to shape into cookies. \nI used fresh rosemary and the cookies were heavenly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lindsy66"
},
"reviewBody": "Very interesting and unique cookie! It's a surprise on the cookie plate for sure. A little dry though. Would like to find some icing or glaze to try with it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny Williamson Milam"
},
"reviewBody": "These cookies are curiously addictive, and the rosemary flavor improves with time. I added a little almond extract to deepen the flavors, and the family loved them. They keep very well, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Tomko"
},
"reviewBody": "I tried this recipe for the first time and glad I ventured out of my chocolate cookie rut. Its has a really great rich flavor and everyone loved them. I followed the recipe exactly but the dough was incredibly hard to work with. It was so crumbly that I almost gave up but I'm glad I didn't. Next time I will try forming the dough into a log and cutting it into cookies after it's been refrigerated. I thought using a cookie cutter sounded more fun but these need to be small since they are so rich. Do yourself a favor and make these soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geni Taylor"
},
"reviewBody": "Excellent and easy recipe! I even made a gluten-free batch for a friend using rice flour on a 1 to 1 basis. Turned out just as tasty as the regular batch, just a little sandier - which was fine! As this is Christmas time, I did use cookie cutters. One thing I learned - if you have different sized cutters, put like sized shapes on the same tray. I found that if I mixed the sizes the smaller ones browned a little too much or the larger ones were a little undone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenbee"
},
"reviewBody": "I made the recipe as written and it was delicious. I will positively make it over and over again. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flo"
},
"reviewBody": "Really wonderful cookie. A bit hard to roll out, but work the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "This cookie will change your life! I couldn't settle on just rosemary, so I added lavender too! I also put a thin lemon glaze over the top and antique silver sugar crystals for Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "One of the best shortbread I ever made. It was a huge hit! A lot of peolple wrinkled their noses when I said the green stuff was rosemary but everyone ended up loving it and I gave the recipe to 10+ people. The recipe is perfect the way it is. DO NOT substitute the butter for anything else and use fresh herbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gracie"
},
"reviewBody": "Very tasty, a grown up cookie. I liked the richness and crispness so much that I used the same recipe and subbed lavender buds for the rosemary. A few of each in a pretty gift bag made great little Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allen brelig"
},
"reviewBody": "Easy to follow recipe and superb results. Might be more efficient to rollthe dough before cooling in paper for easy cutting but more fun to use cookie cutter. Had to add a couple minutes to bake time for edges to \"just start to brown\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PANGAEA"
},
"reviewBody": "Everyone loves these! The recipe is outstanding as is. However, if you would like a cookie that holds its shape better, use 3 cups of flour and 3/4 cup of sugar. I chill the dough a bit then roll into two logs (using wax paper) and chill until firm. The freezer works if you're in a rush. The logs tend to form corners so I just turn then every 10 minutes or so and they get pretty squarish. Then I slice and chill again for a bit, as suggested by another reviewer. Best cookies ever! Can't wait to try them with lavender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Jo 'Schmidt' Austin"
},
"reviewBody": "I ate waaaaaaay too many of these. Absolutely magnificent. After tasting the first batch, I put a little piece of candied ginger on each one. The little bit of chewiness in the middle of the buttery shortbread added interest, and the ginger combined beautifully with the rosemary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgarom29"
},
"reviewBody": "They were so delicious, will bake them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spicelove"
},
"reviewBody": "I followed the recipe exactly, and I was very happy with the results! Very tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghan Wakefield"
},
"reviewBody": "I was in a hurry, getting ready for the final Downton Abbey evening. I had promised a friend to bring shortbread and couldn't find my favorite recipe. I found this and was so glad I hadn't been able to find mine. It was divine, the hint of Rosemary subtle ,and everyone raved! Thank you\n\nI made it in a short bread mold, turned it out when it was nearly done and popped it back in the oven for a few minutes ,perfection"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niaomi"
},
"reviewBody": "I really enjoy these cookies, but the first time I made them, the dough barely held together, it was so crumbly. They still turned out delicious but it was a headache to get the dough to stick. The next time I made them I added a little less flour (like a tablespoonish) I added a tablespoon of water and the dough came together MUCH easier. It was still crumbly and stuck a bit more than you'd like to the rolling pin but nothing a bit of flour couldn't fix! Super good. I've used this recipie as a base now for Earl Grey Tea cookies and they came together just as well (subbed a tablespoon of vanilla instead of water in that case!)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KBJR"
},
"reviewBody": "These were outstanding! The rosemary gave them such a delicate flavour. This recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Sweet and savory. Loved it. I added a bit of almond extract, too. Good \"grown-up\" cookies or tea cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Kushnerick Powell"
},
"reviewBody": "Surprisingly delicious! I hate to roll dough, so just pressed it into an 8\"x 8\" and cut it into squares after cooking. This recipe will go into my family traditions file!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kerry"
},
"reviewBody": "I used dried rosemary...but halved the amount"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Had to add an extra 1/2 cup of butter to create any kind of a dough consistency...so that's a full two cups of butter. they're in the oven now turning to soup. The dough tasted good, they smell great, but it's a disaster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidilarson"
},
"reviewBody": "I love this recipe and I've made it several times. Everyone raves about them! I do add 1 little thing though-- a lemon glaze (lemon juice and powdered sugar). They are divine! \n\nI made the mistake once of letting the dough get un-chilled before putting in the oven. Boy, that was heartbreaking. It was a mess. I've learned my lesson and I roll the dough up in a long cylinder shape. Chill 1 hour. Then I cut it in to slices and then put it back into the fridge for another 15 mins. Then they go directly into the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine Mascott"
},
"reviewBody": "I made this for my Christmas cookie trays. They were unusual, but I thought they were a great tea cookie. I mixed in some finely chopped dried cranberries to the dough too and cut them with a tree shaped cutter. Looked very festive, old fashioned and pretty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Esau"
},
"reviewBody": "I made these with my own rosemary. Delish with a glass of chardonnay!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEMPHISBELLE"
},
"reviewBody": "Absolutely delicious! A shortbread is my favorite type of cookie; add rosemary and I'm in heaven! The cookies have a perfect balance of flavors with a few simple ingredients; and they smell divine! I found the dough extremely easy to work with as long as you chill it for an hour as instructed before trying to roll it out. For those who had issues with the dough, maybe the following will help. DO use a good quality UNsalted butter, as called for in the recipe, for two reasons: 1) salted butter has a higher water content (and thus lower fat content) than unsalted which can defininitely affect baked goods, especially cookies and 2) unsalted butter allows for more adjustment to the salt in a recipe as different brands of salted butters can have different (and unknown) amounts of salt. I feel like the amount of salt in this recipe, coupled with unsalted butter is perfect; but that's a very subjective opinion - others may prefer less salt flavor. When measuring flour it's important to spoon it into the measuring cup lightly and level it; otherwise you can wind up with too much flour since flour \"settles\" a great deal. When I creamed the butter and sugar together I did so for 6 minutes at medium speed on a KitchenAid mixer in order to get it to the right consistency, then slowly added the flour (already mixed with salt and rosemary) in several small amounts on \"stir\" just until mixed. Hope this might help anyone who had trouble with the dough. These cookies are too good to miss!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "emilyanne"
},
"reviewBody": "I had a problem with the dough not having enough fat in it. It was crumbly and did not hold together at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Damman Erks"
},
"reviewBody": "Made exactly as written. My 8 year old son loves them. I'm pretty impressed. It's the kind if cookie you won't eat twenty at a time but will crave a couple during the day. I can't wait to share with friends. I also felt very \"sophisticated and provincial\" while making them lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRH"
},
"reviewBody": "LOVED this recipe! I pressed the batter into a 8\"x11\" baking pan. After removing from the oven, I cut into bars in the pan. After they cooled, I cut through the same lines again. Then removed the bars and served!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brown eyed girl in NC"
},
"reviewBody": "The reviews are right, this recipe is easy and the result is delicate cookies. Use the BEST (85% btr fat) butter you can find since it's a big part of this recipe and you want lots of crisp.\nI simply mixed everything in the stand mixer with the whisk then the paddle for the flour addition.\nEasy peezy rolling, put not hardened all the way dough between two sheets of parchment then roll to your thickness,put on a cookie sheet then back to the fridge until you feel like cutting them.\nI use Maldon sea salt flakes, more delicate salt than kosher(you'll increase the salt by a pinch) and instead of sugar on top of the cookies I sprinkled with a small touch of the salt flakes.I let my dough chill overnight since I wasn't in a hurry and just experimenting.\nIt took coaxing to get my family to try these( no chocolate chips ya know) but they just loved them. Definitely a great addition to any savory snack platter you'll make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bascha"
},
"reviewBody": "It is a tradition in my house, for me to make rosemary cookies every season!!! Even my Aunt that does not like rosemary loves these!! Great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Serenity2009"
},
"reviewBody": "Not sure what I did wrong but they just fall apart. Basically wasted all those ingredients. Not happy at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alexa"
},
"reviewBody": "I loved it! I would recommend it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ClaudiaR"
},
"reviewBody": "I made these cookies for my daughter's wedding dessert bar and everyone loved them! I have made them several times since then and they always turn out well. Thank you for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VarsityQuidditch"
},
"reviewBody": "This recipe was a huge hit at a yearly get together this year! It will become a part of the tradition. So yummy and easy. We ate them with a bottle of red wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cabakergirl"
},
"reviewBody": "I've made this twice now, and it's a favorite! I made it once with some lemon glaze on top, and once plain just as the recipe describes. Both are delicious - without the glaze they are perfect with tea or coffee because of the texture. I LOVE these cookies! :) They always impress because they are so unusual for most people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina McMahon"
},
"reviewBody": "I made these for a meeting. Only adults where there. Everyone loved them. A great cookie for adults. I followed the recipe exactly and they turned out great. I rolled them out and used a leaf cookie cutter. Perfect for the cool fall nights."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadyGodiva"
},
"reviewBody": "I followed the recipe as it is posted, with the exception of the rosemary (I excluded that ingredient). Oh, I also add a small amount of Almond Extract :) I found the batter/dough easy to work with whether you are using a cookie cutter or just taking a scoop and flattening them out. This is a great recipe, it easy to make, and you'll get great results. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "madamedetreymes"
},
"reviewBody": "These are delicious and very popular. I followed the recipe exactly, but like many, opted to roll the dough into logs and wrap them in saran wrap before chilling. Then I sliced them to about 1/4 inch thickness and left off the decorative sugar because I like the texture of shortbread on its own. They were ready in 11 minutes in my oven. You should take them out when they're golden brown on the bottom and white but dry on top. The texture of these cookies is awesome; they're slightly soft as opposed to crunchy, which is exactly what I was looking for. I've tried them with lavender and lemon also, but I prefer the rosemary personally. To anyone having trouble mixing the dough, just keep at it, and don't be afraid to mush it up with your hands if the spoon isn't doing the trick. Eventually it will reach a good soft dough consistency. You should also start with butter that's softened to room temperature. I tried to rush it with cool butter once and it was very hard to mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindyg"
},
"reviewBody": "great with the rosemary. I also tried them with Herbs de Provence and chopped up candied ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "qayaqgirl"
},
"reviewBody": "I ran out of white flour, so I had to sub about 1/2 white whole wheat, but I didn't actually think it adversely affected the flavor, just found that they needed to bake 13 min to get lightly browned. I found the cookies a little too subtle. I did a trial batch where I sprinkled small amts of coarse salt on top and that just gave the cookies an extra POP. not too salty either. I def will repeat these cookies with all white flour but every batch will have coarse salt on top. try a few, you'll be glad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori K. Bogren"
},
"reviewBody": "Very nice! Followed the recipe to a t. Will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdicaArethusa"
},
"reviewBody": "I made these over Christmas, and they were great. A lot of people really liked them. I want to try making them with different herbs. Maybe lavender or lemon balm. The flavor really did improve after a few days. I followed the recipe, except I rolled it into a log, refrigerated if for a few hours, and cut the log into 1/4 inch slices. This is much easier than taking out the rolling pin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jamieboeh"
},
"reviewBody": "I have never put a review on allrecipes until I made these cookies! I had an overabundance of fresh rosemary from my garden and was desperate to use it up. I figured that if these cookies weren't good (Ok, so I had an opinion before I made them), I would throw them away. THESE ARE AWESOME!!! The rosemary isn't overpowering like I thought they would be. Very surprising and delicious. Btw, don't alter the recipe because it is PERFECT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "XXXNAUGHTY"
},
"reviewBody": "Really good. Can't go wrong with shortbread. I did make a few adjustments: used 1 tbsp of fresh rosemary (all I had on-hand), the zest of 1 lemon, and subbed 3/4 of the AP flour with whole wheat. Delish. My manager loved it! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lovin' it"
},
"reviewBody": "These are ok. No one but myself liked them. I will not be making them again simply because I do not need to be eating a whole batch of cookies on my own. The dough was crumbly and hard to handle for myself. I thought I had followed the recipe to a T but potentially something was wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookinBug"
},
"reviewBody": "Very nice, delicately flavored cookies. The only thing I did differently was to use a small cookie cutter on them, just to make them a little more festive. Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelsiekrocker"
},
"reviewBody": "These cookies are fabulous! So easy, melt in your mouth delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "camillafig"
},
"reviewBody": "These cookies are super tasty! They are a nice change from your ordinary cookie. Only thing I would change is the amount of sugar that goes in them. They were a little too sweet but still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebekah Arcega"
},
"reviewBody": "A delicious twist to the shortbread cookie. I made these for a dinner party and everyone thought I had bought them from a fancy bakery. There was one person in the party who didn't absolutely love them, but then, he doesn't particularly care for shortbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mellowlovestocook"
},
"reviewBody": "A lovely delicate aromatic cookie! The only change I made was instead of the decorative sugar I gave each cookie a half dip in white chocolate. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Pearman"
},
"reviewBody": "I had lost my recipe for Basil shortbread...this works perfectly plus try adding just a touch of lemon zest only about 1 tsp.\nRAVE compliments....people do like something different some times...I served these at a ladies tea party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "starrynite"
},
"reviewBody": "I was a little concern about herb cookies since I had never tried before, but these turned out great! I brought them for teacher appreciation week luncheon few weeks ago, and it was a hit:) Few teachers even asked for recipe. The only change I made was shaped the dough to a long log and refrigerated for more than 2 hours to make it easy to cut without getting too soft."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/84205/rosemary-shortbread-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
"name": "Cut-Out Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/84205/rosemary-shortbread-cookies/",
"name": "Rosemary Shortbread Cookies"
}
}
]
}
}
, "about": [
]
}
]