				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rugelach"
,"datePublished": "1998-01-07T14:48:59.000-05:00"
,"dateModified": "2022-07-14T16:12:04.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jackie"
,"url": "https://www.allrecipes.com/cook/24323893"
}
]
,"description": "I have many rugelach recipes, but this is truly the best I have ever made."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/11YAji_V0LboA6Qxqc5IXgWRWT0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/516810-150f71bdd12c4cdf938249244478e784.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2310774869001",
"description": "See how to make traditional rugelach with walnuts and raisins.",
"duration": "PT4M29S",
"name": "Rugelach",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/f6fdb0d0-d78e-468a-9f15-23d5fff0fb83/7ae38e73-101d-46b2-8048-350dc3a6a6de/1280x720/match/image.jpg",
"uploadDate": "2021-07-10T15:35:39.814-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rugelach"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "302"
}
,"cookTime": "PT22M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "101 kcal"
,"carbohydrateContent": "8 g"
,"cholesterolContent": "16 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "28 mg"
,"sugarContent": "3 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT55M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.25 teaspoon salt",
"1 cup unsalted butter",
"1 (8 ounce) package cream cheese",
"0.33333334326744 cup sour cream",
"0.5 cup white sugar",
"1 tablespoon ground cinnamon",
"1 cup finely chopped walnuts",
"0.5 cup raisins" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cut cold butter or margarine and cream cheese into bits. In food processor pulse flour, salt, butter or margarine, cream cheese and sour cream until crumbly."
} ,{
"@type": "HowToStep"
,"text": "Shape crumbly mixture into four equal disks. Wrap each disk and chill 2 hours or up to 2 days."
} ,{
"@type": "HowToStep"
,"text": "Combine sugar, cinnamon, chopped walnuts, and finely chopped raisins (may substitute miniature chocolate chips for raisins)."
} ,{
"@type": "HowToStep"
,"text": "Roll each disk into a 9 inch round keeping other disks chilled until ready to roll them. Sprinkle round with sugar/nut mixture. Press lightly into dough. With chefs knife or pizza cutter, cut each round into 12 wedges. Roll wedges from wide to narrow, you will end up with point on outside of cookie. Place on ungreased baking sheets and chill rugelach 20 minutes before baking."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (180 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "After rugelach are chilled, bake them in the center rack of your oven 22 minutes until lightly golden. Cool on wire racks. Store in airtight containers...they freeze very well."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/11YAji_V0LboA6Qxqc5IXgWRWT0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/516810-150f71bdd12c4cdf938249244478e784.jpg"
}
]
,"text": "Variations: Before putting the filling on the dough, use a pastry brush to layer apricot jam as well as brown sugar. Then add the recommended filling. You may also make a mixture of cinnamon and sugar and roll the rugelach in this prior to putting them on the cookie sheets."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT197M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Emily Cedeno"
},
"reviewBody": "I don't have a food processeur. I'm basic. This recipe is good, but not authentic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is without a doubt the absolute best recipe I have ever used to make these!!!!! I use seedless raspberry jam and mini chocolate chips for filling and use the back of a spoon to lightly press the chips into the dough. Instead of rolling into a circle, I roll this into a rectangle, add filling, and then cut in half and then cut in strips and roll them. Less filling comes out and it is much easier and less mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fabulous! Hint (learning from experience) chill everything! Chill the cut up butter, cream cheese and sour cream, chill the knife you cut with, even chill the food processor parts - keep your hands cool; and distribute the dairy items in the processor putting some flour on the bottom and more over the dairy. I have a medium size processor so I do half of the mix at a time leaving the first half in the fridge while processing the second part. Cold everything is key to getting the crumble. Yummy!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saralengelishere"
},
"reviewBody": "Fantastic! Literally the ONLY rugelach recipe one needs :) I did a date/nut/brown sugar, and then I piped out dark chocolate stripes on top …. And then because I had leftover pears I half cooked in the stovetop a basic apple (sub pears) pie/butter/cinnamon/walnuts and lots of fiber mixture and then filled my regulach with that. Highly recommend to try with any fillings. I love this recipe. Thanks mama! (The ones picture follow the recipe exactly, except I am terrible at rolling crescents … BUT!!! U can really see the flakiness I of this beautifully forgiving pastry cookie whatever crust :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "This was my first time to make these delicious cookies. I prepared the dough the night before like suggested and what a great time saver. I rolled these out and baked early this morning. Wow! My house smelled so good as they were baking. I had to try one once they had cooled down and it did not disappoint. I know I had these before, I thought it was my first time trying them but I know I have them before with apricot jam or something similar..... this was truly a great recipe. I will make these again! Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "blackhighheels"
},
"reviewBody": "Very rich pastry; very bland overall cookie. This is the first time I've had rugelach. It didn't live up to the hype for me. If I'm going to spend this much time making a cookie, it is going to be time spent making something much more flavorful than these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathryn M Donnelly"
},
"reviewBody": "I'd give it 5 stars, but I tweaked the recipe and combined it a bit with a Martha Stewart recipe- added just shy 1/2 cup of sugar and 3 egg yolks to the dough mix. Used both apricot and blackberry preserves. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shan"
},
"reviewBody": "This is my go-to recipes. I follow it exactly but add a step to make this an A plus- I sprinkle sugar or cinnamon sugar across the top before baking. It gives it an extra nice little crunch. Some variations I have tried are: mini chocolate chips (no additional sugar necessary), apricot jelly and currants (sugar on top), pumpkin butter, and cinnamon (rolled in cinnamon before baking). Super fun to experiment further"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kara"
},
"reviewBody": "Such an easy and delicious recipe.. no changes were made perfect just as is.. I found that the longer the cookies chilled the better the outcome. This is def a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kashish Food"
},
"reviewBody": "The dish is very attractive and the recipe is easier than that. Thanks for sharing with us. I will definitely try it at my home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rick"
},
"reviewBody": "Alright, I had a problem and I have no clear idea as to the source.\n\nThe first time I made the dough, I had to thaw the butter. I also used a slightly-too-small processor (the blade jammed). Still, the dough came out fine.\n\nI got a new processor and made this 3 times with butter right out of the frig. The dough looked crumbly, but rolled horribly, with sugar or flour. The more I tried to fix it, the worse it turned out. Another recipe suggested doing a bit of kneading before dividing, but that didn't help. I chilled it longer than 2 hours, to no avail.\n\nI saw that someone thought that the dough was pulsed too long, so I wonder if the more powerful processor is the source.\n\nI'm open to suggestions.\n\nOh, regarding raisins, I found a tip that said to dust them with flour before chopping. That worked like a charm. Then I put the filling items in the processor and that came out even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen E. Duffy"
},
"reviewBody": "Oh, boy! I love making Rugelach, and this recipe is a winner! I didn't have sour cream, so I substituted plain Greek yogurt. I had leftover homemade almond paste, so I rolled it into two large discs for filling half of these dough circles, and added chopped almonds. For the remaining two dough discs, I used the traditional cinnamon-sugar mixture with chopped walnuts. I have always brushed my dough with melted butter before adding nuts and cinnamon-sugar, and I noticed this recipe doesn't include that. No matter... these baked up beautifully and I love the tips about rolling the cinnamon sugar into the dough and then chilling the filled rugelach before baking. Awesome! This will replace my old tattered Rugelach recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen Sutton"
},
"reviewBody": "I make them a lot smaller than what this says only because it makes a perfect bit. You could eat a dozen of these they are so good and so flakey. I have even thought this would make a good pie crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "I took the advice of brushing on a small layer of apricot jam first. They aren't as good as I was hoping they would be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynners"
},
"reviewBody": "I made and treated the dough as written. The only change I made was to brush it lightly with apricot jam (first puree the lumps out!) before pressing the walnut/spice mixture into the dough. This is an excellent recipe. Thank you very much Jackie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "Love this recipe. It's well detailed &amp; gives great instruction for doing all the prep necessary especially the part about refrigerating the dough is a must so you can work with it. Lots of variation on fillings. My personal favorite is apricot &amp; raspberry jam. The only tweek I made is to do an egg wash"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lucas' Mom"
},
"reviewBody": "I’m not sure where I went wrong... maybe my butter wasn’t incorporated enough, because I refrigerated my firmed rugelach for a couple of hours prior to baking and they were swimming in butter when I took them out of the oven. Haven’t tasted them yet - I’m sure they’re good - but I’m not sure why they’re just swimming in melted butter. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Fresh"
},
"reviewBody": "These are exactly like my Czech Grammy Novak makes each x-mas only she uses pecans, no raisins, and liberal amounts of powdered sugar to roll these out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coco"
},
"reviewBody": "This may be my top cookie recipe. I drizzle honey and walnut with a little brown sugar and cinnamon on a disk. black raspberry and walnut on another, apricot on another. These just come out great every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitch"
},
"reviewBody": "Never thought anyone could improve on my mom's recipe but this one is actually better. Here is a tip for rolling out the dough. Instead of using flour to keep it from sticking, we usually use a mixture of sugar and cinnamon. It is messy but it works and enhances the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cindy Schaak"
},
"reviewBody": "my dough came a little sticky also. I just kneeded some flour in and was good. there ya go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shoshana"
},
"reviewBody": "I made this and I am no cookie maker. FANTASTIC, gave some to my neighbor friend and he swears by them. Just follow the recipe. I noted that chilling was the trick. And use SOLO product. It is the best. I used Almond paste, then sprinkled with cinnamon and crushed pecans. Heavenly! They are addicting. I also made with Solo Apricot filling and Solo Raspberry filling. Taste just stupendous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama"
},
"reviewBody": "Taste great but don’t look great. They look like the doggie got to them. The dough was a little sticky and I could not roll them tight. I will try a little flour on the next batch to see if that will work. I’m not giving up because they’ll wonderful little cookies . Made them again they came out great and used flour so dough would not stick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miriam Magaziner"
},
"reviewBody": "I made this recipe for Rosh Hashana this year. The only downside was that I felt like it was very time consuming but in the end, they came out absolutely delicious! Minor changes that I made were that I added about 1tsp. of Vanilla to the dough. Also, when adding sugar to make the filling, I used an equal combination of brown and white sugar. I also made some of them with a dark chocolate and walnut filling using melted Hershey's Special Dark chips and a combination of walnuts and sugar. I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clover Green"
},
"reviewBody": "i replaced sour cream with 1/4 cup sugar. The dough turned out too soft instead of crumble. I don't know the sugar could make that much different? I kept the dough in fridge over night and baked it the next morning. I brushed on the apricot jam before sprinkle the filling, and added on chocolate chip. It turned out well and still super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CarolynE"
},
"reviewBody": "I bake cookies every summer for college baseball players who come to Anchorage for summer ball. I made this recipe for the first time and it was a struggle and time-consuming but I have never ever received such high praise as I did for the rugelach.\n\nThe recipe fails to say that you need to put something on the pastry board before rolling the dough. Fortunately, I had read several other comments and was forewarned. I used sugar and cinnamon instead of flour and it works just fine.\n\n\nThis week I will experiment with some jams and see what happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leslie Ellis"
},
"reviewBody": "This was great both times I made it. Table jams and jellies work just fine! I'm not sure what the issue is about that! I used BlackBerry jam and no filling and both were just wonderful. Next time I'm going to try honey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "Love, love, love this recipe! Takes a little time to prepare but truly worth the effort! Apart from being addictive for dessert pastry lovers, these yummy treats will win over any dessert sceptic- no matter their age. I've made these for years for family, friends, work colleagues and sometimes just for me... I can devour a batch in a matter of days! Remember not to handle the dough too much, refrigerate, refrigerate, refrigerate and be creative with your fillings. In addition to those suggested in the recipe, try unsweetened desiccated coconut, chopped dried cranberries, raspberry, pineapple or strawberry jam... Options are endless, so bake on!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "I've been making these for a few years now and people always rave about them. Just recently I substituted plain greek yogurt for the sour cream and they were just as good if not better. LOVE this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Uchita"
},
"reviewBody": "I made no changes to the recipe. Perhaps people who had an issue with the dough pulsed it too long in the food processor, as that could happen. I am a caterer, and had a request for Rugalach from a friend. After I found this recipe and made them for her, she told me it took her back to her childhood! She just closed her eyes and the memories returned. That to me was the ultimate compliment! I tried another recipe from a different source, but this one, using sour cream, was the best. Yes, sometimes the filling will be difficult, but work with it, and you won't be sorry. I made mine with apricot jam and pecans only, no raisins or currants, and sprinkling more sugar and cinnamon than the recipe called for. They were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "I've been making this recipe for years. Truth be told, it's better than my mother's and my grandmother's, may they both rest in peace."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lem"
},
"reviewBody": "I made this into a log, baked it then I cut them into one and a half inch pieces...they came out great, the filling stayed intact and my cookie sheet didn't have a mess with the burnt filling on it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Brigden McCague"
},
"reviewBody": "I followed the recommendation to add a layer of apricot jam and brown sugar. Oh, the filling variations you can do!! Just thinking of all the different kinds to make! Great pastry too. Very flaky! Can't rate this high enough. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Godin Noel"
},
"reviewBody": "Addicting! Would certainly make again! Rolled first batch the wrong way...started with point rather than ending with it. Did not effect the taste :) \"Variation\" indicates using jam before adding filling. I can see how that would help hold filling in place. Rolled them out on cinnamon sugar as is traditional. Worked nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Louise"
},
"reviewBody": "I don't think I'll make this recipe again. My food processor bowl wasn't quite large enough to do a good mix. There was so much butter and fat in the dough, it ran out on the cookie sheet. Followed recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gymmom101"
},
"reviewBody": "The only thing is I will never get 12 out of 1 dough ball - 8 is a good size. Other than that - very easy to make &amp; delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hold345"
},
"reviewBody": "Made these for the first time. They were delicious. Also made some with raspberry filling and blueberry filling. Fun cookie to experiment with. Didn't have a food processor so used a hand dough blender to cut in the butter and cream cheese (just like I would make a pie crust). It worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stanmilam"
},
"reviewBody": "Got this recipe in my email and thought \"that sounds good\" so I made a test batch this week in anticipation of taking to my daughters house Christmas morning.\n\nI'm too lazy to make the dough, and after reading about cutting the disks into wedges, I thought \"canned crescent rolls\" will make an easy substitute, and they did!\n\nI combined white sugar, brown sugar, cinnamon, and chopped walnuts and set aside in a small bowl. Opened the crescent rolls, and sprinkled them liberally with the sugar/nut mixture. On a few, I spread some peach preserves.\n\nAfter baking about 14 minutes, I cut each roll into thirds and these little treats were fantastic. These were gobbled up by 3 of us in 15 minutes!\n\nCan't wait for Christmas morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Tyrkalo"
},
"reviewBody": "My dough was sticky, not crumbly so I added 2 more cups of flour. Dough was great after that.\nDelicious! I made three different fillings and ended up with a nice variety for my sweets platter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "margo"
},
"reviewBody": "Very good, BUT Im not sure if Im doing something wrong. The butter melts all over the cookie sheets so they end up too greasy, though delicious.\nHoping to find some advice in the other commentaries.\n\nAfter reading the other commentaries I think next time Ill add more flour, and chill the dough for 24hours instead of just 2 hours. Also, I might try chilling them more than 20 minutes before putting them into the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DLHay"
},
"reviewBody": "This dough recipe is awesome!!! The best I've ever tried. Love the filling too and the chocolate one. Endless ways to use this dough. I am going to try it on the next pie I bake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizzy"
},
"reviewBody": "I don't have a food processor - would using my kitchen maid mixer work?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "K Blue"
},
"reviewBody": "Delicious, but next time I would definitely add honey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeSanne Guthrie"
},
"reviewBody": "OMG! Just discovered Rugelach at Carlo's Bakery in Vegas. Decided I had to make these at home and found this recipe. Substituted chocolate chips for raisins, and I swear these were better than Carlos Bakery!! Now if I could stop eating these like popcorn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana88"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "This is a great recipe, and while a little time consuming, it's not difficult at all. I liked the comment about rolling out in a sugar mixture. I was worried about the ragged edge when rolling the dough out, but that takes care of itself. Also, I did part of them with apricot spread from Whole Foods and it helped the mixture stick to the dough. Also, I put a piece of waxed paper down and rolled the mixture lightly to press into the dough. I will chill the rolled dough longer than 20 minutes the next time. My second pan, which chilled for 30-40 minutes came out better. I also baked the cookies for 24 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deniseann"
},
"reviewBody": "I have looked for a rugelach recipe that resembled the apricot rugelachs that I have eaten from a local coffee shop but none came close. This recipe is exactly the same, just as delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "baker"
},
"reviewBody": "The dough came out very sticky. One reviewer said the flour amount should be 4 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coastal Lady"
},
"reviewBody": "I have made these for the past 40 years and they are always a big hit for the holidays. I do, however, roll them out on Cake Flour, this helps keep them from getting too tough from rolling them out on regular flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "This is the best of the best, easy and the results are great. When my son comes to my house he is always looking for them, I have tried so many recipes, however this is the best of all.\nI make them twice a week everybody loved them, wish I could give it 10 stars"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jgilbo"
},
"reviewBody": "So good. Oh so good. I literally couldn't stop eating these fattening little buttery crunchy gooey treats. Oh yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bake4fun"
},
"reviewBody": "These were excellent. The dough is very sticky at first. Put in the fridge as directed. I broke into 4 parts and refrigerated. After rolling it out with some flour, I sprinkled sugar on one side, flipped it and added filling. Mini chips, apricot preserves and raspberry jam for each kind. Might try Nutella with chip next time. It wasn't great warm out of the oven but were great after they cooled. I got lots of compliments at the party in brought them to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chocolateE"
},
"reviewBody": "My daughter is in the musical, \"Fiddler on the Roof\" so I decided to make rugelach for the cast. This recipe was perfect! Easy to work with and delicious. I did add about 1/3 cup of granulated sugar to the dough ingredients because I thought it needed just a touch of sweetness. I filled one batch with mini-chocolate chips and powdered sugar and another batch with cinnamon-sugar, to make it more \"kid friendly.\" It's really important that this dough is cold. You need to work fast from the time you take one section out of the refrigerator and roll and fill it. The dough got easier to work with the longer it was in the refrigerator. Really good recipe. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquie"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anthiad"
},
"reviewBody": "This is an excellent rugelach recipe! Tender and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VALENE"
},
"reviewBody": "I have been making this for years and can't believe I've never reviewed it. I will admit that the first few times I made it, it was very messy and difficult to do. Once you figure out what works best for you, it's a breeze. If you follow the instructions exactly as stated and use cold ingredients, the dough comes together in about 5 minutes and is very easy to handle. I use a dusting of flour to roll it out into a rectangle. I only make about half the filling. I make some with different flavored jellies and also use mini chips. I make different ones for each disc. One of my favorites..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbie Ann McKinney"
},
"reviewBody": "This recipe is amazing. I decided to make 4 different fillings with the base filling (sans raisins). I had apricot preservers and brown sugar, chocolate chips, dates and then plain. All of them scrumptous. The recipes was so easy! Really yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mybubby"
},
"reviewBody": "Although my mother always made rugelach with butter and sour cream, obviously I can't do that if I want the cookies to be available to my kosher grandkids even after a meat meal. So I replaced the butter with margarine, the sour cream with Tofutti brand's Sour Supreme and the cream cheese with their Better than Cream Cheese. And although the rugelach didn't taste exactly like my mother's, they were spectacular and gone in little more than a minute!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doris"
},
"reviewBody": "Not many of us have free refrigerator space for all that chilling. I know I don't. Sounds good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apronhanger"
},
"reviewBody": "Excellent recipe. I did not like the way the pie shaped slices rolled so I shaped my dough as a rectangle and cut strips. I like the way that rolled and baked much better. I posted a photo so you can judge for yourself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DaniCooks"
},
"reviewBody": "Was surprised how easy the dough was to make and how far the dough went. I got about 70 rugelach out the dough. They were a huge hit and I'll be making them again and experimenting with fillings. I made half with cinnamon/raisin/hazelnut and other half with raspberry jam (heated in micro with 1 tbsp sugar), dark choc and hazel nuts. And I definitely recommend doing an egg wash on the rolled rugelach otherwise they look dull."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "funnyface"
},
"reviewBody": "Oops! This recipe calls for 2 cups flour but it should be 4 cups flour. Otherwise the end product is very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Lento"
},
"reviewBody": "Absolutely the best rugelach recipe I have tried. Grew up buying all my cakes, etc. in jewish bakeries and this recipe makes the best I have ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sassie"
},
"reviewBody": "This is absolutely yummy! I made it on Christmas Eve and then again on New Year eve. I made 4 different types. 1. Nutella, 2. Cranberry walnut and raspberry jam, 3. walnuts, raisins and raspberry jam and 4. walnuts, chocolate chips and raspberry jam. Was was good but the favourites were the first 2. The second time I made it I found some ways to be more efficient. Follow the instructions exactly, roll out in the circle on wax paper, spread the jam then the cinnamon sugar then the rest of toppings and press lightly. Then lift and place on a plate and refrigerate until the dough firms up a bit. That way its really easy to cut and roll. Then egg wash and sprinkle or roll in cinasugar and refrigerate again. Final tip be sure to remove from baking tray as soon as its finished baking because if not it will fuse to the paper and its difficult to remove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crazycat"
},
"reviewBody": "Great recipe! Can anyone help with one small problem I had? These were delicious! The only problem was that before the cookies browned and got flaky, they seemed to melt and flatten on the pan in the oven. My daughter had the same problem, what did we do wrong?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DUFFFY"
},
"reviewBody": "This calls for 2 cups flour, with 1 cup of butter, 1 package of cream cheese and 1/3 cup of sour cream, and the dough is supposed to be crumbly? It was very sticky! I ended up adding another cup of flour! Then more to dust the pastry board. I probably almost doubled the flour amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "das0421"
},
"reviewBody": "I really loved this dough. Using plenty of flour when rolling out is key. I used a simple cinnamon-sugar filling and drizzled white icing once they were cooled. Like little cinnamon rolls! Delicious. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LNGHAIRWYF"
},
"reviewBody": "DELISH! I've made them with a) sugar/cinnamon/walnuts/mini dark-chocolate chips, b) Solo apricot filling/walnuts (or almonds)/cinnamon, c) Solo raspberry filling/dark chocolate chips. (A) and (B) are *wonderful* --- wasn't crazy about (C). Also, after the 1st time I made this recipe, I stopped cutting the prepared dough into wedges and rolling --- now I just roll the entire thing into a 'log' and slice into pieces about 1 1/2\" wide. This works *much* better for me and the filling doesn't fall out! I brush the top of each piece with beaten egg and drop into either a sugar/cinnamon mix or into crushed nuts before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "La'El"
},
"reviewBody": "This is a little time intensive, but turns out AMAZING!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rangerskadi"
},
"reviewBody": "I've been making rugelach for a few years now and each year they get better. This one is a surprisingly forgiving dough - not as temperamental as regular pastry. \n\nLots of reviews suggest using jam as the filling, but every time I have done this the jam burns and ruins the cookies. It doesn't matter how thin I keep the coating - they burn. So the best version by far is the one outlined in this recipe - cinnamon sugar with raisins and / or nuts. \n\nI plan on trying poppy seed one day, because that's what I used to buy and love at the Jewish bakery (Solly's) in Vancouver, BC.\n\nThey keep really well (freeze or store in an airtight container) and since I don't do a lot of holiday baking the extra time it takes to roll them is worth it, because they impress everyone that tries them. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Excellent recipe but don't skip the chilling before baking. I forgot with the first tray and they spread too much. I realized my mistake before I put the second one in. Also, much easier to bake them on parchment paper. Easier clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngPayne"
},
"reviewBody": "These are really great...more like a pastry then a cookie. I used mini chocolate chips instead of raises and left out the cinnamon....so yummy and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarB"
},
"reviewBody": "Hazelnut spread hard to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefibeth"
},
"reviewBody": "Great recipe! I followed the recipe as written with the exception of the raisins. Instead of raisins I spread the dough with apricot preserves before adding the sugar/cinnamon/nut mixture, which was very tasty! The dough is phenomenal though! Flaky and buttery and just as it should be. Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sewersue"
},
"reviewBody": "I literally just made these with my daughter both decent cooks. I followed many peoples advice because I have never made these. I have this advice this is one of the best cookies ever! But...do yourself a favor flour lightly two sheets of parchment and roll out very chilled dough in rectangle put filling on top pressing into dough and roll up cookie roll fashion chill again and slice and bake. They will come out perfect. The taste is unbelievable whole family raving!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MADMARCHIE"
},
"reviewBody": "I don't generally write reviews but I just pulled these out of the oven and they are amazing. My exact words were \"Holy Macaroni!\". I would say I am an intermediate baker. I can cook without recipes but I am just starting to get a feel for proportions and the effects of different ingredients in recipes. I saw these and thought it looked a bit like a pie dough in that you need to keep everything chilled and not overly mixed so I expected flaky-ness. The term \"laminated dough\" popped into my head also. Well these came out like little croissants for me. Exceeded my expectations. I haven't read the other reviews but I definitely agree with all the stars for this recipe. I am making them for Christmas and they are a nice addition to the mix of cookies. \r\n\r\nI used european butter, mixed with my hand squishing all the ingredients into odd shaped, flakes and chunks. Filled with 1) cherry pie filling (pureed in blender)/pecan 2) Nutella 3) chopped raisin/brown sugar/walnut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah"
},
"reviewBody": "Awesome recipe; my only change (third time around) was to use chopped chocolate chips in place of raisins, and to roll them out as rectangles rather than rounds. The roulade shape allows all the filling to stay contained in the rugelach -- it tends to fall out when prepared as the recipe suggests. I shape the dough into rectangles before chilling, then roll out to about 4 x 12 inches, top with filling, roll into a log and cut into 12 small cookies. These took about 24 minutes to cook entirely. The dough is easy to work with and cooks to a lovely flaky finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "This was the best recipe ever! Very happy with the results. I also made a few different fillings like some others. Next time I will roll the dough into a log like someone else suggested. It will definitely save time, and I think there will be less loss if filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri"
},
"reviewBody": "This was the best recipe ever! Very happy with the results. I also made a few different fillings like some others. Next time I will roll the dough into a log like someone else suggested. It will definitely save time, and I think there will be less loss if filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Rightnour"
},
"reviewBody": "My dough came out sticky not crumbly in the food processor. Double checked-ingredients correct. I want to make a few more batches. What did I do incorrectly?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrjcbk"
},
"reviewBody": "These are so delicious. I didn't have raisons so I decided to use Apricot jam in the nut mixture. They turned out great. I'm not sure if this was a major faux pas but it worked for me and I am making more tomorrow for our BIG family party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherman4055"
},
"reviewBody": "excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina"
},
"reviewBody": "These were amazing! My dough came out really sticky so I ending adding more flour. I didn't use raisins, but I did add apricot jam before adding on the cinnamon/sugar/nut mixture. SO so so good! Love these!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilorchid82"
},
"reviewBody": "4.5 stars from me. They were very good. I don't think I followed the directions exactly, b/c I was going back and forth btn this one and the Contessa's recipe from FN. Anyways, I had the cream cheese and butter almost at room temp when I started, so it was basically smooth when combined. This did not affect anything. For my filling, I did toasted crushed almonds, finely chopped dates, and a layer of sugar free apricot preserve (applied with brush before filling). The two chilling steps were crucial. Rolling was not that difficult afterwards. I did not have liquid jam everywhere as one reviewer did after baking. Ina rec'd 2T of preserves. I think I did 3T-4T with it not running. I did do an egg wash to improve the appearance (1 egg beaten with 1T milk). I don't like overly sweet desserts, but I think it would've been fine to roll the pastry in cinnamon sugar before baking. Baking time: 22min for my oven was too short. So I just left the rugelach in there for another 10-15min til it reached a deeper light brown. I think next time I will add vanilla to the batter to give it more flavor. Like I said, I don't have a sweet tooth, but I know that these can stand to be sweeter. Regardless, I like these a LOT, and really, really enjoyed making them. This was a great new learning experience! And did I mention these are oh so ADORABLE?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dody"
},
"reviewBody": "not bad, but to improve the batch ,each round should be rolled out, butter added and envelope fold twice, this brings it more to a pastry and less of a solid lump"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becca"
},
"reviewBody": "Made these yesterday, my first time making rugelach. Everyone loved them and said they were possibly the best they've had. I used chocolate chips instead of raisins.\nUpdate: I've been using this recipe for 5 years and still love it, it's become my holiday coookie exchange staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOancox"
},
"reviewBody": "I brushed rounds with a thin layer of instant coffee, vanilla and hot water, then a layer of chopped chocolate chips. before cutting and rolling.... mmmmm also brushed tops with an egg and vanilla sugar mix.....double mmmmm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lara Bowie Taylor"
},
"reviewBody": "These were absolutely delicious. I used the apricot jam with raisins and topped with cinnamon sugar. Divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamar"
},
"reviewBody": "great dough. easy to make and I am not a baker. We made them by making a big rectangle and then putting the filling and rolling into a long tube and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kketnick"
},
"reviewBody": "Never heard of Rugelach before, but these are delicious. I don't have a food processor but chopped up the ingredients needing chopping with a small slap-chop style chopper and then the dough easily mixed together with a spoon and additionally by hand. I found a 9 in. plate to trace out my circles after rolling the dough out and they all came out perfectly sized and even. I did notice that my second batch, which was chilled longer, was an easier dough to work with and flour helped. A crisp, flaky treat that is very versatile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent, authentic recipe, just like you get on the East Coast. MAKE IT EASIER! 1) SKIP 2-HOUR CHILLING! Instead, I sandwiched a ball of dough between 2 pieces of saran wrap, rolled to 9\" round, peeled off the top layer of plastic, placed fillings, cut with pizza cutter and was ready to go! 2)FRESH ANYTIME: This dough refrigerates VERY well so you might as well make the whole recipe, refrig until needed, and then bake as much as suits your household. OTHER TIPS: 1) Choco filling: 1 cup chocolate chips (chopped) tossed with 1/2 cup white sugar, fill as usual. 2) after making your rolled crescents, chill for 10-20min in the fridge so they maintain the pretty shape while baking. this is optional, but easy if you skipped 2h of chilling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jill wilson"
},
"reviewBody": "I made this recipe for my Jewish boyfriend thinking it would remind him of his mother. After all my hard work he said,\"Oh, mom bought her's from the bakery\" Mine turned out great. Little tricky rolling out the dough. He loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MPH Mom"
},
"reviewBody": "Nice addition to our Xmas selections. I made them without jam and with Orange marmalade. Both were equally tasty. I also made them as crescents and rolled up and cut out sprials. Looks great on the plate. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jjjames"
},
"reviewBody": "Delicious. I made these exactly as directed (and tried a batch with apricot jam also great and easier to stick the filling to the dough) and they were fantastic. Mine left a fairly large grease slick on the bottom of the cookie sheet, so I had to remove them right away to cool on wire racks. I think I didn't get the butter and cream cheese cut small enough before adding the other ingredients. Didn't effect the flavor or presentation though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Morin"
},
"reviewBody": "These are great. I didn't have any raisins but I am not a fan of them anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nasi"
},
"reviewBody": "Everybody loves it. You can't stop eating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele W"
},
"reviewBody": "These are super good! I just got done baking a double batch and swear I ate the whole first batch. A few tips I'd like to contribute after reading other reviewers problems: 1. Definitely chill this dough and roll on a lightly floured surface. I would imagine a marble cutting block would be ideal. I used a Wilton Roll &amp; Cut mat for fondant; worked perfectly. 2. Roll your circle to about 8\". Then put your nut/ raisin / cinnamon / sugar combo on the dough. Cover with a papertowel and finish rolling to 9 inches. This worked perfectly for me. I didn't get very much mixture spilling out after rolling it into the dough. Careful though... you don't want to roll so hard that the mixture pokes through the front of the dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are super good! I just got done baking a double batch and swear I ate the whole first batch. A few tips I'd like to contribute after reading other reviewers problems: 1. Definitely chill this dough and roll on a lightly floured surface. I would imagine a marble cutting block would be ideal. I used a Wilton Roll &amp; Cut mat for fondant; worked perfectly. 2. Roll your circle to about 8\". Then put your nut/ raisin / cinnamon / sugar combo on the dough. Cover with a papertowel and finish rolling to 9 inches. This worked perfectly for me. I didn't get very much mixture spilling out after rolling it into the dough. Careful though... you don't want to roll so hard that the mixture pokes through the front of the dough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Janet From PA"
},
"reviewBody": "I am searching for a good rugelach recipe. This was the second I tried; the first was better. My food processor could not handle this much dough so I changed to my KitchenAid using the dough hook. After more than 2 hours of chilling, the dough was too soft to handle easily. Even after pressing the filling into the dough with a rolling pin, a lot of the filling fell out. The dough is a nice consistency but, if you don't roll it in sugar, it's not sweet enough (I omitted the raisains). If you cut in rolled rectangles instead of crescents, the pieces may fall over during baking."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10115/rugelach/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/850/desserts/cookies/nut-cookies/",
"name": "Nut Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13350/desserts/cookies/nut-cookies/walnut/",
"name": "Walnut"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10115/rugelach/",
"name": "Rugelach"
}
}
]
}
}
, "about": [
]
}
]