				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Rum Truffles"
,"datePublished": "2019-04-02T02:44:20.000-04:00"
,"dateModified": "2022-07-14T18:16:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Michelle Chen"
,"url": "https://www.allrecipes.com/cook/221189"
}
]
,"description": "Premium quality dark chocolate, cream, cake crumbs and rum are the essentials in these exquisite morsels. These truffles will be soft inside despite that it feels firm on the outside. You only need to store them in a cool place, but not necessarily the fridge."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RpJeJmgBACjNRKXy5S7cag9sHbk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2611813-fdb06f0637e040e985ffb8acb6f70881.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Rum Truffles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "38"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "98 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "9 mg"
,"sugarContent": "4 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"8 (1 ounce) squares bittersweet chocolate, chopped",
"0.25 cup cream",
"2 tablespoons unsalted butter",
"0.5 cup chocolate cake crumbs",
"2 teaspoons dark rum",
"0.5 cup chocolate sprinkles" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Line a sheet pan with aluminum foil or parchment paper. Place chopped chocolate in a heatproof bowl."
} ,{
"@type": "HowToStep"
,"text": "In a saucepan, combine cream and butter. Place over low heat, and bring to a boil. Pour over chocolate, and stir until chocolate is melted and smooth. Stir in cake crumbs and rum. Set aside until firm, but not hard."
} ,{
"@type": "HowToStep"
,"text": "Roll heaping teaspoons of chocolate mixture into balls, then roll in the chocolate sprinkles. Place on the prepared tray. Refrigerate 30 minutes or until firm. Serve in small paper cups."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "I honestly think this recipe is not good at all. First, it needs more cake crumbs. The mix is too runny to shape into balls. Add more cake crumbs until you get some consistency. Second, the chocolate is too overpowering. It needs sugar or lower the amount of baking chocolate to half of it. Otherwise, it is too much chocolate. Third, they do not taste like truffle. Truffles are creamy soft in texture or so. These could be called more appropriately chocolate cake pearls. Stick to Decadent Chocolate Truffles from this site!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewCakeBaker"
},
"reviewBody": "So simple and so good! I made several batches, using different types of liqueur, such as Gran Marnier, raspberry liqueur, coffee liqueur and hazelnut liqueur. I rolled each type of truffle in a different topping, so as to be able to distinguish one from another. I also dipped some to them in melted, cooled, tempered chocolate to make a hard chocolate shell around them. I always use Trader Joe's 72% dark chocolate, which is super high quality ;Belgian chocolate.. I get the large, one pound plus bar and chop it up finely. Yummm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fjware"
},
"reviewBody": "These are very tasty! Nice and tender inside and full of flavor. I added a cup of finely chopped pecans , which gave them a little more pizzaz."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EROCK101"
},
"reviewBody": "Easy to make. Couldn't really taste the rum, and I added more than the recipe called for. These were good cake balls, more or less. I rolled them in chocolate jimmies and shredded coconut. I thought that the chocolate called for was too sweet so I did 4oz bittersweet and 4oz unsweetened Godiva chocolate. I really like this recipe, I just feel like I had too many changes and with the lack of rum taste, I can't give it a solid 5 star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freda"
},
"reviewBody": "I did not make any changes and my family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilee"
},
"reviewBody": "I made these delightful little confections for a party I attended recently. They were an excellent addition, however I did tweek the original recipe a bit by adding more rum (dark Jamaican), and more cake crumbs to compensate. I rolled some of them in finely crushed nuts, or coconut, or chocolate sprinkles, while I dipped others in milk chocolate. Yum! Thanks for great recipe! I'll definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veglife"
},
"reviewBody": "Delicious with one change - added 2 tsp. rum as recommended and could barely taste it. If you want a stronger rum flavor, double the amount of rum. Then when you form the balls, soak the truffles in a bowl of rum for 5-7 minutes. Otherwise the rum is just a background flavor as others noted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karinschis"
},
"reviewBody": "Made the recipe and followed it exactly except doubled the amount of rum. Used a spiced rum. Rolled them in Coconut, cocoa powder/sugar, and chocolate sprinkles to make 3 different kinds and they turned out great! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "silkymolo"
},
"reviewBody": "Fabulousness recipe!! I trawled UK sites to find a recipe for these truffles as a colleague requested them, however, none of the UK sites had the recipe with cake crumbs! I had to make my own chocolate cake to crumb (I couldn't find a plain chocolate cake in the shops!). I found that the first batch wasn't quite strong enough with rum flavour, so the second time I made these I double the rum quantity and also added some rum essence to pep it up a bit! Live this recipe, thanks so much for adding it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Easy to make, fairly tasty, but don't taste like a true truffle. \n\n\nThe chocolate needs to be chopped very finely, almost shaved, in order to melt properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyndi"
},
"reviewBody": "Made these and they were wonderful! Easy to make and very flavorful. Will make for Christmas gifts. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "I tried the recipe with semi-sweet morsels and another version with the squares. We preferred the semi-sweet chocolate morsels. To get the chocolate melted completely, I put a bowl over a pot of hot water. The consistency was perfect without having to chill, and was easy to handle. I used small food containers and just rolled them around to coat. They were set within 15 minutes without chilling. Great base recipe that a person can modify to their liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Afdelv09"
},
"reviewBody": "Really yummy! I used vanilla cake crumbs instead of chocolate, and even that left a really strong chocolate taste (so I imagine it would be quite overpowering with chocolate cake crumbs). I also took out the rum. The only issue I had was needing to add way more cake crumbs than was recommended in order to get the mixture thick enough to form into balls. However this was probably the result of my using gluten-free cake crumbs; Even so, it still turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "Great taste, good texture, however more rum is required if your a fan of the rum in the \"rum truffles.\" I used 1/4 cup, however next time I will up use 1/3, the rum taste does not come out with the amount suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britt"
},
"reviewBody": "First time making these or any truffles. These were easy and delicious. I made them as a christmas present, and they were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmilford"
},
"reviewBody": "i was looking for an exclusive chocolate rum ball that didn't have nuts in it. this recipe is it. It's easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lefty"
},
"reviewBody": "Yum! I added Kahlua instead of the rum-yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Jackson"
},
"reviewBody": "We make these at Christmas time..but we skip the cake crumbs, roll them into balls and dust confectioner's sugar over some of them. Found the recipe in a christmas recipe book--they called them Greek Sokolates."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPYCEJ"
},
"reviewBody": "Very good and super easy! I doubled the recipe, but ended up adding 5 1/2 tsp of rum because I read that a previous reader said you couldn't taste the rum. They were perfect! It made about 34 truffles. I rolled half in powdered sugar and the other half in coconut. They turned out great. Do note it's VERY messy! Let it sit in the fridge for at least 30 mins to 1 hour so make them manageable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prepare2meetyourbaker"
},
"reviewBody": "I love this recipe. for variation I sometimes use peppermint schnapps instead of rum, or irish cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RMSR"
},
"reviewBody": "I used this recipe as a base, and perhaps it flaws are my own doing. I used 6 squares of Baker's white chocolate (the box only comes with that many, I should've followed my instinct and bought chips to make up the difference so I think this was a big flaw), 10% coffee cream as my heavy cream had gone bad (ugh!), margarine instead of butter (really didn't want to defrost a whole block for that amount), 2 TBsps. of Limoncello, coconut-cream cheese-lemon-lavender cake crumbs instead of chocolate and rainbow sprinkles. I think using a lower amount of chocolate , the margarine and the increased liquor made it too sticky and not able to set enough to easily roll. I tossed it all back in a bowl and added cake crumbs until it began forming a 'dough' (maybe 1/2-3/4 cup more). They were easier to roll, so I quickly did so and coated the sprinkles. Put them on a baking sheet in the freezer and within half an hour were good to go. Tasty treat for Easter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sandreawelch"
},
"reviewBody": "this recipe is very tasty, and basic enough that you can adjust based on what you like. i tempered chocolate and dipped them, creating a chocolate coating and covered some with toasted nuts, coconut, or sprinkles. the chocolate coating keeps them from being too soft, as others have complained about."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelpnl"
},
"reviewBody": "I made these for xmas treats and they were a huge hit. The only problem I have with this is you can't taste the rum at all so I will add a bit more the next time I make these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommymeggy"
},
"reviewBody": "5 stars once I figured out how to form them. The only way to roll these is to stick the \"dough\" in the fridge for about an hour... otherwise it's like a thick goopy batter and impossible to handle. Used rum extract instead of rum, which worked fine, and coated half of mine in coconut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharyn"
},
"reviewBody": "Great basic recipe to adapt for all crumbs and flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Great texture, but I could hardly taste the rum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Very good! Thought it was never going to get hard enough to roll into balls, but chilled it for about 15 minutes and was just right. Used coffee flavored tequila."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzy E."
},
"reviewBody": "Oh goodness gracious. How heavenly! I used butter cake crumbs instead of chocolate and I think that was better than chocolate cake would have been. This is chocolaty enough as it is! I would also add either dried coconut or nuts for a little crunch next time. BE SURE to use a high quality chocolate, though I don't believe that bittersweet chocolate is necessary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "G-ma's Gal"
},
"reviewBody": "I had trouble with these. They taste great, but they were just too gooey and never hardened. They are sitting in my freezer because that's the only way I can keep them from melting or losing their shape. I used a double boiler technique to melt the chocolate because I couldn't get the cream/butter to come to a boil fast enough. I plan on dipping these in chocolate again so that they'll keep their shape. I'll let you know if this works!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mariam"
},
"reviewBody": "these are really good. Even though real truffles are only made with cream chocolate and a flavoring, whithout cake, they tasted pretty nice. I used orange extract instead of rum. They actually tasted very much like the no alcohol rum balls I am used to having!They are a great way to use up chocolate cake that turned dry. I had made chocolate cupcakes that came out dry and stuck to the pan, so there was no way I could use them as cupcakes. This recipe was perfect for using all the crumbled cupcakes! I am so glad I found this recipe instead of wasting all those not so good cupcakes (even though I used the rest in a yummy trifle ;) ). I did not give them five star only because they did not really taste like truffles, and second, they were a bit too soft for my taste. Still a great recipe though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WOW...these truffles are out of this world!! The addition of chocolate cake crumbs really makes these truffles unique. I made 75 truffles for my graduation party, but since we don't drink, I modified slightly. I made 25 peanut butter truffles (omitted rum and added a few tbs. of creamy peanut butter), 25 espresso truffles (replaced rum with espresso and added instant coffee granules), and 25 raspberry truffles (omitted rum and added raspberry preserves). For coating, I dipped some in melted chocolate and rolled others in cocoa, nuts, and flaked coconut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne J.R."
},
"reviewBody": "This was my first time making truffles and I have to say, they tasted like a small bite of heaven. I used semi-sweet chocolate chips instead of bittersweet chocolate because I couldn't find it here. I put a bit less than called for cause of the sweetness factor. I think it worked perfectly. I also added a bit more rum than the recipe stated. All in all, definitely 5 stars! Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CONSIDERPHI"
},
"reviewBody": "This was simple and great. I used semisweet chocolate (couldn't fine bittersweet) and they were a tiny bit on the sweet side. I couldn't really taste the rum at all, but I loved how soft they were. I'm going to try this again with bittersweet chocolate and a more intense liqueur."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ENGLISHLADY"
},
"reviewBody": "Great recipe. The chocolate was taking ages to melt for me, so I sat my bowl in another shallow bowl of hot water till it melted down. Really easy to make and so very very delicious. the alcohol is just a nice background note (and i put more in than the recpie said too) but you definitely need to usehigh quality chocolate to make them. Excellent present idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STEPHYIP"
},
"reviewBody": "It is my first time make chocolate truffle. I use my own bitter chocolate cake to make the cake crumb. It is very simple to make and the result is very good. All of my friends find the chocolate very soft inside which rich in rum flavor. It melts in mouth. It's a very good recipe, thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This was my first time making truffles and they turned out great! I made them with half and half and coated them with melted chocolate. Very easy to make!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/37643/rum-truffles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
"name": "Liqueur Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15013/desserts/specialty-desserts/liqueur-desserts/rum/",
"name": "Rum"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/37643/rum-truffles/",
"name": "Rum Truffles"
}
}
]
}
}
, "about": [
]
}
]