				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sacher Torte"
,"datePublished": "2020-06-18T23:13:51.000-04:00"
,"dateModified": "2022-11-30T15:04:30.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Amy A"
,"url": "https://www.allrecipes.com/cook/1995813"
}
]
,"description": "This chocolate Sacher torte with apricot filling is very similar to the classic dessert produced by the Sacher Hotel in Vienna, Austria."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/6PN3wO1UUt3bM5hT0jJm7ElPn28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/678519-a4ce1f8e3627431f851e730038436a7c.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sacher Torte"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "15"
}
,"cookTime": "PT55M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "470 kcal"
,"carbohydrateContent": "63 g"
,"cholesterolContent": "123 mg"
,"fiberContent": "2 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "93 mg"
,"sugarContent": "50 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"4 ounces semisweet chocolate, chopped",
"0.5 cup unsalted butter, softened",
"0.25 cup confectioners' sugar",
"2 teaspoons confectioners' sugar",
"6 large eggs, separated, divided",
"0.5 cup white sugar",
"2 tablespoons white sugar",
"1 cup cake flour",
"0.25 cup water",
"0.25 cup white sugar",
"3 tablespoons dark rum, divided",
"1 (12 ounce) jar apricot preserves",
"1 tablespoon water",
"9 ounces semisweet chocolate, chopped",
"3 ounces heavy cream" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan. Line the bottom with a circle of parchment paper; grease the paper."
} ,{
"@type": "HowToStep"
,"text": "Make the cake: Melt chocolate in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, 3 to 5 minutes. Remove from the heat and let cool slightly, 5 to 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Beat butter and 1/4 cup plus 2 teaspoons confectioners&#39; sugar in a large bowl with an electric mixer until creamy. Mix in melted chocolate, then beat in egg yolks, one at a time."
} ,{
"@type": "HowToStep"
,"text": "Beat egg whites in a glass bowl until foamy. Gradually add 1/2 cup plus 2 tablespoons white sugar, and continue to beat until stiff, glossy peaks form."
} ,{
"@type": "HowToStep"
,"text": "Fold egg whites into chocolate mixture, then fold in cake flour until incorporated. Pour batter into the prepared pan and smooth the top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until the edges begin to pull away from the sides of the pan and a toothpick inserted into the center comes out dry, about 45 minutes."
} ,{
"@type": "HowToStep"
,"text": "Cool pan on a wire rack for 15 minutes, then run a small knife around the edge and remove the sides of the pan. Allow cake to cool completely on the pan base, 15 to 20 more minutes."
} ,{
"@type": "HowToStep"
,"text": "While the cake is cooling, make the filling: Bring 1/4 cup water and sugar to a boil in a small saucepan. Cook and stir until sugar has dissolved and syrup is clear, 2 to 3 minutes. Remove from the heat and stir in 2 tablespoons rum."
} ,{
"@type": "HowToStep"
,"text": "Purée apricot preserves with 1 tablespoon of water in a blender until smooth. Transfer to a saucepan and bring to a simmer over medium heat; cook until thickened, about 2 minutes. Stir in remaining 1 tablespoon rum."
} ,{
"@type": "HowToStep"
,"text": "Remove the pan base and parchment paper from cooled cake. Carefully slice cake in half horizontally into two layers. Place one layer onto a wire rack; brush 1/3 of the syrup over top, spread with 1/3 of the apricot purée, then top with remaining cake layer. Brush the cake top and sides with remaining syrup, then spread remaining purée over the top and sides. Refrigerate cake on the wire rack until icing is ready."
} ,{
"@type": "HowToStep"
,"text": "Make the icing: Melt chocolate in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, 3 to 5 minutes. Remove from the heat and let cool slightly."
} ,{
"@type": "HowToStep"
,"text": "While the chocolate is melting, bring the cream to a simmer in a small saucepan. Stir cream into melted chocolate until combined. Let cool slightly, stirring often, until icing reaches a spreadable consistency, 5 to 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove the cake from the refrigerator; set the wire rack over waxed paper to catch any drips. Pour icing over cake and spread over the top and sides, allow excess icing to drip through the rack. Let sit until icing is at room temperature."
} ,{
"@type": "HowToStep"
,"text": "Carefully transfer cake to a serving platter. Serve at room temperature."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT175M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimmers101"
},
"reviewBody": "The only suggestion I can say is for beginners. Sift the flour first before adding it into the egg whites and chocolate. It would have been nice if that was mentioned in the recipe. Mine is in the oven now, so I guess I will find out soon enough if it turned out ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shireen Alam"
},
"reviewBody": "It worked well but it isnt dense for fudgy. that said, people loved the cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eclarner"
},
"reviewBody": "Great recipe and instructions. The cake turned out a little dry and dense. Not sure if it's supposed to be that way. I put the apricot jam through a sieve to remove lumps, and smoothed the ganache with a warm spatula. Not to sweet but a perfect balance of ganache and apricot jam. Would be better if less dense/dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lingwallicious"
},
"reviewBody": "For Valentines Day, I purchased a set of aluminum foil pans (2) and divided the batter between the two (thus eliminating the step of cutting the single cake into top and bottom halves). I reduced the baking time accordingly (about 30-minutes). I also lined the pans (bottoms and sides) with non-stick aluminum foil. The cakes came out great, no sticking to the foil at all! I used Hershey Special Dark chocolate chips (my favorite) and the results ...DELICIOUS!!! Reminiscent of the Sachertorte my Mom &amp; I so enjoyed at Hansel &amp; Gretel's in Vail once upon a time.....??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PEARLIE5"
},
"reviewBody": "I followed recipe exactly, read reviews and used 86% cacao chocolate, extra fat. It was very very dry. The icing however was wonderful. I kept it warm so it wouldn't harden while spreading. I've had Vienna torte by other people and it didn't raise my blood sugar so was interested in making it. But wouldn't make this one again, sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marina"
},
"reviewBody": "I have just made it! Have never used a spring form pan before, so I opted for the small ceramic dishes that I could control better; anyway, I have cooked, \"out of the box mixes\", with chocolate and I suggest to put a large mixing bowl over a pot of water (no overheating/burning of choc) to melt it. It is well...worth the effort if people enjoy a truly \"homemade desert\". If you don't have a \"La Madeleine\" restaurant then fly to Vienna by all means. Trying to make the syrup soak in was difficult because the cake is not soft enough. A second thing was the icing to which I had to add quite a bit more cream or it does NOT spread (too chunky). I kept it in the double boiler, so it definitely needed more cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chase McIntyre"
},
"reviewBody": "This recipe has a lot of potential. Overall my results were pretty good, but the cake came out a little on the dry side. Another commenter mentions that she believes this can happen when the chocolate doesn't have enough fat in it, but I added quite a bit of butter. Next time I will try adding some yogurt instead, and some extra sugar to compensate (yogurt in cakes eats up sweetness).\n\nI also wish I had let the apricot/rum mixture cool a little more after thickening. I tried to apply it while it was still quite warm and runny.\n\nLastly, I wish I had known how quickly the chocolate icing would set up; within seconds of taking it off of the heat it was like mud. In hindsight I should have been a bit quicker in pouring it on the cake -- do it all in one go, get it as even as you can manage quickly, and don't try to go back and fix the thin areas by pouring more on, because the result will be ugly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya M Shafer"
},
"reviewBody": "This turned out great. I sliced it into three layers instead of two. I used Czech Orion bitter and cooking chocolate, half dark rum and half Grand Marnier. The cake is not too sweet and is balanced with the ganache. Now I need to try the original."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ultra Nuclear Maga"
},
"reviewBody": "Not worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WHIRLEDPEAS"
},
"reviewBody": "Super tasty and authentic! It took a LOT of work and time, but it was well worth the effort. I served it with fresh whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NADINE"
},
"reviewBody": "I loved everything about this Sacher Torte. (However,I would much rather fly to Vienna for the real thing!) I am going to make it for my annual \"Celebrate Mozart's Birthday\" dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rebekah001"
},
"reviewBody": "Weird, dry. The chocolate mix did not incorperate into the egg whites. Some of my guests claimed to like it. It has potential."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loiskayaker"
},
"reviewBody": "I agree! This is a lot like the real thing. I ued semi-sweet chocolate bits which worked well. When making this, please understand it is NOT a sweet cake. With the apricot filling and chocolate that is what makes it Sacher Torte. Would also suggest serving it with whip cream (mit schlag). I too have fond memories of the Hotel Sacher. This is a keeper for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "This turned out to be a LOT like the Sacher Torte I had at the Sacher Hotel in Vienna. The only thing I would say is that you absolutely MUST use a high-fat chocolate for this, like a coverture. If the chocolate isn't high in butterfat, the whole thing will turn out too dry. If you want to try with semi-sweet chocolate chips, increase the fat content when you're melting the chocolate. This made me miss Vienna!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/110312/sacher-torte/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/718/world-cuisine/european/austrian/",
"name": "Austrian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/110312/sacher-torte/",
"name": "Sacher Torte"
}
}
]
}
}
, "about": [
]
}
]