				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sambousa"
,"datePublished": "1999-12-14T14:58:49.000-05:00"
,"dateModified": "2022-07-14T17:45:00.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Raffaella"
,"url": "https://www.allrecipes.com/cook/24327519"
}
]
,"description": "Create Middle Eastern-style egg rolls with a savory mix of cooked ground lamb or beef, minced carrots, onions, and seasonings. Fold into triangles using egg roll wrappers, and fry until crisp and golden."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cB2xv09LbtOwnjQGx4NkCtYPEo0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/441501-b705056c1a904a25814c2d1bce679b10.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sambousa"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.9",
"ratingCount": "23"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "649 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "38 mg"
,"fiberContent": "1 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "318 mg"
,"sugarContent": "1 g"
,"fatContent": "54 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 pound lean ground beef",
"0.5 carrot, minced",
"0.5 onion, minced",
"1 clove garlic, minced",
"1 teaspoon tomato paste",
"1 green onion, chopped",
"1 pinch seasoning salt",
"1 green chile peppers, diced",
"1 (16 ounce) package egg roll wrappers, cut in half into rectangles",
"1 tablespoon all-purpose flour",
"1 tablespoon water",
"2 cups vegetable oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large skillet, brown meat. Remove the meat from the skillet."
} ,{
"@type": "HowToStep"
,"text": "In the same skillet used for the meat, saute onion, garlic, carrot and green onion. When the vegetables are tender, add tomato paste and seasoning salt. Stir in browned meat."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl combine flour with water until a watery paste is formed. Place a teaspoon full of meat mixture in the front part of one of the strips. Starting from the right front corner, fold over to the left. You&#39;ve started the triangle shape. Continue back and forth (making a triangular shape) until there is no more wrapper. Seal the wrappers closed with the flour and water mixture. Continue this process until all of the ingredients are used."
} ,{
"@type": "HowToStep"
,"text": "Using oil to taste, fry the triangular packages until crisp. Delicious!"
} ]
,"recipeYield": ["10"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gee Escalona"
},
"reviewBody": "I've been living in Saudi Arabia for a little while and Sambousa will only be the real one if it has got the arabic taste in it...Basically I make it by sauteeing the beef or lamb with garlic and onion, and mix it with parsley and dill. Season it with pepper and salt to suit your taste. Dill is basically the herb that gives Sambousa the middle eastern taste...you can pair it with vinegarette made of minced garlic, onion and a touch of chili pepper to add spice...Enjoy :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lledama"
},
"reviewBody": "Very good. Daughter and I enjoyed making!! Her daddy is from Africa and when we were together these were commonly served at get togethers. She had them last weekend and asked if we could make them. thanks for the receipe. \n\nI would agree with the other's the meat is bland without adding additional spices/seasonings. I made the following adjustments on the first two batches (one beef, one turkey):\n- added seasonings WHILE cooking the meat. I've learned and fully believe the flavors can only be absorbed in the meat when added BEFORE it's cooked.\n- added a combination of other seasonings (cumin, beef or chicken boullion, ground ginger, ground mustard, celery seed, dash of chili powder, Lawrys, ground sage, sweet basil, snipped chives, parsley, garlic powder, onion powder).\n-Substituded the green onion w/ the snipped chives, as well as the green chili pepper w/ dash of chili powder.\n-used dried minced onions and garlic, along w/ the powders of each (avoid the \"salts\")\n-Used egg whites to help seal wrap openings.\n-Fried in shallow veggie oil, only 4 at a time, and placed on paper towels to absorb excess oil..layered paper towel as layer of sambousa's increased.\n\nVery Very Very good - both Ground Turkey and Ground Beef...cannot decided which was best. Made it again tonight to use up extra wraps.\nDaughter loved and enjoyed cooking.\n\nLeft overs - frozen - baked in oven at ~350 degrees ~ 8 minutes each side makes them just as delicious again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yasmin Melody Koch Zraikat"
},
"reviewBody": "This was indeed a very good basic recipe. Like other reviewers, however, I found the meat filling to be too bland. I tasted it before filling the triangles, and added some extra chili, garlic and cumin. (I did use lamb instead of beef)\r\nThe directions on how to fold the triangles are not great; I found a video on youtube that showed it very well.\r\nAll in all, the finished product was very good, though extremely labor intensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cyffermoon"
},
"reviewBody": "Very good basic recipe. I added cumin seeds and some turmeric."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ayasmother"
},
"reviewBody": "I use egg wash to seal it works like a charm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merylschoice22"
},
"reviewBody": "Another suggestion for the flavor that reviewers would like is to add lemon juice to the finished sambousa as you eat it. This goes especially well with the cumin and lamb flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roro"
},
"reviewBody": "sambosa is DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna B"
},
"reviewBody": "I used the suggestion of others and added some chopped green pepper and cumin for a little extra flavor (especially since I don't like things too spicy so I left out the chile peppers). I also used lamb instead of beef, and rolled these like egg rolls instead of folding in triangles. They were really good, but I still think they needed more flavor. With some extra herbs I think these would definitely be a 5. So easy to make. I didn't have any problem getting my egg roll wraps to stay closed, and I used only water. I will make these again, and soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sneakyteaky"
},
"reviewBody": "There seems to be a lot of people who who have altered the flavour of this recipe. I took that to note and only prepaired one triangle of Sambousa and tested the flavour before I continued with the rest of the parcels. I agree it did need more salt and was OK on its own however I did use a small handfull of fresh chopped parsley and mint. In addition, I added a package of OXO powdered beef bouillon and served these yummy parcels with hot mango chutney on the side for a small gathering. Great finger food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chelsea Luke Fulliton"
},
"reviewBody": "The filling is right-on, but the egg roll wrappers were too thin and crispy to taste traditional to me. Sambousa I've had always has a thicker, more bread-like wrapper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gullo"
},
"reviewBody": "This was a very laborious dish but it was well worth it. To add that extra flavor that everyone wants, try smothering the rolls in a cumin sauce (made from cumin, black pepper, ground mustard, liquid cream cheese and milk.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carrie Bo Beary"
},
"reviewBody": "Well, this wasn't very good. My grocery store did not have egg roll wrappers, so I tried using the filling for empanadas. It was pretty flat even though I added extra spices. Will not make again...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tashina"
},
"reviewBody": "Very good, but needs a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BIGLUVABLEGAL"
},
"reviewBody": "I used most of this recipe but I did change a few things to make it more arabic. My husband is from Jordan so I made it like his mother does. I used lamb meat, added minced green pepper and ground cumin and garlic. This certainly make the dish more middle eastern in taste. And, word to the wise on the egg roll wrappers. It's best to either totally cool the meat before you put it in the egg roll wrappers or make only a couple at a time then fry them. They tend to really stick together and get wet if the mixture is hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "terrylynne"
},
"reviewBody": "My husband and I both found this recipe to be rather bland. I also found it much easier to use the traditional egg roll shape rather than the triangle (easier to fold and less oil gets inside) and found that a beaten egg holds the seams much better than the flour and water mixture. If I do try this recipe again I will definately be adding more seasoning like cumin, parsley, etc..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My husband adores these! If too much time passes between making these he always asks me to make some. Substituted lamb tastes alot better than ground beef and some black seed really compliment these flavorful little appetizers. Thank you soo much for posting this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a very flavorful recipe especially served with a sweet and sour sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KARIMAH2001"
},
"reviewBody": "If you use egg roll wrappers I would first roll them out a bit so they are not so thick. Then cut fill and roll them. If you add a teaspoon of ground cumin they are terrific, and not so bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it with lamb and it was okay but kind of bland. I'd use spring roll pastry instead of egg roll to make it lighter if I were to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A little time consuming, but easy, to make the pockets, well worth it...delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was fun to make, rolling them up took a lot of time and I had to double the paste for sealing. It has a very different flavor that I still can not decide if I liked it or not. Needed a little bit of salt added and we salted them just a touch after we fried them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JameelahS"
},
"reviewBody": "Wow I have been trying to learn how to make these tasty treats for years. They are great even with the kids. I really enjoyed these as well as my husband. I made them during the month of Muharram.\r\n\r\n Umm Asiyah"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16040/sambousa/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1235/appetizers-and-snacks/meat-and-poultry/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16040/sambousa/",
"name": "Sambousa"
}
}
]
}
}
, "about": [
]
}
]