				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sam&#39;s Famous Carrot Cake"
,"datePublished": "1998-11-07T22:01:32.000-05:00"
,"dateModified": "2022-08-24T12:56:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Brian D'Amico"
,"url": "https://www.allrecipes.com/cook/24321689"
}
]
,"description": "Sam&#39;s famous carrot cake recipe combines carrots, pineapple, raisins, walnuts, and coconut to make a wonderfully moist and memorable dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/e1P54YKqMPdz1Qyn3gpobZSgx3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2228327_original-d815b922303f4e6d8deedce9b1d4366c.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780289345001",
"description": "Watch how to make a 5-star carrot cake recipe.",
"duration": "PT4M19S",
"name": "Sam's Famous Carrot Cake",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2021/02/17/2228327_original.jpg",
"uploadDate": "2021-07-04T14:05:24.490-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sam&#39;s Famous Carrot Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "3255"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "374 kcal"
,"carbohydrateContent": "49 g"
,"cholesterolContent": "38 mg"
,"fiberContent": "3 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "259 mg"
,"sugarContent": "31 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"2 teaspoons baking soda",
"2 teaspoons ground cinnamon",
"0.25 teaspoon salt",
"1.5 cups white sugar",
"3 large eggs",
"0.75 cup buttermilk",
"0.75 cup vegetable oil",
"2 teaspoons vanilla extract",
"2 cups shredded carrots",
"1 (8 ounce) can crushed pineapple with juice",
"1 cup flaked coconut",
"1 cup chopped walnuts",
"1 cup raisins" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour an 8x12-inch pan."
} ,{
"@type": "HowToStep"
,"text": "Sift flour, baking soda, cinnamon, and salt together in a medium bowl; set aside."
} ,{
"@type": "HowToStep"
,"text": "Mix sugar, eggs, buttermilk, oil, and vanilla together in a large bowl; gradually add flour mixture until just combined."
} ,{
"@type": "HowToStep"
,"text": "Combine shredded carrots, pineapple, coconut, walnuts, and raisins in a separate bowl; stir into cake batter using a large wooden spoon until combined. Pour batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/e1P54YKqMPdz1Qyn3gpobZSgx3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2228327_original-d815b922303f4e6d8deedce9b1d4366c.jpg"
}
]
,"text": "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 1 hour. Allow cake to cool for at least 20 minutes before serving."
} ]
,"recipeYield": ["15"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esie Leoso"
},
"reviewBody": "I’ve made this cake recipe a few times follow the instructions and it will come out perfect! Rich with flavors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lory Lagoyda"
},
"reviewBody": "Nicely moist and delicious. Important to grate the carrots very fine so that they blend into the cake. Cream cheese frosting is perfect with this cake. I increased the recipe, keeping the ratios the same, to make 3 round cake pans, and split each layer in half (I didn't use one in the finished cake; it was tall enough with 5 layers! We ate the leftover with lunch the next day)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buzz"
},
"reviewBody": "I have made this 10 or more times. This cake is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fenar1201"
},
"reviewBody": "I love carrot cake so it made me a bit of a snob. This one was phenomenal. Moist, flavorful and not overly sweet. I made it exactly as stated. The only exception is that I baked it in two round pans since I wanted to frost."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mbraddock"
},
"reviewBody": "I have made this cake several times and it is delicious. Always a big hit with family. Thank you Sam for sharing your wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Dickson"
},
"reviewBody": "I have made this many times and it never disappoints. Absolutely the best texture and flavor. I like to use dried cranberries in place of the raisin sometimes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is an absolutely fabulous cake. It's been my family's \"go to\" birthday cake for 30 years, as well as used for several weddings. I LOVE that you don't even need a mixer to put it together. I've made a lot of little tweaks over the years...I use 1C coconut sugar to reduce the sweetness and sugar content. I used grocery shredded carrots (up to 3 cups) and steam them in the microwave to tenderize before adding them to the mix. I mix the pineapple/coconut/raisins first, and let the pineapple juice get soaked up by the dry coconut flakes and raisins. I also modified the recipe for altitude when living at 7200ft in Santa Fe, and it was wildly successful! I've made it as round layers and sheet pan, all good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tessa Kib"
},
"reviewBody": "Try it, I promise you won’t regret it! I’ve made this numerous times and it’s just simply the best carrot cake I’ve ever eaten. My friends and family absolutely love it and ask for the recipe. I use pecans instead of walnuts due to my sons walnut allergy and I leave out the raisins because I have to restrict my iron intake, but it’s still perfect with the changes. I pair this with the whipped cream-cream cheese frosting recipe from this site for a light, fluffy creamy, tangy cream cheese frosting that’s exactly what this flavorful cake needs to keep it from being too heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gingur"
},
"reviewBody": "So yummy with the pineapple and raisins. No other compares."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Howard Davis"
},
"reviewBody": "I made this for my grandson's wedding cake. It was easy to make the batter and assemble the tiers. It was delicious, and the guests begged to take the leftovers home. I used salted caramel buttercream frosting between the layers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thesfdude"
},
"reviewBody": "The best carrot cake I ever tasted and by far the best carrot cake I ever made!There are 4 cups of just carrots, raison, and walnuts in it! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mccordjolene"
},
"reviewBody": "I have made this recipe several times and everyone always wants the recipe. I make it just as instructed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve used this recipe many times and my family loves it! I used 1 cup of sugar instead of 1 1/2 and replaced 1 cup of flour with white whole wheat, it’s excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Michael"
},
"reviewBody": "I made as per directions but put in 2 9 inch layer pans as I wanted to make a birthday cake. Baked for same length of time. I should have reduced time by 15 minutes as per suggestion from one of the reviewers, but still moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth M."
},
"reviewBody": "Best. Carrot cake. Ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "briankane73"
},
"reviewBody": "Very good. I made almost exactly s as the recipe but used fresh pineapple because e we had it. I would omit raisins next time. They were overwhelming imo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really love it. My friends even order from me this lovely carrot cake. It not so sweet because i change to brown sugar. Thank you for the lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ellenbielut"
},
"reviewBody": "I made it to the letter the first time and loved it! Hubby said it wasn't \"moust\" enough but I interpret that as \"too dense\" because it was plenty moist. I'm baking it again today with a lighter load of coconut and walnuts and a smidgen less of carrots...we shall see. I will revert back to Sam's perfect cake if this doesn't make it a little less dense. Hubby had no problem boohooing when it was all gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Kraus"
},
"reviewBody": "This is my all-time favorite recipe! Everyone always loves it and I have many requests for the recipe. I have made it several times and the changes that I make to the recipe are only due to personal tastes. I use half the amount of raisins and omit the nuts in the cake. I decorate the top with pecans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia welch"
},
"reviewBody": "This cake is fantastic. I baked this cake for a friends birthday and everybody loved it. I will definitely bake this cake again. 😋😋😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YummyViv"
},
"reviewBody": "I’ve made this exactly as the recipe is written about 20 times and it is a big hit with carrot cake lovers everywhere (family, extended family, and work). I for one, don’t care for raisins, so if I were gonna eat it by myself, I’d leave them out. But everyone else likes them, and I use golden raisins. Also, I like that the cake is not gooey sweet, as the super sweet cream cheese frosting balances the sweetness and makes for a nice, balanced cake. To those that followed the recipe exactly and it came out dry, bland, or mushy, I’ve found two culprits: too much or too little flour, or maybe your baking soda isn’t fresh. Try spooning the flour into your measuring cup before leveling it and use baking soda that’s been recently opened. I’ve found that the most consistently successful recipes use flour in weight and not a by the measuring cup, because flour can get dense as it settles. A winning cake recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shortcake"
},
"reviewBody": "This carrot cake was excellent. Very moist and I also added cream cheese frosting. \"It's a keeper.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "newskool"
},
"reviewBody": "Family and friends love it! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OJMoCity"
},
"reviewBody": "Made as directed in two 9\" pans. Cooked for 30 minutes until toothpick came out clean. Paired with \"Basic Cream Cheese Frosting\" but made 1-1/2 times the frosting amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis C"
},
"reviewBody": "I would give this cake 10 stars if I could. Look no further you will not find a better carrot cake recipe! I make it the day before and refrigerate overnght which allows flavors to blend, so moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen"
},
"reviewBody": "Made this today for our New Year's Day party this evening and it was absolutely delicious. Everybody loved it. It is to me exactly what a carrot cake should be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mummy"
},
"reviewBody": "I wish that I had read the review from the reviewer FIRST, who said that it was unbelievable that so many people rated this well and basically changed the recipe. That it was an oily mess. I agree. How can anyone rate this well solely based on the recipe? It was awful and a waste of time, money and ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Zack Jarrell"
},
"reviewBody": "With all due respect to your grandpa, this was a fantastic cake...but it's more of a fruit cake that has carrots in it. It's very tasty, but there are just too many flavors outcompeting the carrots. I was suspicious of the recipe but made it anyways because of all of the great reviews. I would say this is a good carrot cake recipe for people that want the holiday appeal of a carrot cake but don't actually want carrot cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaylbgrtlarkin"
},
"reviewBody": "This is my go to carrot cake recipe. It’s extremely moist. It actually goes a long way! It only takes a small slice to get you right because each bite is packed with the ingredients and the flavor is amazing! I didn’t know Sam but his carrot cake is absolutely the greatest!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerrie McConaha"
},
"reviewBody": "Best carrot cake recipe EVER for sure. My dad loves this cake so much he asks me for it every time we have a family function. He never asks for anything so this is a huge complement to Sam and his baking skills God rest his soul. I’m by no means a professional baker and I get rave reviews every time. Thank u so much for sharing this delicious recipe with the world!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Waggoner"
},
"reviewBody": "The best carrot cake ever! I ALWAYS get compliments. I will never make a different recipe than Sam's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PinkDaisy36"
},
"reviewBody": "I did follow the recipe mostly and made some changes however it did come out really good. I didn't add any raisins, walnuts or coconut. I did do cake flour instead and I believe with regular flour it would have turned out better. Per prior reviews I did add nutmeg and did less cinnamon however next time I will add more cinnamon and also add some ginger and cloves. I did add 3 cups of carrots and that seemed to make a difference. I also baked in 2 pans instead of one for 45 minutes and made homemade cream cheese frosting. Great recipe and I will definitely try it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! I loved my family carrot cake recipe until I tried this one. They are very similar so I’m not sure what minor difference makes it so much better, but it is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "This was so good that I could have eaten the entire cake by myself in one sitting…but I didn’t."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Granger"
},
"reviewBody": "I don't understand the person giving it a 1 star.. This is one fantastic carrot cake. The only thing I modified was that it called for too many raisins. I backed them back by half and it was perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this recipe several times and it comes out great every time. I reduce the sugar to 1 cup. I've added more carrots and walnuts and that came out good too. For high altitude (7,000 ft. elevation), I added 1/2 cup of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitty"
},
"reviewBody": "Followed recipe, I did add 1/4 teaspoon nutmeg and 4 eggs instead of 3. Came out delicious. Everyone loved it and had a couple people asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "solsticeh"
},
"reviewBody": "Best carrot cake recipe ever! I just made this for my friend’s 40th birthday and my mom’s birthday (they were back to back). I followed the recipe exactly and just doubled it to make more layers. I used 5 9” cake pans with parchment paper in the bottom and baked them for about 30 minutes. Made one cake with 3 layers and one with 2. They were the perfect combination of moist and full of flavor. Everyone at both parties raved about the cake and wanted seconds. I will be making this again so I can get some leftovers just for me!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillilah"
},
"reviewBody": "I followed the recipe as is but added a shake of nutmeg. Perfect amount of moistness but not oily, &amp; not overly sweet. It’s missing something taste wise, I can't put my finger on it however I will make again. It’s going in the freezer until a small family party, so by then the cake would have sat longer &amp; the taste may be more definite.\n\nI baked in a 9x13 for 50 minutes &amp; done perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hary"
},
"reviewBody": "My mom makes this all of the time, it is a favorite in our family!!!! We love this recipe and recommend it to everyone !!! It is moist and sweet, not dry at all and it is perfect with cream cheese frosting!!!!!! Love this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pancho"
},
"reviewBody": "I hate to change a recipe and then rate it but I had to for health reasons. I used Splenda sugar blend, half oil and half apple sauce, used pecans instead of walnuts, no raisins, added 1/4 ts nutmeg, and used everything else called for in the recipe. I used 2 8in rounds and baked about 35 min. This is the first time I ever made a carrot cake and it was delicious. It was so moist. I made this cake for a friend's birthday and he said it was the best cake he ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddie"
},
"reviewBody": "Best Carrot cake I have ever had or made! Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JayandKitty Willis"
},
"reviewBody": "Delicious! I used self rising flour cuz that is what we have right now. Also I made cupcakes. It is a very delicious cake Thank God for good food"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMong"
},
"reviewBody": "Excellent cake. The only change I made was eliminating raisins, nor a fan of them. Frosted with a cream cheese frosting. Everyone loved the cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camilla Ekins"
},
"reviewBody": "I've made this three times. I like to substitute the raisins with cranberries because it gives a little punch through the sweetness. I also use a cream cheese maple frosting. Thank you Sam's family for sharing! It's an intense favorite of mine and my family *smiley face*"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMG123"
},
"reviewBody": "I've made this twice now. SO good, a hit! The pineapple and coconut had me nervous, but the flavor is subtle and they help with moisture and density. I didn't do anything to my shriveled raisins, but they plumped nicely in the batter. I added a dash of nutmeg and clove, no other adjustments. Will definitely make again, and add to the recipe book that I pass along to my kids. Thank you for sharing Sam's recipe. It's cool that it can be shared far and wide. I hope it brings a smile that his tradition lives on! It was a basketball for my son's birthday before we sliced it up - that's not mold - orange + black cream cheese icing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wendy "
},
"reviewBody": "made this today and its so good ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaylyne wern"
},
"reviewBody": "Genius recipe! Tasted great, and cooked well. I didn't add the walnuts or pineapple juice, but it still turned out good. My advice to people who (like me) decided to bake the batter into muffins is to keep them in for only about 15-20 minutes, instead of the recommended hour. Overall great experience!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Rogers"
},
"reviewBody": "This cake is insanely good. I made it as is and did not change one thing. I used two 9 inch pans and baked for 35 minutes. For the frosting, I used the joy of baking Lady recipe on YouTube for her carrot cake. Perfect! She adds a teaspoon of lemon juice for a slight citrus blast that really shines."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melisa"
},
"reviewBody": "This cake is absolutely delicious! I made it as is, only I omitted the raisins. I separated the batter into two cake pans and baked for 35 minutes as suggested by another reviewer. Make sure you grease the pans VERY well! My first batch was ruined because it stuck to the pan. Everyone said it was the best carrot cake they'd ever had. I frosted it with the whipped cream cheese frosting on this site- it was the perfect \"icing on the cake\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRANDIDEG5"
},
"reviewBody": "Not big raisin fans over here so I omitted them. Kept everything else the same except added 1/8 tsp nutmeg as recommended by other reviews. Baked mine in two 9-inch rounds for 45 minutes. Frosted with Cream Cheese Frosting II (adding extra cup of powdered sugar and extra 1/2 tsp vanilla was PERFECT). Scrumptious!!! So happy to find such a winner!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Barnes"
},
"reviewBody": "Love this cake - it is so delicious! I took a few tips from previous reviews and prepared it as follows:\n3 c carrot\nsimmer the raisins in orange juice\nonly 1 tsp cinnamon + a dash of nutmeg and tiny bit of allspice\nomit nuts and coconut (personal preference)\nI iced it with 16 oz. cream cheese, 1 stick of butter, 1 tsp. of vanilla, a sparing tsp. almond extract and about 3 c powdered sugar, sifted.\nDelicious and perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "Best Carrot Cake! Only change was to omit walnuts due to allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "I didn’t change a thing ! Just perfect !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Carter"
},
"reviewBody": "This is only the second carrot cake recipe I've followed but it was so much more moist and flavorful than the first, which was \"The Best One\" (according to the internet). I made these into cupcakes and it made 24 with a lot leftover so I also did 3 mini loaves. made up Cream Cheese Frosting II to top with"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harry"
},
"reviewBody": "This carrot cake is delicious. I made a half recipe and baked in a loaf pan. The only change I made was using half whole milk and half sour cream instead of buttermilk. ( I hate to buy buttermilk for a recipe and waste the rest as I don’t drink it). The cake was done in about 40 minutes. Soooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vonnadawn"
},
"reviewBody": "Ah-mayzing! Took another reviewers advice and lightly boiled the raisins before adding. Two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrachel"
},
"reviewBody": "I make this cake for my Mom's birthday since carrot cake is her favorite. We all love this cake. Great recipe as is with no alterations! I make the Whipped Cream Cheese Frosting recipe on here as well and it compliments it wonderfully since the frosting isn't overly sweet https://www.allrecipes.com/recipe/19108/whipped-cream-cream-cheese-frosting/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Very moist and delicious. There is a well known high end restaurant near us where their claim to fame is their carrot cake. They serve it hot with cream cheese icing. The challenge was on. \n I decided to make this cake and ice it when it was still warm. I made 2 slight changes. Hubs doesn't like coconut (it's a great mystery to me too) so I used extra carrots. I cannot eat walnuts so I used pecans. My only suggestion is to use a little more cinnamon or add some nutmeg or allspice to give it a little more flavor. \nThis cake beats the restaurants hands down. Thank you for sharing your grandpa's recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j greene"
},
"reviewBody": "My family and friends go crazy over the Carrot Cake! It can also be made GF by substituting the all purpose flour with gluten free 1 for 1 baking flour, turns out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mindrew"
},
"reviewBody": "Very moist, tasty cake. Baked it in 2 9” rounds for 35 minutes. I was surprised that there wasn’t a cream cheese icing listed with it. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail S"
},
"reviewBody": "Made it according to recipe and it was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "viv w"
},
"reviewBody": "It is more like a delicious fruitcake. Next time i will put 3 cups of carrot to bring out more carrot flavor. Its so delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JPaw5587"
},
"reviewBody": "Phenomenal Carrot Cake! Followed everything as stated - except for putting it in 2 - 9 inch cake pans, since I prefer a “frosted” center! Thank you so much for this recipe! It will be one I use forever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhona Webb"
},
"reviewBody": "Absolutely incredible. Everyone raved about this cake. Instead of oil I used unsweetened apple sauce so was extra moist. I read on another review to use nutmeg and wish I would have had it to use as I’m sure that would enhance the flavor. Also used milk with lemon juice as I didn’t have buttermilk. Truly a most excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Cee Jay"
},
"reviewBody": "Rave reviews! There’s no reason to have another carrot cake recipe. I generally don’t make changes to recipes that I’m trying, but due to an abundance of dried cherries and not so many raisins, cherries it was. Great tart counter-point to the sweet. I topped it with a bourbon butter-cream and fireworks! Sam may be gone, but his carrot cake recipe lives on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camille"
},
"reviewBody": "So moist and delicious and unfortunately fattening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy PSA"
},
"reviewBody": "Made this b4 for a gathering &amp; ppl loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pbgirl67"
},
"reviewBody": "This cake is the best carrot! It’s perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Hutchison"
},
"reviewBody": "Everyone loved it. Very moist and great flavor. A few minor adjustments. I only had a small amount of golden raisins so I added some dried cranberries (craisins) and they worked great. Next time I might add just a hint of nutmeg for a bit more complex tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paul Metzger"
},
"reviewBody": "Hearty and satisfying, not too sweet or oily like some carrot cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri"
},
"reviewBody": "Used pecans instead if walnuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen E. Cannan Bringhurst"
},
"reviewBody": "The most flavorful, moist, delicious carrot cake I have ever tasted! Wow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polly"
},
"reviewBody": "Delicious! I toasted the walnuts and coconut in my toaster oven just slightly to bring out their flavors. Also ran out of vegetable oil so I used peanut oil also. Left out the raisins because I don’t like them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terez Sullins Pederson"
},
"reviewBody": "This is the BEST carrot cake! Make as is and bake in muffin pans for 25 mins top with cream cheese frosting from Paula dean."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindii Fernandez"
},
"reviewBody": "Wow!! The only ingredients I omitted was shredded coconut &amp; raisins because I don’t care for them, but everything else was used exactly as the recipe calls! I baked it on a Bundt dish and set the timer @ 40min and it was perfect. It came out so moist and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vatech90"
},
"reviewBody": "I have made this cake several times now and I’ve had great success every time. I have followed the directions exactly as written and I’ve also omitted an ingredient here or there depending on preference. I recently made this recipe into cupcakes and used my favorite stabilized whipped cream cheese frosting to decorate them. If you make cupcakes reduce your baking time to 20 minutes and they will come out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristin.ellis77"
},
"reviewBody": "You guys have it right, this was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Msjenita08"
},
"reviewBody": "I’m a first time baker and wanted to give it a go. I had most of the ingredients on hand except to pineapple, walnuts, and buttermilk. The recipe was easy to follow. I had listed with family what we all volunteered to make for Christmas. This recipe was my planned dessert. My mom got a carrot cake from Walmart so whatever reason. I proceeded to make this cake anyway. Let’s just say my cake came out better than Walmart store bought version. I used a popular cream cheese frosting recipe to top it off from AR app as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Redhead"
},
"reviewBody": "Honestly I just love this recipe! It was Christmas Eve during Covid when I finally made this recipe. I was out of cooking oil! Oh my! I subbed w/butter that I halfway melted. I omitted raisins as I didn’t know if the couple of folks I was going to dine w/on Christmas, liked them. I added freshly grated nutmeg, because I love that flavor. I used Ceylon cinnamon which is really good for you, and a little less intense flavor, than regular cinnamon. I used all non-GMO ingredients, including the unbleached white organic flour. I used Truvia sugar to replace the white sugar, as I am diabetic. I cooked in a glass parchment lined 13 x 9 pan about 45 min or til toothpick comes out clean. Yummy! \nMerry Christmas everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "1momlady"
},
"reviewBody": "This is the best carrot cake ever! I made it exactly as written, I did use golden raisins as I prefer those in other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi26"
},
"reviewBody": "I get compliments every time I bring this carrot cake to a party. It's my favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janice"
},
"reviewBody": "It was delicious and very moist. I made it as a layer cake with cream cheese icing. Next time I will make 2 layers instead of 3. I did 3 because there seemed to be so much batter and I thought it might overflow the pans. This is a very dense cake and doesn’t rise very much, so I think 2 will work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "114 Italianate"
},
"reviewBody": "I made this cake yesterday for our anniversary plus we had a dinner party so it was served as dessert. Just make the recipe as is, I made minor preference adjustment such as 1/2 white sugar and 1/2 brown sugar,and instead of 2 tsps of cinnamon it was 1 cinnamon and one pumpkin pie spice. Made the cream cheese frosting from another recipe here. Also I did it as a layer cake again just my preference. Don’t listen to any naysayers it’s a wonderful carrot cake recipe and the rest of my family is looking forward to me making it for them soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LesaBear"
},
"reviewBody": "I have made this several times. Exactly as written. Perfect. I hate when people change a recipe and then rate it. You’re rating your recipe, not the original."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ThatBarberDude "
},
"reviewBody": "this was a good recipe. my family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella"
},
"reviewBody": "Turned out great! Only made a few slight changes; added some nutmeg and allspice, used toasted pecans instead of walnuts, no raisins, and I made it in three 6” round pans, which only took about 35 to bake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria03"
},
"reviewBody": "This is the best carrot cake I’ve ever tasted. It’s now requested for get togethers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlene"
},
"reviewBody": "This is a great cake but needs more salt. I was afraid 1/4 teaspoon was not enough so I added 1/2 instead. Once done I couldn't wait to try and sure enough it needed 1 teaspoon for my taste. But all in all a great cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peggy"
},
"reviewBody": "Great carrot cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Devin Farrelly"
},
"reviewBody": "Fantastic. I made it exactly as written but I omitted the nuts. The pineapple, raisins, and coconut were indiscernible, but absolutely necessary. They melded with the carrots beautifully. I used the frosting with two 8oz bricks of cream cheese, 1/2 cup butter, and about 6 cups powdered sugar. I made this for my very picky father in-law’s birthday and he loved it. So did everyone else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosa maria"
},
"reviewBody": "Recipe was perfect, didn’t use coconut just more shredded carrot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Çostèllô JÈb"
},
"reviewBody": "It is very delicious!!! im not a carrot cake lover but this one taste really good, I must say i nailed it :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal MacEachern"
},
"reviewBody": "I will never look for another carrot cake recipe again. Brought it to an anniversary dinner and everyone gobbled it up and asked where I found this recipe. thank you so much for sharing and making me look like a cake rockstar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hailey Gerrits"
},
"reviewBody": "This carrot cake was amazing. Super moist and not too sweet. I made it exactly as is, except I divided it into two round cake tins and baked for just 45 mins, as per another review. I frosted it with Cream Cheese Frosting II from this site, which was the perfect combo. There wasn’t a single slice left after my husband’s birthday. Thank you for an incredible recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Little Christine"
},
"reviewBody": "My 1st. Simply delicious!! Thanks for sharing your recipe and making the instructions easy to follow. My Nana would be so proud."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anniem2"
},
"reviewBody": "I love cooking, I am ok at baking, i read reviews, I interpret them, but no joke this recipe I followed as directed, and my family ate it they were impressed....then when I ate a piece I was blown away.....it was that good...... I don’t review things lol like lightly...this is Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillg"
},
"reviewBody": "I made this recipe into Carrot Cake muffins. Baked for 20 mins until the toothpick came out clean. Used the large cupcake pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Passionista"
},
"reviewBody": "This carrot cake is the best I everrr tasted, hands-down!! No one could believe I baked it, including myself. My newest favorite! \n\nI did use a different frosting recipe, which I've made for years, but the cake was so moist, tasty... truly delish."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8270/sams-famous-carrot-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16701/desserts/cakes/sheet-cake/",
"name": "Sheet Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8270/sams-famous-carrot-cake/",
"name": "Sam&#39;s Famous Carrot Cake"
}
}
]
}
}
, "about": [
]
}
]