				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sam&#39;s Sourdough Waffles"
,"datePublished": "2020-06-19T00:06:32.000-04:00"
,"dateModified": "2022-11-04T10:55:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sam Nemati"
,"url": "https://www.allrecipes.com/cook/3506952"
}
]
,"description": "This sourdough waffle recipe is easy to make and produces delicious waffles that are golden and crispy on the outside and super fluffy inside!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zGXEdLJLCUUfxQZJIM2RaBCsvE0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4481488-4c692d58db4d4def8bc8ae58dfbbc373.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sam&#39;s Sourdough Waffles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "169"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "291 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "0 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "653 mg"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"1.5 cups water",
"1 cup sourdough starter",
"0.5 cup vegetable oil",
"2 eggs",
"2 tablespoons white sugar",
"2 teaspoons salt",
"1 tablespoon water",
"1 teaspoon baking soda" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix flour, 1 1/2 cups water, and sourdough starter together in a large bowl to make batter; cover loosely with plastic wrap and let sit in a warm place until filled with large holes and bubbles, 4 hours to overnight."
} ,{
"@type": "HowToStep"
,"text": "Stir oil, eggs, sugar, and salt into the batter; mix well to combine."
} ,{
"@type": "HowToStep"
,"text": "Whisk 1 tablespoon water and baking soda together in a small bowl until dissolved. Fold into the batter with a rubber spatula."
} ,{
"@type": "HowToStep"
,"text": "Preheat a waffle iron according to the manufacturer&#39;s instructions."
} ,{
"@type": "HowToStep"
,"text": "Pour about 1/3 cup batter onto preheated iron and bake until crisp and golden, according to manufacturer&#39;s instructions, about 3 minutes. Continue making waffles until all remaining batter is used."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT280M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetocook"
},
"reviewBody": "I never leave reviews, however, this recipe was way to deserving of a good review to not! The best waffles I have ever had made by anyone! Changed the whole waffle game for me! These were light, fluffy, crisp. I can never leave a recipe alone, so the modifications I made were, I used half whole wheat flour in the flour portion (because I feel it is healthier and I like the flavor and texture), I also added a heaping teaspoon of cornstarch, because I have always done this with waffles for outside crispness. This is a WOW recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were delicious. A great recipe to use for my leftover starter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These waffles were spot on! Even drenched in berries, their juices, and maple syrup they held together beautifully and didn't turn to mush. There was one slight change I made and that was using oat milk for the water, but I only added 1 cup of the milk and half a cup of water. Delish! Keeping this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corbae"
},
"reviewBody": "I used melted butter instead of oil; left out the salt, because I didn't think it needed more than was in the butter. I left my starter/flour/water mix to ferment for almost 24 hrs. These are the lightest, crispiest waffles I have ever eaten in my 50+ years on this planet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Been making these for several years now for breakfast the day after Thanksgiving &amp; for Christmas day breakfast. Best recipe I have found for SD waffles, save for the salt which I cut in half to one teaspoon. Just took Mother out of the fridge for a feeding tonight &amp; tomorrow morning before I make up a triple batch tomorrow night!! BTW, use real butter &amp; maple syrup to enjoy these! No margarine or artificial flavored corn-syrup syrup!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very easy recipe and light waffle, just have to remember to start the night before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stickiecake"
},
"reviewBody": "Best waffles we have had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Makes a light and crispy waffle. I added a bit of baking powder, and a heap of cocoa powder to make chocolate flavoured ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jul Lzz"
},
"reviewBody": "These are amazing ! I add blueberries, cheddar &amp;jalapeños, plain. All are awesome. Make a great sandwich too :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a good recipe! I recently started experimenting with sourdough and this was a fun addition! That being said, like a few other reviews said the recipe is a bit salty. It's not inedible levels, especially if you add sweet toppings, but I would recommend decreasing the salt to 75% or perhaps even half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I leave very few reviews. If something is really really bad or if something is really really good. This sourdough waffle recipe is the best hands-down there’s nothing better. Absolutely delicious waffles crispy on the outside with the light fluffy chewiness on the inside. My only modification to the recipe was to add a table spoon of shredded cheddar cheese once the batter is on the iron."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So easy. Delicious. They freeze perfectly too. Pop em in the toaster and they are brand new. I use this recipe for my family all the time. The neighbors all even ask me if they can buy them from me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food4Fuel"
},
"reviewBody": "So delicious - great recipe as is! They freeze nicely and we just pop them into the toaster straight from the freezer anytime we want one :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Sharick"
},
"reviewBody": "So good! Still selling my kids my kids on sourdough, but covered in honey and butter they all still seemed to like it.\nI did use freshly ground whole wheat flour, and had to use a flax egg because i ran out of eggs. And I cut the salt in half like other commenters suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Ann Stephens"
},
"reviewBody": "We love these waffles! Super easy to mix up the night before, then get up and cook fresh waffles. It makes 5 large Belgian waffles so we freeze the extras. They freeze well with parchment between them; just put frozen waffles under the broiler 2 minutes per side and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggies 8"
},
"reviewBody": "Pretty good! Having to plan ahead and let the starter sit over night. Light and fluffy! Added a mashed banana for a little flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S. Jackson"
},
"reviewBody": "I'm giving 5 stars to a recipe because it's basic proportions were good, even though I altered it. I halved the recipe and it still made 5 waffles. I used whey (leftover from yogurt making) instead of water and 1/3 cup whole wheat flour + 2/3 cup all purpose flour. Served with my yogurt and blackberries, it was delicious. My husband, who normally eats only 1/2 a waffle, ate the whole thing. Worth the effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redfoot67"
},
"reviewBody": "Great recipe that is loved by everyone. Requested every time family is visiting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Xu"
},
"reviewBody": "Not usually one to write a review but theses BLEW me away. Used my $15 Amazon mini waffle maker and they’re SO crispy and light golden with that perfect bread/toast/carbohydrate crunch with half the recipe’s amounts. Can’t believe I almost missed out on something so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veggie gal"
},
"reviewBody": "these were excellent. light and fluffy. not too sweet with real maple syrup. garnished with banana and blueberries. thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarah jackson"
},
"reviewBody": "These were perfectly light and crisp. I added 2 tsp of baking powder, almond extract, and some cinnamon. These would fabulous without the sugar as a savory waffle too. This will be my go to sourdough waffle. Thanks for this gem of a recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Elgie Thompson"
},
"reviewBody": "These were absolutely delicious! Would not change a thing. The bit of baking soda adds to a crisp finish. Will make this again and again! Also a good use for my sourdough starter that needs to be used regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CFmomoffive"
},
"reviewBody": "These are the best waffles I’ve ever eaten. While I love sourdough bread, I often have excess starter to use and thought it would be fun to make something different. Wow! The texture of these waffles is out of this world— crispy on the outside, soft and slightly stretchy on the inside. Just divine. We ate them with sweet toppings the first time I made them and then incorporated cheddar and herbs into the batter the second time, topped with bbq pulled pork and mashed potatoes. \n\nI don’t use vegetable oil and therefore subbed in butter and reduced the salt slightly. Other than that, I made them as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Waffle perfection.\n I've made it many times and the taste is the best ever. If you make it the night before it has more of a sourdough taste. If you make it in the morning, still delicious. If you freeze the extras and warm them in the toaster, still superb. You can't possibly go wrong with this recipe. \nNot to mention, it's a great way to use up a cup of sourdough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy "
},
"reviewBody": "Great flavor, soft and chewy on the outside, light crispy crust. Family approved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie"
},
"reviewBody": "Just made these and this will be my go to waffle recipe. Perfect. I didn’t follow recipe so I am sure they would have been better if I had prepped as directed. However just putting the sourdough flour and water together and letting it sit for an hour made amazing waffles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Byron Hof"
},
"reviewBody": "The family loves these waffles, I did add 1 teaspoon of vanilla, and wow they taste and smell like vanilla birthday cake. Fresh berries and some whipped cream also with a splash of vanilla. It is very hard not eat more than one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "These waffles are amazing!! Crispy on the outside and fluffy on the inside. We use no other recipe! The reason I gave four stars is I found the waffles a little too salty with 2 tsp. I reduced it to 1 1/2 tsp. Tastes amazing if you refrigerate leftovers and pop them in the toaster the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mysticjem"
},
"reviewBody": "I love this recipe! I have been experimenting a lot with sourdough lately. These are crisp yet soft and fabulous. I can hardly wait to try them with some fried chicken!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linny"
},
"reviewBody": "PLANT BASED friendly swaps still made DELICIOUS waffles! **Used flax eggs instead (1 T flax, 2.5 T water per egg, mix &amp; let sit 5 minutes) **applesauce instead of oil **added 1 mashed banana **added a few shakes of cinnamon &amp; as others had suggested, reduced salt to 1 tsp. &amp; added a small splash of vanilla. Crispy outside, chewy insides, excellent flavor all around that we all enjoy snacking on throughout the day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lujain"
},
"reviewBody": "it tastes really bad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dianehuntster"
},
"reviewBody": "The waffles baked beautifully! Crispy golden brown on the outside, light and fluffy on the inside. Having never tasted sourdough waffles, at first bite, the taste is off a bit. Could just be my sourdough starter. I still gobbled mine up, as did the kiddos. This recipe made 12 square waffles in total."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I made them exactly as the recipe stated and they came out perfectly! So delicious, crispy on the outside, light and fluffy on the inside. I made them yesterday and my daughter is already asking me to make them again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I've been making these at least once a week for the past several months. After playing the the recipe, I have found that I like it much better with these two changes: \n1-reduce salt to 1 tsp\n2-substitute applesauce for most of the oil. I still add about 2T of oil, but sub the rest with applesauce and it's great. Way healthier. You can actually substitute applesauce (or plain yogurt) for oil in most baking recipes in case you didn't know!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey"
},
"reviewBody": "This is a fantastic recipe. Everyone in my family loves it. I am hard pressed to think of a waffle that I like better than this one. Thanks for posting, Sam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Wilson"
},
"reviewBody": "Make these! I followed the recipe exactly, only addition was 1 1/2 tsp vanilla. Perfectly crisp outside. fluffy inside. Some of us topped w fresh raspberries and banana. Some of ate them plain right off the waffle maker..they are that good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl A"
},
"reviewBody": "These are so good. I made the flour, water, and discard last night before bed. I followed the recipe pretty close, other than I cut the salt to 1 tsp and added 1 T of vanilla. They are so light and that little crisp on the outside, yum! They were really good with my homemade maple syrup. This is definitely a keeper recipe to use for my sourdough discard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rubyhead72"
},
"reviewBody": "I’ve made this several times now. The first time I didn’t read all the directions and just dumped everything in. They turned out great! Then I would subsequently forget each time to read all the directions. Each time, they’re crispy and yummy. I will try someday to plan ahead and follow directions. But until that happens, it’s a fantastic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emsquared"
},
"reviewBody": "I halved this recipe, and may have messed with the proportions a bit when mixing the sponge the night before, but these were amazing. My son was a super-fan after one bite, although he admitted he wasn't sure how he'd feel about them beforehand. Super light and extra crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace"
},
"reviewBody": "Made some this morning with my brand new successful starter and they were delish! They were a hit with My picky waffle-loving boyfriend too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndimarcus"
},
"reviewBody": "Fantastic, great results every time! I stir up 1/2 recipe for the two of us every Saturday night for Sunday breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deneen"
},
"reviewBody": "These are delicious for waffles and pancakes! As Belgium waffles, it is crisp on the outside &amp; light &amp; fluffy on the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shipra Mitra"
},
"reviewBody": "excellent recipe. made with whole wheat flour and reduced salt. added nutmeg for flavor. fluffy and crisp!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pepper"
},
"reviewBody": "Great Recipe. I was out of eggs so added 1 banana instead &amp; used 1TB of apple cider vinegar in place of the water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leep"
},
"reviewBody": "This is THE best waffle recipe. I make them for my kids about once a week during Covid 19. So delicious. I use a Belgian waffle iron."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Record"
},
"reviewBody": "Fantastic waffles... my favorites an"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Smith"
},
"reviewBody": "WoW! I wasn’t sure about sourdough waffles but this is a great recipe. I made one as is but then played with the rest of the batter. I added vanilla and chocolate chips and yumm then I did applesauce, vanilla and cinnamon and holy moly that was the money sooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarscamp"
},
"reviewBody": "I LOVE this recipe. I follow it exactly except I swapped the baking soda for baking powder because I hate the taste of baking soda. Comes out great every time. I make it at least once a week - whenever I feed my starter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flyingnanaof10"
},
"reviewBody": "I made it and it turned out perfect! My starter is almost 50 years old and I’ve made many different things with it. This was an excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it and it turned out perfect! My starter is almost 50 years old and I’ve made many different things with it. This was an excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Greer"
},
"reviewBody": "I have searched for the perfect recipe that my family would really like- this is it!\nI am very happy to have another great use for my sourdough starter. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Lauterio"
},
"reviewBody": "These are perfect just as written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Violinerjack"
},
"reviewBody": "I make these all the time and freeze them. Soooo good. My husband loves that they are crunchy on the outside and super fluffy inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wrajhm"
},
"reviewBody": "Perfect the way they are written. We also made them with honey instead of sugar and still delicious. Then we tried applesauce instead of oil and still delicious. We do let the first step sit overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth"
},
"reviewBody": "These fluffy and delicious waffles are a fantastic way to use up sourdough discards. We make a double batch and freeze the extras. We reheat the frozen waffles in the oven at 400 degrees for about five minutes per side to restore crispness. They also keep in the refrigerator for a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JLepri"
},
"reviewBody": "Best waffles I’ve ever made and better than I have ever had in a restaurant. Made the recipe exactly except divided in half to make enough for two with leftovers for the week. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J D"
},
"reviewBody": "These have become the family favorite. Every Friday afternoon I feed the starter and in the evening mix up the batter so it is ready for Saturday breakfast. Awesome waffles!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherry"
},
"reviewBody": "Made the recipe exactly as described and froze the whole batch thinking I would have a month of waffles ready to go. My husband found them and they were gone within the week. My husband claims them to be the “best waffles of his life” and thats saying something. I seem to also recall him insisting that I don’t tinker with the recipe! On my second batch today, exactly was described!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody Lee Morgan"
},
"reviewBody": "These waffles are great! The only thing I changed was the salt and oil I used a 1/2 tsp of salt and I substituted apple sauce instead of oil. \nThey are light and fluffy and I am so glad I found this recipe. I think I will try freezing them like one of the reviewers suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bud Jahn"
},
"reviewBody": "Brilliant procedure. I beg you to reduce the salt in your cooking. You are personally on the far end of the salt taste spectrum. If you consciously reduce your salt intake, your palate will recalibrate towards towards 1/4-1/2 of what you calling for in a receipt.\nBut there will be a “bland” period. I love and respect your cooking skills however you are currently way past reasonable with the salt content. Good luck!\nThank god I’ve got a sauna to sweat this breakfast out my pores! Otherwise fantastic receipt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebRock"
},
"reviewBody": "These are a hit! It’s my families favorite for Sunday breakfast. I make the batter, let it sit out, covered with a tea towel overnight....I also cut the salt down to 1 teaspoon. We love this and its a great way to use my starter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Mcclellon"
},
"reviewBody": "This is the best recipe ever! The only one I will ever use. I never liked my home made waffles and hadn’t made them for years. So happy to have found this delightfully tasty, crispy, addicting waffle. I use avocado oil for both the batter and to oil the griddle. I also add a scant tablespoon of cinnamon to batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "caryn"
},
"reviewBody": "Very tasty, but batter is thin. Waffles were tasty, but because of the batter consistency, I overfilled my waffle iron making quite a mess. I’m going to try this as pancakes next time as I think the batter is more like that of pancake batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Hansinge"
},
"reviewBody": "I needed to use up some of my sourdough waste and this was a great recipe to try. \nI didn’t alter much of the recipe but I did cut back to about a tsp of salt and used warm water since it didn’t specify. My eggs were at room temp too and because I hadn’t planned early enough I boiled a cup of water in the microwave then put the first portion of the dough mixture to sit . It started to bubble around the 2.5 hour mark and was ready in 3.5 hours total. Excellent recipe and will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennerbean"
},
"reviewBody": "Delicious waffles! I've made them twice now. The first time I didn't let the sourdough starter and flour sit long (I didn't read that part in time). They were amazing. The second time I let the starter and flour sit overnight. The batter was super bubbly and made for odd waffles (lots of air holes). After a couple waffles I realized that the batter needed more flour. Adding extra flour to get a more normal waffle batter consistency made all the difference. And, as other have said, these are just as good the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Taramasso"
},
"reviewBody": "I’m a newbie to sourdough. Made this with my discard and they couldn’t have been better! Boyfriend was totally impressed. Only variable was that ,y Belgian waffled used about 3/4 of a cup per waffle so it only yielded 7. And 4.5 minutes to cook. Came out crispy on the outside and fluffy on the inside. Can’t wait to try this as pancakes!! Thank you, Sam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Jones"
},
"reviewBody": "Yum...when a friend gives you sourdough starter...you make waffles! Sam's waffles were great! Everyone loved them and so easy...we will make again. Even our picket eater ate them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Sullivan"
},
"reviewBody": "These waffles were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Walter Faulkner"
},
"reviewBody": "VERY VERY LIGHT"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Scott"
},
"reviewBody": "Yummy! My sourdough starter LOVED this recipe and it bubbled like beer. Super light and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redcaro"
},
"reviewBody": "These are the best waffles!!! They are so fluffy and crispy. I have tried a few other sourdough waffles and this I the recipe I am going to keep using! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Beck-Noble"
},
"reviewBody": "Delicious!! Crispy on the outside, nice a soft and fluffy on the inside. Great flavor!! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DylanKip"
},
"reviewBody": "Excellent use of discard. I made it in the morning and let it sit for about 3.5 hours. I used the discard from that morning so it was room temperature which may have given it a better start. I also used 1/3 cup of oil as many suggested. These were delicious and I appreciated not having to have buttermilk in the recipe. This is definitely a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha A"
},
"reviewBody": "this recipe will change your life!!! perfect crispy fluffy waffles with a hint of sourdough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KarenG"
},
"reviewBody": "Great taste, Made it the evening before in order to give starter feed time to ferment"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Mathews"
},
"reviewBody": "These are the lightest, crispiest, most delicious waffles I've ever made, and I've made a lot! thank you for sharing your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tedder"
},
"reviewBody": "I've tried various waffle recipes, and these are the amazing combination of light &amp; airy, yet a bit chewy once you bite into them, with tons of flavor. I reduced oil to 1/3 cup and they were great. Also tried them as pancakes and though they didn't rise much, the flavor and texture are outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "newcook"
},
"reviewBody": "I tried my first (test) batch without letting it stand and they were excellent! Letting another batch sit overnight. I cut the salt based on another reviewer’s suggestion but disagree and will add it back in for the next batch. I have tried many waffle recipes and this is the best method so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kartmom"
},
"reviewBody": "My family loved these waffles! They were so light and crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauramaf"
},
"reviewBody": "Made these exactly as written leaving my leaven to rise overnight. I love waffles and these were the best! They are so flavorful that syrup is almost optional."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grant Smith"
},
"reviewBody": "Words can not describe how great these waffles are... Super light, airy, crispy and just the right amount of chewy. These were so good, the poor bacon got neglected."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ann"
},
"reviewBody": "Amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gloria"
},
"reviewBody": "I put chocolate chips in my waffles, will make them again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne Martindell"
},
"reviewBody": "Perfect recipe! I used self-rising flour so I dismissed the baking soda in this one. Turned out spectacular taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Flores"
},
"reviewBody": "Best waffles!! I was skeptical at first, but they were soo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill King"
},
"reviewBody": "I followed a few others and reduced the amount of oil to 1/3 cup and salt to 1tsp, also added a dash of vanilla. Good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nicole S."
},
"reviewBody": "I used this for pancakes and they were a hit! I will be making them again, but will probably cut down the amount of oil if using for pancakes. I can see how this would be great for waffles to help them not stick as much, but the pancakes were a little oily to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Hinkle"
},
"reviewBody": "These were phenominal, I used a little less oil and salt as some other reviewers suggested. Light, delicious and so easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan McNeill"
},
"reviewBody": "ALMOST exactly as I've made for over 30 years, but the extra egg and putting the water/baking soda together separately THEN adding it (plus a smidge of vanilla) made it more excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxie G."
},
"reviewBody": "I added about 1/4 of the flour as whole wheat. Outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Fun it make and try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie Raymond"
},
"reviewBody": "I followed the recipe exactly, and they turned out wonderful! In my waffle maker it made 8 large rounds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrirwin7"
},
"reviewBody": "Reduced the recipe to 5 servings and was able to make one waffle and one small pancake. Both delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lan Nelson"
},
"reviewBody": "Best waffles I’ve ever had! Forget the ones at the restaurant, these were so tasty and the texture was perfection."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sodabear"
},
"reviewBody": "Made as directed, only cut in half. Made in old fashioned waffle maker and they turned out perfect. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Martin"
},
"reviewBody": "This is the best waffle recipe I've ever made! I didn't realize waffles could be this fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nisha Parikh Scullino"
},
"reviewBody": "Easy way to use up discarded sourdough starter. Whole family loved them. Great with frozen blueberries on top. :)\nI make these every weekend and we don't tire of them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorota Bateman"
},
"reviewBody": "These are THE BEST WAFFLES I have ever eaten. I have had a yeast waffle before, and frankly, hated it. This does not taste like a yeast waffle, nor does it taste like sourdough. It’s sooooo airy and crispy and OMG.No proper Easter breakfast with family today due to social distancing, so I made these waffles to make up for it. Well, I’m so glad I did. If you have a sourdough starter, please do yourself a favor and make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynette Sullivan"
},
"reviewBody": "My husband loves waffles. He reports that these waffles are the best he’s ever had IN 64 years. \n\nThe salt seems like a lot but if you add the correct amount of sugar, the balance is perfect! We used avocado oil because it was all we had on hand and they were PERFECT."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/246917/sams-sourdough-waffles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1316/breakfast-and-brunch/waffles/",
"name": "Waffle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/246917/sams-sourdough-waffles/",
"name": "Sam&#39;s Sourdough Waffles"
}
}
]
}
}
, "about": [
]
}
]