				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sauce Rosee"
,"datePublished": "2000-03-09T19:23:01.000-05:00"
,"dateModified": "2023-02-10T17:33:46.000-05:00"
,"author": [
{"@type": "Person"
,"name": "YGBELAND"
,"url": "https://www.allrecipes.com/cook/42191"
}
]
,"description": "This rose pasta sauce is a creamy, rich, slightly sweet tomato sauce flavored with white wine and herbs served over pasta for an elegant but easy dinner."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ggpl2xb1sv9g7JghBfULwrZlkeU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/17166-sauce-rosee-Beauty-3x4-1-de7290c2da8b4015b976e4bf81e2074e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sauce Rosee"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "299"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "344 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "50 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "344 mg"
,"sugarContent": "4 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.5 pound refrigerated cheese tortellini",
"6 tablespoons olive oil",
"0.5 teaspoon dried basil",
"0.5 teaspoon dried thyme",
"0.5 teaspoon dried oregano",
"0.5 teaspoon dried parsley",
"0.25 teaspoon dried red pepper flakes",
"2 tablespoons minced onion",
"2 tablespoons minced green bell pepper",
"1 tablespoon minced garlic",
"7 ounces tomato sauce",
"1 tablespoon white sugar",
"0.5 teaspoon chicken soup base",
"6 fluid ounces heavy cream",
"0.5 cup white wine" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil; stir in tortellini and return to a gentle boil. Cook uncovered, stirring occasionally, until tortellini float to the top and filling is hot, about 4 minutes. Drain and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat olive oil in a large saucepan over medium-low heat. Stir basil, thyme, oregano, parsley, and red pepper flakes into hot oil."
} ,{
"@type": "HowToStep"
,"text": "Add onion, bell pepper, and garlic; cook and stir until onions are translucent, about 2 minutes. Pour in tomato sauce and bring to a boil. Stir in sugar and chicken bouillon until dissolved."
} ,{
"@type": "HowToStep"
,"text": "Reduce heat and stir in cream and wine; bring close to a boil, stirring constantly. Gently stir in tortellini and serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So good! More onion and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sid Johnson"
},
"reviewBody": "Just finished eating supper and.....it's a winner!\nNo cream, so, 4 oz cream cheese and 2oz milk.\nChopped up a 1lb Roma tomato (super sauce) instead of tomato sauce. \nNo drinking wine, so, 1/4 cup of fresh cooking wine.\nThe mix of herbs is right on the money. I'm fortunate to have them all freshly dried in my cupboard. I did add a dash of freshly ground pepper.\nWonderfully creamy and the fresh tomato flavor is outstanding.\nI added 1 lb of shrimp as the cream cheese melted and served over fettuccine.\nI'll definitely be making this one again....with all the proper ingredients....\nbut I'm not sure it could be much better!\nEnjoy this tasty and adaptable recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhelmig"
},
"reviewBody": "This sauce was very good. We ate it with sautéed shrimp and scallops over fettuccini."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katie"
},
"reviewBody": "I’ve made this probably more than 20 times. I’ve made it with shrimp and fettuccini, chicken and penne, sweet Italian sausage and ravioli. I have committed this recipe to memory and I will make it over and over again in the future! Absolutely love and everyone says it is restaurant quality!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tracy Danberger"
},
"reviewBody": "Pretty good all in all. But I suggest you add the wine early , before the tomato sauce, to cook off the ‘boozy’ taste. \n\nSauté it for 10 minutes or so after you add the wine and before you add the tomato sauce m, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "This was decent. It was slightly tangy, which I didn't expect. I used 3/4 of the sugar and omitted the bell pepper, and added the wine earlier with the hope that some of the alcohol would burn off. Probably won't make again, although my kids and husband thought it was ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juukker"
},
"reviewBody": "This recipe is excellent! However, after the first time making it I decided 6 tablespoons of oil is a bit over the top. You can cut the oil back by using only 2 tablespoons and not lose anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barbeblanc"
},
"reviewBody": "This recipe is tasty. Great way to use left over wine. We haven’t bought any jars of ready made sauce since we have been making this. Definitely a keeper in our home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelsea Mitchell"
},
"reviewBody": "This recipe is great but i change it up abit ! My boyfriend doesn’t like tomatoes that much, so i use roasted bell peppers instead of tomato and it is so good . i also add sausage in with the pasta and the sauce ! \nThanks for the recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron Yohe"
},
"reviewBody": "I made this sauce for Tortellini that was stuffed with aged prosciutto and Parmesan cheese. It created a fantastic balance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shekhah Al Ali"
},
"reviewBody": "Amazingly delicious.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sport1girl"
},
"reviewBody": "This was easy and delicious! I had made roasted shrimp and put chunks of that in it. Yum. Followed the recipe except that I didn’t use any bouillon. My daughter often doesn’t like pasta sauces but she loved it as well. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily Schreiber Moe"
},
"reviewBody": "Very good. I followed recipe except cut down the olive oil and reduced to 1/2 T sugar, per other reviews. We really enjoyed this. I served a family of 5 - 3 adult portions &amp; 2 kids. Felt I needed more, so next time I will double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BMari"
},
"reviewBody": "I created an account just to rate this sauce. It is SO good. I made it attempting to replicate a dish i love from an italian restaurant with black squid ink pasta. I forgot i didnt have oregano, so that was left out on accident. Per the other reviews, I reduced the oil to 4 tablespoons. I added lump crab to the sauce and also sauteed shrimps, scallops and added mussels at the end. I also didnt realize the chicken base was low sodium, so the sauce could've used a bit more salt. Also skipped the sugar afraid that it would be sweet instead of savory. All in all, delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "theresa"
},
"reviewBody": "I made this as is and wouldn't change a thing! This sauce had wonderful taste, I added cheese tortellini instead of other pasta. Add some bread and it was a great meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reem Gira"
},
"reviewBody": "very delicious :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ursula Voges"
},
"reviewBody": "I didn't get to finish my comment.... even my picky eater husband ate it up! This a a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Buckley Grant"
},
"reviewBody": "I recommend simmering the wine a little before adding the cream, to let the alcohol evaporate out of there. Otherwise, it tastes too much like wine. Delicious recipe! I put mine over Penne with leftover chicken my hubby grilled a couple of nights ago. It was a great way to use leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Fantastic recipe! My family inhaled it. I follow the suggestions of other s and doubled the recipe. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AlI"
},
"reviewBody": "The foundation of the recipe is amazing! I took some suggestions from others and used 3 tbsp of oil and omitted the thyme and added 1/2 tsp of marjoram instead. I also added a 1/4 tsp more of basil. I cut back on the heavy cream to 4oz and added about a 1/4 cup of parmesan and since I didn't have wine, I added about 2 tbsp of apple cider vinegar (amazing touch). I absolutely loved it! I will definitely make it again with the same adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Schmitt"
},
"reviewBody": "This is one of my FAVORITE recipes ever. Pour it over some tortellini and YUM! Instant comfort food. Love love love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeanneo"
},
"reviewBody": "This is one of my first sauces. I was trying to find something to go with some chicken tortellini. This was great. I did have to alter some things based on what I had. I decreased the olive oil to around 3T &amp; used fresh basil since I had it. I left out the sugar because of other reviews &amp; didn't have the soup base. I used 1 c. of whole milk instead of cream and used 1/2 c. of chardonnay. With all the changes it was fairly thin but I just simmered it until it was the thickness I wanted. Tasted great! Everybody asked for seconds! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "duboo"
},
"reviewBody": "Great base recipe that I will use again with the changes that I made. I did cut the oil in half, as suggested by some. I cubed chicken breast and tossed in a bag with flour, salt and Italian seasoning. Then I browned in the hot oil. I set aside, deglazed the pan with water and added in more oil as necessary. I added in the wine at the same time as the tomatoes. I used Italian tomatoes instead of sauce and mashed them. I also added a couple of tablespoons of tomato paste. After sauce was made, I did thicken the sauce a little. Tossed in the tortellini and chicken and served as is. The base recipe probably needed none of these changes, but I felt that my changes add a bunch. Thank you for giving me the head start on this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derrick&Trish"
},
"reviewBody": "I added seafood and bacon. It was the best rose sauce I've ever had in my life. Better than any restaurant, bar none!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smartmom"
},
"reviewBody": "It was a quick and easy recipe. I added chicken and substituted skim milk for the cream. I would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodie"
},
"reviewBody": "I read the reviews before making this and was a little worried. I cut the oil and sugar in half, and switched to 2 tsps of Italian spice mix instead of measuring out all of the individuals. I served on top of potato gnocchi, garnished with Parmesan cheese and had asparagus on the side. me and my family all enjoyed it very much. the sauce was everything I expected it to be and I am very happy I tried it. would def have this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olivier Bolduc"
},
"reviewBody": "Awesome recipe, both kids polished their plate before mom &amp; dad"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This was AMAZING! All four of my kids and hubby loved it! I was ready to suck up this sauce with a straw. I made it as the recipe states only adding the wine at the same time as the tomato sauce to cook down the alcohol. I did omit the sugar due to the fact that I had a sweet wine not dry. I over ate and can't wait til I can make this again! Thank you so much for this GREAT recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae Desaulniers"
},
"reviewBody": "This could possibly be the best pasta sauce I have ever tasted! Ate it with prawns on linguine. Doubled the recipie and that only made 4 good sized dinners. Not sure how it could have served 12? Maybe we use more sauce than average? Oil could be halved and I added 2tbl of flour (for double recipie) to thicken at end because it was too runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott Simpson"
},
"reviewBody": "Very, very good with Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dane Fisher"
},
"reviewBody": "Decent recipe, but requires a few crucial changes: I got by with only 1 - 2 tbsp of olive oil…6 seemed like way too much; replace tomato sauce with tomato puree since tomato sauce already has salt, spices, herbs and sugar added….i think this is why so many complain of this recipe being too sweet; add wine to veg and cook off the alcohol before adding the tomato puree; use fresh parsley if you can and add just before adding the cream...dried parsley has almost no flavor, but i do think that dried thyme, oregano and basil work better for this recipe; probably goes without saying, but add salt and pepper to taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rachel Edwards"
},
"reviewBody": "I followed this to the letter and didn't like how sweet it turned out plus it left a weird after taste in my mouth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mittbitt"
},
"reviewBody": "This was very tasty. The whole family loved it over 3 cheese tortellini. I didn't have any wine, thyme, red pepper flakes or chicken bouillon so I left them out and substituted the chicken bouillon with an equal amount of salt. I also reduced the sugar to a tsp per other reviewers' suggestions. Even stripped down it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anwylyd"
},
"reviewBody": "The whole family said we should make this again. My 10-year-old requested less wine next time, but the rest of us liked it exactly as it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwdd"
},
"reviewBody": "Good as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasantoli"
},
"reviewBody": "Taste: 5/5\r\nEasiness: 4/5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewCook"
},
"reviewBody": "I was alone for dinner after the kids went to bed, and had a craving for Rose sauce. Luckily, I have the All Recipes app and I found this sauce. It was FANTASTIC! I did make some small adjustments: I left out the sugar and wine, and subbed 3/4 cup milk for the cream. I used linguine instead of tortellini. It was so easy and quick, plus I have some left for tomorrow (and going to give some to the kids as well. I'm sure they'll love it!) Thank you so much, this is going to be a staple from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BIGDADDYWF"
},
"reviewBody": "WAY TOO MUCH OIL, a little heavy on the sugar, and runny. If you get past that, it is a flavorful sauce. The thyme gave it a different flavor than what you'd expect in a sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Rojas"
},
"reviewBody": "I will definitely make this sauce again! I accompanied it with eggplant and the combination turned out to be very very tasty! I didn't have white wine, so I omitted it and it turned out to be very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vonnie"
},
"reviewBody": "After reading the rateing I think the key to this is adding the wine AFTER cooking the onions green peppers and garlic. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shrimp Toast"
},
"reviewBody": "The flavour was delicious, but I find if you add the white whine after you simmer the spices in oil, and let it boil down, you get the full flavour impact but a thicker sauce. Very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duane"
},
"reviewBody": "Everyone loved this. I eliminated sugar and green pepper cut oil in half and used fresh Italian parsley and Basil. I have made alot of pasta sauces and my family told me this was my best yet. Without the cream this would make an amazing marinara sauce as it tasted incredible without the cream as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tegan"
},
"reviewBody": "This recipe is a staple in our house now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "W. Adkisson"
},
"reviewBody": "Oh my gosh! This was incredible! Made exactly per the recipe except added the wine before the tomato sauce to let the alcohol cook off. Served over chicken mozarella ravioli, but we could eat this sauce on anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msmythe365"
},
"reviewBody": "Incredibly tasty and not too difficult - just make sure you have everything lined up before you start. I like to cook about a pound of chicken first and throw it in with the sauce and noodles at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hallman123"
},
"reviewBody": "The recipe was a good stepping stone for me. I eliminated the green pepper and increased the onion to a whole med. onion. I didn't have any tomato sauce so I used 4 ozs. of tomato paste and 1 cup of warm water. Used half &amp; half instead of heavy cream. We really liked it with the changes. Maybe next time I will make it as directed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Orilia Q"
},
"reviewBody": "Not crazy about this one. Tried it on tortellini and found it was at first too sweet, and then the wine overpowered it. It was also a bit thin. It may work better as a sauce on a chicken dish, perhaps, but not as a pasta sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOANNEH2"
},
"reviewBody": "very nice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ejcelli"
},
"reviewBody": "Fantastic sauce. I too omitted the sugar. It doesn't need it at all. I also messed up and accidentally put 14oz of tomato sauce in it so I attempted to double everything. The entire family LOVED this. Even my picky 10yr old. We wanted to lick our plates. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LRod"
},
"reviewBody": "Fabulous!! Tastes like restaurant quality. Per other recommendations, I made using only 1/4 c olive oil and brought wine to boil in separate saucepan then added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Gelsinger"
},
"reviewBody": "I’ve made this sauce probably 20 times and it is soooo good every time. I don’t change it at all. Sometimes I add shrimp, sometimes chicken, sometimes sausage and ravioli. It’s good any way. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kassixlassi"
},
"reviewBody": "A little too runny. I'll reduce the oil next time. Great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PenWrenn"
},
"reviewBody": "Used one bag med shirt and cooked till bright pink while boiling water, omitted sugar (we don't like sweet sauces) and green pepper (doesn't agree) and only a pinch of thyme (introducing to my family I learned to add half of new spices to them or very limited) .... Also followed other comments by boiling wine first then tomato sauce. I also used fresh parsley, onion and garlic. Rather thAn dry (doubled parsley). I think we eat too much cooked for 6? And fed 3..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doombringer"
},
"reviewBody": "So good... I like to reduce the wine right after the the onion, garlic and peppers are done cooking, and also cut down on the sugar and pepper flakes (a pinch or two of each is lots). Other than that, it's perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanamon"
},
"reviewBody": "Best rose sauce ever! Never having it at the restaurant again :) The sauce I made turned out a little sweeter cause I used a pretty sweet apple juice as a substitute for the white wine but it still tastes amazing, sweet spicy and savoury all in one ^.^"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "organicKook"
},
"reviewBody": "Wow, what a flavour-rich sauce, followed to a T except for using fresh basil and thyme and used red wine (reduced amount) instead. Delicious! First time I had ravioli with no need to add parmisan. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Starco"
},
"reviewBody": "Loved it! Just cut on the red pepper flakes a bit if not a big spicy food fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EO3180"
},
"reviewBody": "I prepared it exactly as per instructions. It is amazing! My son said that it was way better than the sauces he's had in expensive restaurant dishes. I tasted the sauce mixture before adding the heavy cream, it was amazing! I will definitely keep this recipe \"as is\" and make many times, but I'm going to try a different dish and prepare it without the heavy cream and wine to mix with some pasta. Thanks so much for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Curtain"
},
"reviewBody": "I was concerned after looking for the negatives, and hearing some people just didn't like it. I was a bit apprehensive, because Rose sauce from a restaurant around the corner is simply awesome- if people said they didn't like it surely it cannot be the Rose sauce I love.\n\nThis recipe didn't disappoint. In fact it impressed. I looked at the images and saw a bit of \"broken\" inconsistency. But my recipe turned out amazing.\n\nI used hunts Tomato Sauce(Roasted Garlic)\nI also used Wylers Chicken Bouillons w/ spices)\nI used Moscato as my white wine.\n\nIt doesn't get much better than this. It will definitely be a dish I make for the rest of my life!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I had a pound of cheese tortillini so I doubled the sauce as well. Ended up having a lot of sauce - enough for an additional pound of gnocchi, as well. I did not add the sugar nor wine. It was on the thin side, so I thickened it with corn starch/water. Topped with grated cheese. We loved it! I'll make it again. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paxton"
},
"reviewBody": "This recipe is a 99% score! The only reason I can't give it 100% is because I've never exactly followed it to the letter. At the end of Step 1 in the recipe I add and brown about the equivalent of 1 minced Italian Sausage per person (in the ingredient list above make it 3/4 per head - I find spicy-sausage sometimes overpowers so be careful). Remove from casing first of course. I did use sugar the first time but found it negligible and I don't need any extra unnecessary sugars. I do add a 1/2 tsp of Marjoram to the seasoning in Step 1; just my preference. The final difference is that I find this recipe goes well with either Rigatoni or Penne. This recipe is all about the sauce so I want a pasta that can deliver large portions of sauce per-bite. Friends / family etc... are stunned by the quality of this meal when they have it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "Wow and wow again! So frustrating to make new recipes that everyone raves about that we don't like! Finally, this was a winner! It's was super delicious and easy to make. I used both shrimp and cheese tortellini. Will definitely serve with garlic bread to soak up the yummy sauce. Definitely a meal to make for dinner parties as well! *** One update... I have made this recipe about 20x.... after you cook onion and green pepper, ADD THE WINE... and let is cook down; then add in your tomato sauce, etc. The last time I made this I forgot and added wine to recipe at end and it did not turn out as yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELYNE"
},
"reviewBody": "Rich and tasty. My daughter loves to help make it. Serve it with pasta and sauteed chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lilorchid82"
},
"reviewBody": "I re-read the recipe thinking that I must have forgotten something, b/c I found it a little boring. I think maybe a little lemon juice or zest would've helped. I added sliced sausage, and still didn't get that \"bam.\" Anyways, the only change i made was I skipped the sugar. O, and I halved the oil like the reviews suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki"
},
"reviewBody": "Absolutely delicious. I boiled the wine before adding the tomato sauce like another viewer suggested. I also added a few tablespoons of cooking creme to taste and some parmesan cheese before serving. I also added sugar to taste. Absolutely delectable, will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pupsmum"
},
"reviewBody": "This was just not our cup of tea......found the sauce rather sweet. Might try it again and omit the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsparker"
},
"reviewBody": "I think the recipe has great potential with a few tweaks. I agreed with other reviewers that the wine needs to be boiled for awhile to reduce the strong alcohol taste. I also agree that the thyme flavor was overpowering. And lastly the sauce was a bit thin. Perhaps less thyme and less wine? I served with chicken and motzarella ravioli."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bblewitt"
},
"reviewBody": "Great sauce - I'm sharing with all friends and family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cas"
},
"reviewBody": "I loved this sauce. I made it as written except for cutting down the olive oil to 3 tbsps. Since I'm eating a low carb diet, I grilled some shrimp and laid it on a bed of fresh, raw spinach and poured some of this sauce on top with a few grinds of black pepper and a sprinkling of Parmesan cheese. It was absolutely delicious. I have some left for tomorrow in the fridge and I'm having a hard time refraining from going and eating it by the spoonful. Thank you so much for the brilliant recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melynne ryder"
},
"reviewBody": "Family loved it and it was fast and easy to make. I didn't have any wine on hand and it was still amazing. Paired with basic pasta recipe on this site. Can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Anderson"
},
"reviewBody": "I made a double batch and I cut in half the olive oil. I like my food a little spicy so I added 1 tsp of cayenne pepper for just a mild hint of hot. I added shrimp and served over spaghetti topped with parmesan with garlic bread on the side. Great cream sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joeyblue"
},
"reviewBody": "We really liked this sauce although I started with less olive oil (6 tbls. not necessary). I tossed grilled chicken and penne with the sauce and it came out very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HYPATIA1219"
},
"reviewBody": "Four stars bedause this is a good base for a rose sauce, but the seasoning is off, and more basil and marjoram works better than thyme. However, individuals can tweak the seasoning to their own taste. For those who didn't like the sweetness, note that the better (and more authentic way) to 'sweeten' a too acidic tomato based sauce is to increase the amount of ONION and sweat them down in the oil well at the beginning of the cooking. Balance of sweetness is also dependent on the white wine used and DON'T leave it out if you want authentic rose sauce. if you prefer a less \"sweet\" sauce, use a fruity pino grigio, not chardonnay which is much too assertive and astringent, or a blended white table wine. If you do want a bit LESS acidic sauce use a slightly sweeter wine like a Riesling. It should definitely be added in sooner rather than later, also, to mellow the flavor, before adding the cream. Don't use a wine you would not drink -- especially not 'cooking wine' which is bad wine with salt added. All that said, yes if you are not going to use more onions and (RED)bell peppers, then definitely cut back on the oil. Using more of those two veggies will help incorporate the oil better. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "armeals"
},
"reviewBody": "Fantastic recipe! We substituted some liquid beef stock for the chicken bouillon, and used cayenne instead of red pepper flakes (because we didn't have any) and it still came out wonderfully. Also added some baked fish on the side for protein. Felt easy to make, and had just the perfect combination of sweetness and savoury italian flavours. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leahnelson02"
},
"reviewBody": "This was a really good base recipe. I followed it almost exactly and would probably omit the sugar and use less bouillon next time. I may also try this recipe with less cream and add a diced tomato. We added chicken adouille sausage and made fresh pasta. This really worked well with with this sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherLilly"
},
"reviewBody": "Loved this sauce. I did make a few changes, but that was due to personal preference (added more garlic and red pepper flakes and cut sugar in half) and what I had on hand (fat free 1/2 and 1/2 instead of cream). Also, I added the wine with the tomato sauce as others had suggested to give the alchohol time to burn off. I sauteed some shrimp and spinach to add to the tortellini, and it was delicous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "Very tasty indeed! It was a tad too sweet but that's a personal preference. Overall very delicious and easy to put together. Great weeknight treat. Thank you for a simple yet tasty recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "diskris"
},
"reviewBody": "This is great! I made it with shrimp and spinach tortellini. I cooked the shrimp with a little olive oil and salt and pepper and took them out of the pan. Only used 4 table spoons of olive oil. Omitted the sugar. Added the wine before the tomato sauce, brought it to a boil and then added the tomato sauce and bring that to a boil. Tossed everything together at the end. Delicious! You can really put this on any pasta! I didn't cut up the pepper small enough so next time I am going to make sure it is very fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Occasional Cooker"
},
"reviewBody": "This sauce is addictive! I need a 12-step program for it. Excuse me as I lick the bowl so I do not miss a drop of this sauce. Did I mention I really like this sauce? I just added this to my family favorites folder. I followed the directions until the tomato sauce. I substituted spaghetti sauce for that, and then substituted a light alfredo sauce for the heavy cream. I served it with tortellini. Excuse me while I go into my Sauce Rosee coma now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cindy in Pensacola"
},
"reviewBody": "This tastes a little like tomato soup from a can doctored up a bit. I followed the directions except for using a bit less thyme and red pepper flakes, otherwise, followed exactly. I think it would be better with petite diced tomatoes instead of the sauce but otherwise it was ok. I think I'll stick with my recipe for Linguine with Shrimp and Tomatoes recipe here on AR."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B RUS"
},
"reviewBody": "Loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DISCOBUNNY"
},
"reviewBody": "I had to make a couple of substitutions based on what I had on hand (milk instead of cream; water + 2 chicken bouillon cubes in place of wine/chicken soup base). Because I had to use milk instead of cream, I ended up thickening the sauce just slightly. I used about 1 tsp cornstarch and a few drops of cold water and dissolved in a small bowl, then added a few spoons of the hot sauce to it to temper, then added all back to the sauce pot and cooked until the consistency had thickened just a bit and was perfect. \n\nThis is an excellent sauce. So nice in warmer weather when you don't want a heavy, meaty sauce. Thanks for sharing your recipe, YGBELAND - we love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SavvyTech"
},
"reviewBody": "This recipe has wonderful flavors, however I thought the amount of oil and the amount of sugar was a bit much. I did not use the amount of oil called for, but I did use the two tbsp of sugar and although we all liked the sauce, we felt it was a bit too sweet. I will cut the sugar back a tbsp next time and add more red pepper flakes for a bit more spice. All in all this is a very nice recipe that I will definitely use again with a few minor modifications. My husband thought this sauce would be good with Shrimp added. May try that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEARLYBARBIE"
},
"reviewBody": "This was quite tasty! I did make a heavy cream substitution because I did not have heavy cream, the only fault I found with doing this is that the butter made the dish greasy. Maybe next time, I'll leave the butter out and just use milk or try it made with buttermilk. I always have dry buttermilk in the fridge and don't ever buy heavy cream. I made this a couple of nights ago and I am wanting to make more. I do think the sauce could have used a small amount of flour to bind everything together a little bit more, but it could be that the butter (grease) was causing it separate. Overall....I really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allison2714"
},
"reviewBody": "Yes, yes! My husband loved this, and the rest of our family(including young kids) thought it was good, too. My only issue was that there was WAY too much oil. I think next time I will halve it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tlouderb"
},
"reviewBody": "LOVE THIS RECIPIE! Only thing I will do next time is add a little more crushed pepper to suit my hubby's spicy taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RMSR"
},
"reviewBody": "I didn't like this, but the boys did and so I would make it again for them. Subbed milk for the half&amp;half and fusili pasta for the tortellini and added shredded chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slatez"
},
"reviewBody": "I omitted the sugar. I don't think you need that unless your tomatoes were too acidic. I also didn't have any red pepper flakes, so I used a dash of cayenne pepper instead. I think it gave it a spicy kick without overpowering any of the other flavors. This sauce is delicious! I used it over tortellini noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kadeeship"
},
"reviewBody": "This was great! I made it with shrimp and fettucine. I, too, used less oil- about 4 tbsp. Put the wine in with the herbs for about 5 mins before adding the sauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twinmir11"
},
"reviewBody": "I made this recipe, but with a few adjustments after reading the reviews below. I made for four and EVERYONE LOVED it.\nInstead of 6 tablespoons olive oil I did 3. I did 3 tablespoons onion. I used a red pepper instead of green. I did only 1/2 tablespoon sugar. I added 1 tablespoon of flour to thicken the sauce. I also added a cup and a half of halved cherry tomatoes and 1 cup of peas. I really think that spruced this recipe up. Made it look really good too. I served with cheese tortellini, but also thicker homemade spinach fettuccine from an Italian grocery store. absolutely delicious. I highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina&Zara"
},
"reviewBody": "Was delicious and really easy to make! Ingredients are those you would usually have on hand. Has full taste to satisfy most palletes. I used stewed tomatos (blended) as opposed to tomato sauce which made it a lighter sauce which we prefer. Will become one of our family favs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sogood"
},
"reviewBody": "Used ketchup instead of the tomato sauce and white sugar and it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Parker Theriot"
},
"reviewBody": "This recipe was delicious! I did make a few changes because of the items I had on hand. Instead of white wine I used a splash of tequila. I sauteed shrimp with the vegetables. At the end, I also added snow peas. This was a real winner in our house. Next time I might use less heavy cream since we are trying to watch out waist-line around here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli"
},
"reviewBody": "OMG! This was the BEST sauce EVER! I served the sauce with tortellini and sauted chicken, and it was better than I could have expected at any five-star restaurant!!! Had this three nights ago, and I'm preparing it again tonight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sirpurrcival"
},
"reviewBody": "Very tasty and silky but those with Heart conditions beware. There is nothing healthy about this concoction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erika Davis"
},
"reviewBody": "Tasty sauce. I had to sub half and half for heavy cream, but it was still pretty good. I omitted the wine and just used a pinch of sugar and it was sweet enough for our taste. The kids loved it and I thought it was ok. I would probably make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coldbluegrace"
},
"reviewBody": "This is a great recipe! I added beef bacon pieces and smoked salmon. I had to substitute in sour cream for the heavy cream because I was out. Then, I poured it over a 7 cheese tortellini.\r\nIt was a HUGE HIT!! Served with a fresh salad for a quick &amp; easy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "needsomezzzs"
},
"reviewBody": "Very good. Whole family enjoyed it. I made as is except I didn't have heavy cream and used the half and half. Two thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cain"
},
"reviewBody": "Fantastic addition to my Pasta dishes. Was refreshing to make my own sauce. I used a Chicken Italian Sausage and it was Great. Next time I will reduce sugar by 1/2. Well done!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17166/sauce-rosee/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
"name": "Pasta by Shape Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/515/pasta-and-noodles/pasta-by-shape/tortellini/",
"name": "Tortellini Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17166/sauce-rosee/",
"name": "Sauce Rosee"
}
}
]
}
}
, "about": [
]
}
]