				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sausage Stuffed Mushrooms II"
,"datePublished": "2019-04-02T02:42:51.000-04:00"
,"dateModified": "2022-10-09T20:28:26.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sam"
,"url": "https://www.allrecipes.com/cook/24327912"
}
]
,"description": "Pork and cream cheese provide a flavorful, creamy stuffing for cute little mushroom caps."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/addjKEKt01U4kTOLT8l4TpGeZsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4597121-sausage-stuffed-mushrooms-ii-rocksoutforcheese-4x3-1-f168b8fc71f14a7095bf3b8850fd7b82.jpg",
"height": 900,
"width": 1200
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sausage Stuffed Mushrooms II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "329"
}
,"cookTime": "PT3M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "178 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "40 mg"
,"fiberContent": "0 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "219 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.5 pound ground pork sausage",
"1 (8 ounce) package cream cheese, softened",
"1 (8 ounce) package fresh mushrooms, stems removed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the broiler."
} ,{
"@type": "HowToStep"
,"text": "Place sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain and transfer to a medium bowl."
} ,{
"@type": "HowToStep"
,"text": "Blend cream cheese with the sausage. Stuff mushroom caps with the cream cheese and sausage mixture."
} ,{
"@type": "HowToStep"
,"text": "Arrange stuffed mushroom caps on a medium baking sheet. Broil in the preheated oven 2 to 3 minutes, until lightly browned."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT23M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chris Keller"
},
"reviewBody": "Pretty bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iwnbb"
},
"reviewBody": "This is a perfect base recipe... The brilliance is that I ALWAYS have these 3 ingredients on hand... My only \"always\" change is that, like others, I up the sausage to cream cheese ratio and add the stems to the filling. Other than that, I just add \"whatever's in the fridge\" (or don't). I use Tennesee Pride Hot Sausage (because I'm never without it) and make these regularly. I switch them up up by adding \"whatever's in the fridge\"... Some onions, some brown-butter breadcrumbs, some blue cheese... A touch of red wine does magic (though you need to cook a little longer to make sure you cook off that raw wine taste.) Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "I do not eat pork, so I used all beef bratwurst for this and added a little Lowery's seasoned salt , a bit of gorgonzola, and some dried chives to the cream cheese I made 3 doz--and NONE were left!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri"
},
"reviewBody": "I have made this many times! Easy, and everyone loves it. I bake at 350 for 10 minutes is only change (never have good luck when using my broiler!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggy D"
},
"reviewBody": "Simple and tasty! I used 2 containers of mushrooms. I put the stems, sausage (hot italian - use 1 lb instead of 1/2 lb), and cream cheese in the food processor with 1/4 parmesan - makes it easier to stuff. Sprinkle parmesan on top. Like others I baked at 400 for 10 minutes instead of broiling. \n\nI love the fact that they freeze well. Just place on a cookie sheet in the freezer until frozen then store in a ziploc. Then I can take out whatever number I need - from a handful to the whole batch. Just bake for 30 minutes if frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rayshelle"
},
"reviewBody": "Such a tasty recipe! And so simple! Everyone loved these. I made no changes to the original recipe. \n\nThanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jess Morris"
},
"reviewBody": "I used hot sausage and added a 1/4 tsp of cayenne pepper and 1/4 tsp of onion powder and some minced garlic. It added much better flavor in our opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Sarnelli"
},
"reviewBody": "Turned out delicious and easy prep and assembling. Great for a tapas style dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joey"
},
"reviewBody": "Sooo good! I also add Parmesan cheese and chopped onion and mushroom bits into the sausage and cream cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "Very easy and tasty. Use larger mushrooms. Even delicious the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jordan "
},
"reviewBody": "Made these for a party and everyone liked them! I recommend adding parmesan cheese to the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "These are AMAZING already shared with family and plan to make again for football parties!! I did make a few adjustments based on others recommendations: \n\n - used 3/4 pound spicy hot Italian sausage and 1 diced jalapeño \n\n- prior to stuffing mushrooms (after removing stems), I cooked them in microwave upside down for 1 minute on a coffee filter. Upon removing from microwave I set mushrooms caps on a dry filter and allowed water to drain and cool. Guys this is the KEY to perfect mushrooms. I cooked one without doing this and one with and the difference was incredible (mushroom precooked in microwave was crispy on bottom vs. water logged. \n\n- after stuffing mushrooms with sausage, cream cheese, jalapeño mix I rolled the tops in Panko bread crumbs and shredded parmesan. \n\n- placed in air fryer at 380 degrees for 8 minutes. --- PERFECTION! \n\nThank you for this recipe and also to reviewers who recommend sweating mushrooms in microwave on coffee filter first. I had no clue how much water mushrooms had!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Great game day recipe to go with other finger foods. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia"
},
"reviewBody": "I baked them @350 for 20 mins.. They were perfect and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Libby Scheffler"
},
"reviewBody": "yes were delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kailey"
},
"reviewBody": "I made this as a Thanksgiving side dish and everyone loved them. The mushrooms were one of the first things to go. The only thing I would say is the measurements were a little off we more filling than we did mushrooms. Overall though I would recommend and I would defiantly make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole Fussell"
},
"reviewBody": "Awesome! I chopped up the stems as one reviewer suggested and sauteed them with the hot Italian sausage. I used 1# of sausage to 8 ounces of cream cheese. I also ran the mixture through my food processor to make the stuffing easier as suggested. Snugged them into a glass baking dish and baked at 400 for 20 minutes. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyAZ"
},
"reviewBody": "This was easy and delicious! Our guests thought the mushrooms were great. I must admit that I changed it a little.\nI used an Italian spicy sausage. The little extra spice just bumped it up for our friends that enjoy things a bit hotter. \nNot too much for our mild friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Definitely would make this again!! Family loved them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "My family liked this just as presented and also with 1/8 cup of chopped onions and 1 tablespoon chopped cilantro added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy W"
},
"reviewBody": "I only had 6 medium sized mushrooms, so I can't wait to make these again! We had some leftover baked frozen breakfast sausage so I cut it into very small pieces. I chopped and sauteed the mushroom stems with a green onion, some garlic seasoning and a little Emeril's seasoning(we use it in everything). I added the chopped sausage to this and cooked another couple of minutes. Mixed with the cream cheese and filled the mushrooms. \nSprinkled a bit of parsley on top and baked at 350 for about 10 min before finishing under the broiler. SO GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Wilson"
},
"reviewBody": "For 3 ingredients, this is amazing! I used the hot breakfast sausage. My only complaint (not really) is that it called for 1/2 pound of sausage to 8 ounces of cream cheese. A 1 to 1 ratio gives great results"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rachelcollins27"
},
"reviewBody": "I would also give it 5 stars but changed a few things around. I used hot Italian sausage instead of pork and mixed in some Parmesan cheese along with the cream cheese. Then I used a glass baking dish and put olive oil all over the mushrooms and filled the bottom of the dish until the bottom of the mushrooms were covered. Bake at 375 for about 15 minutes. Pull out and cover with mozzarella cheese, bake for another 10 minutes or until cheese Is melted. FANTASTIC!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jackinthewoods"
},
"reviewBody": "Very tasty but awfully heavy and high calorie. I am going to try something that is more like stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "These are delicious! However, the filling was enough for an entire pound of mushrooms, so plan to either halve the sausage/cream cheese, or double the mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LL C"
},
"reviewBody": "I gave this five stars because it's so close to the one I make that I knew it had to be awesome. The one I make.....I brown the sausage, then drain on paper towels. When cooled a little, I add it to the block of cream cheese and approx. 4-5 chopped green onion tops and mix it all together and then stuff the mushroom tops. Bake at 375 for approx. 30-45 mins depending on your oven. That's it!!!! No seasonings or spices!!!!\n\nLOL.....these last about 5 mins at a party or get-together and I usually spend a ton of time passing out the recipe. Can never seem to make enough!!!\nAnother tip that I use is: I usually double the sausage, cheese and onion mixture and make a cheeseball with the other half for those that either don't like mushrooms or can't eat them. LOL....that doesn't last long either. It's AWESOME folks!!!!!\n\nLITERALLY.....3 ingreds + the mushrooms!!! No seasonings or spices!!! Doesn't get much cheaper than that!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laxmom"
},
"reviewBody": "I added garlic and onion to the sausage while it was cooking. They turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn M."
},
"reviewBody": "Seems too simple to be so delicious. I always brown the pork sausage with a little wine which helps break down the texture. These are so easy and always disappear quickly at any party. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel"
},
"reviewBody": "These were just as fast and easy as promised. I made them in a muffin tin which worked very well. A perfect party appetizer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "terri"
},
"reviewBody": "Very easy recipe. I read reviews before making these. I added parmesan cheese to the sausage cream cheese mixture and then topped the stuffed mushroom with more parmesan cheese. I baked my stuffed mushrooms at 350 for 15 minutes and then the broiler to brown the tops. I took these to a family get together and came home with an empty dish. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky Johnson"
},
"reviewBody": "I added two pieces of chopped up cooked bacon to the recipe for more flavor. When they had finished I added a little chopped up parsley for color. Also I decreased the cooking time by five minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktrisch"
},
"reviewBody": "I followed other reviews and made some changes. I saute the chopped up stems with the sausage. I used a full lb of sausage. I also bake at 400 for 10 minutes and its perfect. Friends and family LOVE this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kbretz"
},
"reviewBody": "Good. Some of my kids liked it.... even though they don' t like mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I made the following changes, using some tips from other reviews &amp; they came out great. Used 3 hot Italian cased sausages (cut away &amp; discarded the casing), red pepper flakes, garlic salt, Italian seasoning. After cooked, added 4 oz cream cheese. After stuffing the mushrooms, topped with shredded Parmesan. Cooked @ 375, 13 minutes, then broiled for two, on a parchment covered cookie sheet. Yield - 9 HUGE mushrooms. Not too rich; just right!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Kay"
},
"reviewBody": "I added some mozzarella cheese and toasted breadcrumbs on top and broiled until lightly browned. They were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy A"
},
"reviewBody": "I've been making this appetizer for 42 years! The only differences are I use a full pound of pork sausage and bake instead of broil. Most requested appetizer I've made and always the first to go.\n\nIf there happens to be any left, it's great chopped on in scrambled eggs the next morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "John Schneider"
},
"reviewBody": "I was not impressed with this recipe. It was ok but I have had better, much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Robinson"
},
"reviewBody": "my wife made these one year for Xmas dinner, everyone was shocked, but slowly took a couple and nibbled in... they were a hit, and now (7years) later they are traditional in our xmas dinner and a few times throughout the year just because. mjnce green onion in the sausage and cream cheese mix and let cool on wire rack or the juices will turn the caps soggy and have a very pungent earthy taste, unless you like that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anke Bieler"
},
"reviewBody": "Delicious and SO easy! I browned the ground pork with some chili seasoning, added sautéed chopped onion and hot sauce to the cream cheese mixture. Toped each stuffed mushroom with a little parmesan and shredded cheddar. Broiled them for 6 minutes (they were decent sized mushroom caps). Instant crowdpleaser!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "t_wicenzcik"
},
"reviewBody": "Always a favorite at gatherings! Made it many times, but I make it with baby bella mushrooms and use the Jimmy Dean Sage sausage, its phenomenal, My friends always request them from me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Hanford Ames"
},
"reviewBody": "These mushrooms are the BEST. I make them for every party now. Simple, quick, and leaves you wishing you'd made 10x as many."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Didee"
},
"reviewBody": "I made a few modifications for extra flavor and presentation.\nUsed hot Italian sausage and only 6 ounces of cream cheese for better consistency. I also topped mushrooms with shaved Parmesan cheese after stuffing, and sprinkled Italian bread crumbs on top followed by a sprinkle of paprika for added color. I baked them at 350 for 25 minutes. A final note! I sprayed olive oil on baking sheet to keep mushrooms moist and prevent sticking to the pan. Super Good! All were gone very quickly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aprella"
},
"reviewBody": "I have a recipe I normally use similar to this. I sauté garlic and butter and mix in with cram cheese, and butter the mushrooms, but the rest of the recipe is the same. And I also use Italian sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nate"
},
"reviewBody": "I just use sausage, cream cheese, and green onions in my mix, then top with sharp cheddar. Everybody goes nuts for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TIMBER_W28"
},
"reviewBody": "Made with Ground Italian sausage, added garlic powder,Parmesan cheese, chopped mushroom stems, topped with fine shredded cheddar,too taste, made 30 oz, of stuffed mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamika Clark"
},
"reviewBody": "This is a great recipe! I added veggies to mine! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samie Joe "
},
"reviewBody": "This is a simple super yummy appetizer. I added parsley and a 1/2 cup bread crumbs. Turned out really good:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzette Boltz"
},
"reviewBody": "These were excellent. My husband ate them all and skipped dinner! Ooops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lorrick"
},
"reviewBody": "I made several items for our New Year's celebration. These were definitely the least favorite! Very bland and quite tasteless. We will not make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa L."
},
"reviewBody": "Wow. Awesome, super simple recipe. This will be my new go-to appetizer recipe. I made it exactly per the directions and it was great. I gave it 4 stars because I felt the flavor would have been kicked up with a few additions which I will try next time. Next time I will add some chopped basil and garlic to mixture and top with some shaved Parmesan. But, honestly the recipe was great as-is. You can't beat the ease and utter simplicity of three ingredients. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Catherine Vanessa Fountain"
},
"reviewBody": "This recipe is very good, I did do a few things different. I used sage sausage, used equal parts sausage and cream cheese, and used the stems with the mixture. These are wonderful, my family ask me to fix these every year during the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Hayden Denehy"
},
"reviewBody": "OMG! These are divine. I halved the recipe because I was splitting the sausage with stuffing, but, WOW! These were gone in 3 minutes flat. I added a bit of cheddar cheese to the cream cheese and sausage but these were awesome. I will make these again. The plus side is they were super easy, you can make ahead and pop under the broiler."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KITTHECAT"
},
"reviewBody": "Topped with seasoned bread crumbs. This is a family favorite at gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "Love love this recipe! I like to use the sage or spicy sausage, gives it a little extra kick. There are never any left over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fritzi Yates Phillips"
},
"reviewBody": "I make these every Thanksgiving. I use 1 lb Sausage, 8 oz Cream Cheese, &amp; 2 lbs of mushrooms. I use the stems &amp; scoop some of the flesh out of the mushrooms too. I chop the stems &amp; flesh in the food processor &amp; add it to the sausage when I brown it. Then I add the cream cheese &amp; stuff them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPARROW"
},
"reviewBody": "Like a lot of other reviewers, I've been making these little appetizers for years, since I was a teen (DECADES). I use spicy sausage &amp; use a potato masher after sausage is cooked to minimize large chunks. For those who think these are bland, I've always added finely chopped green onions right after adding the cream cheese which is the last few minutes of cooking. One extra ingredient makes a huge difference. At times I've minced the mushroom stems, but usually I save those for breakfast burritos the next morning. Like deviled eggs, no matter how many you make, there are never any left. Kinda makes you wonder who the originator of this recipe is, and how long ago did they come up with it??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MikeS"
},
"reviewBody": "We made this recipe tonight using Italian sausage. It was outstanding! We plan on experimenting with incorporating a second cheese soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LizM"
},
"reviewBody": "excellant. would make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2cook32"
},
"reviewBody": "I really liked these and they are so easy to make... I did only use half the cream cheese and so glad I did as it would have been way too much richness and cream cheese flavor ( and I love cream cheese) I also added back the chopped mushroom parts after putting in the pan with the sausage for a few minute to soften slightly... I will make this for parties for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marigoldsky"
},
"reviewBody": "Very tasty! Only change I made was to add about 1/2 cup of shredded Italian blend cheese with the cream cheese and sausage and more on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "keebdaisy"
},
"reviewBody": "I started out broiling them but then decided to finish up baking at 375 for 20 mins. I had large mushrooms and I wanted them cooked through. I liked the sausage, cream cheese mixture, but felt like it could have used something else. Next time I might just add a little something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teenie"
},
"reviewBody": "Made these and thought they were great. Great reviews from guests. NOTE: I used half sweet and half hot sausage for a little more kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liz Pacini"
},
"reviewBody": "I've made these for years. I add green onions to the cream cheese, stuff the mushroom with cheese/green onion mixture and then add a dollop of italian sausage on top. I sprinkle with parmesan cheese on top. Fabulous, and you can be sure the sausage is fully cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "I have made these for years only instead of cream cheese I add a can of cream of mushroom soup, about 1/2 to 1 cup sour cream and sprinkle the tops with cheese. I also bake at 350 for 20 to 30 min. Everyone has always loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisaverde"
},
"reviewBody": "Everyone loves these! For some extra zing, add 1 packet of Ranch Dressing to sausage and cream cheese mixture. Sprinkle with shredded mozzarella and serve hot :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Sims"
},
"reviewBody": "I always add worstershire sauce to the cream cheese and sausage mixture!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLEVEAR"
},
"reviewBody": "This deserves a five on simplicity alone. The most recent time I made these was for our anniversary dinner which we celebrated with our 20 and 23 year old kids (one of whom doesn't like mushrooms). I used about 3/4 lb of Jimmy Dean sage sausage with about 6 oz softened cream cheese. I filled 12 good sized mushrooms - probably 1 1/2 to 2 inches across. I added a few shakes of green Tabasco (though sometimes I use cayenne). Everyone loved them. My hint to others: slice a slim slice from the bottom so the mushrooms rest flat and spray them with Pam. Turn them over and fill. Top with panko and spray again. Bake for 20 minutes at 400 degrees. Can finish under the broiler if they haven't browned but I've never needed to do that. I hope your family and guests like them as much as mine. Hint #2: use a potato masher to get small, fine crumbles of sausage (essential to easy filling). If pre-cooked sausage crumbles are available, this recipe is even simpler. Thanks, Sam, for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Knomies"
},
"reviewBody": "Bland and boring. I should have known with only a few ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barb e"
},
"reviewBody": "Made these with half breakfast sausage, half Italian sausage...baked at 375 for 20 minutes. Wonderful, and so easy!! Made 8 oz mushrooms using 4 oz cream cheese...eye-balled the sausage, perfect proportions. Will make these very often"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefSam"
},
"reviewBody": "Have made these before but always used Italian sausage. I do like the tip of chopping the sausage in the processor for a more even distributon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cait1219"
},
"reviewBody": "My husband loves these and they're so simple. I didn't use all of the cream cheese, I used about 3/4 of it so it would be meatier. We also prefer our mushrooms cooked so instead of broiling I baked them at 350 for 10-15 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daumille"
},
"reviewBody": "very easy and family loved"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mikde Danben"
},
"reviewBody": "My company loved this. It is a sure winner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "actov"
},
"reviewBody": "nah, not much flavor, all cream cheese. I even used the whole 1 lb of sausage. too greasy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Wathne"
},
"reviewBody": "I made a mistake, I set these on the table, gone in less than three minutes and I made a double batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOTHERDESTINY"
},
"reviewBody": "Just awesome! I used one package of hot sausage and one package of regular and it turned out perfect! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Lee Meola"
},
"reviewBody": "These were very good. I made them for New Year's Eve and they were the first thing gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gebah"
},
"reviewBody": "I use half the amount of cream cheese called for. After mixing the cream cheese and sausage together, I roll it into a log and refrigerate the filling. It's much easier to fill the mushrooms that way. After stuffing the mushrooms I roll the stuffed side in parmesan cheese, then in panko breadcrumbs. I've been told that I can't come to my friend's house without a pan of these ready to go into the oven! LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy T."
},
"reviewBody": "Great! I used 1/3 cream cheese and the rest feta, Monterey Jack, and then topped with mozzarella. You could easily customize the cheeses to your taste or to match your menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Lane Franklin"
},
"reviewBody": "Made this recipe for a party (\"before\" picture in my photo album) ... Got rave reviews at the party. They were wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha*Italiano"
},
"reviewBody": "I followed this as my base. I added green onions to the sausage mixture and they were awesome!! Hubbys fav!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Prepared them for a holiday appetizer buffet....only two mushrooms were eaten. Not what I hoped for, really disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boog"
},
"reviewBody": "I cooked and grounded up Chilli Cheddar Sausages (3) of them, Low fat Cream cheese and a couple of sprinkles of Zatarans, cooked at 350 for 15, broil at 400 for 10 and they were absolutely amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkoepp98"
},
"reviewBody": "Looks impressive and tastes great! Yet, easy to do and inexpensive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sandra C"
},
"reviewBody": "They were ok. Not a lot of flavor and i added spices. I added panko crumbs on top and they helped. Too bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill N"
},
"reviewBody": "Greeat, simple, delicious recipe. I did add a generous amount of red pepper flakes, and some Panko."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "missnewcook"
},
"reviewBody": "I have to say...I didnt love these. My parents did, though, they really loved them! I felt they were lacking in flavor, they needed something. Maybe because I actually made them EXACTLY as they said, and didnt add anything extra like others did. I saw on some other reviews that people used spicy sausage..that might have been good. Maybe if I try these again I will do that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "Super delicious and so easy! I did mine in the oven for about 15 minutes or so cause I wanted the bottoms to get warm and not just the tops. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roni J"
},
"reviewBody": "I was looking for a lower-carb recipe, and with some slight tweaking, this turned out great. I thought it was a bit bland when using regular breakfast sausage, so I recommend using hot sausage if you like a little heat. In addition, I did add some salt, pepper and garlic powder to the cream cheese mixture. One last thing - need to drain the sausage well after cooking or they are very greasy - I will make sure to drain on paper towels before adding to the cream cheese next time. Hubby liked them a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "I used this idea as the basis for my own version. Would have given the original recipe more stars, but I found them a little bland. I've made them with both sweet and hot Italian sausage; I prefer the hot, but I like things spicy. I used ricotta cheese instead of cream cheese, and added fresh sauteed garlic and onion, chopped mushroom, a little chopped fresh spinach, wilted, and a scant handfull of Panko breadcrumbs. I used portobello mushroom caps, brushed them with a little evoo, and broiled them cup side down for a few minutes, then patted them dry. I flipped the caps over and stuffed them, sprinkled with a little shredded parm and drizzled with a little butter. Baked at 400 for about 15 minutes, then broiled for a minute ot two, watching closely. Not exactly lo-cal, but delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "countrygal"
},
"reviewBody": "This is a favorite recipe. Made them last night with italian sausage. Wonderful. I add chopped green onions and the mushroom stems for a different flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet C."
},
"reviewBody": "Delicious! We also added in the chopped stems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "FaithChick"
},
"reviewBody": "I tried the recipe 4 times once with pork sausage and the second time with the Italian sausage. In both cases there is just too much cream cheese. It turned out better the second times I made this by cutting the cream cheese by half. With the pork sausage I suggest seasoning it to taste with McCormicks pork seasoning. I also added minced onion. I added minced garlic in the Italian sausage and no other seasoning. I topped both with mozzarella cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAlton"
},
"reviewBody": "Great taste, simple and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "benthere"
},
"reviewBody": "Excellent! quick easy and yummy. I used a hot italian sausage and half the creme cheese, added some ground up italian croutons on top and a little sprinkle of mozzarela on top and threw them on the outdoor grill instead of the oven. \n\nThey would be great as is just wanted to spice them up a bit for a family barbecue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "Very good and very easy. Made a more filling than I could stuff mushrooms with but probably due to different size mushrooms and what not. Thinking about trying the extra in a quesadilla. Would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jewelz35"
},
"reviewBody": "Add a couple of dashes of hot sauce to the cream cheese mixture and WOW!! Nice kick on an awesome recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "So good, so easy! I upped the sausage to 1 lb. for my carnivore husband, but I will try just the 1/2 lb next time. I chopped up the stems and sauteed them with the sausage, and dipped the tops in Italian bread crumbs. Definitely need at least 2 pkgs of mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg"
},
"reviewBody": "I first enjoyed mushrooms similar to these at a bed and breakfast, then I made some myself at home a few days ago. They're marvelous! Although I did make a couple of alterations:\nI mixed mozzerella and mild cheddar into the cap stuffing, and I also put some chedder shavings on top. I also put panko bread crumbs on top which gave it a very pleasant little crunch. Before stuffing my caps, though, I sauteed them in butter. It's delicious!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24886/sausage-stuffed-mushrooms-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
"name": "Mushrooms"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
"name": "Stuffed Mushroom Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24886/sausage-stuffed-mushrooms-ii/",
"name": "Sausage Stuffed Mushrooms II"
}
}
]
}
}
, "about": [
]
}
]