				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sausage and Sauerkraut"
,"datePublished": "2020-03-05T00:07:42.000-05:00"
,"dateModified": "2022-07-26T18:05:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DOEMARK"
,"url": "https://www.allrecipes.com/cook/1279328"
}
]
,"description": "Sauerkraut and sausage are cooked with bacon, brown sugar, and apple for balanced flavors in this hearty German-inspired dish that will warm you up."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OpvBWE0s5Nj7X_jGL8RLF1Uae0o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/802499-23a5cc0915da4d74a3e115458cd36c4e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sausage and Sauerkraut"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "269"
}
,"cookTime": "PT200M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "777 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "128 mg"
,"fiberContent": "7 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "26 g"
,"sodiumContent": "2702 mg"
,"sugarContent": "20 g"
,"fatContent": "62 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 pounds sauerkraut, rinsed and drained",
"1 tablespoon caraway seeds",
"0.25 cup brown sugar",
"1 apple, diced",
"cooking spray",
"0.5 pound bacon, cut into 1-inch pieces",
"1 large onion, chopped",
"1.5 pounds kielbasa sausage, cut into 1-inch thick slices" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place sauerkraut, caraway seeds, brown sugar, and apple into a large saucepan over medium-low heat, and bring to a simmer. Reduce heat to low, and cook for 2 hours, stirring occasionally."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Place bacon and onion into a skillet over medium heat, and cook until bacon is almost crisp and onion is beginning to brown, about 10 minutes. Stir the bacon mixture into the sauerkraut."
} ,{
"@type": "HowToStep"
,"text": "Brown kielbasa sausage in remaining bacon grease in the same skillet until sausage begins to brown, 10 to 15 minutes; stir into the sauerkraut mixture."
} ,{
"@type": "HowToStep"
,"text": "Spoon the sauerkraut and sausage mixture into the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until bubbling, about 1 hour."
} ]
,"recipeYield": ["5"]
,"totalTime": "PT215M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it as close to recipe as I can and it tasted pretty good. Did not use Caraway seeds as I did not have them. And I added a little chicken stock to it. Topped it with a few Asparagus Spears."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Left out the onion, apple, bacon and optional caraway seeds. After I started realized I did not have brown sugar. Used cane sugar with about a tsp of maple syrup. Covered bottom of slow cooker with a little brandy then cooked it all in slow cooker about 4 hrs. Just a hint of sweetness, next time I will try adding the apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have made this several times now. I don't like caraway so I omitted it. The first time I made it, it was too sweet for me so I cut back to 2 Tablespoons of brown sugar, that was perfect. This reminds me of German dishes my grandmother used to make for us. Comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe. I too left out the caraway seeds and the bacon (my wife's request), but added fresh mushrooms for the oven cook. Proportions are right on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mismagmax"
},
"reviewBody": "We made this in a slow cooker without the onion or bacon, The apple was fantastic and the brown sugar made the sauerkraut mild with a hint of sweetness. Fantastic dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Safranski Tillman"
},
"reviewBody": "I've made it twice because we really enjoyed it the first time. I am polish and live the combination of flavors. 2nd time I made it was with fresh saurkraut! S"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grammy"
},
"reviewBody": "Absolutely loved this recipe! The time was not a hindrance at all, but the flavor was oustanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "themmes7"
},
"reviewBody": "I made this recipe and even had my kids eating sauerkraut. Love the apples and onion combined. I did add some roast potatoes to the pot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James A Rhoades"
},
"reviewBody": "I cut back on the amount of bacon and used apple sauce!! Great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kasandraealy"
},
"reviewBody": "This recipe is something I've always made around Christmas or Easter (by taste). I've never had a specific recipe, just watched his Grandma, Bucía, Mom, and Aunties make it. It was from my husband's side of the family who's Polish. They always called it 'Kapusta'....but I'm not sure if that's the correct name for this recipe. Anyways, I followed this specific recipe to a T, but omitted the caraway, as it gives us heartburn. The recipe was great! Tastes just like my husbands grandmother's recipe!! Superb"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneP"
},
"reviewBody": "The bacon and slow cooking turns this dish into heavenly! We've had it several times over a couple of months and made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big Bear"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Charnell U"
},
"reviewBody": "Made as directed- everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Cardenas"
},
"reviewBody": "I made this today and it was unbelievably delicious... I mean WOW, fantastic. Yup, that's me tooting my own horn, lol. Wife, soon, and friends all loved it. I was even confused with the part when I had to simmer the sauerkraut mix, I was like, there's no liquid how is it going to simmer but it did and I stirred it every 15 min. I didn't deviate, not once, did recipe exactly as it's written. I used bollio bread and typed with mustered for everyone else but for my sandwich I used the Russian sauce that would normally go on a Ruben sandwich. Perfection, let me tell you. Thank you, excellent dish and was worth the time cooking it. I will be making this again. :)??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Asencio"
},
"reviewBody": "Very good, It really mellowed out the sauerkraut. The caraway seeds was a nice touch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junie"
},
"reviewBody": "Definitely a keeper! Going to replace our usual sauerkraut recipe with this one Making it our new go to recipe With just a few modifications. Used bratwurst instead of kielbasa, Used only half of the recommended brown sugar and we doubled the amount of sauerkraut. Then we served it with a side of spaetzle. Soo tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ihateliver"
},
"reviewBody": "This is not a hard recipe to make but after I made it I too wondered why so many unnecessary steps. The result was ok but not over the top great. I ended up wishing I had just grilled the sausage, added sauerkraut and served it in just a few minutes as the taste was comparable to that method (what I've done countless times over the last few decades) instead. So sorry as I had so wanted this to be one that I would make repeatedly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie L"
},
"reviewBody": "Squeezed it into one hour of cooking and it came out amazing. We had ours with creamy mashed potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Lynch"
},
"reviewBody": "Delicious! I like to double the amount of Kielbasa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RCG"
},
"reviewBody": "I didn’t have all of the ingredients (apples). I substituted the apple with 2 cups apple juice. Even with the addition through subtraction it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline Sanchez"
},
"reviewBody": "I made this recipe exactly as stated and it turned out perfectly! When it came to adding the sausage to the sauerkraut, I didn’t dump it in as some said it was greasy. I placed it in by pieces, then mixed, and moved to baking dish. I will definitely make this my go to sausage and sauerkraut recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djs"
},
"reviewBody": "Our mother (polish) made the best kielbasa and sauerkraut. Unfortunately we had not been able to replicate it til now. This is excellent and comes very close to hers. Will definitely become one of our family traditional dishes. Thank you! Now our challenge is pierogi and stuffed cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phingerpaint"
},
"reviewBody": "This recipe is amazing! even better as left overs. it cooked very well in a crock pot on low for a few hours \n\nthe only changes I made was substitutes the caraway seeds for fennel as thats all I had and used turkey kielbasa because I'm watching my caloric intake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dfvx990mq321pl"
},
"reviewBody": "Great recipe, one of my go-to's when I can't think of what to cook. I double the amount of sausage though and usually use applesauce instead of apples. I also usually keep the bacon out because in my experience, any time bacon is cooked into any recipe, it ruins the texture and flavor of the bacon (which seems like a waste of bacon to me)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tjecjhw"
},
"reviewBody": "This is an excellent recipe. I serve it with Pioneer Woman's Mashed Potatoes and it is a hit everytime. We don't stray from the recipe except for using more apple per our tastes. Also, using Kielbasa is a must, don't substitute with Italian Sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johnsomi"
},
"reviewBody": "I made a few changes and was happy with the results. I didn't have apple or caraway seeds and I prefer not to rinse the flavor out of my sauerkraut. I added 1/4 cup of fruit punch and simmered for only one hour. Then baked for a half hour. I realize I completely changed the recipe but was looking for only a basic idea anyway. I enjoyed it thoroughly and will likely follow my own recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tess Atkinson"
},
"reviewBody": "I made it exactly as the recipe instructed and it cane our amazing!! Really concentrated flavors and easy to do, just a tad more time consuming than I’m use to. It was a huge hit with my bf who is half German and I definitely am going to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angiebert7"
},
"reviewBody": "Excellent taste but laborious to make..but worth it! Do not drain the sauerkraut tho. You will need every bit of that liquid to keep it from drying out in Skillet and oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gilbert Medina"
},
"reviewBody": "So tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelann"
},
"reviewBody": "I made this Dish for our New Years Family dinner and wow was it a Hit!! The sauerkraut had a very balanced taste with the added brown sugar and sliced apple slow cooking together. The bacon and onions brought all the delicious flavoring together and cooking the Keilbassa In the bacon grease enhanced the flavoring even more!! I stayed in line with everything in the recipe, aside from caraway seeds (bc I don’t care for them). The sauerkraut mixture didn’t need anything extra, in my opinion. I think if I would’ve added some kind of extra juice to it, it would’ve thrown the balance off or sweetened it too much. I kept it covered for 2 hours which keeps moisture in while stirring occasionally. Once you add the bacon/onions to it and then the kielbasa, it adds some extra moisture to the sauerkraut and really is perfect flavoring, just as the recipe says! The one thing I would say is to give yourself enough time to sauté the onions/bacon/kielbasa, probably more like 20-25min to sauté up the onions/bacon for good crispness as well as the kielbasa for browning before adding it all the sauerkraut mix. The flavorings bake all together in the oven and the smells in your kitchen are amazing and will bring anyone in your house over to ask, “Is it ready yet!?!” Yum!! Definitely have this recipe saved for one of my future family holiday meals! Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish Mendelsohn"
},
"reviewBody": "No it doesn't need any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LHWEBSTER"
},
"reviewBody": "Made this many, many times. Just omitted the caraway seeds. Have also added quartered potatoes. It's my go-to recipe for a crowd, and on NY Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LynnS"
},
"reviewBody": "Was lovely but I had to change things as I had 2 pork chops and 2 bratwurst thawed and half a jar of Sauerkraut...this was an excellent guide for me! Otherwise I adjusted proportions and added a splash of apple cider for moisture and popped it in the oven in the dutch oven pot after browning everything first...40 mins at 375F ...everything was still moist and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "Awesome! Did not have caraway seed or apple but it still turned out delicious! Family lived it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lm"
},
"reviewBody": "Loved this! I’d made a similar recipe in the past but decided to try this one. The apple (I used Fuji) makes this awesome. I also added garlic and onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Tom"
},
"reviewBody": "Love this recipe. I didn't have an apple but followed the recipe to the letter. So very good. My husband loved it. Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kouklasmom"
},
"reviewBody": "this has been in my fall rotation for several years now. although i've always just done the whole thing in a dutch oven on the stove, allowing time to meld the flavors, while skipping the hour of oven baking. served with pan seared, pirogies &amp; onions (in butter)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hamy602"
},
"reviewBody": "So good! I did change one thing: I simmered for an hour and baked for 45 minutes because I didn’t manage my time well. It was still DELICIOUS! The sauerkraut is tender but still has firmness too. And the flavor is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juliana"
},
"reviewBody": "Great recipe and worth the time invested. Thanks so much!\n\nServed over mashed potatoes. Too comforting for words."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jonahn2"
},
"reviewBody": "Very wonderful flavor and substance. Doesn't need to go for 2 hours. Went for about 30 minutes just to cook off the excess liquid. Just added alittle apple juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Richart Tharp"
},
"reviewBody": "Definitely will make this again. Followed the recipe, however I made a little more (bigger dish) so I improvised on some of the measurements."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cortney Schulte"
},
"reviewBody": "Probably the best meal I have ever made! I followed it exactly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Styler"
},
"reviewBody": "It does take hours to make but most of the time it is simmering or baking. I cut the sugar down and I'm glad I did because I thought it was good. I think I might try not using sugar at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marilsp"
},
"reviewBody": "I made this recipe and it was teriffic -- unlike Dee's, that switched ingredients and used Italian Sausage with sauerkraut (eeeeeewwwwwwww), then gave it a mediocre score.. We need to have a thumbs down or least helpful button so people coming here can understand what's going on with these low or lower star ratings for 5 star recipes.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Greg"
},
"reviewBody": "A good starting point, but greatly improved by adding 1/2 cup each of beef stock and white wine, plus a healthy splash of white wine vinegar (a couple of tablespoons) to the sauerkraut mixture before simmering it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "L Jordan"
},
"reviewBody": "I made this as written but doubled for my Nicene's birthday. It was good but was very sweet for my tastes. I used one tart and one sweet apple, maybe that was it? It was good, just not as savory as I had hoped it to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MeowBoops"
},
"reviewBody": "This is in the oven now. I know it will be good. However, some things to expect: There is a lot of grease involved. When I cooked the bacon/onions, I scooped it out with a slotted spoon to allow as much excess grease to drip off as possible. When I browned the sausage, I put it on a napkin and also pressed it with more napkins before transferring it to the sauerkraut mixture. I also went through 1-1.5 cups of apple juice while cooking the sauerkraut because it started to get dry. I also bought (unknowingly), Bavarian Caraway Seed sauerkraut, so I didn’t add the additional seeds called for in the recipe. Next time, I know to buy very specific and plain sauerkraut. I tried to cut out as much excess grease as possible but still stick to the recipe as closely as possible. I know it will be very good served over mashed potatoes with a side of lightly dressed baby spinach. Just be aware that this is very greasy, pops a lot, and is best made outside if possible lol. I live in a small apt and this cooking smell will stick around for a few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jbolton"
},
"reviewBody": "Excellent recipe! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "It was absolutely delicious but I never had any liquid to simmer so I just kept stirring it and put a cover on how come I didn’t have any liquid? I read one of the reviews and someone added apple juice so it wouldn’t dry out. Figures that I don’t have any apple juice in the house!\nJust wondering what I did wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CocoMama"
},
"reviewBody": "I just made this, and it was delicious. Big hit with my husband. I will definitely add it to my meal repertoire. Makes a big difference if you have quality kielbasa and bacon, which I bought from a local meat market. I followed the recipe, with the only variation of decreasing the bacon a bit. Don't omit the caraway seeds; once it is all mixed and baked the caraway flavor does not scream at you, but it does add to the flavor of the dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MHJ"
},
"reviewBody": "I made this with what I had available and had to skimp on the time, but it was still delicious. I had no bacon, but used cubed pieces of ham, and only had sweet Italian sausage. I cooked the sauerkraut for about an hour before adding the rest of the ingredients. It was so good that I will definitely plan ahead next time and try the recipe as printed. The idea of slow cooking the sauerkraut is a new one to me, but is obviously worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bishop Hell"
},
"reviewBody": "I made this last night for the 2nd time and it again was very good. My one comment would be it does tend to be a bit on the sweet side so if you prefer your sauerkraut more on the savory side, consider dialing back the brown sugar. But coming from someone who doesn’t particularly care for sauerkraut, this is a very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennn81"
},
"reviewBody": "1. Added more onion 2. added 1/4 tsp of fennel seed. 3. Sprinkled crispy bacon on top. 4. Corn bread on the side"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alethea"
},
"reviewBody": "SO GOOD, all the flavors were amazing! Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "readmtnmama"
},
"reviewBody": "Excellent recipe! I sauteed bacon, onion, and bratwurst (couldn't find kielbasa at the store!) in my cast iron pan, then threw together with the rest of the ingredients in the crockpot for a couple of hours. Served with mashed potatoes and a few other sides... everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "250706"
},
"reviewBody": "Meh. It was just ok. I made this for dinner this evening and followed the recipe to the letter. It just wasn't a wow meal. Flavorless is the only word I can use to describe it. It will not make it onto my dinner rotation, unfortunately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Meh. It was just ok. I made this for dinner this evening and followed the recipe to the letter. It just wasn't a wow meal. Flavorless is the only word I can use to describe it. It will not make it onto my dinner rotation, unfortunately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emjay"
},
"reviewBody": "I made some minor changes in the approach since I was nearly tripling the recipe for a New Year's Day family dinner. Used 6 lbs of Polska Kielbasa, 3 lbs of saurkraut plus 1/2 head of red cabbage, 3 granny smith apples, 2 large sweet onions diced. Didn't have caraway seeds and used fennel seeds instead, just 2 T, plus only 1/2 cup of sugar (for the tripled recipe). I put it all in a large oven-proof covered pot and skipped the stovetop step. Since it had very little liquid, I added 3 x 16 oz cans of Michigan hard cider. I cooked it in the oven at 325 for 2 hrs and then another 1-1/2 hrs at 300. Took it out of the oven and just let it sit on the stove while I finished the potatoes (smashed baby potatoes, very tasty). Even my doubters who were not fond of saurkraut (because it was too acidy) loved it! Not a hint of acid. The final verdict from the 12 family members at the table, from 1-1/2 yrs to 80 years old - YUM!!!! We'll be making it again next year, for certain!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myranda Martin"
},
"reviewBody": "Awesome recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Indy-Girl"
},
"reviewBody": "Made this for New Years and it was delicious! I doubled the recipe but used 3 apples since they were small and I added half a lager beer for liquid. I put it in a crock pot for 2 hours on high and then 2 hours on low. Added sauteed smoked sausage one hour before service and turned the crock pot back up to high for the last hour. Will put on the menu again for next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Codey Mueller"
},
"reviewBody": "I used a cast iron skillet to cook everything then put it in the oven to finish it up"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hicksls"
},
"reviewBody": "This came out delicious! My husband wanted some sauerkraut and sausage but was hesitant about this because of the brown sugar and apple. I used apple juice instead, but followed the rest of the recipe exactly. He loved it and I did too, not really being too fond of sauerkraut and sausage. I’ll definitely keep this one! It is time consuming so making it a weekend dinner recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the big easy"
},
"reviewBody": "Followed the recipe except for the bacon and Caraway. I used a tablespoon of brown sugar and diced up a piece of apple... So tasty. I will make it again and serve it in a bun!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We did not like this. I didn't think it was too bad, but my husband just did not like it. It was quite dry. After draining the sauerkraut, I did have to add water to the pan to keep it from burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lkstevenslinda"
},
"reviewBody": "We did not like this. I didn't think it was too bad, but my husband just did not like it. It was quite dry. After draining the sauerkraut, I did have to add water to the pan to keep it from burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debowil"
},
"reviewBody": "Definitely drain the sauerkraut liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha Lott"
},
"reviewBody": "Made this a recipe and it was awesome. We even ate all the leftovers, which is rare. We served it over homemade mash potatoes. A great New Years Day dinner.....which we'll probably have. +5"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb Ridky Zelkowski"
},
"reviewBody": "See my notes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pfire77"
},
"reviewBody": "I absolutely loved this dish!! I tripled the recipe and almost followed it exact. 2 out of the 3 bags of sauerkraut, I rinsed and drained. The third bag, I did not. I also added baby red potatoes. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dankert"
},
"reviewBody": "The best ever. Never any leftovers and the family and friends are usually wanting for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimbalina28"
},
"reviewBody": "This is excellent! I made it for my company's pot luck and it got rave reviews. My only modification was I made it in a slow cooker. I cooked the bacon and then dumped it on top of all of the other ingredients and let it slow cook over night. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynnie"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tompayne888"
},
"reviewBody": "This will be my go to sauerkraut recipe. Wow! The flavor was awesome. And my picky, finicky spouse went back for seconds and will be wolfing down the leftovers. \n\nNOTE: To those who make massive changes to this recipe before trying it out I have a question, \"Why?\" See if it can stand up on its own, and if it can't then make changes.\n\nI followed the recipe as closely as possible. Due to the sizes of the ingredients at the store the kielbasa was 5 oz less than the recipe and the sauerkraut was 8 oz. more. These are minor changes and, if I can buy the called for amounts of each, I will switch to that.\n\nTo those who don't hate caraway seeds, make sure you add it. \n\nMy one mistake that I will not repeat: I browned the kielbasa a little too thoroughly. The kielbasa came out a little dry, but I think that was my fault.\n\nA great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aubree Billings"
},
"reviewBody": "Don't change a single thing. Absolutely delicious. I will be making this recipe every month of the rest of my life. Well worth the time it takes I promise. We ate it over mashed potatoes.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "caquilter"
},
"reviewBody": "We both enjoyed this. Husband declared it, \"Really good.\" I used 2 TBLSP butter and and 2 of EVOO. Added beef broth and reserved pasta water. Also added 3 garlic cloves with other spices and red pepper flakes. Cabbage and all cooked just fine on top of stove in about an hour. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne Feindt Gray"
},
"reviewBody": "PERFECT!!!! I made this for our office Pot Luck. We had a Winter Olympics potluck where everyone picked a country and cooked something from that country (cool right? That's what I thought too). My heritage is German, so I picked Germany. This recipe is the closest I've EVER come to the sauerkraut recipe that my grandmother used to make! I followed the recipe BUT used 4 lbs. of sauerkraut, added a smidge more caraway seeds and a little more than 1/4 cup brown sugar. THEN...my roommate came home and suggested I add beer....so I added 1/2 bottle of Blue Moon. O M G...this was not only good...BUT...it was a hit with the coworkers that liked sauerkraut. HIGHLY RECOMMENDED!!!\n\nOne more thing...I browned the bacon and onions...cut up the sausage and browned it in the bacon grease and then threw everything in the slow cooker overnight. PERFECTION!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lobqueen"
},
"reviewBody": "It all disappeared at the pot luck party. Omitted bacon but cooked onion and kielbasa in bacon fat. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lloyd Lipska"
},
"reviewBody": "it was really super. I am new at this cooking thing and found the recipe easy to follow and the results were spectacular. Had not caraway seeds so did not use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleen1021"
},
"reviewBody": "Made the recipe as printed- but put it in the slow cooker on low for about 6 hours. Oh, and I added some quartered potatoes too. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Henry"
},
"reviewBody": "Outstanding recipe. Loved ut"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelled"
},
"reviewBody": "tasted great! I didn't have an apple so I used about a tablespoon or so of a triple berry spread I had gave it a little sweeter taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila C"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Calvin H. Gifford"
},
"reviewBody": "Will certainly make it again. Maybe try something different with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Reany"
},
"reviewBody": "I made this for New Year's Day. My mother normally doesn't like sauerkraut, but she loved this dish. This will be my go-to recipe for sauerkraut from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANINAM"
},
"reviewBody": "This was amazing! I don’t like sauerkraut, so I was envisioning not eating much of this but I loved it and so did everyone. I didn’t change much. I omitted the bacon, since I didn’t have any. I did add a tiny bit of apple cider twice during the cooking of the sauerkraut because I was worried about it burning. And I cut the onion in half and sliced in thinly instead of chopping it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ekbrook"
},
"reviewBody": "Let me start by saying I ABSOLUTELY HATE SAUERKRAUT! It's an aversion rooted deep in a bad experience at Air Force Survival School many years ago. That said, I love the things that traditionally come with sauerkraut...Reuben's, etc. (I just have it taken off or VERY light on the serving). But this recipe sounded great, and with a fair degree of trepidation...I made it. (All the while thinking my family is going to hate it, and complain about the smell of cooking sauerkraut.) Bottom Line...IT IS SUPERB! And everyone loved it. I was so impressed and surprised and am so glad I made it. Cooking ahead with the brown sugar and apple certainly does mellow out everything I normally hate about sauerkraut. It made it into a nice garnish that blended perfectly...and did not overpower the meal. I did go lighter on the sauerkraut than the recipe called for (as I couldn't believe how it would turn out) but will go closer to the full recipe next time. Be brave sauerkraut haters and enjoy this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diva4Lyfe"
},
"reviewBody": "We really enjoyed this dish. I served it over mashed potatoes and it was just delish. I will be making this again thank you so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimbeBen"
},
"reviewBody": "Absolutely amazing!!! I wasn't sure about the apple and onion but decided to try the recipe as stated first before changing it. Boy I am glad I did! My family loved it!!! The boys even asked for seconds and then asked me to fix it again soon. I sure didn't expect that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cinfrea"
},
"reviewBody": "This is one of mine &amp; my husband's favorite recipes! Only change was using smoked turkey sausage &amp; turkey bacon. Delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "maw"
},
"reviewBody": "It was good. Not special. The remarkable thing is that after I ate it I had a very strong urge to occupy the Sudentenland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda G."
},
"reviewBody": "I have been making this for several years, but I don't bake it. I do everything in a large skillet. I add everything all at once except the kielbasa. Definitely add the caraway seed. When the sauerkraut is almost done, I add the kielbasa until heated through and browned. Thanks for the alternate bake option (for me, anyway). It will cut down stirring to prevent burning and constant watching. Oh, I don't add bacon; in my opinion, it would fight with the flavors of the kielbasa. Seems everyone is adding bacon to everything these days. If anyone is worried about the extra grease, leave this out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mia"
},
"reviewBody": "Awesome!! Easy to make just need the time but so worth it. I favorite with everyone"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "I had some sauerkraut leftover that needed to be used up, and whipped this up for dinner. While this is not something that we'd eat often, it was nice for a change. I served this with cheese pierogies, and it went well together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nevada Tom"
},
"reviewBody": "I love this recipe although I must confess, I did not follow it exactly: I used a slow cooker and cooked it on low for six hours. The sausage was great but the sauerkraut was outstanding, the best I've ever had. After all the sausage is gone reserve the sauerkraut for use another time and serve it to your guests as a side dish. Or maybe as a condiment to hot dogs. They will be sure to be amazed at how flavorful sauerkraut can be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne Mazzenga"
},
"reviewBody": "I made this and I will definitely make it again!\nEven my husband ate the sourkrout which he normally doesn't eat. My son loved the sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshine"
},
"reviewBody": "Very good recipe!!! I made this for Easter, I have been making polish sausage and sauerkraut for years, similar to this recipe. A few things different., such as the bacon and browning the sausage, I think made a difference!! Will make again, even though my husband prefers the recipe made with sour cream, which is awesome too!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jalainekf"
},
"reviewBody": "We loved it! I did use turkey bacon, turkey kielbasa sausage and canned sauerkraut with the caraway seed already in it. Since I never made it the way the recipe states, I'm not sure if it tasted a lot different, but it was DELICIOUS!! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Carty"
},
"reviewBody": "It was very tasty but I think there should have been some liquid in the recipe (maybe chicken stock). There wasn't enough liquid in the sauerkraut, apple, brown sugar combination to actually simmer the mixture. It turned out very dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole O'Shaughnessy"
},
"reviewBody": "New family fav I love this. Smelled so good cooking to."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216081/sausage-and-sauerkraut/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
"name": "German"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216081/sausage-and-sauerkraut/",
"name": "Sausage and Sauerkraut"
}
}
]
}
}
, "about": [
]
}
]