				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sausage, Spinach, and Ricotta Calzone"
,"datePublished": "2010-07-30T20:39:12.000-04:00"
,"dateModified": "2022-10-17T11:56:15.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ARGO, KARO and FLEISCHMANN'S"
}
]
,"description": "This calzone recipe with ricotta, Italian sausage, and spinach is a great combination!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8vVLmp81qxjfRrPnJLP9ULR_fXg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8193951-cf55812641484c03916a49ea0817365c.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sausage, Spinach, and Ricotta Calzone"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "31"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "601 kcal"
,"carbohydrateContent": "53 g"
,"cholesterolContent": "116 mg"
,"fiberContent": "4 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "1799 mg"
,"fatContent": "30 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.5 cups all-purpose flour, or more if needed",
"1 envelope Fleischmann's® Pizza Crust Yeast",
"1 teaspoon sugar",
"0.75 teaspoon salt",
"0.66666668653488 cup very warm water (120 degrees F to 130 degrees F)",
"1 tablespoon vegetable oil",
"8 ounces Italian sausage",
"2 cups fresh spinach leaves",
"0.25 cup water",
"0.75 cup ricotta cheese",
"0.75 cup shredded mozzarella cheese",
"1 large egg",
"1 teaspoon Spice Islands® Italian Herb Seasoning",
"0.5 teaspoon Spice Islands® Crushed Red Pepper",
"0.5 teaspoon Spice Islands® Garlic Salt",
"2 cups pizza sauce, for dipping" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make dough: Combine 1 cup flour, yeast, sugar, and salt in a large bowl. Add very warm water and oil; mix until well blended, about 1 minute. Gradually add enough remaining flour to make a soft, slightly sticky dough ball. Knead on a floured surface, adding more flour if needed, until smooth and elastic, about 4 minutes. Cover and let rest on the floured surface."
} ,{
"@type": "HowToStep"
,"text": "While dough rests, make filling: Cook and stir sausage in a large skillet over medium-high heat until crumbly and browned, 5 to 7 minutes. Use a slotted spoon to remove sausage to a paper towel-lined plate to drain; discard grease from the skillet. Add spinach and water to the skillet; sauté over medium heat until spinach is wilted, 1 to 2 minutes; drain liquid. Return sausage to the skillet with spinach. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine ricotta, mozzarella, and egg in a mixing bowl. Stir in Italian seasoning, crushed red pepper, and garlic salt; set aside."
} ,{
"@type": "HowToStep"
,"text": "Divide dough into 4 equal pieces. Roll 1 dough piece into an 8-inch circle on a floured surface. Spread about 1/3 cup ricotta mixture over the bottom half of dough, leaving a 1/2-inch border. Top with heaping 1/3 cup sausage-spinach mixture. Fold the top half of dough over filling. Pull the edge of the lower crust over the top; fold and press layers together to seal. Transfer to a greased baking sheet; cut 3 to 4 vents on top. Repeat with remaining dough."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until lightly browned, 15 to 20 minutes. Transfer calzones to a wire rack to keep the bottom crust crisp while cooling slightly. Serve with pizza sauce for dipping."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blamm65"
},
"reviewBody": "This calzone is tantalizing for the tastebuds. Each bite was like food heaven. I ate half and then after my taste buds settled down i ate the other half. The sauce is superb. It was like i waz in little italy and all the old Italian cooks were making my dinner. So easy to make it’s like I never made it at all!! Yummy yum yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marrina"
},
"reviewBody": "Good calzone. Seasonings burned my throat, but I still loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zacruss"
},
"reviewBody": "my own spices ,everything else was the same and came out perfect .I used a pizza stone for mine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kaitlin Lasseter"
},
"reviewBody": "Just a note for the author; 120-130 degrees is WAY too hot for yeast. Water for yeast should be about 100-110 other wise you could kill it.. I will also change how much sausage is used, it over powered the spinach and ricotta for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Chhun"
},
"reviewBody": "The portion for this recipe was great. I just used it for dough portion only though. Then I stuffed the calzone with pepperoni, marinara, and pepper jack since it's all I had. It was good enough for 2-4. Depends how hungry the people are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "natalie"
},
"reviewBody": "All I had was pie dough, and I know it wasn't the same, but the family LOVED this! I made two large calzones with the recipe as stated. Next time, I'll use pizza dough, and I'll load the calzone up with other veggies/meats to make it even more filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari Ramirez"
},
"reviewBody": "Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanMc"
},
"reviewBody": "We use prepared pizza dough and sometimes just chopped spinach into the ricotta mixture. My family loves this recipe and asks for it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Warner"
},
"reviewBody": "Four 6 3/4 inch beautiful calzones! I used about 1 1/4 cup flour for the dough and then used the other 1/4 for kneading. The dough made the perfect soft bread crust and the cheese combo was great! I'm sure you could try it with lots of veggie options and other meats (as others have said). Good place to start and customize from there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JEPPER"
},
"reviewBody": "5 stars for taste, but the previous reviewer was right on when she said the proportions were off. I'm an experienced cook but found it nearly impossible to create 8\" circles out of the dough. Also, even with adding additional flour, the dough was very sticky. Next time, I'd use 2 cups of flour when making the dough, and slightly increase salt and sugar. Also easier if you use a silpat to roll out dough and bake directly on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alison Alfredson"
},
"reviewBody": "We have a great pizza dough recipe we make in our bread machine. It can easily make two medium size pizzas. Since our children were more interested in pizza I had enough dough left over for two large calzones. It was great. My husband has a nitrate allergy, found in most sausage, so we used Al Fresco brand Sweet Italian Style Chicken Sausage (with red and green peppers in it). It comes in links pre-cooked so I diced up two links and warmed them up on the stove. Made the spinach and cheese mixture as directed, except I eliminated all the Italian type seasonings since the sausage already was very flavorful. I added the toppings as directed but sprinkled a tiny amount of mozzarella on top before folding over. Using a fork to pinch the edges works great and looks professional. I baked them on our pre-heated pizza stone for about 18 min and they were perfect. Put pizza sauce on the side. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robertamae78"
},
"reviewBody": "I worked for a mom and pop pizza shop in high school and have never been able to find a calzone recipe that equaled. This one was FABULOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BlackburnK"
},
"reviewBody": "This was excellent! The dough turned out perfectly, and I have never made pizza dough before! We added sun dried tomatoes and replaced the sausage with organic ground turkey- excellent! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSKJS"
},
"reviewBody": "I cheated and used store-bought dough but the filling was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PJ"
},
"reviewBody": "Great recipe! There's enough dough for 4 and it's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ahmom"
},
"reviewBody": "Don't listen to the person who said there were so many technical errors. It was the perfect amount for the 4 of us. Not all flour has the same moisture content so 1 1/2 cups could work for some. You shouldn't blame someone because you had to throw out some filling. You could have turned it into something else. \nIt was an excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Oh my...where to start. First, I'll say that without the many technical errors, this might have been a great recipe. In no way possible did the recipe for the crust make enough for four calzones. I got two, but with one cup of flour (the other 1/2 cup in recipe is for kneading) I should have known. Because of this, I had wayyy to much fillings. I had to throw out almost half of the sausage mix and more than half of the cheeses mix. What a waste! I also had to scramble to figure out what to do, since we are a family of four and I have only two calzones! I had to order a pizza and after all that work I feel a bit frazzled....Sorry, but this recipe just doesn't work as is. I have the two in the oven now for another day....hope they reheat well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajpetti"
},
"reviewBody": "Excellent recipe! I used refrigerator pizza dough and doubled the recipe so I had one to put in the freezer. Probably would've turned out even better had I made the dough from scratch, but it went together very quickly using a premade dough and I had dinner for 2 nights."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "I used the food processor pizza dough recipe from American Test Kitchen's cook book. I also used 1 lb of ricotta because I wanted to use it up and only 3 links of hot Italian sausage which I browned then gave a quick whirl in my food processor with the spinach and ricotta. I keep a small container of extra virgin olive oil with a garlic clove in it for flavor that I use to brush pizza dough and calzones with before they go into the oven. I also put slashes on top of calzones to allow the moisture in riccota to vent other wise they may explode which I've had happen. I bake them on my pizza stone and serve with a home made pizza sauce from another site. This was a huge hit."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/215381/sausage-spinach-and-ricotta-calzone/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
"name": "Everyday Cooking"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/215381/sausage-spinach-and-ricotta-calzone/",
"name": "Sausage, Spinach, and Ricotta Calzone"
}
}
]
}
}
, "about": [
]
}
]