				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Savory Pumpkin Hummus"
,"datePublished": "2019-07-10T03:04:06.000-04:00"
,"dateModified": "2022-01-04T08:11:26.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Georgia J Llewellyn"
,"url": "https://www.allrecipes.com/cook/2172289"
}
]
,"description": "Traditional hummus gets a colorful twist with the addition of pumpkin puree. Serve with your favorite vegetables and pita bread!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ofsUOnp_cz5QxoXo_pGYMZPYZb8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4194488-ea42e809dcf54faa80a167e890f59833.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Savory Pumpkin Hummus"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "50"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "81 kcal"
,"carbohydrateContent": "11 g"
,"fiberContent": "3 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "281 mg"
,"sugarContent": "1 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons lemon juice",
"2 tablespoons tahini",
"3 cloves garlic",
"0.75 teaspoon salt",
"2 (15 ounce) cans garbanzo beans, drained",
"2 teaspoons extra-virgin olive oil",
"1 (15 ounce) can pumpkin puree",
"1 teaspoon ground cumin",
"0.5 teaspoon cayenne pepper",
"0.25 cup toasted pumpkin seed kernels, or more to taste",
"1 pinch paprika" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pulse lemon juice, tahini, garlic, and salt together in a food processor or blender until smooth. Add garbanzo beans and olive oil and pulse until smooth. Add pumpkin, cumin, and cayenne pepper; process until well blended. Transfer hummus to a container with a lid and refrigerate at least 2 hours."
} ,{
"@type": "HowToStep"
,"text": "Fold pumpkin seeds into hummus; garnish with paprika."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT135M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M L"
},
"reviewBody": "We baked a pumpkin from our garden instead of canned pumpkin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Miller"
},
"reviewBody": "I am cooking up a Halloween pumpkin for the pulp and wanted to try some healthy recipes for pumpkin puree. I revised the recipe as other have suggested by using 1 can of garbanzo beans, 1 C pumpkin puree and 2 T Olive oil and the rest the same as indicated (except I forgot to add the cayenne). This is the best! Better than store bought hummus. We love healthy hummus on sandwiches to replace the mayo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimCanCook"
},
"reviewBody": "I love this hummus! I modified seasonings to add curry, turmeric, increased salt, and added black pepper! Divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toomanycats305"
},
"reviewBody": "This is the first time making hummus and I couldn’t have been happier! Absolutely delicious recipe. I added (more than necessary) roasted pumpkins but it turned out great just the way it’s listed here"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice C."
},
"reviewBody": "I gave this 5 stars because the flavor was so AMAZING. However, I really struggled with getting my blades to move because it was like paste. I switched from my food processor to a blender, to a mixer, to a potatoe masher, then back to the food processor. I had to add about a half cup of water and about 3 more tablespoons of oil just to get it to move. I’d love to hear suggestions on what I did wrong or if others experienced this problem as well. Once the struggle ended the result was a tasty hummus I will continue to make, if I can figure out why it was so dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "I was disappointed that there wasn't more pumpkin flavor as I love anything pumpkin. Overall, it was tasty, just missed the pumpkin flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Dumire"
},
"reviewBody": "THIS. TASTES. AWESOME. It made way too much for my family of 3. I used store bought pumpkin seeds w/sea salt, added dried parsley, and an extra TBS of tahini paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NHCarol"
},
"reviewBody": "I followed the revised recipe and doubled it - very good! I hand- blended everything after smashing the chick peas. I like a slightly chunky texture and smashing is a great stress-reliever We will be enjoying this for lunch this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ColoradoMountainMan"
},
"reviewBody": "I really like spicy hot punkin. Do not really care for mashed up chickpeas. So admittedly, not review of actual recipe but by leaving out the garbanzos it gave me the idea and guidance to stir up (for my palette) a non-hummus punkin pooky that is really good. Thank You so much for the idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chocoholic"
},
"reviewBody": "The original recipe is definitely lacking in flavor and punch. But making these changes turned it to gold! I used half the amount of beans and pumpkin, then doubled the garlic. I also increased the amount of cumin and cayenne, but that’s more to your individual taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruce White"
},
"reviewBody": "We used white beans and cooked white pumpkin \nWe added some funnel seasoning to the mixture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GaelGirl"
},
"reviewBody": "Excellent bring for a vegetarian potluck"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wenhuey"
},
"reviewBody": "This came out perfect. Followed recipe to the t!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda b"
},
"reviewBody": "I made this for Thanksgiving and everyone loved it. My first attempt to make a hummus. I will be making more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Korpak Bechtel"
},
"reviewBody": "I was skeptical, wondering how pumpkin in hummus could possibly be any better than my standard homemade hummus. It is fantastic! The addition of pumpkin, paprika and cayenne turned out to be surprisingly delicious. I made the recipe as written minus the pumpkin seeds and thought it was perfect, even after reading the chef’s recommended modifications. It a great recipe where you can start with it as written then increase the seasonings to taste. I didn’t have the pumpkin seeds around, but will try them next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tahoefans"
},
"reviewBody": "I made this for 5 people but I was the only one who liked it and that required doubling the lemon and tahini. We couldn't taste the pumpkin and one hummus-lover didn't like the consistency of this. I think if you want it to taste like pumpkin, use only one can of garbanzo beans. Or add pumpkin pie spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Moulton"
},
"reviewBody": "I don’t own a food processor. When I tried to make it in my blender it was very difficult because of the volume. Now I put all the basic ingredients in a pot and use my immersion blender which makes it very easy. Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billie Bj Marsala"
},
"reviewBody": "It was really good. The pumpkin seeds added a nice crunch. I served it with both sweet potato and tortilla...both were delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yellowwubiedog"
},
"reviewBody": "I doubled the spices and still found the pumpkin flavor overwhelming. I added a spicy red pepper mustard and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Hope"
},
"reviewBody": "Needed to have more of a punch, not worth the effort"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marti"
},
"reviewBody": "Excellent dip. Took others advice and only use 1 can garbanzo beans. Texture was perfect. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Warren"
},
"reviewBody": "I followed this recipe except for the tahini (family member is allergic). It turned out great, and I will make it again.\n\nI have made a lot of hummus, and the addition of the pumpkin definitely improved the texture compared to my previous recipes. My Cuisinart had no trouble pureeing the ingredients. With the 2:1 bean to pumpkin ratio, the pumpkin flavor is very subtle. The raw garlic is strong, though, and roasting the garlic or using less may improve the flavor. I may also add rosemary in the future, which was an ingredient in other pumpkin hummus recipes I found on my search. This hummus is a good way to get beans into my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Steven Yackel"
},
"reviewBody": "I liked this recipe, the pumpkin flavor was not overwhelming and it was very easy to make. This is a great variation for a hummus fan that does not want to get stuck in a rut or if you are looking for something unique during the fall season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mary L."
},
"reviewBody": "Two cans of chickpeas made the hummus too thick but, and didn't help the pumpkin flavor. I added cumin and a bit more liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandra Ryals Morris"
},
"reviewBody": "I forgot to add in my previous review that for the tahini I made the one in the Allrecipe database and used that one for the hummus. Tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "passkey"
},
"reviewBody": "I added 2 teaspoons extra olive oil and instead of blending the pumpkin seeds into the hummus, I toasted them and placed them on top with chopped dried cranberries. Soooo gooood!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HANNER"
},
"reviewBody": "I made this according to Georgia's updated instructions; using one can of garbanzo beans and one cup of pumpkin purée. I used about an eighth teaspoon of cayenne pepper and was compelled to use more than the two teaspoons of olive oil the recipe called for because the mixture was so thick. This turned out seriously delicious and I can foresee that I will be sharing this with others. Thank you Georgia for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessc"
},
"reviewBody": "I could eat this by the spoonful. Made it per the recipe, and the only issue I had was that things weren't blending properly. I added in some extra olive oil and it helped, although next time I'll probably reserve some of the bean liquid.\n\nAlso, this recipe makes a lot, so be mindful of this if you are not making this for a party.\n\nAll in all everyone loved! Can't wait to try this with different toppings like roasted almonds and pomegranate seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "humlove"
},
"reviewBody": "I skipped the lemon, I roasted my garlic, I used smoked paprika, and toasted raw sesame seeds that I ground into fresh tahini, and I cooked my garbanzo beans until tender. I pulsed everything together and upped all the seasonings to my liking. It came out great and everyone loved it. I am glad to find a new way to fix the pumpkins I grew in the garden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Schilling"
},
"reviewBody": "I LOVED this hummus, and I have made hummus 100 times! I used cashew butter instead of tahini (a first for me - I didn't have tahini, which I normally use, so I substituted the cashew butter, added a 1/8 tsp of sesame oil, and it was perfection). Also, I used about 4 TBS of lemon juice and another 4 TBS of ice water, for the lemony flavor I love as well as to thin down the thickness of the cashew butter. I left out the cumin (I'm just not a fan) and used smoked paprika. Pefection, in my personal hummus book!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amira T Fahoum"
},
"reviewBody": "This is a great recipe and yes, a bit hit. My family recipe for hummus calls for 1 cup (1/2 of one can of Joyva) tahini and I would recommend keeping that amount in this recipe as well. It was a little dry with only 2 Tblsp. Otherwise, flavorful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Zhora Autumn"
},
"reviewBody": "What kind of crackers, veggies, or other types of things to dip in work best? I usually use homemade pita chips with hummus. I am wondering if I made some with sugar-cinnamon if that would work? Please let me know what you all have served this with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Kalway"
},
"reviewBody": "Made this for a party! Quite the hit. Brought the leftovers to work, many requests for the recipe. This is an easy, delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kj"
},
"reviewBody": "This is the first recipe I've reviewed, out of dozens tried, because I love it SO MUCH! I followed RedHedd's revisions in the Dec 19, 2012 review to use one can of chickpeas and half a can of pureed pumpkin, and it's phenominal - though I don't like heat, so no cayenne pepper. It's not an overpowering pumpkin flavor, but the pumpkin makes it just a touch sweeter than other hummus varieties I've tried (zucchini, beet, cucumber...). I was torn between a sweeter version of pumpkin hummus on AllRecipes with pumpkin spice, etc. instead of cumin, etc., but this is a perfect combination of flavors for a hummus that works wonderfully as a veggie dip, sandwich spread, or just straight out of the container ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Ala Bohn"
},
"reviewBody": "This was really good. I served it as an appetizer on Thanksgiving this year. I wasn't happy with the seasoning. To me, it was a little bland with the recipe (however, I like things with a zing). So, I would recommend you make the recipe as stated. Taste it and add what you like. I added 2 more garlic cloves, cayenne pepper and a little more lemon juice and it fit my tastebuds, but this was excellent, healthy, and full of fiber. This is something you can make throughout the year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "roden00"
},
"reviewBody": "Just made it (halfed the receipe). I too am having to let the flavors mingle for the 2 hours indicated in the receipe before I cast my final vote. I also used my vitamix. I had to add liquid to get the blades moving. Next time I won't drain the chickpeas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "I absolutely love this recipe! I made it exactly as written and found it perfect! I made it for a group of friends and everyone wanted the recipe. I am picky when it comes to \"good\" hummus and this recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heather"
},
"reviewBody": "I used 1 can garbanzo &amp; 1 can pumpkin. Once everything was blended, I added cayenne to my liking. Great recipe!!! Simply, yummy, healthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "Taste is interesting...not hummus and not pumpkin. Followed the recipe to the letter and my Vitamix could barely move because it was so thick. Ended up adding 2 tablespoons extra olive oil and tahini, another cup of pumpkin and whatever extra lemon juice I could squeeze out of the lemon. Finally, stirred in 1 cup of toasted pumpkin seeds. Am reserving judgement until it has chilled and flavors melded. Am taking it to a party and will post reactions.\nSorry folks....this was barely touched. People were curious about pumpkin hummus but after they tasted it, they didn't go back. Had to toss most of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TABLESPOON"
},
"reviewBody": "Wonderful! I made it for our (Canadian) Thanksgiving dinner and served with crudites. I followed the creator RedHedd's suggested modifications. Definitely has a bite with 1/2 tsp of cayenne. One idea is if you make your own tahini (I did) in the food processor, then you can make the hummus right after without washing out the food processor - two birds with one stone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NaiNai"
},
"reviewBody": "Oh my goodness!!! I always buy hummus. This is the first timeI have made it. This stuff is awesome! I put less Cayenne in it because my husband doesn't like it too spicy. We only waited 20 minutes to eat some. It looked too good to wait 2 long hours for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinformygang"
},
"reviewBody": "Made this to take to Thanksgiving, followed the recipe with the adjustments RedHedd had posted in a review/comment. It was a big hit. The pumpkin taste is not at all overpowering, and the seasoning was flavorful without being too spicy. My husband and daughter are big hummus fans, and definitely gave thumbs up to this recipe. It was our first time making our own hummus, and it came out perfectly. We will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PatO"
},
"reviewBody": "I make hummus frequently but this may be my new fav recipe. Modified to one can of beans , one cup pumpkin, and 1/4 t of cayenne because I don't like too much heat. All else the same. Even my teenager who says she doesn't like pumpkin commented that it is really good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mo Merrill"
},
"reviewBody": "I am not a fan of hummus but I received an assignment to provide refreshments for an upcoming Christmas event and this recipe caught my eye. I followed RedHedd's updated suggestion and used 1 cup of pumpkin and 1 can of Garbanzo beans, increased the oil to 2 Tbsp. and kept everything else the same. Wow this was awesome I made pita chips also from this site and served them to my family for their opinion....All said 5 star even my kids. I am confident when I make this for 300 people next month it will be a HIT....Thanks RedHedd for sharing:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "At first thought it was a bit unusual, but decided to give it a try and was pleasantly surprised with the results. Everyone of my guests absolutely loved it. I would love to modify it so it would eliminate the nut factor in the recipe so my other friends that have nut allergies can enjoy it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Georgia J Llewellyn"
},
"reviewBody": "I'm so flattered to see this at the top of AR's recent e-mail. I had modified the recipe even more this past weekend and it was a hit at a party. I had adjusted the ingredintes by reducing the pumpkin puree to one cup, used only one can of garbanzo beans and one tablespoon of EVOO, with the rest of the seasonings and ingredients the same as posted. It turned out FANTASTIC!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "Nice flavor.. easy... threw it all in the food processor. Needed salt and pepper and more heat for my tastes. Will be using leftovers on chicken wraps for work lunches for the week"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230466/savory-pumpkin-hummus/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
"name": "Dips and Spreads Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1281/appetizers-and-snacks/dips-and-spreads/hummus/",
"name": "Hummus Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230466/savory-pumpkin-hummus/",
"name": "Savory Pumpkin Hummus"
}
}
]
}
}
, "about": [
]
}
]