				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Scottish Oat Scones"
,"datePublished": "1998-08-30T12:13:15.000-04:00"
,"dateModified": "2022-08-22T14:29:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Carol"
,"url": "https://www.allrecipes.com/cook/Carol"
}
]
,"description": "Softly sweetened and dotted with currants, these scones will surely please."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gT57HwUToTgsBSUNyUm5fD10gAA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/32094-eb339e4e73164966bd60fdc4eb66b1e0.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Scottish Oat Scones"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "320"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "164 kcal"
,"carbohydrateContent": "23 g"
,"cholesterolContent": "27 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "243 mg"
,"sugarContent": "7 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"2 cups rolled oats",
"0.25 cup white sugar",
"4 teaspoons baking powder",
"0.5 teaspoon salt",
"0.5 cup dried currants",
"1 egg, beaten",
"0.5 cup butter, melted",
"0.33333334326744 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, mix the flour, oats, sugar, baking powder, salt, and currants. Make a well in the center. In a small bowl, beat egg until frothy, and stir in melted butter and milk. Pour into the well, and mix to create a soft dough. Pat dough into two 1/2 inch thick circles. Place on the prepared baking sheet. Score 8 wedges into each circle of dough."
} ,{
"@type": "HowToStep"
,"text": "Bake 15 minutes in the preheated oven, until risen and browned. Split wedges, and serve warm."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "These are my husband's favorite scones! I doubled the recipe and tweaked the listed ingredients by using buttermilk and increasing the amount from 2/3 cup to 1 cup and substituted brown sugar for the white. I also add 2 teaspoons of cinnamon, 1 cup chopped dates and 1 cup chopped walnuts because it is the dates/nuts that mostly make them his favorite. Today, he requested these for his birthday dessert instead of a cake! So, in addition to drizzling a little glaze over the top, I will serve them warm &amp; topped with whipped cream or ice cream. This is a \"keeper\" recipe to add to my go-to Allrecipes traditional scone recipes. Thank you, Carol!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "French chef"
},
"reviewBody": "I upped the sugar to 1/2 c and 1 T cinnamon . Added 3/4 c cinnamon chips"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberlee Florio"
},
"reviewBody": "Excellent recipe! I substituted applesauce for the butter and added some cinnamon.\nDefinitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heather inoue"
},
"reviewBody": "It was fast to mix and fast to bake. Love how easy this is. A bit rubbery for my scone preference but otherwise good. The scoring idea works well and I formed the dough directly on silicone baking mats, these cut back on prep time and clean up. Needs a topping I made a maple glaze. Note I used buttermilk and dried cranberries otherwise followed recipe. This is a great weekday breakfast! Thanks for sharing the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristella Huang"
},
"reviewBody": "I made this for few times. Last time, I doubled the recipe. I usually make the dough like a ball, and press it like a cookie and add some chocolate chips and about ¼ to ½ tsp of cinnamon. It's so yum! I couldn't have enough. My family says it was good, and it didn't last long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Carman-Esser"
},
"reviewBody": "These are lovely! I substituted raisins for currants and whole wheat flour for 2/3 of the white. I added 1 teaspoon cinnamon and 1/4 teaspoon vanilla extract. \nImportant: the dough must be handled lightly &amp; not overworked. Like biscuits, they come out best if you're in a tearing hurry to get them into the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat Bortscheller"
},
"reviewBody": "I substituted brown sugar for white and loved this recipe. Not too sweet, not too dry and very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Adzuki Chang"
},
"reviewBody": "This came out great even with a gluten free flour sub! Crispy on the outside and tender on the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Lafrance"
},
"reviewBody": "Oops... I’ll try again. Had all the ingredient except for the currants. These are very good considering the minimal effort it takes to make them! I added some sugar/cinnamon on top. Delicious! I will definitely make these scones again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zen kitchen"
},
"reviewBody": "Easy to make. Used wild blueberries &amp; delicious. Know it’s good when your teens like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cosette The Cat"
},
"reviewBody": "Delicious !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Katie Murry"
},
"reviewBody": "There are some very important steps missing from this recipe to be giving it 5 stars.\nWere they edible? Yes. The best? No.\n\nFirst tip: You must use buttermilk when using baking powder, or you'll get that familiar fizzy baking powder taste that overwhelms the baked good. The acidity in the buttermilk interacts with the baking powder and gets rid of that taste and also helps them rise a bit. \n\nSecond tip: cut in your butter while it's COLD. Melted butter makes for flat baked goods. Cold butter makes a delicious flaky, crispy scone that isn't flat. \n\nThird tip: Don't over mix your dough. You'll end up with flat dense bricks. \n\nI followed this recipe to a T and they turned out flat and tasting of baking powder. We ate them with our coffee to cover the taste. I'll be doing another batch tomorrow with my tweaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wadevc"
},
"reviewBody": "I've made these oat scones many times per the recipe as well as exploring numerous adaptations. My latest version came out with amazing flavors. Substitute buttermilk for the milk, add 1/2 cup fresh blueberries, 1/2 cup chopped dried apricots, 1/2 cup toasted roughly-chopped almonds. Add a sprinkle of large grain turbinado sugar to top of dough prior to baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen Nowak"
},
"reviewBody": "I thought adding oats would be interesting and add some nutrition, but instead the oats took away from the delicate nature of a scone. The flavor was ok, but we didn't like the rough, dry texture. Since scones are a treat, I will stick to the traditional recipes that are so lovely and delicate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janell"
},
"reviewBody": "Yes I was out of eggs so I soaked 2Tbls of chia seeds in the milk untill it gelled. It came out great . The next time I make it I'm gonna use eggs. I can't wait. thanks for the recipie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "L. Bobki"
},
"reviewBody": "I had my middle school students make them in FACS class. We substituted chocolate chips for currants (kids choice). They were easy to make, but came out dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kevin G"
},
"reviewBody": "Far too dry as written. i followed the recipe as written and found not nearly enough moisture in only 1/3C of milk for the amount of flour b and oatmeal. This recipe takes significant modification in order to be passable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pinch of Sarcasm"
},
"reviewBody": "These came out great, my family loved these. I am going to try and add a little honey and maybe a pinch of cinnamon next time. I had zero complaints but my grandmother didn't like how crumbly they turned out. So, maybe a little honey next time will help bind all the ingredients together and add a pinch of extra sweetness. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bmillike"
},
"reviewBody": "Great recipe! Thanks so much for sharing. Like others I modified it a bit as im gluten sensitive. I used all oatmeal flour and added some extra moisture with Greek yogurt and additional milk. I also used 1/2 cup of brown sugar instead of the white, 1/2 cup white chocolate chips and 1/2 cup dried cranberries and blueberries. The scones are delectable. To those who had dry results, please don't be discouraged. Biscuit and scone making takes a bit of a nack. Your dough should be sticky and messy to handle. A dry dough makes dry goods so add extra liquid if necessary to get this texture. Also be careful not to overwork the dough, just mix the ingredients thoroughly and then flour your hands lightly to shape. I usually flour lightly again between each, being careful not to incorporate the flour into my dough. I use a lighter flour for this purpose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charlene S Noto"
},
"reviewBody": "very nice scones. made it as per the recipe with the addition of dried cranberries. tender and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2Hughes"
},
"reviewBody": "Yum! especially warm from the oven. I added chocolate chips in place of the dried fruit I didn't have---very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iris Berkel"
},
"reviewBody": "I make these in the cold days of winter...nothing better than to have one with a cup of tea in the afternoon. I followed the recipe, and tweaked it a little , adding chopped dry apple slices, and fresh frozen cranberries in addition to raisin/ currents. I also use a cast iron frying pan to bake them...give it a nice brown bottom. They are just awesome! Will make them again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sedgar"
},
"reviewBody": "I just made this recipe with a couple changes. I replaced the same amount of all purpose flour for spelt flour, added a 1/3 cup of applesauce, and used fresh blueberries. Yum. Will be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Termre"
},
"reviewBody": "Chopped prunes instead of currants"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jnnpppnk"
},
"reviewBody": "Blech! Blah! Boo! Did not care for texture or taste. Instead of white flour, used Robin Hood Nutri flour blend (tastes like white but is unbleached plus it contains the goodness of oat hull fibre and is used in all my recipes, scone or otherwise), reduced the sugar and used brown instead of white, reduced butter to 3 Tbs. with applesauce for the remainder. Shot of vanilla. Brown sugar sprinkled on top. It'll be back to non-oatmeal scones from now on..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "They Bake"
},
"reviewBody": "I altered the recipe a bit, but it came out amazing. I skipped the currants and added a cup of chopped apples. Added a touch of cinnamon and switched out the sugar for dark brown sugar. Then, before baking, I sprinkled them with a touch of Demerara sugar. Best Scones I have ever had. I will never make scones without oats again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M&KHarris"
},
"reviewBody": "I substituted buttermilk for regular milk and raisins for the currants and then sprinkled cinnamon/sugar when they came out of the oven. Very nice and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "makaloco"
},
"reviewBody": "I followed the recipe except for using whole wheat flour and brown sugar, also 1/2 cup each of dried cranberries and raisins. The scones came out very nice but unfortunately tasted strongly of baking powder. I'll make them again but will definitely reduce the amount of baking powder by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shellz"
},
"reviewBody": "Yum! They were a bit dry, but I think because I baked them too long. Nonetheless, delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julianne"
},
"reviewBody": "Delicious! I decreased the oats by 1/2 a cup, increased flour by 1/2 c and sugar to q1/2 cup and added in fresh blueberries and a 1/2 tsp of cinnamon, then sprinkled the top with white sugar before baking. These scones are hearty and delicious. Definately a recipe to keep!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine Muterspaugh"
},
"reviewBody": "These were pretty good, but I think I like our other scones recipe better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. Taylor"
},
"reviewBody": "I really like this recipe, I added blueberries, walnuts and golden raisins, used whole white wheat and used 1/2 c of 1% milk. I really like that the butter is melted and not cut-in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "I tried it twice once according to the recipe, and once changed up a bit. Both were good. The original recipe is just a tad bit dry and slightly heavy. I like them that way. So if you don't like that I'd look for a different recipe. I tried it with whole wheat and they where dryer so I should have compensated for that, my falt. However they where what I was looking for not too sweet not too cake like. Heavy, slightly sweet. Yummy. The way I'd expect a scone to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DKBECK"
},
"reviewBody": "A really good basic recipe. Not too sweet, nice density, love the oats in it. Good as is, but options for add-ins are endless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marjorie"
},
"reviewBody": "Not wonderful. I wouldn't recommend this recipe. I don't like to give a negative review, but in all fairness to those who read reviews to judge whether or not to try a new recipe, I would advise you to move on to another of the wonderful scone recipes on this site. Very disappointed in this one and I'm a very experienced cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Jakubowski Matteson"
},
"reviewBody": "Made this for breakfast for my four children and myself. I substituted whole spelt four for white, honey for sugar, and dried cranberries for currants. I placed the rounds on parchment on a baking stone in the oven. It was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "colleen"
},
"reviewBody": "I followed the recipe as written. They were a hit with my family. I feel that they are a cross between a scone and a biscotti. Great with milk or coffee"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dan8923"
},
"reviewBody": "WOW. This recipe is so amazing and easy. I'm not really a baking person but this was so easy. As others mentioned,I wanted it to be moist and chewy so I used 2 cups of flour instead of 1.5 and 1.5 cups of oats. I added little more milk and a tablespoon of maple syrup. It was so moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DIEM"
},
"reviewBody": "Easy and quick to put together. Nice and sweet but not too sweet. On the cakey side but they are still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kmnash1219"
},
"reviewBody": "Surprisingly easy. A little dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "My boyfriend and I were licking our chops after these!\r\n\r\nWord to the wise - when adding the butter to the egg/milk mixture, be sure to let it cool a bit. You don't want the egg to start cookin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cberichards"
},
"reviewBody": "Very, very tasty. Skip the currants if you don't like them, these work well plain or with the dried fruit of your choice. They also freeze pretty well, I've been putting the second disk in the freezer wrapped in plastic. Great with jam!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luiology101"
},
"reviewBody": "These were really easy to make and tasted great. I used dried cranberries instead of currants. \r\n\r\nThey were buttery and crunchy on the outside and soft on the inside. You couldn't really taste the oats. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bebe"
},
"reviewBody": "Substituted oat flour for the white flour, reduced the sugar (used homemade brown instead), coconut oil for the butter and blueberries for the currants. Doubled the recipe and it came out great. My daughter's picky picky BFF was over and ate 2. That speaks volumes, believe me. Will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GEFOX3"
},
"reviewBody": "great recipe. so simple and filling. 15 mins is too long for my oven, only took about 10-12 mins to cook. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Alicia Cromwell"
},
"reviewBody": "Just before making this I was looking at another recipe that used dates in it. So i added about 1/2 cut chopped dates into these and they were sweet and perfect. they were a little dry... but perhaps thats part of scones. Still perfect with tea :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BB"
},
"reviewBody": "Easy and perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "Amazing!!! Used cranberries instead of currants and added the zest of an orange. Also put orange glaze on them from a recepie here in allrecepies.com. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas"
},
"reviewBody": "I love making these. I sometimes use raisins instead.\nMy neighbors are always asking me to make them some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrystal"
},
"reviewBody": "So yummy! I kept sneaking just one more... The only changes I made were to decrease the oats to 1 1/2 cups, replaced the currants with dried cranberries and added 1 Tbsp of orange zest and 1/2 - 1 tsp of cinnamon. These were just right, not at all dry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fancy1"
},
"reviewBody": "a little dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEANNA763"
},
"reviewBody": "Loved this recipe! I substituted currants with fresh marionberries. Very moist. The oatmeal holds the juice from the berries. I will make these over and over and use fresh fruit always. I have some fresh blueberries for the next batch. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen Maust"
},
"reviewBody": "I love these! The first time I made them I added a teaspoon of orange peel and some chopped craisins - amazing! This morning I used 1/4 c butter and 1/4 cup canola oil and patted some raw, unrefined coarse sugar on top before baking with excellent results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "emilyjoy"
},
"reviewBody": "These didn't turn out well. I see great potential! They were way too crumbly and didn't end up staying together during the patting/scoring process. Then the bottoms burned and they didnt rise while baking. I followed the recipe and made no adjustments. \n\nProbably won't try again unless I wade through all the other reviews to see what adjustments worked best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie McIntyre"
},
"reviewBody": "They looked too dark coming out of the oven, but the oats had crisped around the edges making a nice toasty flavor! Best scones I've made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Elizabeth Bullock"
},
"reviewBody": "This is a perfect scone recipe. It's easy and delicious. I used dried cranberries but other than this substitution, I followed the recipe exactly. The wet ingredients mix in very well with the dry ingredients; just don't use heaping or densely packed cupfuls of flour and oats. Also, slice a few pats of butter and let sit to room temperature, put out a couple of jars of jams and jellies, some fresh berries, and you have a small afternoon tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "osulolli"
},
"reviewBody": "These were yummy and super easy! I used dried cranberries instead of currants and I used orange sugar in place of regular sugar. These are great as is, but also did half with an orange glaze for those who like their scones sweet. Really, so easy and so fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LowfatDANCER"
},
"reviewBody": "Excellent! I used half whole wheat, and half all-purpose flour, subbed applesauce for half the butter, added 1/2 tsp orange extracts, and used blueberries instead of currants. With raspberry jam they're amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Makettle2"
},
"reviewBody": "Very good, disapear in minutes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "These are incredible! I've made them several times, and every time they come out delicious. The outside is crisp and the inside is soft and flaky. And they're so quick and easy! I live on my won so I'll often make a batch of these on Sunday morning and freeze the individual pieces for breakfast during the week"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "A good hearty scone. Easy to make and delicious warm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Wintour"
},
"reviewBody": "Great! But I didn't have raisins and left them out and put in slivered almonds. Definitely needs raisins or currants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Marsh"
},
"reviewBody": "These are truly delicious! I will definitely make them again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachelbee"
},
"reviewBody": "add any fruit! save half of dough to be cooked the following morning for more fresh scones!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennabeanski"
},
"reviewBody": "These are really good! Easy to whip up with what I had in my kitchen. I'll probably make these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MLPS"
},
"reviewBody": "These scones are hearty, wholesome and full of oatey goodness. I added craisins instead of currants and substituted some of the sugar with maple syrup. I think the maple syrup gave them a richer flavor, which I loved. I will definitely be making these again, especially considering they don't require buttermilk or loads of butter like other scone recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Fisher"
},
"reviewBody": "Very good. Made exactly as written using craisins instead of currants. Also on the advice of a friend I cut the scones into individual pieces and pulled them apart slightly before baking. My husband said he could taste the salt but I didn't. You can add anything to these scones to customize. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefaz"
},
"reviewBody": "great my family loves em i add 1/4 teaspoon each of ground nutmeg and cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebeccaP"
},
"reviewBody": "These turned out really good! I did see where a few reviwers said they were dry and they are a tiny bit, but it doesn't stop them from being great! I didn't use 2 cups of oats (only 1 1/2 cup). Will be making this more often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmastros"
},
"reviewBody": "I used raisins in place of currants and these turned out superbly! My husband and I enjoyed them with mock Devonshire clotted cream, and English Breakfast tea. A breadfast that would make the Queen proud!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RAZZMATAZZ"
},
"reviewBody": "Had no problem with dryness, maybe because after reading the reviews I added a little extra milk. However they were a bit heavy. Not really what I was expecting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hayley H"
},
"reviewBody": "These are just like the scones my mom used to make, and they always satisfy my craving for that childhood treat. =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItsAWonderfulLife"
},
"reviewBody": "I love these scones! They are not sweet like some, perfect for breakfast. I made mine with raisins because I can't find currents anywhere, and added 1/2 tsp. of cinnamon because I like it. I'll definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Moutsopoulos"
},
"reviewBody": "These are absolutely fabulous. I made the recipe to a 'T', except for making individual scones rather than forming 2 large circles and scoring into wedges. I then baked 10 mins at the same temp. I loved the texture and also how they aren't too sweet. I don't think they need a thing - jam, butter, etc. The butter flavour actually really comes through. Wonderful! Don't change a thing! - Update: Because I didn't have enough butter today, I made these with 1/4 butter 3/4 olive oil. Still perfect and delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cakelover28"
},
"reviewBody": "mmm a delicious treat! Great for snacks, desert, or breakfast! I made some today and they turned out wonderfully! They are a cross of a small cake and a cookie. Instead of currants and oats, I used chocolate chips. I also sprinkled them with sugar right when they came out of the oven. I found they only needed to cook for about 7 to 8 minutes though. Overall, a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janet"
},
"reviewBody": "Yummy! Loved the texture of the oats. I thought the dryness/crumbliness was not a problem - about on par with other scones. I subbed 1/2 the flour for wheat and added 2tbsp orange extract, 2tbsp cinammon, and subbed raisins for currants. Additions are needed if you want something sweet. UPDATE: first time, I made individual scones and time was perfect. second time, I made 2 larger rounds to cut into wedges, and the middles took about 5 minutes extra to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luvthekitchenintheicebox"
},
"reviewBody": "I think if would have remembered the sugar they would be a 5 star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Louise Whitlow"
},
"reviewBody": "Really good and sooooo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kalika"
},
"reviewBody": "These are delicious and very easy to make! I followed the recipe very closely except for adding an additional 1/2 cup of fresh blueberries. The fresh fruit was a great addition. I also separated the individual slices before baking. They were gone very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat92345"
},
"reviewBody": "These are really easy to make and taste delicious!! Just make sure to not put 4 teaspoons of baking soda instead of baking powder and dont put 4 tablespoons of either! Another tip: try them with chocolate chips instead of currants. Deliciouso!! (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I made these several times, everyone one loves these scones. I used dried cranberries instead of currents and served with lemon curd. Just delicious! Of course, great with a cup of Herbal tea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee'"
},
"reviewBody": "these were great-loved them! making my second batch now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JellyFish"
},
"reviewBody": "I do not care for currants, or dried fruit for that matter, in baked good. I used chopped almonds, and also added 2 TB cinnamon. While I thought these were pretty good, they were a bit too dry for my taste. If I were going to eat these with butter or jam, they'd be fine, but on their own they were a little too dry. Good flavor, however. Next time, I think I will use less oats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith C."
},
"reviewBody": "Excellent for breakfast! As per other users, I always add one grated apple to make more moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Decent. Far denser than expected and with a grainy texture. I left them out before cooking in their sliced circular state, so perhaps that is why? Either way, the flavor is really good - but I was not a fan of texture and density. Would try another recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie R."
},
"reviewBody": "They were good when they were warm but, they became dry and crumbly when they cooled. I will make them again. They are great warm with strawberry jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "utooley"
},
"reviewBody": "I found these to be a bit bland, but they would probably liven up if you added some brown sugar. I added 1 teaspoon of cinnamon, 1/2 teaspoon of nutmeg and 1/4 teaspoon of cloves. If you added some more sugar, and some orange or lemon zest in addition to the spices, these would be great. They were also very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mountainfarmer"
},
"reviewBody": "They were great. A big hit with the family. I have made them 3 times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKW"
},
"reviewBody": "Delicious! They were really easy to make and taste really good. I added a little extra sugar and currents."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "iloveonions"
},
"reviewBody": "The real beauty of these scones is how fast they are to make. A nice, flexible, every-day recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "I added to much milk and subbed honey for the sugar, so made these into drop scones! They are very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hisdaughter"
},
"reviewBody": "I love this recipe! My family had eaten it 5 days a week, for six weeks without getting tired of it! I did use these substitutes at times: wheat flour, choc. chips, criasins, raisins, butter flavored shortening (sub. for butter), and banana (sub. for eggs). I always doubled the recipe. This will always be a favorite, thank you so much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "BLAH!!!! I did use cranraisins like others suggested instead. I have cranberry recipes that are much better for scones.My husband said to give it a 2, but I'd given it a 1."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "quistz"
},
"reviewBody": "Great recipe - I just used craisins and added about 1/4 c more for more flavor, snipping them in half to keep them current-sized. Easy trick: use 2 sticks of frozen butter and grate half of each into the dry ingredients before adding the wet stuff (the other half will melt in your hand). It cuts down on the amount of stuff you need to mix, thus less gluten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "This was my first attempt at making scones. Wow! They were easy and turned out great, even though my baking powder was three years out of date and my husband is very discriminating when it comes to scones. The only change we made was using cranberries instead of currants. We will definitely make these often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "thecookiemonster"
},
"reviewBody": "My mom absolutely LOVED these thank you for this recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jasmine"
},
"reviewBody": "Awesome base recipe! If you only want a plain scone with jam use the original recipe. If you want to jazz it up put what you like in eg. lemon rind and blueberries,or apples and cinnamon,or etc etc. If you want a sweeter scone you could add extra sugar which I did as I was not using with jam. I also replaced milk with yogurt as that is what I had.I also make individual scones just drop them on and flatten a bit with hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brook"
},
"reviewBody": "This is my new favorite recipe. The scones come with just a bit of sweetness. They are so simple, with great texture and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nilly"
},
"reviewBody": "This was okay. It needs more liquid.... maybe more milk? it was very dry and crumbly, will probably try again, with a little more liquid next time. Easy to make with a 3 yr old to \"help\"."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/6906/scottish-oat-scones/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1997/bread/quick-bread/scones/",
"name": "Scone Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/6906/scottish-oat-scones/",
"name": "Scottish Oat Scones"
}
}
]
}
}
, "about": [
]
}
]