				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Scrumptious Seafood Linguine"
,"datePublished": "2018-06-08T09:15:14.000-04:00"
,"dateModified": "2023-01-03T09:41:08.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Jenni Lawson"
,"url": "https://www.allrecipes.com/cook/24324172"
}
]
,"description": "Try this seafood linguine recipe for a perfect pairing of crab and shrimp in a rich, creamy, Parmesan-based sauce served over linguine pasta."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UMVEymXONacufiQv7WEptl2BwUw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8283054-6459abffaa2d4e3baef94f559f79ed7e.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Scrumptious Seafood Linguine"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "89"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "437 kcal"
,"carbohydrateContent": "41 g"
,"cholesterolContent": "173 mg"
,"fiberContent": "3 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "524 mg"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 (9 ounce) packages fresh linguine pasta",
"0.25 cup butter",
"1 clove garlic, chopped",
"1 cup heavy cream",
"0.5 pound imitation crabmeat",
"0.5 pound cooked salad shrimp",
"1 cup freshly grated Parmesan cheese",
"salt and pepper to taste",
"1 tablespoon chopped fresh parsley" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add linguine and cook until tender yet firm to the bite, about 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "At the same time, melt butter in a large skillet over medium heat. Add garlic and sauté until fragrant, about 1 minute. Stir in cream and cook until thickened, about 5 minutes. Add crabmeat, shrimp, Parmesan, salt, and pepper. Reduce the heat to low and cook until heated through, 2 to 3 minutes."
} ,{
"@type": "HowToStep"
,"text": "Transfer cooked linguine to a serving platter. Pour seafood sauce over top and garnish with parsley."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MarineJason"
},
"reviewBody": "Such a quick, easy recipe for those fast paced lifestyles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Clare Urbanski"
},
"reviewBody": "Very \"okay.\" The crab was the only part of it with any flavor, no thanks to any of the other ingredients. Tasted pretty much like any other pasta dish aside from that. Too expensive to be worth it (and I bought the cheapest salad shrimp and imitation crab I could get)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie Walters"
},
"reviewBody": "Excellent! I used shrimp and lobster meat. No changes necessary. Try it, you’ll like it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laraiezzi"
},
"reviewBody": "This recipe was a big hit at my house! I loved it because it was simple and quick to make. I did substitute 1 lb of lump crabmeat for the shrimp and imitation crabmeat in the recipe. For the pasta I used a fresh spinach and artichoke stuffed ravioli, and it went with the crab great! Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nanny G"
},
"reviewBody": "Delicious! I need to make it more saucy- maybe with more liquid? wine? It was yummy! I didn't have any shrimp- I used evaporated no fat milk. I also used penne pasta. So, it wasn't the same recipe- but was great using just the ingredients I had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Jackson"
},
"reviewBody": "I started off following the recipe but it quickly morphed into something else...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jennings Kipling"
},
"reviewBody": "Delicious! Quick and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "I have made this recipe multiple times tonight I made without the salt (dad cannot have) forgot the mushrooms that I usually add"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilt810"
},
"reviewBody": "I added little changes, more seafood and made my own pasta, it was wonderful. Best seafood pasta ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Natalie Quashie"
},
"reviewBody": "I made it and stuck to the recipe with a few exceptions. Added broccoli for some color, didn't use crab meat and used chopped fresh shrimp. It was soooo good and really simple to make. Round two tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andie"
},
"reviewBody": "Absolutely delicious and really easy to make! I did make a couple of changes though. I cut up tiger shrimp and put that in, along with real lobster meat. The imitation crab wasn't to our liking. I also doubled the Alfredo sauce recipe (the butter and cream), as I found it to be too dry with only the only cup of cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JSL"
},
"reviewBody": "It was good but could of used some more flavor. I added a good amount of old bay to it even though that wasn't in the original recipe. I also put a little bit too much crab meat in it so it made the sauce really thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adriana De La Cruz"
},
"reviewBody": "I made this dish and it was delicious.. !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Zartman"
},
"reviewBody": "followed recipe, with a little extra garlic. Was really good even with sprinkle parmesan. Would be awesome with fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SweetNov88"
},
"reviewBody": "This was just okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mcoralee"
},
"reviewBody": "We all liked this one! I added the white wine as someone else suggested, just to thin the sauce a bit. I had to make one major change because the only seafood I had on hand was fish. I used fresh haddock, and it turned out fine. A make-again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "girlygirl"
},
"reviewBody": "first time I made as is....and it was ok. seconde time I added more garlic, a sqeeze of lemon, scallops, and salmon lightily seared. WAY WAY WAY better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jademnm2"
},
"reviewBody": "This turned out better than I thought. Followed other suggestions and added about six cloves of garlic, small amount salt&amp;pepper,mushrooms,raw shrimp and scallops and a some lemon. It was easy and fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emilia"
},
"reviewBody": "Super easy, very quick recipe. Could use some more flavor. Overall, my husband, mother, and toddler all raved over it, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momofone"
},
"reviewBody": "So good! Tasted just like the Red Lobsters Seafood Pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkstevens09"
},
"reviewBody": "Holy cow, loved loved loved this! It was easy and just tasted spectacular. I made as directed, but used real crabmeat (canned) instead of imitation. I highly recommend doing this if you can. I also used fat free half &amp; half instead of heavy cream in order to cut down on calories. Because the cream was thinner, I did end up needing to add some cornstarch roux to thicken the sauce. This was wonderful and I will be making it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "I made this just as written. It was okay, but lacking in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lina Hershberger"
},
"reviewBody": "Used 1 1/4 pounds of fettuccini. Doubled butter, heavy cream, and crabmeat. Used 4 cloves of garlic, and 1/4 pound of diced shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarita Peter"
},
"reviewBody": "Great recipe. Some additions - fresh mussels and scallops with the shrimp is wonderful, omitted imitation crab. Didnt have heavy cream so i used evapourated milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori347"
},
"reviewBody": "whole family LOVED IT. I added mushrooms. I make it at least once a month"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Gage"
},
"reviewBody": "LOVED IT! I used scallops in place of the crab meat (just roll them in flour and cook in butter) and it was fantastic. Also, I sautéed mushrooms with the garlic. My husband was so pleased, he volunteered to do all the cleanup. Mmm! Thanks Jenni!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce"
},
"reviewBody": "We loved this and will make it agsain and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patti Terranova"
},
"reviewBody": "An excellent easy pasta dish. I pumped it up just a bit by adding mushrooms in with 3 cloves of garlic then deglazed with some white wine letting it reduce to almost nothing then adding half heavy cream and half non-fat half n half to reduce some of the fat. The flavor was incredible. Don't forget the fresh parsley. Thanks for sharing your recipe Jenni!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeninew"
},
"reviewBody": "WOW!!!! I order some version of this dish any time I can when I go out to eat...one of my all time favs. This version was as good as any I have had at a restaurant. I didn't use the crabmeat at all. Instead, I added bay scallops and used medium sized fresh shrimp. This dish is simply to die for...or to die from if you eat it too often! This one is a real keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "75206"
},
"reviewBody": "Very good! We used crab and shrimp, rotini pasta and mushrooms! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci-in-Cali"
},
"reviewBody": "Yum!.. I actually used a lb of dry thin spagetti and about 1 +1/2 cups of half and half which I thickened with milk/flour mixture; 2 cans of drained clams and 1 pound of frozen cooked shrimp... Doubled the garlic because we love food garlicky and probably used about 5T of flat leaf parsley, sprinkling some over the top when I served it!.. My family likes heat so I sprinkled some cayenne over each dish as well!.. I already have requests for this again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "Excellent. Next time I'll make more. I used regular sized shrimp and chopped them up. I also didn't have cream so I used skim milk and a few tablespoons of cream cheese. I added garlic too. Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Alice Pruitt"
},
"reviewBody": "I am not really a fan of imitation crabmeat or crab but this was so good. I added the pepper to my liking and it was the best. The pepper really makes a difference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DELORES1948"
},
"reviewBody": "excellent made it as the recipes calls for no changes and we will make it often"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lucy"
},
"reviewBody": "Great recipe! I substituted fresh scallops &amp; crab instead of imitation crabmeat allowing them to cook in the sauce for a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Made this a while ago b/c I had a craving for something rich (and sinful...). B/c I am on a budget, I subbed canned crabmeat and salad shrimp (drained). I also used canned Parm cheese cause that's what I had on hand. I liked the flavor of this, but must say that my pasta was DRY! Still edible (I had second helpings!), but a bit too dry for my liking. Don't know if my substitutions had something to do with that (?). All said, a good pasta dish, but not something I'd make on a routine basis (my bf would not like this at all...). Thanks for sharing though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I used medium shrimp, imitation lobster, imitation crabmeat, and after everything was plated, topped it off with garlic butter mussels. I made the recipe for a friend's birthday dinner, and he raved about it. It was so simple to make. It's an impressive dish without being too ambitious for those not used to cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I just made this and it was wonderful! I took a few others advice and added fresh red pepper. I also used half and half and some canned milk too. I added some of my Tastefully Simple garlic, garlic and onion onion also added some red and black pepper blend to it. We will be having this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROBBIN58"
},
"reviewBody": "Rich! Rich! Rich! This really was scrumptious. I didn't have salad shrimp so used cut up regular shrimp but I don't feel they added anything to the dish, the crab was fine on its own. I followed the rest of the recipe as it was and the only change I would make is to add more cream to make it a bit saucier. Will definitely make again! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RB"
},
"reviewBody": "I used diced onion instead of garlic. Since I was using scallops, I omitted the \"funny\" imitation crabmeat and used about a dozen uncooked med shrimp, diced. Didn't use any salt or pepper, just a couple of good dashes of Tony Chachere's Cajun seasoning. Grilled the \nscallops but you can pan sear them as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "We just made this tonight and it was a fantastic dish! I made a couple changes though. I used half and half instead of cream and added a bit of white wine while cooking. I also had uncooked shrimp and fresh mushrooms that I sauted with the garlic. This is defiantly a recipe I will use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "USER"
},
"reviewBody": "Pretty good. I used real crabmeat and I used half-n-half instead of heavy cream and the sauce came out a little thinner than I would have liked. I also added scallops, which are watery, so that may have contributed to the thickness also. Next time I'll use heavy cream and crabmeat only. Overall, a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sandstra"
},
"reviewBody": "This recipe is delicious as is, but the second time I made it I was looking to make it a little less of a guilty pleasure. I used one can of whole evaporated milk instead of the cream and added some white wine for extra flavor. Follow the directions and add a well mixed slurry of 1T cornstarch and 1T cold water to the simmering sauce to thicken it as a last step if it needs it. Serve with fresh parmesan. Admittedly it's not the same, but it's almost as good as the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie"
},
"reviewBody": "Excellent!! I tried to save a few calories by using margarine in place of butter and half &amp; half in place of heavy whipping cream. I wanted a little color in the dish, so I added one bunch of fresh chopped parsley to the garlic when cooking. We love garlic so I used 6 cloves of garlic and chopped them in the food processor with the parsley. Don't use the parmesan in the green can EVER... fresh grated parmesan adds so much flavor it's worth the extra money. The directions say to cook the pasta first but I always prep pasta last... I don't like to leave it sitting while I prepare the sauce. A trick for pasta is to return it to the pot after you drain it and let it cook just a minute, the sauce adheres better to the noodle. This was an easy and delicious recipe. Thanks Jenni!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mscookalott"
},
"reviewBody": "I followed the recipe but I don't know what went wrong. It turned out awful. I don't doubt that it's a good dish but, I won't attempt to make it again. I'd rather pay the money to eat it at a restaraunt where I know it's prepared right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda Brock Fuller"
},
"reviewBody": "Until recently, I would not eat seafood with anything mixed. Only fried or griled with things on the side. But this made a believer out of me..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Hink"
},
"reviewBody": "This was SO good! I added a little more garlic (love garlic). WONDERFUL!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katie harrison"
},
"reviewBody": "This was really good. I used 16 oz of immitation crabmeat and left out the shrimp (just because I didn't have any), and I also used whole milk instead of the cream. I did notice that I had to add more milk as the sauce cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curt McLey"
},
"reviewBody": "As good as it is fattening, and it's very fattening! Do note: The longer the sauce warms, the thicker it gets. So if you prefer your sauce on the thinner side, dish it up quickly. I used one half -- 1/2 and 1/2 and 1/2 cream, in an attempt to thin the sauce, but it was still very thick. This one is easy and highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PHOENIXSINCLAIR"
},
"reviewBody": "Very tasty. I added sauteed mushrooms and scallops per some reviewers recommendations, (thank you very much). I think I'd prefer a thinner sauce, which is easily accomplished by adding milk or using half and half to start with. But, all in all, a yummy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NJfromNJ"
},
"reviewBody": "I found this to be a little thick for my tatse \"as is\". I added a couple of glugs of white wine and a little pasta water. This is easy and fabulous. Served with green salad and French bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking 101"
},
"reviewBody": "Left out the crabmeat, cooked and added fresh scallops. Doubled the sauce. So So Good We enjoyed. Thanks so much for the post. Remember to add ingredients to your taste. Thanks for the post."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LVBNMOM"
},
"reviewBody": "This is fantastic! Very tasty! I did add a bit more cream. I have made it several times for guests and all have raved. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "This was so good Jenni! Much like an Alfredo with seafood. Didn't use the crab as I had a lot of frozen shrimp in the house. As per other reviewers I added fresh mushrooms. Roasted red peppers were a nice addition too. I also threw in my usual garlic and onion powders and just for fun, a bit of cayenne for a kick. Good note \"Dizzy\"; you're right! Thanks for a very nice recipe that everyone enjoyed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "This is an awesome recipe. Pay no mind to the reviews that say it is bland..any good cook knows to taste as they go and add whatever makes it better for them. ;) I also add mushrooms and broccoli to mine. Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JENMLUX"
},
"reviewBody": "This recipe was simple, quick, and delicous. The only thing I would change was adding more cream and a little less butter to the mixture. I am definetly making this again. The sauce would work with chicken too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Primo"
},
"reviewBody": "very well liked every time i make it ... not to long prep and very filling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This tastes great and it's so easy and fast. My husband absolutely loves it. The kids don't care for it. Me I can only eat a small helping because it's so rich, but it tastes great. I've made it 4 times now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MissChievous"
},
"reviewBody": "This was soooo bland. Boring, boring, boring. I should have guessed from the ingedients list. Will never make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAELITH"
},
"reviewBody": "This was a very good recipe but I wish the sauce would have thickened up a bit more. Husband said it was a keeper though and he's very picky. I used a pound and half of regular sized shrimp and left out the imitation crab since I don't care much for it. Also seasoned it up a bit more with some Greek Seasoning. Served with a salad and garlic bread...great meal. I'm going to work on getting that sauce a bit thicker though. Maybe more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bhertzberg"
},
"reviewBody": "I thought this was VERY good. My family didn't enjoy it as much as I did though. The sauce was a little bland I guess, but I stilled loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stefany Grider Baldwin"
},
"reviewBody": "I was a little scared making this recipe...I've never cooked anything with heavy cream before. Oh my gosh, if I could give this 10 stars, I would! Absolutely fabulous!! My boyfriend compared this to a dish at Olive Garden! I prepared this dish exactly as described, but I doubled the recipe. I also served this with the Maryland Crab Cakes III recipe from this site. DELICIOUS and great presentation!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UTOPIA122"
},
"reviewBody": "I really liked this recipe. Fast and easy!! I did add a little sweet basil and thyme to give a little extra flavor. Will definately make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChelleJ1216"
},
"reviewBody": "Yummy and so very easy! Thanks for sharing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvsnoah"
},
"reviewBody": "I thought this was very quick, easy, and good. I did saute some fresh mushrooms with the butter and garlic. Maybe as a result my sauce was too thick once I addes the cheese but I just thinned it out with a little more cream. The results were very good and we will definitely have this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MONKEYHANGTIME"
},
"reviewBody": "I can't believe how easy this was! and it came out tasting fabulous. I had to improvise only had imitation lobster but will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was easy to make and tasted fabulous. I increased the ingredients to make enough for nine. Thank you so much for sharing. It was a hit with my husband and son."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ABISCH"
},
"reviewBody": "This was incredible! It was a huge hit with my family. I used jumbo shrimp cut into bite sized pieces instead of the salad size. The second time, I also added sundried tomatoes and scallops. The tomatoes were such an added bonus. This recipe is definitely worth trying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fachowna"
},
"reviewBody": "I added sliced mushrooms when I cooked the garlic and substituted half and half for heavy cream. The sauce was a little thin until I mixed it with the pasta. It came out pretty good and a little lighter than it would with cream. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was very yummy and easy. I think I'll put less \"crab\" in next time though. My husband thought it was good, but not really good. My 18month old, however, thought it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evelyn in KC"
},
"reviewBody": "I used more crab than the recipe called for, which was a little overwhelming--but that was my fault. Otherwise, YUM! It was also easier than I thought it would be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was so easy and delicious, it tastes like a dish from the Olive Garden....I will definately make it again! Thanks for submitting it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/23970/scrumptious-seafood-linguine/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/93/seafood/",
"name": "Seafood"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
"name": "Fish"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/23970/scrumptious-seafood-linguine/",
"name": "Scrumptious Seafood Linguine"
}
}
]
}
}
, "about": [
]
}
]