				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Scrumptious Strawberry Shortcake"
,"datePublished": "2000-10-20T22:05:24.000-04:00"
,"dateModified": "2022-12-01T10:30:38.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Sara"
,"url": "https://www.allrecipes.com/cook/1744"
}
]
,"description": "This strawberry shortcake recipe is made from scratch with butter and cream and topped with sugared berries."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/7LP-2vinkwGbaTby3K7uMowZBrw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/642015-35b313375f144d308040c606047b6dfb.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Scrumptious Strawberry Shortcake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "429"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "344 kcal"
,"carbohydrateContent": "35 g"
,"cholesterolContent": "74 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "241 mg"
,"sugarContent": "10 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"3 cups all-purpose flour",
"0.25 cup white sugar",
"4 teaspoons baking powder",
"0.75 teaspoon cream of tartar",
"1 cup cold butter, cubed",
"0.66666668653488 cup heavy cream",
"1 large egg, beaten",
"3 cups sliced fresh strawberries",
"3 tablespoons white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Mix together flour, 1/4 cup sugar, baking powder, and cream of tartar in a large bowl. Cut in butter with a pastry blender or 2 knives. Stir in cream and egg until incorporated. Turn out onto a lightly floured surface."
} ,{
"@type": "HowToStep"
,"text": "Knead dough for 2 minutes. Press into a 1/2-inch-thick sheet. Cut into squares and place on baking sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until golden, about 20 minutes. Allow shortcakes to cool."
} ,{
"@type": "HowToStep"
,"text": "Place strawberries in a medium bowl. Sprinkle with sugar; stir to combine. Split cooled shortcakes in half and spread with sugared berries."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kase"
},
"reviewBody": "Delicious!! I made this for a friend who said it was his favorite dessert (so lots of pressure to find a good recipe!), he loved it as did everyone else. Per the other reviews, I left out the cream of tartar and used only 3 tsp of baking powder. I will be making this again, thank you for sharing! Something I noticed with other recipes was preparing the strawberries- I cut up some strawberries, mixed them with sugar, and let it sit overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aurora"
},
"reviewBody": "this does not rise enough to split, so I sacked 2, Sprinkled 3T sugar over while hot out of the oven. Took longer to bake enough to lightly brown and become firm like an English biscuit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Chesonis"
},
"reviewBody": "Wow these are so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey B"
},
"reviewBody": "I took advice and left out cream of tartar, and lowered baking powder. It was perfect! By the way, I reduced servings to 2, and made one batch with flour and the other with almond flour. For you who try to go low carb, the almond flour batch was very \"wet\", so I added 1-2 Tablespoons of flour to try and make it a little more like the normal batch. However, when cooked, it tasted as good as the flour version, except the flour version had that light biscuity texture, and the almond flour version was more dense. But if you need to reduce carbs, you won't miss it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "amyduv"
},
"reviewBody": "Leave the cream of tartar out. Great recipe except the butter aftertaste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ishi"
},
"reviewBody": "it was amazing!!!!!!!!!!!!!!! it tasted really good and it was much better than the other websites I visited to make this truly scrumptious cake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie Larson"
},
"reviewBody": "Awesome! Did not use any cream of tarter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TerriR"
},
"reviewBody": "These did not taste good in any way shape or form. Well, I lied. If you smother them in butter and honey, they are all right. They browned very fast in oven. Had to turn oven off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "legendinmyownhome"
},
"reviewBody": "Best ever. The second time I made it I didn't have any cream in the house so I substituted milk and sour cream 50/50. Outstanding! I will make it that way from now on. The whole family raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Baking RN"
},
"reviewBody": "Just another biscuit type recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geojaguar"
},
"reviewBody": "I told my fiance this would \"ruin\" his concept of strawberry shortcake forever (he was used to the store bought sponge cakes). Needless to say, things is his favourite and he requests it for his birthdays.\n\nIf you like homemade whipped cream as well, then I highly suggest putting the bowl you use in the freezer for at least 30 minutes prior to whipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Autumn Heather"
},
"reviewBody": "Made it and served it with sugared strawberries and blueberries for a red, white, and blue dessert for 4th of July! Happy 4th!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "These were ok, but I’ve had better. I followed as directed, but omitted the cream of tartar . I honestly prefer Bisquick type short cakes. These were really high in fat, I think there could be a healthier alternative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Lynn"
},
"reviewBody": "Absolutely the best I’ve ever had. Omitted the cream of tartar and did one less teaspoon of baking powder as others said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy's Personal Chef"
},
"reviewBody": "This is the best shortcake I have ever had! I've made it at least 4 times now. Despite carefully measuring all the ingredients I've always needed to double the cream to get enough moisture to bind the crumbs together. I wonder if regular cream would distribute better since it isn't as thick?\n\nI do NOT eliminate the cream of tartar, reduce the baking powder, or increase the sugar. \n\nSince most shortcake recipes say to toss the wet ingredients with the dry just until combined, I've been leery of kneading it for 2 whole minutes per the instructions. This last time I kneaded it for a minute and it turned out flakier and rose higher!\n\nI baked this into cake pans and made it into a wedding cake. Everyone raved about it! Thank you for a delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Drapeau Lussier"
},
"reviewBody": "Fabulous cake!!! Followed previous reviewers and only added a pinch of cream of tarter, made individual balls then flattened with sugar. Thank you for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Duncan Shoemaker"
},
"reviewBody": "I'm a Bisquick shortcake recipe girl; it's what I grew up on, and I've never found anything to replace it that I love better. That said, this came mighty close. Soft, fluffy, and buttery biscuits drowned in sugared and juiced strawberries. So delicious. I did omit the cream of tarter per other reviewer suggestions, and used 3 tsp. baking powder instead of 4. I doubled the recipe; my family ate until we were stuffed, and then I still had enough left-over for breakfast the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goodeatin65"
},
"reviewBody": "I made this recipe as written. Everyone enjoyed them! In fact, the shortcakes were gone before the strawberries, as they were eaten without anything on them. It has a nice crumb and isn't too sweet and was easy to make. Perhaps the reviewer who stated the recipe had a funny taste, possibly due to the cream of tartar, used bad cream?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RainbowJewels"
},
"reviewBody": "UPDATE: I've been making this recipe for several years now and I still like it the best! Definitely use parchment lined baking sheets. Sprinkle the tops with a little turbinado sugar for a yummy, sweet finish.\n\nOriginal Review 06/12/2012\nI have tried a lot of strawberry shortcake recipes over the years and this one tops the list. It gets 5 stars in both taste and simplicity. \nI reduced the amount of cream of tartar to 1/4 tsp, I used a 3 inch square cookie cutter to get uniform pieces, and sprinkled them with raw sugar before baking.\nThis is a great recipe that I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lela"
},
"reviewBody": "This strawberry shortcake was very good. The shortcake was not soggy when you add the strawberries and cream. The recipe does make 12 shortcakes which I will cut the recipe in half next time for four people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "shiquants"
},
"reviewBody": "Honestly they did not taste great. I have had better shortcakes with other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bluebird"
},
"reviewBody": "Followed everything and took everyone's suggestion to reduce Cream of tartar. I thought it had a nice flavor but it seemed dry and crumbly. Need to research how to make it less so. Regardless, making it for dessert for a 4th of July party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy's Mom"
},
"reviewBody": "Wonderful! I really liked that it wasn't too sweet. With the sugary strawberries added there was plenty of sweetness! Used less cream of tartar per other comments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hmskip"
},
"reviewBody": "A light crusty shortcake. I didn't change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DD"
},
"reviewBody": "This was wonderful. Took me back to my childhood. I did make a couple of changes; I used White Lily baking flour because I was out of all purpose flour. I added vanilla extract ( about 1 1/2 teaspoon) and I left out the cream of tartar. My husband was so impressed and he never eats strawberries but this shortcake made it worthwhile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa787"
},
"reviewBody": "Thank you Sal for this absolutely delicious biscuit recipe! I followed LazyFoodieGirl's advice:\nOmitted the cream of tarter and reduced the baking powder to 3 teaspoons. Pulsed the dry ingredients in the food processor. Added cubes of cold butter to the processor and pulsed about 15 times.\nEmptied the mixture into a large bowl. Mixed 1/2 and 1/2 with the egg and a tsp of vanilla in a small Pyrex 2-cup measuring cup. Poured the wet on top of the dry. Mixed.\nFloured my hands and kneaded in the bowl for about one minute (maybe a bit less).\nFormed the dough into small balls (13), flattening them out with my hand slightly. Brushed with 1/2 and 1/2, sprinkled with sugar. Baked on a Silpat lined 1/2 sheet for about 15-18 minutes. \nTheses are supposed to be for dessert tonight. I don't think they will make it. So delicious and so easy. Why did I wait to make these?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pperkins"
},
"reviewBody": "This is a very forgiving recipe, I make it with Pamela's gluten free bread flour. The flour is very silky and soft so I always need more than a recipe states, and this flour is expensive! I'm able to make delicious and easy little biscuits in no time! And I don't need to add an excessive amount of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DinaLaChef"
},
"reviewBody": "Sensational! I made this for my fiancée's birthday and it was a major crowd pleaser! One guest even had thirds! I made the shortcake recipe for 24 servings so I could make two 9x13 cakes to make one stacked shortcake. For each layer cake, I made a few changes--substituted some whole wheat flour for white flour, omitted the tartar, used 2% milk instead of heavy cream, and added one teaspoon of vanilla and a half teaspoon of salt. I rubbed some room temperature butter on the top of the first layer cake a few minutes after it came out of the oven, then layered with the fresh whipped cream and strawberries, then placed the second cake on top, and did more layering of the cream and berries. I used about 6 cups of strawberries (3 pints) that I marinated with fresh lemon juice and sugar the day before. I made the whipped cream while the cakes were baking so it was very fresh. This cake was a hit with everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jessann8822"
},
"reviewBody": "I have never tried Strawberry Shortcake before and this was pretty delicious. I added a Strawberry Bourbon Syrup to it and it really took it over the top. I made the recommended revisions (No cream of tartar, 3 tea spoon baking powder instead of 4, egg white wash with sugar before baking). It is a nice combination between a biscuit and cookie texture - a bit dry for my taste but it actually grows on you the more you eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thedaniella"
},
"reviewBody": "My family all agreed it is the best shortcake they had ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiina Dygert Hazelett"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reachkimo"
},
"reviewBody": "These are delish. They do crumble so I just broke them into pieces and put them in a bowl with the strawberries on top. I also kneaded the dough in the bowl instead of making a mess with flour on the counter. Then I just tore pieces away and put them on the cookie sheet that way to make them kind of puffy and they did. Right before baking them, I sprinkled sugar on top. Wow...this is certainly a keeper...woohoo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LazyFoodieGirl"
},
"reviewBody": "Super easy AND delicious! I skipped the cream of tarter like someone recommended and dropped the baking powder to 3 teaspoons, then pulsed the dry ingredients + butter in my food processor until crumbly and dumped into a large mixing bowl to receive the wet ingredients. Whisked the egg before adding it into the mixture with the cream, then kneaded directly inside the bowl until it came together. Instead of rolling it out, I quickly divided it into 12 individual balls, flattened on a parchment-lined baking sheet, then sprinkled a touch of sugar on top for extra crunch. The result was a crumbly, crispy, crunchy, soft, buttery shortcake that paired beautifully with fresh strawberries, as well as the \"Lime and Tequila Infused Strawberries\" recipe from this site too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dksetchell"
},
"reviewBody": "Made just like the recipe with the exception of substituting 1/2 &amp; 1/2 for the heavy cream just because that is what I had on hand. Very good. The short cakes were light and fluffy. We'll hang onto this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michellecroes"
},
"reviewBody": "The only change I made was using 1/4 tsp. cream of tartar. These little biscuits came out so buttery and flaky! Pretty close to perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chris Lopez"
},
"reviewBody": "Used for strawberry short cake it was yummy and nice and flaky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "Decent recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ab"
},
"reviewBody": "These are totally awesome! They are easy to make and the flavor takes regular strawberry shortcake to a higher level!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moppel"
},
"reviewBody": "Thank you thank you thank you! I've been searching for the perfect Strawberry Shortcake recipe for years, and I've finally found it! My kids agree, the search is over. Complete perfection. I used a round biscuit cutter so they would all be the same size. Due to the altitude here I had to make a couple adjustments to the amounts. I reduced the baking powder to 3 3/4 tsp, added 3 tbs of cream, and then increased the oven temperature to 375. I did not change anything else. The biscuits are buttery with just the right amount of sweetness. We all agreed that they're almost like cookies in flavor. They are also extremely filling. One of those is a meal. Make sure you use home made whipped cream for this, the spray can stuff won't hold up.\nThank you so much for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "Tasted delicious but was very crumbly and fragile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peggy Kugel"
},
"reviewBody": "Good but not that much better than the recipe on the Bisquick box. Didn't know what size pan to use and the cakes came out too large and too flat. I do like the idea of making them square rather than rolling them out and making them round."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KM"
},
"reviewBody": "Made this today - and it was a hit. I DID read all reviews and use only a pinch of cream of tartar, and 3 tsp baking powder as per suggested by other cooks. And the result was a houseful of \"oooh\" and \"wow\"s. I didn't roll the dough out either, I just formed biscuit shapes and baked individually."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaana Smith Bauman"
},
"reviewBody": "My husband made these (who doesn't bake) and they turned out WONDERFULLY! We will completely make them again. Made exactly as written. We are big fans!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ahume"
},
"reviewBody": "perfect biscuit shortcake for strawberries. used 2% milk since had no heavy cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jullum"
},
"reviewBody": "Was great-- no changes- delicious! Texture a little firmer than we are used to but still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jewellb"
},
"reviewBody": "Devine shortcake recipe, that is all I can say. I also make it for breakfast to eat with jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megmor98"
},
"reviewBody": "Awesome!!! I read one reviewer noted they were dry. These are a kind of dry shortcake- perfect for soaking up the strawberry juice, YUMMMM!!!! I thought the taste was spot on. I froze the butter then shredded it into the dry mix and it worked great. Also I did not use cream of tarter; and used a little less baking powder as indicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sstephens21"
},
"reviewBody": "It taste like a plain biscuit.. Extremely dissapointed"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flashsmith"
},
"reviewBody": "Light as a feather, flaky and the not so pretty ones you make from the scratch at the end we eat while warm! I sprinkle the top of the dough with raw sugar and gently press in before cutting. So pretty with a sugary crunch. I never kneed 2 minutes. I kneed it over gently maybe 7 times until the dough is soft but the butter is still small pea sized pieces. I also used cream and milk. I won't use another recipe! (For the people who had dry shortcakes- not enough liquid or baked too long. Mine have always come out perfect. I add more liquid if needed until it feels right)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AngelOfTheOdd"
},
"reviewBody": "Pretty good taste wise, but the texture of the biscuit wasn't quite what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keickholt"
},
"reviewBody": "Changed a lot to make it healthier! Substituted 2cups of wheat flour for 2 cups of the white. So one cup white 2 cups wheat. Blended 2 apples and a quarter cup of Splenda and added it to the dry ingredients (no butter or egg) used Splenda in place of white sugar in all areas. Added about a quarter cup of while milk instead of cream. Turned out really good! And much healthier for all of my friends losing weight!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "edavies"
},
"reviewBody": "It was really delicious and much easier than I imagined strawberry shortcake to be. I didn't use cream of tartar b/c I couldn't find any. Had to add a little flour at the end to make the batter less sticky. Followed the advice of other reviewers and used 3 tsp. of baking powder instead of 4. Kneaded dough right in the bowl and divided it into 12 balls (half flattened). Baked it about 20 min. Topped with homemade whipped cream and a little powdered sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tlkeating"
},
"reviewBody": "I thought this would be a sweeter, buttery shortcake it is rather cake like in texture. There is an awful after taste. I will not make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JRGRAINGER"
},
"reviewBody": "I loved these, but my husband not so much. He's more used to the angel food cake you buy in the stores (mother didn't do much baking). Anyways, I loved these, had extra and just used them to snack on at work. Followed the advice of others by reducing the amount of cream of tartar and sprinkled the tops with sugar before baking. I also used more sugar on my berries, and I served with homemade whipped cream. I thought it was delicious, as did my little 1yo daughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Dull on flavor, short on sweetness and lacking in texture. Yes, the strawberries and cream are the \"main event\" of this dessert, but the shortcake is the foundation and if it has no flavor on it's own and won't soak up the juices of the strawberries, it's not doing it's job. My cakes were very dry and broke easily when cutting. How is that possible with 1 cup of butter and some cream in the mix? In my opinion, you're just not getting the bang for the buck here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ"
},
"reviewBody": "I chose to follow and use all ingredients in original recipe as I could not understand how another reviewer thought that the end product had a strange taste and blamed it on the Cream of Tartar??? I was well pleased with the results!! No funny taste, not flat, just a simple, light and subtly sweet shortcake. I hate the sponge type things they sell in the stores as I think they are far to sweet and detract from the berries. This is a perfect compliment to your berries and with just the hint of sweetness allows for the use of whipped cream without overwhelming sugariness (I just made that up, but for lack of a better word I think it works)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy I"
},
"reviewBody": "flakey and delish. so happy i found this recipie!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chicchick"
},
"reviewBody": "Made this for Easter dessert - super yummy! Definitely a \"short bread\" - buttery, flaky, but holds together really well so you can stab it with a fork. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonathan"
},
"reviewBody": "Awesome!!! Loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynthia Ross"
},
"reviewBody": "This is a lovely way to celebrate seasonal strawberries. Made this today in Abu Dhabi, where they don't sell Cream of Tartar. They turned out ok, but I prefer a better rise and a more fluffy shortcake. Don't leave out the Cream of Tartar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Rosenthal"
},
"reviewBody": "Very good and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JADABUGGY"
},
"reviewBody": "this looks great! im trying it!......never made it yet. looks 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Torie Fraser Hadjis"
},
"reviewBody": "I completely disagree with lower baking powder and no cream of tartar suggestions. I followed other reviews and made two batches with 3 tsp bp and no cream of tartar....then made a third batch as the recipe is written....third batch was by far the best! Big, lofty....awesome. 4 stars because I found it a little drier than I would have preferred."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alexbrenda"
},
"reviewBody": "This was a wonderful recipe. No modifications needed. I shaped this into a log, cut off twelve pieces, rolled them in balls, pressed them in sugar and popped them into the oven. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunshinedaydream"
},
"reviewBody": "Delicious!!! I made just a few accidental variations--- First off, I ran out of whipping cream as little shy of 2/3 but luckily I had whole milk so it worked out just fine. The dough was just a little dry while kneading so I added probably a tablespoon extra of whole milk. Secondly, my silly boyfriend killed the timer after probably ten minutes of baking, so I had to check every five minutes. I must have baked longer than 20 minutes, more like 25 or 30 actually.... The biscuits do not get very 'golden brown', so just take them out when you can insert a knife and pull out clean. Also, I did not spread into a sheet, I made six traditional biscuits.\n\nCame out perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cupcakesaddict26"
},
"reviewBody": "I love strawberry shortcake and I thought this recipe was perfect! It's similar to the one me and a friend made so I was happy to find this recipe because the shortcake we made was delicious! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thesweetestchef"
},
"reviewBody": "Made these at home with homemade whipped cream and fresh strawberries and it was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TOASTANDTEA"
},
"reviewBody": "I used 2 cups of all-purpose flour, and substituted the 3rd cup with 1/2 cup whole wheat flour and 1/2 cup of cornmeal. I used whole milk instead of cream and I think the mix was a little wetter that way, so I spread it in a 13X9 pan instead of kneading and making separate biscuits. Oh my, it was so delicious. This is my forever shortcake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katierose"
},
"reviewBody": "Easy and delicious! A little on the dry side but I liked that... It soaks up more strawberry juice that way. I think next time I will sprinkle cinnamon and sugar on the shortcakes before I bake them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Juergens"
},
"reviewBody": "Very dense cake pieces. Pretty simple to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Curly"
},
"reviewBody": "This was a great shortbread recipe. Very simple and tasty. If you are looking for the sugary, cake-like store version, this will NOT do for you. But if you're looking for a dense shortcake, this is perfect. I did modify it to make it even easier, though. Here's what I did: Omit the cream of tarter. Knock the baking powder down to 3 teaspoons, and cut the butter in HALF. That's waaaay too much butter. I mixed it all by hand in a bowl, added egg and cream, and continued to mix in the bowl. Then, formed rough biscuit patties by hand and put them on a baking sheet. They turned out GREAT, rising and tasting delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mecdesigns"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tiffecrosby"
},
"reviewBody": "I followed this exactly but i used milk because that is all i had, no cream of tartar, and reduced Baking Powder as most suggested. I am not sure what went wrong but the first batch looked pretty but had a really sharp after taste. So the next batch i added more sugar and vanilla extract- still a very bitter after taste. I would really love to know what caused this. I keep my baking soda in the pantry and it wasnt expired, but i did use great value butter. I know my grandma always said biscuits need good butter- maybe that was the problem? If anyone knows why please reply to this-i really would like to get this right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dpwing"
},
"reviewBody": "Best recipe ever! I just need to say that my cake took much more than 20 min in the oven. But the are sooo good! :) Thank you Sal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Duerstock Birmann"
},
"reviewBody": "Most delicious dessert I have had in quite some time. This is a MUST try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "obxnut"
},
"reviewBody": "This turned out pretty good with using some changes in most of the reviews I read. I did increase the sugar to 1/2 cup, omitted the cream of tartar, also had no heavy cream so I used 1/2 n 1/2. This is not the recipe for someone who wants cake with there strawberries and cream, but I did enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy F."
},
"reviewBody": "Delicious! I couldn't resist eating some without the berries &amp; whipped cream. Yummy shortbread! I also zested a little lemon rind in it. It was a big hit at our Easter gathering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy F."
},
"reviewBody": "Delicious! I couldn't resist eating some without the berries &amp; whipped cream. Yummy shortbread! I also zested a little lemon rind in it. It was a big hit at our Easter gathering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Betsy Maynard"
},
"reviewBody": "I followed the recipe and was disappointed. These are just a biscuit. They would taste better with strawberry jam."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "patricia"
},
"reviewBody": "I thought this was very dry and not sweet enough for me. Not my type of shortcake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spike Da Peke"
},
"reviewBody": "Take It to the Top!\n\nIt's been a very long time since I've had shortcake this good. Unfortunately, when my grandmother passed away, we couldn't find the recipe for shortcake. This comes as close as anything I have tried to her very fine shortcake. The flavor is good, though I may add just a touch more sugar the next time I bake it. The crumb is wonderful with a melt-in-your-mouth feel. We dressed it with a sour cherry compote comprised of canned sour cherries, honey, ice wine riesling, and a touch of cinnamon, mace, and allspice. The taste was as if a small part of heaven had come down among us. \n\n One warning: many recipes overstate their serving power–this really does makes twelve servings. As we are a family of three, we've put a few in the freezer. I hope they will save well. If not, next time I make the recipe (and there will be a next time), I will try to reduce the number of servings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bella888"
},
"reviewBody": "Amazing! I followed the advice of others and left out the cream of tartar. Also, I was out of regular butter so I used light stick butter instead. These turned out wonderful! A definite keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jennifer Michener"
},
"reviewBody": "Good, I would use less cream of tartar, baking soda and add more sugar. Used my mixer to cut in the butter, saved me so much effort :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seasonedcook"
},
"reviewBody": "Great! These are excellent. I don't like the really bready and dry shortcakes. Like someone said, these are flaky, kind of like a pie crust. I make my own strawberry concoction to go on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SonFlower"
},
"reviewBody": "I didn't make any changes and it was PERFECT. I spread mine out in a 9\" X 13\" and it took a bit longer to cook than the directions said though. Around 35 min, actually"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenCook"
},
"reviewBody": "These are sooooo good. We make them every strawberry season and we all love them! I do half whole wheat flour and half all-purpose flour. Also I take out the cream of tartar and replace it with baking powder. Still sooo delicious! I recommend this recipe to all strawberry lovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Excellent shortcake. A good cross between a biscuit and a cookie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeryckma"
},
"reviewBody": "I added balsamic vinegar, basil, and a little black pepper to this and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MiLAb"
},
"reviewBody": "Fantastic recipe - everyone in the family loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "izzymae30"
},
"reviewBody": "I WANTED TO THANK YOU FOR SUBMITTING THIS RECIPE. IT IS WONDERFUL. I FOLLOWED THE RECIPE AND THE BAKING TIME. I GOT 12 LITTLE PERFECT CAKES. THEY REMINDED ME OF THE HOMEMADE SHORTBREAD I USE TO MAKE EVERY CHRISTMAS. I WILL ABSOLUTELY MAKE THIS AGAIN AND AGAIN. THANK YOU AGAIN. I LOVE FLAVORS THAT REMIND ME OF HOME."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JULIEUNC1"
},
"reviewBody": "A pain to make (hence the 4 stars), but they were so much better than the store-bought variety! Made exactly as is with no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "bountifullady"
},
"reviewBody": "We REALLY did not care for this shortcake. It turned out fluffy and just slightly odd tasting. The consistency was off. I guess I was looking for more substance and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULIALOOPER"
},
"reviewBody": "I love this because the cake is not too sweet and it really soaks up the berries juices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaMount"
},
"reviewBody": "My only critizism is the cornstarch is unnecessary and it does not need to be kneaded and rolled. It works fine as a drop dough. I ommitted the corn starch and rolled balls in my hands. My dough was sticky, not great rolling material anyways. I am not sure if that's because I didn't use corn starch. I also used less baking powder (I ran out) and more sugar (my own preference) But over all this is THE best tasting dough ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We were disappointed with this recipe. When I invest so much fat into a dough, I expect it to be fantastic. Unfortunately the end result was flat, bland, and crumbly. The cakes did soak up the strawberry juices, but even then they didn't shine. It's too bad because the dough was easy to work with and retained it's shape well while baking (I used cookie cutters to make fun shapes)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiko"
},
"reviewBody": "This IS strawberry shortcake and shouldn't be compared to putting strawberries on biscuits or pound cake. Shortcake means it has a lot of shortening; the crumb is between biscuits and pie crust.\nBe sure to split the shortcake, not stack two together. Also let the berries rest a few hours after sugaring to develop juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kim Clements"
},
"reviewBody": "I was a little disappointed by the shortcake in this recipe. It was simple, but not quite as good as I had hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "li_sa17"
},
"reviewBody": "I made mine bigger than the recipe called for and did not add the cream of tartar as recommended by other members. The result was delicious and huge buttery and flaky shortcakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "My stomach still hurts from eating so much of this. I have never made strawberry shortcake because I distinctly remember not enjoying the taste of the taste of the shortcake growing up. This recipe has changed my mind! Making your own whipped cream and using fresh strawberries just makes it even more scrumptious! I can't wait to have it again tomorrow!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22988/scrumptious-strawberry-shortcake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22988/scrumptious-strawberry-shortcake/",
"name": "Scrumptious Strawberry Shortcake"
}
}
]
}
}
, "about": [
]
}
]