				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Seafood Enchiladas"
,"datePublished": "2000-03-03T11:40:16.000-05:00"
,"dateModified": "2023-02-17T13:44:42.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cathy"
,"url": "https://www.allrecipes.com/cook/24321980"
}
]
,"description": "These seafood enchiladas stuffed with a tasty mixture of crab, shrimp, and cheese taste like the ones served at a popular Mexican restaurant in my area."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/UfKW3RnBW9TleY23BYhFPS7Sm28=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6808002-7d7126c27eeb4639bdfe7d37b1696623.jpg",
"height": 1875,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Seafood Enchiladas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "559"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "607 kcal"
,"carbohydrateContent": "43 g"
,"cholesterolContent": "136 mg"
,"fiberContent": "3 g"
,"proteinContent": "27 g"
,"saturatedFatContent": "21 g"
,"sodiumContent": "1078 mg"
,"sugarContent": "3 g"
,"fatContent": "37 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 tablespoon butter",
"1 medium onion, chopped",
"0.5 pound fresh crabmeat",
"0.25 pound shrimp - peeled, deveined and coarsely chopped",
"8 ounces Colby cheese, shredded",
"6 (10 inch) flour tortillas",
"1 cup half-and-half cream",
"0.5 cup sour cream",
"0.25 cup butter, melted",
"1.5 teaspoons dried parsley",
"0.5 teaspoon garlic salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make the enchiladas: Melt butter in a large skillet over medium heat. Add onion and sauté until translucent, about 5 minutes. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Stir crabmeat, shrimp, and 1/2 of the Colby cheese into the skillet. Arrange a large spoonful filling across the center of each tortilla, then roll tortillas around filling. Place enchiladas, seam-side down, into a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Make the sauce: Heat half-and-half, sour cream, melted butter, parsley, and garlic salt in a saucepan over medium-low heat, stirring often, until lukewarm and well blended. Pour over enchiladas, then sprinkle remaining cheese over top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until crab and shrimp are cooked and cheese is melted, about 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Kachanuk"
},
"reviewBody": "OMG!!!! I to don’t usually write reviews but this one needs a high 5. I followed the directions and ingredients as the recipe BUT I added and and made a mistake. When fixing the sauce I added a package of taco mix and stirred it in. My mistake was I was in a hurry to finish up on the recipe and did not read it all the way thru. I added the cheese to the sauce while I was hot. GOOD mistake. The sauce was creamy and cheesy. I also added some sauce to the onion, shrimp and crab mix which gave it some moisture as a previous review said she had done. I baked it till it was bubbly and served it. When finished eating there was 1/2 of one left (4people). GREAT recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bryhoff22"
},
"reviewBody": "This is very easy to make and fantastically delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimmik"
},
"reviewBody": "Super good used cilantro in place of parsley"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SouthwestMamma"
},
"reviewBody": "These were great! I took the advice of others, doubled the sauce, only had garlic powered so, used that and added Johnny’s seasoned salt to the sauce and mixture. Added some of the sauce to the mixture before filling the tortillas and added a can of green chilies to the mixture. Topped with cheese, olives and cilantro! I used imitation crab and I think next time I will use canned crab or the real thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian McMillan"
},
"reviewBody": "I made this followed the recipe exactly. Outstanding we love it. Definitely on my go to list"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thelittlemansmom"
},
"reviewBody": "I did make some alterations. I added green onion, celery, garlic and mushrooms in with the onion. I also added some sour cream and some of the sauce in with the mixture along with old bay seasoning. I doubled the sauce recipe but waited until I took the mixture off the stove to put the sour cream in. I used Gouda instead of Colby as it’s what I had in the fridge, my husband and I both loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ah5300"
},
"reviewBody": "I made this today. I simmered the milk added sour cream and parsley and garlic powder. I put the butter in the microwave to melt and I forgot to add it. When the recipe was cooked it was curdled. But it still tasted good. My husband had 2 helpings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shanda Welte"
},
"reviewBody": "Taste great\nNot restaurant quality but dang good for home in a pandemic\nOnly problem is the cream sauce curled in the oven and was watery :(\nI always add more shrimp and crab than recommended"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ray navarro"
},
"reviewBody": "added chopped green hatch chile to sauce and used cilantro for garnish\nmade enough cheese sauce to pour over finished enchiladas instead of sprinkled cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "This recipe was very good. However, I substituted bay scallops for the crab meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristene"
},
"reviewBody": "Do not double sauce or add flour (thickens in oven). added 1 can diced mild green chiles or 2 jalapeños seeded &amp; ribbed, 1 tsp of chili powder, 1 tsp of cumin and 1/4 tsp cayenne pepper &amp; substituted regular salt for the garlic salt. I heated this all to a simmer then poured it slowly into the sour cream whisking constantly to avoid the curdling. added 2 cloves of minced garlic to the onion before sautéing. Also added 1/4 of the sauce to the crab/shrimp onion mixture before rolling up the enchiladas to keep the insides creamy &amp; moist. 9 X 13 pan=8 enchiladas. Garnish with green onions or cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shirley Nelson"
},
"reviewBody": "Yummy! Easier to prepare than I thought so will be on the A list of weeknight dinners!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Downing"
},
"reviewBody": "This came out so good! I will make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitney"
},
"reviewBody": "I added scallops and a bit extra cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Whinenot"
},
"reviewBody": "Tried this tonight with the modifications from previous reviewers. Took too much of my time for nothing but bland. Do not recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy"
},
"reviewBody": "loved the dish. Used suggestions from Caren with additions and came out perfect. As my husband does not each cheese I did leave it out and still came out excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "T.C. Hydock"
},
"reviewBody": "Here are the mods/details for what I did:\n\n* Used ~12oz imitation crab meat /\n* ~12 oz Colby Jack cheese /\n* 9 soft taco-size flour tortillas (~8-9 inch) /\n* Subbed 3 Tablespoons of fresh chopped cilantro for the dried parsley /\n\nI doubled all the sauce ingredients and spooned some of it into the mixture before wrapping the enchiladas as others have directed.\n\nThis was more than enough food for me and my 2 sons (they can eat quite a bit). I'd probably scaled back slightly to only make 6 or 7 enchiladas. I also think there was too much sauce. Unless you like A LOT of sauce, sticking to the amounts in the recipe would likely be enough.\n\nThis tasted a little TOO buttery to me, so I'd maybe scale back on the butter.\n\nEven though I tried to prevent the sour cream from curdling (didn't bring things to a boil and stirred it in later), it still curdled some. Perhaps I'll try whisking it in next time instead of stirring.\n\nOverall, this was decent, not great. I'd probably make it again, and perhaps try real crab meat next time as that might improve the taste a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shane Harris"
},
"reviewBody": "I make a mean elk enchilada but these seafood enchiladas are the bomb. Make it and your friends and family will love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewJerseyTexan"
},
"reviewBody": "This was fantastic. I did follow some of the reviewers and added some spices that they did. It was perfect and I will absolutely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "neener"
},
"reviewBody": "Used fake crabmeat and it still tasted phenomenal. Have made it again and again; it's a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lori McKirahan Burton"
},
"reviewBody": "I had the same problem as others, curdling and overwhelming onion...and I LIKE onion, but I wanted to taste the seafood. Onions come in many sizes. I'd say my chopped onion was more than a cup. I may make this again following advice of others: stir in sour cream after removing mixture from heat to prevent curdling; less onion; add some spices, cumin or maybe Old Bay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Shannon"
},
"reviewBody": "This recipe just gets better and better every time I make it. I make it with whole wheat flour and it is super yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mtm"
},
"reviewBody": "I used a very large onion so I did increase the recommended amount for butter to .\nSo easy to prepare and so very delicious. I did garnish with chopped Roma tomatoes and Fresh Cilantro .\nWill definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Gale Rasmussen"
},
"reviewBody": "AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "I cooked my shrimp in Old Bay and used fresh parsley. Otherwise I cooked as written and it was really good! I didn't want to use too much seasoning and over power the seafood."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guy Dedmon"
},
"reviewBody": "Add anchovies and chipotle chilies. Used corn tortillas. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Red Hat Val"
},
"reviewBody": "Excellent recipe. I will definitely make this for company. This is also easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lenore"
},
"reviewBody": "I could not find fresh crabmeat (just whole crabs), so I used canned crab meat. That may have been the problem. For some reason the cream sauce did not bake creamy, it seemed to curdle. I will eat them, but can't rave about them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "okfam4"
},
"reviewBody": "This was a hit! I did feel it was a bit rich so I scaled back on the butter a bit. I only had shrimp on hand so I used 1 12oz package of shrimp which equates to the same total amount of seafood the recipe called for. Next time I will use the crabmeat and I feel 1-1.5 lbs of seafood would balance well in this recipe with the richness in flavor. All in all very tasty and Easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Drake Wilson"
},
"reviewBody": "I did add shallots and asparagus, both minced, and diced red bell pepper in place of the onion, and I used shark in place of the crab. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Manns79"
},
"reviewBody": "Fabulous! We made exactly to the recipe and it was the best seafood we've made - period! We doubled the recipe and used a 1 lb. can of lump crab and some shrimp scampi. We've made many other recipes such as seafood lasagna and scallops lemon cello and this is by far, our favorite! Reheats well in a 300 F oven for 40 minutes. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stacey B"
},
"reviewBody": "I made an account because I had to rate it. It was awful. I followed this recipe, and even took advice to double up on the sauce. The sauce curdled during the cooking process (in the oven), and it was severely lacking in flavor. I order seafood enchiladas often at many restaurants and never have I eaten anything compared to this. I will stick to buying this particular dish at a restaurant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MelissaP"
},
"reviewBody": "My family loved this! I did add more shrimp to this and in the shrimp and crab mixture, I added a bit of sour cream and it added more flavor. I also cut up some hatch chilies in the cream sauce and added more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcmiller03"
},
"reviewBody": "Yes, These are wonderful, just like the restaurant. These are always a special treat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Sauce thickened up nicely. Delicious?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rob Mattia-Slater"
},
"reviewBody": "I've made this dish several times. Never felt the need to change it other than adding bay scallops.\nWife and I really like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "floralnut"
},
"reviewBody": "This dish was amazing! I only made a few tweaks to suit my family's tastes and my kids (who don't like seafood much) asked me when I can make it again--before they even finished eating! I followed other reviews that suggested doubling the sauce and I'm glad I did. Some said the sauce wasn't thick enough so when I doubled it, I used 1 cup half-and-half and 1 cup heavy cream. One recommendation I would make is not doubling the butter because after cooking, much of the butter was floating at the top of the dish. I also added about 3-4 Tbsp of chopped green chilies to the sauce and nothing spicy to the filling since we're not a spice-loving bunch. It was just enough. I used shredded Colby-Jack cheese because I like my cheese a bit more creamy and that made it perfect! I will be making this recipe over and over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JannieRee"
},
"reviewBody": "Admittedly, I used a combination of shrimp and scallops, which we loved, but the flour tortillas got pretty mushy and unappetizing when baked in the sauce. I think next time, we'll forgo the \"enchilada\" part and just serve the sauce and shrimp/scallops over linguine or angel hair pasta. Definitely will make this again, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GAPEACH12"
},
"reviewBody": "I didn't like this. I think the canned crabmeat was the turn off. The smell and flavor was not appealing to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Grimes"
},
"reviewBody": "This is amazing. I made the reviewers requestes changes regarding increasing sauce and I also used heavy cream, omitted sour cream in the sauce and used whole milk. I also added 1 tsp of the following: garlic powder, taco seasoning, cayenne pepper, onion powder, seasoned salt and black pepper to the sauce. This is definatly a make again recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terra Hooks"
},
"reviewBody": "I only used shrimp but it came out awesome my family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Saundra Zilla"
},
"reviewBody": "My husband's favorite foods are seafood &amp; Mexican. He says these are the best enchiladas he's ever had. I followed Caren's recommendations. Thank you!! I made 1-1/2 times the sauce instead of doubling as cream was low. I skimped on the butter and used a mix of half-and-half and 2% milk, 5 tb butter &amp; 5 tb flour for the roux. Not at all runny, no curdling of sour cream and very tasty with added spices and chopped cilantro. I had no diced green chili or crab. I used 1 lb of shrimp. I added a bit of extra salt to taste and topped with sliced olives. While it set after baking, I spooned on some leftover pico de gallo. They were beautiful, incredibly filling, and flavor was wonderful. If you have experience with cream sauces, this recipe is easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kitchen Hack"
},
"reviewBody": "Pretty good, I thought. Nobody else did, though. I doubled the recipe and used smaller tortillas. It made tons of sauce. I used heavy cream, as others have suggested. For my taste, I'd half the crab amount and double the shrimp amount. I used Monterrey Jack cheese rather than Colby because I thought it would go better with the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "claudiadchiutiis"
},
"reviewBody": "This is the most delicious and easy seafood enchilada recipe. So worth a try!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the most delicious and easy seafood enchilada recipe. So worth a try!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeannie"
},
"reviewBody": "Good base recipe but very rich as is. My changes are as follows: used shrimp only sprinkled with Old Bay seasoning and also sauteed minced garlic with the onion. For the sauce, only used 1/2 cup of half-and-half, subbed cilantro for the parsley, added 28 oz of green enchilada sauce. For the topping, I used sliced black olives, avocado and chopped cilantro. Very flavor and tons of sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crocdad"
},
"reviewBody": "I'm not a fan of seafood but my family is, so I made these. I found myself lacking in shrimp, so I used extra crab. We found the sauce to be too buttery for our taste. Next time I will use more real garlic for a more interesting flavor and a bit less butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chas"
},
"reviewBody": "It definitely takes some time to prep but they turned out amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyss Elle"
},
"reviewBody": "Excellent. Even with fake crab this is fantastic. The only thing I would change is adding some more salt and spice! This was almost a little sweet, not as savory as I wanted. Still tasted great though. Also, I accidentally used about 1.5x the amount of shrimp called for, plus doubled the sauce and the result was that I needed a second, small pan to fit all the enchiladas in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Hollis Reyes"
},
"reviewBody": "My husband tells people this is why he married me. Because I make these enchiladas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "We loved it but will use only crab meat in the future, we felt the shrimp added nothing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "BeckaBoo79"
},
"reviewBody": "This recipe was not good... I read all the reviews and took some of the suggestions.. I thought it was ok, until about 10 minutes after dinner I became sick because of the sauce. Far to much dairy that curdles. I thought at 1st it was ok, until I caught the texture. Leftovers went from the fridge, and in to the trash. Bummer too... I was very excited about this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "3dawgs"
},
"reviewBody": "I didn't care for this at all, I felt like I had to jazz up everything for flavor and the torillas, so soggy. simply a mess that I took out the filling after baking and tried to fix"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Casey M"
},
"reviewBody": "I modified it based on other reviews and they were GOOD, One \"purist?\" suggested elsewhere on AR that 'flour' tortillas didn't make enchilada's...had to be corn. NOT in my opinion, or those of many others, I LIKE flour tortilla's...sorry. I used TJ's Argentinean Red shrimp and a can of Lump Crab. Quite good when it came out of the oven. Also my 99 yo Dad loved it...\"that might be the best thing you've cooked for me\". I provide his lunches for the most part."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "This is fantastic! I added the sour cream to the sauce after I took it off the heat. I doubled the sauce, adding a tsp. of corn starch while it was heating, and added a cup to the crab (Imitation) mixture before I added it to the tortillas to make it more creamy. I also skipped the shrimp and did add 2 poached cod fillets (chopped) to the imitation crab mixture (1 lb.) I then put the sauce over the top, along with shredded cheese over the top of the sauce. I added about a tsp. of cumin to the sauce mixture, and didn't add garlic salt, but a bit of garlic powder and fine grain sea salt. I served with lemon wedges and sliced jalapenos on the side. It reminds me of my favorite dish at the local Mexican restaurant....will be making this often! This made 8- 10 inch enchiladas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amersalb"
},
"reviewBody": "I used the recipe more as a suggestion to get me on the right path to seafood enchiladas but ended up making it my own with some modifications. I didn't have enough cream and wanted to increase amount of sauce as others recommended, so for the sauce I ended up using 1/2 cup cream, ~1/3 cup white wine, thickened with 3 T flour, 1 can diced tomatoes with green chilies (including liquid), ~1/2 cup vegetable broth, 1 tsp cumin, 1 tsp chili powder, and 1/4 tsp cayenne, and left out the sour cream because the sauce was already perfect. I also added a bit of the sauce to the filling and used pepper jack cheese instead of Colby. Garnished with fresh cilantro."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "*popp'n*fresh*"
},
"reviewBody": "This was freaking amazing. Im giving it 4 stars cuz the flour tortillas were soggy on the bottom so it was more like a wet burrito than enchiladas, next time I'll use corn tortillas. Only changes I made was using diced fresh tomatoes on top after adding cheese and I used the rest of the stick of butter and more cream and sour cream for the sauce, after reading reviews for more sauce and this is so freaking good. It's not spicy so if u want heat add some or hot sauce. Amazing flavor thank you !!! Update::::::: made this again using the corn tortillas and used only shrimp and added poblano pepper and bell peppers on top and used some with the onions. Fabulous Recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Me&Him16"
},
"reviewBody": "I loved it, I did use fresh scallops instead of crab meat, and used cream cheese instead of putting shredded in with shrimp and scallops, it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Isthat Onsale"
},
"reviewBody": "As written it was bland. I made it again. Sauteed onions in butter, removed from butter and added to crab mix. Doubled the shrimp (rough chopped) and added minced garlic, pimento and a serrano pepper with old bay seasoning and 5 oz cheese. Made roux and added cayenne, heavy cream and complete seasoning to other ingredients for sauce. Adjusted seasoning for sauce and mixture. Added 1/2 ladle of sauce to crab mix and bottom of dish. Rolled, topped with sauce and cheese. I used about 5 oz mix of monterey and pepperjack cheese on top. Baked as instructed, let rest for 5 and topped with Rachel Love pico de gallo and crushed tortilla chips. Made 4 large servings. Served with lemon pepper asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Bates"
},
"reviewBody": "These are really good, and almost the same as were once serves at Chi Chi's restaurants. Next time I will add some lobster meat and juices to the recipe to give it a bit more decadence. Nice recipe! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Stella"
},
"reviewBody": "The sauce was runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ripreimers"
},
"reviewBody": "I made this for Easter dinner for the family and everyone loved it! I used fresh shrimp, crab and crawfish tail meat since they are in season and have a lot of flavor. I also doubled the sauce as others have recommended. I put all the sauce ingredients in addition to 1 tsp of cumin, 1/4 cup mild green chilies, 1/8 cup pickled jalapenos, 1 cup fresh cilantro into a blinder and used heavy whipping cream instead of 1/2 &amp; 1/2. I also eliminated the butter since it is not necessary since I sauteed the seafood in the butter and poured the juice in the blender after i removed the seafood. To increase the presentation I put sliced black olives and green onion on top of the cheese before baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney"
},
"reviewBody": "This was the second time I've made this one, per the kids request, and the family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geewalt"
},
"reviewBody": "These were delicious! (Though very rich) I used some of the suggestions, namely making more sauce. I made a roux with 4 T flour and 4 T butter, added a pint of half and half and some cumin, chili powder and cayenne. Heated until it thickened up then took off the heat and added just under a pint of sour cream. It was a bit thick so I added some milk to thin it out a bit.\nUsed real crab and already cooked small shrimp which I cut into smaller pieces. I used flour tortillas. My trick is to dip the flour tortilla in the sauce then place in the pan, add the crab/shrimp/cheese mixture, roll up then cover up with the remaining sauce. I had plenty left over after dunking all the tortillas. I ended up with 8 enchiladas.\nThen I covered the pan with foil and baked for 25 minutes, removed the foil and added the cheese (I used white cheddar), sprinkled some paprika and cilantro on top for color and baked uncovered for 5 more minutes to let the cheese melt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KrisJohnson"
},
"reviewBody": "I didn't have shrimp so I substituted imitation lobster and doubled the recipe. We loved it...it is a definite repeat on my dinner table!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Klingemann"
},
"reviewBody": "Loved these...with my own adjustments of course! I used shrimp, chunks of mahi mahi and 8 ounces of lump crab (NOT IMITATION!). I sautéed a whole onion and five cloves of garlic in butter, added my fish and seasoned it all with 1 tsp of old bay seasoning, 1 tsp cumin and 1/4 tsp of cayenne pepper. Added a mix of shredded pepper jack cheese and Mexican cheese to it and simmered until cheese was melted. Made the sauce as shown except I added 4 ounces of melted cream cheese as a thickener. Yum...will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Zerbe St Thomas"
},
"reviewBody": "Very tasty enchiladas! I double the half and half and sour cream because we thought it was a bit dry, but otherwise it's perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda Delgado"
},
"reviewBody": "I made it once with the original recipe-but kinda bland but still good.. Was better with the green sauce over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Added additional crab and shrimp"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharont"
},
"reviewBody": "OMG! You can not, will not be disappointed! I add a bag of bay scallops to the crab/shrimp mix. I also add creole seasoning. Both of these make it over the top amazing. I have made it as written then changed it up a little. The start recipe is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Brown-Bergmann"
},
"reviewBody": "I would give this recipe more stars if I could! This recipe is simply delicious and would highly recommend it for any gathering from a family dinner to a fine sit down dinner with guests you want to impress. I followed the recipe with the exception of swapping tilapia for the crab. I LOVE crab but didn't have any available. The cream sauce was fabulous, the dish did not have an over powering seafood smell or taste, leftovers the next day were just as good! My husband is not a huge seafood fan, and my daughter is the pickiest eater EVER and they both couldn't get enough. My daughter actually declared it her new favorite meal ! I would highly recommend this recipe. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie Gaines"
},
"reviewBody": "Great recipe...my boyfriend and I loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sabrina Harvey"
},
"reviewBody": "The flavor was OK - and got better the next day. If I make these again I would add more spice; these were a little bland. My biggest complaint against this recipe is that the sauce curdled and looked pretty unappetizing, as other cooks have found."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plattskerry"
},
"reviewBody": "I have never made seafood enchiladas because I have a famous chicken enchilada recipe but this is definitely a keeper. I added imitation crab with the shrimp because I originally planned on making a seafood pasta salad and scrapped it. My family wasn't excited about the change but ended up eating the whole thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeff appling"
},
"reviewBody": "This was amazing! Since there was only imitation crabmeat at my store I substituted swordfish. I also added baby spinach and fresh diced tomatoes to me stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valarie Bedell Bell"
},
"reviewBody": "I made this recipe for dinner party last night. It was awesome! I read a lot of reviews and decided to go with Caren's suggestions. After I melted the butter and sauté the onion I did add 5 tablespoons of flour to make a roué . Then I added a cup of half-and-half and a cup of heavy cream, I don't like my food too spicy so I only added a 1/4 teaspoon of the chili powder 1/8 of a teaspoon of the cayenne pepper and 1/2 teaspoon of cumin, &amp; 1 tsp organic pink salt. I also added some minced garlic to the sauce the flavor was amazing. Next time I will add less flour to the roué probably only two or 3 tablespoons, as I always put some sauce in the bottom so it won't stick the pan, sauce was a little too thick and my tortillas did stick a little bit to the bottom. I also took Caren's idea of putting some sauce in with the seafood so it wouldn't be dry , that was a good idea I'll do that again! I did top with sharp cheddar cheese and chopped up cilantro and parsley and it looked really nice. A definite crowd pleaser!."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy H."
},
"reviewBody": "Good base start. Crab over powered the shrimp. Sauce did curdle somewhat. I will use spice suggestions from other reviewers next time. I also plan on using corn tortillas for a more casserole type dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoRo"
},
"reviewBody": "it was really good, husband loved it. next time i will increase the sauce by 50%. they are super easy to make and amazing. i wasn't sure if they are suppose to be covered while baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "libertine99"
},
"reviewBody": "One of my favorite holiday recipes; Mom always made her version around Christmas. Changed a few things. Used one pound of shrimp, not 1/2lb. While cooking the meat, onions and cheese, I added about 3/4 cup of tomatillo salsa (store bought). I had some left over meat/cheese/onion mix, so I added that to the sauce once it had warmed. Turned out great! Girlfriend was hesitant at first, ended up loving it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugar foot shoo"
},
"reviewBody": "This recipe is so good! My whole family loved it, even my picky 9 year old:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nicole Schneck"
},
"reviewBody": "It looked and smelled amazing when I was finished. The first couple of bites were amazing, but I couldn't finish one whole enchilada myself. My roommate LOVED his, scarfed it right down. I think maybe it was the half and half? it was way to rich for me, ended up needing to eat a couple of tums later on that night. If i make again Ill use a less rich sauce. The filling was perfect though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cmarikcasa"
},
"reviewBody": "I personally thought this recipe was awesome however my family hated it. I followed it exactly and it came out it really nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RachelJ"
},
"reviewBody": "This recipe was easy to make and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "st. louis gal"
},
"reviewBody": "This recipe was exactly as I hoped it would be. I served a shredded lettuce salad with finely chopped tomato along side of the enchilada on each plate. I did not have parsley, but that made no difference in the taste, according to my family. I Will use less butter in the future, but other than that I will make this again for special guests that visit our home. If it were possible to give 10 stars, I would do that! Thanks Cathy. This recipe will get lots of use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "steffanie"
},
"reviewBody": "This was fantastic. I added crab meat, shrimp, scallops and mexi-corn along with one cup of the sauce that goes over the top. (I doubled the sauce over the top) The enchiladas were moist and loaded with all the seafood. Oh yea, one other thing, I added 1/2 block of cream cheese to the seafood mixture and let it melt down for thicker consistency. Delishhhhhh!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CRDMANN"
},
"reviewBody": "These were SOOOO good!I will make them again!I added fresh chopped mushrooms as I was short on seafood. A keeper indeed!I did add the extras that one review recommended to the sauce, can of chilis, cumin, chili powder.I even used fat free 1/2 n 1/2!! Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beckygunnells"
},
"reviewBody": "Loved it! It was easy. One thing I will try next time is to make a lighter version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChilledCoyote"
},
"reviewBody": "We really enjoyed this recipe. I started by sauteing some shallot with the onion (had half a red onion in the fridge, so I used that), then lightly sauteed the chopped shrimp and a chopped up tilapia fillet. Stirred in half the cheese (used pepper jack) with the seafood and set it all aside for a minute. Made a roux using 1/2 a stick of butter and about 5-6 Tb flour, cooked slowly, then added maybe 1.5 cups of buttermilk (which I also had on hand and needed to use), and whisked while it cooked on low for a few minutes. Then I turned down the heat and stirred in the sour cream and about a cup of green enchilada sauce. I added a couple sprinkles of garlic powder and cumin, while whisking over low heat. Once done, I mixed about 1/4 of the sauce into the seafood mixture.\n\nMy corn tortillas refused to bend, and would only crumble, so I made them into a tortilla layer, put half the seafood on top, put half the remaining cheese on top, then another layer of tortillas, the rest of the seafood mixture, another 1/4 of the cheese, then a final layer of tortilla. I poured the sauce over it all, then put the rest of the cheese on top. Baked at 350 for 32 minutes, served with sliced green onions and fresh cilantro on top, with ribbons of zucchini sauteed with garlic and lime on the side.\n\nHighly recommended, despite all my substitutions! I love these casseroles, they are a great way to use up ingredients you need to use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Lukas"
},
"reviewBody": "I didn't try this as written but made some changes to the sauce as others had suggested. Fantastic! My boyfriend thinks this is one of the best things I've ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Alicia Hale"
},
"reviewBody": "This tasted like straight onion even after I cut out more than half of the recipe and doubled the sauce. My boyfriend is from Mexico and he said it tastes nothing like a enchilada and that I have made better enchiladas before. The only one who liked it was my one year old."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "laticiam"
},
"reviewBody": "Did not work at all. The tortillias got soggy and nasty. Will not be using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leila"
},
"reviewBody": "After tasting it I figured it needed some kick. So I fried some chili arbols in oil and crushed them up. Then added them to the mixture. The lil heat gave it some extra flavor. I will definitely be keeping this recipe. The family and co workers thought it was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimthompsonlvnv"
},
"reviewBody": "super easy!!! Who would have thought seafood enchiladas could be done so quickly and taste better than eating out! For the sauce I just used salsa verde mixed with sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "maggie"
},
"reviewBody": "Nice flavor but the sauce was too thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maiya's Mom"
},
"reviewBody": "This Turned out exactly how I hoped would! I used a little extra cheese for the filling and on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Heine"
},
"reviewBody": "made a few alterations---substituted 1% milk for the half and half, added a little flour to the sauce to thicken it up...overall very good and very easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cathleen Renneberg Palmer"
},
"reviewBody": "its ok but needed more sauce. best with the white lump crab meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "proudmama"
},
"reviewBody": "With the suggestions on changes, this was a hit! Without the green chilies, cumin and chili powder, this could have been very bland. Was just perfect with it. Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Hua"
},
"reviewBody": "got a lot of props for this recipe at a party! I think I'm going to add some cod next time. The recipe can use a lil more crab and shrimp - I would increase the crab and shrimp content by about 50% more each. Everything else was awesome as is. =)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/18093/seafood-enchiladas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17504/world-cuisine/latin-american/mexican/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1218/world-cuisine/latin-american/mexican/main-dishes/enchiladas/",
"name": "Enchilada Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/18093/seafood-enchiladas/",
"name": "Seafood Enchiladas"
}
}
]
}
}
, "about": [
]
}
]