				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Serbian Ćevapčići"
,"datePublished": "2018-06-08T09:25:20.000-04:00"
,"dateModified": "2022-09-14T12:23:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "AMERICANBRUNETTE"
,"url": "https://www.allrecipes.com/cook/1031391"
}
]
,"description": "Ćevapčići is a tasty homemade grilled sausage. This Serbian-style recipe combines ground pork, beef, and lamb with garlic, black pepper, and cayenne."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/T49TS9YmLiE-tXYbeHJz74PcXnY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2267280-47dea34d84ed4546a65725a7e419c555.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Serbian Ćevapčići"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "79"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "690 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "223 mg"
,"fiberContent": "1 g"
,"proteinContent": "63 g"
,"saturatedFatContent": "18 g"
,"sodiumContent": "1097 mg"
,"sugarContent": "0 g"
,"fatContent": "46 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 pounds ground pork",
"1 pound lean ground beef",
"0.5 pound ground lamb",
"1 egg white",
"4 cloves garlic, minced",
"2 teaspoons ground black pepper",
"1 teaspoon salt",
"1 teaspoon baking soda",
"1 teaspoon cayenne pepper",
"0.5 teaspoon paprika" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat an outdoor grill for medium heat and lightly oil the grate."
} ,{
"@type": "HowToStep"
,"text": "Combine ground pork, ground beef, ground lamb, and egg white in a large bowl. Add garlic, black pepper, salt, baking soda, cayenne pepper, and paprika. Mix well using your hands; form into finger-length sausages about 3/4-inch thick."
} ,{
"@type": "HowToStep"
,"text": "Cook sausages on the preheated grill, turning occasionally, until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C)."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "petermiller53402"
},
"reviewBody": "I love the Balkan cuisine! Cevapcici was and is one of my favorites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina"
},
"reviewBody": "I left out the ground lamb. I cooked the sausages in the oven on 400 for 15 mins &amp; turned them over &amp; cooked for another 18 mins. I made a side of potatoes &amp; onions and naan garlic bread to go with it. It turned out delicious. I'll make it again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Noyb"
},
"reviewBody": "Made with 1lb. each ground lamb, chicken &amp;beef because hubby won’t eat pork. Used 1 tsp hot Hungarian paprika and 1/2 tsp “regular”paprika because I was out of cayenne. 6 cloves garlic because we like garlic and they were from an inner layer where the cloves get a bit small, 1/2 tsp fine granulated salt because I’m also out of the Diamond Crystal kosher salt I usually cook with. Got 18 sausages from the 3 pounds of meat. Grilled over charcoal and served with rice, low carb pitas ( for the family diabetic), green salad, raw Visalia onion (chopped), fake Kajmak, roasted red peppers, and watermelon. 4 people, picky 3 different ways, NO leftovers! This one is going in the rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brown Jenkin "
},
"reviewBody": "Very good recipe. I cook 'em up in my Ninja grill. MMMMM good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alicia Baldwin-Evans"
},
"reviewBody": "This was my first time making these. It was also my first experience with lamb meat! These turned out lovely and everyone enjoyed them for the most part. My only recommendations would be 1) to make the sausages thinner to ensure even cooking as well as taking less time to cook and 2) cut the cayenne pepper in half if you are serving to people who are sensitive to spices. I thought it was the perfect amount, but I love spicy food! All in all, a great recipe that I am sure I'll make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bohican"
},
"reviewBody": "Tastes almost like I remember from when I was in Bosnia ages ago. I cooked them on a pellet grill at 350f for about 30 minutes, turned out well. I will probably omit the cayenne in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Silke Weineck"
},
"reviewBody": "this is tragically, or comically, underspiced. Double all the spice measurements for a mild one, add another tablespoon of hot paprika if you like your food tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Miskolitz-Timko"
},
"reviewBody": "I added finely dice green pepper, garlic, and onion I brushed the cevaps while grilling with olive oil and basil. This was the traditional way I learned from my baba and dzedo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marisa Franc"
},
"reviewBody": "The recipe was fantastic, I made it for a gathering last weekend and all 12 attendees loved them. Just like we had in Slovenia. I decreased the cayenne to 3/4 tsp afraid it would be too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WobblyWonder"
},
"reviewBody": "Delicious. Since we don't like pork, I made it with a 2:3 ratio of lamb to beef, and it tasted superb. I also put a cheese core inside, after trying a version of it in Zagreb. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Stapleton"
},
"reviewBody": "Made this for the family dinner and it turned out awesome! I used smoked paprika instead of regular and had a white sauce on the side. Highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "K Davis"
},
"reviewBody": "I did not use pork, only lamb and beef. was easy to make and very good. My family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Julie Pangilinan"
},
"reviewBody": "meat was rubbery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Talia Hammond"
},
"reviewBody": "I used smoked Hungarian paprika and OMG AMAZING!!!! So yummy I will be making again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucas Schnock"
},
"reviewBody": "Too spicy for my gf but I loved it, thanks for sharing ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Delicious and easy. But 3 pounds of meat assuredly makes far more than 4 servings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "voodoo3397"
},
"reviewBody": "Tastes really good. Would recommend to others"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melzajane"
},
"reviewBody": "Didn't like it at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sflolita"
},
"reviewBody": "These are too spicy. Maybe cut down on cayenne? They taste good but not quite like what I'm used to (I'm from Bosnia and have been eating cevapcici my whole life)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tucsonali"
},
"reviewBody": "I didn't have baking powder. I added some corn meal for texture and they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookindude"
},
"reviewBody": "Oh wow was this good !! Pretty much made it by the recipe, only cut the cayenne pepper down to half a teaspoon. Had it on rolls with a Tzatiki sauce recipe from here. Sooooo good !! Loved it !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emma"
},
"reviewBody": "This delicious cevapi recipe reminded me of my last stay in Croatia and one-day tour in Bosnia (Mostar) where I ate those sausages.\r\n\r\nI like the mix of flavour and the fact that it is easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue KC"
},
"reviewBody": "Wow! I really liked this recipe. Had no lamb, so upped the pork &amp; beef, upped the garlic &amp; added a touch of cumin. Cooked outside on the grill. Also made raita for dipping. I am now eating the leftovers cold, straight from the fridge. Oh, and the rest of the family enjoyed them also. This recipe is a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msharp99"
},
"reviewBody": "Big hit : named instant repeat by the family and second helpings for our girls.\r\nFollowed the recipe, with a couple of changes: I halved the pepper amounts. I used 1lb each of beef, lamb, pork. One set of sausages was .75 beef and .75 lamb with 1/3 of spices mixture (for family who don't like pork), the other set were 1.00 pork and 0.25 beef and 0.25 lamb with 2/3 of spices mixture (for me who likes and pork and more spicey!).\r\nI baked at 350F for 42 minutes and they turned out great! served with zatziki, pita bread, fried onions, peas and green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Delicious! I used 1 lb. ground pork/1 lb. beef. and adjusted the recipe accordingly. I let this sit in the refrigerator for a couple of hours before we cooked them. I used Hungarian sweet paprika because it's what I had. I added some parsley flakes for color and a tiny pinch of mint for brightness. This was a super easy recipe and made a really great meal. My husband commented on on well he liked this. Thanks for a great dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Villont"
},
"reviewBody": "because I didn't know how to say the name of this recipe, I told the family we were having Serbian hamburgers, and they at them up! We made the Serbian Flat bread recipe, and some cucumber yogurt, and then served tomatoes and onions with it. We will be making these again for sure. The flavor was so delicious. By the way, we could not get ground lamb and so we did only the beef and pork and it still came out very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKCHUCK"
},
"reviewBody": "OK, I just made two batches of the meat. First batch was with a store bought seasoning impoted from Bosnia, the second, this recipe.\nAll I can say is that this recipe is by far the BEST! True flavor through and through! I followed the recipe to a \"T\" and it turned out fantabulous.\nOne thing I will say is that if you want true authenticy, homebake Somun Flat Bread to serve. Store bought pita just plain SUCKS!\nAMERICAN BRUNETTE you ROCK the Mid Eastern FOOD WORLD Baby!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joenstacey99"
},
"reviewBody": "awesome !!!! love them............"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I made this with the following changes: used 2lbs ground beef and 1lb ground pork instead as I couldn't get ground lamb. Used an entire egg instead of egg white only and lastly and the worst of all... I didn't make them into sausages... I had made some breakfast sausage earlier in the day and was tired of making sausages. So, I just combined the meats, mixed in the seasonings and cooked them in a pot and broke them up as I cooked them. I must say though that it is a very tasty dish at that! the seasonings were definitely right on and next time, I would make them into patties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AlexanderXavier"
},
"reviewBody": "Absolutely amazing. Reminds me of my time spent in the Balkans. Serve with a shopska salad and round off with Turkish coffee and you'll have an instant flashback"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrouleau"
},
"reviewBody": "I’m an American Serb and have been eating many versions of these and I can say these are one of the better I’ve had, flowed recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "Made and tastes ok. Nothing like the one I buy at a little european grocery store (LYKOS) in Whiting,In. They're the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sasa"
},
"reviewBody": "These were pretty tasty.\nHowever, they did not taste anything like the Cevapcici I am used to. My mother is half Serbian, half Slovenian and I have been to former Yugoslavia countless times. I have been assured by my Serbian grandmother that an authentic Cevapcici contains only pork &amp; beef mince, salt and pepper and nothing else. And that the meat needs to rest for at least 24 hours after being mixed.\nI have no idea how true that is, but I am willing to bet that there are many variations that are all equally \"authentic\".\nOur Cevapcici were a little on the dry side, but I blame my husband for slightly overcooking them.\nThis recipe makes more than just 4 serves if you ask me...\nAnyway, this was yummy and I will make it again with some minor alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dhotch"
},
"reviewBody": "ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia C Brogli"
},
"reviewBody": "I made this with 2 lbs lamb and 1 lb each ground beef and pork and adjusted the spices up proportionately since this was a little more meat. This was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MUSIC_MINX"
},
"reviewBody": "For Ad-lib Cook, the pronounciation is CHEE-VAP-CHEE-CHEE, the Serbian word for a little slice of heaven, as far as I'm concerned. Thanks for sharing this recipe Brunette!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DCooper"
},
"reviewBody": "I live in serbia and cevapcici are a delicacy. they taste great when grilled, with fries and sour cream on the side or in a bun. hope i helped!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ad-lib Cook"
},
"reviewBody": "Yummy! And I don't even know how to pronouce it! I was concerned that the cayene pepper would be too much for the kids, but they didn't say a thing. I also was wondering if I'd like it since I never cook lamb. But surprise...I'll make these again for sure. I'm sure someone of Serbian decent would like to shoot me for saying this, but I think of these as Serbian gyros."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "boonu"
},
"reviewBody": "I remember going to Croatia and having Cevapcici sandwiches every single day for almost a week... It was the best week of my life! When I found this recipe I was so excited to try it. I made it for the first time for my two friends who were with me in Croatia. I grilled the cevapcici in a foreman and served it with pita bread, sauteed onions and some Ajver sauce. Ajver is this great roasted red pepper base sauce that you can find in eastern european markets. If you can find this sauce it really perfects the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VAZ123"
},
"reviewBody": "Living in the midwest I have a freezer full of ground venison. This time the butcher combined it with ground pork. This was a perfect place to use it. I usually like leaner meats, but by grilling the grease from the pork ran right off. The flavors were delicious. We served it with great hot dog rolls from the Breadsmith--so good. Completed the meal with mashed potatoes and grilled zucchini with rosemary olive oil. yummm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sasha63"
},
"reviewBody": "Wow - great! I've had chevapi in Belgrade, Serbia and in Sarajevo. I prefer them without lamb or with only a bit of lamb. Traditionally served with chopped white onion, kajmak and ajvar on lepinje... oh man! My father in law made chevapi in his own restaurant and always added mirneral water to the meat mixture. I buy lepinje at a serbian bakery and had these on them. It's rare to find real kajmak - expensive - but worth it. Thanks for an excellent recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DraganPDX"
},
"reviewBody": "Delicious!! I added a 1 1/2 tea spoons of vegeta for some real authentic Serbian flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FrancesC"
},
"reviewBody": "These were really good, despite my manhandling. I had all of the spices in the bowl, and added the meats (1# beef, 1# lamb, ½# pork) and mixed them. I was just about to shape them when I realized I'd forgotten the egg white. I added the egg white, mixing the meat again, getting ready to shape again—and then realized I forgot the garlic! Horrors! So, of course I added the garlic, and mixed it into the overworked meat mixture. Needless to say, the sausages were a little tough—but great flavor. Served with Peppy's Pita Bread, Magpie's Cucumber Sauce, sliced tomatoes, lettuce, and onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aw Yeah"
},
"reviewBody": "What memories these little guys bring back! Had to make them as soon as I found this recipe. They taste great! I made ours with a lean mean grilling machine so they turned out flat instead of the nice round look, but my stomach didn't care one bit. Thanks for posting the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ben Sullivan"
},
"reviewBody": "Delicious and authentic, somewhat labourous but worth it. Made with fresh buns, fried onions and cucumber yogourt sauce. Make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "socalhabaneros"
},
"reviewBody": "Excellent. I followed the recipe exactly, what I ended up with was very similar to the cevapcici I've had at the local Serbian Orthodox Church cultural festivals. I like to eat mine with a easy fake Kajmak I make out of butter, cream cheese and feta. And plenty of white onion. I love this meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danni Skaricki"
},
"reviewBody": "Authentic and easy. I didn't put the pork in because I have never eaten them that way due to my family's religion. Half beef and half lamb worked well. I accidentally use the wrong size measuring spoon (bigger)for the garlic and spicesso I thought I screwed this up but I didn't- they were perfect. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GailandDan"
},
"reviewBody": "Very nice. Lots of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary-Anne Durkee Patterson"
},
"reviewBody": "We love cevaps! Our son-in-law is Serban and he taught me to make them. Just wish I had a real recipe for Lapinja!\n\nHe doesn't use egg, but uses soda water. I also do this plus Vegeta, and smoked paprika. Sometimes I caramelize onions and add to the meat mixture. Always serve with hot Ajvar (Zergut is good brand)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Carque Stojanovic"
},
"reviewBody": "My husband is Serbian and I have been trying to find Serbian recipes for our family to try. This is definately a keeper! Very easy to make and delicious! I broiled them in my oven since I made these in the winter, and they came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lg"
},
"reviewBody": "Easy and yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L. Rakic"
},
"reviewBody": "My husband was raised on Cevapcici and claims this is the real deal. We don't have a grill so I baked them for 30 minutes in a 350 degree oven. They came out nice and brown on the outside and were cooked through on the inside. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "thaliadad"
},
"reviewBody": "I have relatives in Sarajevo and we love to eat these when we visit. This recipe was an excellent version of the dish served all over the Balkans. I used half lean gr. beef and half lamb. The seasonings are fairly subtle and the next time I'll probably round them up a bit for my taste. All in all, easy, authentic, &amp; delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SLAVICA"
},
"reviewBody": "This is a great recipe...authentic tasting! I am Macedonian and there are just like the ones we eat with onions and bread!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BroncosFan"
},
"reviewBody": "These were great and even my kids loved them. I used warmed flatbread and served with yogurt/cucumber sauce. The only thing I did differently is left out the lamb (I just don't like lamb). I used equal amounts of ground pork and ground sirloin and followed the rest of the recipe as stated. DELICIOUS!!! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renae"
},
"reviewBody": "Wonderful! My husband and I are planning to visit Serbia next year and loved this recipe! Didn't change a thing, and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rik Kakareko"
},
"reviewBody": "great recipe. adding just a small pinch of fresh ground cinnamon to the mix adds nice fragrance."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephenMichele Jasukonis"
},
"reviewBody": "This is a really great recipe! I switched the pork and lamb amounts around, and added more garlic for a more ethnic taste. Served up with Tzaziki and english muffins it's great! The whole family loved it. Try it as a meatloaf as well!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "okimadoki"
},
"reviewBody": "This was great. Too bad I didn't have any tzatziki. I am Serbian and this is pretty close to the real thing. Maybe only pretty close because I forgot the baking soda. Not sure what difference it makes, but it tasted just fine without it. Served in a whole wheat pita with lettuce tomatoes and cucumbers. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mikda"
},
"reviewBody": "Wow, I've wanted to make these since my stay in Bosnia. My husband worked on a base in Tuzla and I thought it would be fun to go live with him there. I know the cevapcici we ate didn't have the pork in it because we lived in a very strict Muslim area, but even with changing the meat around a bit they were perfect. Exactly like the restaurant up the road from where we lived, Bosanka’s. These tasted wonderful with my yogurt sauce on English muffins, which is the closest thing I found to the bread which was served with cevapcici. Thank you so much for providing a recipe for me to share with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jomom75"
},
"reviewBody": "I should have rated this months ago when we made it but forgot! My husbands family is Croatian and my husband and I have been craving Cevapcici for years since having it at the Croatian Club in Calgary. I was so excited when I saw this recipe!\nWe made a double batch so we could freeze some for later in the week, took a while to BBQ them all but boy was it worth it! These are soooooo good! The kids even loved them as long as they had a glass of milk for their burning tongues LOL. \nThank you so much for this recipe! They taste EXACTLY how we remembered them and will be making them again as soon as it's warm enough to BBQ again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Galley Wench"
},
"reviewBody": "Excellent -- warm but not too spicy for the kids. Served with sauteed onions &amp; cucumber/yogurt sauce in warmed, folded whole wheat pitas. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elfhelp"
},
"reviewBody": "This was THE BEST!!! Served w/ potato pancakes and a salad. Also for a topper on both the meat AND salad I used Tzatziki sauce from this site. Simply scrumptious.Thanx for the unique recipe AmericanBrunette. It's in my permanent file now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SueDC"
},
"reviewBody": "This recipe was very good. I didn't change anything, but made the links a bit larger than described here. They were delicious served on wheat rolls with american cheese melted on them. A little bit spicy, but my husband and 8 year old son loved them. A nice change from having plain old hamburgers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amigo2"
},
"reviewBody": "In my opinion it`s authentic serbian meal,to serve with rice,peas and sweet pepper and hot Tomato Ketchup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "When my husband and I were newlyweds, living in a small German village, one of our favorite restaurants was one called The Balkan Grill, my husband always ordered the cevapcici. I was so excited to come across this recipe and it did not disappoint! It was delicious! My husband raved and thought it was real close to what he had had in Germany. He also spent lots of time in Bosnia, so this was a nice trip down memory lane for both of us. Thanks for sharing this great recipe."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/80398/serbian-cevapcici/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17021/meat-and-poultry/pork/ground/",
"name": "Ground Pork Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/80398/serbian-cevapcici/",
"name": "Serbian Ćevapčići"
}
}
]
}
}
, "about": [
]
}
]