				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Shrimp Gazpacho"
,"datePublished": "2019-07-10T02:59:56.000-04:00"
,"dateModified": "2022-10-17T13:29:35.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Dawn"
,"url": "https://www.allrecipes.com/cook/2002353"
}
]
,"description": "This quick and easy version of the cold tomato soup gazpacho is unique due to the addition of avocados and shrimp."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/R9PCYAL1BU7_jWQnJ85WvPdq8Ds=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3859435-04304a35908d43ad9e9e5010c5701732.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Shrimp Gazpacho"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "69"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "322 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "221 mg"
,"fiberContent": "6 g"
,"proteinContent": "27 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "948 mg"
,"sugarContent": "9 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"64 fluid ounces tomato and clam juice cocktail",
"3 pounds cooked shrimp, peeled and deveined",
"4 avocados, peeled and chopped",
"2 cucumbers, cubed",
"3 large tomatoes, diced",
"1 red onion, diced",
"1 bunch cilantro, chopped",
"2 tablespoons lemon juice",
"0.5 teaspoon salt",
"0.25 teaspoon pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, combine the tomato and clam juice cocktail, shrimp, avocados, cucumbers, tomatoes, red onion, cilantro, lemon juice, salt, and pepper."
} ,{
"@type": "HowToStep"
,"text": "Refrigerate until ready to serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "34kimo"
},
"reviewBody": "This is a very easy and delicious recipe! I added some garlic powder because we are garlic nuts and we don't care if we smell like garlic. I also added Worchester sauce because we love it. Subbed celery salt for regular. (a new addition to our foods). Thank you, Dawn! I made this today for tomorrow so the flavors meld. Yum, can't wait!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori L. Cotner"
},
"reviewBody": "I like spicy but when I seen 1 TBSP, I chose to start with a tsp! It was awesome (but forgot my tomatoes had Med. Chili peppers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Florey"
},
"reviewBody": "I really liked this. I used 48 ounces of original V-8 and 16 ounces of spicy v-8. Next time I'll cube the cucumbers instead of slicing. If your cooking raw shrimp, steam them and ice them down as soon as they're done. I used a tablespoon of Old Bay seasoning on them while they steamed. This makes a lot of soup, so be prepared to share with neighbors. Because its seafood, consume as soon as possible (I don't that will be a problem)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francesca"
},
"reviewBody": "amazing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doobie"
},
"reviewBody": "My husband, kids and brother in law loved it. I added green, red, yellow and orange peppers and I also added clam juice. Perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sullygirl"
},
"reviewBody": "This is an absolutely wonderful dish! We had friends over and my one friend can’t stand gazpacho. We convinced her to try and she loved it! She asked for this recipe and has made it twice! Bravo Dawn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "Oh my. I do hate to be That Guy who doesn't follow a recipe but reviews it anyway. Here I go, nonetheless. I only had one avocado so I threw in a can of garbanzo beans. I only had one tomato, so I used a can of diced tomatoes. And I added a can of clams because it seemed like a good idea. This turned out well though and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charm"
},
"reviewBody": "Oh my. I do hate to be That Guy who doesn't follow a recipe but reviews it anyway. Here I go, nonetheless. I only had one avocado so I threw in a can of garbanzo beans. I only had one tomato, so I used a can of diced tomatoes. And I added a can of clams because it seemed like a good idea. This turned out well though and I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peggle"
},
"reviewBody": "Wouldn't change a thing. Even hubby loved it (and he's one of those 'hate veggies' guys - the shrimp got him to try it. Said he likes how chunky it is.) Will make this again and again - guilt free food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Kat"
},
"reviewBody": "I cut serving size to 6.....Had it last night was wonderful. Having it again tonight and my bet is that it will be even BETTER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie McLellan"
},
"reviewBody": "Very easy to make and turned out awesome. The recipe made a lot so I shared with my neighbor and she loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anyhow"
},
"reviewBody": "So simple and really delicious. I used The Big Easy Cajun seasoning for some kick. Turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimeyrae"
},
"reviewBody": "this is amazing and simple can adjust to suit our taste buds so easily. I use salad shrimp so it is small pieces or langustino lobster. If some don't eat seafood just do half with v8 and chicken. I also don't add avocado I put it on the side so it doesn't turn into mush if any is left over also have dollups of cream cheese on the side. it is always a hit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Sheffey Westphal"
},
"reviewBody": "This is so yummy and refreshing. Perfect to eat to beat the heat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DANADRAE"
},
"reviewBody": "I've made this twice now. I put jalapeno and hot sauce on the side for those that like it spicy. A fresh squeeze lemon juice is also nice on the side. If you use avocados that aren't too ripe they will stay fresh in the soup the entire time! Make great leftovers! Everyone that has tried it LOVES it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dldeutsc"
},
"reviewBody": "Amazing! Make this every summer makes a lot! There will be plenty left over"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keillie Cartier"
},
"reviewBody": "perfect for hot days. I make it with Spicy V-8 juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody Fields"
},
"reviewBody": "I make this dish all the time, I have a few of my own tweeks, as I like to use fresh shrimp and make my own shrimp water......so yummy good and I squeeze a few other citrus in it as well....watched it being made in Mexico while i was there and I can tell you I have it down , but they did not use cucumber....I like it without!!!......but this is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "I have never made gazpacho before. I cut the recipe in half for the two of us. It was absolutely delicious. I took the leftovers to a church potluck and it received rave reviews.The only change I made was to peel the cucumbers. It's one of the easiest recipes I have ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktoland"
},
"reviewBody": "I Loved this! EASY! Made it with Spicy V8 Juice and Clamato... added jalapeno pepper, hot sauce and extra veggies and ate it for days... Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hayleigh"
},
"reviewBody": "I tried this recipe and it was just delicious! I served it to my family and friends and it was a big hit! I'll definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rwnall"
},
"reviewBody": "I pureed half of the veggies and juice, including the avocados. added two cloves of minced garlic and 2 minced jalapenos, in my food processor. Gave it some consistency. Added the rest of the chopped veggie, two tbsp EVOO, one tbsp hot sauce, the 2 remaining cubed avocados and the shrimp. Served ice cold with a nice chardonnay and crusty bread. It was a huge hit at a gourmet dinner. Will make this over and over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "this soup is fantastic! very refreshing and when its over 90 degrees out i can't think of a better dinner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "loryann222"
},
"reviewBody": "This was soo yummy! Instead of Clamato I put the tomatos, cucumber, bell pepper, garlic, onion and celery in my juicer. I then added the chopped items and shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca G"
},
"reviewBody": "Very refreshing and sooo easy! The only additions I had were 1/2 spicy V8 and 1/2 original V8 and a Tablespoon of Fish Sauce. I find that Fish Sauce really brings out a lot of flavour. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gama4xs"
},
"reviewBody": "I found this last year, loved it then and love it still. A hint for those who aren't fond of avocados, I blend it together with the juice, which makes it a little bit thicker, But since I have someone in my household who doesn't like avocados, you don't know they are in it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FTLSWEETIE"
},
"reviewBody": "I made this last night and let it sit in the fridge to allow the flavors to blend overnight. It was fantastic for lunch today and as I made the whole recipe, will be for many more lunches and dinners! I only made a few slight changes, using Low-Sodium Tomato Juice and a bottle of clam juice to sub for the tomato and clam juice cocktail. I also used 1 SlimCado (Florida Avocado) as it is lower in fat / calories and much bigger than a Hass Avocado. I seeded the cucumbers before cubing and only used 1 pound of salad shrimp. After following the recipe exactly after that...I found it needed a little more seasoning. So, I added about 1 Tbsp low-sodium worcestershire, 1-2 tsp celery salt, and several drops of tobasco. That made it 5 stars! \n\nWith my changes, this came out to 117.9 Calories, 2.5 grams Total Fat (0.2g Saturated, 0.3g Polyunsaturated, 0.1g Monounsaturated), 73.7mg Cholesterol, 208.3mg Sodium, 611.1mg Potassium, 15.5g Total Carbs (2.3g dietary fiber, 6.5g sugar) and 9.9g Protein Per Serving (12 Servings)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladel Licker"
},
"reviewBody": "I used to buy Shrimp Gazpacho from the Mexican gentleman that visited the construction sites where we were pouring concrete. What a crazy tasty soup. This one is just as good as back in the old days. Very straight forward and minimal ingredients. I did however use some spicy hot V8 juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cowboy Mark"
},
"reviewBody": "Wonderful! This was the first time that I have tried a Gazpacho recipe. I was very pleased. The longer that this chills, the better it becomes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gig"
},
"reviewBody": "Absolutely loved this simple, but very tasty recipe. Tried it on friends visiting from out of town and and they thought I spent hours on it. I was a little embarrased when I shared the recipe with them because it was so easy. I have made it over and over, sometimes omitting the shrimp if my guests do not care for seafood. But served with a side salad and fresh dinner rolls or sourdough bread, it's a crowd pleaser every single time. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Smith"
},
"reviewBody": "We loved this, I added balsamic vinegar and liked the flavor that it added. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerrian Bard Fournier"
},
"reviewBody": "Absolutely fantastic - the perfect summer soup - almost a mix of gazpacho &amp; a ceviche. Loved it so much even ate leftovers for breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cooking mama"
},
"reviewBody": "Followed this recipe exactly. There are no flavors in this except the taste of clammy tomato juice. Spent an extra 30 mins. adding some flavors, lots of garlic, red wine vinegar, more salt and pepper, tabasco sauce juice of 2 lemons and olive oil. With all that it still pretty tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "This is outstanding. I did add a bit of garlic but otherwise didn't stray from the recipe. I thought I made more than I would need but NOOOOOO...it's gone and I want to make another batch right away. Just make certain you use the freshest of ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimscookin"
},
"reviewBody": "I made this recipie for my bunko group and they loved it. The only different ingredient I used was Clamato Picante style juice and it added just the right amount of spice. Will definetely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hezapeck"
},
"reviewBody": "This recipe was fantastic. The flavors blended incredibly well. The soup was filling, satisfying and refreshing on an uncomfortably hot summer evening. We made a half recipe for 4 of us and there was plenty left over for lunch the next day and to snack on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jo S"
},
"reviewBody": "I could not use the Clamato Cocktail drink, so I used 24 oz. Organic tomato juice and 16 oz. clam juice. This ratio seemed right to us (I cut the recipe in half and got 6 generous portions) but we really liked the extra juice. I also added 1 TBSP Worcestershire sauce, 2 TBSP Olive Oil and Hot sauce. We also found the recipe needed more salt. I used 2 Lbs. shrimp and chopped them into bit size pieces. (Husband likes the extra protein) We enjoyed this more the next day as the onion flavor mellowed. Over all this was a huge hit. My husband was impressed with how healthy this is and my Father-in-law just enjoyed the flavors. This was a refreshing change of pace. I will make this again. - Huge hit Dawn. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ADWOALW1"
},
"reviewBody": "Let me start by saying that I have traditionally hated most things tomato based and have never been able to stomach a glass of V8 juice. But, desperate for a summer soup, I gave this a try. It was amazing. I made some modifications including: I added some yellow peppers, some juice from a jalepeno can (per suggestion of other reviewer), season salt, lemon AND lime. ALSO, and this was the biggest thing: Clamato or whatever the bottled tomato/clam juice is in most stores has as ingredients: Water, high fructose corn syrup, tomato, blah blah blah chemicals, clam juice, in that order. I vetoed that. Instead, I used tomato juice and got an 8 ounce bottle of clam juice and combined them. I added a bit of agave to try to imitate the sweetness I imagine the canned stuff had. But, to be honest, I don't know if I'd add the agave (or that much) in the future. Maybe only a few tablespoons rather than nearly a quarter cup! Anyway, it is excellent. YUM YUM YUM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hhinative"
},
"reviewBody": "It was good. I added Valentina hot sauce, it has a wonderful flavor. I also will use half clamato and half tomato juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "I used my Cuisinart to chop everything, the texture was great, and the flavors were very full. I added some Tobasco Sauce and Lemon Pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilybryan84"
},
"reviewBody": "was great i will be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danah"
},
"reviewBody": "I made this over the summer and it was delicious! Cant wait to make it again when the weather warms up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Jennifer"
},
"reviewBody": "This recipe was SO great! I will definitely make it again. I could not use the Clamato or any other premixed clam/tomato drink because I'm allergic to MSG- so I used V8 and added a couple of handfuls of steamed clams for extra fish flavor. It was perfect. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooks4forty"
},
"reviewBody": "Very good. A nice way to turn garden veggies into a refreshing meal. I used V-8 (will try Clamato next time), and added worchestershire sauce - but I think I'll leave out the sauce next time. Didn't have avocado, and served with a dollop of sour cream. I added a jalapeno, but will probably just use jalapeno hot sauce next time. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose G"
},
"reviewBody": "This is completely lovely! It is just perfect for any number of occasions - but especially a summer evening. The fresh vegetables make a beautiful presentation - and the flavor matches. I cut the shrimp in half to better fit in a spoon and added some hot sauce. It was served with green chili cornbread. Yum! This is a winner, I've already passed this on to friends.\n\nI have to thank Dawn again! I have made this many times. It's definitely a summer favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rhonda Wood"
},
"reviewBody": "This was VERY good and incredibly refreshing! I tried cutting the recipe in 1/2, but it was so chockful of chunky goodness, that I ended up using the full amount of the Clamato juice. I had about 1/2 a yellow &amp; 1/2 an orange bell pepper, so I diced and threw them in; the only other change I made was that I also added Tapatio Mexican hot sauce (probably about 2 T. in the end) and I upped the salt and pepper to taste. So, so good! Toss in a splash of vodka, and it could be a savory Blood Mary-Sangria hybrid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoveyfox"
},
"reviewBody": "Delicious!!!! I added 2 tablespoons of worcestershire sauce and celery salt and cayenne pepper to taste. Makes for a perfect lunch or even an appetizer when served in small portions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naedwards"
},
"reviewBody": "This was WONDERFUL! I grew up eating this and it tastes just like my dad used to make. I scaled it down and used what I had on hand. I used a 46 oz of V8 vegetable tomato juice, 1 cucumber, 1 avocado, 1lb of cooked, frozen shrimp that I defrosted under cold water, half of a red onion, half bunch of cilantro, 1/4 lemon juice, salt, pepper and about 1/2 to 1 tsp of cayenne pepper as well as a tsp of worchestire sauce. It turned out so well. Be cautious if you choose to put cayenne in it. As I was making it, it didn't taste very spicy at all so I added a bit more but as it sat in the fridge to chill, the cayenne assumed its full potential and was hot. We love spicy food and it wasn't too spicy for us at all, but wanted to tell others in case they used it and couldn't taste the flavor as they were preparing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is almost identical to authentic Mexican Shrimp Cocktail. If you want to make it as such, add extra lime, a little salt to taste, and here's the trick: either add the juice of a can of jalepenos to taste (just the juice!) or a few dashes of Tapatio. I use both. All you need is a package of saltine crackers and a nice cold beer for the perfect summer treat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donald Myers"
},
"reviewBody": "This recipe is great as a starter - I used all tomato juice, salad shrimp, added 2 diced jalapeno peppers, 2 T. garlic powder, 2 T. Worchestershire sauce and about 10 T. hot sauce. My wife and I love our food spicy so we made these changes/additions. Great recipe - thanks Dawn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "I LOVED this dish. I added 1tbsp of garlic and 1tbsp of olive oil but it was just as good before I added them. I also cut my shrimp into bite sized pieces to get shrimp in every bite! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daidai"
},
"reviewBody": "I never thought about using avocados in soups before, so when I came across this recipe I was pleasantly surprised. The only thing different I did was leave out the cucumber, use mixed seafood instead of just shrimp, and make my own tomato soup base by stewing some tomatoes just covered in water with some garlic for 15 minutes and blending it with some leftover drainings from boiling the seafood. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Barbee"
},
"reviewBody": "Easy, and good. To one bowl I added some salsa. I might add black beans sometime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "IMVINTAGE"
},
"reviewBody": "I cut the recipe down to 4, I used frozen/thawed salad shrimp (otherwise I'd have given them a rough chop), I diced everything very fine &amp; I used cilantro-in-a-tube (about 2 tbps). I also added celery salt, a couple of tbp of EVOO, a tbp of worcestershire (figure it's good in bloody mary's so what the heck), some diced yellow bell pepper &amp; a smidgeon of hubby's hot sauce (it's garlic, serrano peppers, bell peppers &amp; onions, roasted &amp; pureed). I made it up &amp; let it meld in the fridge for a couple of hours &amp; then gave it a squeeze of lime before I served it in chilled bowls. This is a very filling, satisfying gazpacho ...all the accompaniments it needs is some toast &amp; a glass of sauvignon blanc. Thansk for a great recipe Dawn...we really enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANDREA"
},
"reviewBody": "THIS SOUP GETS AN A++++!!! I'VE BROUGHT IT TO SEVERAL FAMILY FUNCTIONS AND EVERYONE HAS RAVED ABOUT IT! I'VE ADDED MORE AVOCADOS BECAUSE MY HUSBAND LOVES THEM! YOU MAY ALSO WANT TO ADD SOME EXTRA SPICES LIKE SEASONED SALT OR MEXICAN SPICES!! A++++++++++!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/142970/shrimp-gazpacho/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14767/soups-stews-and-chili/soup/vegetable-soup/gazpacho/",
"name": "Gazpacho Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/142970/shrimp-gazpacho/",
"name": "Shrimp Gazpacho"
}
}
]
}
}
, "about": [
]
}
]