				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Shrimp Etoufee III"
,"datePublished": "2019-04-03T23:28:04.000-04:00"
,"dateModified": "2022-08-04T11:45:47.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Ronnie B"
,"url": "https://www.allrecipes.com/cook/208085"
}
]
,"description": "This is a great family recipe. Lots of plump, seasoned shrimp with onions, celery, and green bell pepper."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Ib-T2HMHteoavvRWjUkJng9lGIk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5125848-5403b47df6d7480499602a26188def9c.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Shrimp Etoufee III"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "82"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "369 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "287 mg"
,"fiberContent": "2 g"
,"proteinContent": "37 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "876 mg"
,"sugarContent": "4 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"4 pounds fresh shrimp, peeled and deveined",
"1 teaspoon salt",
"1 teaspoon ground black pepper",
"1 teaspoon crushed red pepper flakes",
"1 cup margarine, divided",
"2 cups minced onion",
"3 cups sliced celery",
"3 cups diced green bell pepper",
"2 tablespoons cornstarch",
"3.5 cups water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, combine the shrimp, salt, pepper, and red pepper flakes. Blend well. Cover and place in the refrigerator."
} ,{
"@type": "HowToStep"
,"text": "In a large pot over medium heat, melt 1/2 cup of margarine and add the onions. Saute the onions until they are translucent."
} ,{
"@type": "HowToStep"
,"text": "Stir in the celery and bell pepper. Increase the heat to high and stir occasionally for 20 minutes. Add the remaining 1/2 cup of margarine and bring to a boil. Fold in the shrimp and reduce heat to medium cook for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Mix the cornstarch and water together and slowly pour it into the pot; just covering the top of the shrimp mixture. Cook on medium/high heat until the celery is soft; about 20 minutes. Add any additional salt, pepper and red pepper flakes to taste."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel E. Marek"
},
"reviewBody": "I used the HEB blended creole seasoning vegetables (bell peppers onions &amp;a celery) to make things easier. Added a portion of crawfish to the mix also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colette Gillissie Wiest"
},
"reviewBody": "We have made this soooo many times I dont even need the recipe any more. I usually make smaller batches, not that a big batch would go to waste but my family would gorge themselves on it in one night... LOL. I use half the called for butter, and make a rue as well... tastes better to me then cornstarch... it is a favorite and we are glad to have expecially come fridays in lent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Michniak Pennington"
},
"reviewBody": "One thing I learned is you must make your roux the color of peanut butter and then all the flavores come out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "This is a good basic recipe. I customized it a bit by adding garlic(1 tsp), making a roux and using butter and olive oil. It was a little bland so next time I will add thyme,oregano, paprika and cajun spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Souriol"
},
"reviewBody": "Omitted the onions because I hate them with a passion and accidentally overcooked it until the peppers and celery were quite mushy and yet it still tasted amazing! I can't wait until I try it again and make it 'correctly'!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mrs. Patino"
},
"reviewBody": "yummmm!!! Just what I was wanting. thank you for the wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BoRoo"
},
"reviewBody": "I used butter instead of margarine. I used banana peppers instead of bell peppers (that’s what I had in my garden). I chopped the celery instead of slicing it. I cooked the onions in butter then added the celery and peppers then more butter. When all were soft, I added ½ cup of water and the shrimp. Instead of corn starch, while the shrimp were cooking, I made a roux with butter and flour and used chicken broth instead of water. When the shrimp were nearly done, I added the chicken broth gravy and cooked over medium heat until it reached the right consistency (probably 10 more minutes beyond the 20 minutes in the original recipe. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jaike"
},
"reviewBody": "Awesome Recipe, there were a few things that I amended to make it more authentic, i made a red roux with lard and flour instead of adding corn starch and i added parsley and garlic to round out the flavor. Every one loves this dish and this is definitely a grab \"seconds\" kind of dish. Oh and I also added thai chili oil to kick up the heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Marie Troch"
},
"reviewBody": "Super easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOM IN MISSOURI"
},
"reviewBody": "Awesome recipe. Delicious! The only thing I did differently was used a cajun spice mix to season the shrimp...everything was just as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennspud"
},
"reviewBody": "This recipe was fabulous! Instead of using 2 cups of water, I used two cups of chicken stock. I also added a cup of fresh mushroom just because I love veggies! I served the dish over rice, and I used chicken broth instead of water for that too. The only change I would make is to not cook the green peppers as long, the were a little soft for my taste. That being said, the base fort his dish could easily be made for a chicken dish as well. Over all GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mieshka"
},
"reviewBody": "I didn't make this to the proportion given in the recipe because I didn't have enough shrimp but it still tasted AMAZING! I added frozen okra because I love vegetables and since I was serving it on rice, I used the water from cleaning the rice instead of plain water. I also took another reviewer's advice and used chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wormosa"
},
"reviewBody": "was very good, i added paprika, aome rotel and scallops, turned out amazing UPDATE: it was better the second day... HEAVENLY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kacy"
},
"reviewBody": "Tasty! Followed recommendations to make a roux and add veggies. Also, used half amt of butter. Also added tsp. chicken boullion granules to water. Kids enjoyed as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim Cook Gillespie"
},
"reviewBody": "This was a super easy meal to impress the family. I doubled the vegetables and added half a can of tomato paste and chicken broth instead of water, yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VOODOOGIRL1"
},
"reviewBody": "the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "My husband liked it. I, on the other hand, wasn't a big fan. It's just not what I was expecting. It was just alright."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LeopardMoth"
},
"reviewBody": "Good basic etouffee. I'm from Baton Rouge, LA, so a few changes are necessary to make it authentic. The main change is to make a roux (flour browned in oil) instead of using cornstarch. Cornstarch changes the texture, and also does not add the deep flavor a roux does. The other change is more minor - butter instead of margarine, and also the amount cut to one stick of butter. I've made it with two sticks, and it is unnecessary. Still, a good recipe nonetheless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chris May"
},
"reviewBody": "I made this recipe recently, with a few necessary changes:\n\nAdd an amount of flour equal to the amount of butter (1 cup in the original recipe) to the butter over medium heat for about 20 minutes (and the mixture is the color of peanut butter), stirring contantly, before adding the celery, pepper and onion. This forms a roux, the essential building block of etoufee. I'd also add 1/2 cup white wine and a good amount (3 tablespoons+) of Tabasco or Crystal hot sauce. Garnish with thinly sliced green onions and serve with garlic bread. Making these quick changes to the recipe results in a 5 star recipe that's much closer to the real deal in Louisiana."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scubanut"
},
"reviewBody": "This recipe is delicious. I made it for the first time tonight and my wife really loved it. I used chicken broth instead of water. I also added just a smidgen of fresh ground ginger and garlic to give it some zing. I served it over jasmine rice. The kitchen smelled Cajun by the time I was done. Give it a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EAULLERY"
},
"reviewBody": "I loved this recipe! I only used a total of 1/2 cup margarine to lower the fat content, but it was still great! Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennette Paul"
},
"reviewBody": "My first attempt at etoufee and I was pleased. It doesn't look very appetizing, but it's a tastey and filling meal. I halved the recipe and added brown rice. The butter flavor was too much for me so I will be sure to use less next time... it's really not necessary. The kids enjoyed it (which was a shocker to me), I'm sure that I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VTHokiePokey"
},
"reviewBody": "I have to admit, I was skeptical that this was going to turn out well, but it was great! I used broth instead of water.\nA word of caution to anyone who, like me, was scaling this down to 4 or so servings... you really don't need to cook the pepper/onion/celery mixture for 20 mins. Maybe more like 12. And then after you put in the shrimp, broth, and cornstarch, you probably only need another 5 mins (or less!) of cooking for this dish to be done. \nIt's great served over rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Bruce Hernandez"
},
"reviewBody": "Really good. Mine was not a pretty brown like the pic but it tasted good. I added garlic, a little lemon and some white wine (1/4 cup). Its a keeper. I may try a roux next time instead of cornstarch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katharine Tuck"
},
"reviewBody": "not for us..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MONKEY235"
},
"reviewBody": "This was very good. I made some changes though. I made it for 4 instead of 10 servings. Used a can of diced chiles instead of green pepper, added a can of black beans, and used beef broth (it's what I had) instead of water. It had chowder-y taste but was less creamy. Overall very good, I would make it again and would add some rice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Colver"
},
"reviewBody": "very, very good. However I did change it just a bit. Added chicken boulion instead of water. And don't turn it on high to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cyndi"
},
"reviewBody": "It was ok...It had a funny texture to me. But it tasted fine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brad DeShong"
},
"reviewBody": "The changes I made in this recipe were to roast the bell peppers before adding them to the mix, and adding three cloves of garlic to the onions. The resulting dish was delicious, and though I missed the dark roux flavor in traditional etoufee, I will make this dish again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTB"
},
"reviewBody": "Totally awesome! My family loves it. I also made this dish for a luncheon at work back in February and it was a huge hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAIA22"
},
"reviewBody": "Incredibly rich and delicious. My boyfriend actually said, \"This is a 5-star meal!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shopclk"
},
"reviewBody": "This was a delicious meal. I server id with basmati brown rice and it was a hit with everyone, even my picky 22 year old daughter! The only change I made was to use chicken broth and add some extra cornstarch to try to thicken it some. I think I would use less broth/water next. BTW - I used XL shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bucket of cookies"
},
"reviewBody": "SO SO GOOD YOU HAVE TO TRY THIS IT MADE ME THINK ABOUT GUMBO I AM FROM NEW ORLEANS LA AND THIS TASTED JUST LIKE HOME AND LIKE I WAS SAYING I WISH I COULD HAVE GIVEN IT MORE STARS. THANK SO MUCH FOR A EASY AND VERY GOOD RECIPE MY FAMILY LOVE IT.....TERRY137"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "noodles"
},
"reviewBody": "yummy! I have made this a couple of times and my husband can not wait until I make it again. thankyou!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitty"
},
"reviewBody": "easy and delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sonni"
},
"reviewBody": "As far as Etouffee goes, this is probably a good recipe but we thought the flavor of this dish was just ok.\nI will most likely go ahead and make a Jambalya next time so that the Cajun seasonings can perk it up a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi S."
},
"reviewBody": "This is the first time I have made shrimp etoufee. The recipe was absolutely delicious. I used butter instead of margarine, chicken broth instead of water, and doubled the amount of cornstarch because I wanted a thicker consistency. My husband and I loved it. Thanks for the recipe Ronnie. It was a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mimi Lareux"
},
"reviewBody": "Absolutely wonderful recipe..I made a few alterations. I omitted the celery and I used chicken boullion base to mix with the water that was required. Turned out absolutely perfect. My fiance almost ate the whole pot and hid the rest in the back of the fridge so that no one would get it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LL"
},
"reviewBody": "I should of cut the butter- will try it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPOTTYSCOTTIEGIRL"
},
"reviewBody": "Flavor is outstanding (even better the day after). I made 2 changes: I used half shrimp and half crawdads, and used butter instead of margarine. It was Dee-lish. However, the recipe as written is a little soupy for our tastes; we prefer a sturdier etouffee.. (but it was nothing a little extra cornstarch or wondra couldn't remedy). I think I AT LEAST doubled the amount of cornstarch for a thicker consistency. A highly recommended recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kehn"
},
"reviewBody": "This was very very good! Next time I make it I will change a few things. It had way to much butter in it. I would make a roux to cook the onions, bell pepper and celery in then you would not need the cornstarch. And with the roux you don't need 2 sticks of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "almondjoy2807"
},
"reviewBody": "The only reason I'm not rating it a 5 is because my first attempt was a disaster! It says after you add in the celery and peppers to turn the heat up to high and stir occasionally. I ended up burning them so badly that they were black and stuck to my pan, my smoke alarm went off, and even with all the windows open, it still took a few hours to \"dehaze\" my house. The next time, I only turned it to the low side of med-high, and it still almost burned, and I had to stir it a LOT! But, in the end, it tasted AMAZING and we all loved it!! It was really easy, and the outcome was delicious! Its worth the effort, I would just recommend not turning the heat up past med-high."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Veronica Rockett"
},
"reviewBody": "Really good recipie. Turned out great with a few modifications. I made a shrimp stock first and used that instead of water. I also added a can of white crab meat too. Only thing I would change is the amount of celery. I think it was a tad bit too much, but then again I am not a huge fan of celery either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharyn"
},
"reviewBody": "My husband doesn't like cajun food, so I told him it was \"spicy shrimp\". He loved it! Easy to make. Didn't change the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandingo"
},
"reviewBody": "This turned out wonderful. EXACTLY like my Mississippi in-laws recipe that I could never seem to get right by their directions. I scaled back the recipe for 5. I added more corn starch than called for... it was a bit soupy at first but adding about 1 1/2 tsp more made it just the right consistency. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kel"
},
"reviewBody": "Fantastic! The whole family loved this one. Even my 6 yr old ate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mdelduke"
},
"reviewBody": "This recipe was very good. I cut the recipe in half, substituted potatoe starch for corn starch (all I had on hand) and added a bay leaf and 1 tablespoon Worcestershire sauce. Wife and kids loved it. I'm having leftovers tomorrow for lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSAN201"
},
"reviewBody": "I had never had this dish before but I will definitely make again! It was so good! I cut it back to 4 serving since it's just two of us. I was a little nervous on how this was going to turn out...since I had cut the serving back it only called for 1/3 cup of butter but in the directions it says to add 1/2 cup of butter in the beginning and then another 1/2 cup later on so I wasn't sure how much to add....ended up just sticking with the 1/3 cup and adding half at a time and it turned out wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kcnflman"
},
"reviewBody": "Simply heavenly, resteraunt quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PHILLYJH"
},
"reviewBody": "My Hubby liked and that's all that matters!!!:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coney"
},
"reviewBody": "Absolutely wonderful. I worked at Joe's Crab Shack for awhile, and this tasted exactly like their crawfish etoufee. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Bee"
},
"reviewBody": "Due to lack of the fresh ingredients (heavy snow fall) I didn't have fresh vegetables so I used (thawed) frozen cooked shrimp and frozen spagetti vegetables (celery, onion, red &amp; green peppers and diced carrot). Turned out great and so simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANE183"
},
"reviewBody": "GREAT RECIPE! You get such a nice heat from the red pepper flakes. I had my father over for dinner and he kept commenting on what a treat this meal was. The sauce is quite thick and flavorful. Served it with rice to help balance the richness and give the taste buds a rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamamuggle"
},
"reviewBody": "Excellent eating, and really quite easy to prepare. I doubled the red pepper flakes and added some cajun seasoning I had on hand and it was terrific. My bf said it could have been hotter, but he likes things VERY hot... I thought the heat was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MichelleK"
},
"reviewBody": "Very good. I added some cajun, garlic and paprika powder for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosa"
},
"reviewBody": "This is by far the best recipe that I have come across for Shrimp Etoufee to date!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Beliveau"
},
"reviewBody": "This recipe was great. All 6 of us ate this with no complaints. Thanks for such a great recipe. I will make this all the time now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINDY159"
},
"reviewBody": "Excellent! I fixed this dish for my family and everyone asked for the recipe. Thanks for sharing Ronnie B."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSROOTZ"
},
"reviewBody": "Delicious! I added paprika to the recipe, I just love the flavor of it and I saw the addition of paprika in another recipe on this site. I served over brown rice. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNN39SCAF"
},
"reviewBody": "I made this on a day that it snowed over a foot. After 2 hours of shoveling and digging out I came in and had this, It was the perfect way to warm up. The broth was sweet from the peppers and onions and there was a slight heat from the red pepper. Absolutely fantastic. Will definitely make it again, especially when I want to warm up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MSTIREWALT"
},
"reviewBody": "A little involved preparation, but rewarding with incredibly delicious meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOE15OFHP"
},
"reviewBody": "This recipe was pretty good. It tastes a lot like Jumbalaya. It just looks different. I added a bit more red pepper and added some cajun seasoning. It was a bit too spicy for me but everyone else loved it. It went very well with noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JILLYBEAN1026"
},
"reviewBody": "This was a FANTASTIC recipe! I actually added about 1 tsp. more cornstarch and also a diced jalepeno to add more heat as my family enjoys spicy food, but it definitely got rave reviews! It's also one of those dishes that gets better the next day and it reheated very well. My family will be moving to Louisiana next spring and I've been looking for some great cajun recipes - this is one I'll be proud to serve down in \"the big easy\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flashsmith"
},
"reviewBody": "Made this for a dinner gathering and everyone had seconds! So simple and so delicious! I added more mushrooms and a little fresh parsley.Unlike a lot of seafood dishes that don't taste good reheated, my husband said this etoufee was better the next day! I will make this again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELY C."
},
"reviewBody": "Use your common sense when scaling this recipe for less servings. I scaled to 4 and it didn't seem to differ much from the original recipe for 12.\r\nOverall this is a great recipe, I served it over noodles and everyone loved it. Is a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely fantastic!! I used to make shrimp etoufee from a mix that a friend of mine from Louisiana introduced me too. He said it tasted just like authentic etoufee from \"the big easy\". Since the Army moved my husband and I to Hawaii, I've been unable to find the mix. I've had a terrible craving for it, so I decided to try to find a recipe. This was as good if not better than the mix, and I was sooo proud of myself for making it from scratch. It really hit the spot...thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had my inlaws over for a Mardi Gras Dinner and we all loved this dish. I ended up using chicken broth instead of water and also made 1/2 of it with chicken and the other 1/2 shrimp. Both versions turned out great. It goes great over rice. Will definitely be making again in the near future. Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have to say this is the best. A cajun restaurant closed last year and they had the best shrimp etoufee I had ever had. This is identical. I made it for my girlfriends and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "man, this stuff was great -- took a little while and as with most soups and etoufees, it gets better the longer you cook it. it was perfect and pretty easy to cook. congrats to Ronnie B from all of my friends and myself."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24513/shrimp-etoufee-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1425/soups-stews-and-chili/stews/etouffee/",
"name": "Etouffee Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24513/shrimp-etoufee-iii/",
"name": "Shrimp Etoufee III"
}
}
]
}
}
, "about": [
]
}
]