				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Shrimp, Sausage, and Fish Jambalaya"
,"datePublished": "2019-04-02T02:56:18.000-04:00"
,"dateModified": "2022-12-06T12:46:38.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Baron"
,"url": "https://www.allrecipes.com/cook/baron"
}
]
,"description": "This seafood jambalaya combines shrimp, cod fillets, and andouille sausage in a well-seasoned rice and tomato mixture for one pot of deliciousness."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BAPuJAhheprv_y2-JAnDsDtQPq8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/831480-661bcd09e84c49928eed4022eae98ae9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Shrimp, Sausage, and Fish Jambalaya"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "106"
}
,"cookTime": "PT70M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "622 kcal"
,"carbohydrateContent": "67 g"
,"cholesterolContent": "157 mg"
,"fiberContent": "4 g"
,"proteinContent": "35 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1880 mg"
,"sugarContent": "8 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"0.25 cup butter",
"10 ounces andouille sausage, halved lengthwise and cut into 1/4-inch half-moons",
"1 cup diced onion",
"1 cup diced celery",
"1 cup diced green bell pepper",
"1.5 teaspoons minced garlic",
"1 (6 ounce) can tomato paste",
"1 (14.5 ounce) can diced tomatoes",
"2 teaspoons Worcestershire sauce (such as Lea & Perrins®)",
"1.5 teaspoons Cajun seasoning (such as Tony Chachere's), or to taste",
"0.5 teaspoon ground black pepper",
"4 cups low-sodium chicken broth",
"2 cups medium-grain rice",
"0.75 pound shrimp, peeled and deveined",
"0.75 pound cod fillets, cut into 1 1/2-inch chunks",
"salt to taste",
"0.33333334326744 cup chopped fresh parsley" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a heavy-bottomed pot over medium-high heat. Cook andouille sausage in the melted butter until completely browned, about 5 minutes. Remove the sausage with a slotted spoon to a plate lined with paper towel."
} ,{
"@type": "HowToStep"
,"text": "Add onion, celery, and green bell pepper to the butter remaining in the pot; cook and stir until onion becomes translucent, 5 to 10 minutes. Add garlic; cook and stir together for 1 minute. Stir in tomato paste; cook and stir another 3 to 5 minutes."
} ,{
"@type": "HowToStep"
,"text": "Return andouille sausage to the pot along with diced tomatoes, Worcestershire sauce, Cajun seasoning, and black pepper; stir to combine. Pour chicken broth over the sausage mixture; bring to a boil."
} ,{
"@type": "HowToStep"
,"text": "Stir in rice; reduce heat to medium-low, cover, and cook until rice is tender, 25 to 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add shrimp and cod; increase heat to medium-high and bring to a boil. Reduce heat again to medium-low and cook uncovered for another 10 minutes, stirring occasionally."
} ,{
"@type": "HowToStep"
,"text": "Season with salt and fold parsley into the jambalaya to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Really delicious and easy to make! I couldn't really taste the cod or shrimp very well, but still ended up delicious. I added 2 bay leaves, cayenne, and some more hot sauce to give it that kick it needs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay W"
},
"reviewBody": "The tomato paste really makes this very different from your standard jambalaya. I would probably omit next time I make this, or perhaps add only half (if using from a tube instead of a can). It definitely makes it \"stand out\", so there's no harm in including it, though. Cod is the perfect fish to use for this recipe, absolutely brings everything together and shouldn't be \"optional\" in my honest opinion (or else why not just use a standard jambalaya recipe). I also added corn on the cob halves in with the fish. Definitely needs to simmer at least 15 min for the corn to cook, but the fish/shrimp did not get overcooked at all. Also added about 1.5 cups more broth in with the rice. Half seafood broth, half chicken broth would be great for this recipe. The real failing of this recipe as posted is the suggested spice mix. First, add a couple bay leaves. But the suggested name brand seasoning mix is SERIOUSLY lacking flavor and no one should use it just because this recipe lists it! Just look up a proper cajun/creole seasoning recipe, especially one that contains oregano and thyme. And if it still doesn't taste \"right\", when in doubt, add a little Accent/MSG."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "optizoid"
},
"reviewBody": "This recipe was fantastic! I did leave out the cod but I added plenty of shrimp, and we didn't miss it. Otherwise, I followed the recipe as written. My husband raved about how delicious it was and we will be making it again many times in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KufPu"
},
"reviewBody": "This was delicious. Instead of the fish I used a 1 lb. package of crawfish tail meat, which I think made it more Cajun. Even my 17 year old son loved it, and he's a picky eater."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "I added scallions instead of parsley at the end and instead of cod fish i added white bass fish. The dish was delicious. A great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monique Dionne Conard"
},
"reviewBody": "So quick, easy, and delicious! This was my first time making it and this recipe is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dusty Santos"
},
"reviewBody": "Love it! Highly recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diana Taylor"
},
"reviewBody": "I didn't like this. I went by the recipe with no changes. The tomato paste gave it a sweet taste to me. I ate the shrimp fish ane sausage. I also had to add more broth. I won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen MW"
},
"reviewBody": "This is one of my \"go to\" recipes that I know the whole family will love. Big thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Ely"
},
"reviewBody": "very good. I also made the mistake of using jasmine rice, a long grained rice. i had to add more water then more cajain seasoning. i was still awesome! my new favorite receipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kenneth McGraw"
},
"reviewBody": "I used a little bit more Worcestershire sauce, 1.5 lb of shrimp with 1/2 lb scallops and lump crab meat as well. Aside from that everything else did the same and came out amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Ann Low"
},
"reviewBody": "Fabulous dish!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arizona Desert Flower"
},
"reviewBody": "This was fabulous! We added some cayenne pepper as we enjoy spicy food. I used half chicken stock, and half homemade shrimp stock. I had a pack of shelled crawfish, so I added that as well (with the shrimp). Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "Really enjoyed this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Filesi Siperek"
},
"reviewBody": "Definitely will be adding this to the regular meal rotation! Yum and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "I made this for my family and added crab legs there were no leftovers everyone loved it! Chopping onions, celery and peppers took the longest time otherwise pretty smooth sailing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brownymax6"
},
"reviewBody": "I added mussels and used seafood broth. I followed everyone else's comments and made sure everything was out and prepped before I started (including opening cans). It was easy and very flavorful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Hopper"
},
"reviewBody": "awesome! didn't change a thing. voignier wine sweetness complements. Awesome. maybe add crusty garlic bread. Not difficult. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle S"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelah"
},
"reviewBody": "Easy dish to make, I made this with what I had in the fridge and it turned out great. I used Aidells all natural sausage links."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KWPR"
},
"reviewBody": "This was really good! At the suggestions of other reviewers I used seafood stock (Better Than Bullion Seafood Base) instead of chicken broth. I also subbed scallops for the fish (had some scallops in the freezer). \nWe weren't ready to eat when the Jambalaya was finished cooking so we let it sit off heat with the cover on for about 20 minutes. I'm wondering how much that contributed to the rice being absolutely perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Besty23"
},
"reviewBody": "This was very tasty. Followed the recipe but had to substitute haddock for cod."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Bebout"
},
"reviewBody": "Wow. Made as directed and it turned out awesome. I had guests over and they loved it as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea "
},
"reviewBody": "I loved this recipe, due to allergies I didnt add the shrimp. And to keep it low carb instead of rice I used \"riced\" cauliflower. Turned out amazing!!! I had some chicken chorizo sausage on hand so I used that in place of the andouille sausage!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "This recipe was fantastic! I decided to add two teaspoons of cajun seasoning, two teaspoons of worchestershire sauce, seasoned all my seafood with sea salt and pepper before adding to the pot, and added the juice of one lemon. Aside from these minor seasoning changes, I followed the recipe exactly. The outcome was nothing short of delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hauszweihomes"
},
"reviewBody": "This was great! I had Cod and shrimp I needed to cook. Had Delia's Sausage (sorry, only in Atlanta) that I was having a hankering for. Google and saw this recipe and whamo! I like mine spicy so I added more Cayenne Pepper and red pepper flakes with a few drops of hot pepper sauce. Definitely keeping as part of the repertoire"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fun in the Kitchen"
},
"reviewBody": "This recipe makes fantastic Jambalaya. We took a few turns in favor of our ingredient list. We used Swai white fish, 14oz Andouille sausage &amp; lots of large shrimp. Also backed off on the rice a bit. We made a 2 cup stock base from the shrimp shells and used 4 cups chicken stock and that made a difference in flavor depth. also added more black pepper and cayenne pepper for more spice. This is 100% better than any restaurants over cooked over salted mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Davis Steele"
},
"reviewBody": "My daughter and I made this scrumptious dish. The entire family enjoyed it! Like others, we found the amount of chicken broth called for was insufficient. We used a combination of long grain and medium grain rice (I used up all I had left which came to 2 cups in total). I ended up making seafood stock by simmering the discarded shrimp shells in 2 cups of water. I added the 2 cups of seafood stock to the pot. We also doubled the Cajun seasoning and added red pepper flakes. It was delicious. I awarded 4 stars simply because the recipe as written didn't allow for enough liquid to properly cook the rice. All in all, a very good dish, and one we will be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elaine Bohlender"
},
"reviewBody": "This was very good.. and I will likely make again but adjust and cook the rice separately. Flavours were good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jchef"
},
"reviewBody": "It was my first time making Jambalaya, i followed this recipe as explained and it was yumm! My kids loved it. I used brown rice so i added 10 mins on the rice. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andsom"
},
"reviewBody": "Real yummy. Easy to make and ingredients are readily available in the supermarkets. Depending on your desire for heat, you can alter the amount of Cajun seasoning. I'm a light weight so I reduced it a little. The one step regarding no disturbing the rice, I think it needs some occasional stirring to keep the rice from sticking to the bottom and possible burn. Mine burned a little and it may be that the heat too high. Of course you don't want to stir too much or you end up breaking up the rice and creating a real mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BW1133"
},
"reviewBody": "Bar far the best Jambalaya recipe I have made to date. I used long grain rice and cooked according to directions. The rice was slightly underdone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherrob2"
},
"reviewBody": "I have tried a couple of other jambalaya recipes because this is something my husband always orders if it is on a restaurant menu. He immediately said this was a \"keeper\", just as good if not better than restaurant quality. For me, I would cook the rice a bit less next time (my mistake) and found that the fish sort of got lost in the mix., probably won't use it next time. And there WILL be a next time soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Zemmels"
},
"reviewBody": "This is a wonderful recipe. The secret to good Jambalaya is allowing the cooked meats and vegetables to steep in the water.Jambalaya always seems to require more liquid than normal rice dishes. I added two extra cups and the rice was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda eubanks"
},
"reviewBody": "Sauteed onions garlic peppers together.. Put all other ingredients together in pot except meat .. Cut time in half..used seafood stock as suggested and followed all other instructions as printed..very good..doubled recipe.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mannelinc"
},
"reviewBody": "Family enjoyed. Turned down the heat for 7 year old. Used long grain rice, just don't go out of the way to get medium grain when there are already many ingredients in jambalaya as is. Watched it and added 2 cups more of chicken broth around the time I put shrimp in. Rice stuck to pot shortly after putting in. I don't own one of those La Creuset type pots but think that maybe ideal. This is 2nd or third time I've made it. The ingredients are many but not far out from what I can easily obtain and already have on hand usually."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Hooker"
},
"reviewBody": "Good job. Taste great. Like home"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lyv"
},
"reviewBody": "This recipe is AMAZING. Everyone loved it and I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TOELESSINCA"
},
"reviewBody": "I followed the recipe almost exactly as written ( spices ramped up for my taste ). I used a dutch oven as noted by another reviewer. After the noted cooking time, I checked and it was sticking while the rice was still far from done. I added another cup of broth and checked that in 15 minutes. It was done but the texture was gummy. The flavor was excellent. My husband won't help finish it and I can't toss it. I'm going to freeze it in lunch sized portions for a lunch now and then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LYap"
},
"reviewBody": "I decided to try this recipe after reading all the positive reviews, even though I have a jambalaya recipe that I love. I followed the recipe exactly as written in spite of being skeptical about adding an entire can of tomato paste. In the end, it was just OK. The flavor was excellent and the andouille sausage really does make a difference but the consistency was off. The dish ended up being really sticky, saucy, and wet. The rice was completely cooked through but it was like a thick stew rather than the traditional jambalaya that I'm used to having. It might have been better to just use diced tomatoes because I think the tomato paste was what made it so thick. I'm going back to my original tried and true recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Guiles"
},
"reviewBody": "Very very good recipe! Followed exactly and even my boys love it. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet McGregor"
},
"reviewBody": "Oh my gosh Baron, this is one of the best recipes I have tried on Allrecipes and I've been on here for about 7-years. Thanks so much for doing all the testing and research for us. I don't think it could be better. I do have to say though I used smoked sausage instead of the andouille since that's what was available in the store. I will look for the andouille and try that too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Luevano Schuster"
},
"reviewBody": "This was excellent!! Will make it again and again :) I cooked sausage and diced chicken breast. Added shrimp later and skipped the Cod. It came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne"
},
"reviewBody": "My husband said this was one of the best recipes we've gotten off of this site. Made it pretty much as stated. Very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tomusko"
},
"reviewBody": "This was amazing! Added cubed turnips, just because I like them, and one boneless/skinless/chicken breast cubed. I also cheated, and instead of the white rice, I cooked up some Zatarain's cajun chicken flavored rice, then added it. Very spicy, but my family loved it! Thanks Baron!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Dresp"
},
"reviewBody": "Love the taste! My lid did NOT fit tightly, and I ended up having to add 3 1/2 Cups of water before the rice finished. As well, I used Jasmine rice; I'm not enough of a cook to know if that was the problem. However, water is easy, and the taste was terrific!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rox"
},
"reviewBody": "Fantastic flavor. My husband loved it, of course, he caught the fish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deborah McCarthy"
},
"reviewBody": "I'm not sure what I did wrong or if we are just not fans, but this didn't work well at all. I followed the recipe exactly, but the rice was crunchy no matter how long I cooked it, and the only flavors we really tasted were the cajun spices. No flavor at all when you bit into the shrimp or cod. Not completely knocking the recipe, it just didn't work out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULIAC"
},
"reviewBody": "This was wonderful straight from the pan but the leftovers the next day were amazing.\r\nI used chorizo as that is what I had in and threw in cubed white fish, squid, prawns and muscles 10 minutes before the end of cooking. Cannot recommend this recipe enough, many thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonus"
},
"reviewBody": "My family had a favorite recipe for jambalaya that we used for years but it was very labor intensive, requiring marinading the shrimp overnight. I recently hosted a special birthday party for ten guests so I doubled the recipe, and it was more than enough when served with artisan bread and a simple salad. I substituted pepperoni for the sausage because I prefer the flavor, and it is what my original recipe called for. I used the whole pepperoni stick (as opposed to the thin pre-sliced kind) and sliced it thickly. It added a nice kick to the recipe. I also used bay scallops in lieu of the cod because the guest of honor did not care for fish. The scallops were small and took only about five minutes to cook through. I also precooked the shrimp as I purchased two different kinds and I was uncertain that they would cook evenly. This turned out to be a good thing because I brought the shrimp to room temperature and added it to the finished product, only allowing it to heat through before serving. This resulted in the most tender shrimp... too often shrimp are overcooked and that makes them tough. Precooking the shrimp to perfection also permitted me better control over my serving time. Four of my guests had never had jambalaya before and raved about it. Everyone had seconds and there were still leftovers so it serves a very generous amount. I will never cook my original recipe again. This is my new go to with the modifications I outlined."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IamKristen"
},
"reviewBody": "I almost followed the recipe exactly. I omitted the celery, because I don't like it and used extra long grain white rice. I ended up having to add an additional cup of broth, because of the larger grain- no biggie. My husband loves it and is requesting it is added to the dinner rotation :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alecia "
},
"reviewBody": "So good! Made it with my family one night, now it's a tradition. Costco sells a shellfish variety pack that we like to add. Mmmmmm mmmmm good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soimhappy"
},
"reviewBody": "Absolutely delicious recipe. It is now on our current dinner cycle and the kids LOVE it. My son hates veggies, but he eats this up like it's McDonald's! Delicious and nutritious. I can't thank you enough for posting this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Corynne Cardona"
},
"reviewBody": "I have 3 teenage boys and one teenage girl and a husband who doesn't like veggies. But this recipe was a huge hit, fed the ravenous appetites of the kids and my husband even liked it, he picked out the onions and tomatoes. We had a lot left over too and it is a very tasty leftover. Not to spicy just enough heat. Will definitely be on the menu again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Perry"
},
"reviewBody": "Great dish. \r\n\r\nMakes a ton of food and freezes well.\r\n\r\nI didn't find andouille so I used spicy Italian pork sausage instead - turned out great. \r\n\r\nI used langoustine tails instead of shrimp because that's what I found freshest at the store. \r\n\r\nCod isn't my favorite fish so I might skip it next time and focus on the sausage/shrimp combo.\r\n\r\nAlso, I had to add almost two cups of water before adding the fish and seafood...it was drying out too fast and the rice got a little too mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan McDonald"
},
"reviewBody": "One word. FANTASTIC!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mvharnett"
},
"reviewBody": "This was amazing! I dare say I cannot cook, even when I closely follow recipes, but this was so easy and delicious I will definitely make it again. It was a big hit for my dinner guests and as a potluck offering. I substituted bay scallops for cod fish and because I love shrimp I used a whole pound instead of 3/4 and it was great. I used spicy chorizo sausage but next time I'll track down the andouille. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Helga Pals"
},
"reviewBody": "Wonderful ! \n\nI added smoked paprika, paprika, turmeric and cayenne pepper,\nI still found it a little to bland, but that is ok, I can always ad in my bowl, my kids loved it.\n \nVery easy, will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elysia & Dominick"
},
"reviewBody": "I have had jambalaya in a few restaurants, and I have always wanted to make my own. I added more black pepper and more cajun, because I like a good hard kick. I also added some cayenne pepper into the shrimp, because again I like the spice kick. The recipe was very good. My wife and I loved it, the kids, not so much, but they would prefer hamburger helper...so enough said. I added the rice on very low heat, in fact as low as it can go. The broth evaporated within 5 minutes and the rice was not even kind of cooked. I had to add two cups of water to give the rice a chance to cook and again the water was gone and the rice was still not quite cooked. I kept it covered and undisturbed. Not sure what went wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soxford63"
},
"reviewBody": "This was a wonderful dinner. The only thing I left out was cod, as I did not have it on hand. I felt that sausage and shrimp were sufficient for a good flavor. My husband loved this dish and ate it several times over the week, until it was gone. The only thing I might do different next time is cut out the hot sauce or try something more bland. We are older and cannot tolerate very hot spicy food anymore. Other than that, it was great. Thanks for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "petersd41"
},
"reviewBody": "Made this recipe for my wife's 74th birthday, and it turned out great. Forgot to add the parsley :), but otherwise did it by the recipe. The rice was perfect, and the shrimp were tender. The spice level was good for just about everyone. The andouille sausage aroma filled the house, and had our guests sniffing the air in anticipation when they walked in the door. Thanks to Baron for a wonderful meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cetch"
},
"reviewBody": "Very good recipe. I changed a few things and made it spicier, but the spirit of the dish remained. It really took the creole to heart with elements of Italian and Spanish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cocoflorida"
},
"reviewBody": "This was awesome, thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nola2000"
},
"reviewBody": "Very tasty dish; however the bottom of the pan started burning 22 minutes after adding the rice. So I advise a little more stock or possible it was that I used basmati long grain rice instead of medium grain. Anyway the dish was good and I lived in New Orleans for seventen years- so I know jambalaya."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ruth"
},
"reviewBody": "This was really good and I'm adding it to my recipe box before I forget which one it was :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Johanna Fontenot Hebert"
},
"reviewBody": "Just a few suggestions to improve the dish a little: You shouldn't need to add a fat to saute the sausage as it already has enough. I prefer a pure pork smoked sausage for this dish, but recognize that if you are not in south Louisiana, it may be difficult to obtain. Try an independent meat market and you may get lucky. I highly recommend stirring the raw rice in before adding your liquid--stir until every grain is coated with the oil from cooking the meats and seasonings; this will make the rice less sticky in the finished product. It is at this stage I would add in any seafood so that those flavors can mingle before the rice gets completely cooked. (After cooking rice for 25-30 minutes, there's no way you will get anything to \"boil\" again as stated in step 8.) Next, even \"red\" or Creole jambalaya is not usually this red; I have never heard of using tomato paste in place of tomatoes in jambalaya."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly"
},
"reviewBody": "Wonderful!!! Husband loved it. I substituted the fish with cut up, cooked chicken to suit our tastes. Really great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momofwillnwesntj"
},
"reviewBody": "This recipe was delicious. Not a bite left over! We like things a little spicier, so I added red pepper flakes. Glad I tried it. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aisrael"
},
"reviewBody": "Really tasty! I substituted okra for tomatoes and added a lot more of the cajon seasoning for spice. Topped with diced jalapeños and it was wonderful. Does the recipe call for cooked rice or dry? I cooked the rice first before adding to the pot. I also used only 3 cups of broth for a thicker stew. Next time I will dice the andouille sausage into smaller pieces so that each spoonful has the delicious bits. I choose to add the codfish and it very mild and had a nice texture. Definitely making this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "itsurplay"
},
"reviewBody": "I follwed the directions as written with exception of adding more for extra portions and it was ooh la la. I will definately make this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QUENBY"
},
"reviewBody": "My family has made this twice, and both times it has been fabulously tasty. We made it once with kielbasa instead of andouille, and it was just as good, with a slightly milder but yummy flavor that my small sons appreciated. Thanks for the recipe! (Oh, and try with seafood broth instead of chicken broth! Enhances the seafood flavor.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackbirdfly"
},
"reviewBody": "So easy and delicious. I made mine spicer by adding more hot sauce (sriacha) and peppers. Made a double batch to last a week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "This was my first time ever making jambalaya. I was so impressed with how this came out, it's probably one of my new favorite recipes. It's even better the next day heated up. My boyfriend loves anything creole flavored and he was blown away by the flavor in this dish. The only thing I changed was I added about a pound each of shrimp and cod, because I love them. Thank you for sharing this, it is tremendous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bkong"
},
"reviewBody": "I looked at this recipe and thought, wow, this looks complicated because of all the ingredients, but it wasn't as bad as I thought! Actually, it was pretty easy and tasted fantastic! Unfortunately we couldn't find andouille sausage, but we used chorizo instead. We also like a bit of heat added so we used some hot sauce after to spice it up. We are definitely adding this to our recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alicooks86"
},
"reviewBody": "i've made this once before, subbed the fish for pan fried scallops to put on top at the end... turned out amazingly. Making this again tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "philipweiss83"
},
"reviewBody": "So good it made me cry tears of joy. Seriously though, do the prep work before hand and you will save lots of time. I followed the recipe exactly as described (minus the diced tomatoes) and it came out perfect. The cod kind of disappeared and was absorbed into the jambalaya. I recommend jumbo shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rmh325"
},
"reviewBody": "Killer Recipe. I never did a jambalaya before and was craving shrimp. Couldn't find Andouille sausage so had to settle for Chorizo since this was last minute, and also didn't add white fish this time around (next time for sure). Turned out amazing, everyone really loved it. It seems no matter how much shrimp you put in, it's never enough. So be generous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kberi"
},
"reviewBody": "If I could give it more stars I would! I had some andouille sausage to use and thought I'd give this a try. I used halibut instead of cod and brown rice instead of white. I also added some shredded chicken breast at the end. \nThis was fantastic! My husband loved it, says it's better than the creole restaurant we usually go to for this kind of food. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irochka"
},
"reviewBody": "Excellent recipe! I had to stir the rice all the time because it was trying to burn even on a medium to small heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitney"
},
"reviewBody": "This is the best jambalaya recipe I've tried! Have already made it twice and rice comes out perfect each time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "My husband loved it. I didn't have a heavy bottom pot, so I ended up needing to put in 8 cups of chicken broth instead of 4. I reduced the pepper to 1/4 tsp and it was still SPICEY. I might reduce the Cajun spice to 1 tsp next time. And I might try Hillshire farms smoked turkey sausage instead of andouille sausage. My husband told me not to make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vince Lewis"
},
"reviewBody": "Perfect, the recipe in my mind was exactly this, thanks for writing it down for me. Fresh tomatoes (seeded) certainly can't hurt. 1/2 cup of sliced okra didn't hurt either :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Nickerson"
},
"reviewBody": "Wow! This was to die for!!! I made it extra spicy with extra chili powder, used brown rice, and a little less butter (this has so much flavor I didn't need the extra calories for the taste). My husband and I absolutely LOVED this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baron"
},
"reviewBody": "For Elysia &amp; Dominick; Not sure why you ran out of broth. Did you drain the tomatoes before you added them as I do not. Glad you liked the recipe. Some rice takes more liquid than others, still, it sounds like you had a significant problem but did a good job to work around it. I always have extra broth available when I make this dish as sometimes I need to add some. Thanks for trying the dish. Baron"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Cass"
},
"reviewBody": "My husband is a big jambalaya fan, and this recipe turned out perfectly. I often have problems getting the rice to cook correctly in my usual recipe, but I agree with the reviewer who described this dish as \"creamy.\" I did not have shrimp on hand, so I used 1-1/2 lb. of cod instead of 3/4 lb. My husband didn't care, as long as he got his andouille sausage! The spice level was perfect for my kids, but if you like it hot, you may want to kick it up a notch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ratana"
},
"reviewBody": "This is a great recipe! I made a few changes to mine.. I cooked the rice separately and added a couple cups of okra. Didn't have regular stewed tomatoes, so I I used chile flavored can I had on hand and it worked out well too. Nice and spicy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rkremer"
},
"reviewBody": "This is a fantastic jambalaya recipe. I used seafood broth instead of chicken broth. Ironically, the fresh Atlantic Cod, although \"optional\", was my favorite part - it was chewy and flaky and chunky and absorbed the flavor. The order in which this is prepared is perfect. A dash of red pepper flakes certainly doesn'y hurt, and if you prefer cilantro over parsley that's good too! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SugarDuJour"
},
"reviewBody": "I wanted to make this as written because it didn't have many reviews, but looked like a good recipe. It was very good! I did use brown rice, so I had to add another 1/2 cup of broth. I chose to wait and put the sausage back in with the shrimp, and I kept it covered the entire time, just because the rice I have takes longer to cook. I also added another 1/2 teaspoon of cajun seasoning because I like the heat, but other than that I followed the recipe. I really liked that it almost had a creaminess to it, and I served it with buttermilk cornbread muffins from this site. Don't let the list of ingredients fool you - this was super easy and didn't take as long as it states. I will definitely make this again, Thanks Baron!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Great recipe. Do the prepping work ahead of time and the recipe will come together easily. I made it exactly as the recipe calls for. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Thornton"
},
"reviewBody": "Very Good... This was very simple and so tastey. I made it just as the recipe states, except I used long grain rice.\n NOTE: Be careful after adding the rice and waiting 30-45 minutes, mine started to stick to the bottom. A Dutch-oven might be a better method of cooking if you don't have a very thick bottom pot. \n I added some heat to it just before eating and it was even better (My own preference) my wife and daughter don't like the hot spices!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missee58"
},
"reviewBody": "5"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220219/shrimp-sausage-and-fish-jambalaya/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1428/soups-stews-and-chili/stews/jambalaya/",
"name": "Jambalaya Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220219/shrimp-sausage-and-fish-jambalaya/",
"name": "Shrimp, Sausage, and Fish Jambalaya"
}
}
]
}
}
, "about": [
]
}
]