				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Shrimp Etouffee II"
,"datePublished": "2000-03-21T23:04:50.000-05:00"
,"dateModified": "2022-07-14T18:07:01.000-04:00"
,"author": [
{"@type": "Person"
,"name": "TEXICANTWIN"
,"url": "https://www.allrecipes.com/cook/43094"
}
]
,"description": "This is a very easy shrimp etouffe recipe that utilizes your microwave! I usually add four dashes of hot pepper sauce to the dish, but bring the hot stuff to the table in case someone wants a zestier dinner! This recipe is one I learned while going to school in southern Louisiana - Geaux Tigers!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bgAdwKqJT1FXD4LsE8TLQmIctXo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/478218-23fce3bf518d47769b9f374c43a9490a.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Shrimp Etouffee II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "322"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "195 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "119 mg"
,"fiberContent": "1 g"
,"proteinContent": "15 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "636 mg"
,"sugarContent": "3 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.25 cup margarine",
"0.5 cup chopped onion",
"0.5 cup chopped green onion",
"0.5 cup chopped green bell pepper",
"4 cloves minced garlic",
"0.5 cup celery, diced",
"0.5 cup chopped fresh parsley",
"3 tablespoons tomato paste",
"1 (10.75 ounce) can condensed cream of chicken soup",
"1 pound cleaned shrimp",
"salt to taste",
"0.25 teaspoon hot pepper sauce to taste",
"0.25 teaspoon cayenne pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a 2 quart microwave safe dish, combine margarine, onion, green onion, bell pepper, garlic and celery. Heat on High settings for 8 to 9 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in parsley, tomato paste, soup, shrimp, salt, hot pepper sauce and cayenne. Heat on High setting for 5 minutes. Stir and cook for another 5 minutes until mixture thickens. Serve over white rice."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "Gets rave reviews each time I make it. Super simple and easy. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DocTweetie"
},
"reviewBody": "I make this dish almost once a week. I follow the recipe exactly. However, I boil the shrimp tails in some of the chicken stock ( I think this was a Chef John suggestion) and I use only 1 pound of shrimp and add 1/2 pound of andouille sausage (only cooking for two people). This recipe is consistently delicious! Thank you Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Mann"
},
"reviewBody": "Wonderful! Much better than any other I've ever made. The only change I made was to cut the amount of garlic in half. I will be making this again but next time for family and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Gombar"
},
"reviewBody": "Didn’t have cream of chicken soup so used Cream of mushroom added a little sour cream and a dash of milk It’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hdlrp"
},
"reviewBody": "added crawfish tails and smoked sausage - family loved it, although a little hot for the hubby."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larogi"
},
"reviewBody": "Great flavor and fairly easy recipe to make. The fresh Ingredients are very nice!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mui Reiss"
},
"reviewBody": "Cooked this on stovetop because cooking things in the microwave weirds me out. Turned out absolutely delicious! (Used salted butter instead of margarine)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alk02g"
},
"reviewBody": "omitted salt, hot sauce, and parsley. Subbed Tony's for cayenne. Did it on the stovetop instead of microwave, and added thawed pre-cooked shrimp in during final couple minutes of stirring. Whole recipe probably needs 1.5-2 cups of rice, depending on the proportion you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reta mcmurtrey"
},
"reviewBody": "Everyone at my table enjoyed this dish. Made it a second time and left out the tomato paste and the hot sauce. Good either way. Served over noodles. Thank you for easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaV"
},
"reviewBody": "Love this dish and so easy to make. I also included andouille sausage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jingles"
},
"reviewBody": "This was the best dish I have ever made, EVER. Husband had 3 helpings. I woke up this morning just reliving making this remarkable dish. Read the reviews and used salsa instead of tomato paste because I had none. Used the Cajun spices from this site and boiled the shrimp in beer, also from this site. Put shrimp in pan just enough to rewarm it at the end. Cooked on stove because I need to see and taste food cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Benita N. Schramme"
},
"reviewBody": "I used butter instead of margarine and added a little white cooking wine. Simple and simply delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GingerGypsy"
},
"reviewBody": "I had to adjust this recipe because it didn't have nearly enough flavor, but I'll give it 4 Stars, because it wasn't bad, and provided a good start.\n\nI did not use a microwave. \n\nI mixed the soup, parsley and other seasonings together and let the shrimp sit in that for a couple of days. When it was time to cook, I sautéed the fresh ingredients in a cast iron skillet and then added the soup mixture to simmer. I thinned the sauce out just a little bit and served it over fettuccini pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Monaghan"
},
"reviewBody": "We all love this etoufee. Ok the can of soup that is usually a give away for an amature recipe was easliy replaced with a little heavy cream or half and half. I was out of celery so I used zucchini squash. I cooked on the stove top, mostly I dislike anything sophistacted that is cooked in a microwave. This recipe has good bones, tweak it a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this on the stove instead of the microwave, and it was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyCav12"
},
"reviewBody": "We really enjoy this! I use about 1.5 TBS of butter and make in a skillet pan on stove. I also use Healthy Request soup and add some Worcestershire sauce and creole seasoning per other reviewers. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charity Meals"
},
"reviewBody": "I don't like to cook, but I love good food. This recipe meets all of my criteria: easy, fast, and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ericksonpad"
},
"reviewBody": "This was okay. I enjoyed it, but wouldn't make it again. We pretty much followed the recipe, but it just isn't for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ajsha"
},
"reviewBody": "I made this tonight and it was awesome. I used shrimp and scallops( my boyfriend loves scallops). Used Badia Cajun seasoning and it turned out great. We have leftovers for tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheKnowles"
},
"reviewBody": "Awesome dish! My wife and I made it together, had a GREAT time and it tasted phenomenal!!! Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "telay21"
},
"reviewBody": "Delicious!!! I didn't change a thing..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrissis"
},
"reviewBody": "Not too spicy for the kids yet still yummy for adults. Surprisingly easy. I knew this was a hit when I overheard my husband sharing it with his mom over the phone, he was the cook on this one. The house did not stink of shrimp though I worried with using the micro that it would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "I made it tonight for dinner. Only changes i made was to add 2/3 cup white wine it was getting thick. Made it on the stove top, added a few shakes of Sriracha hot chili sauce. It was wonderful served over rice.great recipe it will be a monthly favorite.-Toni"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "funfood21"
},
"reviewBody": "used substitute for cream of chicken \n1 1/4 cups low sodium chicken broth\n2 tablespoons cornstarch\n1/3 cup nonfat dry milk powder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "India520"
},
"reviewBody": "I thought this tasted awesome. I admit that I've never had etoufee before and therefore I have no point of reference. That being said, as far as the taste, simplicity, and convenience of utilizing ingredients that are staples in our pantry/refrigerator, this recipe gets a ten! I doubled the recipe and realized too late that I only had one can of the soup but it still tasted great. Will definitely make this again. Thank you very much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Pope"
},
"reviewBody": "I tried this recipe, with substitutions and we loved it. Here is what I did different; I made a blond roux and added it to the broth mixture; instead of adding canned soup, I added 4 Tablespoons of creme fresche. I also added peeled crawfish tails that I purchased from the seafood dept, in addition to large Gullf shrimp. . I substituted no salt tomato sauce for tomato paste and added crawfish boil seasonings instead of pepper sauce or pepper. The final touch was, adding sautéed sweet yellow onions and garlic right at the end. Served with rice. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Adrian"
},
"reviewBody": "My partner and I loved this! Modifications I employed were adding a tblsp of Worcestershire sauce and a bay leaf as suggested by another user, a can of cream of celery soup, a cup of chicken stock, a cup of Pinot Grigio instead of the cream of chicken. My partner does not like spice but I do so i added paprika, garlic hot sauce, and a dash of salt. I also used unsalted butter rather than margarine. I have been to New Orleans, Baton Rouge, and Lafayette. This recipe is very comparable to the delicious delicacies of the French creole chefs there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tonja Grothe"
},
"reviewBody": "Tasted okay, but seemed like something was missing...I just figure out what it was. I added a little jalapeno juice, which helped some but didn't quite do it either. May make again, but just okay to us. My husband is from Louisiana so we've had Crawfish Etouffee, which was great! So maybe hard to compare...not sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tene Johnson"
},
"reviewBody": "This recipe is awesome! I've made it several times and everytime I get rave reviews. Whenever I make this I always cook it on the stovetop. Also, I modify it slightly by using 1/2 lb. of salad shrimp. I find it to works better when using it with grits or rice. I also use cream of chicken with herbs by Cambells. Finally, I use basil, garlic, and oregano tomato paste by Hunts. I find by substituting these few ingredients it makes the recipe more favorful. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Kimball Fitzgerald"
},
"reviewBody": "Tastes just like the etouffee I had in New Orleans on our honeymoon. Thanks for the great, easy and delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie D"
},
"reviewBody": "It tastes great and so easy to make!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Haze"
},
"reviewBody": "Wow! This was tasty.\r\nI kicked it up a notch with extra hot sauce, but you could definitely stick with original measurements and it would be great as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gerbear1991"
},
"reviewBody": "An amazing dish!! Very simple and able to cook it all in one dish so clean up was a jiff!! Thank you so much. ~Gerald!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gsironman6"
},
"reviewBody": "4 stars - I came in with low expectations (based on the fact that the idea doesn't use a roux, uses condensed soup, and can be made in a microwave), and was pleasantly surprised. \n\nI had an idea of what etouffee is supposed to look like, and this didn't match the picture I had in my head. I remember thinking \"etouffee is supposed to be reddish brown...something is wrong here...\" \n\nThat being said, I thought it was a very solid meal. The flavor was pretty true to the flavor profile I would expect. I was pleasantly surprised, and if you're pinched for time, this is definitely a good way to get your cajun fix. \n\nI would be sure to put in a bay leaf, add some cajun spice, and some worcestershire sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fabgamma46"
},
"reviewBody": "loved this and very easy to prepare, prepared this many times when I had guests and they loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TBEARSGHIA"
},
"reviewBody": "This dish was great! I thought I had parsley and it was cilantro by error, yet it was great. Oh I forgot to say it was super easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Cheney Samson"
},
"reviewBody": "This is so delicious and very easy to make! Instead of utilizing the microwave, I prefer to use the stove and saute everything. I use butter instead of margarine and add more garlic than what the recipe calls for but other than that, I follow the original. I keep it mild b/c I have two children but keep the hot sauce on the table to spice it up for my husband &amp; myself. Highly recommend this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie276"
},
"reviewBody": "This was SO yummy! I substituted the butter with a drizzle of olive oil and it was awesome. I also got the diced veggies from the salad bar at the grocery store. With that shortcut this is a super quick and easy meal. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TheCambodianCook"
},
"reviewBody": "We were disappointed, a can of cream of chicken should tell you...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "darthfergie"
},
"reviewBody": "I'm not really sure what I did wrong, but it ended up tasting like cream of chicken soup shrimp. One of the worst crash and burns I've made in a long time.\n\nBack to Shrimp Scampi for me sadly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christie Peña"
},
"reviewBody": "good! I was very skeptical because of the ease and microwave use, but don't be put off. It is delish! I actually didn't use the microwave but rather sauteeed the first 6 ingredients for a few minutes before adding the last six. It doesn't get any easier or more delicious. However, I chose to make my own cream of chicken soup because I don't like using canned stuff. Personal preference which I'm sure is not necessary. Enjoy! My family sure did! PS: To make this kid-friendly, I just scooped out a portion and cooked seperately before I added the cayenne and tabasco to the main pot. It still tasted good &amp; my 6 year old devoured it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SERENES"
},
"reviewBody": "I couldn't bring myself to microwave shrimp, so I did everything in a pan. It was bland and I added a lot of spice. It still just tasted like cream of chicken soup with spices in it. I only gave it two stars because I ate a few servings because i didn't want to waste the shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannine Ferrell"
},
"reviewBody": "This was sooooo good!!! My whole family loved it, I did cook it on the stove top only because I was a bit hesitant about microwaving it. But I am adding this one to my regular menu! Again VERY GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bella Galgano"
},
"reviewBody": "everyone liked this even my picky 10 year old who says he doesn't like shrimp"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "I went easy on the onion and changed the shrimp to chicken, and it is fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thardy"
},
"reviewBody": "I decided to try this recipe for my twin daughters' 20th birthday dinner. I had never cooked etoufee before but after reading the reviews I thought I would give it a try. This was VERY easy and tasted amazing! All of their friends raved about it. The only change I made was to use crawfish instead of shrimp. Thanks for such a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karrie Lynn Helt"
},
"reviewBody": "Great dish! A lot of prep, but easy to make. I did add cilantro for an added flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "woodfairie"
},
"reviewBody": "Very yummy and flavorful. A little on the spicy side for little ones, but still went over well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "I made this last night on the stove top. I did not have hot sauce. I used red pepper flakes instead. I also added some sausage as well. This dish was fantastic!! My husband loved it too. It was easy and great. I will add this to the line-up. My husband even complimented me on dinner before going to bed and he RARELY does that so I know it was tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "powerhouse47"
},
"reviewBody": "Very tasty,easy and quik to prepare,I will be making this more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "honeyboo"
},
"reviewBody": "Really good! Made it exactly as written. Only cooked it on the stove instead of in the microwave, also doubled the recipe. Suggestions from my family was to cut the celery in half and add some cajun seasoning while cooking the vegis, we like it spicy!\nAlso I have a son who cant eat shrimp so I took a boneless chicken breast seasoned it with a little cajun seasoning, browned it in a pan with some butter and garlic put some of the sauce in the pan and simmered it until it was fully cooked. he loved it!!Just a suggestion for anyone that may have someone in their family with a shellfish allergy. Just make the sauce, put a little aside before adding the shrimp this way the whole family can enjoy this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgg0922"
},
"reviewBody": "very tasty!!!...will def make again...had to add a little water since it was so thick, but sooo good...give it a try folks and u will agree! thanks for posting!...God Bless!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ashleynwild"
},
"reviewBody": "I thought this recipe was great. I did however double it because it doesnt make that much. I also did one can of cream of shrimp and one chicken. I then put in a couple of bay leaves and some Tony chacheres. It came out better than I expected and my friends and family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lacey Belen"
},
"reviewBody": "This is pretty good. I halfed the hot sauce because I have younger children and I was worried about it being too spicy. I just put hot sauce on the table for people to add to their soup at their own discretion. At first it looks really thick, but then the shrimp shrink SIGNFICANTLY and it soup thins out, just a warning - this was my first soup with shrimp and I wasn't aware."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tastebud"
},
"reviewBody": "I had never so much as heard of an Etoufee, much less tasted it, but we just thought it was average and lacking in flavor. I did like the mixture of vegetables used and was surprised it could be microwaved. At any rate, we don't think it is good enough to cook again...if I did I would go for more of a tomato sauce with just a little lemon for a cleaner, brighter flavor and skip the cream soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Yates"
},
"reviewBody": "LOVE IT! I made this dish my significant other, his 15-year-old son, and me. I don't eat large servings and those two are what I'd consider normal eaters for men and, between the three of us, there was not a bit left! It wasn't that it didn't make six servings -- it's that it was so good! Still, I'd suggest making two servings for every person you mean to serve because it'll go fast! Like others here, I made it on the stovetop. I just don't like microwave cooking. I served it with a fragrant Jasmine rice which really added to the sensory experience of this delicious dish. The one-and-only reason I gave it four stars (instead of five) is that I could detect the very slight flavor of the chicken soup at times. Still...it's not enough to keep me from putting this in our regular rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brans2sassy"
},
"reviewBody": "This is a great base recipe. I'm giving it 4 stars b/c it needs a little more. I cooked the onion, bell pepper, &amp; celery for a lot longer than the recipe calls For bc I don't like super crunchy veggies in it. I also added Cajun seasoning to the butter/veggie mix while it cooked on the stove (not a fan of cookin in microwave). I also added more garlic bc we love garlic and I added Tabasco for more spice. Thanks for the recipe, it got me started!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Obie"
},
"reviewBody": "So close to being perfect to my taste buds. Cooked stove top. Followed the recipe pretty closely. Nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Randy Tisinger"
},
"reviewBody": "Outstanding and very simple to make _ Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sewmanygirls"
},
"reviewBody": "My whole family loved this meal. We did add cajun seasoning and some hot sauce as well as cooking it on the stovetop instead of the microwave and it was AMAZING! My oldest daughter, who is very finicky and didn't like shrimp, also loved this dish. We now make it every Thursday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andi Gleeson"
},
"reviewBody": "I cooked this on the stovetop and added a dash of this and that based on other reviews, but the basic recipe is great! Really easy to make and delicious. You'd never know canned soup is in there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miss Candace"
},
"reviewBody": "I loved this recipe! It was super fast and easy. I got the pre-chopped items from Wegmans. All I had to do was measure out the ingredients and in a flash I was done. I thoroughly recommend giving this recipe a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyra Allard"
},
"reviewBody": "I LOVED YOUR RECIPE!!! But I slighty adjusted to my taste, I dont eat meat so instead of the can of condensed cream of chicken soup I added a can of cream of mushroom soup. Instead of adding hot sauce I added a jalapeno, and added a bit of dry white wine. THANK YOU!!! it was great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgarciax18"
},
"reviewBody": "This recipe is great! Thank you for sharing. I made it last night for my family and everyone loved it! Great tasting &amp; easy to make. However I did add much more hot pepper sauce. I also added some Cajun spices, canned diced tomato, and two teaspoons of A1 Steak sauce (I didn't have Worcester sauce). My family and I love spicy foods so if you do too I would recommend the above additions as well! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KungFuJimmyChoo"
},
"reviewBody": "I followed the recipe exactly as shown and it was DE-LISH! ok, maybe I added a dash or 2 more of hot sauce :) I used the small salad size shrimp and served it over blackened tuna steaks &amp; brown rice with sauteed green beans for our veg. Washed it all down with an ice cold rasberry wheat beer - Abita Purple Haze. Easy prep, easier cleanup, this one is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sahra"
},
"reviewBody": "Really good and quick and easy to make. I only made a couple of substitutions. I used a combo of red and yellow pepper as we don't like green. I also used cajun seasoning instead of hot pepper sauce. I plan to freeze mine in a large muffin pan, then pop out the frozen etouffee \"muffins\" for quick fast meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carmon S. Eastwood"
},
"reviewBody": "As many others....I cooked it on the stove top and not in the microwave...I also added some creole seasoning for more flavor and a bit of heat. Also thinned it out a bit. Everyone loved it!!!! Tasted great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Grant-Braid"
},
"reviewBody": "An instant hit! My husband and my mother absolutely loved it. In fact, my mom has requested that I make it for her to take to work to share. Made it on the stove top. A quick, easy AND affordable weekday dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Haley Morgan"
},
"reviewBody": "Yum! This is a keeper! I only gave it 4 stars because I changed it slightly. It definatley needed 4 or 5 shakes of Worstershire Sauce and to be thinned out a little with Chicken Broth. Other than that I thought the heat was great. I actually added Tabasco for my husband because he likes it super hot. I also made it stovetop in a sauce pan since I don't really like cooking things in a microwave and it worked out great. I also used cooked shrimp and put them in the sauce to warm them up at the end. My only complaint is that there wasn't enough. I will try to double this recipe next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shonda Rodriguez"
},
"reviewBody": "This was an easy and very good recipe. I left out the hot sauce and cayenne pepper and it was still delicious! The only thing I added was water tothe chicken soup. The consistency was still a thick gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie H"
},
"reviewBody": "this recipe is so easy and good. I too used red peppers instead of green. I used dried parsley instead of fresh. I doubled the recipe but didn't double the garlic or the parsley. Everyone loved it! Will definately make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "Very good, but needed to add bay leaf. Next time I will cook all ingredients except shrimp for an hour to allow the flavors to blend (I cooked it over the stove and not in the microwave."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaurenJade"
},
"reviewBody": "THis is a fabulous recipe. I modified by using shrimp instead of crawfish and paprika instead of cumin. I also added chopped celery. DELISH!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwen328"
},
"reviewBody": "I made this recipe for a party booth competition at a BBQ cookoff. Of course Mardi Gras was the theme, one judge was from Louisiana, he said this was just like they make at home. He wanted the recipe. Everyone loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CBEST"
},
"reviewBody": "This was so easy to make and soooooo yummy!!! I made it on the stove top because my shrimp was already cooked, and it was still super easy. Just added the shrimp last, heat to almost boiling and poured it over the rice. Only made minor changes: used real butter, used both red &amp; green pepper and used a little cajun seasoning instead of cayenne pepper. Mmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LA Ranger"
},
"reviewBody": "I loved this, however I did make a few changes to the original recipe. I made this stovetop like others suggested and only added the shrimp (mine was cooked earlier) the last few minutes to warm through. I only had cream of celery soup so that it was I used. I also added about a cup of white wine and a sprinkling of cajun spices for extra kick. I served on rice with a side of asparagus. A light tasty meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LM"
},
"reviewBody": "Excellent. I made in a skillet. I used cooked frozen shrimp. I thawed the shrimp using warm water, patted it dry and added to the skillet. I cooked about five minutes until the shrimp was heated through. The next time I'll remove the tails before putting the shrimp into the skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbh985"
},
"reviewBody": "Wow....this is great! Easy and tasty, what a great combination!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "inounvme"
},
"reviewBody": "Wonderful! However, I used the stove top method no microwave for me. In all it may have taken an additional 15 minutes, but well worth it. Quick and easy. Even the kids liked this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea McKenzie Vyse"
},
"reviewBody": "I liked this reciepe alot, hubby even gave it a \"9 out of 10\", but in my opinion, it needed quite a bit of doctoring up, hence my 4 star. I made it as written (except stovetop), but was bland, so thats when I started making some of the changes other reviewers had suggested. I did at LEAST double (if not more than double) on my cayenne and hot pepper sauce, added some Old Bay Seasoning and a few shakes of Worchestershire sauce. Also added 1/2 cup white wine at the end to reach a nice consistancy. Served over brown rice. Would make again, but with the revisions. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mom2three"
},
"reviewBody": "Wow, this was AWESOME! I did take other's advice and added Cajun Seasoning &amp; Worcestershire Sauce and also cooked it on stove, not micro. Served over jasmine rice and it was outstanding. Will be a favorite shrimp recipe. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BJM5596"
},
"reviewBody": "Being in Florida I just couldn't bring myself to \"nuke\" my shrimp so, I compromised. I put my veggies and butter in the microwave and then transferred everything to the stove top. I did not have cream of chicken soup so I subbed golden cream of mushroom. I also used the \"toothpaste\" type of tomato paste. I thought it was pretty good but next time I will incorporate some other suggestions. I will definitely add the Cajun seasoning and maybe a little more hot sauce. I will make this again and soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Jewell"
},
"reviewBody": "Very good and just as good the next day.I mixed the left over rice with the shrimp and the left overs were yummy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nikkic"
},
"reviewBody": "This is very good. I do not use green onions, just more regular onion. I like it hot, and it's just right for us. I've made it in the microwave and on the stove top. Both ways are good, but the stove top will caramelize the veggies, which is a nice touch. I do add some water as it gets pretty thick. This is one of my go to recipes for a quick, spicy, good shrimp dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brownbetty2"
},
"reviewBody": "I cooked this the other night and my husband LOVED it and so did I. I cooked it on the stove top instead but it still turned out great.I will b making this again. YUM!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill0414"
},
"reviewBody": "Awesome!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "horsiechickmt"
},
"reviewBody": "My husband was intent on doing the same old frozen stir fry w/shrimp. My family does not like trying new things, but I do and I talked him into it. I did put the ingredients in a pan instead of the microwave, in fear of the frozen/thawed shrimp becoming rubbery. Followed the recipe except for kicking it up a few notches by doubling the ceyenne and chili. Then adding cajun spices to taste, and some milk to thin the sauce out a little. Definetly will cook this again, and my husband loved it, which is the worlds pickiest eater."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April K."
},
"reviewBody": "I admit I was very unsure about cooking the whole meal in the microwave but decided to follow the true recipe. It turned out fantastic! The shrimp were not \"rubbery\" at all. It was delicious and very enjoyable - especially since it all cooks in one dish. When I served the rice, we did add a few drops of worchestershire sauce to it for more flavor but no other changes. Can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "intellichick"
},
"reviewBody": "Great recipe. I doubled the cayenne and eyed the measurement for the hot sauce (used Tapatio). Did everything on the stove top (not a big fan of using my microwave for from-scratch cooking) as well. I had just a bit of water from my prep that went it, so others would probably need 1/4 cup of water to balance out the thickness of the broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tricia "
},
"reviewBody": "I omitted the cayenne and hot sauce for my family, but used all the other ingredients, I did it on the stove top and added five chicken legs in addition to the shrimp called for. The problem with doing on the stove top was that the sauce is thick so it began to stick to the pot. I added some water to compensate but still had a mean soaking to do to clean the pan. I though this was really good but over rice, it lost a lot of its flavor. Don't know how to remedy that except eat it w/out rice. Maybe next time we'll use brown rice which doesn't absorb stuff as much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARIBEL86"
},
"reviewBody": "I added red peppers instead of green and oregano instead of parsely as I didn't have any. Served it on top of white rice. It was pretty good but I'll try it exactly as is next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "young chef"
},
"reviewBody": "This recipe was amazing. I did it on the stove instead, and I substituted the green peppers for broccoli and it was amazing! It was like a party of ingredients in my mouth, I am very happy with this and am going to serve it to my parents for their anniversary tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "panamaqtpie"
},
"reviewBody": "I LOVED this recipe. It was so EASY to make. I served it with white rice and my friends enjoyed them with Ritz crackers. It was a very satisfying dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Morucci"
},
"reviewBody": "Yummm-Eeeee! I cooked this on the stove and added a little water and white wine at the end cuz it was very thick. I will make it again and again...everyone enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellycakes"
},
"reviewBody": "Very easy and VERY YUMMY.....big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allure"
},
"reviewBody": "This turned out great! I did add Cajun seasoning and a little Old Bay. And I used dried parsley instead of fresh because that is what I had. The sauce was delicious. It was just a tiny bit too thick for me so I just added a little water until I got the desired consistency. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie M."
},
"reviewBody": "I made this on the stove as well and added the shrimp last. Next time I will add other seafood, my husband loved this dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Farres"
},
"reviewBody": "This was an excellent dish that was almost too easy to make. Everyone who tryed it loved it. I did make a couple changes by using cream of shrimp soup and added scallops since I didn't have enough shrimp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdoan82"
},
"reviewBody": "I cooked this on the stovetop. this dish was yummy and spicy. very satisfying."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17999/shrimp-etouffee-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
"name": "Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1425/soups-stews-and-chili/stews/etouffee/",
"name": "Etouffee Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17999/shrimp-etouffee-ii/",
"name": "Shrimp Etouffee II"
}
}
]
}
}
, "about": [
]
}
]