				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Shrimp and Grits Louisiana Style"
,"datePublished": "2010-03-25T15:58:34.000-04:00"
,"dateModified": "2010-03-25T15:58:34.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Amber Taylor Futch"
,"url": "https://www.allrecipes.com/cook/4721282"
}
]
,"description": "Make luscious, creamy shrimp and grits for two with this quick Cajun-inspired recipe. It&#39;s perfect for a romantic breakfast."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/K6gbA6OXkuUJ3f0CoO7HqOhYjGQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1296334-e872b13b7f994296a78e0abc76bd3983.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Shrimp and Grits Louisiana Style"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "57"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "677 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "272 mg"
,"fiberContent": "1 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "30 g"
,"sodiumContent": "751 mg"
,"sugarContent": "1 g"
,"fatContent": "60 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 cup water",
"1 pinch salt",
"6 tablespoons grits",
"2 tablespoons olive oil",
"0.5 cup diced tasso ham",
"2 tablespoons diced onion",
"2 tablespoons diced green bell pepper",
"20 medium shrimp, peeled and deveined",
"0.25 cup white wine",
"1 cup heavy whipping cream",
"salt and ground black pepper to taste",
"1 tablespoon chopped green onion, green parts only" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring water and 1 pinch of salt to a boil in a saucepan and slowly mix in the grits, stirring constantly. Reduce heat to low and simmer grits until tender and smooth, about 20 minutes; stir often. Set aside and keep warm."
} ,{
"@type": "HowToStep"
,"text": "Heat olive oil in a large skillet over medium-high heat; cook and stir tasso ham until crisp. Stir in onion and green bell pepper and cook until onion is translucent, about 4 minutes. Lightly stir the shrimp with the vegetables and olive oil just until pink, 30 to 45 seconds; remove shrimp from pan and set aside."
} ,{
"@type": "HowToStep"
,"text": "Pour white wine into the skillet and stir, dissolving any browned bits of food in the bottom of the skillet; slowly add the cream, reduce heat to low, and simmer until thickened, about 10 minutes. Season with salt and black pepper."
} ,{
"@type": "HowToStep"
,"text": "Divide the grits onto 2 serving plates and line the edge of each plate with 10 shrimp. Pour cream sauce over grits and sprinkle each serving with chopped green onion tops."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Bulkley Deady"
},
"reviewBody": "My family literally licked the plate clean. My changes were I used bacon, half and half and sherry as substitutes. To me any recipe that allows you to make changes to suit your diet or budget and still tastes great is a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick"
},
"reviewBody": "Liked this better than a roux recipe. The only small change I made was, I used andouille sausage and put a bit of cream in the grits. Very good!! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phoebe Scarborough"
},
"reviewBody": "So easy and really lends itself to substitutions! I used stone ground corn flour, chopped turkey bacon and sliced hot dogs because that's all I had on hand and I really wanted to make this dish. Still came out delicious. I only had a few tblsps of half and half on hand, so I used chicken stock for all the liquids and added a small amount of cream to the grits and the gravy. I actually think it was better this way. I also threw in an extra tblsp of red bell pepper and the tiniest bit of chopped jalapeno to the gravy, and I used rosè instead of white wine because it was open. Can't believe how tasty it was. Believe it or not, I hate grits and grainy foods! But I ever since I tasted this dish during a trip to Charleston, I have been craving it. I just had to try making it at home. I've been making it every weekend since. I'm eating some of the leftovers right now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Milli Bee"
},
"reviewBody": "I followed recipe but added more wine for more sauce. I also put my cooked shrimp back into the sauce so it would be warm and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksolly"
},
"reviewBody": "I will definitely make this again. My whole family loves it. My only comment is that, even when I doubled the amounts, it barely made enough for three adults. It's so good, people wanted a larger portion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perry"
},
"reviewBody": "Oh my Gosh! This was rub the bowl with my finger good! I added a bit of cheese to the grits which improved on this delectable dish. Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeff Punch"
},
"reviewBody": "Very good. Everyone liked it. Next time I will add a little heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Milliganstew"
},
"reviewBody": "Quite good! An njoyable Friday Night dinner. I served it with fresh asparagus spears. I added a few red pepper flakes &amp; I used bacon instead of Tasso. Yummy, yummy &amp; smile as it sounds. Oh yes, I served it with a Novellum Chardonnay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelv1"
},
"reviewBody": "Used Gouda in grits. Whole family said they would pay 15/ per plate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "I used pancetta since I couldn't find Tasso. I also had quick cooking grits in the pantry, so I just followed package directions for 2 servings and made the grits while the cream sauce was reducing instead of at the beginning. Out of this world good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "I just came back from my first trip to New Orleans and came to understand what all the fuss was about. The grits down there are awesome! As a cooking-impaired northerner just getting into grits, this was a nice simple recipe. My wife and son gave a thumbs up.\n\nNext time, I'll cook the grits according to the recipe on the package. I had to add much more water than this recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marie Dukes Beaupre"
},
"reviewBody": "I loved this recipe! The only difference is I put heavy cream and cream cheese in my grits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The New Peacock Club"
},
"reviewBody": "This recipe is amazing. Thank you so much for sharing this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annelieseK"
},
"reviewBody": "My husband adores this, made as written, with only one exception - we use kielbasa sausage since it's hard to find tasso ham where we live."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smith family"
},
"reviewBody": "I made this for a bridal shower and I could not believe how people reacted! And the truth is, I actually changed the recipe because I ruined the wine sauce...so I made a basic cream sauce with the heavy cream, butter and flour separately. I tossed the ingredients together and put everything into the crock pot. By the time the dish was served at the shower - you can imagine all of those flavors! The mother of the bride asked me to make it again a week later. What a happy mistake! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "Came out amazing! I substituted bacon for tasso. The flavor was awesome. I'm from Louisiana, so this especially a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jojo13"
},
"reviewBody": "So my review is really going to be about the \"gravy\" as that was what I was most interested in when reading this recipe. For the Shrimp and Grits part: I always make my grits with a little garlic powder, salt, either half and half or heavy cream as it make a more creamy, smooth grit taste versus just water. And I just throw everything in the rice cooker, hit the button and walk away. I prefer not to have to stand over it. \nI cooked the shrimp separately for this recent Easter brunch due to some guest being allergic to seafood. \nFor the gravy. I followed the recipe, yellow and red peppers, garlic, onions etc, but used Andouille sausage instead of the Tasso Ham as my local grocery didn't carry Tasso. Turned out delicious. Guest were raving about it. Used it over the shrimp and grits as well as over the biscuits. Yumm! We will definitely be adding this into our gravy rotation.\n\nFor those that said the sauce didn't thicken, try adding a handful of regular or Panko breadcrumbs right before adding the cream and it will thicken right up . Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "walasaurus"
},
"reviewBody": "Absolutely deadly. I referenced the chef john version of this and kinda made a combo. An incredible combo, the family was blown away. I did stir the shrimp back into the sauce to bring them back up to temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "I loved this recipe. I didn't have heavy cream so used milk plus 1tbs flour to thicken the sauce. The shrimp were fresh and very favorable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ComerCastIron"
},
"reviewBody": "I had to alter the recipe because I wasn't going to just pour cream over it and serve. I was looking for a recipe to pay tribute to grits a bit more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Sims"
},
"reviewBody": "I made this because I had a box of grits sitting in my cabinet forever and my fiance said he would never eat grits. I knew if I cooked it into something flavorful he wouldn't realize what I was feeding him. Success! He now eats grits and I didn't waste food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Morgan Leanne"
},
"reviewBody": "Great recipe! I made it using salmon and mushrooms but no ham. Also, coconut oil instead of olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great Dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mfields214"
},
"reviewBody": "This is a great comfort food dish and it's really simple to make. I substituted andouille sausage for the Tasso ham. Also, I sautéed the shrimp in butter instead of olive oil. Make sure to add minced garlic to the shrimp sauté. Finally, I used a mixture of chicken stock and heavy cream (or half and half) to give the grits a more savory flavor and creamy texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Schulz"
},
"reviewBody": "First time I ever had shrimp and grits, it was very good. I thought maybe I didn't make enough grits but you don't need much. Very filling, yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "krystal"
},
"reviewBody": "Followed everything except amount of grits and water used...and switched from pork yo beef sausage...it was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanette Behrens Clifton"
},
"reviewBody": "okay..the cream/wine didn't thicken up or this thing would get 5 stars. I substituted sliced and diced turkey for the ham, and found out halfway through that out of the 8 bottles of wine we had on hand, absolutely ZERO were white - so, red cooking wine it was! It came out great! I used dehydrated chives and onion powder and even zinged it up a little with some cayenne on the shrimp. we still used the cream sauce, and mixed it into the grits, but it wasn't like a gravy. it still tasted awesome. for the grits, I used 4 packets of instant grits and boiled 2 cups of chicken broth. instant grits have never tasted so good! Thanks for the recipe! will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "danifromBK"
},
"reviewBody": "My first time making shrimp and grits. This recipe was easy to make. I didn't get Tasso ham so I subbed regular ham and some leftover breakfast pork sausage. I also added chopped garlic to the pan with the other veggies. Finally, I only gave 4 stars because I needed to thicken the sauce with a little flour and it tasted a little bland to me so I added garlic salt, pepper and Cajun seasoning. It was delicious and I'll definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George L. Paul"
},
"reviewBody": "This is a superb recipe. And not hard to make. Luckily we found tasso ham in Phoenix, but I wager it is good with the substitutes. The only change we made was to stir into the grits some high quality white cheddar cheese(shredded) at the very end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samma Sam"
},
"reviewBody": "its good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurena Averiel Champine"
},
"reviewBody": "I think that this was an awesome recipe. I didn't have the ham so I substituted with andouille sausage and it came out perfectly. the sauce is hearty but not too heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "Awesome! Reminds me of a dish I have every time I am in NOLA. Used instant grits to save time. I also used chorizo as I couldn't find ham. Also made fried green tomatoes to go with the dish. Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gwen G."
},
"reviewBody": "This is amazing shrimp and grits. It really hits the spot when craving some low country food. I made a few changes...I used Canadian bacon instead of the ham, Green onion and no green pepper. I added smoked gouda cheese (maybe 1/2 a cup) to the grits and a little chicken stock. I also added a sprinkle or two of white pepper. I took it to work for a coworker to try and her eyes rolled back in pleasure, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "I just used bacon, could not find the Tasso ham. The h"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janet long"
},
"reviewBody": "This is the second time making this recipie. My family loves it. I had to thicken the milk with some clerk starch though. It came out way to soupy. Also added son Tony Chacheres Creole seasoning. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara"
},
"reviewBody": "I loved this recipe it was my first time making it. I added my own flare instead of Tasso, I used bacon which goes with everything so well!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SimoneWithFive"
},
"reviewBody": "I liked that it was not a long ingredient list and I had most of the items already. The taste was good as well. My kids even enjoyed it. However, my sauce did not thicken so I didn't like the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gabriella Marie Bowman"
},
"reviewBody": "It was okay the shrimp was delicous hut the sauce was to milky!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Red7Sue"
},
"reviewBody": "I added garlic, and red instead of green peppers. I had no ham, so I used bacon instead. Wonderful. Oh, and I cooked the grits in my rice cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Baker"
},
"reviewBody": "My husband LOVED this, but he loves shrimp and grits. I would probably make it again just because my husband devoured it and I appreciate the low ingredient count, but it comes in second to my all-time favorite shrimp &amp; grits recipe. Tasso is hard to find so I substituted pancetta. Overall, a good one. Thanks for sharing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/220907/shrimp-and-grits-louisiana-style/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/223/side-dish/grains/",
"name": "Grain Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15899/side-dish/grains/grits/",
"name": "Grits"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/220907/shrimp-and-grits-louisiana-style/",
"name": "Shrimp and Grits Louisiana Style"
}
}
]
}
}
, "about": [
]
}
]