				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Six Egg Pound Cake"
,"datePublished": "1999-08-06T21:09:06.000-04:00"
,"dateModified": "2022-07-14T16:09:25.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Diane Dippolito"
,"url": "https://www.allrecipes.com/cook/24322900"
}
]
,"description": "This recipe for the best pound cake ever rises very high above all others thanks to the use of six eggs."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eNkBucap7JM-5zTv0BbG-3P-pkk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5277794-4bcaa45293f34338b178367d8f26b2a9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Six Egg Pound Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "153"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "449 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "133 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "364 mg"
,"sugarContent": "37 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"3 cups all-purpose flour",
"1 tablespoon baking powder",
"0.5 teaspoon salt",
"2.5 cups white sugar",
"1.5 cups butter",
"6 eggs",
"1.5 teaspoons vanilla extract",
"0.75 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Grease and flour a tube or Bundt® pan. Do not preheat oven."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, mix flour, baking powder and salt. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream sugar and butter until light and fluffy. Add eggs one at a time, mixing well after each addition. Add vanilla."
} ,{
"@type": "HowToStep"
,"text": "Add flour mixture alternately with milk. Beat until smooth. Pour batter into the prepared pan."
} ,{
"@type": "HowToStep"
,"text": "Place cake into cold oven, set the temperature to 350 degrees F (175 degrees C), and bake for 60 to 90 minutes, or until toothpick inserted into center of cake comes out clean."
} ]
,"recipeYield": ["14"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Francine C Hazell"
},
"reviewBody": "This is a beautiful cake I have not tasted it yet it is still in the oven it is rising up and looking good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great CAKE I have baked two of these and I am doing some for my son's school and bus driver for Thanksgiving. AWESOME!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Doubled this recipe. Made one half a lemon berry zest and the other a banana coffee. Both were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time ever baking a pound cake. A very easy and simple recipe. My wife loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dabneydenise"
},
"reviewBody": "This recipe was awesome as is. Made this cake twice already."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Klima"
},
"reviewBody": "It turned out amazing! Someone else posted to hand mix only as a stand mixer puts too much air into it and her cake overflowed. I used a stand mixer and that dd not happen with mine. First time making a pound cake and I will definitely use this recipe again, it smalls heavenly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Selena"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kendall lemons"
},
"reviewBody": "this is a very good base pound cake recipe and bakes very evenly. I made this for my foods class and was very easy and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Zeiner"
},
"reviewBody": "It's cooling now, but I wanted to note that I didn't have any spillage like I feared, my large bundt cake pan was perfect, but I did need to lower the rack on my oven, as it started to burn before the oven was even preheated, just on the middle rack. I also added poppyseeds, it would be cool to know when to add add-ins if we want. Also whe to turn it out of the pan. I can never remember if I should cool it or not. Also ideas for icing recipes. Looks and smells delicious! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Smith"
},
"reviewBody": "Delicious! Did not overflow. I used a large tube pan. I used 1.5 teaspoons lemon extract and the zest of 1 orange to give it a citrus flavor, instead of vanilla. I poked it with a skewer and while still warm, poured a lemon glaze on top and into the holes. Buttery, with a crusty sugar top, and moist and gooey where the glaze soaked in. My new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Linda J. Abramson"
},
"reviewBody": "I make cakes all the time....this pound cake was a total flop...I baked as directed and checked it at 60 minutes....took it out of the oven and put on a rack to cool....after it cooled I put it on a cake plate and half the cake fell apart...the cake is dry and tasteless....a real disappointment as I made it for company this weekend.....not sure what happened....as I said, I'm a pretty good baker. Perhaps 60 minutes was too long...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyR"
},
"reviewBody": "Excellent recipe and versatile as to what you want to add to it - chocolate chips, frosting, etc. I will make this many times. These simple ingredients are always in my house. Also, I did not have any issues with it flowing over in the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candy"
},
"reviewBody": "I followed the directions as written. Everyone loved it. This is certainly a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betty"
},
"reviewBody": "Delicious cake. I followed the recipe exactly and baked it in two loaf pans and had enough batter for 10 cupcakes. Sweet,light and moist."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josee Marchessault"
},
"reviewBody": "I just finished making this. I split the batter between 6 small paper loaves to give away as Christmas presents. I used eggnog instead of milk. I have baked a lot of cakes and have eaten even more in my 51 years on this earth but I have never had one so tender and tasty or with a finer crumb. A keeper! I will experiment with different flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bellpepper"
},
"reviewBody": "I substituted sour cream for the milk and topped the cake with a apricot brandy and sugar water mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maskys"
},
"reviewBody": "I don't change recipes I rate. Made this delicious pound cake as written and wouldn't change a thing. It was absolutely fabulous. Couldn't ask for a better, more moist, and scrumptious dessert. I did top it with the \"Easy Chocolate Bundt Cake Glaze,\" recipe found here on allrecipes; which was equally as good. Together, they make an amazing cake. My family couldn't get enough. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne Christensen"
},
"reviewBody": "This my first pound cake. I didnt change anything on the recipe. It made two bread loaves, beautifully brown, crisp as round the edge, light tasting for a fairly dense cake. Only needed to bake for 70 minutes in my oven at 325. I was impressed as were my friends who received a loaf also. Will definently be making again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Butler"
},
"reviewBody": "I was riding my bike home from the grocery store, when I saw a huge bump too late. CRACK went six eggs in their carton. I got home and looked for a recipe using six eggs. I am so glad I found this one!\nAfter reading some reviews, I made the following revisions:\n1 3/4 c white sugar, 1/2 cup brown for a less purely sweet taste.\nIn place of milk I used a light (not too thick) yogurt, which helped keep the cake nice and dense.\nI used a rectangular baking dish so I wouldn’t flood my tiny oven. I had spare batter for 10 cup-poundcakes. \nChocolate chips on top for cuteness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carries"
},
"reviewBody": "I follow the recipes as it is except for the Milk, I modified this recipe into a strawberry chocolate chip cake..instead of milk I used strawberry smoothie, add 1 cup of fresh strawberry cut into small pieces/chunks...and 1/2 cup chocolate chip, red food coloring to make it pink...it's so moist...definitely a keeper. It did leave a behive shape of cake on the baking sheet though...good for tester :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Richardson"
},
"reviewBody": "Great way to help use all those extra eggs! Always a crowd pleaser. Nice and moist. I generally use my lg bundt pan that I use for angle food cakes and it holds the full amount. I typically put a cookie sheet on the rack below the cake just in case anything goes over the top or leaks through the cracks on the 2-part bundt pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Greco"
},
"reviewBody": "Easy and Delish! Mine was done in one hour. I guess it all depends on your oven. Served it along with another cake for a birthday party and naturally everyone wanted the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheesecake4133"
},
"reviewBody": "This cake is absolutely delicious! My family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Randy Becker"
},
"reviewBody": "Dense and moist \nNext time will start checking doneness at 60 to 70 min 90 minutes too long"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "looking97123"
},
"reviewBody": "This cake turned out very chewy, it has good flavor but I don't know why it is so chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nancy"
},
"reviewBody": "I will be making this pound cake for the 6th time today. After reading the reviews the first time baking it I purchased a heavy duty deeper pound cake pan from Amazon. The only thing I changed 3 of the times was using lemon extract instead of vanilla. One of my older recipes used the lemon which everyone loved but was not as good as this recipe ! Never too old to make changes. The pan purchased was a tube pan described special for pound cakes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alba N. Cruz"
},
"reviewBody": "Very good in taste.... will do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette Gass"
},
"reviewBody": "This pound cake is golden brown mild glaze buttery goodness. I only added 2 teaspoons of baking powder and I used a 10 inch bundt cake pan. Also when I pour the batter in you have to take a flat small spatula and flatten the batter lightly in a circle so it bakes and rise evenly. I also left a 1/2 inch of space in the bundt pan when I poured the batter so the cake have room to rise and will not overflow. I topped mine with whip cream preferably lite whip cream because it's not sweet and strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorie C. Harding"
},
"reviewBody": "This pound cake turned out beautifully! I followed the recipe as is (with the exception of adding some lemon zest to the batter), and it baked up perfectly - no spill over whatsoever :) It took around 65 mins (give or take), which gave the top a nice crispy crust. At first, I thought it would be too sweet with the 2 1/2 cups of sugar, but it was just right. This is first pound cake recipe I've found that didn't include complicated directions or ingredients that I don't usually have on hand (ie. sour cream, buttermilk, yogurt), and I'll make it again and again. Thanks for posting the recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "imnotwright"
},
"reviewBody": "Make this cake using exact measurements, electric mixer and a 10-inch Bundt cake pan. Baked it for 55 minutes., since it didn't look done at 50. Cake was a little stiff for my taste but decent enough. I add pudding next time for moistness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tamiko Tomlinson"
},
"reviewBody": "The cake was so easy and the batter was light and fluffy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "adcc1978"
},
"reviewBody": "I made this twice on the same day and it rises great and tastes brilliant. Just don't use it in a bundt tin as it is too sticky. I couldn't get it out the pan. I would give it a one star rating because of that, but it does taste amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erika"
},
"reviewBody": "I have had better! But as a begginer this cake is by far the easiest homemade recipe. This definitely can be made by hand, and not messy at all. It does make about two cakes. Overall this cake was decent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Poulson"
},
"reviewBody": "I haven't baked a cake for a couple of years and have a glut of eggs to use up, so I wanted something idiot-proof. Well, this cake certainly turned out well! As other people have mentioned, this makes a lot of batter. I ended up using the largest cake pan I have, which is big enough for a large birthday cake and the cake took one and a quarter hours to cook. I used lemon essence instead of vanilla and glazed it with runny lemon icing after piercing the cake a few times first. I've had many compliments. I will absolutely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reginal Tucker"
},
"reviewBody": "I used 2 tsp Vanilla extract and 2 tsp of butter flavoring. We have not tried it yet, have to wait till tomorrow, Turkey Day ya know. It baked lovely. I had my oven set to 300, as it cooks WAY hotter than it should, and 350 would have been to hot. I would have done 325 in a normal oven. I remember the first pound cake I made called for putting the cake in a cold oven, and start it off at 350, then 15 mins later turn it down to 325 for 90 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reginal Tucker"
},
"reviewBody": "I used 2 tsp Vanilla extract and 2 tsp of butter flavoring. We have not tried it yet, have to wait till tomorrow, Turkey Day ya know. It baked lovely. I had my oven set to 300, as it cooks WAY hotter than it should, and 350 would have been to hot. I would have done 325 in a normal oven. I remember the first pound cake I made called for putting the cake in a cold oven, and start it off at 350, then 15 mins later turn it down to 325 for 90 mins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janeasilver"
},
"reviewBody": "Great way to use up eggs. Made one huge cake. Froze half for later - yum:-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunshine Baldwin Thiry"
},
"reviewBody": "My 16-year-old daughter made this without any problems. She was careful not to over beat the eggs so that there wouldn't be too much air in them. She also put a cookie sheet one rack under the cake pan in case it overflowed, but it didn't. It made one perfect Bundt cake. We opted not to add any glaze as it was sweet enough on its own. Very tasty and will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I made it for my granddaughter's birthday. I took two cups of batter and added 4T cocoa powder. I marbled it. I baked it in a 10-cup heart-shaped bundt pan at 350 degrees for about an hour. This recipe makes a lot of batter. Like others, I protected the oven with a sheet pan. I had to \"coax\" it out of the pan, but to my surprise, it came out just fine. I topped it with chocolate ganache. I am definitely making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris N Diana Herrmann"
},
"reviewBody": "I love the recipe, the simplicity but yet so delicious. I am very excited about making this over and over again and trying different toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dezurn"
},
"reviewBody": "I made this and it turned out great. I wasn't sure about not preheating the oven, but the cake was moist and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shellee"
},
"reviewBody": "It was different from my usual pound cakes. It was much better the next day. My brother &amp; his coworkers enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shellsland"
},
"reviewBody": "It really is a large cake (it bubbled out of my bundt pan) but it is very good. Not the typical poundcake but still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmoorecreations"
},
"reviewBody": "I made this with gluten free flour and it turned out great! I also halved the recipe and cooked it in a bread pan because I didn't need a large cake. It did overflow a little bit. I didn't know if it would rise much with the gluten free flour but it did. I think next time I will split between 2 pans or just not use it all. It was SO delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Neasie Cox Turbyfill"
},
"reviewBody": "I use this as my base recipe. I substituted lemon extract for the vanilla, added 1/2 fresh lemon juice, &amp; blueberry compote. Omg good! \n\nSometimes I sub vanilla for almond also and fresh orange juice. \n \nDoes make more than a standard bundt cake or dome cake pan can hold. You can split it into 1 LG and 1 small pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Kane Naylor"
},
"reviewBody": "I've made this twice. It is delicious and goes beautifully with strawberries and whipped cream. The second time I made it, it did rise over a top a bit - but that was not a big deal. Not too sweet. It is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seema Persad"
},
"reviewBody": "Excellent recipe. It finished before the hour and came out soft and moist. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenice Hunt"
},
"reviewBody": "Delicious! Made two cakes; one loaf pan and one bundt pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelly Kovacs"
},
"reviewBody": "I added a teaspoon of cinnamon, which I do recommend if you like a little spice.....I decided to attempt a Nutella swirl and I don't know if it failed because of the bundt pan (the recipe I was using called for a tube pan), or if it had to do with the two extra eggs, but the Nutella was so much denser than the batter that it all sank to the bottom of the pan and stuck to it even though I greased and floured it. NOT what I intended. It tasted amazing, but it wasn't very pretty. Oh well. Next time I will just follow this recipe but still add the cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "asp_"
},
"reviewBody": "Chose this recipe after discovering I have a bunch of eggs to use up. Ended up modifying it for my preference and based on other reviews. I cut the recipe in half and omitted the baking powder which gave me a single, dense loaf that turned out perfectly. I used 3/4 cup white granulated sugar and 1/2 cup brown sugar which gave the crust a light crisp and great brown sugar flavor. I also used half a teaspoon vanilla extract and half teaspoon almond extract with a splash of maraschino cherry syrup for an amaretto flavor. I lowered the baking temperature to 325 as I was using a glass loaf pan and wanted to lower the chance of anything burning. It came out perfectly golden and delicious after 90 minutes. This is a great recipe to use as a base and was very easy for someone who had never made pound cake before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CoraGregory"
},
"reviewBody": "Excellent but many of the reviews said this would make two bundt cakes, so I made two bundt cakes. It was well done at 60 minutes. It's kind of crunchy :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ReadWriteRunMom"
},
"reviewBody": "Delicious, BUT Browns very quickly. I took my cake out at 60 minutes, and it was more brown than golden."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arthur Targontsidis"
},
"reviewBody": "I decided to make this cake for my dad. He likes a moist cake with his coffee. I added orange rind and two teaspoons of orange extract to this recipe. The result was a super moist and fragrant cake. The second time I made it I added 1 1/2 cups of ground hazelnuts for a moist nutty cake. This recipe is very flexible. I recommend it when time is of the essence and the ingredients list is short. Enjoy...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "izzymae30"
},
"reviewBody": "This cake is fabulous. I made the recipe as written and used a 10\" tube pan. I did substitute Watkins Hazelnut Flavoring for the vanilla. I ate the last piece after a week and it was still delicious. Thank you so much for this recipe. I look forward to using it for strawberry shortcake. Update: This cake freezes beautifully. The taste and texture loses nothing and is still wonderful and fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Kitty Weeks"
},
"reviewBody": "My go to for lb cake. Beautiful yet simple to make. App wouldn’t allow me to upload pic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lina_22"
},
"reviewBody": "I had some instant strawberry pudding in the pantry I'd been meaning to use and was looking for a recipe for a scratch made cake I could add it to. Found this recipe and followed the recipe except for a couple changes. I divided the batter and added the pudding mix to half. Then I just poured regular batter in first followed by the strawberry pudding batter next. I swirled it in the bundt pan and baked it at 325° for 80 minutes(checking my batter at 60 minutes and continuing to bake in 10 minute intervals until done) The cake came out perfectly moist and dense. I might cut sugar down to 1 1/2 cups next time if using pudding mixes. But overall, very easy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonia Childers"
},
"reviewBody": "WORKS AMAZING FOR CUPCAKES!!!! My family and I were going on a road trip and needed to use up 6 eggs! found this recipe. Since cake isn't very mobile decided to make cupcakes i added some chocolate chips. It made 24 cupcakes and 6 jumbo cupcakes. (it made ALOT) and they were delicious!!! super moist!! AND they stayed moist for 3 days (thats when we finished all of them)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queen@16"
},
"reviewBody": "This recipe was great! I took the advice about not using an electric mixer and mixing everything by hand and I kept my cake from overflowing while baking. I also used 2 tsp instead of 1 1/2 because my family has a sweet tooth. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jojo25"
},
"reviewBody": "comparing all the pound cakes ive tried so far this was the driest one ever! it does not melt in the mouth like other cakes do.try melting the butter using warm milk until the dough becomes more smoother and easily can pour into the cooking pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingy"
},
"reviewBody": "Made this recipe exactly as written topped with a lemon glaze. It was delicious and moist - just the pound cake I wanted to bake. I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "aneana"
},
"reviewBody": "This recipe turned out great if you're looking for that light fluffy pound cake. That is what my results were. I'm still on the search for that heavy old school pound cake recipe. I'm n Colorado and because of that we r suppose to add an extra egg. I did not do that n the cake fail n the middle. Nevertheless it still surprise lay light n fluffy and good tasting might I add."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was an awesome tasting cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dholt77ny"
},
"reviewBody": "This was an awesome tasting cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy"
},
"reviewBody": "I wanted more of a Sundrop Pound Cake, so I lowered the amount of milk and added 1/2 cup of Sundrop along with lemon extract. Taste was amazing and will definitely make again....soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "This was the best pound cake that I have made in a long time, however, the batter was too much for one bundt pan so I also made a small loave, each has a different glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farwa"
},
"reviewBody": "This cake is amazing! With a very crunchy exterior, this cake has one of the softest textures i have ever tasted in a cake. I split the recipe in 1/2 and baked in a 9x6 loaf pan for 45min. My cake didnt overflow and rose to a perfect size, despite my beating air into it with my electric mixer(i think the air fluffed it up more). Instead of a sauce or frosting, i just sprinkled approx. 1 tbsp of sugar on top, which made a delicious crunchy topping. I also coated the pan with sprinkles of sugar after greasing it, which gives the cake a beautiful glaze. This is now my base recipe for a delicious &amp; easy pound cake. Thank you Diane!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Friday Shalom Johnson"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeniferken"
},
"reviewBody": "This was awesome! Made just as the recipe is written and it turned out great. Perfect for our strawberries and whipped cream. Thanks for posting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRE8JSE"
},
"reviewBody": "Taste amazing! Made for a bake sale. Does not disappoint!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLFROMSCRATCH"
},
"reviewBody": "I haven't been baking for a few years and am just getting back into it. It was great to start with a wonderful success! This cake turned out just perfectly. Nice and moist, not too sweet. Had 4 oz. of cream cheese to use up so whipped that with 1/3 c. confectioner's sugar and 1/4 c. o.j. for drizzling over. I'm back in the saddle again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STEFFERS22"
},
"reviewBody": "Very tasty and easy to make and delocious flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Beth Wondrasek"
},
"reviewBody": "I have changed serving size to 10 and it is perfect! A simple yet rich cake to enjoy with fruit and whipped cream!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iluvpastry"
},
"reviewBody": "Very moist, yet it still tastes like pound cake. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peggy Langston"
},
"reviewBody": "First time making pound cake by myself. Loved the recipe!!! Rose pretty high and was delicious!!! Even my mom loved it and she's an old fashioned pound cake lover :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Display Name"
},
"reviewBody": "A beautiful pound cake. I have made it several times. Received plenty of compliments and requests for the recipe. The recipe actually makes 2 cakes not one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Excellent recipe - followed it all the way through using the tips of how to make a pound cake found under articles. Cooked for about 65 minutes middle rack and came out wonderful. Would like to expirement with leaving out baking soda to get a more dense cake. Regardless this is a delicious cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hugh Silcox"
},
"reviewBody": "I give this recipe four stars, but only because I modified it. Taking the advice of another reviewer, I completely eliminated the baking powder, making it a much more \"true\" pound cake AND entirely eliminating the overflow problem. I also converted it to a lemon pound cake by substituting (1:1) fresh lemon juice for the vanilla, adding about three tablespoons of lemon zest, and reducing the sugar by 1/2 cup. Taking the suggestion of another reviewer, I sprinkled brown sugar and choppped pecans in the pan before filling it with batter. Baked (without pre-heating the oven) for seventy-five minutes (splitting the difference between the suggested bake times). The resulting cake is really good; it came out of my (silicone) bundt pan cleanly and easily, although I did notice a very slight underdone swirl through the lower register of the cake -- maybe I should have kept it in the oven a bit longer. Thanks, Diane, for a great foundation for a really very good cake!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TwinkieMel"
},
"reviewBody": "Success! Instead of filling my bundt pan completely, I spooned some off into a small loaf pan and did not have trouble with spillover. Cooked in exactly 60 min (but should have taken out the small loaf sooner). For glaze I mixed 1c powdered sugar and 2 TBS milk and splash of vanilla to drizzle consistency. Served with berries and cool whip but it is delicious on its own. Can't wait to upload a picture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RHIRHI"
},
"reviewBody": "I made this with my mother-in-law in Japan, and the whole family went wild!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole"
},
"reviewBody": "I've made this twice and everyone loved it. Even relatives who are not \"cake\" eaters enjoyed it. Moist, not too sweet! I sifted powdered sugar on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Sydnor"
},
"reviewBody": "I have eaten my share of pound cakes, made by older relatives. This one was one of the best. My mom thought that I had been to see Aunt Catherine. After reading all of the reviews, I decided to put the batter into 2 bundt pans, and I am glad I did. Both rose to the top, but didn't run over. I will be making this one again, and will try different extracts, other than vanilla. Very, very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crissa1"
},
"reviewBody": "Very nice pound cake, moist and heavy. This mixture made 2 loaf pans!! YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cakebaker"
},
"reviewBody": "Excellent Recipe! I was looking for a light pound cake and couldn't find one until I found yours! Cheers its wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katieb"
},
"reviewBody": "This was my first attempt at baking any kind of cake from scratch, and it was delicious!! I halved the ingredients to make a kind of \"short, mini\" bundt cake and it only needed 30 min. to bake. Thank you for a great recipe. I'm so proud:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fa"
},
"reviewBody": "This was a great cake! I took the suggestions made by others and divided the batter in two pans! \nI also cut the sugar by half a cup.\n\nTurned out great! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Pickles"
},
"reviewBody": "This pound cake is delicious, very moist, and reminds me of being a kid in south Georgia with my nanny in the kitchen pulling out a big pound cake from the oven and placing it on the window to cool."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Beth Rogers"
},
"reviewBody": "After reading the other reviews and comparing this recipe to another i've used recently, i changed a couple of things, and it turned out great! First, i eliminated the baking powder. This eliminated the overflow problem and gave it a definite pound cake texture. Also, i used 2 cups white sugar and 1/2 cup brown sugar for a little twist.\n\nIt was delicious! A perfect stand-by bundt cake recipe that can easily be slightly altered to accommodate different flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dainty Dish"
},
"reviewBody": "This recipe sounded good and simple, so I tried it... It was really delicious and super simple. I didn't change a thing in the recipe, but did pour a portion of the batter in a small bread loaf pan. Everyone mentioned that it overflowed so I decided not to waste the extra. It worked great. Be sure to grease and flour the extra pan for easy removal. The cake is very flavorful and needs only a good glaze. I used the one mentioned with extra lemon juice. Made it last night and we finished the last of the cake this morning with coffee. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Java_Girl"
},
"reviewBody": "Not at all pleased with this cake. It is not a pound cake. What you get when you make this is basic yellow cake. It tastes fine and I wouldn't hesitate to use this for a birthday cake but it's too light and airy to be a pound cake. I thought with 6 eggs in the batter that it must be a heavy, dense, rich cake. It's nothing like that and I don't think I'll be making this again. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KHATTER"
},
"reviewBody": "This is a great pound cake recipe and changing the serving to 8 is perfect for a loaf pan. If you have a larger pan then you can keep the servings the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luckypeach"
},
"reviewBody": "This recipe was almost perfect for my purposes. I only had a 9x13 cake pan (silly, I know) so I was looking for something that would really fill up the pan and this was absolutely it. It was done in 60 minutes and was suprisingly browner than I wanted it. The taste was great but it was just darker than I was expecting. It was definitely a lot lighter than most pound cakes and it actually took a couple of bites for me to register that signature 'pound cake' texture. I served it both plain and drizzled with lemon sauce. It was great both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harrison's Mom"
},
"reviewBody": "Very good pound cake. I made it in two loaf pans, it rose quite a bit, but didn't overflow. I also made whipped cream to go with it...very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel S."
},
"reviewBody": "This is a great cake! It is nice and moist, not as heavy as many pound cakes. I baked it in a tube pan and had no problems with overflow. It took 70 minutes in my oven. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexan"
},
"reviewBody": "The best fool-proof, versatile cake recipe I've ever used, and I've tried a lot of them. You really can't screw this up if you follow the recipe properly. As for it rising too much, I've never had it happen and I've done more than a dozen of them. 05 april 2009 - update: still my favorite cake ever. If you're doing large batches (i.e. professional baker), make the recipe for 24 portions, and it fits perfectly in a full sheet pan. Also discovered that it works fine if the oven is already preheated; just decrease the baking time and watch it closely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kriegler"
},
"reviewBody": "I made this recipe for a group and everyone loved it! I served it with fresh, sweetened strawberries and ice cream, but it was delicious by itself. I read the other reviews and baked it in two pans, one large tube pan and a loaf pan, to make sure it didn't overflow. This was not needed - it would have done fine in just the tube pan.\n\nI also used 1/4 cup brown sugar in place of 1/4 cup of the white sugar. I think this added a nice flavor. I did place a cookie sheet underneath and was glad I did as I had some liquid leak through the bottom of my pan. Overall, this is a great recipe that I will use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "czk"
},
"reviewBody": "I made this for 8 servings and it fit perfectly in a bundt pan. It was good, but better the next day, after stored on a covered cake stand. I served it with strawberry sauce and it was a nice dessert. Not spectacular, lighter than most pound cakes I\"m used to, but it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JoeyAngel"
},
"reviewBody": "I couldn't find an orange pound cake, so I've made the following changes to this recipe:\n- I've reduced sugar to 2 1/4 cups;\n- I've increased vanilla to 2 tsp;\n- I've reduced (boiled down) 1/2 cup of O.J. to 1/4 cup and used it instead of 1/4 cup of milk.\n- I've used 1/2 cup of milk;\n- I've added grated zest of one orange.\nI also baked it at 325F for 80 minutes. It turned out very well, with a nice (however mild) orange flavour. We had some friends over for tea and they loved the cake, having seconds and thirds. Everyone's favourite part was the golden crunchy crust. This cake is not going to become a kind of recipe I would make over and over, but I will make it again for Easter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne J.R."
},
"reviewBody": "This was the first pound cake I ever made and it turned out beautifully! I halved the recipe though cause after reading the reviews it seems that you get 2 cakes from the full amount of batter. I got 1 perfect sized cake. The batter does rise quite a bit and the top seems to brown fast so I had to turn down the heat 3/4 way through cooking. It smelled wonderful in the oven, yum! The taste of the cake itself is not too sweet at all, in fact it's perfect and I was delighted by this because it leaves opportunity for many different types of toppings! I served up some slices with a dusting of confectioners' sugar and a generous drizzle of Sue's Hot Fudge Sauce (found on this site) and it was great! I think I'll add some whipped cream to the combination next time around. Thanks for the wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pagansmom"
},
"reviewBody": "Delicious! Going by other reviews, I baked on a cookie sheet for 90 min. at 325. It was perfect."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8341/six-egg-pound-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
"name": "Pound Cake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8341/six-egg-pound-cake/",
"name": "Six Egg Pound Cake"
}
}
]
}
}
, "about": [
]
}
]