				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slovak Stuffed Cabbage"
,"datePublished": "1999-09-23T12:37:02.000-04:00"
,"dateModified": "2022-08-08T11:36:42.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kelly Berenger"
,"url": "https://www.allrecipes.com/cook/24325119"
}
]
,"description": "Here&#39;s a five-generation family favorite. Parboiled cabbage leaves are stuffed with a mix of ground beef, ground pork, and rice, layered with sauerkraut and bacon, and baked."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/5lx7FfDOkVt1ptj6BOb6TXyJ8eQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1102439-64b2658258184c628d6a7703e1b4fccc.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slovak Stuffed Cabbage"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "264"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "556 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "101 mg"
,"fiberContent": "7 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "14 g"
,"sodiumContent": "2096 mg"
,"sugarContent": "17 g"
,"fatContent": "37 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pound ground beef",
"1 pound ground pork",
"1 onion, chopped",
"1 teaspoon salt",
"black pepper to taste",
"1 teaspoon chopped fresh parsley",
"0.5 cup cooked brown rice",
"1.25 teaspoons garlic salt",
"2 (10.75 ounce) cans condensed tomato soup",
"27 ounces sauerkraut, drained",
"1 (29 ounce) can diced tomatoes",
"1 medium head cabbage",
"5 slices bacon",
"2 tablespoons white sugar",
"3 cups water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Bring a pot of water to a boil."
} ,{
"@type": "HowToStep"
,"text": "Mix beef and pork together. Stir in onion, cooked rice, parsley, salt, pepper, garlic salt and 1/2 can of tomato soup. Mix well."
} ,{
"@type": "HowToStep"
,"text": "Core head of cabbage, place in boiling water and boil until partly cooked. Separate leaves and trim stems. Reserve about 24 to 32 whole leaves. Cut remaining leaves and line the bottom of large roasting pan."
} ,{
"@type": "HowToStep"
,"text": "Lightly pack a small handful of the meat mixture and place in the center of a cabbage leaf. Fold top part of leaf over mixture, then fold in the sides and roll until mixture is completely encased. Lay rolls on top of torn cabbage leaves in pan. Place sauerkraut evenly over rolls. Lay bacon on top of sauerkraut. Sprinkle with 1 to 2 tablespoons of sugar. Mix chopped tomatoes and soup with water and pour over rolls. Add additional water to reach top of cabbage rolls."
} ,{
"@type": "HowToStep"
,"text": "Bake at 350 degrees F (175 degrees C) for 1 1/2 hours or until cooked through."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jb1011"
},
"reviewBody": "No tomato soup or sauce. Make a rue with flour and oil. Add two small cans of tomato paste to it. Stir about 5 minutes add water and let this simmer on the oven for about a half hour. Add to cabbage once they have been cooking for about an hour in a pot not oven. Cook all together for another hour. Serve with Mashed potatoes. Also, try to get whole head of sauerkraut as that is best. Layer in rows of smoked bacon ribs and slabs of smoked bacon in your pot for best flavor. White rice in the rolls instead of brown &amp; Vegata for seasoning the meat no salt or sugar needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "I lost my mothers original recipe, this reciepe was as close to it as best I can remember. I used V8 juice instead of tomato soup which gives the sauce a little zing and added 1 cup of shredded carrots to the meat mixture. I omitted the sauerkraut all together. Much better if made a day or so ahead!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this and it was great got so many compliments on it.2nd time I ever made them 1st time with this recipe awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jck"
},
"reviewBody": "This was excellent! I didn’t add the bacon only because I didn’t have any, but it truly didn’t need it to be very good. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "I made this and it turned out fairly well. I followed the recipe pretty much to the letter, other than I only have one tomato soup so I subbed out a can of Hunts sauce. My dad said it remined him of his grandmother's recipe. My dad is 86, so you can imagine how the taste brought him back. A keeper for this fall and winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rev Jill Gwen"
},
"reviewBody": "Great recipe, especially for my husband who is from Ukraine. It's just like he had growing up!! Thanks for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kckaren"
},
"reviewBody": "Used real garlic, basmati rice and brown sugar. This is the closest recipe that I grew up on and learned to appreciate as an adult. Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "N. Lee"
},
"reviewBody": "It was fantastic. The sauerkraut put it over the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith David"
},
"reviewBody": "Good! I left out the sauerkrout and bacon (don'tt care for the krout) but followed through the rest of the recipe as written. Baked in 2 pans for about 2 hours and served with mashed potatoes . The meat\n was very tasty. The cabbage was a bit tough but flavor was good. Next time I will bakel longer and serve with rice or quinoa"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Lea"
},
"reviewBody": "Best cabbage roll recipe I’ve come across. Really liked the sauerkraut and bacon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita"
},
"reviewBody": "My husband said this was the best recipe I have ever made in our 35 years of marriage. \nI took 2 suggestions from another review. 1) drained and rinsed the sauerkraut so it wasn't so bitter. 2) I added 1 teaspoon of regular paprika along with a very small pinch of smoked paprika to the meat mixture - because that's what I had on hand. I didn't have hungarian paprika but I'm sure it would have tasted great to use instead. It is labor intensive but worth it if you have the time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "izzymae30"
},
"reviewBody": "Thank you so much for this recipe. My mom and I always made cabbage rolls in the summer to freeze for winter. There wasn't a recipe for me to follow when I had my own home. This is as close as it gets. These are wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Sudzina"
},
"reviewBody": "The recipe is very much like my Grandmother’s with only a few changes. I did take notice that the stuffed cabbage leaves cooked more throughly on the bottom layers as opposed to the top. We cooked it for 2 hours not 2.45 hours because the meat was cooked at 2 hours and I didn’t want it to get dried out. Not sure what to do the next time about cooking the leaves on the top. I would make this again and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lance"
},
"reviewBody": "Loved it. Yes st next gathering I will make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aiki"
},
"reviewBody": "Absolutely delicious. I followed the recipe. This one will be made again for sure. It’s great for a cold day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pmknpmk"
},
"reviewBody": "This makes a very large portion. We fed 5 adults on one night. And we had it as leftovers on 2 nights for 3 adults. So, plan accordingly if making this recipe. I researched how to get my cabbage leaves. I found a process that was effective and easy. Maureen Abood’s blog on how to blanch cabbage for rolls is a must read. Also, I didn’t like how the bacon turned out between the layers. Next time I’ll chop it and cook it, remove the bits, and cook the onion and garlic, I didn’t use garlic salt, in the bacon grease. I’ll add this mixture to the meat stuffing. If you don’t have brown rice, I think white will work just as well. I think that is personal preference. We make our own tomato soup. So we did a paste/soup mixture for the meat and poured the rest over the top. We don’t purchase much processed foods. It worked well. Didn’t have to add water, there were plenty of juices. We had to use our large turkey roaster to get all the rolls in a single layer. Otherwise, this dish was a huge hit with everyone. leftovers were very yummy and reheated well. The extra juices kept everything moist and tasting great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jarad Fortney"
},
"reviewBody": "I make my own version of the same recipe however rather than baking, try using the pressure cooker instead, been doing it for years and makes a world of a difference. Cooking time in the cooker is 45 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary J Bridges"
},
"reviewBody": "My grandma and mother were born in Czechoslovakia, they made it often. It was great! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joann"
},
"reviewBody": "I accidently added tomato sauce instead of canned diced tomato. Still was very good and the sauerkraut added a lot of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "I Have already made this recipe twice and my family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "peachpoor"
},
"reviewBody": "Maybe I did something wrong but I was not into this. I’m glad my husband liked them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Burin"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mic93"
},
"reviewBody": "Yes, but will use low sodium V8 in place of tomato soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rayco"
},
"reviewBody": "Good recipe. Prefer to add more sauce and more rice. Also substituted chopped garlic over garlic salt to limit the amount of salt given the salt in tomato soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "midwayJ"
},
"reviewBody": "GREAT BASE RECIPE! Added diced potatoes and carrots, itailian season (had reg stewed tomatoes), oregano, cyanne, and I would have used stock if I had any.\nVery easy after the prep, tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ferg"
},
"reviewBody": "I made this recipe close to original; I did not use smoked paprika just regular. The only suggestion I have it to make it the day before serving, it tasted even better the next day. I will make this again. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmmc"
},
"reviewBody": "This is the best stuffed cabbage recipe! I was looking for a recipe to use up some beautiful flat-head cabbage I got from my local farm and gave this a try. Yes, It is a bit time consuming but makes a big batch so is good to freeze. I followed most of the recommendations in SusannaB's review (https://www.allrecipes.com/recipe/14597/slovak-stuffed-cabbage/reviews/2926504/) and received rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Greathouse"
},
"reviewBody": "I have made this recipe for years. The only thing I changed was I used crushed tomatoes instead of diced tomatoes. My husband and I absolutely love love love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victor Teresi"
},
"reviewBody": "Did not use the bacon or sugar didn't want it sweet came out great though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Connelly"
},
"reviewBody": "I used white rice. That's what Mom used. I used tomato juice but might try tomato soup the next time. It took longer than a half hour to make. I cooked half in a slow cooker for 8 hours on low the other half at 350 in a convection oven for 2 1/2 hours. The slow cooker batch was better. I took this to a Slovak family reunion and there were no refusals to eat them ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tim"
},
"reviewBody": "excellent recipe. I added a touch of Mrs. Dash, 2 eggs and 1 tsp of tyme. Molto Bene'!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Mitchell"
},
"reviewBody": "I loved it so much that I'm making it again. We are poor so we omit the bacon. I had to buy 2 cabbages to get enough leaves to use all of the meat, so fyi buy super big or multiple cabbages. I add a little cumin with the salt and pepper (read it in another recipe) but otherwise followed the recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara Gregg"
},
"reviewBody": "Not a fan of this recipe. I'm so bummed as I was looking forward to a delicious dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "Absolutely fabulous! The sauce was very watery, but nothing that pouring off into a pan and thickening with a cornstarch slurry can't resolve in 30 seconds. I'm making this again and will layer it like a lasagna instead of trying to make the rolls. They're a royal pain, time consuming, and almost never work for me anyway. So from now on, I'm calling this Slovak Cabbage Unrolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Swantek"
},
"reviewBody": "This is how I make stuffed cabbage. Recipe was my Slovak mother-in-laws. Everybody likes it. I core my cabbage, fill it with water through the core and cook it core side up in the microwave. Then separate and fill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "von_ubelmann"
},
"reviewBody": "I cooked the rice and meat separately, and added some green chiles, came out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rie Shana-Ciarlanto"
},
"reviewBody": "This recipe was so delicious!! I'm going in the hospital soon for surgery and am getting foods put up in my freezer for when I come home, the recovery period of the surgery. I'm making even more of these, they were that good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Moxie"
},
"reviewBody": "Great recipe. Made it just like recipe called for, &amp; yes rinsed the sauerkraut like suggested. 2 tbs of sugar little too much. Will definitely make this again. Just like the Hungarian neighbors made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S.E."
},
"reviewBody": "I really liked the addition of the sauerkraut and bacon over the top. I also added bacon to the meat mixture. I only added a 14.5 oz can of tomatoes to the soup and omitted the water and sugar which still gave it enough liquid to cook in without being too watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Patricia Woodworth"
},
"reviewBody": "Its so easy to roll the cabbage leaves if you freeze them overnight after blanching (like tissue paper). I prefer pork only vs pork and beef, and also add some chopped precooked bacon to my pork, into the rice. A tspn or Tbsp of paprika gives a wonderful taste to the rice too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scott"
},
"reviewBody": "think it needs more rice in the stuffing mix but they were awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Hooper"
},
"reviewBody": "Firstly - I knew I needed to make a smaller batch as there is just my husband and I. I started with very lean 1 lb gr. beef, added about 2/3's + cup brown rice, 1/4 cup tomato soup, didn't measure the salt or garlic, and added worchestershire and smoked paprika, every else the same. . Salted my cabbage water, pulled off each leaf (cored) and trimmed spine and ended up with 12 nice leaves. Lined the bottom of a 9x12 pan but it wasn't necessary and made it really too full in the end. Used a large crushed tomatoes and the remaining 1 can of tomato soup, added my brown sugar (1 tbsp) to the sauce directly. Used a 17.5 oz can drained sauerkraut, sprinkled evenly over stop of rolls, poured tomato sauce mix over and ended up removing some as it was too much (made sure it was down between rolls) - then laid about 7 center cut bacon strips across . I ended up with 10 rolls with 2 extra on the one side. I made sure to cover slightly the bacon with sauce. I did not add any water - (there wasn't room and it didn't want it runny as cabbage makes liquid as it cooks) I baked a little over 1- 1/2 hours, recovering the bacon with sauce once towards the end. WOW it was fantastic! I think each roll should have a least a piece of bacon cause that makes it sooo special. I had no floating grease and the sauce was beautifully thick . I have finally found my keeper recipe for cabbage rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "peachy"
},
"reviewBody": "had no flavor. a true gulumbki would be flavored using salt pork with the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "digitalPimple"
},
"reviewBody": "Made this exactly as written. Wonderful. Thank you for this. This tastes just like my grandmothers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Great recipe. Made it for a potluck and stuck to the recipe with the exception of the bacon. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcie"
},
"reviewBody": "This is the first time I've ever made stuffed cabbage. I used Mahatma Basmati rice instead of brown rice. I didn't rinse the sauerkraut but used the juice in addition to the other liquids. This was excellent. The fact that this recipe isn't pure tomato soup, and the bacon make this recipe stand out among the others. Excellent!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Keith Isaman"
},
"reviewBody": "For a better flavor profile and note to diabetics... you won't need to add any white sugar. Used ground turkey mixed with precooked white rice. Seasoned with salt, pepper and Chinese five spice powder (Try this and you'll use it every time for Galumpkis.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Cooker"
},
"reviewBody": "We skipped the bacon and sugar and added slices of cooked kielbasa layered with sauerkraut. Rinsed sauerkraut well. We made on top of stove in large stock pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deborah Wood"
},
"reviewBody": "Not quite as spicy and flavorful as I'd like but easily remedied. Thanks for uploading this - it was a GREAT base recipe to work with -- appreciate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "my family loved this recipe....my husband doesn't like sauerkraut but he still enjoyed it. We used a whole package of bacon, 5 slices didnt seem like it would be enough. I also added brown sugar on top of the bacon and then added the white sugar after. \n\nFlavorful and delicious. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill the pill"
},
"reviewBody": "Of course, I had to make some changes... I added turmeric and cayenne. Couldn't find the brown rice so went white. I had to thaw 12 large slices of bacon so I used it ALL. Gave the dish a wonderful smoky sauce. I put sriracha sauce on my plate but my wife passed. I did the recommended sour cream and it was decadent. I will add more rice next time. the layer of cabbage on the bottom was awesome to add to the servings. Depending on whether a person eats 2 or 3 for a meal I could have served 10 people easily. Froze half of it and still have food all week and gave some away. Good bang for the $$$. Thanks. I'm gonna explore the Asian and Indian recipes too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellyf4"
},
"reviewBody": "I have made this recipe for years and it is delicious. I follow the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buckinvt"
},
"reviewBody": "I made stuffed cabbages several times in the past, but was never happy with how they came out. Seemed like there were either rather bland, or they kind of tasted like some Italian dish because I added too much garlic or something trying to add more taste.\n\nI saw this recipe and decided to give it a try. I followed the recipe exactly, except I used dry parsley because it's all I had around. This recipe is a big time winner! I absolutely loved them. Not sure exactly what it was, but the combination of the cabbage, sugar, sauerkraut, and tomato sauce was excellent. I'm thrilled that I finally can make stuffed cabbages and really be proud of them. Thanks so much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsy"
},
"reviewBody": "I'm a little A.D.D. about cooking and am a multi-tasker, soooooo while preheating the oven, I cooked the hamburg, rice, and cabbage. I was pressed for time and didn't have enough time to roll, so I poured some pureed tomatoes in the bottom, lined the bottom with the cabbage leaves, then added the \"filling\". Topped it all off with the rinsed sauerkraut and covered with foil. Was done in 1.25 hours. My family could not get enough of this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amarie83"
},
"reviewBody": "This was my first time trying this recipe and it came out delicious! I will likely do it without the sauerkraut next time. I'm not a huge fan. But overall, this was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Willow Sullivan-Skotko"
},
"reviewBody": "I shred a potato and mix it in with the ground beef to stretch the mixture a bit and give it a sturdier base. also i put about twice as much pepper and salt than this recipe no other seasoning needed really its great just as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hllilley"
},
"reviewBody": "I had never made anything like this before but the picture caught my eye and I've been looking for some new recipes. The usual rotation can get old.\n I love cabbage so this was right up my alley. It turns out that my 18 month old loves it too because she couldn't get enough of it. (I was pleasantly surprised that she likes sauerkraut!) It turns out that this is a good thing because it looks like we're going to be eating leftovers for a few days. This recipe makes a lot of food!\n I made it exactly like the recipe said. Unfortunately this won't be making it into the rotation because: \nA. It is not difficult but it is time consuming and with 2 little ones at home I try to make simple things.\nB. Hubby is not as adventurous as me and our daughter and so he wasn't a fan of this dish. (I didn't take any stars away on account of my husband's bad taste in food.) ;P\n All that being said, I'm glad I tried it and sometimes it is worth it to spend the extra time to make something special!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "The sauerkraut made this really good. I am perplexed by the 3 cups of water. I understand the top of the cabbage rolls shouldn't burn but the sauce was very watery. I'll decrease to 1 1/2 cups next time then loosely cover with foil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eddie Murphy"
},
"reviewBody": "I had bad luck with my cabbage leaves! Should have gotten two heads of cabbage. Also: Be sure to take the big veins out of the leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Ralph-Lyle"
},
"reviewBody": "Amazing! Really skeptical about the tomato soup, but with all the amazing ingredients, it doesn't taste like it. Definitely cook the cabbage beforehand. Cut the stems out and you should have an upside V shape. Put the stuffing at the very top, fold left and right side over each other toward the middle to cover the stuffing, then roll the stuffing toward you. Makes for a prettier roll. I got a nack for this near the end, oh well! Next time I will perfect it. And there will be a next..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MDsarah"
},
"reviewBody": "The amount of water was more than you could imagine. All the flavor is washed away in the CRAZY amt. of WATER. Im actually buying more tomato paste and sauce and soup to try and fix the sauce issue. The other issue is the BLAND MEAT! Now, i cant fix that since its inside the roll, so idk what else to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOANNEH2"
},
"reviewBody": "awesome awesome awesome thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy_richelle"
},
"reviewBody": "A huge hit, made a bit much for our family of four, but the left-overs disappeared quickly. Most certainly a do-over. I did however add spices to the meat (as we like our meat well seasoned) I used a touch of all-spice and some cayanne pepper. We still would prefer a bit more kick with the meat, so I may add a couple hot peppers to the meat mixture next time. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nadia"
},
"reviewBody": "In Slovak they are called Holubce. Love them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amy1634"
},
"reviewBody": "I've never made stuffed cabbage before and actually only ever ate it once. This was so easy to make and it turned out amazing!! It sure did make a lot but that's ok I baked it in two dishes and will freeze one. I wish I could post pics to show how good it looked because the pic on here doesn't even look the way the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy T"
},
"reviewBody": "Delicious stuff! I've made cabbage rolls before, so I was hesitant to try this recipe (remembering how much time the ones previous took). I plowed through it! To make things easier, I make the stuffing the night before. DAY 1: cook rice, sautee onions in a bit of veg oil, throw both into a large bowl. Then I just pile the stuffing ingredients into the large bowl. Mix everything by hand. Cover in plastic and leave in the fridge til the next day. DAY 2: core the head of cabbage (like hulling the tops off strawberries), put the head of cabbage (intact) into boiling water. Gently pull off leaves, trim as much stem off the leaves with a paring knife. Stuff leaves - roll stem part in first. Then I follow the rest of the recipe. Easy as pie :) Hubby loved it so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "babs2946"
},
"reviewBody": "This recipe was delicious. I used apple juice instead of the water to add more flavor to the broth. I also added some grated pecorino and a few splashes of Frank's hot sauce to the meat because I like the tang and a little heat. Next time I will add potatoes in the broth to thicken the sauce and add as a side. All in all, a great recipe that I will use again and again. Thank you for sharing! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rbruno59"
},
"reviewBody": "The recipe wasn't bad , but not as good as everyone else seemed to think. I thought the sauce was WAY too watery, and I didn't even use the full 3 cups. Also, next time I won't rinse the sauerkraut. The sauce could use some acidity. I used white rice, but next time will add more. I will also fry the bacon next time, and pour the fat from the pan on top of the cabbages, again I will use more bacon. I will make these again, but with a few adjustments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tz_Garden"
},
"reviewBody": "Fantastic recipe! Be aware - this makes a lot of stuffed cabbage! My only comment - no need to use so much water. I only used 2 cups and it was pretty watery when done. I'll probably use 1 cup next time. I also used a large can of spaghetti sauce instead of tomato soup and Italian style diced tomatoes (this is what we had, otherwise I would have followed the recipe) and it was fantastic! Big hit in the house. I should have taken a picture - it was beautiful! The bacon was PERFECT. We used a nice smoked bacon with thick slices, gave everything a wonderful flavor. High recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cushyblum"
},
"reviewBody": "This is the best Stuffed Cabbage I have ever made. The touch of the sauerkraut was fantastic....in fact I am making it again this weekend. Love it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally Adams"
},
"reviewBody": "FREEZE your cabbage head before hand, then thaw on the counter the night before. No burnt fingers!! But the cellulose (?) will break down from freezing and you'll have nice soft leaves to work with. Couldn't find our gramma's recipe so looking here to make sure I'm on the right track."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "arwenita75"
},
"reviewBody": "Made these as written with the exception of using kielbasa instead of bacon. Really great - love the broth, delicious with some fresh bread and butter! I will be making these again and again, just without the bacon or kielbasa - doesn't need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WhitMcMo"
},
"reviewBody": "This recipe is spot on! It's now my go-to for cabbage rolls! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bill"
},
"reviewBody": "For the most part the recipe was very good, but adding the tomato soup, diced tomatoes and their juice, and water made the juices very thin. The taste was very good. The next day I drained the liquids from the pan and replaced them with a jar of prepared pasta sauce and reheated it in the oven. Turned out much better the sauce was thick and gave the whole dish a better flavor, in my opinion. I will make again but will take the extra time to prepare my own pasta sauce instead of the tomato soup and water mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maverick"
},
"reviewBody": "Absolutely fabulous. The broth created is a great foundation for a soup. This is one of the best recipes I have ever tried from allrecipes.com."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanielleLyn"
},
"reviewBody": "This was my first time making cabbage rolls and I sure picked a winning recipe! I pretty much went by the recipe except I added a little more rice and seasonings to the meat mixture, and a little less sauerkraut. I halved the recipe and it makes a bunch even halving it! I had a medium head of cabbage and I still needed a few more leaves because I didn't get to use all the filling. I would think the full recipe would for sure need 2 heads of cabbage. I quickly learned that you only need to boil the cabbage until the leaves are just pliable. If you cook them for more than a couple minutes, they will break while trying to roll up. I also learned while rolling them, that its best to have the stem end facing you and to roll from that end first, rolling up to the leafier ends to make them hold up better. Never making cabbage rolls before I did not know all this, but quickly found out! I did add the water in the recipe and also cooked an extra hour than stated because it was very soupy with the water. It still came out soupy, so I just served it in soup bowls with a large spoon and extra sauce with parmesan cheese sprinkled on top. It was actually very good \"soup style\" because the sauce really moistened the meat up inside. It was straight up comfort food! I will next time omit the water to get a more thicker sauce and see which we like better. Thanks for this great recipe! It takes some time but its well worth it! UPDATE: I have made this recipe several times now and"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CSHUTZER"
},
"reviewBody": "My meat was hard/dry. Growing up, I remember the meat almost falling apart while eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GAYL*MI"
},
"reviewBody": "WOW!!!!!! This is definitely the BEST stuffed cabbage I have every made. I served this over rice. Made this exactly as written with 2 slight changes, used Venison in place of the beef and crushed tomatoes in place of diced. You will need more than 1 medium cabbage. I had to run to the store to get another head of cabbage, didn't mind because it was worth it. This is now the ONLY stuffed cabbage recipe I will ever use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PSiecinski"
},
"reviewBody": "Excellent recipe! I have made stuffed cabbage for years from a recipe from my Polish mother-in-law. The bacon is a wonderful addition. She taught me to make them with homemade mashed potatoes which is a wonderful way to enjoy all of the rich sauce that this makes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian B"
},
"reviewBody": "Wow, this is awesome! I did not deviate from instructions and it came out scrumptuous. yus"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dianaj"
},
"reviewBody": "Never made them before, and wanted them to be just like Mom\"s I added the crushed ginger snaps that one reviewer suggested. They came out almost a good as my Mom's Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohiobratttt"
},
"reviewBody": "I had a friend who was Slovak and we exchanged recipes often so I had to try this when I seen the titile. This recipe is so delicious!!!! I opted to use V8 juice instead of tomato soup. YUMMO!!!! Best stuffed cabbage recipe ever!!! Kuddos to Kelly!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avon- status quo PRO"
},
"reviewBody": "Like others have said the prep time is a bit off, but that doesn't mean that these aren't simply worth the extra time. Absolutely delicious and comfort food at it's finest. To the meat mixture, I did add about 1 tsp of dill weed and 1 tsp of allspice (of all things), but it really enhanced an already wonderful recipe to a new level. Everything else was exactly as written and such a treat for my friend and her family. This makes quite a bit and found that it all fit beautifully in my covered turkey roaster. I did use the cover for the first 1/2 hour of cook time then removed it so that the watery sauce might evaporate some. Took nearly 2 hours to cook but well worth the wait. Great Fall meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kinmont Willie"
},
"reviewBody": "This recipe is excellent for a week night dinner. I never really cared for the Stuffed cabbage I have had in the past. I took a chance on this because of all the positive feedback. I made two batches with the intention of freezing one, but everyone asked to have it again for dinner the next evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ktcooks2"
},
"reviewBody": "Title of your recipe caught my eye since my father's family is Slovak (not Czech. he would say). My recipe came with white rice which I changed to brown which we prefer. Mostly identical to yours otherwise except my prep time is about double.\nWill look for other recipes of yours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christene Mullane"
},
"reviewBody": "Good recipe just needs something....Can't wait to see if it gets better with age."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bkboyer1"
},
"reviewBody": "I have made this recipe at least a dozen times. Absolutely delicious just as it is written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wenzel Soliday"
},
"reviewBody": "Very good as written. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moe"
},
"reviewBody": "This is really yummy. I love the flavors and the second day is even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia C."
},
"reviewBody": "I must say that this is the best stuffed cabbage recipe I have ever tasted. I have tried this recipe twice with superb results. The first time I used ground turkey and ground pork, instead of beef, to save calories. It came out perfect. I cooked the cabbage rolls in a slow cooker.\n\nThe second time I made the recipe I used beef and pork and cooked it in a conventional oven. \nI admit I got lazy and did NOT individually wrap the cabbage rolls. Instead I layered it like I would lasagna - a layer of cabbage, then meat mixture, more cabbage, then sauerkraut and bacon, then tomato soup/sauce. I also experimented and added mild chunky salsa in place of the can of diced tomatoes to jazz it up a bit. But honestly, without any tweaks, this recipe works perfectly as it is written. \n\nBoth times the stuffed cabbage came out perfect! It is my favorite recipe and kudos and giant kisses go out to the person who submitted this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusannaB"
},
"reviewBody": "This recipe is a ton of work, but gets rave reviews. Allow yourself at least three hours total time. A couple of suggestions: * Salt the cooking water for cooking the cabbage * Rinse the cabbage after boiling with cool water to make it easier to handle * Double the rice and the parsley * Saute the onions before adding * Substitute 6 cloves of fresh garlic for garlic salt, and saute the garlic with the onions * Add 2 tbs. of Hungarian paprika to the meat mixture * Substitute marinara sauce for the tomato soup * Substitute brown sugar for white sugar * Cook the bacon and crumble before adding * Rinse the sauerkraut and squeeze out any excess liquid before adding That's my two cents. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "HN73"
},
"reviewBody": "I found the sauce to be a little on the watery side. Next time I think I would forego the soup for tomato sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicky Gunkel"
},
"reviewBody": "This recipe is so close to mine that I wanted to review it and give a few tips that I use when making my cabbage rolls. First, not only should you drain the sauerkraut, but you should also rinse it thoroughly and squeeze the excess water out. This removes the brine that seems to give sauerkraut it's bad rep. A good old world recipe boils the cabbage head and the shortcut of freezing the head overnight leaves the cabbage leaves rubbery. It's an old world recipe and shortcuts like this are not good unless you just hate cabbage and throw the leaves out anyway. There is a large hard vein that runs down the center of the cabbage leaves near where it comes off the core. This can be cut out so your cabbage leaf is tender. That hard vein cannot be tenderized so get it our of there. Use smoked bacon-as it cooks, it helps to further tenderize those cabbage leaves as the fat renders down on top of rolls, plus it adds a smoky flavor to the sauerkraut. Last of all, (no offense to anyone) the flavor of pork mixed with beef cannot be replaced by ground turkey. It does change the flavor and taste of this old world recipe and the fat content of the pork helps to tenderize the cabbage covering the rolls. I suggest you try the recipe as directed to try it old world then review it. (Most people don't go through the trouble of making cabbage rolls very often so live a little here. If you plan to fix this frequently, then add your ground turkey and make it more healthy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KOALAGIRL"
},
"reviewBody": "I'll be honest, I've never had stuffed cabbage before. So this was the first time making it AND eating it. My husband LOVED it. He used to eat boiled cabbage as a kid in Australia and the cooked cabbage brought back memories. He had never heard of cabbage stuffed with meat, though. I guess I was expecting more tomato sauce - - it was kind of watery with all the extra water to bring the liquids up to the cabbage rolls. Next time I might reduce that a bit or use a can of tomato sauce instead. Also, the bacon on top got a bit burnt so I'll probably add that under the sauerkraut (which I really thought added some needed flavor to the rolls). Thanks, Kelly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yanna_K"
},
"reviewBody": "Hey Kelly, you got the recipe down to the tee! This is what our cabbage tastes like, it really is. I have shown the recipe to my granny (we are from Slovakia, living in Slovakia) and she asked me if I was pinching her cookbook lately :)) This really is the taste of home to me, thank you. Jana"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dereynolds"
},
"reviewBody": "Good stuff very similar to what my mom always made growing up. I used beef and lamb mixture instead of pork since I'm not a fan of pork. I also made it with sliced pieces of beef polska kielbasa on top instead of bacon since that is how my family has always made it. I prefer fresh garlic so I used that and added a splash of Worcestershire sauce and an egg. You got to add the sauerkraut it really adds to the dish and makes this a better stuffed cabbage that others I've tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Schulte"
},
"reviewBody": "I omitted the bacon for a healthier version, and I also used half beef and half turkey instead of pork. I didn't have to add that much water to it, I think I maybe added one cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megs"
},
"reviewBody": "I followed this recipe exactly (except that to make it Gluten Free I couldn't use the condensed tomato soup so I exchanged it for GF tomato soup and decreased the amount of water we added) and it is fantastic as written! I had never added sauerkraut or bacon to my stuffed cabbage before and I'm so glad that I did because it made the sauce absolutely delicious. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "femcon"
},
"reviewBody": "This is THE BEST stuffed cabbage recipe ever. Being from Pittsburgh I was elected to make 50 rolls for a gathering, since I said I knew how to make them. They were gone in no time. Many were disappointed when we ran out! You can't beat this one. (I did use white rice)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14597/slovak-stuffed-cabbage/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14597/slovak-stuffed-cabbage/",
"name": "Slovak Stuffed Cabbage"
}
}
]
}
}
, "about": [
]
}
]