				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Chicken Cordon Bleu"
,"datePublished": "2019-04-02T02:47:09.000-04:00"
,"dateModified": "2022-07-14T18:05:21.000-04:00"
,"author": [
{"@type": "Person"
,"name": "001519"
,"url": "https://www.allrecipes.com/cook/1286176"
}
]
,"description": "Layers of chicken, ham and Swiss cheese simmer in a creamy sauce while topped with stuffing mix."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Hxa0T4z0GkaE9a968pM5iKh0XkY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8629679-a787263fc1e746b493c650cb305e6f34.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6211748001001",
"description": "Layers of chicken, ham and Swiss cheese come together in a slow cooker and marry in a mouthwatering simmer with a creamy sauce, topped with flavorful stuffing mix.",
"duration": "PT1M2S",
"name": "How to Make Slow Cooker Chicken Cordon Bleu",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/243227cb-29da-403f-913f-fecfe65adad6/43916c72-0ddb-45f2-9ce2-1efcee8d374c/1280x720/match/image.jpg",
"uploadDate": "2022-05-17T15:47:51.298-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Chicken Cordon Bleu"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4",
"ratingCount": "426"
}
,"cookTime": "PT180M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "484 kcal"
,"carbohydrateContent": "35 g"
,"cholesterolContent": "112 mg"
,"fiberContent": "1 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1206 mg"
,"sugarContent": "6 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"6 skinless, boneless chicken breast halves",
"1 (10.75 ounce) can condensed cream of chicken soup",
"1 cup milk",
"4 ounces sliced ham",
"4 ounces sliced Swiss cheese",
"1 (8 ounce) package herbed dry bread stuffing mix",
"0.25 cup butter, melted" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Hxa0T4z0GkaE9a968pM5iKh0XkY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8629679-a787263fc1e746b493c650cb305e6f34.jpg"
}
]
,"text": "Mix together the cream of chicken soup and milk in a small bowl. Pour enough of the soup into a slow cooker to cover the bottom. Layer chicken breasts over the sauce. Cover with slices of ham and then Swiss cheese. Pour the remaining soup over the layers, stirring a little to distribute between layers. Sprinkle the stuffing on top, and drizzle butter over stuffing. Cover, and cook on Low for 4 to 6 hours, or 2 to 3 hours on High."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT190M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Edith Smith Griffith"
},
"reviewBody": "I used boneless, skinless chicken thighs and also adapted this recipe for my low sodium needs by using salt free cream of chicken soup, low sodium alpine lace Swiss and reduced sodium stuffing mix. It was a little too wet but still tasted great! done in 4 hours but I think my low cooker runs hot on low,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "2 of my 3 children are SUPER picky eaters. With that said, everyone LOVED this and can't wait for me to make it again! Thank you for saving me from the same 4 meals over and over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Windy Carson"
},
"reviewBody": "I didn't have ham slices, so I added in 8oz of diced ham and also some extra Swiss cheese. It was very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Granny D."
},
"reviewBody": "The chicken was tough and the sauce was too wet. The flavor was good. I might make it again with chicken thighs, and adjust the liquids to half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luvtocook"
},
"reviewBody": "This is a really tasty, great recipe. A good one for summer when you don't want to heat up the kitchen with the oven. I have made it many times, always comes out great. I made no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mproy"
},
"reviewBody": "I added a little too much milk, but I'd added a little some white wine and a tablespoon of Dijon mustard to the sauce. Easy, quick prep dinner after a hard day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Queen"
},
"reviewBody": "We we're skeptical at first but man did it taste yummy!!! This will be made many times from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica Parish"
},
"reviewBody": "We had four unusually large chicken breasts so only used two and it still made six servings. Served over rice with fresh garden green beans and it was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Foster"
},
"reviewBody": "Very good! I made it per the instructions. I made it for company, and they loved it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daisy"
},
"reviewBody": "Yummy &amp; so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Faith N"
},
"reviewBody": "This was okay. My oldest loved it. Youngest hated it. My husband and I were undecided. The flavor is good but the texture is awful. I followed the directions exactly and it was about floating in liquid when it was done. It was quick to throw together but I probably wouldn't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen D"
},
"reviewBody": "It tasted more like turkey gravy stuffing that you have around holidays, but still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "I made this exactly as the recipe stated and it was swill. I mean something you wouldn’t even slop the hogs with. A huge waste of ingredients. I would give a minus star if I could. It was that bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tatooood"
},
"reviewBody": "My family loved this! I gave it 4 stars, cause you really have to knock my socks off to get a 5. I am a busy mom, so this was the ultimate in lazy man's version of this recipe and I doctored it ALOT. I just dont have the energy to spend time cutting the ham or rolling the chicken, so here goes. I used 1 cup of chicken broth with the can of chicken soup, than added a lot of fresh ground garlic, a bunch af dried parsley, italian seasoning &amp; fresh ground pepper, and stone ground mustard - the jar kind, not the herb. All of it was to taste till I liked the flavor. I cut the chicked breast in half to thin them, I used lunchmeat ham and sliced swiss. Then I just layered it into the crockpot like it was lasagna: sauce, chicken, ham, cheese, sauce, chicken, ham, cheese, sauce. i didnt have stove top so I used a bunch of croutons on top which was nice because it didnt get mushy like other people mentioned. Then I added more chicken broth on top of the croutons instead of butter and viola! Hubby loves it, kids loved it, their friends loved it. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Janice Wisenfinnerty"
},
"reviewBody": "It was very rich. I had to put the stuffing on top in the morning before I left for work. It still turned out o.k. I don't think I'd make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Howe"
},
"reviewBody": "I made this two nights ago. I've used cubed herbed stuffing mix then the regular version. It came out all right. I didn't add any side dishes and ate it as is. I have no alternative suggestions to it, since it was delicious and yummy. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angel Lotus Song"
},
"reviewBody": "This recipe is great! I’ve made it many many times now. Always comes out tender. The only change I make is to use low sodium stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Wasielewski"
},
"reviewBody": "we loved it! Easy to make. Can use chicken thighs, which makes this a little juicer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nani B"
},
"reviewBody": "Perfect blend of flavors...chicken tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Brenna "
},
"reviewBody": "This is a good and easy prep casserole, but I wouldn't consider it chicken cordon bleu. I liked it, but will be making the traditional chicken cordon bleu next time I am craving it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EthansAuntie"
},
"reviewBody": "Next time I will put cheese on top of ham so ham sticks to chicken. Also I will use chicken tenders instead, but it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BonnieJo"
},
"reviewBody": "I wrapped the chicken in ham and cooked that in the sauce in the crock pot. Then I put it in a baking dish, added the cheese on top and then a liberal sprinkling of stuffing and baked it long enough to melt the cheese and brown the stuffing. It was good, but not as good as making it the old fashioned way. However, if you're having a lazy day and don't want all the work of the old fashioned way, then this is your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LGM"
},
"reviewBody": "Creamy and delicious. Only change: Added black pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aaron Khachigian"
},
"reviewBody": "A super simple way to enjoy the all time favorite without going through all the trouble of actually making the dish...and not toothpicks. haha. the recipe called for one layer of each, I had extra and added two layers....twice as delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "This was fine but a little bit one-note. If I make it again, I would definitely add some veggies. A bag of frozen broccoli or peas would have made a big difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah H"
},
"reviewBody": "When I think slow cooker meal, I think easy meal. Made as written, this is just a 1-star dish. You need the gooey stuffing to act as a sauce because the chicken is otherwise bland and the cheese disappears. So if I need to doctor it up by pounding the chicken to then roll the ham and cheese inside, it has ceased to be a quick easy slow cooker meal and you're basically making regular chicken cordon blue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brandyceliz81"
},
"reviewBody": "I make this regularly and the family loves it. It's so easy! I usually serve broccoli or green beans on the side"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tcssjo"
},
"reviewBody": "I made this twice now. This was so simple and delicious. when the cheese melts in the soup it makes a mouth watering delight. I used Dietz and Watson ham and baby Swiss cheese. I did put it under the broiler for a couple of minutes at the end of cooking to make the stuffing have a bit of a crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Johnna"
},
"reviewBody": "I would agree that it needs a little garlic, salt pepper...but otherwise it was great. I didn't have stuffing so I used garlic and butter croutons. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbi Provencal"
},
"reviewBody": "This is so delicious !!! \nMy oval crock pot only held 3 large breast so I did a second layer like a lasagna. I layered cream of chicken mixed with milk first on the bottom. 3 breasts, ham, mozzarella cheese, dry stuffing mix, and a little more cream of chicken. Then I repeated the layers making a total of 6 breasts. Of course doing it this way I needed a second can of cream of chicken mix. This was so quick and easy for a busy day. Goes better with mashed potatoes than rice. WILL make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deanna St Clair"
},
"reviewBody": "Just ok might try again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MADgical72"
},
"reviewBody": "The only thing I do different is use homemade cream soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "K.C."
},
"reviewBody": "I made according to directions, I did follow one reviewers advice and butterflied the chicken and put ham and swiss inside. It was ok, I won't make again, as my family wasn't thrilled with it. For a slow cooker version of chicken cordon bleu, it was alright. Chicken fell apart with touch of a fork, but I'll stick to the baked version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Very good!!! As a stay at home wife expecting our first child in a few weeks, I am always looking or quick and easy meals. Hubby is extremely picky and even he liked this one. I did make a couple changes though-instead of the stuffing mix, I used italian bread crumbs (toasted on the stove and added towards the end) and I also added some shredded parm/romano cheese along with the swiss. Next time I will add even more cheese because it seemed to be non-existant by the end of the cooking process."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Condo"
},
"reviewBody": "I loved this dish! I did make a few modifications to it though. I butterflied two chicken breasts and pounded it to make it thinner. I seasoned it with onion powder, black pepper, and garlic salt. I then placed the ham and two slices of swiss on one side of the chicken before folding together and placing into the crock pot. I bought Chicken Stuffing and waited an hour before putting it in the crockpot. I did not put the full amount of stuffing in. The stuffing did not create a crust but blended really nicely with the meal as a whole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Votaw"
},
"reviewBody": "Delicious! My family loved it! Very easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CelticMarine"
},
"reviewBody": "I followed the recipe fairly closely for the most part. Based on other reviews, I did opt to butterfly the chicken breasts then roll the ham &amp; cheese in the breasts. Added some tarragon to the soup/milk mixture. Sprinkled the inside of the chicken breast with poultry seasoning before rolling. Placed the breast rolls in slow cooker with about half the soup mixture. Cooked on high for an hour. Added the stuffing, melted butter and rest of the soup mixture after the first hour. Cooked for about another 90 minutes on high setting.\nFamily's overall reaction was \"meh\". It was OK but just didn't impress. I might try it one more time but bake it in the oven instead. As a slow cooker meal this was a miss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "FeedingTheFamily"
},
"reviewBody": "This just want what I was expecting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Folkorb"
},
"reviewBody": "Always comes out perfect! The recipe is perfect as is, but sometimes I use a mixture of Swiss and Muenster cheeses, or add a little gruyere. Don't use lunch meat ham or Spam, it doesn't turn out well; better to use no ham than either of those."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Reece"
},
"reviewBody": "AWESOME! I used low sodium deli ham cut into small 1\" pieces, I cubed the chicken, low sodium cream of chicken soup and added minced garlic and black pepper. I stirred occasionally throughout the cooking to mix it all together. I also used 1 pkg of stuffing at the beginning and added 1/2 package during, I also added a little water. At the end I put a glass of water in the crock pot, put on the cover and turned it on high which made for easy cleaning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Jakubiak Cadan"
},
"reviewBody": "This was a hit with my kids! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Aron Jones"
},
"reviewBody": "Not a fan of this dish... Stuffing made it taste bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alisha"
},
"reviewBody": "Very yummy! I set it on low for six hours before I left for work and let it sit on warm until dinner time (total time about eleven hours). Sitting so long on warm made the chicken kind of dry. Next time I will wait until I get home then cook on high for two hours so that it's ready at dinner time. Even dry, though, this had lots of good flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trina Clark"
},
"reviewBody": "this is a great recipe for a slow cooker easy version, i cant stand people like the one who said they omitted the ham and cheeses, DUH...thats not cordon blue STUPID, thats just chicken, JEEZ"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Donald Ardelian"
},
"reviewBody": "the wife told me she does not like Swiss cheese before I made it, and I went to the store and bought Swiss cheese. She like it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sapphires Flame"
},
"reviewBody": "I found this recipe 'as is' to not have enough flavour, so I replaced the cream of chicken soup with cream of mushroom soup and it made all the difference in my opinion. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LynneC"
},
"reviewBody": "Made this tonight and it went over well. Used only 4 chix breasts since it was for two with planned overs. I didn't have any stuffing in the pantry so I subbed uncooked quinoa for stuffing. Used about a half a cup and sprayed water on top to make sure it would cook. Hubby, who doesn't like quinoa liked the dish. I will fix again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandyrella"
},
"reviewBody": "We tried this for the first time today for Sunday dinner. Everyone loved it. No leftovers here. Everyone agreed it will be a repeat recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dorrick"
},
"reviewBody": "This recipe is fantastic! I just made a few adjustments. I used 1/2 of heavy whipping cream to the 1/2 cup of milk. I also used unseasoned bread crumbs instead of seasoned crumbs. I added my own seasonings to the bread crumbs to suit my family's taste. I will certainly be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britt_511"
},
"reviewBody": "Great receipe!! Didn't take as long as expected came out very creamy and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jade W"
},
"reviewBody": "Very easy and yummy! Family loved! Didn't change a thing!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Guzick-Shoemaker"
},
"reviewBody": "I'm a little lazy. I through all the ingredients in a bag and froze it. Later in the month I just defrost and placed in my crockpot. I was not able to layer it, but it still came out tasting superb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ibellad82"
},
"reviewBody": "Sooo yummy! My husband loved it and went for seconds. Always great when you make hubby happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessika Reynolds"
},
"reviewBody": "I split my breasts in half and then rolled the ham and Swiss in it. Added the extra slices on top. I also added 1TBL spoon minced garlic. It was very moist the chicken fell apart with a fork and it was a very good everyone ate it all up the and had seconds. I WILL MAKE IT AGAIN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Coker"
},
"reviewBody": "I will definitely keep this on my menu. I think I will butterfly the chicken as others suggested then it will be 5 star."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "easy to make, but my hubby didn't care for it. He said he couldn't taste the cheese at all and I doubled the cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "Last minute decision to make this and was in a hurry so cooked 3 hrs on high. I didn't even have time to read the reviews and followed the original recipe except for the ham. I was out so used deli pastrami. It turned out okay - I think ham would have been better. Mine needed a little salt for seasoning... ham might have made the difference. I will make this again - quick good dinner!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alisha Bennett"
},
"reviewBody": "Based on other reviews I made quite a few changes....and I'm glad I did. This was a huge hit at our house. First I halved the recipe. Butterflied chicken and put one slice cheese and one ham in each. Then two of each layered on top. Used cr. of mushroom soup and added garlic powder, poultry seasoning, thyme, pepper, oregano, dried parsley and white wine, used 1/2&amp;1/2 instead of milk. Added stuffing last hour of cooking and skipped butter, used chicken broth instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rebecca Downing"
},
"reviewBody": "I think it needed more sauce &amp; less (or no) stuffing. I will also probably add some of the seasonings that I use when I make the non-slow-cooker version as it was a little boring flavor-wise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peachhaze"
},
"reviewBody": "Loved it. I create it like everyone else as a butterfly chicken filet and follow the recipe the rest of the way. Family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LaurieL2"
},
"reviewBody": "This was really good. Will rolling them next time like someone else suggested because one they are covered with the stuffing mix it is hard to find the indvidual chicken breast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "babyblue"
},
"reviewBody": "This recipe tasted really good but I gave it only 4 stars because I needed to make a lot of adjustments to get it right. I diced the cheese and ham so that it wasn't a thick layer. I pre-cooked the chicken on the stove, layered everything in a 9x13 and baked it in the oven with 2 boxes of stuffing on top. It tasted delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Genevieve Schiller"
},
"reviewBody": "I took it a step further and butterflied the breasts to fold the ham and cheese inside. Otherwise, I followed it to a tee, and it was a smashing hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Welsh-Adams"
},
"reviewBody": "Have made this many times. It is a huge hit! My kids love it, they always ask for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "khorstman6"
},
"reviewBody": "Great recipe! I made it as written with one change, all i had on hand was boneless skinless thighs, and we were all going back for seconds. I will make this again. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Nielsen Yeagley"
},
"reviewBody": "I seasoned the chicken with garlic salt when I put it in the slow cooker. I also waited until the last hour of cooking to add the cheese and the stuffing and butter. I'm glad I did, even with only cooking it for one more hour the stuffing was getting dried out on the edges. It turned out to be good with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "waspokey"
},
"reviewBody": "I thought this turned out very well. I was concerned that the chicken would get overcooked and fall apart, but I used two very large chicken breasts and cooked on low for 6 hours and it turned out perfectly. I thought it was strange to add the Swiss cheese at the very beginning, rather than at the end of the cooking time, but the cheese melts and combines with the soup giving the sauce a cheesy Swiss flavor that I thought was pretty distinctive. I would recommend this. It was so easy, and very good tasting. I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Burns-Swanson"
},
"reviewBody": "Excellent recipe! My husband, who doesn't normally go back for a second helping, went back for this. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "VOLLEYBALLTIGGER"
},
"reviewBody": "I have made a lot of recipes from this site, but this one will be removed from my recipe box. The chicken was dry, the cheese disappeared and the stuffing was mush. It really had no flavor. It sounded good in theory, but I did not like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shoecr8zy"
},
"reviewBody": "This \"Bleu\" my taste buds away!!! So good and I loved that it was easy to make. I made it on a night that had a bit of chill in the air, so it was the perfect comfort food - warmed the belly and make the mouth happy!!! This is going in the dinner rotation for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Hall"
},
"reviewBody": "love this is so easy:) I use provolone cheese in mine:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "I made this for my girls last weekend. It was a hit. Easy to make, too. i have a \"hot\" slow cooker. At the eight-hour setting, five breasts took 1.5 hours to cook. I'll make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tasha Swapp Martineau"
},
"reviewBody": "I made this for my husbands Birthday dinner and he loved it. All of the people that we had over to eat with us wanted the recipe and I would make this any time. I used provolone cheese instead of the swiss cheese and it still turned out really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KateMagee"
},
"reviewBody": "This is a great recipe. I butterflied, stuffed and thentoothpicked in place the breast like others had suggested. I used 2cans of the soup and added emeril's original essence and basil. I also did not add the stuffing until the last hour as suggested by others. The sauce/gravy as awesome. I found the toothpicks to be cumbersome and wish I could find something edible as absolution to hold breasts together. Overall a keeper! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This was pretty good. Not really \"cordon bleu\" but still pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julzygirl"
},
"reviewBody": "My family loved it! Very yummy!! I think I'll wrap the ham slices around the chicken next time. I think my husband ended up with about 3 of them! Or, I'll just stuff the chicken like others did. The flavor was so good! and very easy to make... always a plus! Will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigsisd2hga"
},
"reviewBody": "This is the first thing I've cooked that in 22 years my husband has ever gotten enthusiatic enough to want to bump up a few things. The first time I had it too soupy so I halved the milk with heavy cream and it was perfect. We hammered the chicken, layered it, cheese (which we used provolone and I finished out the bit of swiss I had, layer of shaved ham, another good layer of soup sauce as the chicken breasts actually thinned enough to make two. So we had that second layer of meat and cheese topped by the breading. I cooked on hi for 5 hrs. It was moist, savory, and everyone loved it. It goes WAY further, I would suggest this amount for at least six. I sliced and served it onto a platter and all of the layers held together so it was quite attractive as well. This was done in my large oval crock (not sure size). I would not suggest doing it in anything smaller. The width and shape of the oval crock made it easy to slice and remove. It has to be cooled before slicing if you want a good hold of the layers for looks and then warn, This is the best recipe we've used and it as our guidance we just did tweaks for his taste. While there may be lots of way to tweak to your taste, without this recipe would be absolutely nothing to start from. We cannot thank you enough for providing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hillaryma78"
},
"reviewBody": "Made this exactly as recipe called for...it was very easy to make and pretty tasty, my husband loved it. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri McDonnel"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHERRY"
},
"reviewBody": "I cooked this just as the recipe instructed. First of all, spray your dish with cooking spray or use a liner on this one. The stuffing really sticks to the sides. I cubed my chicken and my ham. I cooked it on high for 2-1/2 hours due to time. It was fully cooked and hot. I should have read the reviews about adding the cheese and stuffing about an hour before serving (30 minutes on high). The stuffing was mushy. It would have been better if it was crunchy. I also think that it was too much stuffing for me. My box was only 6 oz. I suggest using less. I think I will try breadcrumbs next time, but you can use crackers, crutons, etc. I will also use more cheese (we love lots of melted cheese). Overall it was very good and I will definetely cook it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "51BRENDA"
},
"reviewBody": "I have made these several times.. Instead of using mushroom soup, I use the Cream of Cheddar soup or make a cheese sauce... I cut up the chicken into bite size pieces. Bring it to work in the morning, plug it in &amp; ready for lunch!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "elzbth488"
},
"reviewBody": "I probably shouldn't fairly rate this dish because I changed a couple of major things about it. Instead of stuffing mix I had boxed scalloped potatoes on hand so I used them on top. This was delicious but the entire dish did not stay together well. Splitting open the chicken and stuffing the ham and cheese inside would have been much better. I also used real off the bone ham, not deli meat which gave it a better taste. I will perhaps try this recipe again but I will follow the recipe exactly and see if it makes a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUEMAMA"
},
"reviewBody": "Yummmmmy!!! I made it pretty much as posted. I did however slice my breasts in half, that made for more layers of cheese and ham between. I used a family sized can of cream of chicken soup too. Thanks for the post!!! Will be making this over and over!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KayWilson"
},
"reviewBody": "I cooked this for my family last night. This will be a keeper. It is one of those meals put it on and forget about until it is time to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TracyK"
},
"reviewBody": "Thank you so much for this recipe! My son who is a very picky eater Love it! I will definately make this again. I followed the directions to a T and it was great! Thank you again, it is now on my list of easy crock-pot meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "polishprincess"
},
"reviewBody": "We didn't care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "VAmommy"
},
"reviewBody": "This works very well if you do it for 8 hours or more. I have now tried it twice on high for 3 and 4 hours, and the stuffing is not done. I recommend this recipe on the low setting, and it is very yummy for the whole daily. I do not recommend this recipe on the high setting, as the stuffing does not finish cooking in time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ny teacher"
},
"reviewBody": "I didn't cut the soup in 1/2 when I made this even though I cut everything else in half so it came out kind of soupy. Plan to do it right next time! Just have a hard time remembering I have 1/2 can of soup left over and use it up. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tina Howard"
},
"reviewBody": "This was easy to make. And was good. But seemed like it was missing something.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda B."
},
"reviewBody": "A FANTASTIC SLOW COOKER RECIPE!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noreen Rionda Sommer"
},
"reviewBody": "Made this for dinner last evening and it was a huge success for my hubby and me. One issue for us was that the stuffing mix was very salty and we don't use much salt so the next time I am going to make my own stuffing topping and try it that way. Didn't have the swiss cheese so I used 1/4 c of blue cheese crumbles (which may have added additional salt) so I will use swiss the next time as well. This was a great recipe for the crock pot and, as you see, will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauriec"
},
"reviewBody": "My family really liked this. I used organic chicken tenders, covered with soup and sprinkled half of stuffing mix on top (no butter). Cooked on medium (3) for about 3 hours then add a layer of ham, then swiss and topped with remaining stuffing and sprinkled with 2T butter - stuffing came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lori "
},
"reviewBody": "This was easy to make. Cubed the chicken, stirred with the soup and milk in the slow cooker. After 3 hrs on low I covered the chicken mixture with a layer of diced baked ham. An hour later I stirred it, layered the cheese over the mixture and topped with the stuffing mix and melted butter. Let it go for another hour. The result was pretty tasty. I would not recommend adding any salt as with these ingredients it didn't seem to need it. The stuffing was not mushy so waiting to add it seemed to work out. A green veggie went nicely on the side. This was good but for me I probably won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeidiS"
},
"reviewBody": "I would have loved this with the stuffing but DH doesn't like it so used idea from another reviewer and used box scalloped potatoes, including the sauce packet (and nixed the butter). I was planning on serving broccoli with it so decided to just throw it in. I also browned the chicken first and then cooked it in the oven at 450 for about 30 minutes. I know lots of changes but the original recipe would've been great - the ingredient mix is what makes it and its easy to modify. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy Guillotte"
},
"reviewBody": "My family loved this recipe. the only problem I had was the stuffing was dry on top., next time I will prepare the stove top following directions and add it either the last 1/2 hour of cooking or just serve on the side. will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "leelee"
},
"reviewBody": "This is a great recipe. I followed the advice of other reviews by adding some extra flavor, so I added lots of garlic, onion, and a half cup of white cooking wine. I also added some chicken broth, because I thought it might dry out, but it was not necessary. I added low-sodium chicken stuffing on top with 2 hours to go, but next time I will wait the last 30 minutes since they got mushy. I also butterflied the chicken, and stuffed the cheese and ham inside which turned out nice. I think I may try prosciutto and provolone next time. The chicken was nice and tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KristinHertzog"
},
"reviewBody": "Yummy, although a tad too salty. I followed the recipe exactly and it was good enough that I will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bulldog Momma"
},
"reviewBody": "This was so good and easy to make. We usually don't like stuffing in our house but it is so good in this recipe. I will be definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "chicken was tender, but dry; stuffing was over-done... was just OK."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/81124/slow-cooker-chicken-cordon-bleu/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
"name": "French"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/81124/slow-cooker-chicken-cordon-bleu/",
"name": "Slow Cooker Chicken Cordon Bleu"
}
}
]
}
}
, "about": [
]
}
]