				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Cider Applesauce (No Sugar Added)"
,"datePublished": "2019-04-02T02:58:30.000-04:00"
,"dateModified": "2022-12-28T14:45:25.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Cookingfor9"
,"url": "https://www.allrecipes.com/cook/cooking_for_9"
}
]
,"description": "This homemade applesauce recipe requires no added sugar because the apples, spiced with cinnamon, nutmeg, and cloves, are sweet enough on their own."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MmIWbhG84KJdRLCugEVDZpHLpD0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2194509-slow-cooker-cider-applesauce-no-sugar-added-Rock_lobster-4x3-1-ce13cfccc103402d8245cd9ebf061c9a.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Cider Applesauce (No Sugar Added)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "73"
}
,"cookTime": "PT240M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "76 kcal"
,"carbohydrateContent": "20 g"
,"fiberContent": "4 g"
,"proteinContent": "0 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "2 mg"
,"sugarContent": "15 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"5 pounds apples - peeled, cored, and thinly sliced",
"1.5 tablespoons ground cinnamon",
"0.5 teaspoon ground cloves",
"0.25 teaspoon ground nutmeg" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Layer apples in a slow cooker. Sprinkle cinnamon, cloves, and nutmeg over apples."
} ,{
"@type": "HowToStep"
,"text": "Cook on High until apples are soft, 4 to 5 hours. Whisk apples vigorously for a chunkier-style applesauce. Puree with an immersion blender for a smoother applesauce."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT250M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brendadaviseddy"
},
"reviewBody": "Fabulous recipe. Can't believe how much I love applesauce now - so much so, we make a batch for the two of us every weekend during the fall and winter. We would have stayed with the recipe but only had cinnamon and allspice so that is what we have been using. Thank you so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimberly kennedy"
},
"reviewBody": "I love my slow cooker, and liked the simplicity of this recipe. It is a great alternative to sugary or starchy desserts / sides. I did not make any changes, but will experiment with different kinds of apples in future batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WyoBaker"
},
"reviewBody": "I love this recipe, make it every other month or so. Have been making it for several years. I love how it tastes, no need for sugar. I prefer the recommended spices but have also made it without nutmeg. Very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmmartindale"
},
"reviewBody": "It’s delicious, I shared with many of my friends who agreed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEDDY"
},
"reviewBody": "Followed the instructions exactly as written. This is by far the best applesauce I have ever had. Used a mix of apples: Fuji, Gala, etc. we had on hand. It was perfect. I see this as a weekly recipe in our future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty G"
},
"reviewBody": "Easy to make, tastes great. I'm on Weight Watchers right now, so this is Zero points, double win for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat Conoley"
},
"reviewBody": "This was so delicious and so easy! The first time I made it I followed the recipe and it turned out awesome! The second time I added just a little water at the end as I prefer a less thick applesauce and used a little extra cinnamon. This is my new go to recipe for applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shermj"
},
"reviewBody": "I used Honeycrisp apples. I did add a very small amount of apple cider to the recipe. Recipe has good spice level. Recipe was accurate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Braun"
},
"reviewBody": "An interesting recipe for a slow cooker, not having to add liquid to the cooker pot. It didn't actually need it, as I found out. Used an immersion blender to make smooth applesauce, but could have used the cooked, sliced apples for a no-bake apple pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MeasureMe"
},
"reviewBody": "Definitely will make again. This is the BEST applesauce I have ever had. The only change I made was the amount of apples. I had to adjust for fewer than 5 lbs. It was GREAT!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laekgirl"
},
"reviewBody": "I have used the basis of this recipe several times. I generally use a mixture of different apples, especially during harvest here in upstate New York. I sometimes use Penzey's Apple Pie spice, never sugar. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Hughes"
},
"reviewBody": "Delicious!! Suggest using less cinnamon if using Ceylon, Vietnamese or other high spiced cinnamon and for added sweetness dried cranberries(1/4 cup), I just toss some in. Enjoy !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "muehlhma"
},
"reviewBody": "Crock pot is SOOO easy. The spices were a bit heavy for our taste so I'll be cutting back next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol H"
},
"reviewBody": "I didn't have cloves, so I left those out. I didn't cut the apples up as small. My corer quartered them, but they are soft enough to mash. I have a Vitamix, so I will be making it creamier and saving some for smoothies. I have to limit my sugar so this no sugar added is great. Plus, it doesn't need sugar. I used organic, juicing Gala apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ca2zhawkeye"
},
"reviewBody": "I didn't have cloves, so I left those out. I didn't cut the apples up as small. My corer quartered them, but they are soft enough to mash. I have a Vitamix, so I will be making it creamier and saving some for smoothies. I have to limit my sugar so this no sugar added is great. Plus, it doesn't need sugar. I used organic, juicing Gala apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "amanda Smathers"
},
"reviewBody": "I didn't like it was so bland but my year old niece loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amcc"
},
"reviewBody": "Didn't make any changes at all. This was amazing! I was skeptical but didn't add any sugar. Hands down the best homemade applesauce I have ever had. Will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "I totally didn't make this in the slow cooker due to time constraints, but overall, this was a winner! I like that the recipe does not call for sugar, so you can tailor if you want any sugar added to how you like, or put in honey if you like. It is not needed, though, if you use a sweeter apple. Thank you for posting this; I have been looking for a good sugar free applesauce recipe!! Homemade is the best!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarnspicelily"
},
"reviewBody": "This came out perfectly! Mom and I shopped for the ingredients and then cooked this recipe together. It is perfect for the post-bariatric stage two diet.\n\nWe used a mix of Braeburn, Cortland and McIntosh apples, using the \"BEST APPLES FOR BAKING: APPLE PIE, APPLESAUCE, CIDER\" guide by The Old Farmer's Almanac website. For those thinking about adding sugar into this; don't. This dish is sweet on its own. The sugars come directly from the fruit. As for adding water; the juices from the apples are released during the cooking. Just mix it a few times. We had no problems with sticking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JeanLouiseFinch"
},
"reviewBody": "I made this and it turned out quite well. However, there are a few issues that need to be addressed. First, while this recipe is table “sugar free,” it is not really sugar free since it still has plenty of sugar from the apples. Remember that 1 cup of apple juice has 24 grams of carbs, all derived from fructose - a sugar. Thus, this recipe might not, in larger quantities, be suitable for diabetics. Also, if people need this to be sweeter, they can just wait until after this is cooked and add a little Splenda or other artificial sweetener. I say this because many type I diabetics cannot really taste sweetness very well. With me, for example, sometimes I can, sometimes I can’t. In case you don’t like this idea, James Beard suggests the approach of adding sweetener after cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meggan71"
},
"reviewBody": "We just peeled, cored, and quartered the apples, (a mixture of varieties, but mostly winesap) and put them in the crock pot with the suggested amount of spices and an inch of raw chopped ginger root. This applesauce is delicious!!! I just stirred mine, didn't really whisk it, because I like chunky applesauce. Did not add any water or sugar- already planning to buy another 10 pounds of apples because this won't last through the weekend with my family!! Yum!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vindocusa"
},
"reviewBody": "This is the best apple sauce hands down. Excellent flavor. No sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leon'sLusciuosLoaf"
},
"reviewBody": "What a strange way to eat apples. I ate 5 pounds of apples in two days. Cooking takes out the Vitamin C. Pealing takes away the fiber. Still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenchenko"
},
"reviewBody": "I LOVE this applesauce! It tastes fantastic and has absolutely no sugar. I mean how much easier could it be? I used 3 lbs of apples and got 2 cups of applesauce. This is going in my daughter's no sugar added first birthday cake later today if I can keep from eating it myself! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Nagle"
},
"reviewBody": "Sugar free! If you use tart cooking apples you will have tart applesauce. If you use sweet eating apples you will have sweeter applesauce. The blend of spices is very , very good. I used an immersion blender and added a little water until I had the consistency I wanted. You don't need sugar or sweetener if you use a sweet eating apple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg"
},
"reviewBody": "Oh. My. God."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari Altman"
},
"reviewBody": "I made this twice with 10 lbs of slightly blemished apples. I used 50% more spices and added the juice of a lemon. So good - my bf agreed to help prep the apples the second time around as he liked it so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I made it exactly following the recipe the first time. It's pretty wonderful but the cinnamon flavor was too strong because I used the fabulous intensely flavored Vietnamese Saigon cinnamon from Penzeys Spices. The second time I made it, I reduced the cinnamon to 1tsp. and it was perfect! I suspect that 1 1/2 tsp. of regular cinnamon, like McCormick's, would work very well. Also, I used 2 bags of peeled and sliced apples in a 3 1/2 qt. slow cooker. It made just less than 2 cups, about enough for 3-4 servings. Really good and no sugar needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Smart"
},
"reviewBody": "I made the applesauce exactly as written. It tastes incredible, and the aroma in the house while it's cooking is absolutely amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fallon Hanson Duff"
},
"reviewBody": "This is AWESOME!!! My kids love it!! I just need to make a bigger batch! I wouldn't change anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Penny G"
},
"reviewBody": "I made this last week with fresh picked Macintoch apples and it was fantastic!. No need to add sugar.. Am going to make more this weekend for canning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nolwe"
},
"reviewBody": "I've made this twice now. My husband who is diabetic, devours it. The only change I've had to make is to shorten the cooking time to 1-2 hours on high."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette Tessier"
},
"reviewBody": "Very good but a bit to cinnamon, so I added another 6 pounds of apples, Awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Martin"
},
"reviewBody": "I used 10 gala apples (about 4.5 lbs), and the seasoning as called for. Very simple and delicious! The sauce whisked easily into a chunky applesauce that I canned in 1/2 pint jars - it made 6 jars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Call Me Alice"
},
"reviewBody": "This was perfect! I dumped a bunch of apple chunks (not thinly sliced, but peeled, quartered, cored, then quarters cut in half or third) in a slow cooker, sprinkled on spices, and walked away. I didn't use the full measure of spices (probably used less), but the slow cooking strengthens them so much that it didn't matter. Also, the no-water thing was a leap of faith, but it was perfect! No burning, just apples releasing their own juices to be cooked down. And, yes, a whisk really is all you need to break up the apples when they are done cooking. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jhintc"
},
"reviewBody": "Only use cinnamon, delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Strongbygod"
},
"reviewBody": "Very good. I only did it for a serving of 4 so I was thankful Allrecipies adjusts the measurements. So I did it for high on 3 hours, then low. I did add two tablespoons of Maple Syrup, and it was so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mfbama"
},
"reviewBody": "Hands down the only applesauce recipe I will ever use again. My 8 year old daughter brags to all of her friends that her mom makes the best applesauce--she has no idea that it only has 4 ingredients and none of them is sugar! I bought 2 bushels of mixed apples from the market last year and made 10 lb batches in my larger slow cooker. I froze the batches and had homemade applesauce all year. Now I'm making more with this season's apples and my daughter gets so excited when she gets home and smells it cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TruffleCream"
},
"reviewBody": "I thought for sure that the amount of spices specified would be too strong; they were not. I used five pounds of Red Delicious. I was tempted to add water at the outset, but did not, and I was glad I hadn't when it was finished, because it was plenty juicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carlacares"
},
"reviewBody": "Made this exactly as the recipe called for. Let it cook on low overnight so probably doubled the cooking time. So good and so easy. Great for less than perfect windfall apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoMama"
},
"reviewBody": "It was perfect! And a quick alternative to my usual all day applesauce project! The house smells amazing...just like cider!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Bain"
},
"reviewBody": "I used 1kg of pink lady apples and halved the recipe. I was a little worried about not having enough liquid (I'm new to slow cooking and it seems all the recipes call for a splash of something!), so I added a bit of water - no need! The apples have enough juice in them as is :)\n\nI'll be honest, it looks quite unappetising (brown and lumpy...) but tastes GREAT! It was sweet enough without any sugar or honey. I had it with a dollop of greek yogurt and mixed through my oats - yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Manos Emms"
},
"reviewBody": "Had a bunch of apples (different varieties) that needed to be used up. Added 1/2 cup water, because it started to stick. Took about 3 1/2 hours on high. Used immersion (stick) blender to blend it all up. I needed to add 2-3 tablespoons of brown sugar after tasting. I think because of the different varieties of apples used - it was a bit tart/sour than it normally would have been. I love that it has NO added sugar and you can adjust accordingly if needed. Super easy and the house smells fab. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Slow Cooker Applesauce NSA Haiku: \"If you add sugar, it is NOT this recipe. This is great as is!\" There is a comparable recipe on here for a spiced applesauce in the slow-cooker that calls for sugar, so make that if you want the extra sweetness, otherwise, this recipe is just perfect the way it's written! The only thing that I did was add about 1/2\" of water at the start, and ohhhgosh after a little while, the smell was wonderful. Ran my immersion blender through it to serve to the baby, and I had mine straight from the crockpot warm w/ some plain Greek yogurt and a sprinkle of granola. GOOD STUFF, thanks Cookingfor7!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sailerbabe"
},
"reviewBody": "Fantastic. I used Granny Smith and pink apples, ginger, lemon zest and small amounts of cinnamon and all spice. House smells great too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LillyZackMom"
},
"reviewBody": "This is a REALLY good and easy applesauce! I used 5lbs of Honey Crisps we picked two months ago that were just starting to get soft. I cooked this on low for 8 hours, and then cooked it for another hour with the lid off the crock as the applesauce was VERY soupy. I am used to sweet applesauce, and find this has a bit of a bite to it in addition to the sweetness, and I'm just not sure I love that. I added 1/2 packet of Truvia to the portion I just ate, and that softened the kick. If you're looking for an overly and overtly sweet applesauce, this isn't for you....but it is FULL of flavor and very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fern-Dave Slotman"
},
"reviewBody": "Fantastic recipe. Made just as directed. I did add a touch of Cran/Apple juice to keep it from sticking. I used an immersion blender to whip it up. I'm now going to freeze it in small portions for my mother-in-law to enjoy over the winter. And I agree with another reviewer-if you add sugar you're making a completely different recipe. My M-I-L is diabetic and I didn't want to add any sugar. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swhatley42"
},
"reviewBody": "I used a mix of Mutsu, Pink Lady, Fugi and Goldrush and let me tell you, it was AMAZING!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Jenkins"
},
"reviewBody": "Ok. The point of this recipe is its sugar free. So those who added sugar have created a different applesauce and really shouldn't have commented here. I am looking for a sugar free applesauce and this recipe exactly as it is, is perfect. Even the water is not needed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyla"
},
"reviewBody": "Just made this recipe today. It turned out great! I had a ton of apples that were given to me and no way to eat them fast enough. This recipe turned out delicious, and did not need any sugar. I only cooked it for 3.5 hours (it was definitely done by then), and I added 1/2 cup water at the start so it wouldn't stick (which it was doing). \n\nI'm definitely making this again! It's very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo"
},
"reviewBody": "I tossed the apples with a tablespoon of lemon juice (to prevent browning and to give it a little tartness) and added a quarter cup brown sugar to this recipe. I also used a combination of apples and even threw in a couple overripe pears! Very nice. GREAT for using in baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dq67"
},
"reviewBody": "Just finished this and it is out of this world! You honestly don't miss the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Gage Foster"
},
"reviewBody": "This applesauce came out just wonderful, very tangy/sweet and flavorful. I used a bunch of different varieties of wild apples picked from the woods and by the roadside around my house. I especially loved that it was a bit chunky when done. While slicing the apples, I tossed them in a few drops of lemon juice to prevent them from browning. I also threw in a couple teaspoons of brown sugar for a bit more sweetness. Thanks for offering this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Ann Martel"
},
"reviewBody": "Made the applesauce sooo!! good, used left over applesauce and made mini apple pies with crescent rolls!!Yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melyssa"
},
"reviewBody": "This recipe turned out absolutely delicious! The only things I added were a handful of brown sugar and about a 1/2 c of water. I also used three different kinds of apples which really made it yummy (Golden Delicious, Fuji, and Honey Crisp). This was so easy and made my entire apartment smell delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie B"
},
"reviewBody": "Sweet &amp; Spicey best ever applesauce. And since there is no added sugar my husband can eat it. He has to watch the added sugars in his diet. My daughter &amp; I can't wait to make it again. Debbie B."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miriaha Wehman"
},
"reviewBody": "I added a little brown sugar and about a half cup of water to this recipe, and it turned out fabulous. Cooked on Low for about 5 hours. The whole house smelled heavenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookingfor9"
},
"reviewBody": "Try using a variety of apples for a wonderful cider blend. We've used Gala, Jonagold, Fuji, and Granny Smiths at different times and they all cook up beautifully!\n\nThis applesauce truly is wonderful without adding any sugar! The spices and flavors from the apples themselves give it a rich, sweet blend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakingmomof2"
},
"reviewBody": "I used 12 Ginger Goldens,and 3 Honey Crisp along with 1 1/2 cups of Apple Cider. Slow cooked on low for 7 hrs before blending it in our food processor then canned them in 4 pint jars. No Sugar Added!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228653/slow-cooker-cider-applesauce-no-sugar-added/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1333/side-dish/applesauce/",
"name": "Applesauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228653/slow-cooker-cider-applesauce-no-sugar-added/",
"name": "Slow Cooker Cider Applesauce (No Sugar Added)"
}
}
]
}
}
, "about": [
]
}
]