				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow-Cooker Corned Beef and Cabbage"
,"datePublished": "2005-03-23T11:17:40.000-05:00"
,"dateModified": "2022-10-26T08:39:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "LUSYRSGIRL"
,"url": "https://www.allrecipes.com/cook/611781"
}
]
,"description": "Cook corned beef in a crock pot for a foolproof and delicious St. Patrick&#39;s Day dinner that slow cooks all day and lets you celebrate the easy way!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lcV9JuIeCcfLaFjxRqHCSZH6nSs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2152835-422dbdf413094ce19c4bbe862a7f2414.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2011536022001",
"description": "Watch how to make perfect corned beef.",
"duration": "PT3M17S",
"name": "Slow Cooker Corned Beef and Cabbage",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/614e482f-a271-4f3e-ac65-7e2d626c578a/5fa32d0e-2433-4e18-8b50-be4f5ed66912/1280x720/match/image.jpg",
"uploadDate": "2021-03-03T06:01:18.295-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow-Cooker Corned Beef and Cabbage"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "2055"
}
,"cookTime": "PT480M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "473 kcal"
,"carbohydrateContent": "50 g"
,"cholesterolContent": "100 mg"
,"fiberContent": "7 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "1281 mg"
,"sugarContent": "7 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"10 baby red potatoes, quartered",
"4 large carrots, peeled and cut into matchstick pieces",
"1 onion, peeled and cut into bite-sized pieces",
"4 cups water",
"1 (4 pound) corned beef brisket with spice packet",
"6 ounces beer",
"0.5 head cabbage, coarsely chopped" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place potatoes, carrots, and onion into the bottom of a slow cooker; add water and place brisket on top of vegetables. Pour beer over brisket; sprinkle over spices from the packet and cover."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lcV9JuIeCcfLaFjxRqHCSZH6nSs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2152835-422dbdf413094ce19c4bbe862a7f2414.jpg"
}
]
,"text": "Cook on High for 7 hours; stir in the cabbage and cook for 1 more hour."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT495M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I did not make it our neighbor Mike made it and it was terrific! It was wonderful! He always likes to cook for a group of us and we are never let down, no matter what he chooses to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did this recipe once, and the vegetables came out way to mushy, now I just add a can of beer, and 6 oz of water, half way through the 8 hours I skim all the jelly fat off, and after 5 hours I add my vegetables on top of the corn beef, not in the water, and it steams the vegetables perfectly, not mushy. I like my vegetables just a little on the firm side, not much, still soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made this with the main difference being that I cooked on low, I used large carrots cut into roughly one inch chunks, and I added the veggies later to keep from over cooking them. (Thanks to Kat H review.) It came out absolutely fantastic! Very easy recipe to follow. The corned beef was tender, juicy and delicious. The veggies all cooked perfectly without being too soft and were very tasty. Sorry, we had eaten it all up before I even thought about taking a picture, but It looked as good as it tasted. I'm keeping this one as a \"frequent flyer\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Usually every year I just tolerate corned beef and cabbage, but this recipe is amazing. I used Belgian White for the beer, and we let it cook for 10 hours, and added the vegetables in the last 3 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "The recipe was easy to make and I followed it exactly as written. I liked it and it was worth making one time-but I won't make it again. I made an almost identical recipe using an Instant Pot and I really preferred that method over the slow cooker. Thank you for the recipe!! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dennis"
},
"reviewBody": "I cooked it on low rather than hi, as suggested by the recipe. Otherwise, it would have been ruined!! I liked it only because I cooked it properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Norberg"
},
"reviewBody": "This was great and my husband loved it. I used a mixture of whole baby potatoes and used beef broth instead of water. Wonderful!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Simple and it was terrific. I got 5 stars from my guests. I used a lean flat cut and it took less time than the recipe called for which was a good thing because I started late."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this just as directed but used angry orchard instead of beer because I’m gluten free. Everyone loved it said it was delicious. I think it’s important to put your veggies underneath just like the recipe states keeps it from over cooking. My veggies were great too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiefmom"
},
"reviewBody": "My husband is always asking for Corned Beef and Cabbage for St. Patrick's day. First try last year was not good, very dry. Found this recipe and my husband was in love. Simple recipe, I am so happy he enjoyed it. He called me to tell me the meat was SO juicy. I think he was more in love with that meal at that point. LOL."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dhesser79"
},
"reviewBody": "I have been making this recipe for several years. Delicious! I use a whole bottle of Killian’s Irish Red for the beer, which adds wonderful flavor. I cut the water back by 1 1/2 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andi"
},
"reviewBody": "Should I rinse it, you ask? I’ve been making this t for years and have never done so. I discard all the juices in the packaging though. ( no place to reply with a comment)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom of Two"
},
"reviewBody": "This was my first attempt at making corned beef and cabbage and this was a hit at my house. Super easy subbed beef broth for water, was lazy and dumped in a bag of matchstick carrots instead. Also as someone previously posted I cooked on low, 3 hours in put in on high for an hour and a half, then back to low."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arentsen"
},
"reviewBody": "Absolutely perfect for St. Patrick’s Day. The recipe is correct. 8 hours on high. Very tender meat! My whole family went back for seconds! They ate it all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Southflgal"
},
"reviewBody": "I make this every year for St Patty's Day. I forgot to buy beer, so used root beer as a substitute, which is fine. Have always used chicken broth instead of water and one year used beef broth; either is much better. I put potatoes on the bottom and meat on top, on high for 4 hours. By then the potatoes are done, so I remove them and add the onions, carrots and cabbage on top and around the meat on low for 4 hours. The extra cabbage I had on hand, cooked in a separate pot with chicken broth, Italian seasoning and bay leaves. Threw them all together at dinner time and it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tailgate_Chef"
},
"reviewBody": "I did not see a question link so I will ask it here and post a review later. Do you rinse the brisket before putting it in the slow cooker?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rAwjAm"
},
"reviewBody": "After reading many reviews, I made a few changes based on others' recommendations. I cooked on low, not high, for a total of 8 hours. I started with the corned beef on the bottom, added the liquid (all water, no beer), the season packet and the onions. After 5 hours I added the potatoes and carrots for the final 3 hours. At hour 7 , I removed several cups of the broth to cook the cabbage in my dutch oven for the final hour of cooking (since my crockpot was too full to hold the cabbage). Everything was cooked to perfection. My family absolutely loved it. This is my new go to recipe for St. Pat's Day feast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Probably THE worst corned beef recipe I ever made. Bland! Bland! Bland! Added cabbage 2 hrs before meal was to be done and it did not cook. It was so disappointing- and I am not some novice cook who doesn’t know how to follow a recipe. Biggest error in this recipe is the instruction to cook the corned beef on high. Some significant research and talking to some professional chef friends, I was told corned beef should NEVER be cooked on high as this will render the meat tough- which also happened to me. This meal was bland and tough- just awful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My dad made this every year. I’ve attempted it many times. Not this recipe in particular. Ive been looking for the right recipe. I might have found it. I cooked 4 lbs on high for about 4 hours with same amount of veggies, give or take on the potatoes. I put a full can of beer and adjusted on the water. I mean come on. I put it on low, after 4 hours and put the cabbage in. Cooked it one hour. Sliced the meat, put it back and put it on warm. Veggies weren’t mushy. Best yet and I’ll keep this recipe as my corned beef and cabbage recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary C"
},
"reviewBody": "After reading previous comments, high and low settings I decided to combine. I put a supermarket brisket in which I had no confidence in along with the water and beer. I set it to high. 1.5 hours later I changed it to low. 3.5 hours later I added all of the veggies putting the beef on top then setting it to high again. Two hours later I reset to low and one hour later I served it. Absolutely perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Peters"
},
"reviewBody": "Was looking for something quick (prep time) and tasty. This recipe hit both boxes. I took a couple suggestions of keeping the veggies out till the last three hours, though this probably could have been down to two hours. Also increased the amount of veggies. I wanted to use Guinness but took the advice and used a light beer, Molson Canadian... as close to Ireland I could get to today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It turned out delicious using light beer and chicken stock. I cooked mine on the Low setting for several hours,then turned it up to Hi, for the last hour when the cabbage is added. The alcohol in the beer evaporates pretty quick, so if someone can't have alcohol, don't be concerned as there will be none after cooking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made it just waiting for it to be done I used Bud lite, I’ve used Guinness before it didn’t taste right so I’ll see how it taste soon I only added some pink Himalayan sea salt in the water, it smells amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackie"
},
"reviewBody": "I used red wine vinegar in place of beer. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy"
},
"reviewBody": "Have made this my go to corned beef &amp; cabbage recipe for several years now. I tweaked like many others, 2 cups low sodium beef broth &amp; 2 cups water, 2 cloves garlic, 2-3 quartered shallots, adding veggies later, halved brussel sprouts instead of cabbage for the last hour. It's always a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mekmann"
},
"reviewBody": "Happy St Patrick's Day y'all!! Here's a foolproof take on this recipe... I put the beef in first, then the onions, then the large baby carrots, then whole redskin potatoes. I only use 2 cups of water and I skip the beer. You really don't need that much liquid, plus more water comes off the veggies. If you use whole potatoes you can leave them in the whole time and they don't overcook. Same with larger baby carrots. There is also a creamy horseradish sauce floating around out there that I make with it and it is amazing on the beef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy and delicious. I added more veggies to the recipe as my family eats a lot of them at all meals. I used Killian's Irish Red Beer. Mmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making this version of Corned Beef and Cabbage almost every year since March 2010. I never change a thing, and we love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Hall"
},
"reviewBody": "Just put my beef is the slow cooker. I used Budweiser instead Guinness. It tasted horrible last year. Bud and Coors lite are good cooking beers. I’m giving it a 4 stars for right now until it’s done in 8 hrs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Going to try this tomorrow but we don’t like beer. Can I substitute the liquid for non alcoholic?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Iknow it well, and I LOVE it Very Well!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katieanne"
},
"reviewBody": "Have been making this recipe since 2017 and love it. Easy to prepare, no unusual ingredients and always tender and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "WAY too early to start the vegetables - soggy mess. I add them about three hours before serving time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trixie"
},
"reviewBody": "Outstanding! I put meat on bottom vs. on top and surrounded with veggies. Used a whole a 14oz can of Guiness Draft Stout and therefore three cups of water. Added cabbage during last hour as suggested. Excellent. Thank you LUCYRSGIRL!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "This was easy and excellent! I had a 4.4 lb brisket, and wanted more cabbage and carrots, so had to cook some of the cabbage separately. I also made a few minor adaptations: I changed the water to chicken broth, and added a bit more spice (a few peppercorns, coriander seeds, cardamon pods, a couple small bay leaves and mustard; toasted for just a few minutes in an iron skillet and then ground up in a clean coffee grinder). I also did not add the carrots, cabbage and potatoes until about 2 hours before the corned beef was finished, and they turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gramreid"
},
"reviewBody": "I have been making this recipe as long as there has been crockpots!!! Love this! The only thing different I have had to do is having a large family to feed this I Cooked my cabbage in a very large skillet using the juice from the cookedcorned beef. I would just put the beef and veggies on platter, empty juice out into skillet and place meat and veggies back into cooker again on warm. Cook cabbage in juice and it’s wonderful! Never any left overs!!! Sometimes I have to cook 2 corned beefs! Lots of company!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobby P."
},
"reviewBody": "Great recipe. I like using baby carrots, adding a couple of bay leaves and using baby dutch yellow potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did the recipe the way they instructed, and the corn beef turned out pretty well done. I then tried following the Karens in the comments list complaining about using low heat instead, so I tried that method. Although the meat was tender, the fat wasn’t rendered properly. Although the layers of corned beef broke away nicely, there were still gobs of fat all over that made the dish less appetizing, even though I added an extra hour to the cooking time. I would vouch for a higher heat for a lower period of time. This is beef after all, and is contained in an environment which retains the moisture, so using high heat is fine. It’s not going to dry out anytime soon, unless you weren’t able to cover it all the way with water. Cutting the potatoes after you cook them is the best way to retain their consistency. Cutting larger chunks will help the other vegetables retain their consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jo Cross"
},
"reviewBody": "Perfect and delicious! I used a skunky beer, and 2 cups of hot beef broth (added when adding the potatoes). Cooked the brisket on low 7 hours, potatoes for 4 hours and halved Brussel spouts for 2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rsvacek1123"
},
"reviewBody": "Used this recipe 3 years now. PERFECT corned beef; made changes (as many reviewers did) to cook on low and add vegies at mid-point. After using this recipe, you won't want to go out to the local pub for your corned beef ever again (except maybe for a Guinness)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Quick Kelly"
},
"reviewBody": "This is my go to way of cooking Corned Beef, we have it ever year at the beach My family loves it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tinkerbello"
},
"reviewBody": "Excellent. I didn't change any ingredient, just put the vegetables in later. Thank you for the submission!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rach Z"
},
"reviewBody": "Easy, hearty meal. Great recipe with following alterations: Changed temperature from high to low for 8 hours. Substituted the water for beef broth. Put beer (Shiner Bock) and veggies in at halfway point."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle Rice"
},
"reviewBody": "Double delicious....My change was I mixed dill mustard with the water in a blender then I added to beer, sliced onions and corned beef in crock pot. I like smashed potatoes (on the side) better than the boiled but love the cabbage and carrots....I added Modelo Beer ... I used less water and the whole can of beer..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I would recommend adding the vegetables in until the veggies in until the last three hours of cooking time. That way they won't turn to mush."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "My first time! It was risky of me to make something new, and invite people over for dinner. I followed the cooking time suggestions of another reviewer(abapplez) starting with the beef 9am, adding the potatoes, carrots, 2pm and then the cabbage4pm last, dinner at 6. I did use the beer and low salt beef broth. Next time, I'll reduced the potatoes, we are not potato eaters, and double/triple the carrots. Going out for a brisket this morning,we ate all the beef. I need leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "seany42o1"
},
"reviewBody": "The corned beef needs to be on low and then 9 hours works. Do NOT put the veggies in, any of them, until about 2 hours left or u will just have soggy mashed potatoes. Dunno y that’s in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mismagmax"
},
"reviewBody": "Great recipe. I made it without the beer and the family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a whole head of cabbage and the whole bottle of beer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KP54"
},
"reviewBody": "I bought a corned beef brisket at Costco and didn't want to toil with the stove top directions so I found this crock pot recipe. I'm a bachelor who is not very good in the kitchen so I like things simple. I basically followed the recipe with the following minor adjustments: I dumped in a 1 lb bag of baby carrots, 1 bag of ping pong ball sized un-cut skin-on whole red potatoes, 32 oz Beef broth, 1/2 cup of water, and 8 oz of the only beer I had (a blood orange ale), and placed the corned beef on top with the spices. Like some I thought 8 hrs on high was too much but decided to trust the recipe. I had a medium size cabbage and didn't know what to do with the other half so I cut up the whole thing in to fairly large chunks, took the meat out, dumped the cabbage in, and put the meat back on top for the final hour. My crock pot was packed to the gills. The meal turned out delicious. Nothing was mushy, &amp; the meat was tender. This was stupid-simple even for amateur me. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob"
},
"reviewBody": "Awesome !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Shifflett"
},
"reviewBody": "Perfect recipe, made this numerous times and it always comes out delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was fantastic. I took 2 onions and large julienne cut them, no carrots or potatoes . Added the water and 3 cubes of beef bullion. Put in the meat and seasoned with garlic salt and pepper. Added the beer and seasoning. Slow cooked over night for 11 hours then added the cabbage for another 1 1/2 hour. Perfection at it's best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vicki936"
},
"reviewBody": "Used a 3.5 lb flat corned beef brisket from HEB - Murphy &amp; David's corned beef brisket 1 1.5 lb bag of baby red potatoes, halved (entire bag) 1 onion, sliced thickly and placed in the bottom first 4 thick carrots, cut into large chunks half can of Shiner Bock followed recipe to a T - set crockpot on High for 8 hrs. chopped cabbage and added after 7 hours Meat was good, not falling apart and I was able to slice. Did not really like the flavor of the broth and veggies. Might like better using beef broth instead of beer. Made a sweet mustard sauce and Irish soda bread to go with it and used the leftovers to make sandwiches the next couple of days. Good economical meals. The mustard sauce saved it for me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was TOTALLY delicious and will make it again and again. Thanks for sharing it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ked"
},
"reviewBody": "This was super moist! Really good! I did put it on low not high for 8 hours like others noted and I used 1/2 beef stock 1/2 water because my beef stock was not low sodium and I didn’t want it to be too salty. Also only put onions in in the morning put the other veggies in about 1/2 way through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turned out perfectly. I decreased the amount of beer by 2 oz as to not overpower, and it was delicious. I cooked on high for 8.5 hours. It's winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Retmtrcp"
},
"reviewBody": "I have been using this recipe for several years and have never been disappointed. I use Guiness Stout as the beer, some low sodium beef stock, and I also added 3 cloves of garlic and put the onions and garlic in with the brisket. Then I wait about 2 hours before placing the potatoes and carrots into the slow cooker on top of the brisket. This was to prevent the carrots and potatoes from getting too mushy. About an hour and a half before serving, I put the cabbage into the slow cooker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LPPeter"
},
"reviewBody": "It's very good. But 8 hours on high is overkill with my slow cooker. 8 hrs on low works just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy and delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe but I do suggest if using a slow cooker, cook it on LOW for 8 hours not high. As long as the meat is at suggested weight. Over all a great meal to make while you are at work. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Only 1 hour for the cabbage left it under cooked for my taste, will try at least 2 hours next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe except for the vegetables being cooked to long. They were way to soft/mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "The flavor of this corned beef is good, I just need to work with my crock pot. Thanks to these reviews I checked on it at the 5 hour on high progress. I had put in carrots and potatoes and corned beef. In 5 hours on high potatoes we’re starting to fall apart and the carrots were close. I took them out of the cooker and put in a bowl. I took the corned out and trimmed the fat off. I put the corned beef back into the pot. Don’t put your veggies in so long. Now I will cook the corned beef another hour…..then add the cabbage after it cooks a couple hours I’ll check it. This is a good recipe, crock pots cook at different temps!!!! ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ken Gonsiorek"
},
"reviewBody": "8 hrs on high? All the veggies were mushy after 4 hrs, and the brisket was nearly done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "anncms717"
},
"reviewBody": "9 hours was way to long . I cooked only 7 1/2 hours. Used baby carrots they turned out mushy. The potatoes were mushy. Put cabbage in for 2 hours it was close to being done. Sorry I will not use the recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Came out perfect. Moist and flavorful. I added garlic powder and black pepper to the spice packet that came w the corned beef. I have made it with and without the beer. Both ways were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juanita McCue"
},
"reviewBody": "Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Hampton"
},
"reviewBody": "Great dish! It was easy to make, and I loved putting it in the slow cooker. My whole house smells delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Relyk"
},
"reviewBody": "Excellent and simple! Used this recipe for the last 4 years"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe! I switched out 2 of the cups of water for beef stock and used Killians Irish Red Ale for the beer. Like someone else said, don’t use Guinness Extra Stout for cooking…ever! Way too strong! I used it a few years ago in an Irish Stew that called for a bottle of regular Guinness, and it ruined the dish! I also cooked this on low, instead of high, in the crock pot for 8 hours, and it was tender and moist and didn’t overcook the potatoes and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bumpusk"
},
"reviewBody": "My first attempt at corned beef &amp; cabbage and for a St. Pat's party no less. Not only was it extremely easy--it was completely gone--not even a scrap of leftovers. I was repeatedly told it was the BEST corned beef and cabbage anyone had ever had!!! (better than their mother made!!) Thank you for this great recipe!!! I used Killian's for the stout. Great, great recipe--I will use it often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dropkickm911"
},
"reviewBody": "This is how I always cook mine but I do it on low for 10 hrs and use red beer. I use lone tree brewing out of Colorado. If you don’t have that you can use Killians."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoriBob"
},
"reviewBody": "Very good. Just a hint. I have found the small bag of spice that comes with the corned beef is not quite enough to flavor meat and veggies both so I buy pickling spice an put it in a metal ball tea strainer and leave it in while cooking. The spice doesn’t end up in my cabbage. Hope it works out for you too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Do not put 4 cups of water in this. I made this for our New Years Day meal. Very little flavor because of the water. 2 cups are more than enough water and you can leave the beer out as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Levon Jackson"
},
"reviewBody": "Absolutely fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJ Sutton"
},
"reviewBody": "PLEASE READ! Had this for dinner last night and it was amazing. The main thing people need to know here is to cook the corned beef on high like the recipe says. It is correct. The meat is not dry but incredibly tender. Even more so the next day. Yes, it will be edible if cooked on low but the texture is so much better if cooked as directed. I doubted it too but it really does just melt in your mouth like butter. Only thing I changed was the liquid. I used 3c water-4oz beer and 4oz hard apple cider. Oh, I did throw in a couple bay leaves and 2 cloves of garlic. Best ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary Kany"
},
"reviewBody": "Ok after reading reviews of people saying it had no flavor. I decided to use Budweiser and 4 cups of beef broth instead of water and it came out much better. Lots of flavor. I definitely wouldn't just use water!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "This recipe was the best. Corned beef was tender and delicious. Low and slow for 9 hours. My quest for a great corned beef recipe is over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Mama"
},
"reviewBody": "Btw - I kept the slow cooker on high this time for 7 hours and liked it even better! It was super tender and moist, melted in my mouth. I liked the veggies soft, easy for young ones to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessie"
},
"reviewBody": "I have managed to completely ruin this meal before, but ever since I started making this recipe it has turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pikakitty69"
},
"reviewBody": "This recipe was perfect by itself. My whole family enjoyed it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Miller"
},
"reviewBody": "This is the best tasting corned beef dinner I’ve ever made. My guests raved about it too! Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ihateliver"
},
"reviewBody": "So easy and so delicious! For some reason, I was always intimidated in making corned beef and cabbage, but this year I decided to give it a try. Wow, so good and so easy. I shared the recipe with my sister and she made it and loved it as well. I actually went out and bought 2 more corned beef briskets and put them in the freezer for the future as its hard to find after St. Patty's day around her. Obviously, will be making again! Many thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "This was the best recipe for corned beef and cabbage that I’ve made so far. The potatoes, carrots and cabbage were so full of flavor. I’ll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keri Colasanti"
},
"reviewBody": "My mom LOVED it and so did my nieces and nephews. There could have been more cabbage, I think, and the potatoes were a little too soft, but the meat was like butter. I will make it again and probably just shorten the cook time by an hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KLG"
},
"reviewBody": "This was the best ever!!! I almost gave up trying to make corned beef &amp; cabbage on St. Patty’s Day. Wish I’d found this recipe a long time ago!! This is my forever go to!! Quick, easy, &amp; delicious! Even as leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John McFarland"
},
"reviewBody": "It was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Chavez"
},
"reviewBody": "No No changes followed the recipe exactly turned out awesome corn beef was tender all the veggies were perfect this is indeed an excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael J"
},
"reviewBody": "If you do it on high check for doneness after 3 hours. Mine was veey dry after 4.5 hours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kareno"
},
"reviewBody": "Lovedthe receipe so did the family. .will never make it on the stove again. Easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannon"
},
"reviewBody": "A great recipe made the whole meal so much easier. I used to steam the cabbage and boil the potatoes and then try to add flavor to it with butter and salt and pepper this method gives it all the flavor you need. Thanks so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Walsh"
},
"reviewBody": "This was the best corned beef and cabbage that I've ever made. Slow cooker is the way to go. The 9 hour cook time was well worth the wait. I even used the cheapest corned beef.. Glad I did because it came out so tender and juicy. I made it step for step. Thanks for sharing this wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "This came out amazing! I thought high on 8 hours sounded much, but it was so good!! The meat practically melted in your mouth. My VERY picky fiancé said it was the best corned beef he has had!! I used coors light since that’s what was in the fridge. I left out the carrots and potatoes because I feel like they get slimy from the meat fat and don’t save as leftovers very well, but I followed everything else exactly in the recipe. This is my go-to corned beef recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raymond Ziegler"
},
"reviewBody": "Can't go wrong!! Full proof! EXCELLENT!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timo"
},
"reviewBody": "Excellent recipe! But I wanted to tweak a bit. I used a 3.3 lb eye of round brisket, rinsed. Poured in 32 oz beef stock, 1 cinnamon stick, 1 bay leaf and 1 tbsp brown sugar and added enough water to come up 2/3 to top of brisket. To build a crust I coated the exposed brisket with 1/2 tsp each allspice, coriander, onion powder, garlic powder, and whole black pepper corns. I set to HIGH in my 370 Watt crockpot for 6 hrs. I then added the potatoes, onion and carrots for an additional hr. I then added the cabbage for the last hr, total cook time on HIGH was 8 HRS. Ms. Murphy had three servings! I'd call that a success. It was delicious!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/472/main-dish/beef/corned-beef/",
"name": "Corned Beef Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1449/main-dish/beef/corned-beef/corned-beef-and-cabbage/",
"name": "Corned Beef and Cabbage Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/",
"name": "Slow-Cooker Corned Beef and Cabbage"
}
}
]
}
}
, "about": [
]
}
]