				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Texas Pulled Pork"
,"datePublished": "2020-03-04T23:59:43.000-05:00"
,"dateModified": "2023-02-10T11:26:39.154-05:00"
,"author": [
{"@type": "Person"
,"name": "cmccreight"
,"url": "https://www.allrecipes.com/cook/1235426"
}
]
,"description": "This pulled pork recipe braises pork shoulder in a tangy barbeque sauce in the slow cooker until fall-apart tender. Delicious served in toasted buns."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4toTNyx2t4jAqMtr9TaC1OjZLos=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/92462_Slow-Cooker-Texas-Pulled-Pork_psychedilemma_4560053_original-1x1-1-e3c3aa5d5a10431b8b5cb589174c0060.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780426219001",
"description": "See how to make tender pulled pork with flavor as big as Texas.",
"duration": "PT3M24S",
"name": "Slow Cooker Texas Pulled Pork",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2022/09/07/92462_Slow-Cooker-Texas-Pulled-Pork_psychedilemma_4560053_original-4x3-1.jpg",
"uploadDate": "2021-03-02T08:11:21.007-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Texas Pulled Pork"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "3104"
}
,"cookTime": "PT300M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "528 kcal"
,"carbohydrateContent": "46 g"
,"cholesterolContent": "98 mg"
,"fiberContent": "3 g"
,"proteinContent": "32 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "803 mg"
,"sugarContent": "17 g"
,"fatContent": "23 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 teaspoon vegetable oil",
"1 (4 pound) pork shoulder roast",
"1 cup barbeque sauce",
"0.5 cup apple cider vinegar",
"0.5 cup chicken broth",
"0.25 cup light brown sugar",
"1 tablespoon prepared yellow mustard",
"1 tablespoon Worcestershire sauce",
"1 tablespoon chili powder",
"1 extra large onion, chopped",
"2 large cloves garlic, crushed",
"1.5 teaspoons dried thyme",
"8 hamburger buns, split",
"2 tablespoons butter, or as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pour vegetable oil into the bottom of a slow cooker. Place pork roast into the slow cooker; pour in barbeque sauce, vinegar, and chicken broth. Stir in brown sugar, yellow mustard, Worcestershire sauce, chili powder, onion, garlic, and thyme. Cover and cook on Low for 10 to 12 hours or High for 5 to 6 hours until pork shreds easily with a fork."
} ,{
"@type": "HowToStep"
,"text": "Remove pork from the slow cooker, and shred the meat using two forks. Return shredded pork to the slow cooker, and stir to combine with juices."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4toTNyx2t4jAqMtr9TaC1OjZLos=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/92462_Slow-Cooker-Texas-Pulled-Pork_psychedilemma_4560053_original-1x1-1-e3c3aa5d5a10431b8b5cb589174c0060.jpg"
}
]
,"text": "Spread the inside of both halves of hamburger buns with butter. Toast buns, butter-side down, in a skillet over medium heat until golden brown. Spoon pulled pork into toasted buns."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT315M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "I halved, using a 2lb pork shoulder. Was very tasty and tender but sauce was a bit too runny. Would make again and find a way to thicken - either by whisking cornstarch as others have mentioned or simply drain off as the flavors are mixed well into the meat. Overall, really good and easy to make. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The thyme made this inedible. I did as suggested, by cutting the vinegar in half but wish I had gone with my instinct to not add the thyme. We wasted 2 beautiful pork tenderloins on this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Phenomonal! Some thoughts. I choses to sear the pork shoulder before dropping in into the slow booker. about 3-5 minutes per side in a super hot pan with some oil. This carmelized the outside of the meat and when you get a nice charred piece in the final product they are excellent. then used that oil from the fry pan in the bottom of the slow cooker. since my 11 year old is picky, I cut the apple cider vinegar to 1/4 cup, glad I did as it was not overly tangly and I had read here that the ACV can be too over bearing. Its got tons of flavor. We toast slices of local ciabatta bread, and finished open face with Cole Slaw, pickles, cheddar/jack shred mix and a touch of hot sauce and extra BBQ. The best batch I have ever made, and frankly in the top 5 I ever tasted. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Great flavor! Easy to put together. I’m still on the quest for a less liquid, runny finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I had to modify this recipe for a 3 pound pork shoulder, but it worked well. My one tip of advice is to remove the shoulder when it's finished cooking and put it in stainless steel bowl to shred WITHOUT its sauce. To thicken the sauce once it's finished cooking, using a whisk, add 2 tbsp of cornstarch to the liquid while still in the crockpot, and let it cook on high for another 30 mins or until slightly thickened, then turn the pot to warm and re-add the shredded pork to the sauce. Another modification that I did was that I brushed the pork with liquid smoke and used a very molasses based bbq sauce, like Kansas City style BBQ sauce. It tasted amazing and the texture was excellent. And as per the reviewers comment, we reduced the vinegar and brown sugar by a little, but we thought that the recipe would have been fine with the full quantity. In the future, if I remake it again, I will use the full quantity of apple cider vinegar and perhaps 3/4 of the quantity of sugar as I tend to prefer sour to sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Restaurant quality flavor. Better than a lot of restaurants actually. Not too sweet, not too tangy. Tip: it’s too watery right out of the crockpot. Let it cool to thicken and reheat. Soaks up all the flavor better too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Thomas"
},
"reviewBody": "It was very delicious and was easily cooked in a crockpot"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A little too heavy on the vinegar. Also a little too liquid in the end, could fix that on my own though. otherwise rich in flavors, but again, vinegar is too strong for the richness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is our all time favourite. Not a big fan of the apple cider vinegar- I just do 3 tbs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Was excited to try this but sadly too vinegary for us and didn't really enjoy it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkingsley2"
},
"reviewBody": "Excellent recipe! Very delicious. I added some Pepperoncini peppers and a few splashes of Frank's red hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Glass"
},
"reviewBody": "I only had a 2.17lb shoulder roast, so I halved everything for the sauce. I set my slow cooker on low for 5 hours so I could check for doneness and adjust time as needed. At 5 hours, it was 165 degrees but not shredding. I let it keep going. I though there wasn't enough sauce, so I added 3/4c of chicken broth (made from boiling water and better than boulloin), about 1/4 BBQ sauce, and maybe 4 T of apple cider vinegar. 2 hours later, I shredded it and put it back in the crock pot. It stayed on warm setting for the next 4 hours, which helped to thicken the sauce. The taste was delicious! I was told it was the top 3 favorite foods of all time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Poole"
},
"reviewBody": "My children loved it i made it for new year omg they had me making sandwiches that whole day till the next day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jlynn"
},
"reviewBody": "Oh my gosh!! The best I’ve ever had! Even my pickiest eater ate her whole sandwich and wanted more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is still a winner with my little ones and adults every time! Hard to get both kids and adults to like something but this recipe does!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was amazing and the whole family loved it. The only thing I changed was that I removed the juices from the cooker before returning the shredded meat. This allowed me to added back the perfect amount of sauce as I thought it would be too wet with the amount of liquid leftover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe of course I changed it because I change everything. Omitted thyme, just not a fan, and chicken broth and sugar because of the other reviews. I put the meat in first and topped with ingredients added smoky paprika, and cayenne pepper. I didn’t have enough onion, so I added shallots. Served with Hawaiian rolls and homemade creamy coleslaw, YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Misquitta"
},
"reviewBody": "I agree with others that find this too runny. I added cornstarch but I could have boiled it down …. Otherwise, really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KessMom"
},
"reviewBody": "This recipe is very good! I cooked it in the oven, though. First browning the meat and onions for depth of flavor. Added just a bit of smoke flavoring and only a couple tablespoons of brown sugar. Baked it on 325 for 4 hours. The flavors go so well together, and it was absolutely tender and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "A home run! We followed recipe as noted and served to a full house of friends. Great taste and very moist. A keeper . ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this recipe multiple times, everytime it's amazing!!!! The only thing I suggest doing is, putting in the meat last. So you can properly mix up the ingredients. When done, lather the meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe! It can feed around 30 people with buns and coleslaw and a Smokey cheese. I don’t add brown sugar or thyme because I never seem to have any! Thank you - such a great go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely amazing. The only thing I did that wasn't on the directions was drain quite a bit of the watery liquid out. I was very skeptical half way through this because I tasted the liquid alone and I thought it tasted disgusting.... But once drained, covered in more bbq sauce and put on a toasted roll with mayo and provolone....omg to DIE FOR!!! My husband was audibly moaning while eating it!!! Lololol! This is such a yummy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RCFoodie"
},
"reviewBody": "Delicious and so easy! It wasn't overly spicy or tangy, just right. Made it served over mac and cheese and the flavors both married well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JimmyT"
},
"reviewBody": "One thing all these pulled pork recipes don't recommend that I found it very helpful is to cut the meat into 2\" - 3\" chunks before you start. This makes it so much easier to shred it at the end of the cooking rather than have to deal with long stringy pork. It has made my recipe so much more simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’ve made this for a couple years now for so many different things. It’s insanely good. I do wrap it in tinfoil and put it on the grill to give it a more Smokey flavor, and crisp it a bit. I also make a homemade slaw for the sandwich which is also a game changer. I love this recipe and so has everyone who has ever tried it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "I thought this was a perfect recipe. This is the first time I made pulled pork. I followed the advice of one of the reviewers and did the reduction at the end of the cooking time. I let the sauce simmer for about 30 minutes, then put it back in with the meat and a little extra bbq sauce. I served it with cole slaw and homemade mac and cheese. I also left out the thyme."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Piper"
},
"reviewBody": "Sauce was very watery, and the meat and sauce didn’t have much flavor. I’m sorry to say I was disappointed in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LINDA"
},
"reviewBody": "this was a really good recipe. the only issue I had was the Thyme. I would either leave it out or reduce dramatically - too strong of a taste. after shredding - cooked it for another 2 hours on low very good &amp; tender delicious (except for the Thyme taste)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisbeth"
},
"reviewBody": "It was a nicer flavor than just the plain bbq sauce and onions version, worth the little extra time, except for it being watery. I will whisk in cornstarch. Thx!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First attempt, sauce turned out very watery and a layer of fat from the meat. Still tasted great. Second attempt, same steps but at the end I skimmed off the fat then poured the liquid into a large sauce pan to reduce instead of using flour as a thickener. Sauce turned out nice and thick and super tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lodis15"
},
"reviewBody": "Great recipe! I do however add a little bit of salt (season to your liking). Before serving I mix some of the broth with bbq and brush it on the meat - makes it extra delicious. My entire family likes it even those that “don’t like BBQ” sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "view2ocean"
},
"reviewBody": "I made this recipe with some adjustments. When in the store to buy the pork, I looked at the pork shoulder and did not like all the visible fat. The pork loin was next to it and on sale, cheaper than the shoulder. I purchased the loin. I followed the recipe with the addition of smoked paprika and ground chipotle pepper. I cooked the meat in the slow cooker and when it was done I removed it, shredded it and put it in the refrigerator. I placed the remaining liquid in a bowl and placed it in the refrigerator. The next day, I took the liquid out and skimmed the fat off. I then cooked the liquid until it was reduced and thick. I placed the meat in the pot and heated it through. I served it on brioche rolls with coleslaw. Potato salad on the side. My family thought it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this recipe very much Thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time making it and my son loved it. Very easy to follow this recipe as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandeep_Cavill"
},
"reviewBody": "Haven't made pulled pork before. Pleased to say, found this recipe straightforward to follow (the accompanying video is useful too). I cooked the pork shoulder joint low and slow - 8hrs on low in the slow cooker - and it turned out lovely and tender and juicy. As the other half puts it, \"this is what I'm talking about! 😋\" @sandeep_cavill"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "OK but sauce was too thin and kinda bland overall. I even thickened up with a roux of flour/water which helped somewhat, but won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike-Debbie Brand"
},
"reviewBody": "Great recipie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Joan"
},
"reviewBody": "This is my first time making pulled pork. I used a 6 lb roast. I found the end product to be extremely greasy, watery and salty. Perhaps the butcher kept too much fat on the meat. Perhaps the BBQ sauce was too salty. (I did not even use canned chicken soup. I simmered 2 chicken thigh bones in a sauce pan for ten minutes.) I will make it again just for an experiment. And I will trim off ALL the exterior fat, cut the the BBQ sauce by half, and skip Worcester sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time trying a slow cooker pulled pork recipe. It was easy and the end results were rave reviews from all who had it. I did remove some of the liquid and added a little more sweet and sticky BBQ sauce after I shredded the pork. It was easier for the kids to make their own sandwiches. Will definitely be using this recipe over and over again. Especially this winter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this about 6 times now. I make mine on the stove top since I don't have a slowcooker right now, but as long as you cook it slow enough and stir it occasionally to keep the bottom from sitting too long, it's perfect. This is the BEST bbq pulled pork I've ever had, and I'm from Texas, which says alot if you've ever been there. It's just OUT STANDING. The only things I do differently are cooking it on the stove top and making my own chili powder, thats it. It's perfect the way it is. And OMG is it delicious. Mouth watering amazing. We eat it exactly as shown in the recipe photo... buttered toasted brioche hamburger buns and dill pickle chips. Dash of pepper, and your good to go. Jesus take the wheel it's so good, my mouth is watering waiting for it to be done [i have some on now]."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Antonia"
},
"reviewBody": "I like the simple instructions that were very helpful for a beginner cook like me. The dish was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faeri Girl"
},
"reviewBody": "I've made this a few times now and it's always really good, everyone loves it! It's a great family recipe, parents, grandparents, siblings and nieces and nephews all eat it with no complaints! Really good 5 stars! I will say though for myself and hubby we would probably add a little kick to it (my sis would complain to the moon if she thought it was going to be 'spicy'). To the folks that want to add liquid smoke I will say this. if you have good luck with it good for you! I, personally find it gross and it does NOT taste like you put it on a smoker, but your mileage may vary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie"
},
"reviewBody": "Pronounced \"delicious\" by my son, who is a pulled pork connoisseur . Easy to make. Only changes, used stone ground mustard because I didn't have any yellow and no thyme."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric"
},
"reviewBody": "I would have to say that this has been the best recipe I have used to date for pulled pork. I have family members, co-workers and acquaintances asking me to make it over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie"
},
"reviewBody": "Delicious! I made this exactly as in the recipe, but adjusted for the larger pork shoulder (mine was over 7#), it was a hit with everyone! I will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Archer's Grams"
},
"reviewBody": "This was my first attempt at making pulled pork and my culinary skills are marginal at best. It was amazing!! I tried to keep it more Keto friendly by omitting the brown sugar and using Ray's No Sugar Added Hickory BBQ Sauce. Also, after removing the roast from the crock pot, I strained out all \"loose\" particles (onions, fat, etc.) before returning the shredded pork for the final hour of cooking in the juices. Hubs and I both really enjoyed it, worked well without the roll too. Thank you, cmccreight, for this recipe, I will definitely be using it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef josh"
},
"reviewBody": "My family loved this! I think the bbq sauce you use is key. Also, sweat your onions. I used hot chili powder and used honey mustard. I also used some boneless pork ribs. This one went in my recipe book. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghunn Lingebach"
},
"reviewBody": "Thank you for this recipe! Absolutely amazing! So here’s what I did and I think it just added even more depth to this already amazing dish… I marinated my pork shoulder overnight in red cooking wine (about 2 cups?) but before placing it in the wine I rolled both sides with salt, pepper, garlic powder and diced white onions (about a half cup) also convenient since the recipe calls for diced onions. It’s quite literally the best pulled pork I’ve ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmLost2"
},
"reviewBody": "We enjoyed this recipe. I had a 7lb pork butt so I doubled the ingredients (except the sugar). Next ime I won't double the liquids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorraine Hand"
},
"reviewBody": "Made pretty much to the exact recipe except omitted the broth. Approx 4 lb pork shoulder cooked on low for approx 8 hours. PERFECT. Best Pulled Pork Ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorrine Goode"
},
"reviewBody": "I toasted sourdough bread and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this today and it turned out delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristen Haas"
},
"reviewBody": "This is a great recipe but before you add the sugar, consider the bbq sauce you are using. If you are using Sweet Baby Ray's, you won't need to add the sugar. If you're using Stubb's - you might want to. So use your judgement on the sweetness. I also added about 5 drops of liquid smoke as personal preference. I also swapped beer for chicken broth, bc I am a savage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The sauce was far too runny even after not adding the broth to it. Next time I would probably leave out the vinegar and add a splash of broth instead as the vinegar was far too strong of a taste in this also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it like the recipe and it was delicious! I used Sweet Baby Rays bbq sauce . Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good flavor. Sauce was too watery, though. I added cornstarch but still couldn't get to thicken up much. Will make it again but will only use half of the liquid ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Newman"
},
"reviewBody": "Fantastic recipe, thanks for sharing it. Made it, loved it, have to make more. Ps thought I was the only one that put pickles on my pulled pork sandwiches. Lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect Pulled Pork"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chelsy"
},
"reviewBody": "The first time, I followed the recipe to the letter, I did have to remove 4 cups of broth/juices after it was done because it looked like soup. I cooked it 7 hrs. It was very tasty and I got compliments. Second time, I read the reviews and omitted the broth and oil (seriously doesn't need it) and I added a few extra spices of my own like cracked pepper, pepper flakes, and pink salt. I cooked a bone in haunch instead and let it cook on low for 11 hours. My goodness it was fall apart/melt in your mouth. I removed and excess fat and liquid and then I added another cup of BBQ sauce and let it stay on warm until we needed it. This version was much, much better and will be how I cook it in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "No changes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sierramax"
},
"reviewBody": "Fair. Easier and better to just use the McCormick's Pulled Pork packet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "How this recipe gets 4.5 stars is beyond me. We followed the recipe exactly let it cook for 6 hours on high and it isn't shredding. We then pressure cooked it three times and it still won't shred, and the sauce is super wet and runny. It's already almost 9 and we still don't have pulled pork. Update: it tasted good but we had to broil it for it to finish cooking. Not really worth all the hassle"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Mohrman"
},
"reviewBody": "Absolutely delightful! Just enough spice for us. Will make often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Wisenfinnerty"
},
"reviewBody": "My 3 boys love this recipe. I have made it with pork shoulder, country pork ribs and yesterday I made it with shredded turkey. All 5 stars!!! We love this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "6-17-22 I thought this pork had more of a vinegar taste than barbecue. Strained the meat for sandwiches. Added 1/2 cup to bun with 2 tablespoons Stubbs Barbecue, extra yellow mustard and dill pickles. Not too bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So, I made this After reading the comments. I decided to cook the pork until tender, shredded it, then added the rest of the ingredients and cooked at 300F for about two more hours. It was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Florin Gervais"
},
"reviewBody": "Easy to make and the pork tasked good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy Sandusky"
},
"reviewBody": "This is a really good crockpot recipe. Followed it to a T and changed nothing. My wife and I had pulled pork sandwiches on a bun…skipped a night and then had pulled pork Tacos adding BBQ sauce and a tangy vinegar based slaw. 4 stars instead of 5 because I have yet to find a crockpot or oven recipe that can equal what can be done on a smoker. But if you don’t feel like watching and nurturing a great piece of meat on a smoker all day then this recipe will get’r done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was FANTASTIC! Authentic and tender, moist and flavourful. It's definately the best pulled pork I've ever made, and quite possibly the best I've ever eaten. The bonus is that it's quick and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Nicolucci Birtel"
},
"reviewBody": "Very Tasty Pulled pork. Easy to make and shred. Definitely will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "it was too sour. I love the idea of apple cider vinegar. But, I think that is what was the problem for me. I'll stick to adding Dr. Pepper to my pulled pork!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookergirl"
},
"reviewBody": "We really enjoyed this! I tried this Memorial Day because we had so much yard work to do...every time we came in the house it smelled so delicious! The only thing I had to change was the onion, i didn't have an onion on hand so i used some onion powder in place. It was delicious!! I will definitely make this again! Much more flavor than just pork with BBQ sauce! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "I love how tender and juicy it is. I opted to exclude the chili powder and onions, and I was out of brown sugar. The sauce was right in the middle on sweetness but it definitely could have used a slight bite. I’ll use the chili powder next time. Thanks for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chef Dave"
},
"reviewBody": "Too sweet needs a lot of salt"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time making pulled pork and it was absolutely delicious! Sweet and Tangy. My family and I hate fatty meats so I used a pork tenderloin with all the fat trimmed off. Because the meat was so lean it really soaked up the sauce and ended up very tender and flavourful. If you use tenderloin you won’t need to cook quite as long. Making it again for company tonight and planning on adding a bit of chipotle hot sauce for an extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WhatamIgonnaeatnext?"
},
"reviewBody": "I halved this recipe because my pork loin was just under 2 pounds. I cooked on high for 7 hours. It was not soupy at all. It was perfect. Thanks for this easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helene Kingsley"
},
"reviewBody": "Very good flavour. It’s a keeper this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Melissa Banyai"
},
"reviewBody": "This recipe is very good. We now have pulled pork at least once a week. We use the slow cooker on high for 4 to 5 hours depending on the size of the roast. My husband likes to double the brown sugar, chicken broth and barbecue sauce. We also use only a 1/4 teaspoon of the chili powder. Every time this turns out very flavor and very tender! Thank You for this and all the wonderful recipes and tips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was delicious! The pork is very wet when ready, so we just drained it and topped with additional bbq sauce. I used leftovers for salads and pizza without additional sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blair Runde"
},
"reviewBody": "Good flavor however too much liquid in the sauce after cooking the pork. Next time I would try cooking the pork in broth for a few hours, drain, shred, and then add sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cached41"
},
"reviewBody": "Put on less chilli for our tastes, but this is a go-to recipe for us now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mari10"
},
"reviewBody": "My kids devoured it!!! Smiles all around my dinner table the first time I made this and hasn’t failed putting smiles on everyone that comes over for dinner ever time I’ve made this for company. I like to mince the onions really small and pour the apple cider vinegar over them in a small bowl while I get all of the other ingredients ready so they start softening before I put them in the slow cooker. This is definitely a family favorite and recommend it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Starr Covey Perry"
},
"reviewBody": "We followed the recipe exactly per directions. We needed a but more cooking time though, since the meat was quite chunky - we will absolutely do this recipe again, and go with the longer slower cook time - it was quite tasty d even better the next couple of days afterward, on chunky ciabatta rolls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani Hogue"
},
"reviewBody": "I used Sweet Baby Ray's for the barbecue sauce and followed the recipe pretty much exactly. I'm not typically a big fan of pork, but this was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BLPRESTANGEN"
},
"reviewBody": "Pretty good, but I've had better. It didn't seem as flavorful as others I've tried on here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brandikgray"
},
"reviewBody": "My dude scarfed 3 of these on some potatoes buns in one night. The first two served at the same time with a little extra BBQ sauce. The 3rd he forgot the extra sauce and actually preferred it &amp; didn’t use any extra BBQ on the leftovers at all! Drool worthy recipe for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Walsh"
},
"reviewBody": "Awesome. Made this step for step. My kids loved it. Definitely making it again. I slow cooked 6 pound with bone. I had like enough for 16 sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebgel"
},
"reviewBody": "I used a pork shoulder just under 4 lbs with a nice layer of fat on top. For people saying it was too sweet they prob selected a bbq sauce that was too sweet. We used Dinosaur bbq sauce. I place pork in slow cooker &amp; mixed all the ingredients together then poured over pork along with chopped onions &amp; garlic. Cooked on high fir 51/2 hours. Took pork out &amp; then strained the sauce in a measuring cup ( I put back some of the onions in with the pork &amp; balance discarded ) &amp; placed in fridge for awhile so fat can rise to top. Shredded pork &amp; stored separately in a container. When ready to serve I skimmed as much oil as possible) heated up sauce first brought to a boil for a bit then added pork. Served as a Memphis (roll with coleslaw. Really delicious. Can’t wait to have the leftover."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Orzulak Voigt"
},
"reviewBody": "My husband said this was the best pulled pork he ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale"
},
"reviewBody": "Very happy with how it turned out and very tasty. Will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolmonroe50"
},
"reviewBody": "I made this with the basic recipe but I definitely changed it up a bit. I slow cooked it in the broth and seasonings but left out the barbecue sauce. When it was finished I took the pork roast out and shredded it. I read a lot of reviews that people said that the sauce was too thin . I pretty much dumped all of the broth and seasonings. Then I returned the shredded beef to the crockpot. I added baby Ray’s barbecue sauce to taste. Kept it on warm for another hour or so. At this point you could either serve it or as I did package it up in Ziploc bags for a later date. My husband said it was the best pulled pork he ever had. It was delicious. You could reserve some of the sauce and add the bbq too. Up to you. Our family likes a thick heavily drenched bbq flavor so this is how I made it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zit438"
},
"reviewBody": "I made this for a family gathering. Very picky eaters and smoker experts. I couldn't believe that EVERY BODY LOVED IT! I had an 8 lb pork butt so adjusted the recipe accordingly. I followed the very easy directions all the way through but used garlic powder instead of crushed garlic. This tasted more like a smoked pulled pork and wasn't strong on the barbeque sauce and wasn't too sweet either, which is EXACTLY why everyone loved it. I did remove a lot of extra juice because it was just way too much but reserved the liquid for those who wanted more juice. Can't wait to make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "dixie"
},
"reviewBody": "I rarely follow a recipe as I have been cooking over 60 years but decided to stick to this recipe because, frankly, I don't like pulled pork but my family does. If you don't want your meat to taste like a pine tree, you might want to eliminate the thyme. I ended up draining off the sauce &amp; dumping it and put the meat back in the pot with barbecue sauce &amp; broth. Hopefully the thyme smell &amp; taste will be gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elaine DiBona"
},
"reviewBody": "taste great and so easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa McFarland"
},
"reviewBody": "This recipe was amazing!!! I will use it everytime i want to make some pulled pork. You wont be disappointed with this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TRYANGELS"
},
"reviewBody": "I thought there could have been more flavor. Next time I will double the ingredients and when the roast is done, remove and boil down the juice some. My pork roast was very greasy. So I put all of it in the refrigerator and the next day took the hardened grease off of the top and added bbq sauce. \nIf I had had a better cut of pork, it might have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "antdejack"
},
"reviewBody": "It was amazing. So good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlie"
},
"reviewBody": "I used Beef Bottom and followed everything exactly and it turned out great. I used Jack Daniels BBQ, the BBQ can make all the difference."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/92462/slow-cooker-texas-pulled-pork/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
"name": "Pulled Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/92462/slow-cooker-texas-pulled-pork/",
"name": "Slow Cooker Texas Pulled Pork"
}
}
]
}
}
, "about": [
]
}
]