				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Carolina BBQ"
,"datePublished": "2020-03-05T00:05:08.000-05:00"
,"dateModified": "2022-09-13T16:55:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "coolmonkshoes"
,"url": "https://www.allrecipes.com/cook/2070704"
}
]
,"description": "A perfect Carolina pulled pork recipe. Grab a slow cooker for a big pork shoulder, cider vinegar, and pepper sauce to bring Carolina to your kitchen."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FrpCshloAm8cZy1BXZ3mq54recQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2021668-slow-cooker-carolina-bbq-Ryan-Henderson-1x1-1-bc23dc4b1d5e46b78b6d33c7305c813a.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555474385001",
"description": "See how to make Carolina-style BBQ in your slow cooker.",
"duration": "PT2M22S",
"name": "Slow Cooker Carolina BBQ",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4e2cda88-ec49-4eed-8b9e-04ef99ebe95a/5b47ccfe-b762-4727-9a9a-b339a25c6b6a/1280x720/match/image.jpg",
"uploadDate": "2021-07-18T11:59:58.949-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Carolina BBQ"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "613"
}
,"cookTime": "PT720M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "293 kcal"
,"carbohydrateContent": "4 g"
,"cholesterolContent": "91 mg"
,"fiberContent": "0 g"
,"proteinContent": "28 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "776 mg"
,"sugarContent": "3 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 (5 pound) bone-in pork shoulder roast",
"1 tablespoon kosher salt",
"0.5 teaspoon ground black pepper, or to taste",
"1.5 cups apple cider vinegar",
"2 tablespoons brown sugar",
"1.5 tablespoons hot pepper sauce",
"2 teaspoons cayenne pepper",
"2 teaspoons crushed red pepper flakes" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place pork shoulder into a slow cooker and season with salt and pepper. Pour vinegar around the pork. Cover, and cook on Low for 12 hours. Pork should easily pull apart into strands."
} ,{
"@type": "HowToStep"
,"text": "Remove pork from the slow cooker and discard any bones. Strain off the liquid, reserving 2 cups (discard any extra). Shred pork using tongs or two forks, and return to the slow cooker."
} ,{
"@type": "HowToStep"
,"text": "Stir brown sugar, hot pepper sauce, cayenne pepper, and red pepper flakes into the reserved liquid. Mix into pork in the slow cooker."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/FrpCshloAm8cZy1BXZ3mq54recQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2021668-slow-cooker-carolina-bbq-Ryan-Henderson-1x1-1-bc23dc4b1d5e46b78b6d33c7305c813a.jpg"
}
]
,"text": "Cover and keep on Low setting until serving."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT735M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrazyNurseSteph"
},
"reviewBody": "This recipe is my go-to for parties, picnics, receptions, tailgating, you name it. The pork is even better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe and easy. You need a big crock pot for anything over 6 lbs. Skip the cayenne pepper completely, use the red pepper flakes and Texas Pete (made in the Carolina’s); let people eating add more heat but you can’t take it out once in the sauce. I also recommend the liquid smoke that puts this over the top. We use slider buns to feed even more people. I also remove a little bit sooner so when I add the sauce it can cook a little bit more and be ready to serve right out of the crock. Closest thing to Carolina BBQ I’ve made and love doing it inside and in the crock pot. If smell is offensive, cook outside or in garage but I love the smell of this cooking personally Endless blessings to all and enjoy this delicious bbq!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred Gibson"
},
"reviewBody": "This is my go to Carolina style barbecue recipe. I skim of the 1/4 to 1/2 inch of grease before stirring in the spices and brown sugar. Went 100% on pepper flakes and about 2/3 on cayenne pepper. Added a scant 1/2 t of powdered smoke flavor I have that is pretty strong (this was to a doubled recipe). You can putt it on a tray and smoke it in your grill or smoker if you want. I’ve done it before and you can get some nice browned/burnt pieces that way. Forgot to put Texas Pete in it, but decided not to add it after a taste. I usually chill it, vac pac it and freeze 2 to 4 sandwich portions a bag, then freeze it. Keeps a long time frozen. Take it out, defrost in cold water, then open the bag and heat up however you want. Great on a bun, topped with cole slaw and a dash of hot sauce on top. That’s how I grew up eating it. It’s not whole hog barbecue, but it’s pretty darn good. I usually take my extras to my sister along with whatever brats, andouille, Italian links and jerky I’ve amassed. She’s got a husband and 2 grown boys and they go thru it pretty quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Vesely"
},
"reviewBody": "I was born and raised in Colorado. I moved out to NC for a few years and had my first taste of NC pulled pork. I was a BBQ sauce kind of girl and no one had that kind out there! After a few tries I REALLY enjoyed this new type of pulled pork! I worked construction and I would grab a sandwich almost daily from the gas station on my way to work. They just kept a bunch on the counter by the register! (Don’t see that anywhere else!) Well, I’m back in Colorado and I am really missing those sandwiches. So I googled sooooooo many different recipes and found this one. I put no cayenne pepper in but I did up the red pepper flakes and added the liquid smoke to the vinegar while cooking. I also ran by KFC to grab some coleslaw as that’s my kiddos favorite kind and it was one less step for me. This was so good! Thank you for posting it. It’s hard to find a legit recipe that is crockpot friendly and you nailed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristyACB"
},
"reviewBody": "Sooooo good. Second many others who suggest adding some liquid smoke for flavor depth and authenticity. Soaking your red pepper flakes in the vinegar for a few days in the fridge really bumps up the livliness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie"
},
"reviewBody": "Very good! I went with the advice of several others and added a little liquid smoke. Excellent recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smoothrat"
},
"reviewBody": "Amazing! Brought back great memories of North Carolina pulled pork. This will be my new \"go to\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Adams"
},
"reviewBody": "Love love love! Grew up in the north but went to school in the south. I miss the pig pickin' days! This recipe brings it all back. I followed other suggestions to add liquid spoke - that rounded out the recipe nicely. Definitely try this recipe (+liquid smoke). You'll love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "d_matt"
},
"reviewBody": "Lovely! I missed eastern Carolina bbq after moving to New England and this was the best I've found outside of NC/VA.\n\nIt is pretty spicy which I appreciate, but I usually cut the spice in half/quarter depending on who I'm cooking for.\n\nI like it with some smoked paprika as well as the liquid smoke recommended by others. And the best hot sauce for this pork is Franks in my opinion, it compliments the vinegar sauce wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Franklin"
},
"reviewBody": "Why are there not more stars!! This is so good! I to added the liquid smoke! This is our new favorite BBQ!! 10/10"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wobbles118"
},
"reviewBody": "This recipe is fabulous! All the vinegary goodness of Carolina style pulled bbq. I find that 8-10 hours on low is enough time to get the meat tender enough for easy shredding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherri"
},
"reviewBody": "I never write reviews ever, but this is seriously one of the best recipes I ever made!!! It’s better than any other Carolina BBQ I’ve ever had, unless it was cooked in a smoker of course. I read all the reviews and followed some of the suggestions these are some of the things I changed...I strained the vinegar and pork juices put it in the freezer to separate the fat from the juices and skimmed it off so glad I did.....I put the liquid on the stove to reduce a little adding all the rest of the ingredients as well almost 3 Tablespoons liquid smoke, I almost doubled the hot sauce and all of the spices (cayenne and pepper flakes ) I also listened to the one review to add a bit of fresh vinegar at the same time with the spices. Salt and a tiny tiny bit more brown sugar. \nIt was perfect! This is a keeper!!! \nPS the vinegar smell wasn’t bad at all, cook it over night in your slow cooker. I’m writing this because it was so good and because the other reviews really helps me to tweak the recipe, liquid smoke is a must."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Noyb"
},
"reviewBody": "Tenderness: prepared as written was good, without shredding (falls apart when stirred) at 9 hours on low. Probably would have been better at 8 hours. Smell: drew passionate adverse comments from 2 of us, no comment from two, I didn’t mind it but my son came downstairs to the kitchen to take out the garbage (that’s what he thought was “stinking up the whole house “) and insisted I leave the windows open (at 50 degrees outside) until the smell dissipated. He would’ve touch the meat. Taste: removed meat to a pan and left it to soak in sauce made as directed EXCEPT that I left out the red pepper flakes (some of us are spice wimps) and used Swerve brown sugar substitute instead of sugar (so the diabetic in the family could eat this). The three who ate it thought it was really good as a sandwich on King’s Hawaiian buns and w/o a bun (diabetic, remember). Tons of leftovers for lunches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nick Milot"
},
"reviewBody": "Pretty good! I added seeet potatoes and mushrooms. I went a little overboard with the sauce Bc I used a smaller roast than what was recommended.. but I’ll strain some of that out. \n\nIt’s definitely spicy if that’s what you’re into so be weary if you’re sensitive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Long Roe"
},
"reviewBody": "This is a great, easy recipe! I also made Cindy’s Coleslaw from this site. They go great together! I only made a few changes, just so there was more juice for leftovers. I doubled the vinegar, brown sugar, hot sauce, cayenne pepper and red pepper flakes. I also didn’t discard any of the vinegar. This way, we had juicy leftovers which sat and were even more flavorful later! Definitely, I fantastic recipe and worth trying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ Smith"
},
"reviewBody": "Perfect! Family loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Rivers"
},
"reviewBody": "I used a 3.3 lb boneless pork instead. I let the fat rise to the top and scooped it out after cooking.\nIf you decide to go the way I did, be sure to adjust the spices. I love spicy food so it was fine for me, but it was probably a little too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Latham"
},
"reviewBody": "The flavor is pretty much spot on. However, it's way too hot, and I even cut back on the hot sauce. I'll make it again but cut back even more on the cayenne and hot sauce. Fair warning, and my eastern NC grandma's tip...This stinks to high heaven when it's cooking. It's the vinegar. Put it on the stove top and turn on the vent fan. Doesn't completely get rid of the smell, but it helps a whole lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaMater"
},
"reviewBody": "This is great BBQ. I add all the ingredients on the front end to make it spicy but not hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey DeBaun"
},
"reviewBody": "I didn’t make the sauce but the pork turned out incredible!!! I used Sweet Baby Rays for the sauce and oh my! It was ah-mazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gregory Bower"
},
"reviewBody": "It was a little bland for Carolina bbq, but if you add some ground mustard, a touch of bbq sauce and liquid smoke at the start it's a good base. And a little trick substitute the brown sugar for real and raw honey it give it a touch of something extra and different but still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MrsQ"
},
"reviewBody": "Delicious... and it's got some kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Sexton"
},
"reviewBody": "Best Carolina BBQ recipe I've tried, and my boyfriend from NC agrees. Outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "My roast was 3.5 pounds so I let it cook for about 7 1/2 hours. When I did check it, almost all of the liquid had cooked out. I added a cup of water and an additional 1/2 cup of cider vinegar and mixed in the brown sugar, hot sauce, cayenne pepper and the crushed red pepper flakes. I poured this over the meat and let it all simmer for 45 minutes. I tasted the meat and, while it was good, I thought it was missing something. I added about 3 tablespoons of molasses. That gave it just a hint of sweetness but brought out the heat. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Luke Roebuck"
},
"reviewBody": "Tasty, I instead used a pork loin less fat and still super juicy! also toned back some of the spices added at the end so the flavor wasn't over powering. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeana"
},
"reviewBody": "This is excellent!! I live in South Carolina and this is as good as any BBQ I've had!! Tangy, sweet and spicy, pairs excellent with a coleslaw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne Falconer Crompton"
},
"reviewBody": "Absolutely the best tasting North Carolina Style. Juicy and tangy with a nice bite. And super Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruce Jones"
},
"reviewBody": "How's smells awful while cooking but the pork is devine. A good Carolina slaw to top it and everyone ate til they couldn't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaCarol"
},
"reviewBody": "Close as you can get. Only suggestion is to add liquid smoke. Since finding this recipe I have made it numerous of times and it never fails me. Even the hubby loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "I will definitely make it again and will take the advice to add just a touch of liquid smoke."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Myers"
},
"reviewBody": "I've been making this recipe from this site for years. It tastes exactly like the pork BBQ we had at a little lunch shop at the Outer Banks in Kitty Hawk. DEFINITELY add liquid smoke, it makes it taste authentic. I've never been a fan of sweet BBQ sauce, so this vinegar style BBQ really hits the spot. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "The vinegar definitely did the trick in making this fall of the bone tender. The vinegar flavor was a little too much for me (but you might like it) so I added a bit more brown sugar and and did top it with coleslaw. That really made a difference. Certainly has a little kick to it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christopher Gallucci"
},
"reviewBody": "It was easy to make. My wife doesn't like coleslaw and she thought it was too spicy. Going to lower spices to see if she likes it better. Other than that it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "H33th3r"
},
"reviewBody": "Not sure if I will make again because husband didn’t like. I thought it was ok compared to other vinegar based pulled pork I’ve had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Damaris Zipperer"
},
"reviewBody": "It's tough to find great slow cooker recipes out there - this is one of them! We reduced the cayenne down by half and used a pork butt instead of shoulder, per our preference. We prefer to remove some of the excess fat from the meat before cooking if it is very fatty. My husband was quick to say this one is a definite keeper in the rotation, and he is veeeeery picky about BBQ of all varieties. We served it with the Amish slaw, and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teachinghomeconomics"
},
"reviewBody": "Delicious! My bestie is from NC and she shared this recipe with me. It’s really great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mateó98"
},
"reviewBody": "Incredibly spicy. I added sweet baby rays honey bbq to balance it out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Justine Van Spronsen-Cowart"
},
"reviewBody": "Best slow Cooker Carolina pulled pork I've ever had. Made it to exactly as stated. But not as good as fresh from the smoker of coarse. I think a little liquid smoke might help replicate that taste a little more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elithea"
},
"reviewBody": "i didn’t notice any particular vinegar smell (apple cider vinegar) and oowee is it hot, but this was just really, really good. i think i added liquid smoke, which i couldn’t really taste, and some dried mustard, and i left off the hot sauce thinking to serve it at the table instead, but it didn’t need it. i used a boston butt that turned out to be boneless so it cooked faster. 3.34 lbs cooked down to 1.lb 15oz of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Briggs"
},
"reviewBody": "Excellent. I did add 2 T. Liquid smoke at the beginning as others suggested. I also subbed smoked paprika for cayenne pepper, as we are not big on a lot of heat. I cooked it all night. I considered cooking it on my screened porch to lessen the vinegar aroma in my house; but with open windows we managed to survive.i served it with pretzel buns, toasted. I made Brookeville Hotel’s slaw; which is my favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathyK"
},
"reviewBody": "No changes and will make it on the 4th of July. I'm not a native North Carolinian but have lived here 35 years and have eaten lots of Eastern NC barbecue. Except for not being the whole hog on a cooker, this is the real deal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Cash (Free Wolf)"
},
"reviewBody": "This is done best if you cook the pork shoulder first then shred it. After shredding the pork mix the sauce. My husband would also add Worcestershire sauce. If you use crushed red pepper - use only enough for the hotness that you can handle. For me it's none ( for the cayenne pepper and hot sauce as well). Cook for about 1 hour in sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey Rose"
},
"reviewBody": "Easy way to make N.C. bbq without the smoker."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Louise"
},
"reviewBody": "My store did not have a pork shoulder so I used a loin. I should have cut down the cooking time by an hour or so. It was a little dry. The taste however was awesome and I will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adam"
},
"reviewBody": "I must say it was absolutely delicious and I'll definitely make it again but it was so incredibly hot that it did distract a little bit from the flavor and I cut the cayenne pepper out all together. I'll probably remake this in a few weeks staying away from the cayenne pepper again but probably drop down to 1/4 of the crushed red pepper flake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crossfixio"
},
"reviewBody": "Hand's down the best slow cooker BBQ around. I have been making this for years now since I first found the recipe, I just never got around to reviewing it. I like the recipe as is, but you can adjust the heat to suit your family. And for those die hard NC BBQ fans who say this isn't BBQ, make it then tell me that. Thank you coolmonkshoes for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coloradomom"
},
"reviewBody": "This is one of my go to recipes for summer. It's easy to make, and oh so GOOD! I have made it several times, but I usually add a bottle of high quality BBQ sauce to any remaining liquid in the slow cooker. My son loves to top his sandwich with coleslaw, and I serve pickles and crispy potato chips on the side. YUM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RENA"
},
"reviewBody": "Wonderful and so easy! I skimped on the hot seasonings because I was afraid it would be to hot for me, but I ended up adding most of what I had left out after eating it for the first time--at least the hot sauce. This recipe is great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Too Spicy! Would cut the red pepper flakes in half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy White"
},
"reviewBody": "Delicious! I followed the instructions exactly and this is true NC pulled pork. For everyone suggesting the liquid smoke I purchased some just in case but I didn’t need it at all. I love the slight vinegar taste in my pulled pork. That’s the trademark Carolina taste. Now if you’re partial to traditional bbq with the red sauce then, yes, add the liquid smoke. Just make sure to taste it as-is first. You just might prefer it without."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vfa"
},
"reviewBody": "Super great! My first stab at anything more complicated than spaghetti sauce in a slow cooker, but it was easy peas. True to the Carolina style!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Stephens"
},
"reviewBody": "If you can't smoke traditional pork BBQ this comes in close second. My only issue with slow cookers is that is sits in its own fat the whole time and hard to get the juice free of fat. However, I followed exactly and at the end, added a traditional east Carolina BBQ sauce made of vinegar and red pepper flakes and that finished it off nicely; with some coleslaw of course! Will make again when smoking the meat is not an option."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicholas Thomas"
},
"reviewBody": "I've made this several times and everybody loves it. There's even been times I've had folks request it specifically. Great recipe as is. Sometimes I do add a little more brown sugar but I always use Frank's Red Hot sauce for best flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelli Maria Derr"
},
"reviewBody": "Yummy! I paired it with bbq mustard sauce and spicy coleslaw. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christian Dominique Guillory"
},
"reviewBody": "This recipe did not disappoint!! Everyone in my home LOVED it, including the kids. I did not have any issues with the smell although most of the slow cooking was done while I was at work. I added an extra tablespoon of brown sugar because I thought it needed it, and added liquid smoke per other reviewers suggestions. I used 3 tablespoons of it and that was definitely the missing ingredient for this. The meat was so tender, juicy and just perfectly seasoned. I made with coleslaw and cream corn recipes I also got on this site and it was perfection. I’m not a huge coleslaw fan otherwise but adding some on this burger really brought all the flavors out. I will definitely be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Fox Alvord"
},
"reviewBody": "Easy and delicious NC BBQ. I am not too fond of BBQ with red sauces. This lets the flavor of the pork shine through the sauce. It has a sneaky bite too. I generally use ghost pepper hot sauce and reduce the amount in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim"
},
"reviewBody": "The real deal...made as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimw"
},
"reviewBody": "The BEST BBQ EVER!!! I hate BBQ sauce in my bbq so this was perfect! Everyone who ate it said it was better than Allen and Sons which is the best Bbq place in NC! I will always use this recipe! I did add more salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria Gretschel-Apelt"
},
"reviewBody": "My family and friends love it! I don’t add or change a thing in the recipe, it’s perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret"
},
"reviewBody": "I have made this several times. The first time exactly as written and it was a little too spicy for my husband so I dialed back the slices by half and it was perfect for my family. I do add a good amount of liquid smoke along with the vinegar and it tastes almost like the BBQ I grew to love while living in NC."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lookwho'sCookingnow"
},
"reviewBody": "I made this today. It turned out really good! I've been making pulled pork for many years. I was glad to find this recipe. Love the tang and little spice. I was tired of the barbecue flavored pork. Hubby and son loved it too. This will be my go to recipe from now on. Thank you for sharing your recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "did not put as much seasoning as called for. cook in garage next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "did not put as much seasoning as called for. cook in garage next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "Sauce too spicy for my Northern taste. The pork shredded nicely, just used a different sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheshirec"
},
"reviewBody": "Very flavorful. Had 6 guests from N.C. and they loved ir"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laxjillie22"
},
"reviewBody": "This recipe was amazing! The only thing i did differently was add about a tablespoon of liquid smoke to the ACV while the pork was cooking. Other than that, I followed everything exactly as shown in the recipe and it came out great. You can cook it on high for 6 hours instead of in low for 12. I’ve eaten some good authentic Carolina BBQ from some fabulous restaurants in the south and this recipe is authentic as they come. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Mills"
},
"reviewBody": "My family loved it but there was too much liquid. I only saved the 2 cups as per recipe and had to strain out the liquid of each serving. I may thicken it up next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary"
},
"reviewBody": "This is my go-to BBQ recipe. It is very easy, and rivals some of the best I have ever eaten anywhere. Two long time and accomplished cooks of barbecue were amazed when I served it to them.\n\nIt can be a little spicy for some tastes so unless you like it hot, you may want to cut back some on the peppers and hot sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zachary Morache"
},
"reviewBody": "Wow! This is way too delicious for how cheap and easy it was to make! I threw it in the crock pot before bed, and had lunch ready when I woke up. Just threw it on some reheated rice and it was stellar! I will say I eye-balled the spicy ingredients as I always do, because I visually know my spice tolerance well. No need to measure with that stuff. To my surprise though the vinegar isn't too overpowering because it's cut with all the juices and fat coming out of the pork shoulder. That apple cider vinegar zing is just enough to leave you craving more after every bite. I had it for lunch, dinner, and a late night snack, and I'm still wanting to go back for another bowl."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah H."
},
"reviewBody": "I did not use the pepper flakes but otherwise, spot on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calcook"
},
"reviewBody": "Great! I used liquid smoke as others recommend. Cole slaw and buns to complete the meal. This is one of those meals that's delicious and requires little effort. Reminded me of barbeque I'd had in Durham, NC although a bit spicier. I reduced the cayenne and skipped the pepper flakes but it still had plenty of zing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "wineandchocolatechick"
},
"reviewBody": "No flavor except vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barrett Chambers"
},
"reviewBody": "I personally think the sauce portion of this recipe is too spicy. I will cut the red pepper flakes and cayenne in half next time I make this. The flavor is on-point for NC BBQ, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perry"
},
"reviewBody": "No changes. I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angelina Taylor"
},
"reviewBody": "My husband said it tastes better than it looks, I must agree... I did add a little garlic salt before it went into the cooker, and I used boneless shoulder it was still great and I didn’t have to tend to my smoker all night"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "AMAZINGGGGG. Followed the recipe to a T, it was delicious. My husband, my kids, and I all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "delilahluna"
},
"reviewBody": "AMAZINGGGGG. Followed the recipe to a T, it was delicious. My husband, my kids, and I all loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamav"
},
"reviewBody": "As a native North Carolinian, I give this 5 stars!!\n\nI have made this at least 10 times; great every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe"
},
"reviewBody": "No hot sauce. Crushed red pepper and very small amount of brown sugar. Keep skimming fat from crock pot. When done bone just came out clean. Didn't need forks shreaded with large serving spoon in crock pot. The best I've had in years"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Callaway"
},
"reviewBody": "Delicious. I served this with Amish slaw. So good. I was going to try the liquid smoke but forgot to so I will do that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "It was quick and easy to make. The sauce had just the right amount of heat. I will definitely make it again in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Curtis Yerger"
},
"reviewBody": "Easy to make and everyone loved it. I lived in North Carolina while in the navy and really missed Carolina BBQ which I can't seem to get here in PA so I tried this recipe and comes pretty close to the BBQ down in NC."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Buck"
},
"reviewBody": "I made this and it came out great. I made a 2 1/4 lb pork shoulder. I left out the red pepper flakes and used only pepper sauce and a little cayenne pepper to suit my taste. I would make it again, for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cease"
},
"reviewBody": "Easy to make. I reduced the amount of hot spices figuring the water can spice up as desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMorton312"
},
"reviewBody": "I followed the recipe exactly and it turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bobbi Hardy"
},
"reviewBody": "DH loved it and I liked it. He said it tasted restaurant quality and far superior to just bbq sauce. I used a 2.5lb boneless pork roast and cooked it for 6 or 7 hours on low."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neal Thompson"
},
"reviewBody": "Excellent just as listed. I cut the hot stuff by 1/3 , subbed sugar and a little molasses since out of brown sugar. \nThe hot is completely absorbed by the slaw and bun, eat it without to allow your full allotment of cold beer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Causey Beaton"
},
"reviewBody": "My mom says it is some of the best ahe has ever had. So simple, yet delicious every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Dunkley Lowery"
},
"reviewBody": "This is my go to recipe for NC style BBQ to feed a crowd. Only thing that I do different is add about 2 Tbsp of Stubbs Liquid smoke Hickory flavor to the crock pot. I am from NC and this is a great easy recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason R"
},
"reviewBody": "Amazingly simple and delicious, have made this several times., last time did a boneless pork, need to figure out adjustment for seasoning to account for there was more meat than had it been a bone in"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BonnieBew"
},
"reviewBody": "My aunt and uncle had a couple barbecue restaurants in NC for decades before they retired to the coast. When you don’t have a pit or a smoker, this recipe is a lifesaver for satisfying those cravings for vinegar-based Carolina barbecue. I always make this a day ahead, then warm in a skillet to get the texture I was raised eating. I skim the fat off the extra liquid rather than tossing, then reduce with more red pepper and a tablespoon of dijon added for an optional sauce. I’ll eat this stuff on an arugula salad or with roasted Brussel sprouts, not just cookout fixings - it’s divine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pattiecake"
},
"reviewBody": "I cooked it on high for 6 hours and it came out great! I really love carolina bbq on a bun topped off with sweet coleslaw!! This was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Ferrell Godwin"
},
"reviewBody": "This recipe is perfect!!! Absolutely love it! Not into the BBQ sauce type BBQ, We like the vinegar with a kick kind... perfect amount of vinegar so it doesn’t overtake it and perfect kick. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "april keiek"
},
"reviewBody": "Oh this brings back memories. close to Parkers BBQ in Wilson, NC."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef carol"
},
"reviewBody": "The first time I made this I didn't have enough apple cider vinegar so I used red wine vinegar. It had some Aroma"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crowell00"
},
"reviewBody": "I was really surprised how well this came out. It did smell pretty bad while cooking but, the end result was well worth it. The fam loved it.\nI normally make my pork BBQ on my smoker but was looking for something different.\nEdit:I did add a few drops of liquid smoke flavor to mine also. I think it was just 3 drops, that stuff goes a loong way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Guthrie Sayles"
},
"reviewBody": "Excellent easy no mess and wonderful tangy southern bbq. Shredded so easily. Favorite of the many many pulled porks I’ve made over the years. Husband agreed- delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BIGLIZARD"
},
"reviewBody": "I made this for thanksgiving with a 2.5lb pork shoulder and it came out great! I did add a little siracha and liquid smoke as others suggested. I also added some Louisiana hot sauce. Very tasty. If I wasn't sharing it with my mother I would have added more hot sauce but it is fine added after the fact. Served with summer slaw, 4 bean salad, corn bread and kings hawiaan rolls yummm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Delainey Maughs"
},
"reviewBody": "This has some heat to it! I liked the taste, but it was runny before adding the slaw. Any suggestions for a better bun or adjustments to the recipe if I were to make it again?"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/148544/slow-cooker-carolina-bbq/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17198/meat-and-poultry/pork/shoulder/",
"name": "Pork Shoulder Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/148544/slow-cooker-carolina-bbq/",
"name": "Slow Cooker Carolina BBQ"
}
}
]
}
}
, "about": [
]
}
]