				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Mediterranean Lentil Stew"
,"datePublished": "2003-11-29T20:38:43.000-05:00"
,"dateModified": "2003-11-29T20:38:43.000-05:00"
,"author": [
{"@type": "Person"
,"name": "CookingForDummies"
,"url": "https://www.allrecipes.com/cook/40858"
}
]
,"description": "Prepared in a slow cooker for ease, this spiced, vegetable-packed, Mediterranean-inspired lentil stew is sure to please!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RR0bEmHP47metyfJkGS7yktythE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8921243-67ca9c444e6540a19dbb58885b16b865.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Mediterranean Lentil Stew"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "47"
}
,"cookTime": "PT190M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "208 kcal"
,"carbohydrateContent": "36 g"
,"fiberContent": "14 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "194 mg"
,"sugarContent": "4 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"5 cups water",
"2.5 cubes vegetable bouillon, or more to taste",
"2 cups dry lentils",
"5 small carrots, peeled and diced",
"2 medium potatoes, peeled and diced",
"3 teaspoons ground cumin, or to taste",
"1 teaspoon ground coriander",
"1 tablespoon olive oil",
"1 small onion, diced",
"4 cloves garlic, minced",
"0.5 (6 ounce) can tomato paste, or to taste",
"0.5 teaspoon sea salt, or to taste",
"0.5 teaspoon freshly ground black pepper, or to taste",
"0.5 (8 ounce) package fresh spinach, torn" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Warm water and vegetable bouillon in a slow cooker on High until dissolved. Add lentils, carrots, and potatoes."
} ,{
"@type": "HowToStep"
,"text": "Heat a medium saucepan over medium heat. Add cumin and coriander and cook and stir until fragrant, about 20 seconds. Add oil, followed by onion. Cook, stirring occasionally, 2 to 3 minutes. Add garlic and saute for 30 seconds. Remove from heat and transfer to the slow cooker. Stir. Add tomato paste, salt, and pepper. Stir in spinach."
} ,{
"@type": "HowToStep"
,"text": "Cook on High, stirring every 30 minutes, until lentils are tender and stew has thickened, 3 to 4 hours."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT210M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeri Gates"
},
"reviewBody": "Easy and absolutely delish. I served it with warm cornbread. Perfect healthy dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I liked the ease of making it in the crock pot, but the flavors were not my favorite. I will use this as a base with other spices next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used the vegetable broth instead of cubes. It was really good. I couldn’t quit tasting it, so I fixed a bowl as a snack. 😀"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cjtk1701b"
},
"reviewBody": "It took longer than 4 hours to get the lentils software and 3 to 4 cups more broth. But overall it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! I added chicken broth in place of vegetable bouillon &amp; kale in place of spinach. We also served it over rice. I did not soak the lentils &amp; they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! Just made it this afternoon- love the cumin, coriander spices, may add 1 tsp more of each next time. I had all ingredients on hand so it came together quickly- house smells divine! And it tastes wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "resy"
},
"reviewBody": "*Instead of water &amp; bullion I used veggie stock- only change A seemingly longer version of vegetable soup. Everyone liked it. It's missing a little something but I wouldn't kick it out of bed. The children ate it which was surprising, normally they protest too much. I'd make it again. Next time- green beans and ham"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this several times. Today, in an attempt to get at least one of my kids to eat it, I put in extra potatoes, no carrots, and two whole cans of tomato paste. Hasn't even been in half an hour and it smells divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kangrrl"
},
"reviewBody": "We all liked this, including the kids! I used 3 beef bouillon cubes because that's what was on hand. I also used a large white onion which didn't overpower, 5 red potatoes, a whole bag of baby spinach, and added 2 extra cups of water. I don't think you could go wrong throwing in a little extra of any of the ingredients. Really hearty, healthy, tasty and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zebradecorco"
},
"reviewBody": "I love the flavours and the texture. I used 3 small russet potatoes and 2 yellow nugget potatoes. I used beef bouillon because that is what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Absolutely wonderful. One time I ended up putting leftover ham in, but this absolutely doesn't need it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne"
},
"reviewBody": "Really easy to make Ann's very Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSIE6381"
},
"reviewBody": "Nice spice level, though we agreed that it needed just a tad more salt. I'm sure it varies depending on the brand of veggie broth.\n\nCooking time was spot on. Lentils were completely cooked after 3.5 hours.\n\nWould agree with others that it needed 1-2 more cups of water/liquid.\n\nGreat vegan dish, thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SINGCHEF22"
},
"reviewBody": "I’m always afraid of cooking with lentils - I’m always afraid they’ll be bland. This was an excellent recipe, however. I did add a little bit of ham flavoring to it, because I love that flavor combo. Served it to guests on a spontaneous “soup night” (after the famous three days of no power in Texas!), it hit the spot. I’m not a fan of strong flavors, I used the spices exactly as written, and the amount of spice was just right -a good combination. I’m excited to have another use for lentils and will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drob"
},
"reviewBody": "Delicious! I used chicken bouillon added 1 teaspoon of curry powder and added 1 extra cup of water from the beginning. Served with a splash of red wine vinegar. \nNext time I will add an extra potato...because so good. \nI didnt have spinach and dont think it seemed missing. \nAnd I missed the part about about stirring every 30 min gave it a stir toward the end and it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ValerieO"
},
"reviewBody": "Delicious and hearty. This is going into the rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Franchi Trimble"
},
"reviewBody": "Added some extra garlic and an extra cup of stock near the of cooking time; used a slow cooker. Delicious - this recipe is a keeper! Perfect warm, hearty meal for winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "Not a huge lentil fan but I thought this recipe was great! I was shocked that I had every single ingredient on hand (not normally the case). I read all the reviews since there weren't that many. I agree that it needs more liquid so I started w/6 C. water. Ended up adding 2 more cups over the cooking time so I would say this stew/soup needs 8 C. water. I used Better Than Bouillon Veggie Base and I probably went a little overboard on that but it was still good. I'm not a vegetarian so I might try chicken or beef broth next time. Might back off a little on the cumin and experiment with other spices. To the reviewers who say their lentils were still crunchy...did you cook it on high? Mine came out perfect &amp; by the way mine looked exactly like the picture ?? Very hearty soup and will def make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Braun"
},
"reviewBody": "Versatile recipe. Didn't have the 3 hrs 30 minutes before supper, so I sauteed the onions in oil, cumin, and curry instead of coriander. Threw it all in the pressure cooker with a package of frozen carrots. Pressure cooked on high for 45 minutes. Thickened up more than expected, but the water added after cooking brought it back to a good consistency. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Loftus Miller"
},
"reviewBody": "This was delicious and easy. I know it was a vegiterian recipe, but my husband asked me to add stew meat. I used a dutch oven to brown the meat first, then followed the recipe, adding meat back in before simmering. It turned out great. Looking forward to having the original recipe in the future as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ricatoni"
},
"reviewBody": "My friends loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Hogan"
},
"reviewBody": "Delicious! I’m a lentil lover and this was so very good . I used the veggie broth instead of just water and added an additional cup of broth during the last hour. It’s an excellent vege stew!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "This was very tasty. I made it exactly as written using half and half red and green lentils"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim James"
},
"reviewBody": "The flavor was good, but after five hours on high, the lentils were still crunchy. I added extra broth and finished on the stove. I also add a couple of stalks of celery and a can of diced tomatoes. I would try it again, just cook longer. Definitely has a stew like consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Mccann"
},
"reviewBody": "This was so easy and tasty. I did not use the slow cooker just my stove top. I did not have spinach on hand. I did add some ham. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dave"
},
"reviewBody": "I made this, and it tastes good; but it certainly does not look anything like the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kdreynols"
},
"reviewBody": "This is delicious! I made a couple of changes. I did 1 sweet potato in place of the potatoes and added in cooked sage pork sausage. Need to add more water with the sausage. I served over brown rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moxxie"
},
"reviewBody": "I, generally speaking, don't like vegetarian dishes. I loved this! I had hoped to freeze some, but we ate it all, so I made a second batch. I added a can of 6 bean medley and a can of chickpeas to the original recipe and substituted veg broth for the water and a 14oz can of diced tomatoes instead of paste. This batch was even better!! WUNDERBAR!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "This was delicious! I didn’t have coriander, but it was still very tasty. I had to add about a cup and a half of water along the way. I’ll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mitchel Nay"
},
"reviewBody": "It was pretty good, but not my cup of tea"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ginerjm"
},
"reviewBody": "OK - have to admit that I never cooked with lentils before. That said - since this recipe did not mention it I ignored the advice on the bag to pre-soak the beans. Bad move. I followed the recipe exactly (as I always do the first time, unlike a lot of fellow readers) and it was pretty raw even after cooking for over 4 hours. Added a full cup more of broth as well as some more seasoning and quite a bit more salt and pepper. Again - quite a bit more salt and pepper. The recipe is pretty liberal with the cumin and coriander but doesn't think much salt or pepper is needed. I am not a big salt lover and rarely over use it but in this case I needed some more than was called for.\n\nAnyway - the next day with the added ingredients and a couple more hours on low the dish started to take shape. I liked it and will make it again with the added liquid and more attention to the beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judye"
},
"reviewBody": "Really liked this. I used one sweet potato and one white potato instead of 2 white ones. Recipe made a crock pot full!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sarah"
},
"reviewBody": "It was a little bland for us as written. Added 1 lb. sliced baby portobello mushrooms and additional seasonings (a couple teaspoons herb blend). Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kylie"
},
"reviewBody": "This is a very flavorful dish! I followed the recipe exactly, except I added an additional 1 and 1/2 cup of liquid. I'm glad that I did because at the end of the cooking time, there was no liquid left in the slow cooker. I will make again but will either add much more broth or lessen the amount of lentils."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "whittakelli"
},
"reviewBody": "Per instructions I did this in slow cooker for 5 hours ( which I believe too long ). The mixture was very thick, and per the instructions I added one more cup of water. It was still too pasty for me and I ended up adding a 2nd cup of water/vegetable broth mixture. I now had the consistency I was wanting. However it still lacked in something for me. I will be upfront and say not a vegetarian, but I do enjoy vegetarian dishes at times. This however did not cut it for me. I am going to add some grilled chicken to it to finish off the rest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Very hearty and perfect on a cold winter day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cej"
},
"reviewBody": "this was absolutely wonderful! The entire family loved it. I didn't make a single change and will repeat it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ckcallaway"
},
"reviewBody": "I cut recipe in half and Instapot slow cooker 4 hours on low."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doc Shotgun"
},
"reviewBody": "A lot of cumin. I added slivered left-over steak and some green chili. Delish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol markham"
},
"reviewBody": "We loved it. Didn't have spinach...added blackeyed peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Valerie Bronson"
},
"reviewBody": "I left out the potatoes, because I did not need more starch in this soup.\nI exchanged the tomato paste for canned diced tomatoes, and exchanged the water + bouillon to vegetable broth.\nI used a ratio of 1 cup of dry lentils with 1 quart of vegetable broth. \nIt was delicious with these changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tommy Lucca"
},
"reviewBody": "I liked this a lot. Personally, I would add more seasoning, but as always, that is an individual preference. Didn't have the spinach, but I will definitely add it next time. Thanks for a nice recipe, great for a cold winter day in the UP!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JohnB"
},
"reviewBody": "Good flavor. I believe the cooking time may be off a bit. At 4 hours, the lentils were still crunchy. I also found that adding additional broth improved the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Wolf"
},
"reviewBody": "I normally have aversion to legumes and beans. This stew was AMAZING! all the flavour, no dry-floury tasking lentils. \nMake sure you have enough liquid in there to make it soupy - it is absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "1.4.21 Haven’t done a whole lot of cooking with lentils, but this stew might be the inspiration to do more. This has layer upon layer of interesting flavor and was very satisfying. I used my Instant Pot®’s slow cooker function on high, veggies were cooked, and lentils were soft in a little less than 1-1/2 hours. Added quite a bit of freshly-ground black pepper and a little more tomato paste, otherwise, followed the recipe to the letter. Very nice stew."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/282532/slow-cooker-mediterranean-lentil-stew/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/266/everyday-cooking/vegetarian/soups-and-stews/",
"name": "Soups and Stews"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14780/everyday-cooking/vegetarian/soups-and-stews/stew/",
"name": "Stew"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/282532/slow-cooker-mediterranean-lentil-stew/",
"name": "Slow Cooker Mediterranean Lentil Stew"
}
}
]
}
}
, "about": [
]
}
]