				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Oatmeal"
,"datePublished": "2020-03-04T23:59:28.000-05:00"
,"dateModified": "2022-05-16T19:39:52.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karen Culp Wenzelmaier"
,"url": "https://www.allrecipes.com/cook/717694"
}
]
,"description": "Use your slow cooker to make this oatmeal that is so creamy it&#39;s like tapioca! You will absolutely love this recipe. This is how oatmeal was meant to be!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/B7uPTnxkJTBsfvDPs45G5AEkmBA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/slow-cooker-oatmeal-2000-809f33473ea04d25863672302b679938.jpg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Oatmeal"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.6",
"ratingCount": "190"
}
,"cookTime": "PT480M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "208 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "22 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "35 mg"
,"sugarContent": "14 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT2M"
,"recipeIngredient": [
"1 cup oats",
"3 cups water",
"1 pinch salt",
"1 cup half-and-half cream",
"0.25 cup brown sugar, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Just before going to bed, combine the oats and water in a slow cooker. Set on Low, cover, and let cook overnight. In the morning, stir in the salt and half-and-half. Scoop into bowls, and sprinkle brown sugar over the top."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT482M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This should be called oat soup. Very loose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "France C"
},
"reviewBody": "I struggled with how to rate this one. The end result was good, but only because I had to make adjustments to have it turn out. I used a small 3.5qt slow cooker instead of my bigger one, and I'm glad I did as I think it would have dried out in the larger one due to more surface area/cooking surface. The term “overnight” needs to be more specific - it could mean 7 hours to some, or 12 to others, the latter leading to overcooked oatmeal. I did 9 hours and the edges were starting to brown, dry out and clump up. I would highly recommend spray your liner with cooking spray before starting. Also, 1 cup of half and half would cause a soupy mess. I used 1/2 cup and that made the oatmeal pretty runny. This definitely does not make enough for 4 servings. 1/2 cup dry oatmeal is usually considered 1 serving (per oatmeal packaging). Other than these issues, the flavor was good. If you want more texture and 'chew', use steel cut oats, as others have recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Needed apple pie spice and a bit of vanilla. Love the addition of cream. I’ve only made crockpot oatmeal recipes with water. I cooked on low for 4 hours and then my crockpot turns to warm the rest of the time until I shut it off . My crockpot runs very hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Letitia Yvette Hayles"
},
"reviewBody": "Omitted the milk. It was still so good add raisins and chopped nuts for added fiber and crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whuffie Garner"
},
"reviewBody": "Oatmeal takes minutes on the stovetop or microwave so why would you use a slow cooker? Because I have to make 10-20 cups at a time. This recipe was incredibly helpful and saved me time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Klara Renteria"
},
"reviewBody": "Leave out the half and half or milk until you are ready to serve, if adding dried fruit you can add it before. I made this 3 times now and I found I had to cook on low for 2 hours and have it stay on warm, other wise it will burn. This is your plain jane recipe so add what you like. Once I added diced apples and lots of cinnamon for apple pie oat meal. Another time I added Craisins and maple syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trickycoma"
},
"reviewBody": "Not a fan, I used 4 cups of water to 1 cup of oats. The entire oatmeal had hardened on the sides on top, maybe my slow cooker runs hot. I'll give another shot with some tips from other reviewers about using a separate container in the slow cooker itself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Really came out a lot better than I thought it would. Great morning timesaver."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "waltershannah2011"
},
"reviewBody": "This made oatmeal soup. We couldn't even eat it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "churchcook"
},
"reviewBody": "5 stars for it turning out like the recipe instructed, 2 stars for my personal taste. Looked and tasted like wallpaper paste. Threw it away and cooked it the old fashioned way. I should have known better. You can't cook oatmeal for 7 hours and expect different results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Nagle"
},
"reviewBody": "Waking up to a hot breakfast on a cold. Morning is great! I played with the recipe. I sprayed the slow cooker with non stick spray and this worked. The best ratio is 1 cup of steel cut oats to 4 cups liquid. I used 2 cups milk and 2 cups water. I set it on low and the timer for 6 hours. My slow cooker keeps it warm after that. This results in a lumpy oatmeal, which is my favorite. If you like creamier texture, put the oats and liquid in at dinner time and let it sit cold. Turn it on at bedtime. I added brown sugar and maple syrup at bedtime for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DJ"
},
"reviewBody": "Turned out to be a liquid mess. Not recognizable as oatmeal in any form.\nI will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JoAnn Strom"
},
"reviewBody": "made this recipe exactly as written, result in the AM was \"Oat Meal Soup\" Next time will try 2 cups water instead of 3 cups"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill C "
},
"reviewBody": "Made this work a work potluck a few weeks ago. Turned out alright, but had to add a few extra ingredients to kick it up a notch. Added some dried blueberries and cranberries. Also used a slow cooker liner. Super easy cleanup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeremy Goldman"
},
"reviewBody": "After reading the reviews, I ruled out my 6-cup crock pot because it only has Lo"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Farm Wife"
},
"reviewBody": "Only takes about 5 hours in my little slow cooker with only one heat setting, so I plug it in when I get up in the middle of the night. Otherwise it gets too done around the edges. Very good breakfast food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris"
},
"reviewBody": "So easy to make, delicious to eat and so many additions to change it up: raises, cranraisens, walnuts, almonds, a cinnamon stick... options are endless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wanda Parker Davenport"
},
"reviewBody": "I used 3 cups of almond milk for the water and coconut brown sugar to replace sugar and 2 tbs maple syrup for sweetness. cooked on low for 7 to 7 1/2 hrs. My husband loved these !! he didn't want fruit in his oatmeal the way I do so this is perfect to have done for him, and I can have mine and both happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "j harms"
},
"reviewBody": "All I got was burnt soup! The water never absorbed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NiNi"
},
"reviewBody": "Made in mini crockpot this a.m using regular oats (not steel cut) Left out the half and half and added chopped peeled apple, fresh craisins. When finished I sprinkled a few chopped walnuts to top it off. Only took 3 1/2 hrs. Perfect. Will never make on stove top again.\nYummy and great on cold winter morning in burbs of Chicago."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Baking mommy"
},
"reviewBody": "It was too soupy for my liking but it was nice to have warm oatmeal ready. I probably won't make it again following the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Cooper"
},
"reviewBody": "Delicious and very easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dixie"
},
"reviewBody": "Slimy. I didn't change anything. I used the Old Fashioned oats. Sorry just didn't like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keila Rodriguez-Granados"
},
"reviewBody": "It was awesome to wake up to this. I lined with parchment paper to avoid sticking as described in reviews. Worked great. My add-inns were apples, some molasses . We each topped with our choice of : chia seeds raisins or almonds , butter or half and half. Will make again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "saw1155"
},
"reviewBody": "I personally didn't like the texture of the oatmeal, too slimy. However my husband seemed to like it. I think it depends on everyone's personal taste and texture of oatmeal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crazysally"
},
"reviewBody": "I tried it on the warm setting of the crockpot. It was SO good. Oh, it was also the small 1 qt crockpot. No sticking, moist. Cooked just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SINGCHEF22"
},
"reviewBody": "I made it in my one quart size crock pot, exactly as WIRSCH suggested, on the warm setting. She is spot on! I stirred it, added some dried cranberries and brown sugar and gobbled it up! I was halfway through the bowl before I realized I hadn't put any milk on top -- and I didn't care! Next time I'll put the cranberries in with the oatmeal, and maybe some chopped apples and cinnamon, or top it with some chocolate chips! This came out nice and creamy, and it was cooked exactly right! I am frankly tired of the hype about steel cut oats, I don't like them as much as regular oatmeal, but I kept reading that that was the only kind you could use for slow cooker oatmeal. Well, the powers that be were dead wrong about that, and I'll never go back!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Desirae"
},
"reviewBody": "I used a one quart crockpot and followed the recipe with one modification (butter) and it turned out very watery and plain; I added another cup of oats and two tablespoons of cinnamon. I also put all of the ingredients in at the same time with two tablespoons of vanilla"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "blondebiker"
},
"reviewBody": "Made it as written w/half steel cut and half reg. oatmeal. As recommended by another reviewer,I used a water bath in the crock pot on low for about 8 hours and that worked great - no sticking at all. However, the texture was completely off-putting. Apparently, neither I or my husband like oatmeal that has a tapioca-like texture. It was almost slimey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "Very creamy. I add sugar and cinnamon sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lwayne80"
},
"reviewBody": "the oatmeal haters in our house love this! I add the salt to the crockpot while it is cooking and omit the sugar because the kids like to add chocolate chips to theirs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nessaS"
},
"reviewBody": "I have no idea what I did wrong with this one. It was slimy and soupy. It could have very easily been my error just not sure what I did wrong. I have had great with all the other recipes I have tried from here. If anyone has any suggestions I am open to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Essie Woods Bruell"
},
"reviewBody": "I finally have a good way to cook my steel cut oats without getting up early and waiting an hour. The pyrex dish inside the crock pot trick works very well, keeping the oats moist and the dishes residue-free."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karin"
},
"reviewBody": "very good i used 1/2 cup of half and half. very creamy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen M"
},
"reviewBody": "Ok so i read all the reviews before making this and really wasn't actually convinced it would turn out ok but hubby was away and the kids wanted oatmeal!!\n\nWow it was fabulous!!! super super easy and turned out great, i made a few adjustments as recommended and cooked it in a large (ish) slow cooker that was at least 2/3's full.\n\nI used 1 cup or old fashioned oats\n 2 cups water\n 2 cups milk (2%)\n 2 tbsp butter\n 1 tbsp cinnammon\n\nI sprayed with butter first, popped everything into the slow cooker and left overnight, I cooked on low for 4 1/2 hrs and then my cooker automatically switched to warm until we got up the mext morning.\n\nI gave it a quick stir and added 2 tbsp of sugar and 1 more cup of oats, mixed it all up and the kids loved it!\n\nI had no problems with anything sticking to the sides or bottom :)\n\nI will definately be making this again, i think i'll either reduce the liquids a little or add more oats at the start to get the perfect consistancy (but adding an extra cup of oats in the morning was really no problem)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Veronika"
},
"reviewBody": "To those of you who are going to try the recipe - please be aware that time and consistency a great deal depends on the temperature that YOUR slow cooker is working at on different settings. \n\nI sprayed the inside of my non-programmable 4 QT slow cooker with olive oil, and put in 2 cups of old-fashioned oatmeal and 8 cups of water. Dropped in little piece of butter, set my slow cooker on \"Keep warm\" setting and went to bed about 11 PM. I woke up at 6 AM, checked the slow cooker, and was not happy with the consistency - it seemed watery. I stirred the oatmeal, and I switched the setting to \"High\". After 1 hour on high setting I stir in some low-fat milk. \n\nThe oatmeal that you get will be very soft and creamy - but I like it that way. I put only three stars, because there should be a note in the recipe itself that you need to try the recipe a couple of times to do it right. I would think that those with programmable slow cookers could set it on 3 hours high, or 5 hours low, and then it would switch to the warm setting automatically. My slow cooker is not programmable, and I can either have it on HIGH for, say, 1.5 hours in the evening and then switch it to \"Keep warm\", or try longer cooking time - not 7 hours, but 10 on \"Keep warm\" setting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiesha"
},
"reviewBody": "I cook this on \"WARM\" not LOW. Low burns it in my cooker.\n\nVariation:\n\nno sugar or salt\nadd peanut butter last half hour of cooking, and turn to \"LOW\".\nAlso, It's real good with evaporated milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tonibear82"
},
"reviewBody": "Way too much liquid! it was so soupy and mushy. I thought it seemed like a lot (especially since the back of the oatmeal container called for less than HALF the amount of water the recipe called for). I only put in 2cups of water and it was still a soupy mess. It tasted great, and i will make it again, but with MUCH LESS WATER."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Boosayky "
},
"reviewBody": "Because Oat meal cooks so fast I did not make it with oat meal. Red river cearel needs a long slow cook. And this methed of cooking is great for it. And I also add a little more water. And some spices like cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne Sheldon Coffelt"
},
"reviewBody": "It's so easy! I'm not a morning person, so I love a breakfast recipe that I can do the night before. It's a great base recipe -- you can add whatever you like. I added cinamon, turbinado and raisins. It does stick around the edge of the crock pot. Since my inside comes out for washing that's not a deal breaker for me. I suppose you could grease the side a little bit if it's a problem."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CASSIE811"
},
"reviewBody": "Just as stated, it is quick, easy and delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diquilter"
},
"reviewBody": "Made the recipe as is and it is a win win! Breakfast is ready when we get up, everyone can add their favorites, whether that is fruit, more brown sugar or syrup and clean-up is easy. Loved the thick and creamy results. I used Steel Cut Oates, better for healthier eating. Also sprayed the crock with no-stick spray for easier clean-up. i have made it other times with 1c. heavy cream instead of 1/2 &amp; 1/2 but can not say it was any better. Thank you to KARENSFIXINS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annie"
},
"reviewBody": "The first time I tried to make this, it turned into a gooey, gummy mess. Then I realized I have one of the new crockpots which in my opinion cook way to hot and ruin food. So the next night, I tried again and set the crockpot to the warm setting. Perfect! Very handy for busy mornings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calebsmom"
},
"reviewBody": "I grease up my crockpot with butter and don't have a problem with it sticking. I have made this several times now and really like it.. I didn't have half and half last time and I used milk and it was just as good. I also add cinnamon &amp; fresh nutmeg.. It is nice to wake up to a hot breakfast.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin McNeil"
},
"reviewBody": "This oatmeal really was creamy like tapioca! I used a 4 quart crockpot with a liner. I used old fashioned oats and three cups of liquid (half fat free milk &amp; half water). I also added 1/2 tsp vanilla. I turned the crockpot on low at 11pm. I woke up during the night and switched the crockpot from low to keep warm because I was paranoid it would burn. At 7am the oatmeal was very creamy! It wasn't hot so we had to heat it a bit in the microwave. Maybe next time I will leave on low all night. I added a tsp of brown sugar and a splash of sweet cream flavored coffee creamer to my bowl and it was delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thisgirlcooks"
},
"reviewBody": "This recipe is a staple in my house... perfect for those days when we need to get out the door early. The texture is creamy and the taste is perfect. We have tried any number of add-ins including: raisins, apples, cinnamon, and berries. I will never go back to fixing oatmeal the old way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Grandmaluvulotssd"
},
"reviewBody": "I did not care for this recipe. My 3 year old granddaughter who loves oatmeal and eats up to 3 bowls at a sitting wouldn't even eat it. It was like a bowl of glue. No flavor. I used the recipe like reviews said in a separate casserole dish in the crock pot with the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twila LeeAnn Travis"
},
"reviewBody": "Followed the recipe and turned out great! I did add cinnamon and vanilla"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Theoneandonly"
},
"reviewBody": "I made this to the recipe, but sadly it came out very watery, I don't know what happened. I read the reviews before I made it they all sounded good. I wish I could say something good about this recipe, ut sadly no :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sarahdav"
},
"reviewBody": "When I woke in the morning my oatmeal was a big pot of burnt mush . . . would not recommend doing this recipe the way it is stated. My oatmeal went in the garbage and I then had to make it the old fashion way. Other reviews recommend using a different method to cook it and it seemed to work great for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "THis was so thin like soup. the measurements most be work?????\nUrila"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdorsett"
},
"reviewBody": "I have never made crock pot oatmeal before and I was given steel cut oats to try. This recipe turned out so good that my 8 year old is requesting oatmeal again! I added a little bit of cinnamon and some dried apple to the mix and let it cook over night. Instead of using half and half cream, we used non-fat milk and it still turned out yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "mkstevens09"
},
"reviewBody": "The flavor of this wasn't bad, but the texture was strange to me. It was very soupy, and nearly all the oats had been turned to mush. Sorry, I will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "This is a nice easy recipe good for busy mornings. I bought one of the new crockpots about a year ago. It tends to run hotter than I'd like, so I cook this recipe on the warm (not low) setting. When I tried it on low, it came out too mushy. If you like your oatmeal on the thick side, try using only 2 cups of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrsmiller777"
},
"reviewBody": "mine burned overnight, i d add a pinch more water, i also used steel cut oats"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love2cook"
},
"reviewBody": "I followed the previous reviewer (emmy) and made it in a pan the night before. I omit the salt, and added the milk- instead of cream- and sugar in the morning. It is delicious every time!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Margaret"
},
"reviewBody": "I'll have to try again. I used my mini crock pot as suggested and added raisins - again as suggested by another reviewer. What a mess! Turned purple and tasted like raisin mush. I must have not had the proportions of liquid to oatmeal correct either. The sugar cooked out of the raisins and formed a crust, a purple crust, on top. Was rather bizarre. I will try again though because I do enjoy a hot bowl of oatmeal on a cold morning but don't want to wait for it to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Shari Stewart Ellison"
},
"reviewBody": "Well, it WAS creamy. My husband frequently has to be at work at 6 am, after I've had to work until 10pm the night before, so we liked the idea of using the crock pot. Although after reading so many problems concerning the crock pots, we decided you all were using pots that are too large. We cooked ours in a 1-1/2 qt. crock pot, following the recipe. We weren't happy with the texture. Maybe next time, we'll use a little less water overnight, then add a little more cream in the morning. We really like the idea of it so we're not going to give up on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "me"
},
"reviewBody": "I loved this easy oatmeal recipe! It tastes so much better than the usual way. I used gluten free oatmeal, and had no problems with sticking. Love it topped with fresh fruit!\n\nI think next time I'll use a little less water and add some vanilla, and another time cinnamon and apple!\nThanks for this yummy breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joann"
},
"reviewBody": "I did not care for this recipe. Maybe my low is just not low enough. It developed a really thick crust. Can't beat microwaving it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liv"
},
"reviewBody": "This oatmeal recipe was delicious! I used steel cut oats and it turned out very good. I also doubled the recipe and it served seven people with a little bit left over. Thanks for this awesome recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol"
},
"reviewBody": "I used a liner, and added fresh cut strawberries. I didn't need the salt. It was the most delicious oatmeal recipe I have ever eaten!! Thank you so very much for making my mornings brighter.\nCarol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thecautionarytale"
},
"reviewBody": "love this and it is great reheated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "covergirl"
},
"reviewBody": "10 stars. So convenient to cook this overnight and have it ready in the morning. Eat by itself or add fruits and nuts before serving. Caution, it will stick to the crock, spray with Pam or better still use a liner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkw"
},
"reviewBody": "Coach's oatmeal is the best we have found for this. At least an hour at the porridge setting in a Sanyo rice maker. The titanium coated bowl makes clean up a snap---just let the remaining oatmeal dry out and it peals right off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathi"
},
"reviewBody": "The problem of sticking to the crockpot is easily remedied by spraying the pot with Pam first. Duh! And to the people who insist on putting butter into the oatmeal (not in the recipe) I ask, would you put butter into a bowl of Cheerios? It's cereal, not a casserole or side-dish. I really like cinnamon in my oatmeal and it is actually a very good additive to help with arthritis pain relief and really boosts the taste of the oatmeal. This is a good basic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crazycatlady - \"CCL\""
},
"reviewBody": "I used my SMALL crock pot. I added the old fashioned oats, water &amp; some cinnamon &amp; left it on low for 8 hours. Gave it a stir, added about 1/4-1/3 cup 1% milk and 8 packets of sweet n low. This is also a good time to add any fruit or nuts, if you like. THEN, I added in one packet of single serve oats to get the right consistency. I put the lid back on, popped the toast in the toaster, prepared my mug of coffee and the oats were perfect! The addition of that little packet of oats made all the difference! I'll be making this often! Thanks for sharing your recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bobbie"
},
"reviewBody": "I use only groats (the hull taken off the whole oat) and not the steelcut. I put it only in a 1 1/2 qt.\nslow cooker. The water will be 3/4 the way up the side. It comes out very soft and lovely. If you don't have it between 1/2 and 3/4 full (in case you are using a larger crock pot) it won't cook correctly and you will be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lori"
},
"reviewBody": "very good. super easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nan"
},
"reviewBody": "I made this last Christmas eve for breakfast at my daughter's house. It was such a hit I'm taking it again this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gopintos"
},
"reviewBody": "The recipe probably should state \"steel cut oats.\" There are some bad reviews but it appears they did not use steel cut, and I can see how anything else would result in a big mushy mess. I forgot to put these on last night, so I put them on at about 3am on high, and after a few hours I turned them down to low. The flavor is amazing! I used half water and half half&amp;half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "covergirl"
},
"reviewBody": "absoutely lovely. Used steel cut oat so I followed advice of others and directions on container and used 4 c water to 1 c oats. Thanks to several of you easy clean up because I used a crock pot liner. It was creamy, but still had a slight chewiness. Cooked to perfection overnight. So nice to wake up and have it be all ready for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sheryl"
},
"reviewBody": "Followed recipe as written. Used tiny crock pot, turned on warm overnight as suggested by others. Used old fashioned oats, and they all had dissolved. Yes, creamy, but no oatmeal texture. Made it on the stovetop. Much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ddwaddle"
},
"reviewBody": "I have tried this with several different fruits. Its a good recipe. I have the problem of the oats sticking on the sides. My husband wakes up first, so he has been adding more oats upon waking, so they will be ready when we eat breakfast. I've tried several things to avoid the sticking. None have worked yet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adeline"
},
"reviewBody": "Best ever and SO convenient and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Way too over-cooked. A mushy mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debb"
},
"reviewBody": "So easy. Nothing better than waking up to already made creamy oatmeal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ShannonP1382"
},
"reviewBody": "Loved this! It burned a little bit despite using cooking spray, may have cooked it too long!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daizy"
},
"reviewBody": "I've made this a few times, and have found that 1cup of steel cut oats, 2cups of water and 2 cups of milk and 1tablespoon of butter makes a wonderful, creamy oatmeal. Then just add whatever you want in the morning. Hope this helps! It is a very good recipe and it is very worth having breakfast all ready when you wake up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maureen S"
},
"reviewBody": "This was pretty good. I did add 1/2 tsp of vanilla and a few tablespoons of butter to keep it from sticking. It did still stick on the bottom but most of it was ok. Maybe if it was cooked for a shorter period of time that would have helped. It was still a nice treat to wake up to in the morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Reeve"
},
"reviewBody": "Mine turned out beautifully. Instead of 1/2 and 1/2, I used low fat milk (for less fat) and some flavored kefir for more flavor and added creaminess. My picky boys ate big bowls--the first time ever w/o prodding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Shen"
},
"reviewBody": "This was fantastic and so easy! I took the advice of other reviewers and upped the water to 4 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bestcee"
},
"reviewBody": "I followed the recipe exactly. I was not using instant oats. The oatmeal ended up so broken up that it was gross to eat, so we didn't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wendyiscooking"
},
"reviewBody": "I took others advice, and used much more liquid. I used 2 cups old fash oats, 4 cups water, 3 cups milk, a little salt, 3 tbsp of butter, set on low for 8 hrs. Although there was no waste, I found it to be a little mushy so I then stirred in 3/4 cup quick oats and let sit for about 20 min. It really gave it the texture that I was looking for... I left out the br sugar. When I served it, I topped the bowl with cinn, sugar, dried cranberries, a touch more butter and walnuts ~ YUM! Can't wait to serve it for Christmas am!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marvin Williams"
},
"reviewBody": "Good recipe. I also used a small slow-cooker and it worked out just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dino"
},
"reviewBody": "I made this and added the extra cup of water as the one reviewer said and it was terrible. Too over cooked and too watery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Family loved it . followed advise from reviews - used smaller crock pot so that it was full. 3:1 ratio (4 cups water, 2 Cups milk &amp; 2 cups oats), sprayed pot and added about 2 TBSP butter, 2 small apples chooped, apple pie spice, cinnamon &amp; brown sugar to pot. Cooked on warm for almost 10 hours. Very creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayashiangel"
},
"reviewBody": "I used steel cut oats and cooked for 3 hours. Nice and creamy...Will be making this recipe again with extras like apples and cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisamarie78"
},
"reviewBody": "This was GREAT!! I have busy mornings with soccer on Saturdays so this was great! I put in steel cut oats (1c) and multi grain oats (1c) and old fashioned oats (1/2 c). with 8 cups of water. I also added 2 or 3 diced apples and cinnamon. I added 2 tbs of butter and I also sprayed the crockpot with Pam....no problems sticking at all. I will definatley make this again! Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TiffanyLengyel"
},
"reviewBody": "I followed the recipe but everything stuck so much that I didn't think it was worth it... It tasted fine, but was a hassle to clean up..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmieLynn"
},
"reviewBody": "My oatmeal turned out AWESOME! I do have to point out that the recipe really works best with steel cut oats and a crock pot that has a \"warm\" setting. Even low is too hot and causes the crusted on mess. I also advise using a crock pot liner, I always use on whenever I fire up the slow cooker, I hate scrubbing it! I omitted the salt, and used skim milk and added brown sugar/fruit/add ins after it was done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ElsieD"
},
"reviewBody": "Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ldymcbth"
},
"reviewBody": "I really didn't care for this recipe. I was so excited to find one that you make the night before and wake up to a healthy, flavorful breakfast, however, I didn't find that with this recipe. Yes, it is definitely creamy, even two days later, but the flavor was lacking. I found it very bland and too creamy. The texture of the oats is completely lost in the slow cooking process. I think I could have gotten past the texture if it had more flavor. Even after adding what I consider a lot of brown sugar, it was still lacking. I don't think I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "It didn't burn, that was the first thing I looked for when I came downstairs to have my oatmeal soI thought GREAT! I did put Pam on the 1 quart cooker. I used 2 cups water, 1 c milk, pinch salt and 1/2 apple~~no brown sugar. It was too gummy. I did use regular oatmeal not steel cut oats; however the original recipe doesn't specify steel cut oats either. I won't be making this one again. The concept is great as who wouldn't want to come out to the kitchen and have breakfast all ready. Anyone know of a non-mush way to do this? I consider the \"creamy\" term \"gummy\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missz174"
},
"reviewBody": "Great taste and super creamy. The basics of this recipe are good but the execution needed lots of adjustment based on your individual crock pot. I used 1 c. steel cut oats, 4 cups water, 1 c. cream. Sprayed my crock pot with Pam and poured the 3 ingredients in, gave it a stir, set it on low, and let it cook for 4 hours. I checked it at 4 hours and to my surprise, it was done. Thick and creamy. A little stuck to the sides but not too much. I turned off the pot and let it sit over night. Super thick and creamy and all that was stuck on the sides had come off. Just added some milk and put in the microwave for a minute then add your toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "HotBaker"
},
"reviewBody": "This came out horrible! It was watery, lumpy and a hard thick layer of oats were stuck all around the edge of the slow cooker...Will not be making this again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabatha"
},
"reviewBody": "After reading all the reviews, I think the problem is with the individual slow cookers! Mine only has slow cook/warm settings. It wasn't clear in the recipe what type of oats, but I used old fashioned oats. This is what I did to address the burning/mushy problems: I sprayed the slow cooker with Pam, added 1T. I Can't Believe It's Not Butter to mixture and cooked on warm for 10 hrs. I also adjusted recipe by adding cinnamon to taste and a capful of vanilla extract but also mixed fat free half-and-half and brown sugar in the night before to cook all together overnight. The only thing I added in the am was 2 sliced over ripe bananas. It was so creamy and it was a great bananas and cream oatmeal!! DELICIOUS!!!!! I'm cooking another batch now for my morning breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hubb"
},
"reviewBody": "I liked this but have made a few additions of my own. Add tapioca, it smooths out the pastiness of oatmeal. Instead of cream I used water and added powdered milk. It is great with added peaches or apples and a touch of cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Bloom"
},
"reviewBody": "Stove top version: Bring water to a boil add the \"dry steel cut oats\" (We love those). Boil for 4 minutes, stir, cover with lid, turn off the stove, leave on the burner, and go to bed. In the morning the oatmeal is ready &amp; can be stove or mic heated. (add cream &amp; sugar at this time) this is easier then a crock pot for me."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/88691/slow-cooker-oatmeal/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
"name": "Cereals"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1315/breakfast-and-brunch/cereals/oatmeal/",
"name": "Oatmeal Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/88691/slow-cooker-oatmeal/",
"name": "Slow Cooker Oatmeal"
}
}
]
}
}
, "about": [
]
}
]