				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooked Corned Beef for Sandwiches"
,"datePublished": "2018-03-21T12:43:30.000-04:00"
,"dateModified": "2022-12-24T09:47:16.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Suze Knisley"
,"url": "https://www.allrecipes.com/cook/189042"
}
]
,"description": "This is an excellent recipe for party sandwiches. I always make 2 (and sometimes 3) briskets because it goes so fast."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/H-8ZC4BZ1gT-EAHWbjVp3SSmVPM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1112502-fa2b98b30f7f4c3c943b4f6350e16e55.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooked Corned Beef for Sandwiches"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "827"
}
,"cookTime": "PT245M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "123 mg"
,"fiberContent": "1 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "2769 mg"
,"fatContent": "34 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 (3 pound) corned beef briskets with spice packets",
"2 (12 fluid ounce) bottles beer",
"0.25 cup peppercorns",
"1 bulb garlic cloves, separated and peeled",
"2 large bay leaves" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place briskets into a large pot. Sprinkle one spice packet over top; discard remaining spice packet or save for another use. Pour in beer, then add enough water to cover briskets by 1 inch. Add peppercorns, garlic, and bay leaves, cover, and bring to a boil."
} ,{
"@type": "HowToStep"
,"text": "Reduce the heat to medium-low. Simmer, checking hourly and adding more water if necessary to keep briskets covered, until meat is tender and can be easily pulled apart with a fork, at least 4 hours or up to 5."
} ,{
"@type": "HowToStep"
,"text": "Carefully transfer briskets to a cutting board; let rest until they firm up a bit, about 10 minutes. Slice or shred meat, then place onto a platter for serving. Discard cooking liquid or save it for another use."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT275M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I corn my own brisket. This is my go to recipe for at least 10 years, didn't change a thing. I take the liquid add it to my instant pot with onions cabbage and carrots and pressure cook high for 6 minutes natural release. Turns out perfect every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "slackgeek"
},
"reviewBody": "I thought this was really great. I made it for Reuben's on St. Patrick's Day. For the sandwiches, I used rye bread, homemade Russian dressing, sauerkraut, and Swiss cheese. I did half the recipe and I did this in a slow cooker on low for about 8 hours, but otherwise followed the instructions. The only slight change I made was that I did use the whole spice packet (the recipe says to use 2 briskets but only 1 packet, so technically I shouldn't have used the whole packet by only using one brisket). My only issue and the reason for 1 star deduction was that the meat itself really seriously lacked salt, which I thought was odd. I'm assuming the recipe doesn't call for salt because it's presumably in the spice packet and salty from brining, so I would expect it to be salty enough given I used more spice than called for. But maybe the brisket and spice packet I bought (from Whole Foods) had less salt than others?? I'm not sure. It turned out fine on the sandwiches with all the other flavors, but I can see how someone cooking this and not putting it on sandwiches might miss the salt a bit. All in all, the tenderness of the meat was amazing. Make sure you let it rest for a bit to firm it up and trim all of the fat off because it's pretty gross. Mine rested for 30 minutes or so, but it warmed up really nicely in the grilled sandwiches. I sliced against the grain and this made it nice and tender and chunky. It literally melted in my mouth with each bite. A perfect texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess"
},
"reviewBody": "This is so easy and so yummy. I have made this in the crockpot, on the stove top, and in the oven @ 250* F. Cooking time for this is between 5 to 8 hours but i find the longer you can wait the better. I usally use 2 bottles of guiness and if more liquid is needed to cover use water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kbars"
},
"reviewBody": "Never made a corned beef before this, but using this recipe, I made the absolute best I've ever had! I made it in the crockpot and also only used one corned beef (regretted that later, only because I wanted more lol!) so I cut the recipe in half while also following some other reviewer's recommendations. Ended up using 1 bottle of Killian's, 1 bay leaf, 2 tbs peppercorn medley (white, pink, green &amp; black peppercorn mix), with 6 garlic cloves plus enough water to cover the brisket. Cooked for about 8 hours on low then let it set on a plate for 20 minutes - my goooodness...melt in your mouth good! Even the picky eaters couldn't get enough of it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryani Johnson"
},
"reviewBody": "This came out amazing. Was very tender and flavorful. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wycked"
},
"reviewBody": "This is the only corned beef recipe I use. I have made it a few times.\nI use my slow cooker, set it on low, and cook for 6 to 8 hrs.\nI add extra pickling spice, peppercorns, and bay leaves. \nThe aroma in my kitchen was amazing. The bad part is it makes you hungry. Lol\nIf you want to reheat, and you don't have a double boiler, just soak white paper towels in water, wrap the corned beef in it, and put in ur microwave for about 45 seconds depending on your wattage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Martin Alexander"
},
"reviewBody": "Perfect! Made this today according to recipe, using 1 3 lb corned beef and 2 cans of Guinness. Cooked at low in crockpot for 6.5 hrs, then rested it for 30 minutes or so. It sliced very nicely, and was so tender and delicious. Made Reuben Sandwiched using the Russian Dressing from Food Network"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan zeffer"
},
"reviewBody": "Amazing. Simple but one of the best I've ever had.\nI did it all in the crockpot. I started off on high for an hr, then switched to low and cooked it for another 10 hrs. Perfect, perfect perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sallyt"
},
"reviewBody": "I followed the directions exactly. I turned out just perfectly. This will now be my go to recipe for this dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pd60"
},
"reviewBody": "This was easy to make and delicious. I used Harp beer and garlic from the jar. Slow cooker for 10 hours and perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Brooks"
},
"reviewBody": "this recipe came out great. I used a bourbon barrel stout that I brewed to cook this corned beef, and everyone loved it. I may make it again and slice it for Rubens next time. This was the best corned beef we have ever made"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ngeis05"
},
"reviewBody": "I have made this recipe several times. Every time it's amazing! I put in the crockpot for 10 hours and it's so tender its falling apart when its done. I follow the recipe exactly as listed. This is my go-to corned beef recipe year after year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Roberts"
},
"reviewBody": "I made two corned beefs in two crocks pots. One I used two bottles of guiness and the other two miller lites. Both were very delicious. I did not add water to the crocks, only a little of the meat was out of the liquid. Only used the spice packets that came with the meat. The corned beef were the point cut, which I prefer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wilbur Smith"
},
"reviewBody": "It came out really awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Treats57"
},
"reviewBody": "I've actually made this many times. This is my family's favorite. The closest recipe we have found so far to my late father-in-law's recipe for corned beef that he used to make for several Jewish delicatessens. Yum! I usually cook 3-4 3 lb corned beef briskets at one time. They go very fast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Pancott Trout"
},
"reviewBody": "Perfect &amp; easy week day meal! Followed the recipe exactly (used Coors light) and made Reuben’s for my very hungry boys! We loved it, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nearcon"
},
"reviewBody": "I won't make it again, sorry but I didn't care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This is SO good! We did shredded sandwiches with cole slaw and swiss. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bjld"
},
"reviewBody": "Even this non-cook found this recipe to be simple, easy and delicious. As a previous reviewer said: \"remember to cut against the grain.\" (TY) Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ksemkiw"
},
"reviewBody": "Great recipe!! This will be my go to for corned beef in the future. I did about 8 hours on low in the crockpot and it was amazing!! Only problem (not a problem) was I never got around to slicing it for sandwiches because the meat was so tender it just fell apart. Definitely recommend!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dee Hines"
},
"reviewBody": "Used only one bottle of beer and half of the garlic. Did stove top for 8 hrs. very tender. Cut for Rubens"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather O"
},
"reviewBody": "We boiled the brisket for 5 hours, trimmed the remaining fat and made what I call fake Reubens!! The meat was juicy and tender. We baked the sandwiches at 350 degrees after cutting meat to melt the Swiss cheese for total 8 minutes. Then we topped with Romain lettuce and fat free thousand island dressing. We used bake ham in the past for our fake Reubens but this brisket was amazing. We only used 3/4th garlic bulb though because I read a review on it. Left overs are great too. I think garlic bulbs vary in size, so don’t get the large types. Get the smaller if you’re worried about it. Ours was perfect. No brisket rinse is needed either, skip google."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacquie Garel"
},
"reviewBody": "This was great! No fuss, easy prep with a few on hand ingredients and a brisket that I managed to get on sale. Set it up before work today and got to come home to an hearty meal that everyone enjoyed. Served it with fresh-made bread, sauerkraut, improvised Russian dressing and salad. I will definitely be making this again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRE1"
},
"reviewBody": "I've made this many times and it is by far the best recipe for corned beef. The meat is very tender and the flavor is perfect. I will do this recipe and cook the cabbage, potatoes and carrots separately. An absolute keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Li1074"
},
"reviewBody": "I love this recipe. I take 2 slices of rye bread, toast it lightly. Spread one slice of toast with butter, on the other slice I put some thousand island dressing and then place a slice of Swiss cheese on top, and pop that side back in toaster oven to slightly melt the cheese. Once melted I top the cheese toast with the corned beef, put some sauerkraut and then top with the buttered slice of toast. Everyone loves it and it couldn't be easier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richele"
},
"reviewBody": "great flavor but needed to cook a lot longer than 4 hours on low in my slow cooker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Henry"
},
"reviewBody": "I make it almost the same just with a little less garlic, now that being said Does anybody know how to make the spice in the packet. Mine doesn't have one about a 12 lb c"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grow Family Love"
},
"reviewBody": "Amazing!! Thanks Naples34102 for the great suggestions!! Best corned beef yet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie Dickens Hayslett"
},
"reviewBody": "I make this exactly as written with ingredients--but I throw it all in the crockpot. My ruebens are better than ANY deli I've been to. The flavor of this meat is TO DIE FOR! This seriously could not be any easier. Thank you so much for this flawless recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NicoleR33"
},
"reviewBody": "I've been making corned beef for years and came across this recipe. Look no further! This is the one! I usually make it in the slow cooker and was hesitant to boil it on the stovetop but figured it was worth a try anyway. I'm so glad I tried it! I followed the recipe, except I halved it, as I only had one brisket. I cooked it in my Dutch oven, but had to weigh the brisket down with ramekins because it kept floating to the surface. I cooked a 4lb brisket for about 5 hours and it was very tender. So much better than any slow cooker recipe I've tried! I made it into sandwiches, which were delicious. A 4lb brisket would make about 4-5 generously piled sandwiches. Try this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Wilson"
},
"reviewBody": "I've stopped searching for the best way to prepare corned beef and will always use this recipe from now on. The ingredients and method are really simple, so I don't know what creates such incredible flavor, but I couldn't stop nibbling at the corned beef nor sipping the cooking liquid once it was done. I did add some beef stock base to the water which gave it extra richness, and I used an IPA for the beer. All ingredients went in the slow cooker on low heat for about 10 hours, so it was incredibly easy as well. Absolutely wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ersatz Cook"
},
"reviewBody": "As naples34102 said in her review, look no further! My husband found a 3 lb. store brand flat cut corned beef in the bottom of the freezer last week (frozen a year ago). I wanted to try this recipe and I'm so glad I did! I reduced the recipe by half and followed the recipe to a tee, something I almost never do. I chose Newcastle beer because I've cooked with stout beers in the past and we found that they overpowered the delicate flavors of the other ingredients. I cooked this in my 4 quart slow cooker - I fit it in by cutting the brisket in half, added the garlic, pepper corns, beer, additional 3 cups of water, and the full seasoning packet. Cooked on high for 2.5 hours then on low for an additional 3....plus? hours. I removed the meat and tented on a cutting board, poured the liquid into a pot. I cooked my veggies in the liquid for 15-20 minutes while Hubs was slicing the brisket (against the grain). All I heard during the meal was, \"mmm\" \"mmm\", and finally \"Honey, this is the best corned beef you've ever made!\" I asked him to rate it from 1 to 5 and he immediately said, \"11 !!\" I don't think the leftover brisket will make it between 2 pieces of bread! I can see why the submitter makes 2 or 3 at a time!! Sometimes simple is best and this recipe is a perfect example. Thank you so much this recipe, Suze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SZYQ1"
},
"reviewBody": "Made as written, but cooked everything in the slow cooker on low for 10 hours. Sliced some for initial sandwhich, but wrapped the rest of the corned beefs in foil and placed in fridge. The next day, used our deli slicer to thinly slice the rest of the meat. Perfect, easy, and delicious corned beef! The flavor reminded my husband of a corned beef he used to get an old deli in Chicago, which closed many years ago. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Millana"
},
"reviewBody": "I made this March 19th 2017, we had corn beef sandwiches for dinner. This came out like butter!!! Once cooked I let it cool off then put it in frig wrapped in foil, sliced it in the evening with electric knife. Next day hubby was still talking about how delicious it came out! I cooked it overnight on low for 10hrs, added 12oz porter, only made one brisket BIG BIG mistaken should have made at least three. I followed the rest of the recipe. Thank you for sharing an absolute awesome recipe, I'll be making it often!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LAperson"
},
"reviewBody": "I made mine in a Cuisinart electric pressure cooker. 90 minutes for a 4 1/2 pound corned beef. A stove top pressure cooker would probably take about 10 minutes less as the PSI is usually higher. I've also made this recipe on the stove (regular pot) and in a crockpot depending on what my time limits were and what equipment I had on hand. It's always GREAT. So use this recipe and the cooking technique that works for you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Diana"
},
"reviewBody": "Why mess with the rest, when you can mess with the BEST? Tomorrow will be my 5th time making this. It comes out perfect every time. Mine goes into the crockpot on low for 10 hours, as others have suggested. When it's done, I used a spoon to scrape off the fat. I also use the cooking juices to boil potatoes, cabbage, onion and carrots. I highly recommend making the slurry as others have also suggested. I serve rye bread with this, but everyone uses the bread to dip into the slurry. We eat this more \"stew style\" than for sandwiches. Another reviewer suggested rolling the corned beef into tortillas - great idea. Pair with some friend potatoes and you have yourself and amazing breakfast/lunch/lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Taylor Stewart"
},
"reviewBody": "This is the best of the best! I use this recipe every year. It falls apart and melts in your mouth. Sandwiches are to die for!!!! More stars it does deserve!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Six"
},
"reviewBody": "Perfection. I've made it 5 years in a row for St. Paddy's Day and everybody raves. Always use my slow cooker instead of stovetop. Always use Guinness beer. After it cools enough to handle shred it removing fat as I go. My one addition: I strain and defat the cooking liquid and add it back to the shredded meat for serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PickyEater"
},
"reviewBody": "This recipe has become a St Pats day tradition in our home. Not being fans of cabbage we like to cook this in a slow cooker with potatoes and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlana"
},
"reviewBody": "Perfect recipe for corned beef. Why cook it in water when you can cook it it beer! I like to cook it in my slow cooker all day on low. I also like to cook it the day before then refrigerate overnight.... that way you can slice it super thin. I always use this recipe when making Rueben sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lgabriel52"
},
"reviewBody": "This recipe was super easy when using the slow cooker. Per reviews either 8-10 hours. I picked 9 and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "This is THE way to make corned beef! We had never been real corned beef and cabbage fans. While the corned beef had a distinct flavor, there was always something missing. NOT ANY MORE! This recipe filled in that gap. I started exactly as described, but ended up cooking it for about 7 hours because it still felt a little tough after 5. Otherwise no changes. I added cabbage, potatoes, and carrots for the last 1.5 hours of cooking. This made a great meal and the first corned beef and cabbage we really enjoyed. Used the leftover corned beef for Reuben sandwiches the next day, and they were delicious too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Smithwick"
},
"reviewBody": "This turned out Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pierre2284"
},
"reviewBody": "This was awesome! I just put all of the ingredients in the crock pot before I left for work. We ended up making Rubens with it and with the leftovers I think we will do a casserole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexandria Elizabeth"
},
"reviewBody": "Very, VERY good, easy to follow recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicaw"
},
"reviewBody": "Best corned beef I have ever had! Will make this every year on St. Patrick's day now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BARNKITTY"
},
"reviewBody": "This was just okay for me. The flavor from the cooking liquid was just a little funky for my tastes. Maybe too much garlic? It wasn't *bad*, but just not my favorite for corned beef. And while the meat shredded easy, it wasn't as tender as I thought it would be after such a long cooking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emy Porter"
},
"reviewBody": "I read many corned beef recipes prior to st patties and went with this one after reading the reviews. It really is the best corned beef recipe. I've adapted it a little for our family, using beef broth instead of beer and cooking it in the slow cooker for 8-9 hours on low. For St Patties, about 1 hr before serving, I remove some of the broth to use for cooking diced potatoes, cabbage, and carrots in another pan on the stove. (there usually isn't room in my slow cooker or I'd just add the veggies for the final hour of cooking). If you take out most of the broth, turn off the slow cooker to prevent burning your meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NH Grammy"
},
"reviewBody": "Chilling the beef before slicing allows for super thin, uniform slices. Also easier to remove all fat when chilled. 3.5 lb is enough for 4-6 servings, once cooked. I serve hot with Easy Colcannon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsmouselips"
},
"reviewBody": "Best corned beef recipe I have. Put all ingredients in a slow cooker and cook for 12 hours on low. It is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila H."
},
"reviewBody": "This was the first time I have ever made corn beef. I only made one and split the ingredients because I wasn't sure how it would come out. My kids (pickiest eaters ever) loved it! I followed the recipe exactly... Wow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJ"
},
"reviewBody": "I only made one, vs. two, that the recipe called for. I did mine in my crock pot, and the only thing I did different was omitted the water, and added extra beer. It was very delicious, and tender. I cooled it for about 10 hours before slicing, and it turned out perfect. Next time, I will be making two, as one is not enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adjohnson12374"
},
"reviewBody": "This is a DELICIOUS recipe! I will never make corned beef any other way. I'm using it for the third St. Paddy's Day in a row. The only recommendations that I will offer is to trim most of the fat from the briskets, use both peppercorn packets, and definitely use an Irish stout such as Guinness for the beer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "malinowfamily5"
},
"reviewBody": "Every year my husband looks forward to St. Patrick's day because of this recipe. I tell him Ruben's aren't very Irish, but corned beef is on sale!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aputler"
},
"reviewBody": "Made exactly per recipe using two flat cut beefs and served with Diane's Colcannon from this site. Great meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CathyAR"
},
"reviewBody": "Very Good! I did not have peppercorns so I used course ground pepper, I cooked it in the crock pot. I sliced it thin and served on rye bread with sauerkraut and pepper jack cheese. Everyone loved it, I will make it again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Hlavaty"
},
"reviewBody": "Great recipe, this is the only way I'm making corned beef from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Rowen"
},
"reviewBody": "Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCIOTA"
},
"reviewBody": "Note that the meat will shrink to about 1/3 the original size. Use 25 oz Fosters in blue can and omit water. 8 hours on low in crock pot. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Underhill"
},
"reviewBody": "I followed creative cooks' suggestions with this. It's now our st. Paddy's day annual meal. Superb!!\n\"\nI made the corned beef (using Guinness) exactly as written and cooked it for 6 hours on the stove top. I then removed the meat (which fell apart) and added 3 pounds quartered new potatoes, 2 pounds baby carrots (cut in half) and an onion. I let that cook for 20 minutes and then added a head of cabbage. I cooked an additional 15 minutes. Then I removed the veggies and made a gravy out of the leftover stock using a slurry of stock and corn starch. This recipe was a huge hit last night for our St. Patrick's Day get together. Very authentic tasting and the peppercorns get soft as they cook, so when you bite into one, you get a nice kick without being overly powerful or chipping your teeth. This will be our annual tradition!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAZSIL"
},
"reviewBody": "Our goto crock pot corned beef recipe. Great traditional corned beef. I wouldn't say it's tough, but I'd say it's firm enough not to shred when you cut it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzy-q"
},
"reviewBody": "I made this exactly as written and it was wonderful. This recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Tomitz"
},
"reviewBody": "I made this recipe for my boyfriend's birthday. He is A HUGE Reuben fan so I had to meet his high expectations. Let's just say that he absolutely LOVED this recipe. He said it was the best corned beef he has ever had.\n\nNow, for those of you who are unsure of whether or not to trust this recipe, PLEASE trust it. I did everything it told me to do. I used the 1/4 cup of whole pepper corn, the 2 (12 oz) bottles of beer, and the entire clove of garlic. I was extremely nervous that the ingredients would be too overpowering but it was just absolutely fantastic. I used my slow cooker as well. I put the whole garlic on the bottom, placed the corned beef on top, and then poured the spice packet, the pepper corns, and the beer over the corned beef and cooked it on low for 10 hours. I cannot explain how flavorful it was.\n\nFYI as a small tip. Take the corned beef out of the slow cooker BEFORE you pull it. I started to pull it apart in the slow cooker so I had to go and pluck out every single pepper corn because it got mixed in with the beef haha! I also used yuengling as the beer by the way! Leftovers were also incredible. Not too sure what one of the reviewers was saying about the leftovers not being good because I did not have that problem at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrspryce"
},
"reviewBody": "I made it! I only made one brisket and adjusted the directions for one instead of 2. I slow cooked for 7 hours, when done (tender) I removed the meat from the juices, shredded it on a chopping board, piled it high on an onion roll added a nice vinaigrette slaw, swiss cheese and honey mustard. \n\nI'm giving 4 stars only because the next time I make it, I will add pickling spice to the recipe. We tend to like a little more flavor around here. Other than that \n\n\nIt was a HIT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juju Vettrus"
},
"reviewBody": "My family loves this. I've used several different types of beer and it always comes out great. Definitely give it a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kurlyy1"
},
"reviewBody": "Kids weren't crazy about it but I loved it!!! Served with cabbage and cornbread. Yummm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Keveryn"
},
"reviewBody": "I just made this, cut recipe in half. Only 2 of us. It is excellent, tender and makes the best sandwich.\nI would highly recommend this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susan"
},
"reviewBody": "Amazing. Used 'Better Than Bouillon' beef broth to water as suggested. And beer. Can't wait for next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katyk"
},
"reviewBody": "Never cooked corn beef before. Followed recipe exactly. First time tried to cut after ten minutes didn't slice well. Took the advice from other reviews and wrapped the meat in aluminum foil and put in the fridge overnight. Sliced perfect the next day. This was a hit, everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UZIMIKE"
},
"reviewBody": "Being from Cleveland I am a huge fan of corned beef. I have tried many recipe versions, mixing this spice with that beer and this cooking method with that cooking method. All produced acceptable corned beef, but nothing reminiscent of that taste I get from back home. When I saw this simple recipe with all the peppercorns and garlic cloves, color me dubious at best. \r\n\r\nAs the hours ticked by (I used my crockpot), curiosity got the best of me and I tasted the pot liquor from the brisket. Immediately I was impressed by the flavor. About the 8 hour mark, my fork test passed so I turned off the crock-pot and allowed the brisket to sit in the liquid for about another hour or so. I then removed the brisket and put it in the fridge to cool. \r\n\r\nThe next day I broke out my meat slicer and sliced the cooled brisket thin against the grain. I had reserved the cooking liquid and defatted it, thinking the brisket may need extra juice – wrong. When the meat was gently warmed it gave off enough liquid so my slices and sandwiches were very juicy. \r\n\r\nI used one bottle of Guinness Stout, one brisket – about 3.5 pounds, 1/8 C cup of peppercorns, half of a bulb of garlic -about 10 cloves, and I did use the entire spice packet from the brisket. Everything else was prepared to recipe. \r\n\r\nPerfect. I am no longer looking for the best recipe. This is it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie"
},
"reviewBody": "Made the recipe exactly as written, except i used my slow cooker. This was by far the BEST corned beef I've ever made or eaten! I put everything in my slow cooker at 6am and by 6pm I was slicing the most flavorful, moist corned beef ever! I'm 1/2 Irish and make corned beef every year. I wish I would have found this recipe a long time ago. It will definitely be my go to recipe from here on out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darlene Bristol"
},
"reviewBody": "Perfect just as written! I've made this recipe many times and my family loves it! I cook it in the slow cooker and add veggies towards the end. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Butch g"
},
"reviewBody": "Made this tonight. I used the Guinness North American brew. For my beer came out great. This will be my go to sandwich for a long while. So easy to prepare."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luann Szajna"
},
"reviewBody": "I made this tonite and it was a smash hit. Words cannot express just how yummy it was. The only thing that I added was a half more bulb of garlic (the bulbs were small), and since I made 8 lbs in a roaster oven, I added a regular size can of beef broth to make sure I had enough liquid. It was so good and it melted in our mouths! The seasonings and beer were perfect in this recipe. I sliced up the brisket and made some hearty reuben sandwiches.Thank you so much for sharing this recipe! I had saved it for future use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MGalazyn"
},
"reviewBody": "Best corned beef ever! Use all the ingredients as noted and just put in a crock pot on low for 10 hours - perfect every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FloridaTennisGirl"
},
"reviewBody": "My hubby has awarded this the BEST corned beef sandwich EVER and he has tried corned beef all over town! What started as a trip to our local deli for a corned beef sandwich and found that they were closed turned into a trip to the grocery store and to this site. I am a newbie to corned beef and had NO idea where to start. This recipe was easy and the best! My hubby thinks I slaved in the kitchen all day preparing this.....I am not sure I will tell him otherwise :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilred70670"
},
"reviewBody": "I rarely make corned beef because they usually turn out tough or stringy, but a local store had brisket on sale for 50% off, so I decided to try one more time to cook one. After making this recipe, I sent my husband to buy 3-4 more before the sale ends! The meat was tender and delicious! I used a bottle of Guinness Extra Stout and poured the spice pack into a cheesecloth bag and added them to the crock pot with the brisket. I also roasted the whole bulb of garlic in the oven for approximately 30 mins before adding it to the crock pot and cooking it all for about 10 hours on Low. We loved the meat on ruebens last night and I'm sure we will love the hash I make with the leftover brisket in the morning! Thanks so much for the wonderful recipe and restoring my faith in brisket made at home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dadburnit"
},
"reviewBody": "Used this for making Rueben's and it made the best Rueben's we ever had. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asekhri"
},
"reviewBody": "This is my go-to recipe for St. Paddy's Day and is always a crowd pleaser. I highly recommend using Guinness (cans are highly preferred to bottles b/c of the widget inside that keeps it well mixed - 1 can per 3 lb. brisket), and also recommend tripling the amount of garlic per brisket - it really helps with the overall flavor. I also cook in the crockpot for about 8 to 10 hours over low heat. Serve with a really great rye bread (Oroweat has a really nice Dill Rye) that pairs well to bring out the flavors. So easy to do - just make sure you buy a good quality brisket :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CraftyPancakes"
},
"reviewBody": "The best recipe I've tried for corned beef. The beer gives it a great added flavor. I used the meat for sandwiches and everyone loved it. This is now my go-to recipe for cooking corned beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bluemoon20"
},
"reviewBody": "I love this recipe, so simple yet fantastic sliced down for Reuben sandwiches. I use the crock pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigBabee"
},
"reviewBody": "I made this yesterday for St. Patty's Day. I was a little nervous because I had never cooked corned beef before and I wanted to serve my family Reuben sandwiches. I followed the recipe to the tee and let me tell you it did not let me down. I cooked 2(3)lbs corned beef briskets and I am proud to say there is absolutely NO left overs. This recipe is definitely a 10 in my book. DH asked me stop by the Grocer today to pick up another corned beef while they are still on sale. Thank you for sharing this fabulous recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dave and kaci"
},
"reviewBody": "It is true. Look no further. First time ever and this corned beef turn out perfect. I used a crock pot and cooked on low for 9 hours. AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brocks"
},
"reviewBody": "I used a slow cooker and could not fit both pieces of meat in one. The only beer I had was Blue Moon and used a dried outrageously garlic seasoning from Two Sisters Gourmet. Slow cooked for 8 hours, removed and let rest. We sliced the meat and made Reuben Sandwich l l. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Biesrjcw4"
},
"reviewBody": "We have used this recipe over and over. My family LOVES it. The only change I make is substituting apple juice for the beer. The results are delicious! We never have enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brady Hamilton"
},
"reviewBody": "This recipe is 'spot on'. It's critical to use Guinness and NOT a domestic beer like Bud or Coors or Miller. The only thing I changed was adding about 6 pieces of bacon to the crockpot. WOW! This took the taste of the corned beef to a whole other level."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joann Smith"
},
"reviewBody": "Absolutely love this recipe. Make it every year for St. Pat's Day never have even a smidgen left :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chinnim"
},
"reviewBody": "House smelled wonderful when I got home from work. I used the crock pot and cooked for 10 hours. Was great. I did only use one beer. I'm not always a fan of the hops flavor. Next time I will try 2 beers. The bulb of garlic and 1/4 cup peppercorn is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Thriftynin"
},
"reviewBody": "I used a prepackaged corned beef portion from Fred Meyer. It did not come with packets. Followed recipe sans peppercorns and beer. The covering with water method makes this meat SUPER tender. Great for sandwiches. HOWEVER….severe lack of flavor. Would be better cooked in beef stock or broth. Was very tender but no flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HockeyMom"
},
"reviewBody": "I've made this recipe several times. I love the flavor and the simplicity. I recently made it with Ginger Beer because it was the only beer I had left from a party. Wow...that added a whole new flavor dimension to the corned beef. It was amazing! I will make it with Ginger Beer from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ras859"
},
"reviewBody": "This sounds excellent, so want to make it. I'm trying not to sound dumb, but when she says 2 (3 pound) corn beef briskets, does she mean 2 3-pound briskets equalling 6 pounds or 2 briskets that equal 3 pounds?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Hoffmann McNeill"
},
"reviewBody": "One of my DH favorites. He asks for it about once a month. Make it as written and use Guinness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "This recipe makes the most awesome corned beef ever! Throw away any other recipes. This is the only one you will ever need. Thank you so much for sharing this one SDK999."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kmm808"
},
"reviewBody": "I halved the recipe since I only had 1 brisket. I added in a can of beef broth, but otherwise stuck to the recipe. Yummy!! I dipped the sourdough bread into the sauce and added the sliced corned beef and it was a huge hit with my teen boys and husband! This is the first time I've had anything other than canned corned beef--never again going for the can! Thanks for an easy recipe that was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mickdee"
},
"reviewBody": "Have made this several times and it is so simple and absolutely tasty. Don't know why I never reviewed it! It makes a great main dish and awesome Reubens the next night! I find the thin slices for the sandwich are much easier to cut after it has been in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Lema"
},
"reviewBody": "Amazing every time! I follow the recipe to the letter and comes out wonderful each and every time. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennicaakes"
},
"reviewBody": "Made this last night,It was so good. No leftovers. I did add 3 tbls brown sugar and in the last hour put in some potatoes. But this is the way i will be making cornedbeef for ever now. thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LizWilson"
},
"reviewBody": "This has been my tried and true recipe for several years and I made the mistake of trying the Braised Corned Beef Recipe for our family meal. BIG MISTAKE! I intend to quit experimenting and use this recipe from now on. I have never had it turn out tough or tasteless like the baked version did, and my family was in rebellion. I am just glad I bought extra corned beef while it was on sale and we were able to have the good stuff (this recipe) and I redeemed myself for the family. This recipe needs absolutely NO CHANGES! It comes out perfect every time whether I make it just for sandwiches or use the broth to cook the vegetables and have a full corned beef dinner. Thank you thank you thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Kester-Hayes"
},
"reviewBody": "Followed recipe exactly except cut in half and used crockpot. Loved, loved, loved it. Having the last sandwich for lunch today. I'll have to make another one soon!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/83844/slow-cooked-corned-beef-for-sandwiches/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1031/main-dish/sandwiches/beef/",
"name": "Beef"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/83844/slow-cooked-corned-beef-for-sandwiches/",
"name": "Slow Cooked Corned Beef for Sandwiches"
}
}
]
}
}
, "about": [
]
}
]