				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Carnitas"
,"datePublished": "2019-04-02T02:48:56.000-04:00"
,"dateModified": "2022-07-21T17:38:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Erin Parker"
,"url": "https://www.allrecipes.com/cook/1342342"
}
]
,"description": "In this easy slow cooker carnitas recipe, pork is simmered in a flavorsome broth to make a delicious filling for tamales, tacos, and burritos."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IdiFLjoFumcjdba-nN2k42kZZh0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5369243-0effadc01c7c4a0bbf7f668f182078b3.jpg",
"height": 844,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1793986775001",
"description": "Make an amazing slow-cooked pork filling for tacos, enchiladas, and burritos.",
"duration": "PT3M4S",
"name": "Slow Cooker Carnitas",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/7be03303-b99c-4500-876e-ca35b5eaaba4/cd5b6103-0f83-4d85-99a6-ec9822e12222/1280x720/match/image.jpg",
"uploadDate": "2021-07-09T16:53:39.903-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Carnitas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "2050"
}
,"cookTime": "PT600M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "223 kcal"
,"carbohydrateContent": "1 g"
,"cholesterolContent": "73 mg"
,"fiberContent": "0 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "474 mg"
,"sugarContent": "0 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 teaspoon salt",
"1 teaspoon garlic powder",
"1 teaspoon ground cumin",
"0.5 teaspoon crumbled dried oregano",
"0.5 teaspoon ground coriander",
"0.25 teaspoon ground cinnamon",
"1 (4 pound) boneless pork shoulder roast",
"2 bay leaves",
"2 cups chicken broth" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix salt, garlic powder, cumin, oregano, coriander, and cinnamon together in a bowl; coat pork with spice mixture. Place bay leaves in the bottom of a slow cooker and arrange pork on top. Pour chicken broth around the sides of pork, being careful not to rinse off spice mixture."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on Low, turning after 5 hours, until pork shreds easily with a fork, about 10 hours in total."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IdiFLjoFumcjdba-nN2k42kZZh0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5369243-0effadc01c7c4a0bbf7f668f182078b3.jpg"
}
]
,"text": "When the pork is tender, remove from the slow cooker; shred with two forks. Use cooking liquid as needed to moisten the meat."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT610M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scasey70"
},
"reviewBody": "I took all the recommendations. Double the spices, except cinnamon, kept that as is here, and replaced garlic powder with fresh garlic cloves. Replace Added 1TBL of Chilli Powder as recommended. Cut meat into pieces, rubbed all and saved some rub to add after when we browned it in the pan with some juice. Let's just say the kids want this more. and no other version I've ever made before"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I make it all the time and it's good. Since I have a small family, I try to do one meal of burritos and then a meal of nachos or enchiladas or something like that with the leftovers. Tastes better than it smells. Listen to the people who say add more spices, it's a bit bland as written. Don't listen to anyone who thinks the cinnamon is bad. It's actually good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cruiseplanner"
},
"reviewBody": "I made this according to the recipe with the exception of making double the rub as I like the flavor. I used two thirds of the rub before cooking and after pulling the pork I sprinkled the dry rub on the pulled meat and stirred. Extra flavor and use this for making my enchiladas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayle Fossoy"
},
"reviewBody": "This was a big hit. The \"something missing\" is chili powder. I cooked a 6 pound shoulder, so I used 2 heaping tablespoons. I also didn't have any coriander, but I did have fresh cilantro, so I used about half of a bunch. I added it in the last 30 minutes of cooking. One of my friends suggested that next time I cut the roast into chunks and put it under the broiler for a couple of minutes. I might do that. We used the leftover meat from our burritos to stuff green peppers. I cooked a package of Knorr Spanish Rice and layered the meat and rice. When I ran out of rice, I opened a can of refried beans. YUM! My husband loves the cinnamon in this recipe, so I will leave it in, even though I am not as big a fan. I want to try making it with jalapeno peppers too. It's a good solid recipe that you can use for a lot of Mexican meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flower mother"
},
"reviewBody": "My family loved it! Other than having a heavy hand on some of the spices, I didn't change a thing. I did take the advice of Naples34102, and I did spread it out on a cookie sheet to bake for a bit before serving to crisp some of the edges. It will be our go to for pork based dishes from Burrito night, to Cuban Sandwiches, to Puerto Rican dinners."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is a staple in our house. My family calls it \"meat candy\" haha! I don't understand why people omit the cinnamon that is my favorite thing about the flavor. But like others have said, I also double the spice recipe . After it has cooked for several hours i take it out shred it and throw it in a cast iron with some of the juices to crisp it up. I also get canned pineapple and pour some of the juice on top for extra flavor then dice up the pineapple and add it in at the end. Top with cilantro, tomatoes and onion. So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "prairiegirlwest"
},
"reviewBody": "Don't leave out the cinnamon! The hint of it is absolutely wonderful. My sister-in-law and I started making this for her son's birthday party years ago and it is a favorite of both our families. I do double the other spices and sometimes I'll throw in an onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica M. Robinette"
},
"reviewBody": "I have made this recipe many times for different gatherings and have always gotten rave reviews. I love the addition of cinnamon - I think it’s what gives it it’s amazing/unusual flavor. I did add more spices cause I just like things spicy 😜 I’ve also always thrown in a diced onion and a few garlic cloves because I love the flavor it gives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FunluvinGourmet"
},
"reviewBody": "This is a delicious recipe. I too, doubled the spices. I highly recommend you cut the meat in pieces. It definitely helps to penetrate the flavor through the meat. I started the crockpot on high for 3 hours and then turned it to low for 4 hours. The other suggestion is to shred the meat and then put it back in the juice in the crockpot to just sit for an hour or two. This is a fabulous dish. Served simply in whole wheat low carb tortillas with onions, cilantro and a few fresh diced tomatoes. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christopermario70"
},
"reviewBody": "Used country style ribs and meat shredded very nice! Took shredded meat and broiled in oven to crisp. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jawenning"
},
"reviewBody": "I made extra rub and put it all over. So good, love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "6w2zdtcgrt"
},
"reviewBody": "I had a 3.5 pound package of “carnitas,” with five pieces. Like the others, I tripled the rub amounts except the cinnamon. I also tripled the bay leaves because I wasn’t really thinking. I was so happy with how it turned out. I piled the meat in the center of the crock pot, and the layer of spice rub was still there at the end. I got so much more surface area. The meat was flaky, tender, and moist after six hours (on the lowest, “ten hour” setting). I will be making this again and again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dave Lawlis"
},
"reviewBody": "This was pretty good, although I think it could have used more seasoning. I omitted the cinnamon and added a half tbsp. smoked paprika. Also, you can skip the chicken stock, the pork will generate plenty of liquid on its own. I even cooked the remaining liquid down to concentrate the flavor and skimmed off the fat before adding any back into the pork. I also stuck it under the broiler to crisp the edges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "Tasteless but salvagable. \nI've tried MANY slow cooker pork shoulder recipes and with 2K reviews, I thought I'd give this one a try. Sadly, this one ranks one of the lowest. I did double the seasoning and omit the cinnamon (as suggested by other reviewers).\nI was able to salvage the dish by removing and reducing the liquid after adding demi-glace, a tablespoon of brown sugar, orange juice, lime juice, onion powder, dried oregano, more salt, fresh ground pepper and cilantro to finish. \nI reduced the liquid by 1/2 and added it back into the pulled pork.\nNow THAT taste like something worth cooking and eating."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "buske78"
},
"reviewBody": "Moist and flavorful, but it does not need cinnamon! In my opinion, cinnamon should never be used with a savory dish like this (or chili) and only used in combination with a sweet dish like rolls. The cinnamon was too overpowering of a flavor. Will likely make again, but with zero cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candy"
},
"reviewBody": "I followed the previous comments and doubled the spices. It was a huge hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Wow! This is quite amazing; bursting with flavor! I doubled the seasoning and also cut my roast in half as suggested by others. I couldn’t find a pork roast at 4 lbs so I bought a smaller one and it was tender after 7 hours in the crockpot. I normally don’t buy pork at all so this is a nice change up and I’m excited to serve it...most likely taco style with pico de gallo, and lime cilantro rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyk3"
},
"reviewBody": "Amazing! I made this with pork tenderloin because that is what I had. I tripled the recipe for seasoning, except for cinnamon and only doubled that. I also added some hatch chiles because I love those. The pork fell apart and was extremely easy to shred. So easy and delicious. My whole family enjoyed this!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandm7675"
},
"reviewBody": "This was fantastic! I would like others double the spices for our household. My neighbor loved it! Thank you for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Awaski"
},
"reviewBody": "I made this exactly as written. My family and I really like it. We used it for pulled pork sandwiches. The meat from the blade roast is flavorful with the spices in this recipe, I wouldn't change a thing. I liked this enough that I did not want to drown it in BBQ sauce. I cooked the roast on low for 10 hours in the crockpot as directed, then shredded it and added back to the pot. Since we weren't ready to sit down to dinner yet, I let it continue to cook on low for another 2 hours. There is plenty of liquid remaining to reheat the leftovers in. Thanks for a nice recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mel"
},
"reviewBody": "Super good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick Berk"
},
"reviewBody": "Outstanding and flavorful. Have used it in burritos, burrito bowls, and on nachos. Easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rich"
},
"reviewBody": "Best Carnitas that I've made. I doubled the amount of seasoning that the recipe called for and added some onion slices to the slow cooker. I also finished cooking it in the oven (20 min.) to give the meat a little crispy texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "krisleighd"
},
"reviewBody": "I rarely cook pork, but these turned out pretty good. when I first tried them out of the crock I thought they were just okay, but when I sat down and ate them, the subtleties of flavor were there. I'd make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bessiedarlin"
},
"reviewBody": "This was delicious! We used pork chops (with bones since that's what I had - next time no bones for sure). We also did not add cinnamon (personal preference) and I did not have coriander but we did triple the amount of seasonings. OH! and we added about 6 cloves of fresh, chopped garlic (along w the granulated garlic). I shredded and mixed with laughing cow light cheese, and shredded cheddar then baked at 400F in a roasted, deseeded poblano. YUMMY! The kids ate the pork by itself. Thanks for a great recipe : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "casies"
},
"reviewBody": "Loved these! I used a 5lb bone in pork shoulder. Cooked about 8.5 hrs. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lorton mom"
},
"reviewBody": "This recipe was super easy. I loved that I could just put everything in the crock pot and walk away. The meat did come out flaky but was dry. We added some of the juices to the meat and soaked it over night in the fridge. My husband wasn't a fan of the flavors. I would try it again but maybe switch up the seasoning and research some ways to help the meat stay tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lora Wade McKinney"
},
"reviewBody": "We found this to be a bit bland. I think we will look for other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rjwenger"
},
"reviewBody": "Our whole family Loved this! Tripled the spice rub recipe like recommended. Only 1x the cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maria holm"
},
"reviewBody": "This is seriously my most favorite carnitas recipe of all time. Never slow cooked though. I also take fresh garlic and blend into a paste with the spices. Slaughtering all over, cook each side and bake in my Dutch oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "So good! This is one of the few recipes I can honestly say AS GOOD, IF NOT BETTER THAN a restaurant. Used this for tacos with corn tortillas, onion, cilantro, sour cream, hot sauce, and fresh lime. Tastes just like if we were to go to the local taco truck. I used a 2lb pork shoulder and cut the seasonings in half. Added 1 tsp of coriander as other recipes I was looking into included. I didn’t have any orange juice on hand, so I used 1/4 cup of apple cider vinegar (compared to 1/2 cup of juice because I cut the recipe in half). Also broiled the meat to get it nice and crispy while heating up the tortillas. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jordan "
},
"reviewBody": "YUMMY and easy! Not sure how authentic this carnitas recipe is, but it's super versatile. Great for making street tacos and pulled pork sandwiches (no need for sauce)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "This is a great recipe. When it’s done I divide it into serving portions for my nacho dip. I freeze them and it works out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GI Jane"
},
"reviewBody": "I've made this recipe as is a couple of times. I always make a double sized boneless pork butt (or shoulder depending on your your are from) Using a double sized butt, I double all the seasonings, except for the bay leaves. I also use 2 heaping tsp of Chicken flavor Better Than Bullion disolved in 2 Cups of warm/hot water. BTW if you put it in your slow cooker fat cap up, it will baste itself as it cooks. I also don't trim any fat off, cuz that's where all the flavor is! Then we wait for the magic to happen, teased by the intoxicating aromas! This is step one in my process for making Tamales! Once cooked and cooled, I don't usually crisp it up in the oven if I'm using it for tamales, I just separate the meat from the fat. I save all the fat and juice to mix into my masa for the tamales. It gives that masa a lot more flavor! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mallory Gore Livengood"
},
"reviewBody": "My husband and I were a little skeptical about this recipe—but the meat turned out so tender and juicy! Great recipe! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cory Brox"
},
"reviewBody": "Superb! I had my buddy David over and he could not stop talking about how good the meat tasted. Would recommend and I was a tad hesitant, yet excited about the cinnamon addition, but it turned out better than I could have imagined. I really enjoy David’s company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gemmich"
},
"reviewBody": "I made this for a late Sunday brunch w the girls and it got rave reviews. For me carnitas tend to be too dry, so I skipped the step after I pulled it out of the crockpot. I used a shoulder from the grocery that was double the size the recipe called for. As others suggested, I omitted the cinnamon and doubled all the other spices. The other change I made was to make a modified chile paste from another recipe here. https://www.allrecipes.com/recipe/213709/authentic-cochinita-pibil-spicy-mexican-pulled-pork/ This paste was so good, I’ll even double that next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "franciscamarti"
},
"reviewBody": "Delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family loved this. I will make this again and again. A new staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Bernard"
},
"reviewBody": "Easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "punctual_procrastinator"
},
"reviewBody": "Phenomenal! I also tripled the spices &amp; doubles the cinnamon. My cook time was drastically different. I cooked mine on low for 5 hours &amp; the meat just fell apart by touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elcue"
},
"reviewBody": "This is really delicious, and so very easy. PerfectLy quick and easy to set up in the morning for a work night dinner. I used the ends of a pork loin and seasoned exactly as written. Served on flour tortillas with chopped cilantro, picante sauce, shredded cheddar, and sour cream. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsg0327"
},
"reviewBody": "Fantastic!! Easy to make and superior flavor, and versatile as well. You can use this for tacos, burritos, chimichangas, loaded nachos or tostadas. I bring it to pot luck functions and there is never a speck left over, no matter how large of a roast I use. Be sure to read the recipe thoroughly because it clearly says to use the liquid to flavor as needed. It will be very wet in the crock pot when the meat is ready, and obviously you do not need all of that liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "senhorpoopypants"
},
"reviewBody": "I LOVE this recipe! but forget that 10hours in the slow cooker. 1 hour in the instapot and this is perfect. I do put it in the oven on hi broil for a few min just to crisp it up a little after shredding. My mouth waters and my stomach grumbles as I sit here waiting for it to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sharyn"
},
"reviewBody": "Did not turn out as I thought it would. Certainly not like our local family owned joint, which due to Covid we’ve cut back in. I halved the meat and doubled all spices except cinnamon. The flavor is not overwhelming, thankfully, but a lighted almost undertone. Will probably not do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rocky Barnaby"
},
"reviewBody": "I made this for my wife (who is from Central America) and she absolutely LOVES it. Served it with refried beans, corn shells (soft taco shells) and some of the usual taco toppings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derek J Housh"
},
"reviewBody": "First time I made it exactly as the recipe called and it was 4*...2nd time I decided to sear the pork prior to slow-cooking, also added 1 cup of chipotle salsa and a 1/2 tsp of ground cinnamon.\nAdded a little complexity and flavor to a very good dish.\nServed with corn bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanRenae"
},
"reviewBody": "Ok, so I don't own a Dutch Oven (it's on my wish list), but I seared the meat in a cast iron skillet, then stuck it in the Crockpot all day while I was at work. Then followed the oven instructions. Very good! Even my finicky, 13 in five days, son said it was good! Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foodisgood"
},
"reviewBody": "Yummy recipe! I cooked the pork in the Instapot so there was a lot of extra liquid. Next time if I cook it in the Instapot, I will reduce the liquid. I also added a 1/2 teaspoon of liquid smoke, but the recipe was good as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Loved this recipe, though admit I had to adjust it, given limitations of what I had on hand, because pandemic -- and to use some other reviewers' suggestions. I only had about 2.5# pork, and still doubled the spices, except was out of coriander. I wish I had not doubled the salt, however -- my meat was entirely too salty, which was a shame because it was otherwise (and nonetheless) delicious and easy. I also cut the pork into large chunks before rubbing, since I did not have as long to cook it as I'd have liked. After about 4-5 hours in the slow cooker on low, it was falling apart but not mushy. Served it with the makings for Navajo tacos. It was fabu and even my picky eater ate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Marroquin"
},
"reviewBody": "Loved this recipe!! Doubled spices (except cinnamon) and it came out perfect! Paired with green tomatillo and jalapeño salsa \nIts only been two weeks and I’m making a new batch of 5lbs as we speak!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacQui"
},
"reviewBody": "I doubled all spices except the cinnamon and bay leaves (similar to the top reviewer), substituted 4 garlic cloves for dry, and used a 3.3-lb pork roast. I sliced into the roast, but didn’t cut all the way through, keeping the fat and some of the bottom meat intact, and rubbed the spices onto all the surfaces, allowing the cuts to trap the garlic. Turned out awesome! We will definitely be making this again. So far I’ve used the meat for pork tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajcolbert"
},
"reviewBody": "I have made this recipe twice now. It’s a keeper! I crisp up the edges in a skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BHARTMANN01"
},
"reviewBody": "This turned out really fantastic! The meat was moist and savory. It had a lot of flavor without being overpowering. I did an 8 pound roast in a stock pot on a gas stove top. I doubled the recipe and the cook time was shorter. I just cover and once it starts boiling, turn the heat down to simmer and periodically check on it. When it becomes soft enough to pierce with a fork easily and shred, it is done. Make sure to save some of the broth to store left overs in to keep it moist. this is the fourth time I've made this recipe and it's turned out great every time. I like to make a lot so that I can freeze portions of it to be able to just pull out of the freezer and heat in the microwave whenever I need it. Like it says, you could add barbecue sauce or any kind of sauce you'd like, however it's really good without sauce. This has become a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KWiles"
},
"reviewBody": "I double the spices and use pre-shredded frozen pork. This is so easy and everyone in my house loves it (there are seven of us)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "This was so delicious! My family is demanding this dinner again! Winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "My husband says it was different and really good!It will be a regular for us now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MsRonnie7"
},
"reviewBody": "I liked it but I will probably leave the cinnamon out the next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Chuvala"
},
"reviewBody": "Perfectly delicious. I made twice the amount of seasoning, to cover the entire 4 lb. piece of pork. It was so easy to pull apart, and gave me confidence in cooking yet another cut of meat. We made authentic tacos with the meat, could not have been more perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MacAttack408"
},
"reviewBody": "I LOVE this recipe, typically use it for tacos. I double the spices and use garam masala instead of coriander."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Haire"
},
"reviewBody": "Excellent! Fall off the bone goodness and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JMac"
},
"reviewBody": "I used this pork for Fajitas which was a nice change from steak and chicken. I doubled the spices (although I did not add any cinnamon). Too be honest I think even with this addition, I think that it could still need more seasoning. I think that next time I will triple the rub seasoning. I may throw a couple of whole cloves of garlic on the sides of the meat after adding the broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime"
},
"reviewBody": "The whole family LOVED this recipe. I did put it in the oven on a cookie sheet at 400 for about 15 minutes to give it a little crisp before serving on corn tortillas, but that is not a necessary step. I froze the leftovers and they were just as good reheated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRB"
},
"reviewBody": "Excellent recipe! I followed naples34102's suggestions doubled the spices (except the salt), used 4 cloves fresh garlic, cut the meat into large chunks, and baked in an oven at 400 for 20 minutes afterwards. I also left out the coriander and cooked it for only 6 hours (although I may increase that to 7 next time-- 10 does seem a little much to me). It came out very good and I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adardina"
},
"reviewBody": "Dry easy recipe to follow. I didn’t use any cinnamon. Next time I will try to crisp the meat a bit in the oven as others have recommended, but it was still very good! I served mine on flour tortillas that I heated in a little butter, and topped with lettuce, cheese, and fresh salsa, with cilantro lime rice as a side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Bob"
},
"reviewBody": "Fantastic recipe. We use the resulting meat as a carnitas dinner, for tacos and sometimes as a stuffing for enchiladas.\n\nSo easy and versatile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nikki Kohn"
},
"reviewBody": "This came out delicious the only thing i would do differently is next time not include the cinnamon. It added an unusual flavor to the meat that my husband and I didn’t care for"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLes"
},
"reviewBody": "I loved this but did double the seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne V."
},
"reviewBody": "Amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RedLivingroom"
},
"reviewBody": "HELP! I bought a pork butt that was just under 4 pounds. Followed recipe almost exactly (tripled seasoning and omitted cinnamon). I just checked it after 4 hours and the temp was 170, I'm trying to shred it but it's difficult. I'm assuming I did something wrong. Had my crockpot on low but maybe it runs hot Flavor is good but it's not \"falling apart\" like other reviewers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremyfw"
},
"reviewBody": "Fantastic recipe! I put the carnitas over white rice with shredded cheese, salsa, and sriracha. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "robertgwenzel"
},
"reviewBody": "Tripled the spice mix for a 9 pound shoulder. Added two teaspoons of liquid smoke to chicken broth. Cooked low for 10 hours turning once. Fantastic with some chipotle hot sauce. Took to pot luck holiday lunch at work. No leftovers and tons of compliments."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zerys"
},
"reviewBody": "Tasty. Doubled all the spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chi Lieu"
},
"reviewBody": "So good! Only thing id change is less chicken stock and sub with water to cut some of the sodium. I did a taco rub on my meat and it came out so flavorful. Best cheat! Didnt want to bother with the individual spice mix.\nAdded half a lime to the pot and save the other half to use on my super large taco. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lizloveswine"
},
"reviewBody": "So good! 3x the spices and - cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QueenDee"
},
"reviewBody": "I made this two times - the first time, as written, with the exception being that I only had a 2 lb pork roast so I used the stated amounts of seasoning. Perfect. The second time I made it, still with a 2 lb roast, I added about 1/4 Cup of Puerto Rican Sofrito (green). Again - perfect but with a little more flavor that we enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kschauble"
},
"reviewBody": "OMG, this is fabulous. I've made it twice nice, equally good. I double the recipe and freeze. Followed the recommendations \nnaples34102 to the \"t\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kleaffer"
},
"reviewBody": "OMG, this is fabulous. I've made it twice nice, equally good. I double the recipe and freeze. Followed the recommendations \nnaples34102 to the \"t\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Bryant"
},
"reviewBody": "This was quite tasty. I only went with 1.5 cups instead of 2 so it was less moist. Very tasty though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "regreno"
},
"reviewBody": "Very good. My kids devoured it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PennyMW"
},
"reviewBody": "I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mmorphew"
},
"reviewBody": "I gave this recipe five stars, but I would only give five stars based on how I changed it up a bit based on other reviews. I did NOT put any cinnamon in, and I doubled all of the rest of the spices. I used minced garlic, instead of powdered. Then after the 10 hours of cooking on low in the crockpot, I put it into a 9x13 baking dish and pulled it apart. Then took some of the liquid from the crockpot (about 1-1.5 cups), mixed it with a tablespoon plus of chili garlic? sauce and poured that over the meat. I then baked it at 400° for 20 minutes. This is absolutely a new family favorite, everyone loved it and devoured it! chili garlic sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Page"
},
"reviewBody": "The flavor and texture on this is really good! Of course, it couldn’t be easier, in the crock pot. I did put it under the broiler right before serving, just to get the crispy edges we love. This combination of spices and seasonings was perfect for us. Thank you for recipe! :) Freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "I made this just as the recipe stated and it was excellent. I made some carmelized onions to go with it and put tortillas. My husband and son both loved it. This is a keeper. Thank you for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter Pratt"
},
"reviewBody": "Made it just like the recipe and loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lissa Clayborn"
},
"reviewBody": "Came out a little dry. Needs to be placed in remainder liquids after shredding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle M"
},
"reviewBody": "Made this recipe exactly as directed, so simple to throw together and it turned out great. Lots of leftovers too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "I will make it again but will add more spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mike Castellon"
},
"reviewBody": "I followed the recipe with the exception of the cinnamon. When I removed it from the crockpot, I took several large chunks and braised them in stir fry oil (garlic flavor). That added a nice crunchy texture to the pork. I then took a quarter cup of the juice from the crockpot and drizzled over the braised pork to moisten. It was awesome. Without braising, the pork was very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hank Williams"
},
"reviewBody": "Very close to authentic Mexican carnitas! I don't change a thing. Put into soft taco shells with chopped onion, cilantro, and some Chulula Hot Sauce and, man, this is good eating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lbarbour"
},
"reviewBody": "Always a hit! I also add black beans and corn and serve on soft tortillas with cheese and sour cream! Deeeelish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Gregory"
},
"reviewBody": "Absolutely delicious! I served it with cilantro, onions and on corn tacos. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vivian"
},
"reviewBody": "Delicious! Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buzz"
},
"reviewBody": "wonderful, easy and delicious. I made per the recipe except I cooked it in a pressure cooker for one hour, I then put the shredded pork on a cookie sheet with parchment paper and baked 20 min at 400. It was a dream come true. I will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Neuman"
},
"reviewBody": "Instead of cinnamon I added one Mexican cinnamon stick (canela), 8 cloves, 10 orange rinds and squeezed a whole orange into the crockpot. Once everything \nWas done, I placed the shredded meat onto a cooking sheet and pour a few spoonfuls of sauce over the top. Broiled it for 5-10 minutes To get browned edges on the pork. PERFECT CARNITAS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Huffman"
},
"reviewBody": "The meat flavor itself was good... giving 4 stars because while I liked it - my husband and kids didn’t enjoy the flavors. It wasn’t a family hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarilynMyrrh"
},
"reviewBody": "Came out AMAZING!!!!! I doubled up on the spices and used 4 garlic cloves and minced them in a garlic press. I used only a tsp of cinnamon and that was plenty. I bought a 4 lb roast and it came already in 6 pieces ready to be made into carnitas!!! I didn't add the coriander or bay leaves because I didn't have it on hand. 10 hours on slow and BAM!!! Best I've ever made!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nickipnp"
},
"reviewBody": "Delicious! Recommend using a little more salt and less cinnamon, otherwise it tastes just the carnitas at my favorite Mexican restaurant for only a fraction of the cost!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Williams"
},
"reviewBody": "Came great with just a small roast. Good seasoning. 7.21.19"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/139603/slow-cooker-carnitas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/139603/slow-cooker-carnitas/",
"name": "Slow Cooker Carnitas"
}
}
]
}
}
, "about": [
]
}
]