				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Cranberry Sauce"
,"datePublished": "2020-06-18T23:43:49.000-04:00"
,"dateModified": "2022-09-21T11:28:15.000-04:00"
,"author": [
{"@type": "Person"
,"name": "JazzyRSchrinas"
,"url": "https://www.allrecipes.com/cook/5208747"
}
]
,"description": "This easy slow cooker recipe for cranberry sauce tastes wonderful, and makes the house smell like the holidays."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zM9hwYaBL1asw6KF1ovJuGPdDo4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/741051-1f6769f472e943a0adcfe4e96d4d1212.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Cranberry Sauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "84"
}
,"cookTime": "PT225M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "85 kcal"
,"carbohydrateContent": "22 g"
,"fiberContent": "1 g"
,"proteinContent": "0 g"
,"sodiumContent": "4 mg"
,"sugarContent": "19 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"0.5 cup orange juice",
"0.5 cup water",
"0.5 cup brown sugar",
"0.5 cup white sugar",
"0.25 teaspoon ground cinnamon",
"1 (12 ounce) package fresh cranberries" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine orange juice, water, brown sugar, white sugar, and cinnamon in slow cooker; stir in cranberries. Cook on High for 3 hours, stirring once each hour."
} ,{
"@type": "HowToStep"
,"text": "Remove lid; stir well. Cook on High until sauce has thickened and most cranberries have popped, about 45 more minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT230M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Heil"
},
"reviewBody": "I have made this twice now. It is so easy and delicious! It is my go to recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoAnn"
},
"reviewBody": "This recipe is so fantastic, I now make it every Thanksgiving and Christmas for dinner and gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a bit of ginger and cardamon. So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flapkatt"
},
"reviewBody": "I confess I didn't have OJ, so I used a small serving bottle of apple juice without extra sugar. To the spices, I added honey, a little red wine, tossed in a small handful of cloves, some pumpkin pie spice mix, vanilla bean paste, nutmeg, and grated fresh orange peel in as well. Right OK, I think I actually made a different recipe, but I chose these as \"seasoning from the heart\". Almost everythih ng was \"eye-balled\" in-I only used the 6oz apple juice bottle and maybe a cup of water. Mostly guess work on my part. About an hour into cooking I tossed in a handful of raisins, they became very plump and soft, sweet without adding more sugar. NO white sugar, just brown sugar and honey was plenty. Finally just before it was done I grated fresh lemon peel into the mix, to brighten the flavors. I could eat this by itself. I've always made this on the stove top, but came here to find out if a slow cooker was better. I think it is! Lastly, I made extra because I wanted to see if it would freeze. It kept beautifully in the freezer, so I had fresh-cooked to enjoy all during the warm months when the berries aren't in season. It's almost Halloween, and the markets have the whole berries in stock. I buy a couple of bags every week, and keep them in the freezer as well. I can have the best of both worlds, for the season and after by doing it this way. I don't have a huge freezer, just a small unit, almost the size of an apartment or dorm room refrigerator. But the berries in bags stack nicely and are out of the way. I'm never changing how I make this, I just cannot ever go back to the canned garbage jelly. I love the fact I made this up as I went along, and I came up with something so easy and good. I'm a novice cook, and a boomer so I appreciate knowing how to make something so easy from scratch and saving $$ not buying the year round canned stuff. I think I have reinvented holiday tastes I actually can have year round. I'm cooking by a wing and a prayer these days! So far it works for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "So easy So much better than canned jelly. Loved this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "senecacindy"
},
"reviewBody": "Great and easy recipe. Made it for Thanksgiving and am making for Christmas. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rene"
},
"reviewBody": "I didn't have any orange juice so I used fresh Meyer Lemon juice.....as well as some golden raisins and pecans. I was amazed. The son who has always LOVED the jellied cranberry sauce, had 3 helpings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Very easy recipe and delicious. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Gregory"
},
"reviewBody": "2nd time making it. I doubled the batch and it turned out amazing. Much better than the canned cranberry sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GIWIZARD1"
},
"reviewBody": "Excellent taste and smell oh and also easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hettielti"
},
"reviewBody": "So yummy and I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shani Heiblim"
},
"reviewBody": "I love love this recipe! I doubled the recipe, cut the brown sugar in half and added the zest of one orange and didnt need the extra lid open hour and it was amazing! I can eat it by the spoonful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "John Burcl"
},
"reviewBody": "Horrible. I made a triple batch so I could can it for future use. Cooked 7 hours, never thickened. Had cranberry soup. Back to the stove for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Soto"
},
"reviewBody": "Was a hit and so easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eitalk58"
},
"reviewBody": "I made this today for Thanksgiving. It was easy and using the crockpot freed up my stove for other things .My guests enjoyed it. I found it to be a little too tart so when I make it next time I may up the sugar by 1/4 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James"
},
"reviewBody": "Nothing like out of the can and a little more sweeter than I expected. Very easy to make and I suggest a cup of OJ and no water. I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy M."
},
"reviewBody": "We make this exactly as listed. This cooks whiles the turkey is in the oven and tastes delicious. This is the kids contribution to dinner as it is easy for them to make. We usually double the batch and that feeds 14. The kids have also made anextra batch to give jars to their teachers at Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JR"
},
"reviewBody": "Nearly as easy as opening a can, and much tastier! Does well in refrigerator after the holiday, and tastes delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CatK"
},
"reviewBody": "I hand squeezed the orange juice and combined it with 1/4 cup pineapple juice and 1/4 water. I decided to cook this up in a pan to get it nice and hot and then added it to my slow cooker to insure it would be done at the same time as the turkey. Slow cooked it for 3 hours. It tasted SO GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "daphneryan"
},
"reviewBody": "great for making room on the stove on Thanksgiving. I swapped out the orange juice for more water for a low acid sauce, and ended up with a little extra liquid because I didn't cook it long enough, but I just scooped it out with a slotted spoon and it was fine, whole family enjoyed it, even the ones who refuse to eat the canned stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Mistretta-Birchfield"
},
"reviewBody": "I'll make this every year! So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkovacs26"
},
"reviewBody": "Came out better than I thought it would. Wow it was sooooo yummy and my house smelt wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Welch Hamnett Winchell"
},
"reviewBody": "I made this cranberry sauce last yr for the first time and it was so good.\nThis will be a regular side for my holiday meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Lite"
},
"reviewBody": "So good and really easy! Smelled delicious cooking in the crock pot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucylove"
},
"reviewBody": "After 40 years of stovetop cranberry sauce, we made this one this year. Best ever, and for the first time, there wasn't a drop left. We did have about a half bag of leftover berries from another dish that went into this one, without adjusting the other ingredients. I don't know how much difference it made, I just know it was the best ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Hughes"
},
"reviewBody": "Fabulous recipe. Very easy. Only left my recipe on high for 2 hours, 45 minutes. Then let the hot sauce cool in a Tupperware for 2 hours, which makes the sauce jell nicely. Easy and quick recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caryn"
},
"reviewBody": "I am NOT a fan of canned cranberry sauce, so whenI saw this recipe using fresh cranberries AND it as a crockpot re opening, I couldn't resist trying it. SO easy and SO good! It's been a staple a our Thanksgiving and Christmas feasts for three years running now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jker1972"
},
"reviewBody": "I have made this several times and it is delicious! I add a can of crushed pineapple as well as orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Teally"
},
"reviewBody": "Made this recipe this weekend for thanksgiving. I found the consistency of the cranberry sauce not to my liking. I think I will stick to making cranberry sauce over the stove."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "Loved, loved, loved it! I will always make this sauce in the slow cooker. You just put the ingredients in and you don't have to worry about it. And I'm all for less pots on the stove top! I didn't change a thing and the sauce came out perfect for our Thanksgiving meal. All our guests raved about it BUT you will have to double the recipe if you are serving more than 6 people. I don't think there is really enough for 12 servings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Abbey Wilking"
},
"reviewBody": "Had never even tried cranberry sauce before - probably because my family always served the canned kind. This was fabulous! Delicious on top of the turkey and would probably be excellent over pork as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "srollas"
},
"reviewBody": "I use this recipe every year. Simple and so good there really is no excuse for buying canned. And the house smells marvelous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Nothe"
},
"reviewBody": "I doubled the ingredients for 20 people. Perfect amount. I was out of orange juice so I used blueberry lemonade juice from simply orange and it gave it a sweet tart flavor. Everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Elaine Mical"
},
"reviewBody": "After cooking time was completed, the sauce was still watery even though I added cornstarch. The color was more like tawny port wine, and the sauce was a little bitter. Think I'll stick to cooking my sauce on the stove top according to the directions on the package."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iris Katz Flanagan"
},
"reviewBody": "I am making this for the first time but I need to double the recipe and so far it smells devine I cant wait until its done"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly"
},
"reviewBody": "Tried this for Christmas dinner and it was delicious. My new go to cranberry recipe! It got better as it cooled and set up! So easy too!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy Fick"
},
"reviewBody": "This was a life saver for me, as we were in the middle of a major kitchen remodel and I didn't have a cook top.\nIt was really easy and good. although next time I would omit the cinnamon (both my husband and I agreed on that). Thanks for the great and easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "I made the recipe just as written and it was fabulous. Reminded me of when my Grandmother cooked cranberry sauce. I will probably double the recipe next year as it didn't make enough for the big group I had. I was wondering if you could run it through a food processor for those people who don't like the lumpiness and like the \"jelly\" version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "geebz"
},
"reviewBody": "This was delicious and not too sweet! I like the orange juice (w/pulp)for the kick it adds to the sauce. We will be having this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bitzie"
},
"reviewBody": "I loved the idea of making cranberry sauce in the slow cooker. I altered it a bit because of what I had on hand. I used 3 small oranges peeled and cut up because I had no juice. I also added 3 pears that needed to be used, 1 apple (unpeeled), 1 (20 oz.) can crushed pineapple, 1/3 c. water, 1 1/3 c. white sugar, 1 bag (12 oz.) fresh cranberries. Cooked 3 hours on high w/ lid on then removed to thicken a bit. Everyone loved it:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen"
},
"reviewBody": "Delicious!!!!1 Followed recipe exactly. Next time I'll double or triple because it didn't make too much. Good warm or chilled. This would be great with Monte Cristo Sandwich. Thanks, great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YELDNIFJR"
},
"reviewBody": "I had never made cranberry sauce before, but wanted to try one, with the madness of getting Thanksgiving dinner done, I thought this sounded simple and easy. It was the bomb! Everyone loved it, even the family members who said they didn't like cranberry sauce. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trish Gillogly"
},
"reviewBody": "The thing is it only takes about 10 min. to cook a pot of cranberries....and then set it aside to cool. I just don't see this as very practical, as instead of a dirty crock pot to deal with, I just have one pan to wash and then pour the sauce into my serving dish, chill, and forget about it until serving time. sorry!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "This is a great easy recipe; I use it every Thanksgiving and christmas. I frequently double the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary-Carole"
},
"reviewBody": "It seems rediculous to spend so much time on this. All you have to do is dissolve the sugars in the liquid, bring it to a boil, toss the cranberries in, simmer them for another 10-15 minutes until most of them have popped, cool and refrigerate. I've never heard of anyone cooking cranberries for 3 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyRPB"
},
"reviewBody": "I've made this recipe for our last 2 Thanksgiving dinners. But both times I just cooked it on top of the stove, as I was more interested in trying the additional ingredients - instead of using just water and white sugar. I brought it all to a simmer and cooked until thickened. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy Sobus Long"
},
"reviewBody": "love this cranberry recipe. So easy, and you can avoid those canned cranberry things. Loved slow cooked cranberries!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mybabiesmother"
},
"reviewBody": "Well, family thought it was too sweet, but I absolutely loved it, which is weird because I'm the one that usually is sensitive to sweets. I think they were just used to their recipe which is, well, not as good as this in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leland Shaver"
},
"reviewBody": "I had my doubts when putting it all in the crockpot.Wasn't sure if it would work. It did and turned out beautiful. It was well received at the table"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kgoulden"
},
"reviewBody": "Wonderful! So easy to make. Everyone just loved it, honestly! You can use fresh or frozen cranberries. I have used both and both are tasty. I garnished mine with fresh orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plady411"
},
"reviewBody": "Delish and way easy! I used a bag of frozen cranberries, worked just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Featherston"
},
"reviewBody": "I never liked cranberry sauce, I think mostly because I hated the way it came out of the can. This recipe was a huge hit at Thanksgiving. I will never buy canned again! This tastes wonderful and smells delightful! This a a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "boorandy"
},
"reviewBody": "This was sour. The cranberries were really tart. I did not like it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tmce"
},
"reviewBody": "Silly. Much too mushy. No advantage over stove top sauce. Sorry I wasted all those cranberries and sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becky patterson"
},
"reviewBody": "Love this! Made it for Thanksgiving Dinner and it was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coracoracora"
},
"reviewBody": "It was perfect!\n\nThough I did not need to cook it any longer than the 3 hours covered. Once I took the lid off, to begin the 45 minutes without the lid, I realized it was already the consistency it needed to be.\n\nBut it was great! Didn't change a thing other than the cooking time. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SharonB"
},
"reviewBody": "I tripled the recipe and cooked it for about one hour longer than called for. Alot of the cranberries had not yet popped, even with the longer cooking time. I popped them with a wooden spoon, but the sauce did not jell, even after refrigerating it overnight. In order to serve it at the right consistency, I had to add gelatin to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Contented Home-maker"
},
"reviewBody": "This was really good! Made it for Thanksgiving this year. Was worried it wouldn't thicken up, but it worked great. Next time I think I will omit the cinnamon. You could really taste the orange juice. I will always use the crock pot for my cranberry sauce now. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney25"
},
"reviewBody": "This is a really good recipe! My 3 year old son is a picky eater and he loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana"
},
"reviewBody": "My husband and I loved this cranberry sauce. I made it for a dinner party we were having which included 6 people. This amount was just right for 6 people. Also had to add a bit more sugar. Will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmacshara"
},
"reviewBody": "This is great sauce and very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SKK"
},
"reviewBody": "This turned out tasty but it was definitely NOT as much as it advertised! I wanted 12 servings and the recipe servings was far too small. If you're making this for a group definitely triple the amount!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This recipe was so good we made it twice before Thanksgiving. In addition to the ingredients we included the zest one orange to the mix. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Seagraves Hurd"
},
"reviewBody": "This Recipe is great! I added a bit of oranje juice since I did not have enough zest and it is wonderful. Have made this a number of times,and it is rediculous to buy the canned stuff when this is so easy and much better tasting."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/216421/slow-cooker-cranberry-sauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
"name": "Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1260/side-dish/sauces-and-condiments/sauces/cranberry-sauce/",
"name": "Cranberry Sauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/216421/slow-cooker-cranberry-sauce/",
"name": "Slow Cooker Cranberry Sauce"
}
}
]
}
}
, "about": [
]
}
]