				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Borscht"
,"datePublished": "2020-03-05T00:00:18.000-05:00"
,"dateModified": "2020-03-05T00:00:18.000-05:00"
,"author": [
{"@type": "Person"
,"name": "DAVISAM1"
,"url": "https://www.allrecipes.com/cook/762398"
}
]
,"description": "A delicious and comforting beet and cabbage soup with chunks of beef simmers all day in your slow cooker."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gCcVE9PmSmY4rH2DJtE55CHtlBM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/449265-5e512470acca4f06964389b7f877c31b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Borscht"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "81"
}
,"cookTime": "PT540M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "345 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "51 mg"
,"fiberContent": "6 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "897 mg"
,"sugarContent": "15 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 pound beef stew meat, cut into 1/2 inch pieces",
"4 beets, peeled and chopped",
"1 (28 ounce) can diced tomatoes",
"2 potatoes, peeled and chopped",
"1 cup baby carrots, cut into 1/2 inch pieces",
"1 onion, chopped",
"3 cloves garlic, minced",
"2 cups beef broth, or more",
"1 (6 ounce) can tomato paste",
"6 tablespoons red wine vinegar",
"3 tablespoons brown sugar",
"1.5 teaspoons dried dill weed",
"1 tablespoon dried parsley",
"1 bay leaf",
"1 teaspoon salt",
"0.5 teaspoon ground black pepper",
"3 cups shredded green cabbage",
"1 cup sour cream, as garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place beef, beets, tomatoes, potatoes, carrots, onion, and garlic in a slow cooker. Whisk together the beef broth, tomato paste, vinegar, brown sugar, dill weed, parsley, bay leaf, salt, and pepper. Pour mixture over the beef and vegetables, adding more broth to cover as needed."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on Low for 8 1/2 hours, or High for 4 hours."
} ,{
"@type": "HowToStep"
,"text": "Set heat to High, then stir in the shredded cabbage. Cover and continue cooking until the cabbage tender, about 30 minutes. Remove bay leaf. Serve in a bowl with a dollop of sour cream."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT570M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nan Owen"
},
"reviewBody": "This is my go-to recipe for the best borscht that I have ever had! The only minor tweaks I make are extra beets (because I love them) &amp; reducing the vinegar to 4 tablespoons. Everyone I’ve shared this delicious soup with just couldn’t believe how fantastic it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love borscht in Ukraine. Had it homemade as well as in restaurants, cafeterias, etc many times over the years. I was planning on going back when Russia invaded, and so decided to make it myself. Truth is that this recipe isn't authentic to Ukraine, as in Ukraine the meat used primarily is salo, which you can only get from Russian sellers across the country. Luckily it's heavily preserved with salt, so if you feel like ordering it on the web, it should be good when it arrives. I've not done that yet. Also, you need to know if you've not had this before that the sour cream is what makes Borsht awesome. I use a \"healthy/large\" big spoonful. You should too. The first time I made this, I followed the instructions precisely. It was good, and reminded me of Ukraine. But as with anything, each person makes borsht a bit differently, so a recipe like this is a starting point to experiment and find your own version. A couple cooking tricks I use to speed this along: 1. Get the \"60 Second Salad Maker\" and use it as an efficient cutting tool for rapidly chopping and slicing everything up. 2. You can rapidly peel garlic by putting it in between two metal surfaces and shaking vigorously for about 20 seconds, pull all the newly loose stuff off, and repeating until you're down to a tiny number of pieces to peel and mince yourself. Also, a specific tip for this recipe: Don't bother with the part where you make some in a separate dish and then pour it on. I tried that and tried without it, and it makes no difference. My personal changes that seem to be working well: Red cabbage in heavy amounts (which is what I always saw in Ukraine). Or at least, that's what I remember. Either way it's healthier. Red onions instead of white onions, as they are healthier. Sausage instead of that shredded meat, to save money. Since sausage is far more common than shredded meat in my experience in Ukraine, it seemed far more authentic this way along with being cheaper. Latest batch has sweet potatoes instead of white potatoes. Haven't decided if it's better or worse yet, but it is healthier. I tried it with a bunch of peppers, and so far I've not been able to notice any impact, and I thought I put in a lot. I decided to not do it again, as it seemed a waste. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Smith"
},
"reviewBody": "A bit too overwhelming on the tomato. Will experiment to make a clearer more broth based soup. Otherwise I loved all the veggies in it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "I cut my vegetables chunky and made it like a stew, it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "THE BEST!!!! Family said it was the best meal they ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis the Menace"
},
"reviewBody": "Delicious. My taste buds found it a little sweet. So next time I would leave out the sugar. Compensated by adding 3 additional tbsp red wine vinegar and it was excellent ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay Barton"
},
"reviewBody": "This was all I hoped it would be. I used fairly large beets and a little less tom paste (we use grams - so the closest tin is smaller). I think this is better than the top of stove version I used to make. \nIt's nice and easy to make - I cooked it about 4.5 hours on high. I'll be making this a lot this autumn and winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLG"
},
"reviewBody": "Fantastic! Beefy, beety, sweet, sour, everything I remember. No changes to the recipe, followed it exactly. This is now a family favorite. Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina-marie Williams"
},
"reviewBody": "Chopped large carrots instead of baby ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Los Bombero"
},
"reviewBody": "First borscht attempt. Followed directions, used Insta Pot on high 4hrs. Instead of tomatoes used Rotel which gave this a real kick. I'm enjoying this as I type, and will make again and adjust to my own needs. I recommend making/trying this as written at least once."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Madsen"
},
"reviewBody": "Wonderful! I did this almost as the recipe said but only put 4 tablespoons of vinegar people who made it said 6was too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Svetlana Tcvetkova"
},
"reviewBody": "I would add a little bit less vinegar into the soup. Otherwise, it's really delicious and very easy to cook. Thank you for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "It was good, but not purple. Maybe my beets were small? Maybe there could have been a cup amount given like the carrots. But very good flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lou"
},
"reviewBody": "I made this recipe but changed every single last ingredient. Now I don’t like it! Boo!\nSeriously, it gets annoying that no one actually makes the recipe as written. It’s also very confusing.\nI’m almost done making it, as written, and it’s delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jonathon Roy"
},
"reviewBody": "Went about 6 and a half hours. Beets are still a tad crunchy. Added a little more salt, pepper, and used garlic powder instead of cloves, so used a little more also. Great flavor and for someone who really doesn't like beets, I would absolutely do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "triceratops15"
},
"reviewBody": "Super quick (prep-wise) and easy. I've made this with both the high- and low-heat instructions. \n\nA few notes:\n- If you can't get fresh beets (or don't want your kitchen to look like a murder scene), 2 cans of shoestring beets with juices is a great sub. \n\n- I use chicken broth and have no complaints. \n\n- I often skip the beef and instead stir in a can of drained and rinsed white beans along with the cabbage. I like butter beans, but great northern beans or small white beans (habichuelas from Goya, not sure what the proper English name is) would be great, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sourpuss"
},
"reviewBody": "Overall I liked this, but I would make some changes next time: more beets, less of all the other vegetables, more broth, less vinegar. I really want the beets to be front and center, and in this recipe as written, it's more balanced between the flavors. That's not a bad thing, it's just not what I want from borscht."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Patton Potter"
},
"reviewBody": "We loved this borscht! It tasted even better the second day. I did not have stew meat, so made it without. We are on a low salt diet, so substituted 4 fresh tomatoes from the garden for the canned tomatoes (blanched, peeled and chopped). I used lower sodium beef broth. 2 cups to begin with, then added the rest of the 32 oz. box of broth at the end with the cabbage. I used red wine--3 tbsp. and apple cider vinegar 2 tbsp. in place of the red wine vinegar. Fresh Italian parsley instead of dried. I eliminated salt, but you could also use a salt substitute for the salt. Served it with a green salad with lots of fresh vegetables and chicken. Great light, healthy supper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven Traigle"
},
"reviewBody": "The best!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Something"
},
"reviewBody": "i've been craving borscht and this one hit the spot! i blended it for my son because he doesn't like chunky soups, but i forgot to take out the bay leaf first lol. So delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "McJanine"
},
"reviewBody": "This was really good. One star removed because the \"4\" beets is not helpful. Beets come in all sizes. I wound up using about 12 small ones, which guaranteed a nice red beet colour. Note to self to cut carrots thinner, they were a little el dente. And like another reviewer, I cheated and added some bagged coleslaw as the cabbage. All's well that ends well. It's friendable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gingerbreadgirlz"
},
"reviewBody": "It was yummy. I used ham instead. I also used chicken stock because that was all I had, I added a can of green beans. Easy recipe, I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "edlma"
},
"reviewBody": "This is a great base recipe for someone who knows what they like in a borscht; we made changes based on what we knew we liked. (I gave it four stars just because I made so many changes; it's not really recognizable anymore). \n\nWe left out the beef, because we find that overpowers the flavour of the rest of the soup. We used chicken broth instead of beef broth, again, because the flavours are a little more complimentary. \nI used about 12 beets (each smaller then my fist; the smallest three were half again bigger than my thumb, but the same size, for reference). If I only had a few beets on hand, I would have left out the tomato paste completely, because I agree with other reviewers who have used paste and found it overpowering. Luckily I had a bag of fresh beets from the farmer's market.\nI used 1 cup and a half of frozen fresh dill (it chops up very fine when frozen, and we love dill). \nI doubled the garlic. \nI used diced tomatoes that were flavoured with spicy peppers, which gave this borscht a delicious spice profile. \nI omitted the cabbage completely. \nNear the end of the cooking stage, I added some corn starch (1 tbsp prepared in 1/4 cup cold water), because I like when the broth is a bit velvety. And even then, I could have added more corn starch and a few more potatoes and it would have become even smoother."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Courtney Hamilton Flores"
},
"reviewBody": "Fantastic. I think my beets were huge, because i have a big crockpot and this was so full! It turned out delicious, and I didnt change the recipe too much. I just omitted the sugar (beets are naturally sweet) and used fresh herbs. It was so good I licked the bowl! It made a generous 14 cups so I'll have leftovers for company. It reminded me of my Georgian friend's mom's borscht... this is a keeper, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawn Viklund"
},
"reviewBody": "Definitely a keeper! I substituted a can of pork and beans for the tomato paste. If I do the same next time, I would omit the sugar. I also substituted the beef for pork. The meat was very tender and all veggies were cooked to perfection. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "First time for borscht we are not sure about it. Nothing to do with the recipe just our taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deedoggy"
},
"reviewBody": "Had to make 1/2 as this is a large recipe and was too much for my slow cooker. Have had rave reviews from all who tasted it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David K Boyd"
},
"reviewBody": "This was a tasty recipe, I made it for root-vegetable themed competition at an Airstream club campout. It should perhaps be noted that this recipe is scaled to a large slow cooker, it more than filled my medium cooker and I had to pour some of it off to add in the cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey"
},
"reviewBody": "This was great. Only thing was I never had beef at home so ended up using chopped up farmers sausage which was good too. But next time I want to try it with the beef. So nice to just toss everything in the slow cooker and come home and just add the cabbage and wa la your meal was ready."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bones"
},
"reviewBody": "This borshch was so tasty! I increased the recipe by 1/2 except for the carrots, potatoes, onion and tomato paste, I used fresh dill and parsley, and I substituted a tablespoon of molasses for the brown sugar. I cooked it on low for 8 hours and added the cabbage for the last hour and I feel it turned out perfect! Served it with some nice pumpernickel bread lightly toasted and buttered. I cooked and served the beet greens separate, but next time I may try another reviewer's suggestion and add it in with the cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teaspoon"
},
"reviewBody": "Being from Ukraine, I've had my share of borscht variations. This is a hearty, perfect for fall recipe. I used only one potato and still had so much and my slow cooker was full. I went lighter in vinegar, but I would stick to recipe. I think it adds to sodium taste, and it works for me since I don't add salt. I used fresh dill. Served it with fresh dill, and Mexican cream. It was effortless and delicious. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooks4forty"
},
"reviewBody": "Although I didn't use a slow cooker, I used all of the ingredients and amounts (a little more broth though). This was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick Price"
},
"reviewBody": "Amazing! Add in canned Diced Tomatoes with Chilies for a spicy kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristy"
},
"reviewBody": "Wonderful recipe, I love using my slow cooker when I get the chance :) What I wish I would've done: added all the veggies at the beginning! Even the \"high\" temp isn't really hot enough to disintegrate anything like I though it would. I sear my beef (after tossing in seasoned flour) before starting :S Include the beet greens for sure, half the vinegar, skip the tomato paste, and I blended 1/3 of the soup at the end in the blender until super smooth (after picking out the beef cubes) and re-added to the soup to make a really nice consistency. I found it quite soupy without doing that. Incredible flavour, minimal effort. I will make this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bridget Ivory"
},
"reviewBody": "This recipe is delicious! Great flavor and easy to make. I was in a hurry and I didn't chop the beets, carrots, and potatoes as finely as I should of. I cooked on high for 41/2 hours and the veggies weren't cooked through. Needed extra time. I would recommend chopping into smaller pieces. I also want to try this recipe again with polish sausage instead of beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria L. Rosa"
},
"reviewBody": "A simple, Great recipe and pretty darn close to the way my Ukrainian Grandmother made hers. I hate to say I may have enjoyed this more (she never used meat in hers, that definitely made it more flavorful). I didn't have stew meat so I used country style pork ribs, very tender and a yummy addition! I did add more seasoning and more beef broth towards the end of cooking as I didn't really measure the cabbage, I cheated and used a few heaping handfuls of the pre-shredded slaw mix instead of cutting up my own and I added a few more potatoes than suggested. I felt I needed a bit more salt &amp; garlic after adding the cabbage. But flavor just boils down to preference, some prefer this dish a bit more bland, I don't. I'm also not a measurer when I cook, I'm a taster and add as I go, some of you may need to do the same. All in all even with my small changes, this recipe is awesome on it's own, definitely worth a try. BTW, I let this cook for 10 hours, added the cabbage and let it cook for 2 more hours. Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lvobrien"
},
"reviewBody": "Made this tonight with some modifications that worked out well. We had a huge container of leftover homemade (heavily spiced) tomato sauce, which I substituted instead of the canned tomatoes and paste. Because the sauce was so thick, I used a full 28 oz container of beef broth instead of the 2 cups. AND, I only used 3 beets as that's how many came in a bunch. It turned out amazing with plenty leftover for lunches and another dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melisski"
},
"reviewBody": "Really good. The beef came out a bit dry, but I think that's BC it was too lean. Will try with diff cut next time. Like the vinegar and sweetness of this dish. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JeniOM"
},
"reviewBody": "I made this exactly as the recipe states and am giving it three stars because it IS flavorful. The problem for me is that it's TOO flavorful! It was so tangy that both my husband and I could only handle eating one serving each. Although I generally love vinegary/tangy dishes, this one was over the top even for me. Possibly would have been better with half the amount of vinegar called for. Probably won't make this again as it also left a very pungent scent throughout the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grannygamer"
},
"reviewBody": "Loved this borscht, simmered on stove top for 3 hours, rather than crock pot, left out the meat and added cup of curly kale. Froze the leftovers and it was better the second time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeffrey"
},
"reviewBody": "It was delicious , I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LisaT"
},
"reviewBody": "I made this for dinner and it was great. The only change I made was instead of beef stew meat I added smoked beef brisket. Great recipe, will make it again. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marguar"
},
"reviewBody": "This is cooking as we speak...smells pretty good, but I used cider vinegar instead of red wine...now I'm thinking that might have been a bad idea.. I wasn't sure how big your beets were or how big your potatoes were, but I had two giant (size of tennis balls) and 3 small (size of golf balls). I used purple potatoes and will use red cabbage so this should be REALLY red. I think I'll puree some just to thicken the soup. I otherwise haven't changed a thing.\nP.S. I didn't puree and glad I didn't this was wonderful as is, thought the beets lost their color in the broth. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha7"
},
"reviewBody": "Just tried this recipe last night and it turned out fantastic! I only made a few minor modifications - I used half the dill because I'm not a big fan and I did not add cabbage at the end due to lack of time (I also cooked on low for 12 hours overnight). I took some with me to work today, brought some for a coworker and sent the hubby with some and all of us thought it was great. The consistency was perfect, just inbetween soup &amp; stew thickness and the flavour was delicious. I will defintely be using this as my new borscht recipe from now on, think I'll even make some more tomorrow to freeze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jocelyn"
},
"reviewBody": "Married into a Ukrainian family- this is going to be my go to recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bevvy"
},
"reviewBody": "This is the best Borscht I have ever made. I have tried several different recipes and this is the best yet. I used 2 large beef steak garden tomatoes instead of canned - cooked on high for 3 3/4 hrs, added the cabbage and cooked on high another 45 minutes. fabulous!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Seslie11"
},
"reviewBody": "Made this vegan style without the stew meat, and minus the potatoes for a very fat free, low cal soup!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Warner"
},
"reviewBody": "This turned out great! Although my daughter doesn't like the cabbage (she prefers a simpler borscht with less ingredients)... so I'll omit that next time, because it doesn't need it (I tasted it before adding cabbage and it was delicious!). I also did NOT put in the carrots.. for no particular reason. But, it doesn't need carrots either. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kym Cox Surridge"
},
"reviewBody": "This was good, but the slow cooker cooked all the beautiful color out of the beets, so it looks like ham soup. I made it without the beef or tomato paste, subbed veg broth, and subbed cider vinegar (according to another recipe I've used). Good flavor, but I'll probably stick with my other, non-slow-cooker recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jennabeanski"
},
"reviewBody": "This soup turned out well. Kind of a sweet and sour taste that was unique, and not bad. Made for some great leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "happygirl"
},
"reviewBody": "We had never had this before and were a little leary, but it was great. I made it exactly as the recipe asked and it turned out awesome. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roman Korol"
},
"reviewBody": "This borshch recipe is a real keeper; one of the best I've ever tasted and easy to make. (No, \"borshch\" is not a typo: that's how the folks who invented the dish - Ukrainians, Russians, and other Slavs - call it). The beet tops are edible. They can be chopped and added to the borshch at the same time as the cabbage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tina Mikus"
},
"reviewBody": "I omitted the beef stew, added vegatable stock and put all in my Vitamix for a yummy, creamy soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KimJas"
},
"reviewBody": "I love Borscht and we loved this recipe! I hope those that like Borscht don't overlook this recipe. The only thing I changed was leaving out the stew meat. And only because we find it a little too heavy with meat. Other than that I didn't change a thing! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Traci Waddell Voss"
},
"reviewBody": "I love beets and was looking forward to this stew. It looks pretty, I guess there is a disconnect between the look and the taste. I kept wanting to taste the beets and all I tasted was the tomato paste. Next time, I will leave out the tomato paste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "beaker32"
},
"reviewBody": "I guess my husband &amp; I are not fans of borscht. We struggled to eat this as not to throw it away. So glad it's gone. I like beets, but it just made ALL the ingredients the same color and made it unappealing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shans"
},
"reviewBody": "Yum!! Sorry, I didn't do everything in the recipe, here's what I did: 5 beets, first blanched to get the peel off more easily, then shredded No carrots, cause I didn't have any 5 cloves of garlic, cause I like it! 6 Tablespoons white vinegar, cause I didn't have any red wine A bunch of fresh dill, cause that's what was on hand! No parsley No cabbage I have yet to have a whole bowl but the bits that I've sampled have been amazing!! The consistency with this amount of broth comes out more like stew and I think when I do enjoy a bowl it will include milk or more runny yoghurt instead of the traditional sour cream to get a more soup like consistency. Thanks for sharing!! I love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "backtoglass"
},
"reviewBody": "This recipe was okay. Maybe it was because we thought it was on the sweet side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "WNC Mom"
},
"reviewBody": "This bothered our tummies. I used the amount of vinegar called for, and I think that combined with the beets and cabbage was a bit much. We won't make it again, not that it was awful or anything, just not our style."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karin"
},
"reviewBody": "I had this sitting in the slowcooker all day long, and I think the worst thing to add was the cabbage. We ended up not eating it. I am sorry, maybe it was my fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snodinn"
},
"reviewBody": "Excellent! LOL I don't like the smell of it cooking, but the taste is out of this world. Since I am alone I have a small slow cooker, and so cut the recipe in half. I like this so much that I am cooking it again tomorrow! Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DSAJADEA"
},
"reviewBody": "This just wasn't something anyone in our family enjoyed, even though we love beets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "barrie"
},
"reviewBody": "This is a great recipe and I made just a few changes to accomodate my family's tastes: I added about 1/2 lb. more beef, omitted the potatoes and carrots--they don't freeze well and I made enough to freeze some--used canned julienned beets (30 oz including liquid), added three tablespoons worcestershire, two tablespoons hot sauce and 12 oz tomato juice instead of tomato paste. I also used a whole large caggage, shredded, and added it at the very beginning. Finally, I added 1/2 C golden raisins. This is the perfect one pot meal for a cold winter day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa MWH"
},
"reviewBody": "I liked this recipe, but will make a few changes the next time I cook it. I will add less vinegar - I personally found the flavor a bit overpowering. I found I needed almost 5 cups of broth to cover all the ingredients (once I had added the cabbage) and that the 30 minutes of cooking time on HI at the end wasn't nearly enough to cook the cabbage to the consistency that I prefer. In the future, I will add the cabbage quite a bit earlier. Otherwise I think this is a wonderful, savory borscht."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "irisheyes_14"
},
"reviewBody": "I thought this was good, but it was mainly beef stew with beets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassandra Reed"
},
"reviewBody": "I never had Borscht before making this recipe, so there is nothing for me to compare this to but my own taste buds and it was GREAT even tho I forgot the cabbage! Perfect in the slow cooker. I prepared all the ingredients on Sunday and put it in the slow cooker Monday morning for a easy, comforting dinner ready when I got home. My boyfriend and his son both really liked it too. I will be making this again soon and remembering the cabbage next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shantal"
},
"reviewBody": "This is a very good borscht, my ukrainian grandmother used to make hers with beef, this one is very similar. The only change I made was using fresh dill instead of dried, and adding chopped flat leaf parsley just before serving."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/109254/slow-cooker-borscht/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14768/soups-stews-and-chili/soup/vegetable-soup/borscht/",
"name": "Borscht"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/109254/slow-cooker-borscht/",
"name": "Slow Cooker Borscht"
}
}
]
}
}
, "about": [
]
}
]