				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Chicken Marsala"
,"datePublished": "2019-04-03T23:55:47.000-04:00"
,"dateModified": "2023-03-23T13:51:48.399-04:00"
,"author": [
{"@type": "Person"
,"name": "mstina330"
,"url": "https://www.allrecipes.com/cook/4613408"
}
]
,"description": "This crockpot chicken Marsala recipe is easy to make in your slow cooker. Lightly seasoned chicken is simmered for hours in a Marsala wine sauce."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/18kXtV3-WiE49XLxjPs59db-TNw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4423579-212ee3996a5e443ba0e33847b63bea54.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Chicken Marsala"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "44"
}
,"cookTime": "PT245M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "225 kcal"
,"carbohydrateContent": "5 g"
,"cholesterolContent": "96 mg"
,"fiberContent": "1 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "230 mg"
,"sugarContent": "1 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
, "recipeCategory": ["Entree"]
,"recipeCuisine": ["Italian"]
,"recipeIngredient": [
"1 tablespoon olive oil",
"2 cloves garlic cloves, minced",
"0.25 cup all-purpose flour",
"salt and ground black pepper to taste",
"3 pounds skinless, boneless chicken breast, cut into 2-inch cubes",
"12 ounces sliced white mushrooms",
"1 cup Marsala wine",
"2 tablespoons water",
"1 tablespoon cornstarch",
"1 tablespoon chopped fresh parsley for garnish" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir oil and garlic together in the bowl of a slow cooker."
} ,{
"@type": "HowToStep"
,"text": "Mix flour, salt, and pepper together in a large resealable plastic bag. Add chicken to the bag, seal, and shake to coat chicken with flour mixture. Pour coated chicken into the slow cooker, then add mushrooms."
} ,{
"@type": "HowToStep"
,"text": "Heat Marsala wine in a small frying pan over medium-high heat until reduced, 2 to 3 minutes; pour into the slow cooker over chicken and mushrooms."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on Low until sauce thickens and chicken is no longer pink in the center and the juices run clear, 4 to 5 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "If the sauce is too thin, mix water and cornstarch together in a small bowl and pour slowly into the slow cooker. Cover and cook on High until thickened, about 15 minutes. Adjust seasonings to taste, garnish with parsley, and serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT255M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leomari Perez"
},
"reviewBody": "It was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DoctorV"
},
"reviewBody": "This was pretty good. I doubled the mushrooms, added more marsala, and didn't reduce the wine first. I also used cassava flour to make it gluten free. Makes a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lori Ljmeske27"
},
"reviewBody": "super good starting point! It needed salt like it was going out of style. I would add parmesan cheese (at least 2 cups) the next time I make it. Truth be told I'm from Wisconsin and love cheese. That being said it needs some kind of salt or seasoning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie Osika"
},
"reviewBody": "Will definitely make again, was excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Charvela"
},
"reviewBody": "Add the cornstarch and extra seasons"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Beckner"
},
"reviewBody": "My company loved it. I used the brandy and white wine, and a cup of chicken broth, and baked it in the oven, because I didn’t have time to cook it in the crockpot. I also used much more garlic, and sautéed onions. It was quite good. Thanks for the tips to make it great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kathyabc"
},
"reviewBody": "Disappointed with this recipe. Used porcini mushrooms &amp; added additional spices to the flour mixture as some suggested. It was still pretty blah. After thinking about all the things I could do to make this better, decided to just not use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janice Nagle"
},
"reviewBody": "We liked this very much. This is an easy dish to make. I followed the recipe exactly. The leftovers are just as good! We rated this a 4 because my family likes restaurant chicken better! Instead of being discouraged, this tells me this recipe is pretty darn good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KHGRflier"
},
"reviewBody": "VERY disappointed in this recipe, as I was looking forward to making it for some time. If I could give less than one star I would. I read ALL the reviews and thank goodness I did, otherwise this dish would have been relegated to the trash. I followed the recommendations to add ALOT more seasoning, but nothing could overcome the complaints that others echoed about the chicken breast being extremely dry. Maybe this might be better if thighs were used, but I won’t be wasting time trying any time soon. As far as I am concerned this dish was a waste of four beautiful boneless skinless chicken breasts that could have been grilled or broiled.... and succulent. If I was served this dish in a restaurant I would have sent it back, and requested something else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "This recipe lacks flavor. It is bland. I love the idea of making an easy Marsala in a crock pot but the results were disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ellen Firsching"
},
"reviewBody": "Followed a lot of the suggestions but the one thing I dreaded happened. The white breast meat was too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swatts"
},
"reviewBody": "I love chicken marsala and I love to cook in a slow cooker,so it was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Buck"
},
"reviewBody": "This turned out very well and my husband and kids loved it! I chopped and sautéed 6 shallots in butter and browned the chicken before putting it in the crock pot. I boiled the Marsala in the pan with the dripping and served this over mashed potatoes. I will be making this again for sure. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brooke B"
},
"reviewBody": "This was a hit with my family and I will definitely be making it again. I changed a couple of things. I put the oil, garlic, and mushrooms into the bottom of the crock pot and mixed it around. I took a 3 lb package of chicken breast and sliced them into strips. I put the chicken strips into a freezer bag with 3 packets of McCormick Chicken Marsala seasoning mix and mixed it well, coating all the chicken. I laid the chicken strips on top of the mushrooms in the crock pot. Then I added the wine (which I boiled for 2 minutes prior) and 2 cans of beef broth. I cooked all of this on low for about 5 hours. I added the cornstarch and water at the end which made a wonderful gravy. I served this with mashed potatoes and sweet peas. Everyone went back for seconds, including my kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jkorm"
},
"reviewBody": "I usually read the great suggestions from others before deciding to make a recipe. Had I done so, I would added ingredients to enhance this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "me!!"
},
"reviewBody": "Really good with the gravy made it wonderful with biscuits I was surprised"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Danae"
},
"reviewBody": "Very good flavor. The only thing was that the chicken was a little dry. Not sure if it's a fault of the recipe or perhaps my slow cooker. But, I really liked the recipe and it was easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan Shafer Boyer"
},
"reviewBody": "The only reason I gave it 2 stars is for convince. I made this recipe without any adjustments and was very disappointed in it. This is a very tasteless and bland recipe. You really need to kick it up in the spice department. I won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "So delicious and easy! I added cauliflower with the chicken and slow cooked for 6 hours then added chickpeas in the last 30 minutes with the heavy cream . I served it over jasmine rice and Naan bread. This made it even more filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane Litwiller"
},
"reviewBody": "I loved it! There's just 2 of us, but the leftovers are handy. I did use some suggestions by other reviewers, and I added garlic and basil. I believe next time I'd skip coating the chicken and just brown lightly as is, then add a little flour to the sauce at the end. I love white meat but my husband, not so much. He enjoyed this, but not like me! I will use it for company though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dee"
},
"reviewBody": "Using the flour before hand, I believe, made for a weird looking sauce.... the flavor was good, but too powerful. Should blend marsala wine and a broth.\nI may make it again, without using the flour as I found in another recipe from another site.\nAlso, my crockpot may have been too big for this small recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "Easy to make, pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen"
},
"reviewBody": "I made this recipe gluten free with a couple of changes and it came out outstanding! I changed wheat flour for half millet flour and half tapioca flour. Then at the end of the cooking time I added tapioca starch to thicken the sauce a bit. I also changed Marsala for 1/3 of brandy and 2/3 white wine. This is a keeper . Everyone liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "I was told this was one of my best dinners! I did make some adjustments. I used more flour to thicken the sauce and added thyme and garlic powder. I browned the chicken in a frying pan with olive oil after shaking it in the flour bag. I added thinly sliced onions to the slow cooker. I also added the mushrooms the last 20 minutes because someone in the house can pick them out (does not like mushrooms). This kept the mushrooms more firm. Also, I used 1 cup of Marsala &amp; 1 cup of chicken broth. I served the dish with rice, fresh green beans with almonds, and hard round French rolls. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tacdaddy"
},
"reviewBody": "Followed the recipe except I put in a box of uncle bens long grain rice with seasoning for the last 30 minutes. I would include this in my go to recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Buck Brown"
},
"reviewBody": "We eat chicken almost every supper. I cut the chicken into smaller pieces, dredged it in flour flavored with garlic powder, rosemary, thyme, salt and fresh ground paper. I added a kick to it by putting a very small amount of cayenne pepper. I cooked an onion in the same pan and I deglazed the pan with the marsala and a tablespoon of lemon juice. I then transferred it to slow cooker and cooked it for four hours. Served it with rice. There were plenty of leftovers. My husband wants me to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Smith"
},
"reviewBody": "Followed the recipe except I added extra pepper and italian seasoning to the flour, came out a little bland. Chicken was tender but did need to add corn starch to the sauce to thicken it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janellebocchi"
},
"reviewBody": "Followed directions and turned out great. I have made this twice now and my family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TinaH"
},
"reviewBody": "Not sure what happened but the sauce was bitter. Had to put it in a skillet and doctor it up to serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kennyswife"
},
"reviewBody": "Whole family loved it! I think this recipie deserved 5 stars. I served it over Parmesan mashed potatoes and asparagus. YUMMMMMMMYY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lvmederos"
},
"reviewBody": "Yes it was delicious! I didn't have the time to slow cook this recipe so I changed things up a little. I used thin boneless chicken breast. 1 pkg fresh mushrooms sauteed in 2tbls butter 3-5 min till tender. I added 1tsp onion powder 1tsp garlic powder 1/2 tsp salt 1/4 tsp pepper to flour. I used 1 cup ck broth 1 cup true blue marsala wine in pan drippings to create sauce to pour on top of ck. I cooked ck 3 min per side then put in casserole dish pour sauce on top of ck and shrooms then add 1/2 cup mozzarella cheese 1/2 cup parmesan and bake in oven on 425 degrees for 25 min. All done. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peg"
},
"reviewBody": "My husband loved this! Followed directions exactly except last 5 min added bag of baby spinach. Served with mashed potatoes . Definitely will make this agin! So easy ! Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "renee577"
},
"reviewBody": "Almost flavorless with just a hint of the marsala."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "AnnieGirl822"
},
"reviewBody": "OK...so I followed the other commenters feedback and dredged the chicken in eggs and a spicier flour mix. I also sautéed the garlic and onions and then deglazed with the marsala. It felt like I could have just cooked without the slow cooker. It tasted reasonable but not one I would be rushing to do again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StickySue"
},
"reviewBody": "I thought that the Chicken Marsala might come out to sticky, I seasoned the flour with onion, garlic powder 1/2 teaspoon of each. and a pinch of pepper, Flour and browned chicken. then followed the rest of recipe. Need cornstarch and water. I'm serving this with Onion Rice and Candied Carrots. Yummy! Thanks, Happy Cooking!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mommabee"
},
"reviewBody": "Next time I will do the following: \nAdd a lot more salt and pepper to the flour mixture. Also add some italian seasoning and garlic powder to the mixture.\n Dip chicken in egg before coating, brown chicken before placing in crock pot. Saute onion along with garlic before adding to crock pot, then use marsala to deglaze the pan.\n Those steps will increase prep time, but hopefully it'll positivelly affect the outcome."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/233906/slow-cooker-chicken-marsala/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17139/main-dish/chicken/chicken-marsala/",
"name": "Chicken Marsala Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/233906/slow-cooker-chicken-marsala/",
"name": "Slow Cooker Chicken Marsala"
}
}
]
}
}
, "about": [
]
}
]