				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Slow Cooker Risotto"
,"datePublished": "2019-04-02T02:58:09.000-04:00"
,"dateModified": "2023-02-08T11:43:08.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Lady7Fire"
,"url": "https://www.allrecipes.com/cook/4680908"
}
]
,"description": "This crockpot risotto is made with Arborio rice, chicken broth, olive oil, garlic, and wine in a slow cooker for a no-fuss, Italian-inspired dinner."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_tx5W8glMQZ-qJRN_-W_bx-wGVw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2562760-66bcee81a8e64418b1198844e6a80a16.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Slow Cooker Risotto"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "90"
}
,"cookTime": "PT135M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "316 kcal"
,"carbohydrateContent": "42 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "525 mg"
,"sugarContent": "1 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"3.75 cups chicken broth",
"1.25 cups Arborio rice",
"0.25 cup olive oil",
"0.25 cup white wine",
"4 cloves garlic, minced",
"1 teaspoon dried onion flakes",
"1 teaspoon salt",
"0.25 teaspoon ground black pepper",
"0.66666668653488 cup shredded Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Stir together broth, rice, olive oil, wine, garlic, onion flakes, salt, and black pepper in a slow cooker until well combined."
} ,{
"@type": "HowToStep"
,"text": "Cover and cook on High until rice is tender and creamy, 2 to 2 1/2 hours."
} ,{
"@type": "HowToStep"
,"text": "Stir in Parmesan cheese. Cook, uncovered, until cheese is melted, about 15 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT145M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynn E"
},
"reviewBody": "This recipe (as written) is okay. I am used to making risotto on the stovetop stirring the entire time, so this did influence my opinion of the final product of this recipe. Short version: I ended up with some crunchy pieces and some overdone pieces when the recipe was completed due to not stirring as it cooked. I did use arborio rice, I did watch the time and start assessing done-ness after about 1.5 hours of cooking, I did use the amount of liquid recommended and the spices listed here with only the exception of not adding onion flakes (I'm allergic so can't use them) and adding dried thyme and rosemary to personal taste (I checked my liquids for balance before starting). My one complaint (and thus loss of a star) is due to the mode of cooking used: The rice was cooked unevenly when I determined that the risotto was basically \"done\". If I had continued cooking at that point, I would have ended up with the \"library paste\" another comment mentioned, but when I stopped there were still quite a number of crunchy centers to various kernels. This is almost certainly a result of not stirring this rice continuously as it cooked; unlike other grains, since arborio is so starchy, stirring while you cook them allows all the grains to cook more evenly. Otherwise, the flavor was good, it was much less labor-intensive, and the proportions called for were en-pointe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it for dinner tonight was easy to make and simple enough to put into the regular dinner routine for all the family while being basic enough to adapt to any meat or seafood"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sqys6dmdvk"
},
"reviewBody": "I followed the recipe exactly, including the rice type. It came out a wet, gloppy, sticky, messy paste. If I had any toast points, it would’ve worked as a dip. The few bites I did manage to eat had a ton of flavor. Might try again with less liquid."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChantillyLace"
},
"reviewBody": "Great base recipe! I added a cup of finely diced tomatoes at the start, and 15 minutes before it was done I added another 1/2 of tomatoes and 1/4 cup of thinly sliced basil. Absolutely delicious! I add grilled shrimp sometimes too. And extra Parmesan! But you can tailor any risotto recipe to this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mehehe"
},
"reviewBody": "I had little faith when I decided to try this recipe. I peeked in while it was cooking and it looked way too soupy. However after just over 2 hours, it turned out PERFECT and tasted great. I love risotto but hate all the constant stirring required so I was thrilled with this recipe. Thanks Lady7Fire for a great recipe. I have now made it many times as written and the only change I occasionally make is to throw vegetables in that I might have around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "One of the worst things I’ve ever made! Followed the directions exactly and it was a congealed mess. The garlic rose to the top and never cooked, plus way too much of it. I cook with a lot of garlic but this was awful. Don’t waste your time and ingredients — make risotto the traditional way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "Delish! A touch on the mushy side but the taste and low effort outweigh that slight flaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nyirishqt"
},
"reviewBody": "My children loved it! Its a bit strong on the garlic, but we're ok with that! They even asked to put it in a regular rotation! I'll be making it for the family this weekend, tho I'll need to double the quantity and adjust as needed. Thanks for posting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Priya McDonald"
},
"reviewBody": "Wow, I never knew risotto could be so easy! I’m so happy I found this recipe. I followed the directions pretty closely. I didn’t have onion flakes so I used a little onion salt. I also added some frozen peas. After about 1 hour 15 minutes on high it was done and delicious. We ended up turning the crockpot to the warm setting and adding some frozen shrimp. About 20 minutes or so later, the shrimp was cooked and it was all perfect. My toddler even ate some of the risotto. My husband was raving about it. This is definitely going on my regular rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzib"
},
"reviewBody": "I followed her recipe and made this delicious dish. I put peas in it. Really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Suzie-Q"
},
"reviewBody": "I followed the recipe to a t and ended up with a slow cooker full of mush! Yes I used the right rice. The liquid absorbed and rice was cooked but sooo mushy compared to stovetop method. What could I have done wrong? There were so many rave reviews :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tashon"
},
"reviewBody": "I made a double batch and added sautéed mushrooms, asparagus and onions when it called to add the Parmesan, in addition to the cheese. I cooked it on high for 3 hours which seemed fine. I wouldn’t double the olive oil though. I’m not a risotto aficionado I thought it was very good and easy. A little sticky but that’s easy to remedy. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "This was good, but it took only 1.5 hours, and I had to add more broth and wine. It still came out rather gluey and kind of bland. It tasted good after more seasonings, but certainly wasn’t as amazing as many reviewers say. Maybe it was my variety of white wine and brand of cheese. Don’t know if I’ll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAULASERRAVALLE"
},
"reviewBody": "Sautéed onions and garlic and threw it in. I doubled it for a party of 20 ish and what was left over, people took home in take out containers. Everyone loved it! Used Italian rice ( not specifically arborio) and it was just fine! 3 hours was enough for the doubled recipe so I suspect 1.5 hrs would be sufficient for a single recipe. What a no brainer....so easy and fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jan Kochendorfer"
},
"reviewBody": "Be sure to eat it right away - it got sticky pretty fast. Great flavor and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anemone"
},
"reviewBody": "It resulted in an awful texture and still required a lot of attention. Might as well make a traditional risotto."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "dobinky"
},
"reviewBody": "I was hesitant to do it in the slower cooker, but gave it a try. Was so hopeful. It was awful. I kept checking it after an hour to make sure that it wasn't overcooking. It did take the two hours as stated but was like a sticky paste. I'm not sure if I will try it again. If I do, I will try turning the slow cooker off 15 mins early I suppose. I'm so sorry that it just didn't work for me. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayt"
},
"reviewBody": "Ill never stand over and stir again. Folded sauteed mushrooms and asparagus in 5 min before serving. Asparagus was perfecto aldente"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taoswin"
},
"reviewBody": "Delicious and easy... will make it again. Serve it with Braised Pork Ragu and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taoswin"
},
"reviewBody": "Delicious and easy... will make it again. Serve it with Braised Pork Ragu and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pearlsamb"
},
"reviewBody": "Awesome recipe! A great base, which I have added different things to (chicken&amp; mushrooms, shrimp and spinach, are two ways). I add just a little bit more white wine before adding my other additions &amp; parmesan at the end. It may not be quite the same as what the grueling work over the stove gives you, but this is quite a delicious alternative!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katodon"
},
"reviewBody": "So easy ! I made Risotto Milanese, adding strands of saffron to the recipe....delicious and great when feeding a crowd!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cbonarski"
},
"reviewBody": "I just made this. Really delicious and MUCH easier than regular risotto. I made a few tweaks - based on what I had and some reviews. I used 2-3 tbsp beefy onion dry soup mix in lieu of the onions and salt. Also I used chopped garlic (from a jar), it didn't cook down quite enough and was a bit crunchy. I only ended up cooking on High for 1hr 15 min, then another 15 min, adding a bit more chicken broth. All in all it was delicious and will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hookie"
},
"reviewBody": "Perfect risotto every time and is the only way I make risotto it since trying this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "What a gloppy mess!!! I used the correct rice &amp; followed the recipe carefully. Rice was uncooked after 2 hours. Checked it again @ 2.5 hours. Rice still crunchy. Rice finally cooked after 3 hours but still very soupy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rich"
},
"reviewBody": "As much as I wanted this to work because of much a pain in the butt risotto is to make, it's just not nearly the same. I'm sure I could tweak and tweak to get it close, but then it defeats the purpose of ease and I don't make risotto enough that it's worth the effort."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JillBait"
},
"reviewBody": "I also tried this recipe with saffron and loose garlic sausage. Wonderful !! I will have to add a new recipe to the site soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Al"
},
"reviewBody": "It was way over cooked in 2 hours and I DID use Arborio rice. I will try this again but watch closely as I realize each slow cooker varies the cooking time. It was very tasty even with the stickiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyd_Delve"
},
"reviewBody": "This recipe is awesome. No more standing over a stove stirring for what seems a lifetime; risotto can be made in a slow cooker!! I use my 2 quart slow cooker, vegetable stock and cook for just 2 hours and it is perfect. We serve the risotto with a kind of vegetable melange made of all different veg sauteed in a little olive oil. A delicious vegetarian meal---thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Obuzor"
},
"reviewBody": "I added red bell pepper and green onion with the parmesan cheese and it turned out wonderfully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lara Boertje Randall"
},
"reviewBody": "Yum. Yum. Yum!! No changes. It was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine DeWeaver"
},
"reviewBody": "Easy way to cook this. Previously, I stood and stirred."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pam Ertsgaard Lien"
},
"reviewBody": "I made this risotto for supper tonight, but it took way longer than the recipe stated. And it made a huge amount. It's heaping in a half sheet pan to cool. Will arm it up for tomorrow, and freeze some. I added capers and sun-droid tomatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lynda"
},
"reviewBody": "I didn't make any changes to this recipe, even made a special trip for the \"rice\" which was expensive. The flavor was great but the texture was gummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Etiella1"
},
"reviewBody": "Easy and delicious. I used shallots instead of onion flakes and I added blanched asparagus at the end. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MJx2"
},
"reviewBody": "This recipe is great with a few changes. I added cooked chicken breasted that's shredded and crumbled bacon. I've discovered that you have to add more chicken broth toward the end of cooking so it cooks better and stays moist without burning or drying out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sanzoe"
},
"reviewBody": "For being a recipe in a slow cooker this is really good. Is it as god as the slow stove method, probably not but it's a great side dish for busy days. Toss everything in and forget about it. 5 stars for being family friendly and easy to make. This will be on dinner rotation going forward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is such a low fuss method for making risotto. I didn’t have any dried onion so I just added a little chopped onion. Next time I wouldn’t cook it as long but it was still pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Happyschmoopies"
},
"reviewBody": "I love risotto and was excited about trying this one since it was in the slow cooker. I was not expecting it to have the same creamy texture as one cooked on the stove top, but, was still intrigued to give it a try. The plus side was that the flavor was wonderful! You could taste a perfect blend of garlic, white wine, &amp; parmesan cheese. I would give the flavor five stars. The downside for us was the texture. We did not care for the texture at all. I kept checking it to be sure it did not overcook. It seemed to be the perfect texture, but, had not absorbed the liquid and was still runny. I cooked until the liquid was just absorbed - about 2 hours. The rice was very mushy. It was so mushy it seemed more like mashed potatoes. I would rate the texture one star. Although the flavor was a big hit, I don't plan on making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Mc"
},
"reviewBody": "It was good and easy to make. I used homemade chicken broth which gave it an extra richness. I think the cooking time is way too much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda T"
},
"reviewBody": "This was delicious. Mine was a bit overcooked. I would suggest checking it prior to the 2 hours to see if this is done. I am sure the cooking time varies a bit depending upon your device"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VOURI"
},
"reviewBody": "Tasty! Mine was done at 1.5 hours, so I turned off the slow cooker and stirred in the Parmesan and an extra splash of white wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pixie68"
},
"reviewBody": "Knowing how much stirring I am saving myself by using this recipe, makes it revolutionary! not sure I will ever make risotto the old way again. THANK YOU!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Captain Petunia"
},
"reviewBody": "Too much olive oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TastesLikeChicken"
},
"reviewBody": "I followed the recipe exactly using my 3 quart slow-cooker, cooking for 2 hours, but my risotto was mushy instead of being al dente. The flavor was good. Maybe my 20-year-old slow-cooker is a little off. Will try again in my newer 6 quart slow-cooker and watch it towards the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace2010"
},
"reviewBody": "We doubled the recipe and it took 4 hours. Turned out great. I did borrow a smaller crockpot than my own, so it wouldn't burn (3qt?) I followed a suggestion and added mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Polly"
},
"reviewBody": "Very pretty recipe, for my Redmond 4500 multicooker it is so easy that I can do it every day! When I was trying your recipe I saw that it was the same that in Redmond cookbook, they are both good, but in my cookbook there are photos of processing. So, meal is very tasty and warm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Johanna"
},
"reviewBody": "I tried this recipe several times in three different crock pots and it came out disgusting each time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HEZABINDA"
},
"reviewBody": "Made this tonight for my grandkids in the small crockpot. Was so easy and used will be a staple in our home.. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DanaJoy88"
},
"reviewBody": "comes out perfect!!! I let my cook with some mushrooms and asparagus and my boyfriend loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cateyemeow"
},
"reviewBody": "I used Lipton's Onion Soup and omitted the onion, since the soup already has onion in it. I omitted the salt, and just added a dash to season to my taste while eating, as I don't like a lot of salt in my food. Everything else same as recipe calls for. It was cooked in about 2 hours. It was delicious! I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mamahuhu"
},
"reviewBody": "I make risotto all the time and this looked like a good way to avoid all that stirring. But I basically got library paste. It would probably have been perfect 20 or 25 minutes earlier, which may be a function of my slow cooker. I'd advise checking in the last half hour. Also, following the advice of another reviewer, I used less liquid than in the recipe (20% less, roughly), and that amount was plenty. If I shorten the cooking time, though, that may have to be adjusted as well. So a good idea in general, but may require some tinkering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mellie7"
},
"reviewBody": "Perfect as written! This has become one of my family's favorite dishes. I'm always looking for things to pair it with; my favorites so far are Parmesan Meatloaf and Italian Meatballs. Don't let it overcook -- it gets too mushy and sticky right after about 2 hours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "farmersmith"
},
"reviewBody": "Super easy. Super delicious! I will definitely make it again, but double the recipe next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Volleyballmom"
},
"reviewBody": "Big fan. Mine was ready in 2 1/2 hours (total) in a 3qt and it had a bit of a bite which is the texture risotto is supposed to have. I really like this as an alternative to traditionally done risotto. Great flavours. Thanks Lady7Fire. This is a keeper and so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lucylove"
},
"reviewBody": "I really didn't think my slow cooker would make good risotto, but color me impressed! I made 1/2 the recipe in a 2 quart cooker using fresh minced onions. Otherwise, I made it as written. At 1 hour, I gave it a quick stir, which likely wasn't necessary. At 1:45, it was ready. Sadly, the fish wasn't. 15 minutes and more chicken broth later, it was still a little thick, but I'm blaming myself. Aside from my timing issues, this made very good risotto, with flavors that were spot-on. It works better than my new Breville risotto maker, which I'll be returning tomorrow. This recipe saved me $130! Thanks. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justinoles"
},
"reviewBody": "I have made this recipe 3-4 times and it has come out great every time, perfect risotto and easy to make. I use a large oval slow cooker and it doesn't come close to filling it, but still comes out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jj"
},
"reviewBody": "Great recipe! Thank you for sharing. I added a can of tomato to my stock mix and it came out beautifully! Tons of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kathrynbrkroll"
},
"reviewBody": "I tried this tonight in my slow cooker and followed the recipe exactly. I thought it turned out okay, but nothing to write home about. It ended up tasting exactly like a cream of chicken and laughing cow pasta I always make, it just cost more per serving and took a lot longer. I do think it tasted good, but my boyfriend wasn't impressed enough for me to make it again and I wasn't either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ADM"
},
"reviewBody": "This was very easy! I tried it the first time just the way the recipe states. I am a garlic lover, but I thought the garlic overpowered the dish. Next time I will cut back a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SLILLY6"
},
"reviewBody": "GLOP. Tasty but pasty gloppy sticky mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb Craig"
},
"reviewBody": "Really good and much easier than traditional risotto. I would cut the salt in half - was a touch too salty for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "stu"
},
"reviewBody": "Mine turned out kind of gloppy too; cooked for 2hrs using arborio rice. It was still tasty, used fresh made turkey broth. I'll try again though and next time cut back on the broth by 1/4-1/2 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sabrumoo"
},
"reviewBody": "I am not really happy with this one. I wound up with a cross between mashed potatoea and grits. The arborio rice all but melted into a sticky, but tasty, blob."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JKH"
},
"reviewBody": "I made it exactly as the recipe said the first time except for my mistake in adding ingredients at the wrong time. I've never made risotto before and despite my mistake in adding all the ingredients at the beginning this was still amazing. DELICIOUS! As good as restaurant risotto!\n4 cloves of garlic is a powerful garlic flavor so next time I'll cut back to perhaps 2 cloves and add my favorite spice- ground rosemary. This is well on it's way to becoming a favorite dish of mine. The texture is so lovely. I would NEVER try to make this with anything other than Arborio rice after reading other risotto reviews of horror at using the incorrect rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenna Cooper"
},
"reviewBody": "I love this recipe, it worked great even with a couple little tweaks to make it vegan. I had roasted shallots on hand so I used those instead of the onion flakes. It would be easy to vary this with different herbs, etc. I have always avoided making risotto but now we can have it anytime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer O'Brien "
},
"reviewBody": "AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ellen1159"
},
"reviewBody": "Maybe there is something wrong with my slow cooker, but the rice was overdone while I was waiting for the garlic to soften up and mellow. The garlic was too sharp and assertive for me; if I were going to do this recipe again, I would use garlic powder or saute the garlic until it was softened. However, it smelled great and the rice got very creamy (I may have overcooked it). I'm not a risotto expert so I'll need to try making it the old school way on top of the stove. But this is so frickin' easy, I may never make rice on the stovetop again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StephanieJo"
},
"reviewBody": "Saw this recipe and seriously though this was too good to be true. Had never made risotto before as I know what a laborious process it is. This produced really great flavorful risotto. I did have to babysit it just a bit. At the 1:15 mark, I checked on it and saw that it looked too dry. It needed more chicken broth. My risotto was done after 1:30. That being said, it was absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LK3607"
},
"reviewBody": "Easy &amp; delicious! I added some frozen peas &amp; used jarred minced garlic. I didn't have onion flakes but still tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tdiland1"
},
"reviewBody": "I must say...I was extremely skeptical when first reading this recipe. I did not think risotto could be this easy and this good...but it turned out absolutely delicious! I used low sodium chicken broth to keep it a little healthier and it was still amazing. I also used Asiago cheese instead of Parmesean just because thats what I had on hand. Thank you for such a scrumptious and easy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "To Karin - you MUST use Arborio rice - no other type will work!! Only Arborio rice has enough starch to become risotto. (I learned that the hard way!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Karin"
},
"reviewBody": "After 1 3/4 hours it was a gloppy mess that did not resemble risotto."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "asalcorn"
},
"reviewBody": "Delicious! Since finding this recipe, I've made it weekly. Throw all of the ingredients in the crock pot and two hours later you have an amazing risotto. I've highly recommend this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajt1980"
},
"reviewBody": "Wow!! So glad i stumbled upon this recipe when I was not even looking for anything like it. This is AMAZING! Tastes just like risotto and is so extremely easy. I will be making this often. I followed the directions exactly except i used jarred garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Delicious! Mine was done to perfection in exactly 2 hours. I used a 3qt. slow cooker and that was a perfect size for this. I can't believe that something this simple could come out so flavorful! I will def be making this again! Thanks for sharing. :)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/228033/slow-cooker-risotto/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
"name": "Rice"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14362/main-dish/rice/risotto/",
"name": "Risotto Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/228033/slow-cooker-risotto/",
"name": "Slow Cooker Risotto"
}
}
]
}
}
, "about": [
]
}
]