				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Snert (Split Pea Soup)"
,"datePublished": "2019-04-03T23:52:11.000-04:00"
,"dateModified": "2022-01-14T10:45:01.000-05:00"
,"author": [
{"@type": "Person"
,"name": "carmel"
,"url": "https://www.allrecipes.com/cook/3783542"
}
]
,"description": "A ham hock, bacon, and potatoes add heartiness to a thick split pea soup made in the slow cooker. The soup&#39;s name is Dutch."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hnJDHL-YmbnYgkTOehKIawVENh8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9441321-b4162b21f24244e4a61c193fcd724aa0.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Snert (Split Pea Soup)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "53"
}
,"cookTime": "PT420M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "32 g"
,"cholesterolContent": "65 mg"
,"fiberContent": "7 g"
,"proteinContent": "25 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1566 mg"
,"sugarContent": "6 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 (14 ounce) bag dried split peas",
"1 ham hock",
"3 slices bacon, chopped",
"2 (14.5 ounce) cans chicken broth",
"3.5 cups water, plus more as needed",
"4 small potatoes, peeled and diced",
"2 carrots, peeled and diced",
"1 leek, diced",
"0.5 large onion, diced",
"2 stalks celery with leaves, stalks diced and leaves chopped",
"1 clove garlic, diced",
"0.5 teaspoon salt",
"0.5 teaspoon ground black pepper",
"0.5 teaspoon dried thyme",
"0.5 teaspoon ground nutmeg",
"0.25 teaspoon ground cloves",
"1 (1 pound) package smoked sausage, sliced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place dried split peas, ham hock, and bacon into slow cooker; pour in chicken broth and 3 1/2 cups water."
} ,{
"@type": "HowToStep"
,"text": "Cover cooker and cook on High until peas are tender and broken apart, 3 to 4 hours. Stir in more water as needed to prevent soup from burning on the bottom. Stir occasionally throughout cooking."
} ,{
"@type": "HowToStep"
,"text": "Stir potatoes, carrots, leek, onion, celery, and garlic into soup; mix in more water, if needed. Cover and cook soup on High for 2 more hours."
} ,{
"@type": "HowToStep"
,"text": "Season with salt, black pepper, thyme, nutmeg, and cloves; mix sausage slices into soup. Cover and cook 2 more hours to blend the flavors."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT450M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ian"
},
"reviewBody": "My Dutch father-in law claimed that I must have used his Mothers recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schneiguy420"
},
"reviewBody": "Turned out really good. I followed the recipe to a T with the exception of using 2 smoked ham hocks (they came in 2 packs), and I used 3/4 lbs non-smoked German style sausage. Figured I could get away with that because I used smoked bacon and the ham hocks were smoked, so there would be plenty of smoked flavor--and there was! Will definitely be making this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri Stokes"
},
"reviewBody": "I didn't have leeks, and I substituted 5 oz baked ham over the ham hock. I also added a 1/2 c cream before serving which really increased its richness. I'm sure the hocks would have added a deeper ham flavor, but we loved this recipe anyways! We crumbled cooked chopped bacon over the top to give it some additional texture. Hearty and so good. Even better the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "angelmommy"
},
"reviewBody": "This is the longest drawn out recipe I have ever made for pea soup! I started yesterday afternoon and it's still not done! And doesn't have a lot of flavor either, with all those ingredients it should be fabulous but it's not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annette"
},
"reviewBody": "Love this recipe for Snert :-)\n\nI grew up eating Snert and after my mom passed away I realized I didn't have her recipe. \nThis is it! \n\nThank you for sharing, reminds me of my mom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Williams"
},
"reviewBody": "Delicious! I followed the recipe but added alittle cumin and turmeric to the spices. I had no issues with not enough water and probably could have eliminated 1/2 cup of water. Not a lover of split pea soup myself but I definitely enjoyed this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grokjes"
},
"reviewBody": "Couldn't find ham hock, used 3 pork chops and 1 package pork neck - pork neck was great, the chops seemed unnecessary. In the future I'll use more pork necks and add less water - 1 cup instead of 3, in addition to the stock - consitency was not bad, but I want that real thick soup like I had in Maastricht."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitgirly"
},
"reviewBody": "This is the best soup I have ever eaten. I am over the top happy with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hans Stoker"
},
"reviewBody": "It's an awesome recipe. The mild amount of spices give it just enough taste to notice, but not interfere with the taste of the ham and peas. Nice and thick, you'll need to add water for leftovers. I sped things up a bit at my wife's suggestion by boiling the peas first. You don't need to do it all in the crock pot. Just give all the ingredients enough time in the crock pot for the flavors to blend....say a couple of hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia Maze"
},
"reviewBody": "All four of us loved it! I used a ham steak and left out the bacon &amp; sausage, but did everything else as directed. I loved having more veggies in it than I'm use to having in my pea soup. It thickened up perfectly shortly after spooning it into bowls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mama3"
},
"reviewBody": "I have rarely, if ever, followed a recipe for soup. So glad I made an exception. My husband is a fan of pea soup so I make it when I have a leftover ham bone. Intrigued by this version I went for it. YUM! The subtle nutmeg flavor with the combination of meats and veggies is outstanding! Even my 9 year old who seems to think peas are the root of all evil ate it up. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Y"
},
"reviewBody": "I made this and it was excellent! I didn't have any sausage or thyme but it turned out great anyway. Will make it again but I will put in way more carrots. I love carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KLDREYER"
},
"reviewBody": "This was good, but like version with equivalent quantity of celery root (celeriac) rather than celery and potatoes better. Got to use the leek, though! Spice mix in this recipe was tasty.\n We were introduced to this soup in Amsterdam: comfort food at its best.\n\nHave also made this with chicken sausage, and leftover ham bone.\nSecret to this soup is slow cooking, but my slow cooker had things too mushy when cooked that long on 'high', you may want to try this for the first time when you are able to babysit it a little, as all these cookers vary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Yummy. I made it with leftovers cooked ham cut up, and mashed potatoes from my freezer and added fresh onion and carrots (didn’t have Thyme or bacon, celery) and it was still awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "It was easy to make - taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael"
},
"reviewBody": "yes very lovely played with the recipe cheers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marvia2013"
},
"reviewBody": "All I have to say is OMG!!!! I was skeptical about this soup but I’m glad I made it. We don’t eat pork so I put some chicken pieces in it along with turkey sausage and some vegetables. Kids and hubby came back for second so you know it’s yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "I added smoked ham. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eryn"
},
"reviewBody": "Flashbacks to being a kid visiting Oma and Opa! \nLoved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cora Lynn"
},
"reviewBody": "This just gets better as it simmers so prep time for me looked more like 10 hours or so in the crock pot. I went a little light on cloves because I find that flavor overpowers a dish. On that note, I'd add an extra clove of garlic because that's a flavor I can't get enough of. This soup is hearty and comforting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Rozema Geyer"
},
"reviewBody": "This was a delicious soup! I loved that it had carrots, potatoes, and celery in it. I didn’t have any sausage and instead of ham hock, I used ham cubes but it was still a hit with my family. Next time I make it, I will use the sausage because I think that will add a nice flavor. Overall, we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Hill Geiman"
},
"reviewBody": "I made this with the ham bone from easter. it was so good. I uses the peas, onions, seasoning salt, carrots, and chicken broth. cooked for 6 hrs in crock pot then cut ham pieces off. it was so good. we ate it all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susie Forward"
},
"reviewBody": "This soup was absolutely delish and a hit with both my hubby and me! My only changes were to use all chicken broth (two 32oz boxes) rather than half water. I also added 1/2 tsp cumin at the suggestion of other reviewers, and 1/8 tsp clove. I ommitted the salt and used the ham bone and tons of chopped ham from a spiral ham. Rather than chopped strips of bacon, I used about half of a 2-1/2 oz pack of real bacon pieces. (I get them from Aldi for $1.29, and they are great to have on hand!) The soup came out phenomenally perfect, served with corn bread"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tsilvey"
},
"reviewBody": "Lived in Holland as a child and was craving Dutch pea soup. I tasted it as it was cooking in slow cooker and was delicious, just like I remembered. At the time, I thought the addition of thyme, nutmeg and clove seemed odd but I added it anyway. It was awful and ended up throwing out the entire pot of soup. I am remaking it tonight with a ham hock without the above spices and no sausage. It will be just the way I like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Hornback"
},
"reviewBody": "Super delicious! I just returned from a trip to Amsterdam and wanted to reproduce the delicious pea soup I had there. This is just the thing! The grocery store didn't have any ham hocks, so I had to use a piece of salt pork instead. It wasn't as thick as I wanted it to be even though I left the lid off the crock pot for a couple of hours so I will add less water next time. Once I work out the liquid issue, this recipe is a keeper.\nEdit 11/4/2018 I made it again with one less cup of water and the consistency was perfect. I used smoked pork neck bones this time so I got the richness from the bones in the soup. It turned out to be too salty this time so next time I'll do it the same way and omit the salt altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianna"
},
"reviewBody": "Husband and I thought it was great. Easy to make. I didn't use the cloves or sausage, and used a meaty ham bone instead. It's a great basic recipe. If you want to alter an ingredient or cooking method, do it. I really don't think you can mess this up. Thanks for posting the original recipe and other reviewer ideas too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meade"
},
"reviewBody": "Delish! I didn’t add the sausage and it’s it as still tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "I used my immersion blender to make some of the soup creamier, and left some chunky. I’m going to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cd17"
},
"reviewBody": "I made this soup and it was just delicious! I omitted the sausage and cloves and added some extra ham that I had. I followed the recipe and cooked it all day. My husband said it was the best soup I've ever made! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amberg7hi"
},
"reviewBody": "I used a honey baked ham bone and used some bacon. This was a real hit! My family really enjoyed this soup! Very easy in the slow cooker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon MC"
},
"reviewBody": "This soup turned out really good with leftover ham bone from christmas. I used home made chicken stock, dried peas and the hambone as the starter, cooked in a pressure cooker for 20 minutes. Pureed the peas with a stick blender. I added sauteed onions and garlic, the carrots, celery and potato along with the spices, including cumin and pressure cooked for another 15 minutes. A quick stir with the stick blender again to smooth it all out. Tastes delish right now and will only get better tomorrow!. thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "I only used the ham hock for the meats, Better than Bouillion Vegetable base for the stock and water and pureed the soup as my son has texture issues. I altered the seasonings to suit our taste, good basic soup that can be tweaked to suit your family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fernand LeBlanc"
},
"reviewBody": "OMG! I have made many versions of Pea Soup but not as delicious as this one. I passed on the smoked sausages. Otherwise followed the recipe. It was amazing. Will make it again and again. Good on the Dutch! I may try sausages but not smoked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nanak3"
},
"reviewBody": "this is a delicious pea soup recipe. I didn't have ham hocks or bacon but i used a ham bone. Didn't need to add any water during cooking. It tastes so good we are having an early dinner because we cannot wait to eat it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeff2001"
},
"reviewBody": "Omitted the Leek. It was very flavourful and in the last hour or so it required more water than called for in the recipe.\nI cooked it in a reduced amount of time (shaved 2 hours off of it). The potatoes cooked in 45 min.\nOtherwise very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Leek Beuckelaere"
},
"reviewBody": "I stayed close to original recipe but omitted the sausage and clove since I didn't have either in the house. My husband text me at work to tell me it was delicious. I can't cook so most of my meals turn out as eat able so it was a home run on this one. I went back and forth on whether to fry the bacon first and opted not to. I think that was the right choice because it lent to a better flavor raw. I'm getting ready to make it again but don't have celery or leeks. So I'll see just how much can be omitted and still be delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janie"
},
"reviewBody": "This soup absolutely rocks! I didn't add the extra salt or pepper. I didn't have any cloves, so I added 1/2 tsp cinnamon. No leek, but added 1/2 of a purple onion. This whole house smells soooooo good! I had extra ham, so I added that instead of sausage. I did not cook the bacon prior to putting it in the slow cooker, as others suggested. I've already had a \"sample\" bowl and it's not even supper time yet. ;) Making some of those cheese/garlic biscuits to go with it. Yummmmm (BTW, it is 98 degrees here in NC today. Why wait for Winter when you have a/c inside the house!) So glad I didn't wait to make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carla Keats"
},
"reviewBody": "I really enjoy this recipe. The only thing I omitted was the garlic, and that is only because my husband doesn't like garlic. Also I didn't have any smoked sausage, but I had plenty of ham to make up for it. \nI did not add the additional salt because the ham I used was salty enough.\nThe only thing I would change for the next time I make would be to omitt the ground cloves. It is a much stronger spice than I anticipated, and though my soup still turned out great with it, I would prefer the soup better without the ground cloves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rookie cook"
},
"reviewBody": "Love the Dutch name and the soup tastes very good but the recipe has serious problems. The dried split peas are well cooked, breaking up and coloring the soup in an hour or less, nowhere near the 3 to 4 hours in the recipe. Altitude makes a difference and I'm at 200 ft. but one would have to be in Flagstaff, AZ, 7,000 ft., for it to take 3-4 hours. Diced potatoes will cook in less than half an hour and be absolute mush in an hour so the two additional hours in the recipe is way way too long. Also, the bacon does add a good flavor to the soup but the recipe should call for it to be fried to near crisp. The salt needed is more like 3/4 tsp than 1/2 and, although I'm not a spicy food fan, I did use 1 tsp fresh ground black pepper rather than the 1/2 tsp called for. I also used a large pot, one gallon, which was just the right size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ldg6190"
},
"reviewBody": "Used a smoked ham hock and added 1/2 tsp cumin. Best soup ever."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gtyyup"
},
"reviewBody": "UPDATE 4/2/ 2015: Had almost all the ingredients this time (minus the leek)...and it was awesome!! I did not soak the peas overnight. I fried the bacon until crisp and tore into pieces, and I sauteed the onion. Put a very meaty ham bone, bacon, peas, sauteed onion, chicken stock and water into the crock on high for the first hour; then turned to low. After 5 hours, I took out the ham bone, removed the meat and added meat back in...also put in the potatoes, carrots, garlic and celery at this time. After another two hours, I added all of the spices, sausage slices and 1 cup water. It was perfectly done in a total of 10 hours cooking. Lots of left overs for the freezer with only two of us...but the husband wants it for dinner again tomorrow night! ORIGINAL: This soup had a very pleasant flavor...even though I didn't have all the right ingredients. I had a VERY meaty ham bone in place of the ham hock, no bacon, no leek and no sausage. But I followed the recipe with everything else. The peas were soaked overnight prior to putting them into the slow cooker. The ham bone was cooked for the first 6 hours after which time I took it out and let it cool to remove the meat...adding the meat back into the cooker. At the very end, I used my immersible blender and gave it a few swirls to thicken the soup up a bit. I never had to add any additional liquid. Served with home made corn bread, and it made a delicious winter meal. I hope to have sausage on hand next time! Thanks for sharing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/221233/snert-split-pea-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14728/soups-stews-and-chili/soup/beans-and-peas/split-pea-soup/",
"name": "Split Pea Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/221233/snert-split-pea-soup/",
"name": "Snert (Split Pea Soup)"
}
}
]
}
}
, "about": [
]
}
]