				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Snickerdoodle Blondies"
,"datePublished": "2020-06-19T00:02:16.000-04:00"
,"dateModified": "2021-07-22T11:54:03.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jenn"
,"url": "https://www.allrecipes.com/cook/10714297"
}
]
,"description": "Traditional blondies are topped with a cinnamon topping and a cinnamon-vanilla glaze creating snickerdoodle blondies that are a snap to make."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/SKxTE8WaA47qTvbTNDZa5GNw2bQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2129685-2898402c9dee4a5baaf417c1d34ad207.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Snickerdoodle Blondies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "57"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "277 kcal"
,"carbohydrateContent": "43 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "245 mg"
,"sugarContent": "29 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.6666667461395 cups all-purpose flour",
"2 teaspoons baking powder",
"1 teaspoon salt",
"2 cups packed brown sugar",
"1 cup butter, softened",
"2 eggs",
"1 tablespoon vanilla extract",
"2 tablespoons white sugar",
"2 tablespoons ground cinnamon",
"0.125 teaspoon ground ginger",
"1 cup confectioners' sugar",
"0.25 cup heavy whipping cream",
"1 tablespoon ground cinnamon",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Whisk flour, baking powder, and salt together in a bowl. Beat brown sugar, butter, eggs, and 1 tablespoon vanilla extract together in a bowl using an electric mixer until smooth and creamy. Stir flour mixture into creamed butter mixture until batter is well combined and thick; spread into the prepared baking pan."
} ,{
"@type": "HowToStep"
,"text": "Combine white sugar, 2 tablespoons cinnamon, and ginger together in a bowl; sprinkle over batter."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until blondies are beginning to pull away from the sides of the pan and are set in the middle, 25 to 30 minutes. Allow blondies to cool, at least 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Beat confectioners&#39; sugar, cream, 1 tablespoon cinnamon, and 1 teaspoon vanilla extract together in a bowl until glaze is smooth; drizzle onto blondies."
} ]
,"recipeYield": ["20"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arlea"
},
"reviewBody": "My search for the perfect blondie recipe is over! I made a couple of minor adjustments. I didn’t use quite all of the cinnamon/sugar mixture and I omitted the glaze. I also added about a quarter cup of eggnog to the batter. They were soft and flavorful, with just the right amount of cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Ulrich"
},
"reviewBody": "Snickerdoodle Blondies are incredible! Thanks Jenn. I've made these many times since my son sent me this recipe. Dangerously easy to make. They disappear at potlucks, and they do keep well for a few days if needed, with some self restraint. Some comments have mentioned the 2 Tablespoons each of sugar, and cinnamon for the topping step. Two Tablespoons each is the correct amount. Do not reduce this, unless you live in a house where that tiny jar of spice is expected to last into the next decade, and flavor is not to be experienced. That cinnamon/ sugar topping really creates the magic. May I suggest: save the paper wrapper from the butter. The Blondie batter is very stiff, and doesn't spread easily into the baking pan. What I do is place spoonfuls of batter in the pan, then using the wrapper from the butter to prevent sticking to my fingers, press the batter into an even layer in the pan. Then sprinkle the cinnamon/sugar mix evenly. Do not skip the glaze step. That too is magic. For those of you who think the glaze should be skipped, remember, this is dessert. It's not supposed to be healthy. Go to the salad section of the cookbook if you want something healthy. However, I have found the quantity of one cup of powdered sugar is more than enough to create the Jackson Pollack inspired drizzle of glaze as shown in the photo. One cup will completely smother the blondies. Not that too much sugar is a bad thing, I find that reducing that to a slightly heaping half cup of powdered sugar, and reduce the quantity of the other ingredients in the glaze by about half, creates just enough to cover the blondies like they are in the photo. Mix in enough cream so the glaze dribbles off the spoon, then release your artistic expression. I do add a quarter teaspoon of ginger to the glaze, because I like ginger. Thanks for this wonderful recipe Jenn!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RachaelHanna"
},
"reviewBody": "I first made this recipe for my family, then another batch for coworkers. Everyone loved them (including me)! I added nutmeg instead of ginger to the topping, and for the batch I took to work I put cinnamon on half and peanut butter chips on the other half. M&amp;Ms would be great too. Definitely a keeper since they're so buttery and soft"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Britannica "
},
"reviewBody": "These are my husband's favorite, he requests them almost every time I mention baking! I use a little less than a cup of oil instead of the butter since I can't do dairy, and once when I didn't have enough brown sugar I used half white and they still turned out great. They're easy to do, even mixing by hand, and so nice and chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Gates"
},
"reviewBody": "Made this for my own birthday and it was a hit. Love this recipe, good cinnamon flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "julie"
},
"reviewBody": "I made it exactly by the recipe using the full amount of time and it's soggy in the middle even without adding the creamy glaze. I tasted an edge which seemed to be cooked more and I think the flavor is too cinnamony"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "frapgirl"
},
"reviewBody": "Delicious. Like others, I did not use the glaze. And I only used 1 tablespoon of cinnamon for the cinnamon-sugar topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jackie1989"
},
"reviewBody": "I followed the recipe, but used a 13x9 glass baking dish. The edges of mine got really tough, so either the baking time was too long for my oven or maybe the glass dish had that effect. The initial taste was good, but they tasted better and softened up after a couple days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANE428"
},
"reviewBody": "Really good! Next time I think I will only do 1 table spoon of cinnamon to the topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawnie"
},
"reviewBody": "Love these bars! Rarely use the glaze, just use the cinnamon sugar on top. I do reduce the amount of flour to 2 cups, and bake it a bit longer... 30-35 minutes. it creates a chewier blondie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Norah The Explorer"
},
"reviewBody": "I love this recipe, It was so simple to make and it turned out AWESOME!!! I made some modifications—I used 1/16 tsp of allspice and 1/16 tsp of ginger instead of 1/8 tsp ginger. I actually used the glaze and thought it was great and really enhanced the recipe. I added a couple tbsp of milk and next time probably will just use milk and not heavy cream. Overall this is a great recipe and look forward to baking it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pafalcone"
},
"reviewBody": "These are delicious! I have tried several snickerdoodle bar recipes and the search is over! They are chewy and delicious, not too sweet. I did not have heavy cream so just used milk for the glaze. These also cut up so nicely too, not crumbly like brownies. The only tricky part was spreading in the pan bc the batter is thick (I though I had done something wrong). I use parchment paper instead of greasing the pan which made it difficult bc the paper kept lifting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Grace Miller Mitchell"
},
"reviewBody": "These did not turn out well. I followed the recipe exactly but they were dry, dense, and too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "Add some chocolate chips to half of the pan. Some of them don't like chocolate. My family loved it. It was so quick and easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Josh Behnke"
},
"reviewBody": "To much cinnamon for our taste. good blonde backing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula Shatley"
},
"reviewBody": "So good we made it twice in one day! Easy and good with glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Jones"
},
"reviewBody": "My boys love snickerdoodles, but I have never been a fan of making the dough balls and rolling them in cinnamon and sugar. I needed a faster way to get that great cinnamon and butter combination. These bars are my answer! They are rich and buttery, and the ginger in the topping adds a nice kick to the spice. Everyone loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Henderson-Perez"
},
"reviewBody": "No changes... next time I’m thinking of swirling the topping !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "made"
},
"reviewBody": "Loved it! Great recipe! Great Blondie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cynthia Dvorsky"
},
"reviewBody": "Instead of granulated sugar for the topping I used Demerara sugar and only 1Tbsp cinnamon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bridget Moore"
},
"reviewBody": "These turned out delish! I did read other reviews so I was careful with the cinnamon. For the topping I used 2 tsp and for the glaze (which my husband said they needed-I don't think it was needed. ;) ) I did half a tbsp. I only used 1/3 of the glaze-it made a lot. I definitely think it would be too much to add more. The glaze was super cinnamon-ey. A little spicy just by itself. :P I would change it to 1 tsp next time and only make half of it. They were a hit at a party we threw last night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Willie C"
},
"reviewBody": "Made these with the drizzle and they came out great. Ill definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa H."
},
"reviewBody": "So tasty. Soft with firm edges. just the way I like it. Wasn't super sweet, but enough sweetness. Make sure to mix the batter well after adding the flour, baking powder &amp; salt mixture. I baked it for 27 minutes &amp; it came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendella"
},
"reviewBody": "These are so goood and they definitely solved my craving for cinnamon too! I did not use the glaze but I did use all the sugar/cinnamon topping that it called for. Any excess I just shake off before biting into the piece. Very yummy. I will definitely make this again, and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brozzerb"
},
"reviewBody": "Simply one of the best blondie recipes ever. Only one caveat: I have to agree with those who say that the glaze is too cinnamony. I'd reduce the cinnamon to teaspoons instead of tablespoons. In any case, simple to make and really delicious too eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HPB"
},
"reviewBody": "Was good-a little much on the cinnamon topping-I would only use 3/4 of that. Otherwise, yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liltlboy"
},
"reviewBody": "Made these as the recipe instructed and they came out so nice, didn't do the glaze either and they are still awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Ebeling"
},
"reviewBody": "Theses are delicious! They taste like a cinnamon roll. I will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dkhowellmo"
},
"reviewBody": "My family loved these! I didn't quite have enough brown sugar, so I just added regular sugar to balance what I was missing and it was still wonderful. So much easier than making snickerdoodle cookies and tastes just like it. Crunchy on the outsides and gooey goodness in the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K'Trazz"
},
"reviewBody": "Not sure what people are doing to make it come out too cakey, but the texture was PERFECT for me. Delicious. I'll definitely be experimenting with extras in the future. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mrs. W"
},
"reviewBody": "I don't know what happened:(\nMy batter was so dry and cookie like. I followed everything to the T but still had a dry brownie. Was the 2 2/3 cups of flour much?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sassysandy"
},
"reviewBody": "These are wonderful and easy to make. I left off the glaze but otherwise followed the recipe to a T. I was a little worried about the ginger but they taste fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Cioni Kelley"
},
"reviewBody": "My family LOVES this recipe. It's not only easy but delicious. The taste profile is similar to a large sugar cookie but it's a great alternative to regular chocolate brownies. \nI personally left off the ground ginger as my family are not big fans of the taste of ginger. So, that's entirely your call! But this will be in our regular baking rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Lambert"
},
"reviewBody": "I love how easy this recipe is and how easy it is to personalize. I have made it as is twice but without the icing. This time I added a little applesauce to the mix. WOW, so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gayatri"
},
"reviewBody": "The first time, made it without the glaze - the second, with it. The family loved both versions, since we're all cinnamon addicts. I preferred the first, with glaze it was a bit too sweet for my preference. But all in all, a lovely, quick and easy to make dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meznana"
},
"reviewBody": "These were delicious, and very easy to make. I only used 1 tablespoon of cinnamon and I left off the icing. I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SW"
},
"reviewBody": "I will agree, if you make the recipe as is without glaze, they are dry. However, I made the glaze and it makes such a huge difference. It adds some moisture. These are great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cara Williamson Lenz"
},
"reviewBody": "I think there is a problem with this recipe. I don't think it should call for 2 Tablespoons of cinnamon in the topping that is sprinkled on with the sugar. I knew it was too much looking at it and reread the recipe atleast a half dozen times. Pretty sure it should only be teaspoons. Came out tasting like the cinnamon challenge...pretty disappointing! :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay Owens Rose"
},
"reviewBody": "Delicious! It has a very strong cinnamon flavor, even for a snickerdoodle. I love it, but it could be a bit strong for some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CASSIEMAE"
},
"reviewBody": "I have made these bars several times and I am going to make\nthem again tomorrow. I will tell you they are DELICIOUS you will have to make them..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Costa Upshaw"
},
"reviewBody": "My husband loves snickerdoodle cookies! I promised him a batch, but was squeezed for time. . . So I tried this recipe. It was easy to put together and delicious (I did not add the glaze). The taste is a combination of snickerdoodles and blondies (cinnamon, butter and brown sugar). Will make these again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Malibugirl"
},
"reviewBody": "I have never reviewed a recipe on this site, but I had to review these blondies. I am a pastry chef, but rarely eat desert, not my thing. However, I could not stay out of these!! With and without the glaze. If you love cinnamon, these super simple bars are for you! Super yummy. Make them, you won't regret it, well, unless you eat the whole pan at one sitting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LA Ranger"
},
"reviewBody": "Too sweet for us. Made as printed except with whole grain flour instead of white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lrw1027"
},
"reviewBody": "Didn't make the glaze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenn96789"
},
"reviewBody": "So delicious! I didn't alter the recipe at all. Baked it for my daughter's soccer holiday party and it was a hit! Look forward to making it again soon. Thanks for a delicious recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vic Orcullo"
},
"reviewBody": "I followed the recipe to the letter except I didn't add the glaze. Snickerdoodles are best with only cinnamon sugar. This recipe was no exception. Of the entire pan, only two small corner pieces were left after I had friends over. I'm sure if I didn't have other food to eat, this would have been devoured! I couldn't wait to cut into this because the house was completely enveloped with the smell of brownies with cinnamon sugar. The taste did not disappoint at all. I'll be making this easy dessert again! \n\nThank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennchef"
},
"reviewBody": "I thought these were fantastic! They're chewy and sweet and the topping got crunchy. We will definitely make these again! I didn't make the glaze but it was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HappyWifeHappyLife"
},
"reviewBody": "Holy Cow!!! These are delicious! The ones I made came out chewy, soft, and moist! Tastes just like a snickerdoodle cookie! Only changes I made, (and I made them only because I didn't have the exact ingredients) I subbed light brown sugar for dark brown and I didn't do the glaze (which in my opinion doesn't need) because I didn't have heavy cream on me. I left it in the oven for 40 minutes but my oven is wonky. I love, love, love it! Definitely doing this again!!!! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim's Cooking Now"
},
"reviewBody": "These are yummy! I left out the ginger in the topping, because I was all out. Can't wait to have one for breakfast with a cup of coffee."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/241186/snickerdoodle-blondies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
"name": "Brownie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2754/desserts/cookies/brownies/blondies/",
"name": "Blondie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/241186/snickerdoodle-blondies/",
"name": "Snickerdoodle Blondies"
}
}
]
}
}
, "about": [
]
}
]