				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Snickerdoodle Mix in a Jar"
,"datePublished": "1999-11-03T20:36:18.000-05:00"
,"dateModified": "2022-08-22T14:34:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Diane"
,"url": "https://www.allrecipes.com/cook/Diane"
}
]
,"description": "Another &#39;cookie mix in a jar&#39; recipe for the collection."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Mgi9ZNJ8cM0rINFh1LZ-QG87dLU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5075527-7549420f645b414bb8a97157936cc709.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Snickerdoodle Mix in a Jar"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "65"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "67 kcal"
,"carbohydrateContent": "16 g"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"sodiumContent": "51 mg"
,"sugarContent": "8 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.75 cups all-purpose flour",
"0.25 teaspoon salt",
"1 teaspoon baking soda",
"2 teaspoons cream of tartar",
"1.5 cups white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, combine the flour, salt, baking soda, cream of tartar, and sugar. Stir with a whisk, then place into a one quart canning jar."
} ,{
"@type": "HowToStep"
,"text": "Attach a tag with the following recipe to the jar: Snickerdoodles 1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large bowl, cream 1 cup of butter and 2 eggs. Pour in the snickerdoodle mix, and stir until a dough forms. In a small bowl, combine 1/2 cup of sugar and 1 tablespoon of cinnamon. Roll the dough into 1 inch balls, roll the balls in the cinnamon-sugar mixture, and place 2 inches apart on an ungreased cookie sheet. 3. Bake for 10 to 15 minutes in the preheated oven. Cookies should be light brown. Cool on wire racks."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "This mix won't fit in a quart jar. But the mistake is delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We made these for pur couples Christmas fellowship and we added the ingredients needed ... it was a loy of fun and they tasted delicious 😋 All the dry ingredients fit in the masson jar if you follow the instructions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allgoodie"
},
"reviewBody": "I haven't made it (I prepared it as a gift) - but IT WOULDN'T FIT INTO THE JAR. There is no way that quantity of dry ingredients is going to go into a quart Mason jar. (And it didn't. Simple math.) I packaged it in a Ziploc, and added a smaller Ziploc of topping mix, and a plastic tub containing the eggs and butter, and left it in the workplace fridge (in a cute gift bag) for my Secret Santa. I agree with the reviewer who said the other ingredients should be included if it's a gift (if possible). Hope it tastes good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila"
},
"reviewBody": "Yum! I made a batch before we started to mass produce the jars... and boy were they good! I even made them vegan with egg replacer and earth balance - and you would have never known! So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Stevens"
},
"reviewBody": "super simple and super yummy always a party favorite :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buckeyesgrl25"
},
"reviewBody": "We made these as half of our wedding favors (other half were chocolate chip). Everyone raved about how good they were!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aroura86"
},
"reviewBody": "i tried to do the friendly kitchen view to see how many this serves but when i click on it takes me to another page that has a lasagna on it how many does this serve"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smiller"
},
"reviewBody": "Simple &amp; was a great gift for church family &amp; visitors!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wiac"
},
"reviewBody": "I would add the cinnamon spice to the jar I don't see any reason not too. www.diabeticsnacker.com/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen Voshell Hall"
},
"reviewBody": "YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tiger Didi"
},
"reviewBody": "sorry, but this is a time saver - it makes no sense to me. Why put the dry mix in a jar? Is this a gift without eggs &amp; butter? why not just make the cookies and put the recipe in your box? I'm sure people would love to get the cookies made, not a jar of dry nothing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perkywarrior"
},
"reviewBody": "Best snickerdoodle recipe I've found. I was on a search for the perfect recipe and had tried many when I found this. Whenever I share them with friends they ask for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debra Marie Sweet Pea"
},
"reviewBody": "Yummy! I was able to make 54 cookies by making 1 inch balls as the recipe stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "simplicity"
},
"reviewBody": "I love snickerdoodle cookies, so it wasn't hard to win me over. This is definitely my give away gifts this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ally"
},
"reviewBody": "Great! I gave this to my friend for Hanukkah and she made them and brought them over and they were so great! Def make this for someone you love!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JERI"
},
"reviewBody": "I made massive amounts of this mix for Christmas and it was loved by all. Instead of a jar, I used a heavy duty freezer zip lock and labeled them \"Snickerdoodles in a Bag\". It was cheaper and very popular, will do it again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria Valdez Naranjo"
},
"reviewBody": "I am not a Snickerdoodle cookie addict - I love to have chocolate in my cookies - but this is a delicous cookie! I made it with butter flavored shortening since I was low on butter and they came out perfect - a bit crisp on the outside - but chewy in the middle. I also added 1 tsp. vanilla - just something I do with every cookie recipe. One thing I do with my sugar cookies is add 1 tsp vanilla/1/2 tsp orange flavor and I bet that would work with this cookie also - just a a bit of a change. These are now being made as 'cookie in a bag' to give out during the holidays. Right now they're adorable with Fall/Halloween decorations on the bag with the recipe on the back of the bag. Thanks for a great cookie! Makes about 4 doz or so, plenty for our family...so on day three I can tell you that they were still nice, fresh and chewy. The last two will be gone after I make my coffee this a.m.!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALL6"
},
"reviewBody": "Made for teacher appreciation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rica D"
},
"reviewBody": "I made a few of these and gave them as gift's for mother's day. They were alright (the finished product), they could have been better...but for someone who cooks all the time I really suck at measuring dry ingredients! So, it very well could have been my fault. Everyone else seemed to love the cookies though, so maybe it was just me! I still gave it 5 stars because the recipients of the gifts loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pwheeler"
},
"reviewBody": "I gave this as a Christmas gift and it was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JeannieSue"
},
"reviewBody": "Best snickerdoodle recipe ever! Dont overcook, keep a watch since oven temps vary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~Andrea~"
},
"reviewBody": "I thought this was the greatest idea for a holiday present. I made about 6 jars worth of mix for my coworkers and it turned out to be a big hit. I'll definitely do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jordan"
},
"reviewBody": "I made these to add to my goodie baskets for christmas. I thought it was odd to give a gift of cookies in a jar when you had to add the cinnamon and sugar from your own pantry. I didn't feel right giving almost all of the ingredients. I put the 1/2 cup of sugar and 1 tablespoon of cinnamon in colored cling wrap and tied it with a bow. I had room to put it inside my jar as I had extra room, but if you didn't you could tie it to the jar. Overall it turned out to be a nice gift"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CALLIELUVS2COOK"
},
"reviewBody": "MMMMM sounds like a great gift. One year my sister did that for my mom and it was gingerbread coookies"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHMANESSA8"
},
"reviewBody": "These got rave reviews as Christmas gifts. Everyone said they were some of the best snickerdoodles they've ever had. I also enjoyed making these... they are about 100x faster and easier to prepare than the layered cookie jars. With pretty ribbon and fabric it doesn't matter that they don't have the layered look! Something different is always a nice change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "1/21/08\nI was making this for a silent auction. Thought that I had better see how good they are. Most excellent! The kids loved them and said they were better than the ones at the local grocery store. We are at a higher elevation so I did add 1-2 tablespoons of water to help the dough stick togther. It worked out really good! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StyxAndStones"
},
"reviewBody": "Bought some cute xmas decorated asian style take-out boxes and was perusing recipes for xmas gifts. I saw the snickerdoodle recipe, thought I'd make it first before giving out the mix, \nOH MY!\nThese have got to be the best cookies i've had in a long time, yes, as someone said, and even my starbucks-employed son agreed, these are better than starbucks snickerdoodles. I only made minor changes, I used whole wheat flour, pressed slightly on the cookie before baking and baked at 300 for 15 min..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I haven't tried the recipe, but it worked well in the jar and I'm looking forward to giving it as a Christmas present."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy795"
},
"reviewBody": "Wow! I haven't made cookies in a long time and made these tonight. They are so easy and turned out awesome. I forgot how much I loved these cookies as a kid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BRENNALUET"
},
"reviewBody": "Very good recipe. I gave the jar mixes as gifts, everyone loved them! I use the recipe to make cookies without the jar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sugamama"
},
"reviewBody": "This was really good. Even though eveyone said Snickerdoodles were not their favorite cookie, they were the first type of cookies to be gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pb"
},
"reviewBody": "tastes amazing as they come out of the oven, but way too hard and crunchy the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shayna"
},
"reviewBody": "great all the way around!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Butterfly Flutterby"
},
"reviewBody": "Very happy to have found this recipe, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurie"
},
"reviewBody": "These were perfect, just as everyone said they would be!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "Excellent! Definately like the addition of the 1 tsp vanilla and then the nutmeg with the cinnamon and sugar. My husband said these were perfect! Oh, and with the crumbling and sticking to the pan, I just sprayed some Pam and had NO problems at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARYSTEVE"
},
"reviewBody": "Fantastic! Thanks Diane. Made these for the usually finicky grandkids and they gobbled them up quickly! I bake all cookies on parchment to prevent the sticking another reviewer mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DWC1023"
},
"reviewBody": "This is the best snickerdoodle recipe I've ever tried. While pregnant with my son, I used to crave snickerdoodles, and would purchase these from Starbucks with a hot chocolate. These are by far the closest recipe I've come across that is not only the same consistency, taste and texture, but also looks just like them. \r\n\r\nToo good to put in a jar - this has become the only recipe for this type of cookie in my house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Geri Miller Gossard"
},
"reviewBody": "the recipe and the cookie were very good. I did have to add an extra bit of flour each time I make them. Very quick and easy for any of my kids to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were the ultimate snickerdoodles! I didn't do the jar thing, and they were just perfect and chewy, great with a glass of milk. I did add a tablespoon of vanilla and they were yummy- gone in one night!\r\n\r\nOk- its like two months later and I'm making them tonight again!!! lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Sorry, this one just didn't work for me. I am so glad I tried this recipe first for two reasons. 1. The bottoms of the cookies stuck to the cookie sheet and were very messy and crumbly. 2. The presentation in the jar is not very attractive to give as a gift. People would at first wonder why you are giving them a jar of flour, which is what it looks like with the all-white mixture. I will stick to the pretty mixtures where the colors vary."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! I changed a few items, added vanilla extract (1 tsp.) &amp; substituted cake flour (must add 5 tablespoons to 2 &amp; 3/4 cups) &amp; used shortening rather than butter. The result was more of a cake-like texture &amp; less crispiness which is how my family enjoys it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judi Leaming"
},
"reviewBody": "Outstanding ... especially when I added 1 tablespoon (YES ... tablespoon!) of pure vanilla extract with the butter and eggs. YUM ... made 5 dozen ... cookies will spread slightly so leave space between them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is absolutely THE best snickerdoodle cookie recipe that I have EVER had!!!! I don't do the jar thing so I can just make them right away because they're SO good!! If you flatten them until they're like really thick pancakes, then they're perfectly crispy all over but not hard when they're done baking. I've made double batches and have them disappear in one day!! The recipe is absolutely fabulous and perfect for anyone who knows a great cookie when they taste one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debby Allen"
},
"reviewBody": "Fabulous and easy cookie mix in a jar that makes a great holiday gift. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRISTIA"
},
"reviewBody": "These are great! I havent done the jar thing, but these are, nonetheless, amazing cookies! My family and friends go crazy for them! they're good with a lil vanilla, but as good without. Perfect snack with milk! mmmm...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANN7258"
},
"reviewBody": "Great cookie recipe...a nice change from my family favorite of chocolate chip. And to make it really good, it is next to impossible to over-cook these cookies! I forgot to time them and they were in there a good deal longer than 10 minutes, but they were still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I dont think I would normally rate a full 5 stars on something but this got a perfect on all of them! Its very easy to mix together as it does not get so hard like most cookie doughs and it doesnt require refridgeration. Its delicious with that authentic Snickerdoodle taste (much better than starbucks!). Theres virtually no baking time limit (8-16 minutes) as it does not burn easily. Very kid friendly. I would have loved rolling the dough into balls like playdough and rolling it in the cinnamonsugar. This would make an awesome cookie in a jar gift as it requires VERY little extra items. The cinnamon sugar can be packaged into smaller jelly jars that can be bought in supermarkets. I loved the cookies and everyone loved them. Not to sweet with the perfect snickerdoodle tang."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCHWANLADY"
},
"reviewBody": "My favorite cookie in one convenient mix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Correia"
},
"reviewBody": "This is the best and easiest I have found! Gave it as Christmas presents and they all loved it! THanks again for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a dozen of these at Christmas. Easy to make and everyone loved them. Best I've found for cookies in a jar recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Definitely the easiest of jar mixes to make - and the results are great! Our 3 dozen were gone in less than 24 hours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was by far the easiest receipe I've used. My sons loved makeing them and eating them. We gave them for Holiday gifts. This was the easiest jar I made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this cookie in a jar recipe. It made the best snickerdoodle cookies and they were very easy to do. I quit baking a long time ago because of the hassle of measuring and not have the ingredients, like cream of tartar, I needed to make the cookie I wanted. Now I make several jars up and everything is handy to make a quick treat without the hassle. This one is my favorite so far."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11597/snickerdoodle-mix-in-a-jar/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16420/desserts/cookies/snickerdoodles/",
"name": "Snickerdoodle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11597/snickerdoodle-mix-in-a-jar/",
"name": "Snickerdoodle Mix in a Jar"
}
}
]
}
}
, "about": [
]
}
]