				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Soft Gingerbread Cookies"
,"datePublished": "2000-01-31T19:45:02.000-05:00"
,"dateModified": "2022-09-16T05:23:12.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sara"
,"url": "https://www.allrecipes.com/cook/1744"
}
]
,"description": "This gingerbread cookie recipe is easy to make with molasses, brown sugar, ginger, allspice, cloves, and cinnamon for fun cut-out holiday cookies!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zoCorZFUCVNGqvHBUSMltEwBo-Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8821130-6e910ad52580488aa76be1c076e24776.jpg",
"height": 1241,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Soft Gingerbread Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.8",
"ratingCount": "241"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "75 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "2 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "43 mg"
,"sugarContent": "6 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"3.25 cups all-purpose flour",
"1 teaspoon baking soda",
"1 teaspoon ground ginger",
"0.5 teaspoon ground allspice",
"0.5 teaspoon ground cloves",
"0.5 teaspoon ground cinnamon",
"0.75 cup molasses",
"0.33333298563957 cup packed brown sugar",
"0.33333298563957 cup water",
"0.125 cup butter, softened" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Sift flour, baking soda, ginger, allspice, cloves, and cinnamon into a bowl."
} ,{
"@type": "HowToStep"
,"text": "Beat molasses, brown sugar, water, and butter in a separate bowl with an electric mixer on medium speed until smooth; stir in flour mixture; mix until a sticky dough forms, about 2 minutes. Wrap dough in plastic wrap and chill for 3 hours."
} ,{
"@type": "HowToStep"
,"text": "When ready to bake, preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Roll out dough on a floured surface to a thickness of 1/4 inch. Cut dough into desired shapes with holiday cookie cutters, dipping the cutters into flour as needed so they don&#39;t stick to the dough. Transfer gingerbread cookies to ungreased cookie sheets, spacing them 1 inch apart."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until firm, about 8 to 10 minutes. Cool on the baking sheets briefly before transferring them to a wire rack to cool completely."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT220M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PamelaDawn"
},
"reviewBody": "We have never made gingerbread cookies. Cookies have been a big part of our Christmas every year since the kids were little. We LOVED this recipe. The dough was sticky and we literally just mixed it up with our hands at the end. We chilled it and had no issues rolling it out. The cookies were just perfect! We made a cream cheese icing and everyone loved them. I put them in Tupperware and threw in a piece of bread (my mom always did this) and they remained soft and delicious! I know other reviews suggest changing the recipe, but we did not need to. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany Smeal Harrison"
},
"reviewBody": "This is the ONLY recipe I'll use!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Laelia Sinden"
},
"reviewBody": "I added 3 tablespoons of ginger powder plus fresh ginger and they still aren't tasty and spicy enough for me. If you follow the actual recipe you will have the most bland cookies imaginable. They also were not sweet enough at all, so i had to add icing to mine to make them edible. I also added an egg because the amount of butter to flour ratio also seemed ridiculous. Definitely won't be making these again. Awful even with added extras"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darla Elizabeth"
},
"reviewBody": "I think the commenter who said reduce the flour by 1/4 cup was correct. I reduced the flour, chilled it over night in plastic wrap. If it gets crumbly, just wet your hands and knead it. It moistens right up. For those that didn't like it, try checking for someone whose tastes you know. If you know you like recipe A from X. Check them first. Check for their recommendations as they have the same tastes as you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mouse29"
},
"reviewBody": "Cookies were definitely soft and a hit with my kids. I substituted milk in place of the water. I think it needs just a little more flavor so next time I will try some vanilla. Other than that very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kitti68"
},
"reviewBody": "The family loved this recipe \nDefinitely adding it to our cookie tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "Cookies turned out perfect. I followed the recipe exactly and they tasted amazing. They were perfect to decorate and not too hard and not too soft. They held up very nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Beasley"
},
"reviewBody": "The rolled out great, I have a feeling those that claimed the mixture was dry, measured flour incorrectly. It rolled out easily and baked perfectly. I do think they need maybe a tad more sugar but otherwise they are pretty good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Fischer"
},
"reviewBody": "I found this printed out in my rarely used stash. It's dated 2015 which would have been when one granddaughter was 4 and I made then and she decorated them, the last time I had time to bake cookies; but this year I have time (2020). I wanted cookies my vegan daughter could eat. I used vegan \"butter\" and it calls for no eggs so perfect. I was using my stand mixer and got carried away and dumped 3 cups of flour in before I realized I was creating concrete. I added a little water a tablespoon at a time while running the mixer and worked it back to cookie dough consistency. I didn't need to refrigerate it. A cook knows you only add flour to cookie dough until it is cookie dough consistence. This is a perfect gingerbread flavor, the texture is soft and bread like but holds to gather well. I search for it to add to favorites and rate and it came up first!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tina Marie Derrick"
},
"reviewBody": "I made these and my dough was super sticky so it was pretty hard to get the shapes up off the table I had to use extra flour on the surface so the dough wouldn't stick to the table besides adding more flour to the dough itself. Does not have much flavor, you taste more of the molasses than you do the spices. If I decide to use this recipe again I will definitely be making some alterations to it. If anyone plans on making these definitely double or even triple the spices it calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Kolb Romack"
},
"reviewBody": "This was a very good recipe. My kids won't eat gingerbread because most recipes are too harsh and crispy for their tastes. I love a soft gingerbread cookie! One thing I learned was to roll out the dough before refrigerating the full 3/hours. I refrigerated the dough for an hour, rolled out on parchment paper, then refrigerated the rolled out dough for another 2 hours. I divided the dough into two parts also. To avoid the issue of them falling apart I used the small cookie cutters, that way everyone can eat all the different cookies i make during the holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chauffeur"
},
"reviewBody": "Love this cookie recipe even tho I did change the ingredients a bit though. I added a cup of flour, ½ tspn salt and one egg. Also only put the allspice, cinnamon and ground cloves and ½ tspn vanilla. Great texture and flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Lowe"
},
"reviewBody": "Crispy on the edges but soft in the middle! Just the way I like it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Robyn Danius"
},
"reviewBody": "If you are expecting an easy bake as an intermediate home Baker, immediately go search for a new recipe. If you follow this recipe and reduce the flour it still turns out a dense pasty bake. I make macrons from scratch, ginger bread is not rocket science and mine turned out horrible. If I were to make this again, no more than 1 cup of flour and I definitely won't chill the dough. Then maybe the extra flour used for rolling would make sense. Honestly go find a better recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "arden"
},
"reviewBody": "I will definitely make these cookies again! My 4 year granddaughter and I had no trouble and they were soft easy to chew and not too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cassie The Critic"
},
"reviewBody": "I want to begin by saying that I am an avid baker. These cookies were very disappointing to me however. I decided to give it a try despite the numerous bad reviews, but I regret this. The cookies are very soft which is about the only positive thing I can say about them. They are so bland and have almost no flavor. I would recommend looking for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Samantha Fuller"
},
"reviewBody": "I just made them and they turned out perfectly. Even the smaller/thinner cookie cutter designs came out perfectly and moist!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Atkinson"
},
"reviewBody": "I love a soft, chewy gingerbread cookie and this one is a big hit for me and my toddler!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerrica Weller"
},
"reviewBody": "GREAT RECIPE! I make gingerbread cookies every year for the family to decorate and i found this one 4 years ago and have used it ever since. I love the soft texture and warmth of the spices. You could sub out gingerbread spice since it is all of the spices mixed together. It only slightly changes the flavor because you lose the control of the amounts you add...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I found the dough was too dry and hard to roll. Wonder what I should have added?????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingmamaof2"
},
"reviewBody": "i have been making them for 4 years now and it is the only gingerbread i will use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMYK"
},
"reviewBody": "I whipped up the dough this evening, will bake tomorrow. So far, those who have complained about an unsweet, unflavorful or dry dough had to have done something wrong. Mine is very moist and DEFINITELY sweet enough and tastes just like a gingerbread cookie should. I laid out a long piece of plastic wrap on my counter, put half of the dough on it in a \"fat log\" folded the plastic on top of it and rolled the dough into an oval/rectangle into the appx thickness I want. The plastic wrap easily peeled off if I did it slowly, so I am sure I won't have a problem when it is cold. Looking forward to cutting and baking tomorrow and leaving a baking rating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SAMUEL WHITLOCK"
},
"reviewBody": "I made them and liked them, even though I don't like cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leeno Marashi"
},
"reviewBody": "This gingerbread cookie recipe was very easy to prepare, i only cooled it in the fridge for two hours, and the dough was very easy to role out and work with, even my 4 year old son was able to role it out for me sprinkle little of flour and cut out fun shapes.\nI would recommend to double check the type of flour used, mine was succesfull, all purpose flour.\n\nGood luck to you, i already advised this recipe to my baking siblings..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni Bacchitta"
},
"reviewBody": "Ok, made these today and learned a few things. I don't like using parchment or plastic wrap with these; the dough is still too sticky. I just used flour as needed. \n\nI like the mild flavor; I don't need to be knocked off my feet with overwhelming spice. \n\nYou MAY want to reduce cooking time a smidge and roll the dough a smidge thicker than called for, to help for a softer cookie. I have some I know I rolled too thin, so they will be crunchy cookies. Still, the taste is appealing, so even crunchy they'll be good with a glass of milk. \n\nI think they're fine. Personally, I don't think they'll win awards for a gourmet cookie. but they are a tasty cookie just the same. May try a different recipe next time to compare results, but these will do for my Christmas table for this year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Elaine Feldman"
},
"reviewBody": "This was absolutely awful. It was too dry and impossible to roll out. Why is there 3 cups of flour?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lesli"
},
"reviewBody": "Not a fan of this recipes. When I mixed the wet and dry ingredients together, the dough was so dry it was unusable!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KrisinDC"
},
"reviewBody": "I thought these were fine. Not as sweet as some gingerbread cookies but certainly soft and good gingerbread flavor. As with any cut out cookie it is very important to chill the dough. That is key. I did use a bit of flour each time I rolled out some dough. The dough would be too sticky without that. I made a simple vanilla icing with butter and a bit of milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samuel Zimmerman"
},
"reviewBody": "I'm a pastry chef and i made this recipe a few times, the secret is roll out dough on Parchment Paper to avoid sticking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nickea"
},
"reviewBody": "Must have done something wrong. The dough was crumbling and couldn't be rolled out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "luckyphish"
},
"reviewBody": "These did not come out soft and didn't have great flavor. They weren't terrible, but I will continue to hunt for the \"perfect\" gingerbread recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blamdarot"
},
"reviewBody": "I didn't have allspice, so I added a little extra cinnamon and cloves and a pinch of nutmeg.\n\nCookies are fantastic! Dough was easy to roll out with the floured surface. They stayed soft after baking. The flavor could be stronger, but they are super delicious. And, thankfully, not too sweet. Gingerbread should not be super sweet! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Speranzioso"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Peterson"
},
"reviewBody": "This is the best gingerbread recipe I have ever made! Yummy..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessi Payne"
},
"reviewBody": "These cookies turned out perfectly soft and delicious! They even held their shape while baking! Definitely making them part of our Christmas tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Linda Wills"
},
"reviewBody": "they are dry you cant roll or shape them so i cooked them as a bar and still are tastless . this recipe should be removed they ruined an afternoon with my grandsons"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Naomi"
},
"reviewBody": "Won't make again. Too dry and crumbly and tast d like cardboard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Libby Cervantes"
},
"reviewBody": "Dough was too dry as written. I doubled the water &amp; added another 1/4 cup of butter. Tasted great &amp; fund to decorate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Peter8G8"
},
"reviewBody": "I made these cookies today, and the are by far the worst cookies ever. They should be called dry salty molasses cookies. I thought it was odd to have that much molasses in this recipe, is it an error? Save yourself the effort to roll it out, click next when you see this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Penny Yen"
},
"reviewBody": "I made a few changes to this recipe: \n1) used Snow White lard rather than butter as butter is wicked expensive\n2) used almost 90% molasses and the remainder was honey\n\nThe cookies that came out of my over were soft and chewy and have become my very favourite cookie as I love soft and chewy! However; I was not aiming for just soft and chewy, I wanted that spice flavour and more of the warm scent from the cloves and cinnamon to come through the cookie. This cookie is just a cookie. Nothing really gingerbread tasting to me. \n\nWhen I make this cookie again, I will be doubling the values for the ginger, cinnamon, clove and all spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EALTSON"
},
"reviewBody": "This is a very good gingerbread dough recipe. These are *not* 'ginger cookies'. If you are expecting a stand-alone cookie (unfrosted), you will be disappointed. These make a great base for typical frosted Christmas gingerbread cookies or houses, but they need that frosting as they are really a molasses cookie. It's worth using blackstrap molasses and dark brown sugar, and they do puff slightly, so roll them no more than 1/4in (or even 3/16) if you plan to do any flood frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kovarr"
},
"reviewBody": "I enjoyed these cookies, but the next time I make them I'll add a little more of the cloves and ginger, and make sure they're kept in an airtight container as they can dry out very quickly. Will be making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Crumbled and hard to roll out. Im not much of a cook so follow directions exactly. Didn't turn out for me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather in AZ"
},
"reviewBody": "Good cookie! But I did add more brown sugar and more spices. I didn't measure when I added more, just eyeballed. My main comment would be that this makes a small amount of dough. If you need to bake a lot of cookies to share with family coming over for Christmas or to give away to neighbors you need to double the recipe maybe? Just my thoughts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carissa Scripp"
},
"reviewBody": "Ok one the amount of flour the you list needs to be fixed instead of saying 3 1/4 cups of flour just say 3/4 cup of flour and instead of 1/8 of cup of butter just say 2 tablespoons a lot easier to read, because I wasted almost all of my molasses and alot of ingredients as well. Plus for some reason this did not make that much like it's suppose to I was expecting more but only got like a dozen and a half so kinda disappointed there. Plus I had to grease my cookie sheets to be able to get them off of them without a struggle. I think next year I will find a different recipe to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AmandaS"
},
"reviewBody": "The dough was crumbling and hard to roll let alone cut shapes. Stuck it all back in the bowl and added 1/2 cup of sugar and a little bit of water and two more table spoons of butter as other had suggested and the dough turned out way better and easier to work with. It also tasted great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "James Smith"
},
"reviewBody": "It's ok, but needs to be tweaked a bit. They came out fairly bland. I'd throw in more ginger, cinnomon, and a bit of salt if I ever make it again. The cookies came out hard around the edges. They probably need to be in the oven a little less than 8 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark O"
},
"reviewBody": "Great for making a gingerbread house or other cut outs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vhether"
},
"reviewBody": "The dough was crumbly and dry- it wouldn't mix all the way. Once I remedied that, I baked them just as cookies- not rolling them out or using cutters. The outside texture was crispy and crumbly looking- the inside was moist and soft. The taste was okay- not the best in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carolyn"
},
"reviewBody": "Dough was very crumbly wouldn't pack at all. I added equal parts of molasses and water to the dough until it would and baked without fridge time. They baked well and have a wonderful flavor but are to fussy to make a second time ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Annillée"
},
"reviewBody": "I had to make too many changes to get the desired product. Good base recipe, definitely flexible, but also quite lacking (especially if you're in the market for a spicier cookie). \n\nA lot of the issues that people are experiencing can be remedied with some baking savvy: to avoid getting crumbly or sandy cookies, cream the butter and sugar together before adding the other wet ingredients; gradually incorporate the dry ingredients in small amounts; wrap the cookie dough in clear plastic wrap and let it rest in the fridge for at least 1-2 hours and work with it later; depending on the size of the cookies, shave 1-2 (or more) minutes off of the baking time for a softer, chewier cookie. \n\n(And I suggest adding much more ginger and cinnamon; I love a spicier cookie, so I just eyeball the amounts of spices I throw in there.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Stritama Sherreitt"
},
"reviewBody": "Just made these today for my daughter's cookie bags She didn't think they tasted like anything :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Disa"
},
"reviewBody": "Dry, dry, dry. Tastes like sand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Desiree Dottolo"
},
"reviewBody": "Only I could take a recipe everyone else says was dry and crumbling and have the exact opposite result! I did double the spices like others suggested. Also I was just short of the ¾ cup molasses so I added buckwheat honey to make up the difference (maybe 3tbsp). I don't know if that made the difference but the dough ended up being perfect for my cookie press. I'm waiting for them to cool now and then I'm going to drizzle them with an orange juice and powdered sugar glaze. They are about the consistency of brownie bites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Cox"
},
"reviewBody": "The recipe says to- leave the dough in a bowl to chill for 3+ hours, it became cement! Special thanks to \"SUGARPLUMSCOOKIES\" for offering the wax paper trick and it doesn't hurt to lightly flour each side too! Next time I'll have the frosting ready. I picked scottie dogs, tree &amp; heart for my brand of holiday cheer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jgragg"
},
"reviewBody": "Perhaps an altitude issue, but my cookies turned out quite floury."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Maria"
},
"reviewBody": "I normally read reviews before trying a new recipe.... oops! Really bad tasting cookies. I make gingerbread cookies every year with my 3 kids and they all agreed... no taste, not sweet and bad consistency. Funny faces as they tried them. I'll go back to my old recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Jo"
},
"reviewBody": "This is an excellent recipe! Personally, I don't use a cookie cutter. I simply roll some dough into a ball, roll it in sugar, place on a cookie sheet and press my thumb into the center. Wonderful molasses cookies. \nAlso...If you place the warm cookies in an air tight container, they will not get hard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "I love this recipe! My Gingerbread cookies came out awesome! They are very soft and has great flavor! I recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laura Estep"
},
"reviewBody": "The dough comes out dry and crumbly. I have added 1/3 cup more water and 1/3 cup more molasses and I'm hoping I can save the batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason W"
},
"reviewBody": "I couldn't understand all the bad reviews on this. I made them for the first time for this Christmas and they where just awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Athena Jesse Castellano"
},
"reviewBody": "This recipe is easy and even the raw dough is yummy...I don't understand how it could fail...it's my new go to ginger cookie !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Haley Beech"
},
"reviewBody": "Dough turned out very crumbly and dry, as some reviews said. I tried baking them and they turned out lumpy and just not good. Won't be using this recipe again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathycooks"
},
"reviewBody": "I have made this recipe several times. My grandkids love it! Everyone that has tasted them is amazed at the great taste and softness of the cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "This is a great recipe. It yielded about 50 small gingerbread men. I used oil instead of butter for a vegan recipe. It was quite a hit. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pen Tolman"
},
"reviewBody": "I was looking for a soft gingerbread man cookie recipe and decided to go with this even though some had given it poor ratings. Taking these low ratings into consideration, I made these cookies exactly as indicated using leveled measurements on the ingredients. The flavor and sweetness level were mild but not bland--actually--just perfect for my taste buds, epecially since the icing would kick the sugar rush another notch. The important element for me was SOFT and I certainly got that. It was a beautiful thing. Know that I am not an \"expert\" baker/cook and I have a habit of altering recipes so I was glad when I stuck to the recipe on this one and the instructions were not complicated. I found it much easier, as others had recommended, to roll it in between two sheets of parchment paper. I also cut the shapes in place, so I just removed the excess dough and rolled out a new ball. As for time, I have a convection oven and it came out perfectly at 6 minutes on convec bake at my elevation of 6200 ft abve sea level. I will definitely use this agiain!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "rebecca sch"
},
"reviewBody": "Tthe taste was weird but most of all the texture was weird it was like rubber."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cat Gray"
},
"reviewBody": "Tried this particular recipe and not impressed. Dry and hard to work with. Ive made gingerbread many times and had better luck with other recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ella Jean"
},
"reviewBody": "This is the first time I made gingerbread cookies. This recipe is SUPER easy and taste great. Follow the recipe exactly and your cookies will be a hit at your next holiday function."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nina Ung Schonacher"
},
"reviewBody": "They don't have flavor and the texture is soft but too dry and crumbly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "katnat1310"
},
"reviewBody": "I did not care for this recipe. I am a baker and I followed the recipe to a tee. I was looking for a chewy cookie, unlike the ones I have made in years gone by. Dough was hard to roll, stiff, not pliable at all. Not sure what happened….all ingredients were fresh as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JenniferA"
},
"reviewBody": "This recipe is pretty good. They do come out soft. Don't over cook or they do get stiff and stale like. It a was very kneadable dough. The finished product I think needs a bit more butter and spices in taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dawnrushton"
},
"reviewBody": "I followed this recipe to a T but I left them in the fridge overnight and brought them out in the morning. I didn't try to roll them out for several hours and when I did, I didn't use ANY flour. They rolled out perfectly!!!!! I would definitely make these again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "COOKIEMONSTER"
},
"reviewBody": "I dislike this recipe because this was to dry so i had to add water to it then egg and last more flour and water! I just cant eat anymore of it and it hard after letting it cool!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TerriL"
},
"reviewBody": "These are the driest, most flavorless gingerbread cookies ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg"
},
"reviewBody": "This is a great recipe! This is the second year in a row I'm using it. If you want them to be soft, make sure not to roll your dough too thin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Porsha8390"
},
"reviewBody": "Trying this recipe.... Let it chill for 24 hrs because 3 hrs did nothing, but 24 hrs didn't do jack either. This is almost like soup and I followed the recipe EXACTLY! I bake all the time and never had problems like this. Itheres no way I can roll this dough out, I'd be lucky to be able to make drop cookies!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Austin"
},
"reviewBody": "These gingerbread cookies were kid friendly, tasted good, and were definitely soft - they didn't get crunchy Yay! I just had to find my own frosting recipe. They are not strong flavored, so those of you who don't want a spicy cookie these are great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolinateacher"
},
"reviewBody": "This is the best basic soft gingerbread recipe out there. Very simple directions, I refrigerate my dough about 2 hours and it works better. I also like a stronger ginger/spice flavor, so I add more ginger and cloves to the recipe and it helps as this one is very mild made according to the recipe. I love this recipe though and so do everyone I make them for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie B."
},
"reviewBody": "I've been looking for a new recipe to try this Fall and my husband has been on my case about trying Gingerbread this year. I have never made it until last night. These cookies are to die for. I did change the recipe a little. When mixing the dough, I added 1 or 2 tablespoon of water to make the dough softer and easier to roll, I also adjusted the flour. I took the 1/4 cup out and just used 3 cups. They didn't taste floury at all and they were soft and didn't break easily either. This'll be my come to Fall recipe for now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "littlemissmuffin"
},
"reviewBody": "They were soft as the title suggested but I was disappointed in the flavor. I won't make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HJack"
},
"reviewBody": "Great recipe! I didn't alter a thing and enjoyed the mild flavor of the cookies. Add a bit of royal icing as decoration and you'll have all the sweetness you need. The dough will be crumbly. Just be firm with it! Get your hands in there, use plenty of flour on your work surface, and roll until smooth. The cookies still had their softness on day 4, which is a win in my book!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Pony"
},
"reviewBody": "These did not work out! I had to add about 1/2 cup more water to the dough to make it stick together, and when I baked them (for 8 min.) they all got huge! Since they were so big they weren't done in the middle, so they didn't taste very good. They may have turned out better if I had baked them longer, but I would not make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lettb"
},
"reviewBody": "I've made this a few times, it is delicious and fairly easy to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia"
},
"reviewBody": "I tried this recipient last year, and it was extremely crumbly and dry, but I gave it another shot today and they turned out perfectly after adjusting a few things. Instead of 1/2 cup of white flour, I used whole wheat flour and I used 1/2 c. Brown sugar and 1/2 c. Sugar to make it a different kind if sweet. I also doubled all of the spices except the cloves and used 3/4 c. of molasses. The cookies turned out terrific! My family thought they were amazing, I wish I could have taken credit for the recipe. You just need to roll out the dough in between max paper or plastic wrap before chilling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "moum_wd"
},
"reviewBody": "I consider this recipe for healthy low fat cookies but I don't think I will come back to this one anytime soon.\n\nI doubled the butter and added oil to the dough. The cookies were soft when oven fresh but became hard to chew on after cooling. My dad can only eat the cookie w/ a warm glass of milk to soften it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "egyptguy"
},
"reviewBody": "Great recipe! Came out well this Christmas. I varied the thickness and cooking times a bit, which resulted in a good mix of thin and thick, softer and crispier, cookies. Would definitely recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Little"
},
"reviewBody": "These r the best gingerbread cookies i have ever had. And its so easy too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Honey"
},
"reviewBody": "I wanted to make my own gingerbread cookies along with my kids and I like them \"soft\". So came across this recipe! \r\n\r\nI did follow the directions, except for the chilling part. It was late in the evening when I started the preparing the dough. And after the dough was complete...It seemed a bit wet to be dough. So then not reading #3 in the directions before starting. I realized I had to chill it for a few hours. \r\n\r\nHoping that after chilling it, It would firm up more, but the next day the consistency was the same. \r\nI don't know if chilling it longer then what the recipe called for had an effect. But I ended up adding more flour (wheat) that is. Also don't know if using the wheat flour made a difference either.\r\n\r\nAnyway I added the wheat flour to it. Would say a cup more and then rolled it out. I thought if they don't come out, then oh well. At least the kids got to decorate..lol \r\n\r\nBy my surprise!!! These cookies came out awesome! I was really impressed. I was so concerned that they would taste like nothing but flour. Well they did NOT! They were soft, just as the recipe says! and yummy! I will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nate78526"
},
"reviewBody": "The worst cookie recipe I have ever made.\r\n1/8 cup of butter is a bad idea. A scant 2 tablespoons of butter makes a dry crumbly mess. I added some moisture to get the crumbs to hold together. I used apple juice. I do not recommend this recipe at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkwok"
},
"reviewBody": "completely satisfied!!! much better than another one I used before!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marisol Marin"
},
"reviewBody": "i had my doubts ... i been re-searching for a good gingerbread cookies recipe but this recipe came out perfectly ... followed the recipe step by step and i did let the dough sit for overnight... my family and friends loved them.. i'm so ready for xmass.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Renea"
},
"reviewBody": "My husband thought this was the recipe he used last year, well he was mistaken!! I usually try to be nice with criticism, but I did not care for the taste of these. They make easy, perfect cutouts, but the flavor is just not there! Researched and remembered he had made the McCormick spice recipe last year and they are great tasting. A gingerbread cookie should be able to be eaten with or without icing as I enjoy and this recipe really have no sweetness. Great for decorating the tree LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stetsonj"
},
"reviewBody": "My cookies turned out perfect! The dough was dry at first, but it was perfectly moist after it chilled for the three hours. This is a great recipe! I will be using it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IronSauce"
},
"reviewBody": "I made these recently due to a sudden gingerbread craving. Rather than let them cool and then roll the dough out, I dropped tablespoon sized blobs of dough onto a tin-foil lined baking sheet and baked them straight away. If done like that, they finish baking with soft, almost cakey quality to them. Simply fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Alsmom418"
},
"reviewBody": "Either the recipe is wrong (1/8C of butter for 3 1/4C flour??) or it is meant to make decorative, not edible gingerbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeatherBoyd"
},
"reviewBody": "First time making Gingerbread cookies! They were great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KimmyBel"
},
"reviewBody": "This was a GREAT recipe and easy to follow, which we followed as written. The spices were yummy and it tastes just like gingerbread cookies should taste! The dough was sticky so use flour liberally when rolling them out, that helped a lot. We plan on making them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmhubschmitt"
},
"reviewBody": "I loved it! But I made a spicy glaze for it... everyone raved about it and it was the first time I din't have any left over cookies."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15293/soft-gingerbread-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
"name": "Gingerbread Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15293/soft-gingerbread-cookies/",
"name": "Soft Gingerbread Cookies"
}
}
]
}
}
, "about": [
]
}
]