				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sopapilla Cheesecake Pie"
,"datePublished": "2020-06-18T23:36:27.000-04:00"
,"dateModified": "2023-02-28T11:05:10.049-05:00"
,"author": [
{"@type": "Person"
,"name": "CandelB"
,"url": "https://www.allrecipes.com/cook/2977158"
}
]
,"description": "Sopapilla cheesecake, made with layers of flaky crescent dough, sweet cream cheese, and crunchy cinnamon sugar is a deliciously easy Mexican dessert."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/K-JgYMxUjrG-mPhFXyQek-1-XgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/453301-sopapilla-cheesecake-pie-Melissa-Goff-1x1-1-a700db5bbc094df283da0da5f727c167.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1799678395001",
"description": "Easy to make, this yummy dessert always gets raves.",
"duration": "PT2M50S",
"name": "Sopapilla Cheesecake Pie",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/44a12c3b-c85d-4260-a5ec-a64c4039a15d/86b86324-982b-408f-b75b-8c36c37e4a2e/1280x720/match/image.jpg",
"uploadDate": "2023-03-13T17:06:44.506-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sopapilla Cheesecake Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "2637"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "481 kcal"
,"carbohydrateContent": "51 g"
,"cholesterolContent": "61 mg"
,"fiberContent": "0 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "459 mg"
,"sugarContent": "38 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
, "recipeCategory": ["Dessert"]
,"recipeCuisine": ["American","Spanish"]
,"recipeIngredient": [
"cooking spray",
"2 (8 ounce) packages cream cheese, softened",
"1.75 cups white sugar, divided",
"1 teaspoon Mexican vanilla extract",
"2 (8 ounce) cans refrigerated crescent rolls",
"0.5 cup butter, room temperature",
"1 teaspoon ground cinnamon",
"0.25 cup honey" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Beat cream cheese, 1 cup sugar, and vanilla extract in a bowl until smooth."
} ,{
"@type": "HowToStep"
,"text": "Unroll crescent roll dough, and use a rolling pin to shape each sheet into a 9x13-inch rectangle. Press one piece into the bottom of the prepared baking dish. Evenly spread cream cheese mixture on top, then cover with remaining piece of crescent dough."
} ,{
"@type": "HowToStep"
,"text": "Mash remaining 3/4 cup sugar, butter, and cinnamon with a fork until combined. Dot mixture over top of dough."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until crescent dough has puffed and turned golden brown, about 30 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/K-JgYMxUjrG-mPhFXyQek-1-XgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/453301-sopapilla-cheesecake-pie-Melissa-Goff-1x1-1-a700db5bbc094df283da0da5f727c167.jpg"
}
]
,"text": "Remove from the oven and drizzle with honey. Cool completely in the pan for about 2 hours before cutting into 12 squares."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT170M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sharee"
},
"reviewBody": "Easy to make, but way too sweet for our tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "Tasty but super sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mblakeley7"
},
"reviewBody": "I cut the recipe in half and used an 8x8 pan, still came out great. This is also good with fresh or canned peaches, cherries or berries, either mixed into the cream cheese or sprinkled in a layer between the cheese and second crescent roll layer. Good dessert for summer. I also made it a day ahead and refrigerated it overnight. Much easier to cut! I also beat an egg into the cream cheese for some body."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these for Christmas. They were a big hit. The family loved them. I am making them for my daughter-in-law's birthday on Sunday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn636"
},
"reviewBody": "Omg! This is the best! I really love honey, favoring a traditional sopapilla, so I sub some of the sugar for more honey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "I have never had sopapilla before. It is outstanding! My husband took a bite of it and said, \"Wow!!\" I only put a half a cup of sugar on top, and I melted the butter in the microwave first. Then I mixed the sugar and cinnamon in it and poured it over the top before I put it in the oven. I didn't have enough honey on hand to put the whole quarter cup over the top. So when it came out of the oven, I drizzled what I had over the top. It was plenty sweet and so delicious! I have a feeling this isn't going to make it into the refrigerator after our party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vicki936"
},
"reviewBody": "Made this for my step-son's birthday. He can be challenging to bake for because he does not like chocolate. In spite of this, we still allow him to remain in the family. ;) He loved it and so did we all! Followed the directions, including the bake time, precisely. Made it in my 9x13 glass Pyrex dish and it came out perfect. Covered it in foil and let it sit overnight and everyone raved over it the next day. This was super easy and super good - putting it in the holiday rotation! UPDATE Nov. 2022 - Made this for Thanksgiving. Everyone raved! Found the full-size non-perforated dough sheets at Walmart, made this even easier. Use the Mexican vanilla if you can find it - mine tastes more cinnamon-y and really accents this dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Lee Friedheim"
},
"reviewBody": "I used half a teaspoon of cinnamon and half a teaspoon of apple pie seasoning instead of the full teaspoon of cinnamon. Halfway through baking I used a spoon to spread butter cinnamon mixture around to edges as well as after baking during cooling time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "This was really delicious, my main critique is that I think it calls for way too much sugar for my tastes, especially with honey drizzled on top too. I made a half recipe of this in an 8x8 pan and it worked quite well! Next time I make this I will use less sugar (especially on top) and only about 3/4 of the filling - I found the filling layer to be a bit thick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frances Lindquist"
},
"reviewBody": "Love. Took to church everyone loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PCLA82 "
},
"reviewBody": "Edit: gave 1 extra star as it was much improved when cooled fully (next day) - made the cream cheese filling less strange in texture. I thought I’d love this, but it was way too sweet, and the cream cheese filling curdled, which made the whole thing a bit weird. Maybe the curdling happened because I ended up needing to bake it for about 20 mins longer to get a brown top (yet the bottom was still a bit soggy). I actually reduced the sugar in the cream cheese (by 1/4 cup), and I used only 1/2 cup of sugar + 1/4 cup of butter for the topping, but it was still too sweet and felt very one note…something was definitely missing. Maybe the amount of cinnamon needs to be increased to cut through the sweetness. Maybe eggs need to be added to the filling to make it more like cheesecake (as some have suggested). Maybe some pecans for more dimension and texture. Whatever the case, this is NOT a good recipe as is. I can only assume its convenience and simplicity are what make it so widely appealing. So glad I made it for just me and my hubby as it would have been embarrassing to serve it to guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Autumn Berryman"
},
"reviewBody": "Well, it's a layer of buttery dough, a cheesecakey layer, another dough layer, a cinnamon-sugar topping, and then honey to top it off. It's so many calories that it's kind of hard to go wrong. What I'm trying to say is it's absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this twice and loved it. The second time I made it I added the juice of half a lemon. Melted the butter, sugar and cinnamon and spread it over the top. Much better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SJYanik"
},
"reviewBody": "This is one of my favorite desserts. Its quick and easy to prepare and the finished product is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lashawn Williams"
},
"reviewBody": "The dough tried to kick my butt , however I’ll definitely be making this again it was a hit everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Easy and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is delish! I couldn't find my pastry brush which would've really helped with the butter pooling on top but I seemed to be able to make it work. The mods that I did were 1/2 cup honey and 1/2 cup sugar in the cream cheese mixture which was definitely worth it! I love the honey flavor - feels more like Sopapilla to me. I also added 1 egg to the cream cheese which helped stabilize the texture of the filling. I don't think I used quite a 1/2 cup of sugar for the top and I'm glad because it is VERY SWEET. Can't wait to serve this to friends tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Ratto-Bixby"
},
"reviewBody": "Loved this added Raspberry jam on top of the cream cheese filling and omg instant raspberry danish. So easy to make, these will be my new go to Thanksgiving morning breakfast. Recipe note: Made it this last time with a can of apple pie filling and chopped walnuts on top of cream cheese mixture. My new favorite way to have this. Baked it an extra 10-15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking Friend"
},
"reviewBody": "Love this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "felixlisavel"
},
"reviewBody": "Wow! Never have I ever had such a treat! Made it for a party and everyone was over the moon. Loved it. Will keep this one for sure :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Love"
},
"reviewBody": "So good! My son's melt everytime I make this. Great for attracting hugs 🤗"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Like many have said..this dessert is always a big hit at gatherings &amp; really delicious. One variation..for a lighter fluffier filling I add heavy whipping cream when I beat the cream cheese, sugar, &amp; vanilla together. I also brush the melted butter on the top crust letting it pool slightly in lower areas. Then I generously sprinkle the cinnamon (I add a bit more cinnamon than called for) sugar mix on top. DELISH!! 😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wow35girl"
},
"reviewBody": "Amazing 🤩🤩😁"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "4gmarie2011"
},
"reviewBody": "I made this first for my family and then again for the office. It was a hit both times. Little adjustments were made to the recipe and the baking time. I doubled the vanilla and cinnamon. (I used regular McCorkmick's pure vanilla extract.) The butter was cold and it worked perfectly to cut it into the cinnamon sugar mixture. It did take an hour to bake at 350, both times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aileen"
},
"reviewBody": "Delicious! Both grocery stores near me were out of crescent rolls, so I substituted flaky biscuits. I rolled them out, but they needed to be a little thinner. Taste was still amazing, just very puffy. I ended up cooking for 45 minutes because they were quite thick. I’ll be excited to try them with the correct rolls! These are really a great ALL PURPOSE dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BGNP01"
},
"reviewBody": "O to M to the G. \n\nThis was out of this world. I was smug reading reviews thinking yeah right these people are exaggerating or just haven't had a true baker experience. Oh my humble pie, i couldn't be more wrong. This was absolutely amazing. So much so that each bite was followed by an oh, and wow, and what is this? From each of the teenagers and husband. Who am I kidding, me too! No changes needed made exactly as written. I wouldn't worry about getting it to fit perfectly unless you just want to enjoy perfection perfectly. \nOff to make another batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Ungodly sweet. It tasted like a cream cheese danish, because.. thats basically what it is. I think I need to cut down on the sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shilohspiderart"
},
"reviewBody": "My family &amp; co-workers love this. One addition to try is put a fruit topping on it when served or drizzle with chocolate or caramel syrup. The fruit can be fresh or frozen (thawed) with a sugar mixture, or pie filling - raspberry &amp; strawberry mixed is our favorite! Putting it on the whole thing will soak into it and make it soggy. You can skip the honey if you want but I pour it on as soon as it comes out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PINKFIREBALL21"
},
"reviewBody": "I only use 1/2 the amount of sugar in the cream cheese mixture. I accidentally bought the sweet roll crescents and it was the happiest mistake ever! I buy that variety for these bars now. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "C. Waite"
},
"reviewBody": "I couldn't wait to make this recipe for our next family gathering. I followed the recipe, but was so disappointed with the way it turned out and tasted. No 'Oh my gosh, this is soo good', for me. Nor from the guests. Definitely a 'been there, done that' recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lovespirit"
},
"reviewBody": "This was really fun to make with the kids. Great texture and made the house smell amazing. We felt it was way too sweet. So we are going to try it again using less sugar and also less cinnamon. It smelled heavenly and we couldn't wait to try it, so we tried it fresh out of the oven, and again when It was cold. We all agree we like it better cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tabitha Graham"
},
"reviewBody": "Made it and now it is a family favorite! Don't bother rolling the cresents out, just put them in the 9x13 and press it out. my family likes it better with half the recepie for the topping. it is REALLY sweet with the full amount."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Chen"
},
"reviewBody": "I used a bit more than half the amount sugar in each part of the recipe. Next time, I want to try using puff pastry dough instead of crescent rolls to make it more crispy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luxonagel"
},
"reviewBody": "I have made this recipe so many times that I don’t need the “recipe” anymore! The recipe is great as written but I have also made it using suggestions from other reviewers. Always turns out delicious! The one ingredient that should not be skipped is the honey! Mexican sopapillas are always served with honey and it really makes this dessert perfect! The easiest way to add the toppings is to slightly melt the butter, brush it over the top crust then add the cinnamon sugar mixture otherwise I usually make it as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Wow!!! I can't believe it was so easy. Brought some to work and it disappeared in no time. I kept some at home but in the freezer, as we tend to gobble up delicious pastries, but it didn't work. Now I'm making more. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muddy"
},
"reviewBody": "I used almond extract rather than vanilla, as I like almond and honey together. I baked it in a springform pan. Knowing that it would be thicker, I added an egg to the cream cheese to make it more solid. After baking about 5 minutes, I used a pastry brush to evenly spread the cinnamon, sugar, butter mixture that had melted, since I did not want blobs on top. I served it with fresh strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana"
},
"reviewBody": "Amazing. Everyone loved it. This is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shana Moreland"
},
"reviewBody": "Everyone loved it. Couldn't make enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. Guth"
},
"reviewBody": "This is delicious as written. I have also made it without the butter, cinnamon and honey topping. Add fresh raspberries on top of the cream cheese filling, top with the second layer of crescent rolls and bake as directed. Drizzle with a glaze made from 3/4 cup powdered sugar, 2 Tablespoons of milk and a teaspoon of vanilla. IT IS AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Buckles"
},
"reviewBody": "So YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri Adams"
},
"reviewBody": "Hi Everyone! So I’ve made this so many times. I’ve made it “as is” and I’ve made it vegan using dairy free cream cheese, crescent dough (accidentally vegan) and I omit the honey. I’ve also made of using candied pecans and toasted almonds. This is an amazing recipe and no matter how you make it, it’s awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yadikeith"
},
"reviewBody": "I didn’t change anything to the recipe and it turned out delicious. Big hit with the family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WallyPres"
},
"reviewBody": "Amazed at how easy this is to make! It became an instant crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BeeLane"
},
"reviewBody": "So delicious! A definite crowd pleaser! To cut the sweetness I added 1/4 tsp of salt, used 1/3c for the butter topping and split the 3/4c white sugar with 1/4 brown sugar 1/4 white sugar. Once it was somewhat cooled, then I added honey and used a basting brush to move it all around the top and coat all the edges. Placed in fridge for two hours before eating. Came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ArtandDebbie Carney"
},
"reviewBody": "Simple and delicious recipe . I just feel like something is missing though, next time I’m going to try adding a few dollops of apple pie filling with the cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARAMIA2"
},
"reviewBody": "So easy and so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snowpawswhite"
},
"reviewBody": "Used less than 1-1/2 c sugar total. Used sugar &amp; powdered swerve. Added 1 egg to the crm cheese(x3) mix. Added a ~T. of half n half to it to lighten the mix at the end.\nSprinkled with chopped almonds &amp; pecans. Used big cans of crescent rolls (left 2 leftovers). Easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeeshWms"
},
"reviewBody": "A friend suggested this recipe, and I’m glad she did. It was a hit at our Christmas party!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Serrano"
},
"reviewBody": "This is sooo easy to make and tastes like heaven! I make it every year for thanksgiving and Christmas and its always a hit! Minimal ingredients and there's room for forgiveness if you don't get the measurements spot on or like to do things without measuring!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nikki-K"
},
"reviewBody": "Easy and wonderful for mexican night or picnics as it travels well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Danheim"
},
"reviewBody": "Excellent as is but I do agree with a few other reviewers that it could use more filling. I’ll add another cream cheese or a fruit pie filling next time. Also, my butter did puddle up on top so I just spread it throughout the cooking process. I’ll use less next time. It took longer than 30 minutes in my oven...closer to 40."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb Stumpf"
},
"reviewBody": "Use less sugar, very sweet but delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msaps9020"
},
"reviewBody": "Have made this a few times and followed the recipe. Came out delicious every time. Freezes really well also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "I made this EXACTLY as the recipe instructs. When I took it out of the oven, the butter was still a runny gooey mess, but I gave it the benefit of the doubt and put foil over it and off we went to Sunday dinner at my bestfriends house.\nWhile sitting on the counter through dinner, by the time we were ready for dessert, the liquid runniness has firmed, thank goodness. But it was still very undercooked, the dough doughy, everything too wet and mushy. Luckily everyone loved it just the way it was, but most definitely less butter and more cooking time when I make this recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Juan Lahera"
},
"reviewBody": "This recipe is awesome! Everybody loved it. Someone said that it tasted like you were eating a gooey cinnamon roll! Definitely will make it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DaniD"
},
"reviewBody": "Made it exactly as written, just halved the ingredients since I only had one roll of crescents. Used a 9x9 pan and half the roll fit perfectly on bottom, the other half on top. Super delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Turner"
},
"reviewBody": "OH MY GOD AMAZING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Marie"
},
"reviewBody": "Made this for the 4th of July. HUGE HIT! It was even better the second day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanna Wood"
},
"reviewBody": "It was so good the first time, that I made it again four days later. So good the second time too! Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChristaMizz Brasi Rook"
},
"reviewBody": "I used regular vanilla and it was still amazing!! I’m making it for the second time tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobby D"
},
"reviewBody": "Great recipe! Everyone always asks for a copy of the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri S"
},
"reviewBody": "I made this exactly as written, only omitting the honey at the end. We couldn’t stop eating this! You go for one piece and before you know it, you’ve gone back and eaten 2 more! I will definitely put this in my rotation. So easy to make and so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shifra Gewurtz"
},
"reviewBody": "This was amazing. So easy to make and delicious. The only tweak I did was the cooking time. It ended up needed closer to 45/50 minutes.?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri Ellison"
},
"reviewBody": "This was very simple to make. Everyone really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Marie Richardson"
},
"reviewBody": "Fantastic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celie Bush"
},
"reviewBody": "My husband knows how much I love cinnamon so he made this tonight for our family. All I can say is, , girl! Slap yo mama! We cut the sugar as we are not as tolerant of sweets as many are...but it was unbelievably delicious and, with a nice tall ice cold glass of milk, close to being the absolute best sweet my honey has ever made. The crispy layer of cinnamon sugar and the creamy lightness of the cheese cake combined with the croissant crust was definitely a symphony to our collective taste buds. Thank you so very much for what will be a family joy for years to come."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Goins"
},
"reviewBody": "Delicious! We make this all the time because it is a family favorite. Great for brunch too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belmontmklady"
},
"reviewBody": "I have made this twice and both times were easy and a hit with the family. The first time I made it exactly per the recipe. The second time I put 3 blocks of cream cheese and less sugar on top as many other reviewers suggested. Result was that next time I will just use 2 blocks of cheese and only modify the recipe to have less sugar in the topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K Dubb"
},
"reviewBody": "The first time I made this, I followed the recipe to a science and it turned out amazing. The only complaint by my family was that it was way too sweet. Too much sugar. So I switched from white refined sugar to coconut sugar and cut back 1/4 cup of of it from this recipe. It turned out perfect! Coconut sugar is a great replacement for regular sugar in almost any case and is less damaging to the body."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindasuesosa"
},
"reviewBody": "This was easy and delicious. I reduced the sugar to 1/2 cup and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was easy and delicious. I reduced the sugar to 1/2 cup and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "notredamefan1"
},
"reviewBody": "This is heavenly! After 30 minutes in the oven, the dough was still undercooked in the center, so I put it in an additional 10 min and that was perfect. I know the instructions say to let it cook completely before cutting into it, but I just couldn't wait. However, after doing so, I saw that the cream cheese filling had not set yet, so it came spilling out into the space that my serving left. Lesson learned. Follow the directions and let it cool before cutting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ingrid Aberle"
},
"reviewBody": "The family loved this. Quick and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I cut the recipe in half and baked it in a loaf pan. Increase cooking time to 45 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "LOVE LOVE LOVE THIS! I have to admit I was worried because when it came out of the oven it was gloppy in the middle so I did cook it about 10 minutes more for a total of 40 minutes. It was still loose but I decided I was just going to cool it and then refrigerate before eating it. I can see from other reviews how eating it warm could be too rich and sweet so I definitely recommend it as a cold dessert so make the night before. I put mini chocolate chips in the cheesecake layer and this is quite possibly one of the best cheesecakes I have ever tasted! So easy to make, I didn’t roll out the dough either, just pressed bottom layer in and pinched top layer together on top. The top didn’t cover the entire pan but allowed just the right amount of the delicious cheese middle to creep up the sides a bit! Will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Barber"
},
"reviewBody": "I was afraid that it wouldn’t taste like real cheesecake and would be more like cream cheese frosting as a filling, but it turned out truly amazing! I rolled the bottom crust with a rolling pin and it didn’t work well. I ended up having to knead and “punch” it to get it to fill the pan. For the top crust I kept (2) triangles of the crescents together at a time to form a rectangle and patted them out by hand to stretch, rather than using a rolling pin and this worked better. I cooked it for 40 minutes instead of 30. I will definitely make again. Next time I may try adding (2) eggs for a more NY Cheesecake filling, but it is wonderful “as is”."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allrecipes cook"
},
"reviewBody": "My eleven year old daughter made this dessert with ease and it turned out great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "I followed the recipe exactly and it came out perfectly! Thanks for sharing it with us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele"
},
"reviewBody": "Perfection is all there is to know."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Miriam"
},
"reviewBody": "A bit flat, but good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baby Whisperer"
},
"reviewBody": "This was simple and delicious! Made only 1/2 the recipe for our small family, so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Dungeon"
},
"reviewBody": "Absolutely one of the best desserts we have ever had! My husband had 2 pieces... he said probably his favorite one I’ve ever made which is saying a lot because it’s not chocolate haha. I did add an egg to the filling and it was PERFECT! Also reduced the sugar for the topping to 1/2 cup and just drizzled the honey over. I think next time I make this I will try melting the butter for the topping so it’s more of a pour over and doesn’t stay clumped up. Didn’t detract from the taste at all, so that was minor. Thanks to everyone for the ratings and suggestions - helped make this a home run for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brandyceliz81"
},
"reviewBody": "Fantastic recipe &amp; perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coffey2Go"
},
"reviewBody": "Yum, love the crunch of cinnamon sugar on top and that it can be made ahead and chilled. Terrific with fresh fruit. I used neufchatel cheese instead of cream cheese and doubled the vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dapple"
},
"reviewBody": "It was quick and easy. I halved the recipe, since there's just two of us, and it came out great. I tried adding strawberry jam to a second batch, it made the filling a little runny, but still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrohde"
},
"reviewBody": "Super easy, family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShelleyR"
},
"reviewBody": "Made exactly as written and it’s absolutely amazing!! Thought the honey would make it too sweet but no!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Takio Hardin"
},
"reviewBody": "Easy to prepare. I agree with most: only use half of the sugar and half of the butter. Instead of lots of sugar, I added about 1 and 1/2 tsps of vanilla. I added vanilla to taste to ensure not too sweet. I also added a dot of vanilla to sugar and cinnamon mixture. Also based on other reviews, I melted 1/4 cup of butter and spread on dough before adding S &amp; C mixture to top, to prevent butter from pooling in areas. I also thought it might make a more golden crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michaela Boulier"
},
"reviewBody": "Okay this is my new favorite dessert"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RepMom"
},
"reviewBody": "Absolutely delicious. I topped it with apples. 2 diced Granny Smith apples simmered until slightly softened in the following mixture. 1 cup OJ, 1/2 cup brown sugar, 1 1/2 tsp cinnamon. After desert has cooled for 30 min I spooned apples over with a slotted spoon to drain off majority of liquid from apples."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Anita's Table Talk"
},
"reviewBody": "I really wanted to love this recipe--so easy to make. But oh boy was it SWEET!! Tasted like soggy dough with super SWEET cream cheese frosting. Maybe cutting sugar and butter would help? I'm going to pass on this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "This was good but I did make adjustments when I made it. It calls for way too much sugar. I only added 1/2 cup of sugar to the filling and 1/4 cup for the topping. That was plenty sweet. Next time I will only add 3/4 stick of butter as there were oily puddles on my crust. The filling is just cream cheese but adding 2 eggs will give it the fluff of cheesecake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Cook"
},
"reviewBody": "It was amazing but it was a little rich so next time I might add a raspberry drizzle to balance it out. Still very very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Holcomb"
},
"reviewBody": "I loved this! I used a 9.5\" pie dish and halved this recipe to adjust for size. I added most of one room-temp egg to the cream cheese mixture after beating until smooth. I also didn't have canned crescent dough so I used Beard's Cream Biscuit recipe (full recipe) to make the dough. I also baked about ten minutes longer than listed in the recipe. Turned out GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lsgreen"
},
"reviewBody": "The first time I made this we thought it was too doughy. So l made it again but used a graham cracker crust on the bottom. What a hit, everyone wanted more"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beve"
},
"reviewBody": "Well, it’s COVID 19 time and I am experimental baking. Had some cheesecake and found this recipe. No way to get to the store, so I used some Sister Schubert rolls cut in thin pieces instead of the crescent rolls. Only cooked for 20 minutes and it came out perfect. Necessity is the Mother of Invention!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Amazing dessert! I didn’t make any changes and it came out perfect! It’s officially a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "OMG This is so good. I cut the sugar for the topping to 1/2 cup and it was still sweet. I sprinkled 2 handfuls of fresh blueberries on the top and cooked for 35 minutes it was perfect. I also cooked the bottom dough for five minutes , but it made it difficult to spread the cheese mixture on. It kept pulling it from the sides of the pan when I spread it. Next time I will put the blueberries on the cheese layer Mmmmm so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LITTLECHEF4"
},
"reviewBody": "My family and I loved this! For the topping, I used only 1/2 cup of sugar &amp; added 1/4 cup chopped walnuts &amp; dash of sea salt. It was sweet enough for us so we didn’t use honey. Baked for 35 minutes."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/169305/sopapilla-cheesecake-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/836/desserts/cookies/bar-cookies/",
"name": "Bar Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17200/desserts/cookies/bar-cookies/cheesecake-bars/",
"name": "Cheesecake Bar Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/169305/sopapilla-cheesecake-pie/",
"name": "Sopapilla Cheesecake Pie"
}
}
]
}
}
, "about": [
]
}
]