				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sous Vide New York Strip Steak"
,"datePublished": "2012-05-04T16:41:59.000-04:00"
,"dateModified": "2019-10-10T00:50:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "Sous vide at home with Chef John&#39;s simple stovetop technique for cooking your steak to a perfect medium-rare."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gOlURYU0dGe_t5EmUhQ2-Do4sJc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4227638-8c13925e5bc74a82ae7626bc10423bc3.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1565459580001",
"description": "See a great technique for cooking tremendously juicy steaks on your stovetop.",
"duration": "PT6M5S",
"name": "Sous Vide New York Strip Steak",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0a3e2041-7625-4543-83f8-ce263a987abd/ecc0e56b-e79f-4417-acba-f2e66649b27c/1280x720/match/image.jpg",
"uploadDate": "2021-07-12T11:32:11.012-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sous Vide New York Strip Steak"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "39"
}
,"cookTime": "PT165M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "638 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "231 mg"
,"fiberContent": "1 g"
,"proteinContent": "75 g"
,"saturatedFatContent": "15 g"
,"sodiumContent": "518 mg"
,"sugarContent": "1 g"
,"fatContent": "35 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 (12 ounce) New York strip steaks",
"salt and freshly ground black pepper to taste",
"1 teaspoon vegetable oil",
"1 tablespoon butter",
"1 cup clamshell mushrooms, separated",
"salt and freshly ground black pepper to taste",
"1 teaspoon vegetable oil",
"1 clove garlic, crushed",
"2 tablespoons water",
"0.5 teaspoon balsamic vinegar",
"1 tablespoon cold butter",
"salt and freshly ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Fill a large Dutch oven about 2/3 full with water. Bring water to 130 degrees F (54 degrees C) over medium heat. Attach a candy/oil thermometer to the side of the Dutch oven in order to monitor and maintain the water temperature."
} ,{
"@type": "HowToStep"
,"text": "Generously season steaks with salt and black pepper. Heat vegetable oil in a large skillet over high heat. Place steaks in skillet and cook until just browned, 1 minute per side. Transfer steaks to a resealable plastic bag, squeeze out all air, and seal."
} ,{
"@type": "HowToStep"
,"text": "Place plastic bag containing steaks in the Dutch oven, adjusting the heat as necessary to maintain the temperature at 130 degrees F (54 degrees C). Cook for 2 1/2 hours, moving the bag around occasionally and maintaining the temperature."
} ,{
"@type": "HowToStep"
,"text": "While the steaks are cooking, heat 1 tablespoon butter in the skillet over medium-low heat. Add mushrooms; cook, stirring, until mushrooms are soft, 5 minutes. Transfer to a plate and set aside."
} ,{
"@type": "HowToStep"
,"text": "Remove steaks from plastic bag (reserving any accumulated juices) and pat dry. Generously season with salt and pepper. Heat 1 teaspoon vegetable oil in the skillet over high heat. Place steaks in skillet and cook to form a crust, 2 minutes per side. Transfer steaks to a plate."
} ,{
"@type": "HowToStep"
,"text": "Stir garlic and reserved mushrooms into skillet, reduce heat to medium, and cook until mushrooms are reheated, 2 minutes. Stir in reserved juices, water, and balsamic vinegar. Remove from heat."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/gOlURYU0dGe_t5EmUhQ2-Do4sJc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4227638-8c13925e5bc74a82ae7626bc10423bc3.jpg"
}
]
,"text": "Stir in 1 tablespoon cold butter until completely melted and incorporated. Season with salt and pepper to taste. Spoon sauce over steaks and serve."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT175M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dee Lemmon"
},
"reviewBody": "Chef John comes thru again! This was my first foray into sous vide, and we were not disappointed! Used onions instead of mushrooms, what a delicious meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diana428"
},
"reviewBody": "Outstanding! Chef John does it again. Followed the recipe to the letter and it’s probably the best steak I’ve ever made. I’ll be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Runnergirl"
},
"reviewBody": "Came out nice and moist . Mushrooms were great. I made it per the recipe. Hubby suggested more herbs/spices or marinade for the steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bfr610"
},
"reviewBody": "How much time &amp; effort to put into part of a meal and it wasn't even that good. If you have a team of prep cooks to do your dirty work and then just put your name on it, maybe. Not good for your cook in the home kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vicki"
},
"reviewBody": "The steaks were so moist. I couldnt get the temp to 130 but it stayed around 150 but that was okay becuz i dont like rare. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrzej Siembida"
},
"reviewBody": "First attempt to make it was very successful. Tastes great, meat was very tender and pink inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Schol"
},
"reviewBody": "The steak turned out perfect! It was very tender and juicy and medium rare throughout . The mushrooms were like candy on top. Delicious! Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy Amo"
},
"reviewBody": "This was a great experiment since I have been curious, but not ready to invest in a piece of equipment if it didn't work out. I was able to maintain the temp of the water bath on my stove. I used a large pot. I have a simmer plate for my cooktop which I believe helps distribute heat, even at a low temp. I used 2 thermometers, a digital and just a regular one and it stayed very even. My only reason for not giving 5 stars is that the meat was only warm after searing at the end. It was a thick piece, but again, I consider this an experiment and would definitely do it again and adjust accordingly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sheila"
},
"reviewBody": "Will definitely be making it again. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Hassler Moore"
},
"reviewBody": "I made this for a birthday dinner. I have a new sous vide machine and was looking for a great recipe from a trusted source. I had the butcher cut up a whole beef tenderloin and used 6 steaks from the yield. I divided the steaks into 2 bags. The meat turned out perfectly medium rare. Unable to find clamshell mushrooms, I used sliced shiitake, which was successful. I served with risotto, steamed broccoli and a strawberry spinach salad. Thanks again, Chef John! P.S. So glad my daughter thought to snap a pic! We were so excited to chow down on this, we almost forgot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig"
},
"reviewBody": "excellent!! my wife loved it , we did add onion to the mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhayah3"
},
"reviewBody": "This was delicious! Though, if you like rarer steak I’d definitely lessen the cook time. I had two 1” steaks, weighing ~1.5lbs total, and cooked them for 2 hours @ 130F in a sous vide appliance. The cook ended up being medium, which was too done for our tastes. However, they were still delicious, so I’ll definitely be doing this method again; will just lessen the cook time. The mushroom sauce should not be dismissed! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Braun"
},
"reviewBody": "First time using Sous Vide and it tasted like fine restaurant dining. Plan to try something different next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "This is an excellent way to cook a steak. I used an actual sous vide cooker and then finished it in a skillet. I rivals what I do on an outside grill and is easier than standing outside over a grill when it's 20 degrees. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronald Hayden"
},
"reviewBody": "Very good, excellent sauce. I loved the idea of taking the juices from the Sous Vide bag and adding them back in; seems obvious but I don’t think I’ve seen that suggestion before and it definitely contributed to the taste. Only change is to try searing for only 1 minute per side at the end, as it was a bit overdone for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Cathy Abramson"
},
"reviewBody": "There must be a thousand ways to cook a steak that will give equal or better results. The flavor was fine. From all the hype, one would have expected a texture like prime rib. \nNope. It was just a steak. Way too time consuming. If i am going to spend that much time cooking a steak, it better be able to walk over and put itself on my plate! Stick to your grills guys! Thanks for the gravy John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cutteegurl"
},
"reviewBody": "Made my own balsamic by using apple cider vinegar and sugar. Didn't use mushrooms, but will try that next time. Added BBQ sauce to the sauce mixture and everyone said it was \"incredible.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lemonh"
},
"reviewBody": "Omg!!!! I never cook steak because it never comes out right but this time they were perfect!!!!They were so tender and flavorful. I was so hungry and impatient that I took them out of the bag about 10 minutes early and they still came out great. Note that I wasn't able to keep the heat at 130 F so most of the cook time it was at 140 and again it still came out great! It was worth the wait!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redeyeskilletslayer"
},
"reviewBody": "Followed the recipe and Steaks came out Fantastic. near if not the Best , I have ever had. Why sit in a crowded restaurant, when you can make it better at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Thomson"
},
"reviewBody": "Excellent. I love Sous Vide cooking style. \n\nI made two 8 Oz Prime Beef Tenderloin and one Prime 12 Oz New York Trip. \n\nI did mine Sous Vide in a cooler using remote BBQ thermometer and adding boiling water each time the temp dropped 1 degree. I cooked at 63 degrees Centigrade. I cooked them 2.5 hours. \n\nI seared mine in a super hot black iron frying pan with butter before serving. \n\nThe Beef Filets came out an incredible medium. The New York was at the bottom of medium well - a little too much. \n\nThe steaks were fantastic. I'll be cooking like this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen King"
},
"reviewBody": "Just doubled the garlic and used white mushrooms instead of ones called for. Fantastic recipe! My husband raved about it so will definitely make again, next time for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Matt DiComo"
},
"reviewBody": "Good recipe way easier when you got a emersion circulator. I recommend every one buys one great tool to have."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "localmjamie"
},
"reviewBody": "This recipe looks delicious! One thing I have been noticing about sous vide is you always end up with perfectly cooked meat. I'm looking into the right equipment to use for sous vide cooking method. Because I live in a small apartment, I was thinking the Paragon Induction Cooktop (http://bit.ly/Paragon1B). What do you find works best?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mmcsusn"
},
"reviewBody": "First of all, I have to say I was raised on a big commercial cattle ranch in Oklahoma.....have had steaks in Dallas, San Antone, KC, OKC, and everywhere in between. Needless to say, I know a little about steaks. I tend to shy away from NY Strips because they tend to be a little tough, I prefer Rib Eye. I followed this recipe exactly using my crockpot and these were the best NY Strips I have ever had. The only thing I did different was for the final sear, I used my charcoal grill. About a min, minute and a half per side, make sure you season them before the final sear. I've never had those kind of Mushrooms (Wegmans carries them) but can't imagine having a steak in the future without them. Overall, well worth the effort. Once you put the steaks in the water, they don't need much tending. To make it easy, experiment a few days in advance with your crockpot to maintain 131-135 degrees. I put mine on warm and tilted the lid a bit....maintained 132ish.....thermometer is very important. Don't get wound up over the time....it's not critical.....if it goes three hours, won't change anything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VAZ123"
},
"reviewBody": "I thought this recipe was wonderful. I had a hard time keeping my water at 130 degrees so the meet was more cooked than I wanted. It browned so beautifully before and after the water bath. I used brown portabella mushrooms. The sauce was so good. This was my first time doing sous vide. The meal was awesome served with pesto zucchini ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pkbird"
},
"reviewBody": "For the first time I tried the sous vide cooking method with this recipe. I used 1 inch thick new-york strip loins, and maintained a constant temperature of 130 - 131 in my dutch oven.\n\nI first seared the salt and pepper seasoned steaks in a pan with olive oil, then transferred them into a zip lock bag and immersed them for 2 hours and 15 minutes. I proceeded to sear and crust the steaks after the immersion time. \n\nWhile the steaks were a perfect medium rare, I felt they lacked the depth of flavour I was expecting. \n\nWhen it comes to steak, I could have pan fried these strip loins and let them rest for 10 minutes and achieved as good or better results than the 2.5 hours using this method. \n\nIt was an interesting exercise, but not worth the time or effort in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody Boak"
},
"reviewBody": "I tried this recipe, everyone loved it. My stovetop gets too hot so I got out my crock pot, put hot water in it got the seared put it in ziploc freezer bags and put it in the water, I didn't watch the temp very good and cooked it more than I would have liked to but it was great the meat was so tender and juicy. Nezt time I will turn it down to warm after it gets up to 140 degrees. Thank you for sharing this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Walter VanWinckel"
},
"reviewBody": "Please note that the cooking time in the water bath is the square of the thickness. Twice the thickness takes four times as long. A 3/4\" steak will be done in 40 to 60 minutes while a 1-1/2\" steak will take 160 minutes to four hours.\n\nI will try searing the meat first in the hope that searing will seal in more of the moisture. I have been searing as the last step until now.\n\nIn any event my finding is that I can buy less expensive cuts and get very tender meats with my sous vide oven.\n\nPerfect steaks -- every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scootir"
},
"reviewBody": "I've been sous vide cooking for a while now and absolutely love the technique. Perfect every time with almost no effort. We cook this way so often now that I bought a little sous vide \"oven\" from Costco that has a permanent place on our countertop. If you haven't cooked this way you owe it to yourself to try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Sue"
},
"reviewBody": "So I decided to make this recipe after seeing the video, turned out really good. I warmed up water and put it in a pot, and after I grilled the meat (I used sirloin) I put three of them in a plastic bag and covered the warm water pot. I left them in for close to 2 hours, grilled them and they turned out very juicy. I didnt have mushrooms, but definitely would want to add them to this dish when I make them next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/222209/sous-vide-new-york-strip-steak/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1027/meat-and-poultry/beef/steaks/strip-steak/",
"name": "Strip Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/222209/sous-vide-new-york-strip-steak/",
"name": "Sous Vide New York Strip Steak"
}
}
]
}
}
, "about": [
]
}
]