				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Southern Ham and Brown Beans"
,"datePublished": "2019-04-03T23:29:49.000-04:00"
,"dateModified": "2023-03-04T07:01:04.159-05:00"
,"author": [
{"@type": "Person"
,"name": "SABRYSON"
,"url": "https://www.allrecipes.com/cook/260508"
}
]
,"description": "This Southern pinto beans recipe turns a pound of dry pinto beans and a ham hock into a family-favorite meal that will be enjoyed by multiple generations."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/RjklIcBDj7qvbX67yYg71KjAMI4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/374136-18362e206cb84e2e8b0d8e9587f0b9cb.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Southern Ham and Brown Beans"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "261"
}
,"cookTime": "PT200M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "273 kcal"
,"carbohydrateContent": "38 g"
,"cholesterolContent": "17 mg"
,"fiberContent": "9 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "323 mg"
,"sugarContent": "2 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound dry pinto beans",
"1 large, meaty ham hock",
"1 large onion, chopped",
"2 cloves garlic, minced",
"8 cups water",
"1 teaspoon chili powder",
"1 teaspoon salt, or to taste",
"0.25 teaspoon ground black pepper, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine beans, ham hock, onion, and garlic in a large stockpot. Pour in water, then season with chili powder, salt, and pepper. Bring to a boil, and cook for 2 minutes. Remove from the heat, cover, and let stand for 1 hour."
} ,{
"@type": "HowToStep"
,"text": "After 1 hour, return the pot to the stovetop and return to a boil. Reduce the heat to medium-low and simmer until flavors have blended and broth has thickened, at least 3 hours, or up to 6 hours."
} ,{
"@type": "HowToStep"
,"text": "During the last 15 minutes of simmering, transfer ham hock to a cutting board. Let sit until cool enough to handle, 5 to 10 minutes, then pull meat from the bone. Return meat to the stockpot and discard the bone. Adjust seasonings to taste."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT215M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I took the original authors recommendation and used 4 cups chicken stock and 4 cups water. Another time I was pressed for time and substituted six cans of beans, drained, and used only 4 cups chicken stock. Both times it was absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "I made this version for the first time today to share with a neighbor. Absolutely delicious. I did replace part of the water with homemade unsalted chicken broth. About 3 cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRISTIE1213"
},
"reviewBody": "The flavors in this were amazing. We used our Honey Baked Ham hock and there was a nice bit of meat on the bone. It has been added to my rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Woods"
},
"reviewBody": "Tastes heavenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dale"
},
"reviewBody": "When I am in the mood for Ham and Beans, I always use this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Pickman Bowser"
},
"reviewBody": "My husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valerie"
},
"reviewBody": "These beans are perfect and they taste like home, if that makes sense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CO Dabbler"
},
"reviewBody": "My wife was very happy with this dish last night. I did add a 4 oz can of green chiles to the recipe, but the rest was straight. I am glad I found a post by the recipe's originator that half the liquid is chicken stock and to leave the salt until the end. The flavor was very good. I chucked the ham hock after six hours and diced up some good ham for the last few minutes on the stove. With cornbread and crispy fried potatoes, this is a great meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cjhinch"
},
"reviewBody": "This was my first attempt at “pinto beans” and cornbread. My husband loved this meal growing up, but it was never my favorite, so I never took the time to try!\n\nBut since we are all in quarantine, I needed some fresh ideas, and we had leftover ham from Easter, so I gave it a whirl!\n\nOMG, these were fantastic! Super easy to make, and I did let them cook for about 7 hours before we ate them. I even took some to my grandmother and she said they were the best ever as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tasha"
},
"reviewBody": "I created an account just to review this. I have tried many other ways of cooking this. The way my mom does is soak beans over night and slow cook. I have done that. Also soaked beans and cooked on stove. It has never turned out as good as doing it this way. I changed some things for my taste, I only add salt, pepper, a little garlic powder, and minced dried onions. I also buy pre packaged Black Forest ham sliced without the bone. I cook it exactly the way this is said to cook and me and my family love it. I have made it this way for a year now and I wouldn’t make it any other way. This is the only recipe I follow and I’m very happy with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alex Kessler"
},
"reviewBody": "First time making it,however I've enjoyed both my grandma's and aunt's recipes. I added a bit too much water to my beans when cooking, so my end result wasn't the texture I preferred. I asked my aunt what I could do to get it how I liked, and her simple fix was to spoon the desired amount of juices out, after it cooled a bit, while the juices settled and the water somewhat separated to the top, so that when I spoon out extra juice, I'd be able to leave behind the flavorful juices while getting rid of the watery. Lesson learned. Other than adding too much water to mine, it turned out very tasty! I made a side of white rice and topped it with the beans and the gravy-like juices &amp; it was fabulous, just like grandma's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dastorr"
},
"reviewBody": "Enjoyed every bit . Was able to use a very fresh picnic ham from Dutch valley meats an then light smoke with oak , was so good. Will make it many more time am sure , served up with fried taters, onion, cornbread with cream corn mex, style, an topped off with fresh granny smith Dutch apple pie ......whoot. whoot Whoot . PS no room for more till next day...\n: )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeannine"
},
"reviewBody": "Yes, I would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "erwiner"
},
"reviewBody": "Too bland compare to my other recipe with molasses, ketchup and dry mustard. Added these ingredients...much improved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beverly Berry Kerr"
},
"reviewBody": "Easy, good and inexpensive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miranda Rhea Sandlin"
},
"reviewBody": "Made it exactly as the recipe states with leftover Christmas ham. Turned out even better than expected!! Definite repeat recipe in this household."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Starbuck Bottom"
},
"reviewBody": "This recipe was amazing! I followed the recipe as is and let the beans cook for the full 6 hours. My family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Seals"
},
"reviewBody": "I only gave it four stars because I did make some substitutions.\nSoaked the beans overnight, no salt added. Added a can of Original Rotel, a tablespoon of red pepper flakes and 2 jalapenos, with the seeds. We like spicey. Otherwise followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Randy Allred"
},
"reviewBody": "Love this! My family eats this about twice a month. My teenagers ask for it by name, surprisingly. I'll substitute a pound of bacon if I don't have a ham bone, but it's best with the ham bone. Also, I've started making it in my Instant Pot. Just cut the water to 4 cups and cook on high pressure for about 80-90 minutes. Then mash some of the beans with a potato masher to thicken the broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanon Hatfield Richmond"
},
"reviewBody": "My family really loved this!! I added a tablespoon of bacon grease and 2 chicken bullion cubes to give it more flavor...Also doubled the recipe. Cook it for about six hours. It was awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy"
},
"reviewBody": "Started making these a couple of years ago instead of my usual recipe with navy beans, and my family loves them! I add more ham and sometimes a small can of green chilies for extra flavor if I have them in the pantry. Easy and really delicious, thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melinda Yaeger Crockett"
},
"reviewBody": "Ingredients are perfect! I served this twice to groups of hungry cowboys and they loved it. I had to use a different ham source as it was what I had on hand, chopped up spiral spiced ham. I also increased the cooking time as advised on a different site; an overnight cook on high to keep it at a boil. Eight to 12 hours.\nYee Haw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WyoKelly"
},
"reviewBody": "Best ham &amp; beans ever! ?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicky"
},
"reviewBody": "This is a great recipe. I added diced jalapenos and smoked green chili powder. Yummy! thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Knight"
},
"reviewBody": "YUMMY! Can I give this 10 stars? I used this base recipe and made it in 1 hour in my pressure cooker. I started by thoroughly rinsing the pinto beans then adding it to the cooker with 10 cups of water (broth not needed, salt slows the cooking of beans + extra salt flavor not needed in final product) and the ham bone, then cooked on high pressure for 8 min. I allowed 15 min of natural release, then opened the valve to quick release the remaining steam. Meanwhile I prepared the remaining ingredients including 2-3 chopped celery stalks and cooked them in 1 Tbsp EVOO to blend flavors. After adding all the remaining ingredients ( including 2 bay leaves-yum) to the beans and water, I pressure cooked them on high for 20 min. I allowed a natural release (about 15-20min) before opening. The beans were perfectly cooked! I prefer my soup a little thicker so I removed the ham bone, strained out about 2 cups of beans, then used my immersion blender to roughly chop the remaining beans and veggies. After replacing the 2c beans, it was the perfect consistency. I served it over homesteader cornbread (WOW) from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina Winkler"
},
"reviewBody": "This is my go to recipe for ham and beans, my family loves it! The beans Always turn out creamy, sometimes i mash a few with the bean masher. One time I did what I usually do and cooked my pinto beans seperately because I like to cook a bunch at once, while I am cooking down a leftover fryer chicken for broth. I usually freeze half when they are done. The Organic pintos which I had purchased at the local natural grocery were old and after 4 or 5 hours of cooking I gave up on them, when beans are to old, they will never soften, as long as my beans aren't a year or two expired, my recipe Always turns out fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddie Hipp"
},
"reviewBody": "I'm 67 years old and that's as good a pot o' pintos as I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Argabright Davis"
},
"reviewBody": "Just like the traditional New Year's family recipe! We loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dsterchi"
},
"reviewBody": "Turned out great with a good rich broth base!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "I love this recipe exactly as written. If I am pressed for time (AND if my hambone is on the smaller side) this converts pretty well to the Instant Pot too. In the pressure cooker, I use 5 cups of water, the same ingredients, and cook on high for 60 minutes, or until the beans are soft. Remove bone, add the meat back to the pot and simmer until desired thickness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Az Hummer"
},
"reviewBody": "For those who like these spices, I'm sure the beans are excellent. It is a matter of taste, not a criticism of the recipe. I married a Kentucky boy 58 years ago and had to learn to make beans the KY way with salt pork, slow simmer most of the day, then cornbread, sliced onion and fried potatoes. Also learned to make \"real cornbread\" with stone-ground, self-rising meal. The first time I made cornbread for him (the kind we had in Illinois) he said, \"Not bad for cake\". So, I learned a lot and love the pinto beans, but again, it is a matter of taste and the comforting memories associated with the taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jiom"
},
"reviewBody": "The only change that I made was to add 1/4 cup of brown sugar just to sweeten the taste just a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "I made this on a cold football Sunday and it was a hit. I omitted the chili powder and just made it a good ole pot of beans. I made honey corn muffins to accompany the beans. It was an awesome meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nick"
},
"reviewBody": "Cooking another pot of beans used brown beans 1st batch using navy beans this pot since the ham hocks came 2 to package. Never used ham hocks till now, but like the flavor they give the beans. I did not change a thing. I always try the recipe with out changes first time. thanks was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron Wilkerson"
},
"reviewBody": "I've been making this for years. Handed down though my family for generations. Cept I use Cayanne pepper instead of Black and don't put the chili powder in. Mite have to try that"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char"
},
"reviewBody": "Love it I followed the recipe and it turned out great. I’ll make this all winter. It’s filling not to gasy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Walcott"
},
"reviewBody": "Great southern twist to ham and beans. I served it with fried cabbage and fried potatoes. Will not be a regular on my menu with these sides. I can feel the arteries clogging now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roger"
},
"reviewBody": "I added the diced ham as recommended. Even better the next day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Scott"
},
"reviewBody": "Excellent and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QuiltingLady"
},
"reviewBody": "I made the beans and cornbread all my life like this recipe, only I added a can of chilies. Love it and so delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brainknott"
},
"reviewBody": "Easy &amp; Good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "Very easy and extremely filling. Add some cornbread and it’s a perfect meal on a cold day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Stuart"
},
"reviewBody": "This was a huge hit! \nI fried a pound of chopped bacon with the onions and garlic. I did double the recipe but still was not enough for two boys and myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Doti Roberts"
},
"reviewBody": "This was unbelievably salty... took two bites and the rest went in the garbage... this is the 1st recipe from allrecipes that did not work out..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Sheehan"
},
"reviewBody": "The only change I made was to use 10 cups of water because we like lots of juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grace Hill"
},
"reviewBody": "I made this recipe last night (it was snowing and cold). What an easy recipe. I did add a slurry of 3 tbs. cornstarch and 1/4 cup of water. Used a ham bone from Thanksgiving dinner and a few extra slices of ham. Served with hot sourdough baguette and topped off later with pecan pie and home made whipped cream. Thank you SABryson for a super easy and delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni Stokes"
},
"reviewBody": "I only added a pinch of sugar. I love it! I made it for the weekend crew on my weekend job and I only received feedback from 1 individual. I quess 1 is better than none. I really love the smokie flavor the ham gave it.\nThank you for the recipe.\n\n-Toni"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jerry"
},
"reviewBody": "I use ham shanks. Still get the ham flavor but you get more meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alvin Davis"
},
"reviewBody": "I also added 4 slices of cut up thick sliced lean smoked bacon. Much more flavor. Also great with any dried beans of your choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Del"
},
"reviewBody": "We make this in our house a lot during the winter months. BUT, I always cook the beans in plain water until they are soft, then do your thing. I know for a fact that if you salt your dried Great Northern beans before cooking they will never soften up. I've never tried pinto beans any other way either. They turn out great every time doing it my; way. This the way I wass taught when a kid and have never changed it. Why mess with something that has always worked for me. This is a great winter meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kit"
},
"reviewBody": "My mother made this recipe almost exactly to the letter since I was a little girl. I make it at least once a year with the left over ham bone. It’s the best, my comfort food. I’m in my seventies so I guess this is a classic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SeasickSailor"
},
"reviewBody": "I make this and variations on it all the time. I do, however recommend buying ham shanks versus hocks as there is much more meat on the shanks. I also boil my hocks/skanks until the meat falls off the bone and the marrow has all melted into the liquid. Then I can remove the bones and whatever fat I want to before adding the beans, onions, and spices, etc. Then all I have to worry about is the texture of the beans and the cornbread that’s in my cast iron skillet in the oven or my smoker. If the shanks/hocks I buy aren’t smoked I add a bit of liquid smoke to the pot. One of my go-to comfort meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debby"
},
"reviewBody": "I used northern beans didn't add anything to it, other than pepper and a little salt, came out creamy with a good amount of ham chunks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caliana"
},
"reviewBody": "An almost weekly cold weather Saturday supper around our scatter - served with Spoonbread and my tangy Cole Slaw. (I monitor the salt and add a little Tony Chachere's for a hint of a kick) Laissez les bons temps rouler"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elizabeth922"
},
"reviewBody": "Can this be made in a crock pot?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Rambeck"
},
"reviewBody": "Loved it was a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this is an amazing recipe! but for all of you out there who want to make it, do NOT add salt till the VERY END. wait until your beans have SOFTENED before putting salt in your beans. If you neglect this info, it will result in your beans staying hard and tough! they will not cook right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dlptony"
},
"reviewBody": "Instead of half water and low sodium chicken broth, I only used the chicken broth. (8 cups) I stir fried the onions, garlic (4 cloves), hamhocks &amp; the hambone first...until a fond developed on the stock pot's bottom. Then I added the beans (soaked overnight) and stir fried them for about 2 minutes before adding the chicken broth. As suggested, cooked on high for a full hour, then simmered for 2 hours. (Gas cook range) A dash of salt is added after serving. DELICIOUS AND EASY RECIPE!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Instead of half water and low sodium chicken broth, I only used the chicken broth. (8 cups) I stir fried the onions, garlic (4 cloves), hamhocks &amp; the hambone first...until a fond developed on the stock pot's bottom. Then I added the beans (soaked overnight) and stir fried them for about 2 minutes before adding the chicken broth. As suggested, cooked on high for a full hour, then simmered for 2 hours. (Gas cook range) A dash of salt is added after serving. DELICIOUS AND EASY RECIPE!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MGBJERRY"
},
"reviewBody": "Loved this! I always make ham and beans with great northern beans, but I had a ham bone to use and only pinto beans on hand. When I saw this called for chili powder, I wasn’t sure about it because I did not want chili, but this is nothing like chili. I’m glad I went with it because this was the best ham and beans I ever had! I think this will be my go to recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lstiles"
},
"reviewBody": "Easy and tasty recipe! Family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "I used chopped ham instead of a ham bone and it still turned out very well with no other changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bake Until Golden"
},
"reviewBody": "My Southern husband approved, and between the two of us, we almost finished off the whole pot! My minor tweaks based on preference: did the initial quick soak with water only and discarded the soak water, then added fresh water and the rest of the ingredients for the remaining cook time. Cuts WAY down on the gas factor. Simmered uncovered to get the thick broth I wanted and added more water as needed. Subbed 8 oz diced ham for the ham hock—should have reduced the added salt by probably half, but it was still good, if a little salty. This will be my go-to recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "liederlover"
},
"reviewBody": "Very down-home and tasty. What I changed: I soaked my beans overnight. I put all ingredients; beans, onion &amp; garlic, ham hock, water &amp; chicken broth, plus seasonings, into my Instant Pot electric pressure cooker. Set it on high pressure for 40 minutes. Let pressure come down naturally for about 10-15 minutes, then opened. So delicious! Came out perfectly. Will make again for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim VanSant"
},
"reviewBody": "No changes made. Will definetly make again. Wife &amp; I think the best beans we have ever eaten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheATLMac"
},
"reviewBody": "Excellent recipe. Best Pinto Beans I've ever made. I do replace the water and bullion with broth and sometimes use garlic powder instead of real garlic. It still comes out great each time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "A staple at large family gatherings. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hurtjoli"
},
"reviewBody": "A staple at large family gatherings. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "I've made this a few times. I don't add any salt and I add a teaspoon of baking soda to soften the beans. I usually make a double batch. The first meal is bean and ham soup. Then I divide what's left in half. One half I leave as is. The other half I add a little brown sugar and sometimes molasses. Sometimes I use pure maple syrup instead. My kids love this recipe, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Kavanaugh-Ortiz"
},
"reviewBody": "I am in the processes. I added celery, used 1lb. 15 bean mix, and had to omit the chili powder..... I'm out! I live in Chicago and as of 2:46 pm December 31st 2017 it is a chilly even 0 outside......and I will not be venturing out!\n\nIll be back in about 4hrs.\n Ill give it 5stars for now and will adjust if necessary.\n\np.s. found some cayenne powder I added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Paris"
},
"reviewBody": "Absolutely enjoyed this! I didn't think it was going to come out this good. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derrike Wadkins"
},
"reviewBody": "This was my first attempt at making something like this. I doubled the recipe (big family) cooked for around 4.5 hours and had 2 packages of ham hock with 2 pieces each (not sure if that's considered 2 or 4). No salt added tons of pepper. Turned out great! The family didn't want to eat it after they saw what ham hock was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "Fantastic! I did 4 cups of water and 4 cups of chicken broth. I added some diced ham and served with cornbread. My husband and I ate it over the week and each day it got better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debi Fuquea"
},
"reviewBody": "Diffently make it again. The whole family &amp; friends loved it. Had good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nippersue"
},
"reviewBody": "It turned out great! Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Johnson"
},
"reviewBody": "Very good. I used the cooking instructions provided by Bao Le (commenter on this recipe) and the beans turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Virginia Muniz"
},
"reviewBody": "I will definitely make this again, just like it is! Made it with cornbread that was topped with butter &amp; honey. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "juliee"
},
"reviewBody": "Excellent recipe. I soaked my beans overnight in salty water and added a teaspoon or so of dry mustard because i like that in my beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Toni Torres"
},
"reviewBody": "Good recipe and great flavor. I soaked my beans overnight, cooked in a crock pot on low for 10 hours, and added chicken bouillon. I used a ham hock from a brown sugar glazed ham, then added chucks of ham that was left over from thanksgiving. Cooking in the crock pot made the ham so tender and good. Definitely will use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Padi"
},
"reviewBody": "Sooooo good! Served them for dinner with turnip greens and cornbread. Leftovers made a great breakfast as huevos rancheros. Hubby doesn't eat pork so I used a lump of duck fat that I'd rendered and frozen, along with a few drops of liquid smoke. Deliciously southern AND kosher!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "I did not care for the bay leaf flavor. Next time I will leave it out. I added chopped ham. It was even better the second day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sasha"
},
"reviewBody": "I've been using this recipe for years now with smoked turkey and a few other added ingredients for my liking. I don't consider myself a real cook or nothing close but everyone I make these for LOVE them. I can't help but to give it 5 stars. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pat"
},
"reviewBody": "Didn't make any changes and it was perfect. It's a keeper for me. Taste like the beans my mother made when I was growing up. I've never been able to duplicate that taste til now. Thanks for sharing it! So simple, yet so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J-hann"
},
"reviewBody": "I, too, soaked the beans overnight, drained and rinsed and added the liquid called for (used 4 cups water and 4 cups vegetable broth. I followed the recipe but added one diced carrot and a bay leaf. Following an earlier suggestion, I sautéed the onions, garlic and carrots in a little olive oil before adding them to the pot. I added the salt and some fresh ham pieces during the last half hour after removing the ham bone and bay leaf. I simmered soup for 5 hours covered and then another hour uncovered. We really enjoyed the results and will definitely make it again. I might try adding a second teaspoon of chili powder, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "Great flavor, will definitely make again! Made a few changes to soaking time to remove as much oligosaccharides - indigestible sugars which cause flatulence - as possible from the beans. \nStep 1: Soak 1 lb pinto beans in 8 cups water overnight in covered pot, soak time 17 hours - NO SALT added \nStep 2: Rinse beans and pot very well with cold water; add beans and 8 cups water back to pot, bring to boil then promptly remove from heat. Let sit undisturbed for 3 1/2 hours in covered pot - NO SALT added. \nStep 3: Rinse beans and pot very well. \nStep 4: Back to pot, add beans, onion, garlic, 2 tsp chili powder, black pepper, 2 meaty ham hocks plus one ham steak cut into 1 inch pieces (ham steak adds salt to dish), cover with 4 cups of water &amp; 4 cups no sodium chicken stock - NO SALT added. \nStep 5: Simmer in covered pot on med-low for 3 hours. - NO SALT added.\nStep 6: Mix 1/4 cup flour with 3/4 cup water until smooth. Stir slowly into bean soup mixture. Simmer an additional 45 minutes. - NO SALT added.\nStep 7: Dish into bowl, top with diced red onion and salt individually according to taste. Served with corn bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keawa"
},
"reviewBody": "I loved how creamy this came out. The only modification was to add the salt at the end. We fought over the leftovers and I even caught him sneaking down at night to steal bites."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katiewinkler"
},
"reviewBody": "I have made this several times when I cook a spiral sliced ham. I ad the juice from the bottom of the pan to my bean pot. I get sugar cured hams. I haven't been brave enough to add the chili powder yet. I always make 4 or more pounds of dry beans and adjust the ingredients for the amount of beans I decide to use. We have an extra freezer so, I cook big all of the time and freeze the extras. I put the ham &amp; bean soup in old 32oz yogurt containers and it is plenty for 2 adults and a child when thawed out. I usually have enough to fill 5 or 6 of these containers and put in the freezer.\n I make cornbread with Non-GMO cornmeal to go with our soup. Cornbread freezes and thaws well to go with leftover soup .\n It has always turned out creamy for me and, I don't take the time to soak the beans and usually add half of the salt at the beginning and then more at the end to taste. I do cook for a full 6 hours though. I do mash the beans a bit with a bean masher, and I think this helps with the creaminess and thickening the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Lair"
},
"reviewBody": "I loved these beans. The only thing I did different is soak the beans overnight, only used 1/2 an onion, and added diced ham. My only complaint would be that they are on the salty side and I didn't even salt them. So probably not at fault of the recipe. Rather, the amount of ham plus the ham hock. I will use this recipe again! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam Watkins"
},
"reviewBody": "Everyone enjoyed the soup! My only addition was four large carrots. No one experienced bloating or gas either; -)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack"
},
"reviewBody": "half the fluid should be chicken broth, add salt at end, added Bay Leaf"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tacorhythm"
},
"reviewBody": "The thing I didn't like about the recipe is that the liquid burned out after 4.5 hours. It was also kind of bland I thought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GaPecan"
},
"reviewBody": "My favorite pinto bean recipe so far. I cooked this recipe with the modifications suggested on Dec 09, 2010 regarding the overnight soak and everyone loved it! I followed the recipe exactly except for that step. I served it with cheese/jalapeno cornbread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SABRYSON"
},
"reviewBody": "I'm the original submitter for this recipe and I'd just like to give a quick side note... The liquid should be 4 cups water, 4 cups chicken or veggie broth, the salt should not be added til towards the end of cooking. Why Allrecipes editors changed this, is beyond me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amberly"
},
"reviewBody": "I have been looking for this. I saved my ham bone from Xmas and wanted to make this, but I couldn't figure out how. Well now i know and my son loves this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Myra Taylor"
},
"reviewBody": "YUM. The only ham &amp; bean soup I've ever had was made with dried navy beans. That's what I *was* planning on making until I realized my pantry only had a bag of Pinto beans. Am I ever glad. This was delicious!! Took the advice of another reviewer and 'brined' the beans overnight. Drained that water off and then followed the recipe as written (with suggested 6 hour cook time). Delicious. Perfect for a supper on a night the temperature is already at 10 degrees F!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "Yummy and Easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "Oh my gosh, the smell is so yummy! I really loved the flavor. I used chicken broth instead of water. I couldn't believe the person that said it lacked flavor. I've never used ham hocks before. I believe that is what makes this so flavorful. I waited to the end to add salt, but I don't think it needs it. I believe the ham hocks provided plenty of flavor, along with the other ingredients. This is now my favorite bean recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Haysley"
},
"reviewBody": "Two thumbs up from everyone in the house. I made this using a meaty ham bone from Christmas and simmered for 4.5 hours (got a late start) but it still made a nice New Years' Day meal with sweet cornbread on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PaulaKay"
},
"reviewBody": "Made this because my mother (who doesn't cook anymore) had been requesting beans. I dreaded making them because I remember bland tasteless mush from my childhood. These were a good surprise, and even my Mom liked them."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/40203/southern-ham-and-brown-beans/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/40203/southern-ham-and-brown-beans/",
"name": "Southern Ham and Brown Beans"
}
}
]
}
}
, "about": [
]
}
]