				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spatchcocked Butter-Roasted Lemon and Herb Turkey with Gravy"
,"datePublished": "2022-09-15T14:18:26.000-04:00"
,"dateModified": "2022-09-15T14:18:26.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Karen Schroeder Rankin"
,"url": "https://www.allrecipes.com/cook/28355657"
}
]
,"description": "This roast turkey cooks more evenly and faster, thanks to butterflying (spatchcocking) it. Save the backbone: it adds depth to the homemade gravy."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rkSbHwePm8CuLcNkQfPMFf2J_pY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Spatchcocked-Butter-Roasted-Lemon-and-Herb-Turkey-with-Gravy-MFS_103_4x3-47392e2bf8c443ac84a94f98f27a78ef.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spatchcocked Butter-Roasted Lemon and Herb Turkey with Gravy"
,"cookTime": "PT140M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "779 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "296 mg"
,"fiberContent": "2 g"
,"proteinContent": "80 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "784 mg"
,"fatContent": "44 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"1 cup salted butter, softened",
"2 tablespoons Dijon mustard",
"1.5 tablespoons chopped fresh thyme leaves",
"1 tablespoon fresh lemon juice",
"1 teaspoon grated lemon zest",
"1 teaspoon chopped fresh rosemary",
"1 teaspoon kosher salt, divided, plus more to taste",
"1 teaspoon ground black pepper, divided, or more to taste",
"3 cups coarsely chopped sweet onion",
"2 cups coarsely chopped carrot",
"2 cups coarsely chopped celery",
"1 (12 pound) turkey, thawed if purchased frozen",
"0.5 cup dry white wine",
"2 tablespoons finely chopped shallot",
"0.25 cup all-purpose flour",
"4.5 cups chicken stock, or more as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 450 degrees F (230 degrees C) with an oven rack in the lower third of the oven. Locate a rack that fits inside a large rimmed baking sheet, and set aside."
} ,{
"@type": "HowToStep"
,"text": "Stir together softened butter, mustard, thyme, lemon juice and zest, rosemary, 1/2 teaspoon salt, and 1/2 teaspoon pepper in a medium bowl until mixture is well blended. Set aside. Spread chopped onion, carrots, and celery in an even layer on the baking sheet, and top the baking sheet with the rack. Set aside while you prepare the turkey."
} ,{
"@type": "HowToStep"
,"text": "To spatchcock (or butterfly) the turkey, create a workspace by placing a clean kitchen towel underneath a large cutting board. Place thawed and well-drained turkey on the work surface, and pat as dry as you can with a few paper towels. Arrange bird so backbone is facing up. Use a sharp pair of poultry shears to cut next to the backbone on one side from the tail end to the neck. You will be cutting through bones, so a firm grasp and sharp shears are a must. Use a paper towel or clean kitchen towel to ensure you have a good grasp of the bird if you are having any trouble."
} ,{
"@type": "HowToStep"
,"text": "Grasp the bird with a paper towel on the cut side of the backbone and make another cut with poultry shears along the other side to free the backbone, removing it from the bird. Use your shears to cut the backbone into 3 to 4 pieces crosswise, and place on a plate to use later to make the gravy. Pick the bird up (you will now have a U-shaped turkey), flip it, and place turkey on the work surface with the breast facing up. Use the palms of your hands with fingers interlaced, and press quickly and firmly down on the breast bone of the bird to flatten it. You should hear a slight crack, as the breastbone breaks and bird flattens."
} ,{
"@type": "HowToStep"
,"text": "Place turkey breast side up on the prepared rack above the layer of vegetables on the baking sheet. Pat the outside of the turkey dry with paper towels, and tuck wing tips underneath the bird. Gently slide your hands underneath the skin of the turkey along the breasts, being careful to keep skin intact. With your hands, evenly place half of the herb butter mixture (about 2/3 cup) underneath the loosened skin, pressing butter into an even layer by gently smoothing the top of the skin with your other hand to evenly distribute butter."
} ,{
"@type": "HowToStep"
,"text": "Wash your hands, then melt the other half of the herb butter mixture in the microwave on high power for 20 seconds. Using a basting brush, brush some of the melted butter over the surface of prepared turkey, and sprinkle evenly with remaining salt and pepper. Add 1 tablespoon of the remaining herb butter mixture to a large saucepan (for the gravy), and reserve remaining butter for basting while roasting."
} ,{
"@type": "HowToStep"
,"text": "Roast turkey in the preheated oven until the thickest part of the thigh meat registers 165 degrees F (74 degrees C) on a meat thermometer, about 1 hour and 30 minutes. Turn baking sheet halfway through to ensure even browning and baste with the melted herb butter every 30 minutes. Tent with foil if any of the skin begins to brown too much."
} ,{
"@type": "HowToStep"
,"text": "While turkey roasts, begin to prepare the gravy. Place the large saucepan with the reserved butter mixture over medium-high heat. Add reserved cut backbone pieces; cook, stirring often, until browned all over, about 8 minutes. Reduce heat to low and add just enough water to barely cover the backbone pieces (about 2 cups). Cover saucepan and simmer mixture on lowest heat while turkey finishes roasting."
} ,{
"@type": "HowToStep"
,"text": "When turkey is done, carefully transfer the rack with the turkey from the baking sheet to a cutting board to rest, tenting with foil to keep it warm. Spoon vegetables and all drippings from the baking sheet into the saucepan with backbone pieces. Place the baking sheet over two burners of the stove, over medium heat. Carefully pour white wine and 1/2 cup of the chicken stock onto the baking sheet, and gently scrape surface of baking sheet with a spoon as the liquids bubble to remove any browned bits that have baked on. Carefully pour contents of baking sheet into the saucepan with the roasted vegetables and drippings. Add 2 additional cups of chicken stock to the saucepan, and bring to a boil over medium-high heat. Cook, stirring occasionally, until flavors meld, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Set a fine mesh strainer over a large bowl or measuring cup. Drain gravy through strainer to separate solids from the broth; press on the solids to release as much of the liquid as you can from them. Discard solids. Allow strained liquid to stand for 5 minutes and then skim the fat from the top of the surface. Keep 3 tablespoons of the fat and discard the rest."
} ,{
"@type": "HowToStep"
,"text": "Lightly wipe the same large saucepan clean with a paper towel, then add reserved fat to saucepan over medium-high. Add shallots to saucepan, and cook, stirring often, until softened, about 2 minutes. Add flour to saucepan, and stir constantly until well-combined with fat, about 1 minute. Add strained liquid and enough chicken stock to measure a total of 6 cups liquid (about 2 additional cups of stock) to saucepan over medium-high. Bring mixture to a boil, stirring constantly while boiling, for 1 minute. Reduce heat to medium, and allow mixture to simmer and reduce by half, 25 to 30 minutes. Season gravy with any additional salt and pepper as needed."
} ,{
"@type": "HowToStep"
,"text": "Remove turkey from rack, and place on a work surface to slice as you wish; serve with hot gravy."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT200M"
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/8454378/spatchcocked-butter-roasted-lemon-and-herb-turkey-with-gravy/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/975/holidays-and-events/thanksgiving/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16028/holidays-and-events/thanksgiving/turkey/roasted/",
"name": "Roasted"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/8454378/spatchcocked-butter-roasted-lemon-and-herb-turkey-with-gravy/",
"name": "Spatchcocked Butter-Roasted Lemon and Herb Turkey with Gravy"
}
}
]
}
}
, "about": [
]
}
]