				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spicy Spanish-Style Rice"
,"datePublished": "2014-05-06T17:14:26.000-04:00"
,"dateModified": "2019-10-10T00:51:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This Spanish-inspired spicy tomato rice recipe is super easy to make and is always a crowd-pleaser."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xu9vQwc23UzEANl0N3VlDDP0LU8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2327236-479527c91bb640808b6e4a786a81e97e.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2579393995001",
"description": "See how to make spicy Spanish-style rice, a terrific all-purpose side dish.",
"duration": "PT2M18S",
"name": "Spicy Spanish-Style Rice",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/f0359ac8-9a6b-4e71-989f-992ea608aaf9/81017f84-dfc9-40bf-a589-2509b10dcdd0/1280x720/match/image.jpg",
"uploadDate": "2021-07-23T02:44:08.836-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spicy Spanish-Style Rice"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "60"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "194 kcal"
,"carbohydrateContent": "39 g"
,"cholesterolContent": "4 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "436 mg"
,"sugarContent": "1 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 tablespoon butter",
"2 cups uncooked long-grain white rice",
"0.33333334326744 cup diced jalapeno pepper",
"0.33333334326744 cup chopped green onion",
"1 clove garlic, crushed",
"1 teaspoon chili powder, or to taste",
"1 teaspoon ground cumin",
"0.5 teaspoon salt",
"0.5 teaspoon chipotle chile powder, or to taste",
"0.5 teaspoon cayenne pepper, or to taste",
"2.25 cups chicken stock",
"0.5 cup tomato sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt butter in a pot over medium-low heat. Stir rice, jalapeno, green onion, and garlic together in the melted butter until rice is completely coated with butter. Add chili powder, cumin, salt, chipotle chile powder, and cayenne pepper; cook and stir until fragrant, about 1 minute."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xu9vQwc23UzEANl0N3VlDDP0LU8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2327236-479527c91bb640808b6e4a786a81e97e.jpg"
}
]
,"text": "Stir chicken stock and tomato sauce into rice mixture. Bring to a simmer, cover the pot, reduce heat to low, and simmer for 20 minutes. Turn heat off and leave pot covered on the burner for 8 minutes. Remove cover and fluff rice with a fork."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christina martin"
},
"reviewBody": "Great base for a recipe. I ended up using about a cup more of the chicken stock. Substituted jalapeño with chipotles en adobo. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Paula Berrier Gardner"
},
"reviewBody": "The problem with the recipe is you must use more liquid. Rice ordinarily needs 1 part rice to 2 parts liquid. Also, the dry ingredients will absorb some liquid. I would put more of the can of tomato sauce for the extra needed liquid. Or chicken stock, salsa. or all of those things as long as you have twice+ as much liquid as rice..Bring to a boil, cover and cook 20 minutes on low. Do not open cover until rice 20 minutes and rice is done. Rice cooking lesson is adjourned... go forth and cook rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Big Poppa"
},
"reviewBody": "it's the only Spanish rice my kids will know...thanks for a great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lilybelles Jewels"
},
"reviewBody": "This was amazing! Chef John hit it out of the park again. The flavor was wonderful. The exact amount of spices for us. I have to say that both my husband and I love spicy. The hotter the better, but I think if you're not a big spicy fan you might want to tone down some of the spices.\n\nSince I was making it for two, I cut the recipe in half. I still had enough leftover for another meal. Wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timber415"
},
"reviewBody": "Solid rice - good and spicy but kids could eat it as well - highly recommend it and will now be my go to for enchilada night"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Satbir Thind"
},
"reviewBody": "This turned out amazing! It hit the spot and tasted exactly as what I was craving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jmo67"
},
"reviewBody": "Best recipe for Spanish rice I’ve ever made and it’s easy! Made exactly as directed except used veggie broth and came out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KYNA"
},
"reviewBody": "Not enough liquid for 2 cups of rice. I'll add more stock next time and a little less of the pepper/chilli. I love it but a little too spicy for my husband and kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Geipa"
},
"reviewBody": "This was good but didn't knock my socks off. I have always liked Spanish rice . Left out the chipotle chile pdr and chili pdr but still good. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BarbFlowers"
},
"reviewBody": "Really good. I substituted green chilies for the jalapeno pepper. It was wonderful. Made 1/2 the recipe for just my husband and I and there were plenty of left overs. Chef John is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "Great flavor! Needed a little more chicken stock to prevent burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "warrenpat"
},
"reviewBody": "Made exactly as written but without the chipotle pepper. Great flavor! It looks kind of plain when it's done but it tastes anything but plain. I was a little leary about all the jalapeño pepper because I'm not a big fan of heat, but it was fine for me. You have to try this recipe. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miss Misha"
},
"reviewBody": "This is a great recipe but I did modify it a little. Only used 1/2 a jalapeno, chopped (say 1/4 cup). Instead of tomato sauce, used a 15 ounce can of diced tomatoes and added enough broth to create a 2:1 ratio for the rice. Came out very well and we all liked it, even Mr. Picky Pants, better known as my husband. ; )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria Winkelmann"
},
"reviewBody": "Followed the recipe exactly and it was delicious. However, as I cook rice frequently, increased the chicken broth by half a cup. Will keep and make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Derrek Billings"
},
"reviewBody": "Followed directions exactly.There was tons of liquid left and the rice wasn't even near to being done. I had high expectations for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy"
},
"reviewBody": "ok so I just started this and the beginning is awesome, I didn't have jalapeños so I chopped up some peppercinis, a small green bell pepper that I charred. the flavor that came off while the rice and everything sauteed was great. I added the tomato sauce and chicken bullion and water as that's what I had, it tastes so awesome, I wish I didn't have to change anything. I didn't add the salt since I used bullion but I know it would be awesome as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Betty Haniotakis"
},
"reviewBody": "We had this for Cinco de Mayo this year. I had to make a few changes because of what is available where I live. I Used a green pepper because of no jalapenos, and increased regular chili powder because of no chipotle chile powder. I increased the chicken stock to 3 cups (my normal ratio of stock to long-grain rice is 2:1. I added some extra tomato sauce to make up the difference when the rice wasn't done enough at the end of the cooking time, although the water had been absorbed. Despite these changes, my family liked it and would be happy to have it again. I would choose another recipe from this site, however."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhonda"
},
"reviewBody": "Fantastic! It is so delicious and the rice cooks to the perfect texture, which surprised me because I always used to use twice the amount of liquid to rice. I make this recipe all the time now &amp; my family LOVES it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nikkiltd"
},
"reviewBody": "Absolutely fantastic! I honestly can't cook, but this was a grand hit. Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "pjohnson"
},
"reviewBody": "It definitely needs more chicken stock than called for. Instead of chicken stock, I used 4 cups of water and added a couple of chicken bouillon cubes. I substituted a can of Rotel for the tomato sauce. I omitted the jalapeno and green onion because I didn't have any on hand. It turned out great for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Giggles"
},
"reviewBody": "The taste of the rice was very good, but I kept having to add water to the rice so it would be fully cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber_Cross"
},
"reviewBody": "This dish was extremely spicy! I substituted jalapeño with green pepper and my mouth was still on fire. I love spice but I will eliminate some of it next time. With that being said, this was very close to rice you would get at a Mexican restaurant and went perfect with my taco night. Thanks chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J.W. Engblom"
},
"reviewBody": "Great recipe- I did modify it however. I stirred olive oil and a tablespoon or so of butter into a sauté pan then added veg and rice, sautéed all until rice golden brown, during which time I added a tomato bullion cube and 1/3 cup water. I omitted tomato sauce and added about 2.5 cups of chick stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aspen"
},
"reviewBody": "did everything to recipe except used paprika instead of chipotle and combined the stock with enough mexican style diced tomatoes to equal 4 cups- instead of tomato sauce. (this way i had the 2/1 ratio needed for rice and eliminated the sweetness of tomato sauce). came out really good- definitely a keeper! cant go wrong with a recipe from Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "buylocal"
},
"reviewBody": "So good! The smell alone makes it worth making. I made per recipe using texmati white long-grain rice and my family loved it. I thought it might be too spicy with all the different hot ingredients but it was perfect. It has a kick but isn't too spicy for those who prefer mild/medium heat; just have hot sauce &amp;/or more chopped jalapeño on hand for those who like it hot. We loved how fresh it tasted.\n\nI served it w/ grilled chicken, black beans, sautéed sweet onions &amp; red peppers, cheese, salsa, sour cream, hot sauce &amp; tortillas &amp; let everyone make their own thing. My 14 &amp; 16 yr olds were fighting over who got to put the leftovers away so they could eat out of the pot!\n\nI can always trust Chef John's recipes to be do-able &amp; tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "roro"
},
"reviewBody": "I think that 2 cups of rice needs more than 2 1/2 cups of liquid to cook properly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sugarplum"
},
"reviewBody": "This is very good and also very spicy just like the title says. I left out the jalapeno peppers and it was still very spicy. I had to keep adding more liquid to it to keep it from sticking to the bottom of the pan. This really does make a big batch of rice. Next time I will cut the recipe in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria68"
},
"reviewBody": "Yum, this rice is so good! My husband always has to have rice when we have burrito's or taco's but I was buying the pre-packaged kind which I find disgusting so I was not indulging. I found this recipe and gave it a go today, it's delicious! I love the process of stirring it in the butter first, same as is done when making rice pilaf:) Only changes I made was adding a bit of diced green pepper with the green onion and tossing a little bit of corn in before simmering. A keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reiningcrazy"
},
"reviewBody": "The flavors were amazing but I had the same problem with the crunchy rice. I will bring it to a boil next time and extend the time under the cover. It was absolutely delicious even with the crunchy rice. I would recommend it to everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cate"
},
"reviewBody": "I only rate this recipe a 3 because I have tried it two times and both times the rice was not done. Crunchy. I will try again, but I will cook the rice first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookinupaStorm"
},
"reviewBody": "Very good! So much better then anything in a package. Thanks for sharing, will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "This was very good. I found it a little too spicy so next time will reduce the hot peppers but other than that it was great! My husband liked it as well. I served it with Chef John's Chicken and mushroom chimichangas which were excellent! Will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "madeleine"
},
"reviewBody": "This was the best Spanish rice I have ever made. It was super simple and I had the jalapenos and onion in my garden so that made it even more special. I added frozen corn during the standing with heat off step and it was tasty. Will be making this very often now, so thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SUZZANNA"
},
"reviewBody": "I made this as directed, and it was delicious. The only problem I had was that I had to add a lot more broth while it was simmering, because it was very dry and started to stick to the bottom of the pot. I'm sure it would have burned if I didn't add the extra broth. Very spicy, but I like spicy food. The recipe makes a lot, so if you don't need a lot of rice, I would cut the recipe in half. I'll definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Warrick"
},
"reviewBody": "excellent flavor, the right amount of seasonings, and cooked up perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious and spicy! I added some diced tomatoes... So good and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Adams Dodge"
},
"reviewBody": "This may not be authentic but it is the closest I've ever made. I made it exactly as written except used 1 1/2 teaspoons of chili powder because I don't have chipotle chile powder. I didn't think there was going to be enough liquid but there was and it was perfect to get that sticky but not too sticky spanish-\"style\" rice consistency. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Klantz"
},
"reviewBody": "I will preface this by saying that Himself(my DH) absolutely hates rice. At the end of the meal his plate looked as if he had licked it clean. He said he would eat that kind of rice any day. YAY! I was leary of the amount of jalapeno and hot peppers as he is not wild about too much heat but it turned just right for us. I followed the recipe exactly except for omitting the chipotle chili powder as I didn't have it on hand. Also, I have never been able to make rice properly but this came out perfect by following the directions on timing exactly. I will be making this many times again in the future. THANK YOU Chef John!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marielise"
},
"reviewBody": "Delicious! This recipe is called spanish STYLE so it's inspired by spanish rice but a bit different. Don't judge the recipe based on you not being able to read the title geez... This was awesome! I served it with sour cream and paprika chicken. Thanks again Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "candygirl"
},
"reviewBody": "Awesome!!! Made it earlier today and the family devoured it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy G"
},
"reviewBody": "I made this tonight with very few changes or substitutions. We loved it! Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzzee"
},
"reviewBody": "I just made this recipe today for Mothers DAY! My hubby is housebound after hip surgery, so instead of the kids having us over, I decided to do a Spanish meal instead of the traditional BBQ. I did the deep fried tacos and this Spanish rice dish! OH BOY,,,, was it good! I doubled it for the servings that was needed. I had a very large cast Iron skillet that I started it in but of course I ended up transferring it into another pot for it to finish cooking. I only added a couple things different. But, that did not change the taste at all. It would have been fine without them. I added only 1 can of drained black beans, and 1 can of chopped tomatoes. Well, after taste testing I decided that it did need some cayenne pepper which I did not think it needed until I taste tested (thought the jalopenias would to the trick) so I decided to add a pinch and------ more then I wanted went in and wha laaaa,,,, it was the perfect heat to it! My kids all took the leftovers except one bowl left for us. I would recommend this one to try! Thank you Chef John!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/237639/spicy-spanish-style-rice/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
"name": "Rice Side Dish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17482/side-dish/rice/spanish-rice/",
"name": "Spanish Rice Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/237639/spicy-spanish-style-rice/",
"name": "Spicy Spanish-Style Rice"
}
}
]
}
}
, "about": [
]
}
]