				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spicy Refrigerator Dill Pickles"
,"datePublished": "2020-06-18T23:11:10.000-04:00"
,"dateModified": "2023-01-11T07:52:50.000-05:00"
,"author": [
{"@type": "Person"
,"name": "FAIRYFAHRENHOLZ"
,"url": "https://www.allrecipes.com/cook/474431"
}
]
,"description": "Spicy pickles with a hint of sweetness. This recipe is great for pickling beginners — all you need is a refrigerator, a few jars, and patience."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0LMmeAUo2aVH5p-yXe7Vh0WoHr4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5208160-0841c12630c74eacb65455e428627db3.jpg",
"height": 844,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6064352440001",
"description": "Make your own spicy and briny dill pickles at home!",
"duration": "PT42S",
"name": "Spicy Refrigerator Dill Pickles ",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/0fabaa26-69cf-4da9-9248-905a4ab2abfb/9fc2d50a-0f91-4827-ac14-29fe4b9ac62e/1280x720/match/image.jpg",
"uploadDate": "2021-07-08T22:44:08.898-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spicy Refrigerator Dill Pickles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "288"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "70 kcal"
,"carbohydrateContent": "17 g"
,"fiberContent": "1 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "728 mg"
,"sugarContent": "12 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"12 3 to 4 inch long pickling cucumbers",
"2 cups water",
"1.75 cups white vinegar",
"1.5 cups chopped fresh dill weed",
"0.5 cup white sugar",
"8 cloves garlic, chopped",
"1.5 tablespoons coarse salt",
"1 tablespoon pickling spice",
"1.5 teaspoons dill seed",
"0.5 teaspoon red pepper flakes, or to taste",
"4 sprigs fresh dill weed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine cucumbers, water, vinegar, chopped dill, sugar, garlic, salt, pickling spice, dill seed, and red pepper flakes in a large bowl. Stir and let sit at room temperature until sugar and salt dissolve, about 2 hours."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/0LMmeAUo2aVH5p-yXe7Vh0WoHr4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5208160-0841c12630c74eacb65455e428627db3.jpg"
}
]
,"text": "Transfer cucumbers to 3 wide-mouth, 1 1/2-pint jars, placing 4 cucumbers into each jar. Add enough vinegar mixture to cover cucumbers. Place 1 sprig of fresh dill into each jar and seal with lids. Refrigerate for 10 days before eating. Use within 1 month."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT14535M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "my son loved these pickles! He now whats to be a pickle farmer :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEANNE M KIESINGER"
},
"reviewBody": "I followed the directions exactly and they are fabulous! They were made two days ago and we are already enjoying them. Can't wait to see what they taste like after they've sat for awhile. Great recipe! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meagan"
},
"reviewBody": "I started these a week ago tomorrow (so still have a few days to go before they’re “done”). I used a pickling spice recipe I found here in All Recipes but I was short on white vinegar so I used about 1/4 cup of red wine vinegar to supplement (don’t have any regrets thus far!). I followed some advice from others, like decreasing the sugar (though I actually used splenda) and I didn’t realize my fresh dill had gone bad so I used dried dill. Oh. My. Gosh!!! With the recipe, no extra brine needed, I made two jars of spears and one jar of “chips”. I’ve been “taste testing” them (the chips mostly) every day and they get tastier and crispier ~ it’s fantastic!!! It’s fun to experience the flavor development each day and I can’t wait to taste the final flavor profile it’s like Christmas Make this recipe!!!! This was my first time trying to pickle anything. And now I’m trying to think of all kinds of veggies I can pickle us"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRTMW"
},
"reviewBody": "I love spicy pickles but got tired of Paying so much money for them at Costco. So I figured I would give this recipe a try and it turned out amazing. I just opened the 1st jar 8 days later and it was one of the best pickles I've ever had. I followed the recipe almost exactly except I did cut the sugar down a little bit and added some fresh jalapenos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindi Michalik Goldhaber"
},
"reviewBody": "These are the bomb! I added 1/2 teaspoon of red peppers that I had dehydrated and put in the food processor. They are awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tim Coffin"
},
"reviewBody": "Very very bitter. Too much dill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Nate Manis"
},
"reviewBody": "I was so pumped to make this. Thought they were WAY to sweet and vinegary. Unfortunately, my wife and neighbor agreed. They were inedible. Followed the recipe exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arc"
},
"reviewBody": "I have just made this, so all the flavors haven’t had time to combine and soak in, but already they are delicious! I love the extra little kick of spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "M Hayden"
},
"reviewBody": "Used this recipe for a long time ... it makes the perfect garlic, spicy pickle. You can make them hot or keep them a little sweet. It’s an easy recipe to adjust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "waylean"
},
"reviewBody": "Too sweet for me, even with less sugar and more spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Vander Meulen"
},
"reviewBody": "Yes I would. Family loves them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Bortz"
},
"reviewBody": "This recipe is fantastic! I only had 6 cucumbers so I used 1lb of hot Italian peppers in addition. I cut the sugar to 1/3 cup and omitted the dill seed and red pepper flakes. I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doug"
},
"reviewBody": "These turned out great, and I've made them several times now.\nI usually increase the amounts to make larger batches. (We have a large garden)\nI give away what we can't use at home and everyone asks for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shayne Carter"
},
"reviewBody": "Very good recipe. Cut sugar in half if you don’t want it too sweet. Double red pepper if you want spicer but no more then that. Definitely add bell pepper and onion. I couldn’t wait, I got to day 7 and it is so very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay"
},
"reviewBody": "These were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Great recipe! I used half the amount of sugar, and pickling salt rather than standard course grained salt. My pickling spice blend already contains dill seen so I chose to not add any additional. I also like to include a few sweet onion slices alongside the pickles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lfreeman"
},
"reviewBody": "I made these twice and my family and I loved them. Saving recipe for future batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Alger"
},
"reviewBody": "We are fixing to make these again this year - they were a huge hit with the family last summer, so we've begun a new tradition ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This was my first try ever of making dill pickles and I am so excited that I can now do this. I had a bumper crop of cucumbers this summer and outside of salads I didn’t know what to do with them. I think this is an awesome recipe, the sourness of the vinegar and dill, the slight heat of the pepper flakes, but a couple changes will be made by me for the next crop of pickles. First, it’s too much sugar as is. We could really taste the sweetness. Granted, it didn’t over ride the dillness but it was still very evident. Next time I make them I will cut the sugar in half and see how that goes. I noticed several reviews said the same thing about the amount of sugar. Per my family request I will add more garlic. I also think 10 days is too long. I will go for 8 Days the next time. I felt the pickles were just a tad too wilty. Overall, this is a great recipe to start with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sassycat77"
},
"reviewBody": "My pickles were spicy which I liked. I used less sugar but it was still too much sugar for me. Next time I my omit the sugar completely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosemarie Yandoli-Smith"
},
"reviewBody": "I've used this recipe several times. it is a good one. But I also cut back on the sugar. Make sure you use Kirby cukes. they are firmer and hold up well. Use wide mouth Bell jars. Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia M. Sturgill"
},
"reviewBody": "Yummmy!! Love the summertime treats!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bernie"
},
"reviewBody": "will let you know... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Rho"
},
"reviewBody": "I have made this recipe 4 times and each time, my family raved about the crispness and freshness of unheated pickles. All of the flavor... spiciness, dillness, loveliness!! Each time, I’ve made 3 quart size jars and each time they have been devoured! This last time, I cut the Persian cukes into slices, rather than spears... just to try something different. I add a bit more red pepper and garlic, as well as fresh and dried dill. I have added whole jalapeños in the past. Also use only 2 TBS of Xylitol, no other sugar. You can do no wrong!! This is an amazing way to use cucumbers, squash, beets, asparagus and whatever veggie you’d like to pickle! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erduck"
},
"reviewBody": "These are awesome! I couldn’t find any dill seed when I made my first batch so I just left it out and they still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimethameliea"
},
"reviewBody": "First time pickler. Because we had so much produce from the garden and the kids were excited to make pickles with some of it! We ended up making 5 jars had to make more of the brine so like some have said just make double the batch. We used less sugar as suggested. No rhyme or reason to it we just added dill dill and more dill till we felt happy with it and used kosher salt. The only things we ended up adding was each jar had a little something different. One had sliced red onion another had lots of garlic another had habanero peppers and one had bell peppers and we just went to the local grocery in the canning section and there were several choices for pickle spices so we just got a basic one. It had the pepper corns and cloves and stuff already in it no preservatives just dried spices and goodies for pickles. \n\nlET ME TELL YOU THESE ARE GOOD AND EASY TO MAKE\n we waited the 10 Days then could barely stop eating them. They are crunchy, good, addicting and we will most definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen Woeller"
},
"reviewBody": "I have made these several times and have enjoyed them often. They add a little spice on a plate with a sandwich or small entrée dinner. I also have adjusted the spicy peppers I add by either using a jalapeno pepper sliced on a mandolin on a diagonal and adding a few slices to each jar along with a few thin slices of onion. I also slice my pickle cucumbers on the thicker side so I can get more in the jar and more on side my plate. Excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "3.18.18 I like the spiciness of these pickles, actually, I like the flavor of these pickles, however, I just don’t like the texture. Simply put, they are mushy, not crisp like a dill pickle should be, and that’s just too much of a compromise for me. My husband said he’s not eating more of them, so it looks like the remainder of the jar will be mine. Some good things and not so good things about this recipe, but I won’t be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjbekker"
},
"reviewBody": "I made this recipe about 3 years ago. I bought pickling cucumbers from a farmer's market and followed the recipe exactly. I cut them into spears and my pickles ended soggy and grey. They tasted great, but the soggy texture was unappealing to eat. \nBUT I was not going to give up!!! I did some research and it paid off. I was given a big box of European cucumbers and wanted to try again. I read online to keep cucumbers crisp follow a few rules. 1. Put cucumbers in ice cold water for at least an hour before pickling. 2. Add black tea to the jars. 3. Cut off the cucumber ends that the flowers fell from. \nI quadrupled the recipe and filled 2 one gallon pickle jars. I put 2 tea bags in each jar. I cut cucumbers into slices, not spears. I couldn't wait the two weeks and in one week, I was completely blown away and proud of the perfect pickles. Good thing I made 2 gallons!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jaime C"
},
"reviewBody": "We love this one. Quick and easy and just as the recipe states."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dixymar"
},
"reviewBody": "Great recipe. Easy and the pickles are crunchy. The first batch I made just as recipe reads. They were a little sweet for dills, so the next batch I only used 2 Tsp. sugar, no cracked pepper and these came out just perfect. They taste like my favorite store brought brand -Claussen. So far, everyone else that has tried them loves them too. I just recently began making pickles: sweet relish, bread &amp; butter and these. These are the easiest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tere Prasse"
},
"reviewBody": "Agree with less sugar and I used apple cider vinegar - all my ingredients came fresh out of my non-GMO heirloom organic garden (a little bit more dill). I also used fresh sliced serrano peppers to give a nice zesty zing (serrano are a wee bit spicier than jalapeno). No one will let the pickles sit for 10 days in the jar. I make pickled okra using the same recipe - tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Miller"
},
"reviewBody": "Shared with friends. All loved it. I also use the recipe for pickled green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Rodgers Devlin"
},
"reviewBody": "This was a great recipe. Not a much sugar and more garlic and dill. Perfect on the rest. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista Kalinowski"
},
"reviewBody": "I gave this a 5 star rating - but only after I made a bunch of changes - LOL! The first time I made these they turned out WAY too sweet with hardly any tang or dill flavour. \nNow I use 2c vinegar and 1 3/4 water, and 1 tsp sugar (NOT 1/2 cup). I do use the 1 1/2 chopped dill - but only for the soak (3hrs, not 2). I find that leaving the chopped dill in the jars makes the pickles \"furry\" when you go to eat them - not very pleasant in my opinion - so I skim about 3/4 of the dill off the top before I pour in the brine. \nI use all the rest of the spices on the list - adding 1/2 tsp more dill seed and 1/4 tsp more crushed pepper but here is where I like to dress it up. \nFor each jar I take four cloves of garlic and slice them thinly, four sprigs of dill, and two of the dried Chile de Arbol peppers (long skinny red peppers) and arrange them between the cucumbers before I pour in the brine. The dried chiles don't make it that much spicier unless you pierce them, just in case you are worried about that. (Each jar fits four of the pickling cucumbers halved and this is just enough brine to fit the four jars.) \nThese tweaks certainly make for a nice presentation and they do help kick up the flavour! They are a favourite summertime treat and make a great gift for the neighbours!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Askew"
},
"reviewBody": "Crisp, tasty pickles! I used small cukes and left them whole. Fam loved them. Who knew I could make pickles?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Muterspaugh"
},
"reviewBody": "These were fantastic! Great taste and texture. The recipe worked perfectly with our lemon cucumbers cut into wedges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard Breiholz"
},
"reviewBody": "They were very good except I thought just a wee bit on the sweet side. I gave some to several people and they all loved them. I will make them again, maybe this time I will cut back a little bit on the sugar. They do have just the right amount of heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie"
},
"reviewBody": "Super easy, and kinda fun to make. I also made a double batch of the brine as recommended by other reviewers. Also added some red pepper flakes to one jar since I like spicy and my family doesn't. I'm very impressed with how simple it was to make my own pickles! Will make this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I did not have fresh dill so added some dried and doubled the red pepper flakes and they are perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimberly_boes"
},
"reviewBody": "I did not have fresh dill so added some dried and doubled the red pepper flakes and they are perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingNana"
},
"reviewBody": "These turned out crispy and very tasty. I added extra garlic and lots of dill. Because I used a small amount of red pepper flakes they were a bit spicy too. At first bite they have a sweetness and finish with a little kick. My guests loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Noble Davy"
},
"reviewBody": "I made these and they are great! I used 2 Tbsp sugar as was suggested and they are perfect for my family. I am so glad I came across this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda"
},
"reviewBody": "My daughter and I made these from our neighbors crop of cukes. This was the first time either of us had made pickles of any kind. They are delicious and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mnj"
},
"reviewBody": "I've made a recipe close to this. But that recipe called for heating so the sugar would dissolve. I may try this one instead. I save my glass jars that have plastic lids to use for these. we love them. Marilyn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dionne"
},
"reviewBody": "used powdered garlic., onion powden,canning salt,dry dillweed red pepper flakes ,dry musturd seed. doubled recipe. Warmed liquid &amp; seasoning on stovetop and only used 2 tbls of white sugar. 10 day countdown for results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "papersacknurse"
},
"reviewBody": "I made these a couple of weeks ago and they were fantastic. I added more crushed red peppers because my family loves spicy foods. Will be making another batch soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vocabqueen"
},
"reviewBody": "Excellent!! Will cut back on the amount of Sugar next time -- but truly Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALZ"
},
"reviewBody": "The reviews are all true, these are awesome! And oh so easy. I didn't have pickling spice so subbed 1 bay leaf, peppercorns, and mustard powder. I also cut the sugar in half and had to use dried dill because our local market had run out of fresh. Still wonderful. I brought them to a bbq and they were gone instantly...though I will say they were a bit too spicy for the younger kids in the crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ranger Jasmine Hammond"
},
"reviewBody": "I made two batches with Pickling Spice, but did not have enough to do all 6 batches so I omitted it from the others. Still super yummy. To can them, sanitize jars by submerging in boiling water for 10 minutes, fill jars, boil filled jars in water for 10 minutes. Your done! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StardustGrindcarver"
},
"reviewBody": "I really liked these pickles. They were so easy to make and tasted great! I followed the recipe aside from the canning seasoning. I didn't want to buy any so I used stuff I had on hand, which were some crushed bay leaves, Mustard powder, Cinnamon and a bunch of Peppercorns. I used a little more red pepper flakes than the recipe asked for, and next time I'll add more. My only complaint is that there wasn't enough heat in the pickles. Next time I will probably slice some jalepeno as well as double the pepper flakes. I loved being able to just mix everything, put it in the jars and throw it in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty"
},
"reviewBody": "The pickles are really good. Crunchy and garlicky. I'm buying more pickles to make more. I will add less sugar. Thanks!!!!??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Orlando Velazco"
},
"reviewBody": "Awesome pickle recipe, and way easy to make. I cut back on the sugar by half after reading others comments, used about a teaspoon of celery seed, and used Hawaiian black salt (those last two solely because of what I had one hand). These came out fantastic! I love spicy foods, and this had just a touch of it. Soooo good. Following this recipe (nearly) to a tee produced just two pint jars for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darlene"
},
"reviewBody": "everyone in my household is in love with them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Frantz"
},
"reviewBody": "I'd been searching for a great dill pickle recipe for a while and this is definitely one I'll be making again. Very addictive.\r\n \r\nI did make a few modifications:\r\n- I used a few slices of fresh jalapeno in each quart jar instead of red pepper flakes, and halved the sugar. This gave it a great balance of sweet and spicy.\r\n- I mixed the water, vinegar, salt and sugar in a saucepan over heat to dissolve everything (heat just long enough to dissolve, don't boil), added the rest of the ingredients directly to each quart jar, then poured the liquid over everything.\r\n- My grocery store was out of fresh dill, so I used a tsp. dried dill in each quart jar instead. I'm sure it's better with fresh, but it still tasted good this way.\r\n- After filling the jars, I sealed them up and sterilized them for pantry storage, and they still ended up nice and crunchy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Courtney Kunath"
},
"reviewBody": "Matching the recipe exactly...but was horribly short on dill juice?!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Chelpka"
},
"reviewBody": "Although, I didn't care for these as written, I've given the recipe 5 stars, because this is an excellent SWEET PICKLE RECIPE. I just don't like sweet pickles. Not having made pickles before, I wasn't sure if the sugar was necessary. I reduced the sugar to 1 tablespoon knowing I wouldn't like them otherwise. They were still too sweet for me, but Hubby loved them. I didn't have fresh dill, so I used dried, but it was a real pain to have hundreds of tiny dill pieces sticking to the pickles as I pulled them from the jar. Fresh dill is on the list for next time. I won't chop it. There will be a next time without any sugar. Thank you, FAIRYFAHRENHOLZ, for a great recipe to get me started."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELGIRL94"
},
"reviewBody": "I couldn't even wait a day to try these pickles. For my taste, dill pickles are too sour and bread and butter pickles are too sweet. These pickles are the perfect combination of both. I used the full amount of sugar called for and as much dill as I had which was about two tablespoons fresh chopped and two tablespoons dried. I also added about a tablespoon of dried habanero and cayenne flakes for a little kick. I had small pickling cucumbers so I cut them in half and divided them among two quart size jars and put four crushed garlic cloves in each. I then filled both jars with the pickling brine. Even after one day in the fridge they were outstanding! I'm through with store bought pickles. These pickles are easy to make and easy to adjust to your own taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darthmilks"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Robertson"
},
"reviewBody": "We love these. I may have gotten a little off on measurements but put the same stuff in there and same method. However much cayenne flakes I added in made them super spicy but delicious! These pickles get nice n pickled after the ten days and have a great crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kris S"
},
"reviewBody": "I made these with the listed amount of sugar and I made them with less sugar. I preferred them with less sugar. I added more spice and some jalapeno slices. This is a great recipe with a few of my own tweaks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "noturbone"
},
"reviewBody": "i omitted the sugar all together but i think i'll use a Tbls or so next time they didn't make it the full ten days as i'm too impatient very sour which i love i doubled the garlic will probably triple next batch and was forced to use dry dill which i'm sure isn't ideal overall i'm very satisfied with the result ty very much for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Treasa"
},
"reviewBody": "I have never made pickles before and these were easy and turned out wonderful! I reduced the amount of sugar as suggested by others but other than that, followed the recipe. Can't wait to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chas"
},
"reviewBody": "This is the best dill pickle I have ever tasted. I am in the catering business and I frequently serve these at my meals. Everybody that likes dill pickles and some spice loves them. I do double the red pepper flakes.\nChcas.Lyons"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "murph"
},
"reviewBody": "I made these and we just tried one of the jars. OMG, they were awesome. I am going to make another batch this weekend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie "
},
"reviewBody": "This recipe is SO good and SO easy to make. I cut the sugar in half as others suggested but otherwise made it exactly as written. I am not a fan of sour foods so I found it too tart but my husband who loves sour thought they were perfect. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Blue"
},
"reviewBody": "I used both cucumbers and green beans. This is a good super easy starter recipe. I used half the sugar and it was still much too sweet for my taste. I also don't like all the dill bits that I have to dig through to get to the pickles or beans. That being said, they were ready to eat 2 days ago and now almost gone. My youngest child thought the batch without pepper flakes was still too spicy but I liked it. Next time I'll try keeping the fresh dill weed whole and using even less sugar. Our garden is bursting with beans so I'm going to modify the recipe and try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "breggae"
},
"reviewBody": "I was looking for a different type of pickle with a little heat. This recipe is exactly it!! I made 8 jars last week and we have just 2 left!!! I'll be making more this week for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenny Smith"
},
"reviewBody": "These pickles taste okay -- a whole lot better than the other recipe I tried. Spiciness was just right. My kids will eat them and say they are good, but they aren't sneaking them as usual, and the hubs actually bought store bought pickles the other day. Can't say I'd do these again, but they were okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terri Summer"
},
"reviewBody": "Easy and delicious! Nice crispy pickles. Didn't change a thing! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greaterexp3"
},
"reviewBody": "This will be my new refrigerator dill pickle recipe! I did follow other reviewers' advice and cut the sugar in half. I doubled the amount of red pepper flakes, since my family prefers the heat. I did not add additional sprigs of dill to the jars, and we all found the chopped dill to be more than enough for a full dill flavor. Wonderful pickles! Thanks for the great recipe! I wish I had made a double batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "Yum! Used less sugar because I don't like sweet pickles... And didn't use the pickling spice. First batch was gone in four days. Everyone loved them! Batch number two is resting...didn't use any sugar in this one, and used half white vinegar and half cider vinegar...time will tell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HRL"
},
"reviewBody": "Used this recipe for my first attempt at making pickles and they turned out great! I've got a second batch in the fridge and its going to be a long 10 day wait. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sobotta"
},
"reviewBody": "My son declared these the best pickle he has ever tasted! I reduced the sugar as I wanted a sour pickle. I could eat the entire jar myself, by then I would indeed have terrible garlic breath! I added a bit of zucchini as I had extra, and they stayed crunchy and delicious too. This is an easy recipe with impressive results. Thanks so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lindsay penney"
},
"reviewBody": "This was my first time attempting to ever make pickles. Very easy and delicious! I made mine into chips, added sliced onion and made a double batch. 1/2 with the peppers, the other half without for the kids. I couldn't wait the full ten days, so one pint jar is already gone. With be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Morris"
},
"reviewBody": "These are easy to make and they are a great picnic pot luck offering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "princessgertie"
},
"reviewBody": "I LOVE pickles. These are really good with just a few adjustments. My family likes spicey, so I add jalapenos to the jars. These are also a little too sweet for me, so I reduce the sugar by over half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kyla"
},
"reviewBody": "These were pretty good, pretty easy. Hubby loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BevKat"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lemonlover"
},
"reviewBody": "I make jars and jars of these when my garden is producing lots of cukes. Everyone likes them and when a jar is opened, they disappear fast. i do use 1/2 the sugar. I have made them in spears and in large slices. We only have two jars left in the fridge now in November. They will be gone soon. I have even saved the juice and added more cukes to it, but only do this once and eat them as soon as the 10 days is up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherri"
},
"reviewBody": "I absolutely love pickles and am very particular about them...they must have FLAVOR like you just got it out of the full sour pickle barrel at the deli, not like some of those storebought that taste like cold cucumbers that ran past the pickle brine. I also never made pickles before, bought the cucumbers and then had to rush out of town for a funeral. I knew the cukes would be rotten by the time I got back so I mixed the brine and put the pickles in exactly as directed while I packed. LEt them sit as instructed and popped them in old mayonaise jars and popped them in the frig. I cut the cucumbers in quarters lengthwise and followed instructions EXACTLY...except I had no fresh dill so I used dried. (I looked in a substitution book which said to use 1 tsp dry in place of 1 Tbsp fresh, which is 1/3 the amount..so I used 1/2 cup in place of 1.5 cup) My dill was a bit old, so I dumped in more than it said...maybe 3/4 cup. I am making it again today, as all my friends want to try some and I wanted to test it on myself before poisoning anyone else! I am going to try fresh dill. Also, I cut sugar all the time when I bake, but was afraid to in this recipe as I didn't know what the chemical interaction was with the ingredients. They were NOT AT ALL sweet...and I can eat a lemon or lime raw. When I get these down I will try canning with a water bath, but this is so simple I wish I had tried it decades ago."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Klaudia West"
},
"reviewBody": "Awesome! Super easy and extra delish! We had fresh hot peppers and used those instead of pepper flakes! We've made them a few times, the second time we made them we cut the sugar, they weren't as good! We're sticking to the original recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcc"
},
"reviewBody": "Made these for my boyfriend and he loved them! I made enough for 3 Mason jars. We tried to make one \"extra spicy\" with more jalapeños in the jar, but it didn't really seem to make a difference in the end. Good spice with a nice mix of sweetness. We wound up using about 1/2 the number of cucumbers called for but the same amount of brine as the recipe said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Seriously amazing! I made two jars of these pickles earlier this week. I cut back on the sugar a bit, and also added some whole garlic cloves to the jar. After 3 days the flavor was fantastic and I ate half a jar. :) I refilled the jar with new cucumbers and i'm waiting to see how they turn out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karla Minor"
},
"reviewBody": "these were just ok, for me. I don't really care for the vinegar taste. and the dill weed is kinda messy. I think you could just use dill seed, and get a better dill taste. but I won't be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnt4fr"
},
"reviewBody": "Think this is my favorite. Every year I forget to save my favorite recipes and every year I do something different. I won't forget this year. Perfect balance of flavors with just a hint of heat at the end. We all loved this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Linda Bates"
},
"reviewBody": "I took some of the reviewers advice and cut the sugar back to 1 Tablespoon per batch of brine. Big mistake. The pickles are so sour and vinegary that we cannot eat them. I am opening the lids now and dumping sugar into each jar in the hope that I can save them. As they are now I have to throw them out. My advice is to follow the recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Talcott"
},
"reviewBody": "I love this recipe and so do my family and friends. It says to eat the pickles in a month but I've found they stay good for months. I always add more garlic and peppers but I like really spicy pickles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen"
},
"reviewBody": "My husband has yet to taste anything too hot, so I quadrupled the crushed red pepper flakes and seeded and quartered two jalapeno peppers for each jar and omitted the sugar. I cut the cucumbers in quarters and we waited a week to try them. They stay so nice and crunchy. I'll keep a few jars in the fridge year 'round as long as the cukes are available."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Marie"
},
"reviewBody": "These are the best fridge pickles I have ever made. Just spicy enough with a touch of sweet at the end. I think using fresh, good garlic is key. I followed this recipe exactly and could not be happier with the result. All of my family and friends are asking for these pickles now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie Budak"
},
"reviewBody": "I made a batch of these, but since we don't like sweet pickles, I just left out the sugar entirely. I also used fresh jalapeno peppers sliced up in place of the red pepper flakes (a friend gave me a bunch from her garden and I didn't know what to do with them). My husband LOVED them! I thought they were pretty good, but the pickling spice was even a bit too sweet for my taste. I prefer more of a tangy, garlicky pickle and the pickling spice has too much of a cinnamon flavor. I'm masking another batch with more garlic and no pickling spice. We'll see how that goes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tressa Slama Setness"
},
"reviewBody": "I just made these yesterday...I couldn't wait the week to try them so I just did. OMG!! They are perfect! This is a recipe that I will use every year from now on! I used half the sugar called for and doubled the brine as some others suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauri Huber Nye"
},
"reviewBody": "These are very simple and taste great! I add a tablespoon of mustard for a little extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jeanbess"
},
"reviewBody": "I am in the middle of making these pickles do you strain the spices out when you put it in jars or leave them in"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dstapleton"
},
"reviewBody": "Similar to another recipe I make - try adding some sliced jalapenos for a bit of flavour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "I cut the sugar in half and they were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason"
},
"reviewBody": "Very good. A little messy, but great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Merryfield"
},
"reviewBody": "I was skeptical on this one but so glad I tried it! I tripled the basic recipe and added some sweet red peppers, white onion chunks, jalapeño slices instead of red pepper flakes, extra garlic, some peas in the pod from my garden. I only used a small amount of sugar as I wanted dill pickles. I started eating the second day. Testing every day. Hoping they stay crunchy for the whole month. I only had pint jars and they don't hold much, but I used small pickling cukes. This is so easy and fun! Fun to give to friends who will want to try it also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zoey's Mimi"
},
"reviewBody": "I just finished mixing everything together for three batches of these pickle's, because the last time I made them there wasn't enough for everybody! I have actually been begged to make these. I use regular cuke's sliced into rounds. I also triple the brine to make sure I have enough. The one thing I didn't like was the all that chopped dill in the jar when you're eating them. I bought a tube of dill paste, which dissolves into the liquid, and added sprigs of fresh dill. Added far less sugar, and 3 Tsp. of hot pepper flakes. We all like them spicy!! The worst part is having to wait 10 day's to eat them, but it's definitely worth the wait!! :=)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/75145/spicy-refrigerator-dill-pickles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
"name": "Canning and Preserving Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17621/side-dish/sauces-and-condiments/canning-and-preserving/pickled/",
"name": "Pickles"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/75145/spicy-refrigerator-dill-pickles/",
"name": "Spicy Refrigerator Dill Pickles"
}
}
]
}
}
, "about": [
]
}
]