				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spiced Slow Cooker Applesauce"
,"datePublished": "2020-03-05T00:05:10.000-05:00"
,"dateModified": "2023-01-12T12:30:00.000-05:00"
,"author": [
{"@type": "Person"
,"name": "A.S.G."
,"url": "https://www.allrecipes.com/cook/2222528"
}
]
,"description": "This crockpot applesauce is easy, delicious, and cooked to perfection in a slow cooker with brown sugar and pumpkin pie spice. It&#39;s a family favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/36BlZB37JSZqPKoE04tlmZsKKrE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1046676-spiced-slow-cooker-applesauce-NERDBOX-4x3-1-60881fed06964230acd0b8864e20c3c8.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spiced Slow Cooker Applesauce"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "426"
}
,"cookTime": "PT390M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "151 kcal"
,"carbohydrateContent": "39 g"
,"fiberContent": "3 g"
,"proteinContent": "0 g"
,"sodiumContent": "8 mg"
,"sugarContent": "34 g"
,"fatContent": "0 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"8 apples - peeled, cored, and thinly sliced",
"0.5 cup water",
"0.75 cup packed brown sugar",
"0.5 teaspoon pumpkin pie spice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in brown sugar and pumpkin pie spice; continue cooking another 30 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT400M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol McGuire"
},
"reviewBody": "I've made this many times and each time it was delicious. Didn't have any brown sugar so I used maple sugar and it was equally delicious. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wljeaj"
},
"reviewBody": "So easy &amp; delicious. The only thing I did differently was to reduce the amount of brown sugar to 1/2 cup. Oh, and mine was done in 3 hours on low."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Boqueron Becky"
},
"reviewBody": "This was so easy to make an absolutely delicious. However, instead of pumpkin pie spice I used apple pie spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rich McInnis"
},
"reviewBody": "I made this last night. I was thinking too much brown sugar. Perfect the way the recipe says. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Butterflymom"
},
"reviewBody": "Nice and creamy. Cooked in crockpot for about 7 hrs. Only added about 5 apples (that’s all I had), 1/4 C white sugar and maybe 1/2 C water and cinnamon (about 2-3 tsp). Once done, I strained the apples (reserving the liquid, just in case) came out great. I didn’t need the liquid. I may not have needed the sugar but I like sweets, so you may want to add little at a time. I threw everything in at once, didn’t need to add the sugar last and cook for an additional 30 min....the crockpot time was enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LadyB"
},
"reviewBody": "I used the recipe as a base. I substituted apple juice for the water. Also used very ripe pears with the apples. Cinnamon and nutmeg to taste. Because the apples and pears were so ripe, and sweet on their own, I did not add any sugar. (Plus there was sweetness by using the apple juice rather than water.) Turned out great! Made it to serve with ham for a holiday dinner, and was a great side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Marie Hopkins"
},
"reviewBody": "Easy and good! I’ve lost count of how many quarts I’ve canned with this recipe. I’m sure glad I ran across it. When I saw it was from Allrecipes.com, I knew it would be a keeper. I don’t find many disappointments on that website."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Rosencrans-Kelly"
},
"reviewBody": "I am surprised to see so few reviews on this recipe. I and at least 3bag he's each year. I use 3 different kinds of Apple's for each batch and I love it!!! I start it up before I go to bed and had it off in the morning. I will be handing this recipe to my children to pass on. The 3 Apple's I use are macintosh, golden delicious and jona gold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gorjissmom"
},
"reviewBody": "Very tasty! A bit sweet but good and easy. Removed a star since it was SOOOO watery. Definitely use less water or even none (as apples create their own juices). Can also use less sugar and it'll still be good. I didn't have pumpkin spice on hand so I substituted with cinnamon, nutmeg and a dash of all spice. Will make again with little to no water added."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KWheaton"
},
"reviewBody": "Less water &amp; less time in cooker. Only use cinnamon &amp;/or pumpkin spice as Allspice &amp;/or nutmeg is not as good of flavour - they make a different taste - less appealing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin1020"
},
"reviewBody": "Substituted water for apple cider and omitted the sugar. Definitely sweet enough just like this! And delicious! Would have given 5 stars but I altered from original recipe after reading previous reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Really liked this one!! I used 4 apples. Cut the sugar down to just 2T of brown sugar. Upped the pumpkin pie spice to 1 t and that was great. Might even add more next time. I also think 1/4 c of water is too much on the stove so probably just 1 T of water next time. Overall fantastic recipe and will make again! Goes great on oatmeal or a bowl of puffed cereal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcwilkes"
},
"reviewBody": "This was fantastic! Doesn’t make a lot but was perfect on our German night with potato pancakes and sausage! Enough was left over for me to freeze for next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beth Bell Nielsen"
},
"reviewBody": "I used 11 small gala apples and the taste was great but it was super runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Divers"
},
"reviewBody": "Admittedly I followed other users and reduced the sugar and water, but this was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PattyG"
},
"reviewBody": "I made this after we had too many apples from a family apple picking trip. I reduced the sugar to 1/4 cup because we had sweet gala apples. It was perfect !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sukismom"
},
"reviewBody": "First time I've made applesauce with brown sugar. Very good flavor, not too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabbie “Gabbie”"
},
"reviewBody": "This was my first time making this recipe! Super easy and delicious! My husband who doesn't like applesauce put it over his vanilla bean ice cream and said it was awesome! I did make a double batch and only used 1 cup of brown sugar and used 1 tsp. Of cinnamon and 1 tsp. Of pumpkin pie spice. Will make again! I used a combination of \"Jonathan\" Apple's and \"king\" Apple's from our trees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BevnOsos"
},
"reviewBody": "EXCELLENT! We like ours a bit less sweet so I cut back on the brown sugar and used 1/4 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "My first time making applesauce other than the old fashioned way. So easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momblohm"
},
"reviewBody": "I made 2 batches. First batch, following the recipe, was WAAAY too sweet—too much brown sugar; it tasted like apple pie filling. Sooo, I cut back a little on the sugar in the second batch, added 2 more apples and 2 pears. I combined the 2 batches—much better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angela21"
},
"reviewBody": "Very Delicious!!! My kids thought they were in heaven"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie H."
},
"reviewBody": "Substituted orange juice for 1/2 cup of water. Win!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Keenan"
},
"reviewBody": "Absolute favorite! I love this recipe. It's so simple which is probably why it is so good. I love honey crisp apples, but any apple works well when cooked slowly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoCalCindy"
},
"reviewBody": "I made this on Christmas Eve, everyone loved it and it went great with the Ham. I used 1/2 Gala apples and 1/2 Granny Smith. I used 14 apples and only 1/2 Cup brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi Fentiman"
},
"reviewBody": "Excellent! I had about 2 pounds of apples already cut up, left over from another recipe and they had the skins still on. It helped with keeping the apple sauce a little thicker if you like it that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Jenkins"
},
"reviewBody": "It was super easy and delicious. Instead of brown sugar, I used honey and cinnamon....and my aunt’s secret ingredient!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dabblermom"
},
"reviewBody": "Have not made yet but, after looking at many reviews, I will modify it a bit. Something I noticed was that so many make this for just a small amount. When we make applesauce, we make enough to can in pints (or freeze), rather than relying on the fridge to keep it long enough without molding. So many reviewers said they hated peeling the apples. There's a great variety of apple peelers, at affordable prices, which make it much easier and faster to peel. If made very often, it will easily pay for itself. Quite a few mentioned it being too watery. It needs to be cooked down to be thicker if too much water was used, especially. Our apples are quite sweet with a bit of tartness. Because we have our own tree (which totally overproduced this year), my husband hadn't sprayed them at all this year, therefore, they are organic, also. Unfortunately, organic often means \"ugly\" since they aren't sprayed for pests or disease. My granddaughters have always loved the plain applesauce with nothing added, so some batches are made for them. My husband wants something more added to it, so will do that for him. Plan to use the plain as a replacement for oil in some recipes. People who have their own trees, that produce a lot, could also make fruit leather using thicker applesauce, make apple butter, or simply slice and dry in a dehydrator or oven. Many wonderful apple recipes out there!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gright"
},
"reviewBody": "Was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missatee"
},
"reviewBody": "I just used brown sugar and cinnamon . The smell in the house was heavenly and reminded me of growing up during the fall. It's simple , easy to make and tastes heavenly. I added a dollop of cool whip on top. Delicious ! Will definitely satisfy that sweet tooth This is now in my rotation of desserts or snack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "I had no idea how to make applesauce so I started with this recipe but read the reviews. I made it today and used 9 gala apples, 1/2 cup of water, 1 tsp of apple pie spice and 1/4 cup of brown sugar. The rest of the directions I followed and after it was done in the crock pot, I let it cool. It was not too sweet, it was not too watery... it was delicious. Will make over and over again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "temp655"
},
"reviewBody": "I’ve made this several times and it’s our favorite dessert. I sometimes use a half cup of brown sugar depending on the sweetness of the apples. I always add a bit more pumpkin pie spice than the recipe calls for but find a whole teaspoon is too strong for us. Highly recommend trying this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trudy"
},
"reviewBody": "I love this recipe! I have made 3 batches and make changes every time which is why I love it and it is wonderful every time.\nMy changes: 1 c. water, 1/2 tblsp. cinnamon (I like lots), 1/2 c. sugar (I prefer white), 1/2 tsp. allspice, pinch or 2 nutmeg, and salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kassafrass"
},
"reviewBody": "This was so yummy! I originally made it because my SO loved applesauce. I know what I'll be doing with most of the fresh apples I got this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkorelc"
},
"reviewBody": "I made this yesterday and served it with breakfast this morning. My husband loved it so much he did a dance. Confession: I accidentally threw in the sugar and pumpkin spice at the start but the sauce still came out tasting phenomenal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb Mueller"
},
"reviewBody": "did anyone freeze this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Modesty Mullins"
},
"reviewBody": "Delicious recipe, I believe it's better than store bought. My kids are really picky eaters but they really enjoyed this recipe. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "KenC"
},
"reviewBody": "there is a lot better uses for apples than this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "I did not add any water, apples have enough moisture that it would have been too watered down. Instead I squeezed one lemon into the crockpot and cinnamon and freshly greater nutmeg and only 4 tablespoons brown sugar, even that was more than enough sweetness! Turned it on and went to bed, in the morning ran the immersion blender and had freshly made applesauce for breakfast. Thanks for jogging my memory, so much better than jarred applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steph"
},
"reviewBody": "I loved this! I cooked the apples (Granny Smith) in crock pot with all ingredients (substituted pumpkin pie seasoning to just cinnamon and nutmeg) on high 2 hours and then lowered temp to low for another hour. Then blended the mixture in a blender!! It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shane Danae"
},
"reviewBody": "great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aynsley"
},
"reviewBody": "So easy. I made some modifications based on what I had available: 3 big gala apples and 2 small pears, 1/4 cup brown sugar, 1/4 tsp cinnamon, 1/8 tsp nutmeg, and 1 star anise (for licorice flavor to make it less sour). Put everything in the crock pot for 8 hours overnight on low. Probably could have been less time if I was watching it during the day. Excellent recipe for using up my fall fruits. Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HollyN82"
},
"reviewBody": "Great recipe. I added more cinnamon, but I love cinnamon and am not super into nutmeg so that's more personal preference than recipe quality."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bmcdonald01"
},
"reviewBody": "I printed this recipe way back in 2010 and finally got around to making it yesterday! Anyway, I don't know if I will make it again--will search for other applesauce recipes before coming back to this one. I love the use of a crock pot and if I had to rate it on simplicity alone, I would give it 5 stars. \n\nMy first issue is with the quantity of apples--it states 8 apples but what size? Why not simply say how many cups of sliced apples; 8 large apples will give a different quantity compared to 8 small apples. I used 9 apples since two were \"small\" (in my opinion). I have a standard size Rival crock pot that dates back to the 70s (I think it's a 3-qt size) which still works just fine. The sliced apples nearly filled the crock pot. The amount of water seemed like it might not be sufficient considering the number of apples but I followed the recipe. I set the crock on low and 4-5 hours later when I checked, the apples didn't appear to have cooked down at all. After 8 hours, things hadn't changed much. I left the crock on low all night. When I checked around 7:00 a.m. today, the apple slices still hadn't cooked down much. Frustrated, I turned the crock pot on high. I was gone all a.m. and when I got home around 1:00 p.m., the apples had finally cooked down so it was a somewhat chunky sauce. So, it took almost 24 hours for this to be done and it likely wouldn't have been done in that time if I had left it on low. I ended up with slightly less than one qt of apples"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany Steiminger"
},
"reviewBody": "Tastes exactly like how I would think fall tastes like. Wonderful! I cooked it on high for 4 hours and it still turned out great. :) Instead of water I used some Trader Joe's spiced apple cider that I had in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eholt"
},
"reviewBody": "I made this, it was very sweet. I would decrease the sugar. I added more cinnamon because I did not have pumpkin spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "leadfoot"
},
"reviewBody": "not bad. You don't need ANY sugar, depending on what kind of apples you use. I never put sugar in mine, and add a piece of a cinnamon stick! Always turns out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cyndy"
},
"reviewBody": "In my book, all applesauce is great. But why not eliminate sugar altogether and add at end, if necessary? Some said this was too watery...just leave lid off and “cook down”. Mix and match apples and leave skins ON! Then at very end, run thru a colander. Healthier and you’ll get a nice color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma T."
},
"reviewBody": "Awesome recipe!\nFollowed what a lot of others noted in reviews/comments and cut brown sugar back to 1/2 cup. That was plenty sweet (more would have been too much). Made a great warm fall dessert!\nDidn't realize how little it would make. Will likely be doubling next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Plumb"
},
"reviewBody": "Yum. This time around, I doubled the number of apples and added 6 pears. I also made some additions - with ~ 1 TBSP vanilla in the first cook and added nutmeg and allspice, and extra cinnamon with the brown sugar. It's just a little bit spicy and delicious. We ate the first bit of it hot over vanilla ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stanabaldwin"
},
"reviewBody": "I made no changes, this is a very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Levy"
},
"reviewBody": "Excellent. Next time I will add half of the amount of water, it was too watery for my tastes. Also I added cinnamon instead of pumpkin spice (didn't have any) and added a little lemon juice to keep the apples from turning too quickly but it nicely balanced the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMP"
},
"reviewBody": "No changes made to it. Would definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Really like this recipe because it is easy and tasty!\nWas really lazy once and tried it without peeling the apples - but that's a necessary step - won't skip that one again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sherry Quast"
},
"reviewBody": "Delicious flavour but VERY sweet, just like apple pie without the crust !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimmieloubilliebob"
},
"reviewBody": "Cut up to smaller pieces. I had to mash a bit. But everyone loved it and was great with ham."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MischiefMom"
},
"reviewBody": "This is amazing but the sugar needs to be adjusted. After the first 6 hours, when it is time to add the sugar and spice, do a taste test for sweetness. I only needed to add a pinch of sugar and I love a sweet applesauce. Adjust for taste. \n\nI felt like the amount of spice was perfect. \n\nI suggest using a combination of gala and golden delicious apples. They are the sweetest apples that are readily available. Using more than one type of apple adds a more complex flavor. \n\nIf you use those sweet varieties of apples, you might not need to add sugar at all! That makes for a great option for people who need to limit their sugar. \n\nInstead of water, add some apple juice. This also contributes to a natural sweetness. I use an organic pure gala apple juice with no sugar added though any apple juice should work fine. \n\nMy family likes this so much, they request it as gifts!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CTBookworm"
},
"reviewBody": "I did make one addition. I used apple pie spice and pumpkin pie spice in mine. This is the second time I made this and it is a big hit for thanksgiving. One of these days I'm going to double it and can it for later use in the winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jdziekan"
},
"reviewBody": "OMG it was so yummy. For the cook time I actually cooked the apples on high for about 4 hours and I used 4 granny Smith apples and 4 gala apples. for now on I'm going to make my applesauce instead of buying it. thank you for sharing the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaisieMay"
},
"reviewBody": "As written, this is a good applesauce recipe. I used it as a starting off point to make a perfect batch of applesauce. \n\nFirst, I don't use 8 apples. I buy several packages of not-quite-perfect apples at a discount and use them to fill my slow cooker (peeled, cored, and sliced). Instead of water, I use apple juice or cider. I cut the brown sugar back to 2 or 3 tablespoons and sometimes use just cinnamon. We like it a little chunky and served warm. Perfect for topping oatmeal or just eating as-is. Can be canned to make a nice gift or for longer storage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "plusses- will not scorch, doesn't need attention. Yummy.\n\nMinor minus- if you are doing a LOT- for canning, say- the batch size is dictated by the size of the crock and may slow you down overall. Not a thing wrong with the finished product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnyrobey"
},
"reviewBody": "plusses- will not scorch, doesn't need attention. Yummy.\n\nMinor minus- if you are doing a LOT- for canning, say- the batch size is dictated by the size of the crock and may slow you down overall. Not a thing wrong with the finished product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "diana"
},
"reviewBody": "I loved it! It was easy to make but I did make a few changes, I added a little less sugar and used cinnamon instead of pumpkin spice. I made this on a Sunday so I cut up the apples threw them in the slow cooker, came home from church put in the spices and sugar and it was basically done! Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonie"
},
"reviewBody": "Now a regular route so our eve snack is warm 'n ready! You can even cut down the br. sugar if the apples aren't too tart!! Don't forget how nice it makes your home smell all day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kakraft24"
},
"reviewBody": "In my opinion, it called for a little too much water and a little too much brown sugar. If I remade it I would only use 1/2 cup brown sugar and add water as needed. I felt like I couldn't taste the apple over the sugar. I didn't have pumpkin spice so I used cinnamon, dash of clove &amp; nutmeg. I might try it again next time with these modifications but it is still a pretty easy recipe to execute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dani Steinbach"
},
"reviewBody": "I've now made my 6th batch of this recipe and love it even more each time. I used homemade pie spice recipe and love this batch even more! For chunkier applesauce, cook it 6 hours not 8. I use less water when I'm going for smoother applesauce, otherwise it turns out too watery. Thanks for the great recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RebekahGCJ"
},
"reviewBody": "A quick family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paws"
},
"reviewBody": "This was fantastic. I changed the spices to 1 tsp cinnamon, 1 tsp ginger and 1 tsp fresh grated nutmeg and 1/2 tsp cloves. I cooked on low for 4h ours and then high form 1 hour. I also put in 2 tablespoons butter it was done cooking and stirred to melt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Kennedy"
},
"reviewBody": "Delicious. We ate it warm with ice cream. I used apple cider instead of water and I just eye-balled the amount. I reduced the amound of brown sugar to 1/4 cup and it was great but the bf thought it could be sweeter. When I mentioned that it would probably taste like pie filling if I used more sugar, he gave me the \"what's wrong with that?\" face, so...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMILLER"
},
"reviewBody": "My kids love this recipe! The brown sugar adds a different twist that we all enjoy. I run my through a food mill afterwards. Family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "joanne"
},
"reviewBody": "This recipe is much like mine. But I made it without sugar and used good, flavorful apples, mostly gala. It did not need sugar! Also, you can use only cinnamon generously to taste, but I'm going to try the mixed spices too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jahill17"
},
"reviewBody": "I only used four apples, Granny Smith. This is amazing. So easy and so good!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rdcolnar"
},
"reviewBody": "So good! Pumpkin pie spice was a great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chinya"
},
"reviewBody": "I loved this recipe! I have never made applesauce, and now I can never go back to store bought! The only change I made was to go down to 1/2 cup of brown sugar. I used gala, fuji, and Granny Smith apples. I don't know if my crockpot is particularly slow, and I could see that this was not cooking down very well on the low setting, so I cooked it mostly on high. It was fabulous, and even better the next day! Can't wait to make this again, and my grandchildren agree - they gobbled it up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DeeND"
},
"reviewBody": "Very easy recipe and tastes great. Will make this again. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Jane Teagarden"
},
"reviewBody": "My favorite way to make applesauce! I always make it on New Year's Day to go with our pork and sauerkraut. The brown sugar makes it taste very rich. I have substituted apple pie spice or cinnamon for the pumpkin pie spice - and all three ways are delicious! You can use an immersion blender if you want to purée it a little more when finished cooking as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha Ann Marie"
},
"reviewBody": "I put this in about 9-9:30 last night because I was super excited to make homemade apple sauce for the first time so I had to wake up early to check on it, but it was so worth it. I used about 6 Granny Smith apples that were in my fridge, 2/3 cup brown sugar, 1 full teaspoon of pumpkin pie spice,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PB"
},
"reviewBody": "This was very good! I had gala apples so I used them. I only had one fourth cup of brown sugar, and I'm glad I didn't put any more. I didn't have pumpkin pie spice so I added nutmeg. I didn't have eight hours so I put it on medium for four hours and it was perfect! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ldavido"
},
"reviewBody": "used 5 mcintosh and 3 granny smith"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddiana02"
},
"reviewBody": "Used organic Granny Smith and light brown sugar with the pumpkin pie spices.....never buy store bought again. Cook in crockpot for 6 hours"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joon"
},
"reviewBody": "Great!!! Nothing more to say!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea"
},
"reviewBody": "I absolutely loved this! The only thing I did different was that I skipped the sugar to make it healthier for my 2 yr old and he loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mellie"
},
"reviewBody": "Followed the recipe to the T. The Granny Smith apples I used were super tart so the amount of sugar called for was perfect. And I had no problems with amount of water either. No watery applesauce here. Will be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margi Bilock"
},
"reviewBody": "This applesauce was delicious!!! So much better than store bought. I took advice from other reviewers and added only 1/8 cup of brown sugar for a doubled recipe. I still thought that was too sweet so when I made it again, I just sprinkled about 3-4 tablespoons of brown sugar on the apples and left it at that. It came out perfect for my taste. Thumbs up from neighbors who tried the first batch I made. Basically, just adjust the brown sugar to the degree of sweetness you like and leave everything else in the recipe as it is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LadaFun"
},
"reviewBody": "Delish! The only change I made was to use mainly cinnamon, which a few shakes of pumpkin pie spice - just personal preference as I don't like ginger. I think one could easily reduce the sugar depending on if you're using a sweeter Apple, or a more tart variety. I used a potato masher to smush up the apples at the end. Smells and tastes like fall in a mug!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Burcaw"
},
"reviewBody": "I followed the recipe and it did come out watery. I did read reviews prior to making this. Next time I will use less water and less brown sugar. Otherwise , it was very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leandra"
},
"reviewBody": "My sister is sensitive to uncooked apples so store bought applesause is hit and miss. This is always good to her and the whole family loves it. I tend to add less water so it's not so soupy but other than that it is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Weigel"
},
"reviewBody": "Awesome! Simple and Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lilann1961"
},
"reviewBody": "Delicious and smells even better! I left the apple skins on, and agree it really didn't need the water (and I only added 1/4 cup). I used 1/2 a cup of brown sugar. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamamel"
},
"reviewBody": "I have a Squeezo food mill, so I used that to puree my whole apples after I had steamed them in an electric roaster with the water. A big investment worth every penny, as you can make gallons of applesauce in one afternoon. Once I had my puree, I added the other ingredients and then let it simmer. Yum! Delicious! Loved the brown sugar and the apple pie spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelsie Bergquist"
},
"reviewBody": "I followed the directions except that I didn't have pumpkin spice so I used all spice and added a few pinches if salt because I did a huge batch! Turned out very flavorful! My house smells amazing too!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "This is a great recipe, I will definitely be making it again! Next batch will have more apples, a little less sugar and up the spice to 1 teaspoon. I prefer to add more apples instead of less water, my family and I like our sauce chunky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BeachDreamN"
},
"reviewBody": "Very easy &amp; the kids liked it. I'll try less sugar next time, as my apples were pretty sweet already. Definitely reminded me of fall. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Thun"
},
"reviewBody": "This recipe is a keeper for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have always made applesauce on the stove-top, but I had to use the slow cooker for this year's Thanksgiving dinner. I used a combo of Gala, Honeycrisp, Jona Gold and Grannysmith.I don't care for pumpkin pie spice, so I just added a cinnamon stick. It came out really good, although as another reviewer mentioned, the color was a bit dark. For those complaining that it was too sweet or too watery, I have a suggestion; from years of trial and error, I make it a habit to taste the apples before adding any amount of sugar or water. I have used apples that were so sweet and juicy, they barely needed anything added and I have used apples that were dry and not very sweet and had to add more sugar and water than called for. If you can find them, try Jazz apples. I discovered these gems last summer in a grocery store. They were sold in a 3 pound bag. They make the absolute best applesauce. I had to keep the fridge stocked with it for months per DH's request. They are not always available here, but when they are, I stock up and make batches to freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trixie"
},
"reviewBody": "Yummy! I used 5 gold delicious and 5 red delicious apples since that's what I had on hand and wanted to use up. I sliced very thin using my mandolin. Added 3/4 cup water and cooked on low for six hours. I added 1/2 cup brown sugar, 1/2 tsp. cinnamon and dash of nutmeg at the end, stirred and heated through for another 30 mins. Wonderful. I honestly don't see how one could mess this up since it tasted perfect without adding anything. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tracey Terian Sionkiewicz"
},
"reviewBody": "Added more apples (maybe 25-20 but, i'm cooking for a big family) so I also increased the sugar and pumpkin pie spice. Less water and also added 1 tablespoon cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "First time making applesauce. Awesome recipe. I put the sugar and spice in at the beginning made my house smell delicious. My husband said it tasted like the filling to a Mc Donald hot apple pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KARASAY"
},
"reviewBody": "add additional cinnamon"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/81/side-dish/",
"name": "Side Dish"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1333/side-dish/applesauce/",
"name": "Applesauce Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/149218/spiced-slow-cooker-applesauce/",
"name": "Spiced Slow Cooker Applesauce"
}
}
]
}
}
, "about": [
]
}
]