				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spicy Flat Iron Steak Rub"
,"datePublished": "2020-03-05T00:05:13.000-05:00"
,"dateModified": "2020-03-05T00:05:13.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Michelle Berger "
,"url": "https://www.allrecipes.com/cook/michelleberger"
}
]
,"description": "Add zesty flavors to basic steak with this spicy rub combining brown sugar, onion powder, garlic powder, and a variety of hot chile powders."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/KSWx8-a8rG5P0KbfKfhYWZbjFwQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/196641-b863650a0a994ca0a15463f21ed23539.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spicy Flat Iron Steak Rub"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "42"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "586 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "155 mg"
,"fiberContent": "1 g"
,"proteinContent": "47 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "185 mg"
,"sugarContent": "7 g"
,"fatContent": "40 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 tablespoons brown sugar",
"1 teaspoon garlic powder",
"0.5 teaspoon onion powder",
"1 tablespoon chili powder",
"1.5 teaspoons ancho chile powder",
"1 teaspoon chipotle chile powder",
"1 tablespoon salt-free seasoning blend",
"salt and black pepper to taste",
"1 (2 pound) flat iron steak",
"0.25 cup vegetable oil" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix the brown sugar, garlic powder, onion powder, chili powder, ancho chile powder, chipotle chile powder, salt-free seasoning blend, salt, and pepper together in a bowl until thoroughly blended. Sprinkle over both sides of the steak, and rub into the meat. Cover, and refrigerate at least 30 minutes, or up to 2 days."
} ,{
"@type": "HowToStep"
,"text": "Before cooking, drizzle steak with vegetable oil, and rub the oil into the meat. Cook as desired."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryb Katz"
},
"reviewBody": "Tender and delicious—this was a big hit with us. I made it as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim"
},
"reviewBody": "This is a great flavorful rub, the steak turned out juicy tender and delicious; I added some red pepper flakes to give it a little more kick, and this worked well with the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "this was pretty good.. i'm looking forward to making this as a rub for chicken and pork (we don't eat a lot of red meat), but today i used it as part of a marinade for my tilapia filet that i broiled.. i just added some lime juice and a bit of oil to it.. i left out the brown sugar as i don't care for sweet, as well as the ancho chile powder since i don't normally buy that type of chile powder.. either way i'm sure i'll be making this again.. ty for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "This is a fantastic rub! To keep this paleo I used coconut sugar in place of the brown. Yummy stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "UnsungONE"
},
"reviewBody": "Cut back on sugar a little but very good \nSweet &amp; spicy taste \nMade this as a carne asada rub replaced the 3 chiles spices with 1 tsp cayenne pepper &amp; 1 tsp habanero 1 tbsp of (any steak/carne asada seasoning) \nServed with Mexican rice and beans it was something different and flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corah3"
},
"reviewBody": "Great rub. Very versatile. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bikerchickie"
},
"reviewBody": "LOVE this. Also very good on flank steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Forschler"
},
"reviewBody": "More sweet than spicy in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "June Clarke"
},
"reviewBody": "I am visiting with my son and bought some top round steaks to cook for him.After looking up your recipe I decide to try it. I must say it turned out very well, although I did not have ancho chile powder or chile powder. I used a chipolte spiced barbecued sauce, some steak rub along with the other ingredients and was happy with it. I will try it again when I can get the other spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilkaisha"
},
"reviewBody": "I've given up making this every time I use it. I now quadruple it and keep it in my pantry so it's ready to go whenever I want it (all the time!) My variations on this are based on my pantry: I use 1 teaspoon of cayenne pepper instead of the combination of chipotle and ancho, and I use Lawry's seasoning salt, skipping the \"to taste\" salt. This rub is amazing! I use it on sirloin steaks all the time, and they are juicy, and perfectly spicy-sweet. Thank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEADTIRED"
},
"reviewBody": "I used this on sirloin strip steaks &amp; they were so juicy and delicious. Didn't have chipotle or ancho chili powder so I used about 1/4 tsp each of cayenne pepper, cumin and red pepper flakes. I cut the sugar down to 1 Tbsp and only used about 1/2 Tbsp of chili powder. We found this was perfect. I think that if you use all the chili powder called for it would be too much. The steaks were so juicy and the juice was delicious. Served with perogies and mushrooms cooked with garlic and peppers. Resturaunt quality meal. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiff"
},
"reviewBody": "This rub was fantastic! I scored my steak and let the rub penetrate for about an hour before grilling. I had to alter the recipe a bit due to ingredients on hand, I didn't have ancho chili powder (not sure what this is) so I used cayenne pepper and some red pepper flakes and I also used a regular season salt instead of a salt free seasoning. Only complaint I had from the family is I only did this on one of the steaks for a test run. I enjoyed mine but my family was regretful I didnt \"rub\" theirs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Anderson"
},
"reviewBody": "I can see using this recipe on any beef, grilled, fried, broiled, or whatever you like. I modifed the recipe to include 1/2 of the sugar, due to other reviews, and also did not have all the various chili powders, so I substituted cumin, cayanne pepper, white pepper, and a spicy salf free seasoning blend. It turned out wonderful. Will definetly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela F."
},
"reviewBody": "This was really good! This was the 1st time ive ever used a dry rub. I let it sit overnight and it was great. I plan on using this rub often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mydogsletmelivehere"
},
"reviewBody": "I'm a vegetarian and my boyfriend eats meat. I used this rub on his steak and my soy \"chicken\" and we both loved it. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "camohn"
},
"reviewBody": "I liked it a lot but gave it 4 as I did change it a little. 1 TB of chili I used as directed but adding another 1 to 1 1/2 tsp each of ancho and chipolte peppers sounded like it was going to be a bit TOO spicy for my \"moderately spicy\" taste. I used what I had on hand (red pepper flakes and cayenne as \"other peppers\") and only used a 1/4 tsp...this was plenty spicy for me. I also added 1/4 tsp of cumin....it just seemed a natural pair with chili poweder and isn't too much on the \"heat\" like the hot peppers. This is probably one you won't make everyone happy as different folks have different likes on how hot they like things."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimmysam"
},
"reviewBody": "Very balanced and delicious it is beefs best friend reminds of the outbacks steaks in a great way I will use this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "heidird"
},
"reviewBody": "Flavor a bit too strong for us. Sorry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freckles"
},
"reviewBody": "YUMMY YUMMY YUMMY! I use flank steak as it is my fav and is more tender than flat iron or skirt steak. Followed recipe as stated and grilled over charcoal...also have grilled with charcoal and hickory or mesquite DAY-UM WAS IT GOOD! Served with baked taters with all the fixin's and a garden salad. Add hot buttered corn on cob for a very hungry crowd. (double recipe if cooking for more than 4). Try this rub you won't go wrong. Thanks Miki!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alina"
},
"reviewBody": "This was delicious. I changed it a bit and used less of the chili powder I didn't have and replaced that with creole seasoning (also spicy) and garlic herb steak seasoning mix. The oil drizzled on the meat kept the sugar from burning before meat cooked through. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scottjl"
},
"reviewBody": "threw this on some burgers tonight. amazing. was afraid it would be a little bit hot, then i'd get some of the sugar. delight on the tongue. my grocery stores only had \"hot\" and \"mild\" chili powders so i use those an some cayenne pepper as well. coated the burgers and let them sit for a few hours in a ziplock in the fridge. grilled them up. yum. will definitely make this again, and maybe find the right spices too! thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BETHANNE770"
},
"reviewBody": "Good rub, if and only if you like the flavor of chili powder. It was a little to chili tasting for me, but the spice level was nice and I liked the sweetness of the brown sugar. Overall, it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "spoppe"
},
"reviewBody": "Pretty good rub - actually turns into a glaze on the grill, which makes it very good. Be careful though, after it's taken off the grill it will lose a lot of its flavor while \"resting.\" Cook a couple of minutes less than you think it should."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyByrd"
},
"reviewBody": "Yum. I cut back the sugar by 1/2T, left the rest as-is. This was wonderful served with Texas Caviar and a squeeze of fresh lime. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cocina JNOTS"
},
"reviewBody": "Too sweet. Less sugar would be better. Be carefull when hosting and serving this dish. Everyb0ody does not like sweet meat. I found this had to much sugar. I would reduce the sugar amount and that should do the trick. \nThanjks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Draines"
},
"reviewBody": "Very delicious! Spicy, yet sweet. My husband enjoyed it but thought it was a little too sweet--might want to reduce the sugar and add more spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MummyJacks"
},
"reviewBody": "Really good steak rub! I didn't have three kinds of chili powder on hand, so I just added 1 tbps of the plain old chili powder, and then a couple dashes of paprika, rosemary, thyme and cajun each, yum yum! Only had time to marinate for 45 minutes, and it turned out great! Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "Fantastic rub! I doubled this and used it on baby back ribs, hubby liked it a lot. Best of all, it was salt-free. I did not use the vegetable oil. Despite the brown sugar, this is not a sweet rub, it has a spicy warmth from the peppers, but it wsn't hot. Love this rub. Thanks! I might try this with chicken too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keep It Simple Cook"
},
"reviewBody": "Produced a juicy steak. We enjoyed this. It just seemed like it was missing something. I will use this rub again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis Kempter"
},
"reviewBody": "We enjoyed this rub so much that I made a batch to keep ready and one to send with my daughter back to college (five athletes in one house). This way she and her roommates can enjoy a great quick dinner after a long practice session."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charlie54933"
},
"reviewBody": "I honestly have no idea what kind of steak we used with this rub, but I can't see how any other cut would be different, it was delicious! The brown sugar mellows out the spices, so it's not too spicy or sweet. Hubby and I are trying to alter our diet a little so I went for a rub on our lean steaks instead of a marinade with a bunch of oil. I sprayed both sides of the meat with olive oil cooking spray before putting it on the grill and served over a nice big salad. Wonderful flavor, will definitely make again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ESANDERS"
},
"reviewBody": "This was an excellent steak rub! I used top sirloin and made a few substitutions because I didn't have all the spices on hand. I used cajun seasoning instead of chipolte &amp; ancho pepper and garlic salt instead of salt/pepper. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Ann Girard"
},
"reviewBody": "Wow! I was really impressed with this steak rub. We eat steak frequently, and I always try new and different ways to flavor it. This is one I will definately try again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wsf"
},
"reviewBody": "The title of this recipe is very misleading! This is actually little more than an all-purpose beef rub! I have used it on steaks and ribs, and it is fantastic. And yes, it is good on flat iron steaks as well."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/150292/spicy-flat-iron-steak-rub/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17641/meat-and-poultry/beef/steaks/flat-iron-steak/",
"name": "Flat Iron Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/150292/spicy-flat-iron-steak-rub/",
"name": "Spicy Flat Iron Steak Rub"
}
}
]
}
}
, "about": [
]
}
]