				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spicy Southwestern Slaw"
,"datePublished": "2000-08-14T20:15:15.000-04:00"
,"dateModified": "2022-07-14T16:09:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Dinah"
,"url": "https://www.allrecipes.com/cook/126229"
}
]
,"description": "This is a spicy, flavorful coleslaw speckled with diced jalapenos, red bell pepper and cilantro."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/CGXTHq_44xJF-UdNEwJ-sdcEQrg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/522337-a74a283a96f04a058164e2ce843c1993.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spicy Southwestern Slaw"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "152"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "202 kcal"
,"carbohydrateContent": "8 g"
,"fiberContent": "2 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "15 mg"
,"sugarContent": "5 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"3 cups shredded cabbage",
"1 carrot, shredded",
"1 onion, diced",
"1 red bell pepper, diced",
"1 jalapeno pepper, seeded and diced",
"1 tablespoon chopped fresh cilantro",
"0.5 cup canola oil",
"2 tablespoons apple cider vinegar",
"1 tablespoon white sugar",
"1 teaspoon cayenne pepper",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, toss together the cabbage, carrot, onion, red pepper, jalapeno and cilantro. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl, whisk together the oil, vinegar, sugar, cayenne pepper, salt and pepper. Pour over vegetable mixture and toss to combine. Cover and refrigerate for at least one hour."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MNMMICHELLE"
},
"reviewBody": "Nice change. I used about 1/2 the cayenne and that was spicy enough for me. Also 1/2 the amount of vinegar instead used fresh lime juice. Other than spicy it was a little plain. May try some cumin and garlic next time. Overall I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joedy Fields"
},
"reviewBody": "5 stars for sure. I have made several times. Best salad ever very delicious easy to make, very versatile use in wraps, tacos, sandwiches. Great for flavor and adds that crunch. We like to make pulled pork, I put a pile of salad on plate and top with pulled pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanette Shaw"
},
"reviewBody": "One of my absolute favorite salad sides! Goes great in fish tacos or as a side with beef, pork OR chicken! Especially if you are grilling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jpk"
},
"reviewBody": "OMG! This was so much better than I expected! The only thing I changed was to add one more tablespoon of vinegar, other than that I followed the recipe. Was such a nice addition to my Mexican dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryan Livingston"
},
"reviewBody": "Pretty darn good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Roberts"
},
"reviewBody": "AMAZING!!!! I added mango like others. Also used red onion instead of white. Great with carnitas tacos!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stir-N-Soul"
},
"reviewBody": "Nice slaw when you don't want to use mayonnaise. Noticed people like putting it on their tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dossetee"
},
"reviewBody": "This was a big hit. Did a Mexican themed meal. White chicken and chili, cornbread and wanted a refreshing salad. This was perfect. Enjoyed by all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lemondrop"
},
"reviewBody": "Absolutely amazing! Great on fish tacos. It's on the spicy side, so if you don't like it hot, cut the cayenne back. I also like to add some lime juice/seasoning to kick it up. My husband and I can eat it just as a salad. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Thom"
},
"reviewBody": "Great recipe! I modified it a little by adding jicima and some Anaheim pepper, a smudge more vinegar. Great slaw for topping carnitas street tacos!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsey Haun"
},
"reviewBody": "This was yummy. I served it as a side dish at a Mexican themed dinner party. It wasn't too sweet. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyK"
},
"reviewBody": "We make this at least 2 times a week. We love it. The only change I make is I use 3 packets of Stevia instead of the sugar. Great alone or on fish tacos!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen M."
},
"reviewBody": "Thought this slaw was great! Made it as a side dish with chicken. I thought the heat was perfect. I will definitely try adding some broccoli slaw to it next time. My only change was to use slightly less oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "denmac7"
},
"reviewBody": "Best slaw I've ever eaten. I will definitely make it frequently"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maven"
},
"reviewBody": "I Love this recipe! It's quick and easy and absolutely perfect without any changes. I like spicy foods and the cayenne pepper is appropriate for this slaw and doesn't overpower the delicate taste of the other ingredients. Because I do like spice I keep the seeds and membrane intact with the jalapeño."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Pantaleo"
},
"reviewBody": "I made this recipe to go with tacos and it was fantastic! I used olive oil instead of Canola because that's what I had on hand. Then I ended up adding more cider vinegar to counteract the heaviness of the EVOO. We planned to use it as a side but eventually started heaping it onto the tacos. I would have made a double batch if I had known the two of us would kill the whole bowl in one sitting!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne Armstrong"
},
"reviewBody": "Very tasty. Couldn't wait a hour to eat it and it was still excellent. Served it as a side and topping for hot dogs. It would be great on our shredded pork in a tortilla. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyzubyck"
},
"reviewBody": "Love this recipe! I use bagged coleslaw with shredded green cabbage, broccoli stalks, carrots and red cabbage. I omit the carrot since it's already in the mix. I do tend to add more vinegar than the recipe calls for. Other than that, I follow the recipe more or less. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "I made this last night and it was a hit, nice change from regular slaw. I didn't have the red pepper but put a bag of broccoli slaw added some purple cabbage, a partial bag of 3 color coleslaw and cut down on the oil and added more cilantro and sliced olives. It was so yummy and I can't wait for the left overs as I'm sure it has jumped up a notch in heat!!!! youza!!! good stuff"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MsMellie"
},
"reviewBody": "Seemed to be lacking a bit of flavor, so I added fresh lime juice (about 1 lime), cumin (~1 Tbsp), and a lot more cilantro. Also used green onion instead of white. Love that this is mayo-free and tastes like summer. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mamatova"
},
"reviewBody": "Four stars the way I made it, changes: 3 carrots, 1/4 red onion, 3 oz. EVO instead of canola, 2 tsp sugar. O/W the same. I might make it a 5 star recipe after I taste it again tomorrow! We LOVE hot food and this goes great on the smoke pulled-pork my husband did yesterday. Yahoo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "I really enjoyed this take on slaw. I cut back on the jalapeno and cayenne to compensate for our spice tolerance, but other than that followed the recipe. It had a very nice balance of flavors with the cilantro and red pepper. I served it with \"Pot Roast Dips\" from this site . Some of us topped our sandwich with it and it made for a great pairing. Thanks for sharing this tasty recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry"
},
"reviewBody": "Have made this for 3 different potlucks. All 3 times were a hit great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kristi"
},
"reviewBody": "We did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragon980"
},
"reviewBody": "This is by far my favorite and most frequently made recipe from Allrecipes. I've brought it to BBQs and potlucks and receive lots of requests for the recipe. I admit that it is very spicy, especially if you make this a day in advance. Adjust the recipe if you don't like spicy. My favorite ways to eat this are as a taco topping or as a side with pulled pork. I don't like canola oil; instead, I use olive oil. I love that this is not a mayo-based slaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kare"
},
"reviewBody": "Made it purple instead! I needed to use my head of purple cabbage so I substituted. I didn't add sugar and instead of canola oil I used olive oil. no fresh jalapeño either so I grabbed a few from a jar. it's hot! did not even use the cayenne. pretty tasty! could eat it alone or with tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Kornely"
},
"reviewBody": "love this. great wth mexican dishes or would be great with pulled pork"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristin"
},
"reviewBody": "My husband has a love for spicy food and crisp veggies. I used bagged coleslaw mix, less sugar &amp; a bit more vinegar. It was a huge hit &amp; has been on the menu twice since trying it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sunnie"
},
"reviewBody": "This slaw tastes good and is refreshingly different. I added an extra 1.5 tablespoons of the cider vinegar to make it a little more zesty (for our tastes). I also used red cabbage sliced into long very thin shreds and green onions in place of the regular onion. Giving the slaw ample time to sit allows the cabbage time to macerate, so this is important step in my opinion. The finished product had great flavor and interesting textures. The variety of colors made it visibly appealing as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Just okay - even with half an onion this had too much raw onion for my wife and I. We did like the dressing, although we doubled the amount of dressing while sticking with the recipe recommended amount of slaw. If I made this again I'd cut the amount of onion to maybe a quarter of a sweet onion and maybe add some garlic to the dressing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coreo"
},
"reviewBody": "DELICIOUS!!!!!! I added some spices and a bunch of pickled jalapenos but aside from that it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "April Evans Durco"
},
"reviewBody": "I gave it a four b.c like others I felt it was a little bland the first time I made it. Now I follow the recipe to a T w/ the addition of the juice of 1 lemon, 1 tspn each of cumin &amp; chipotle chili powder, 2 cloves of garlic. Delicious as a side &amp; then we add grilled chicken and crispy tortilla strips to the leftovers for lunch salads."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ReneePaj"
},
"reviewBody": "Delicious. Made this to top some chipotle burgers. Really made the burger!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bobjackson3"
},
"reviewBody": "I made this and is was soooooooo good, my teenage daughter loved it also and she will only eat my regular coleslaw, nobody else's. It had just a little kick that went pop as you ate it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monikitta"
},
"reviewBody": "Served this recipe as a side to a carnitas taco dinner, it was a hit. I used olive oil (instead of canola) and green chile (instead of bell pepper), thank you for posting this recipe~!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this several times and it's one of the few recipes that I make absolutely no changes to - it's perfect. I hate mayonnaise based cole slaw, and this is the perfect answer. The leftovers go GREAT on fish tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ranthony405@gmailcom"
},
"reviewBody": "I've made this several times and it's one of the few recipes that I make absolutely no changes to - it's perfect. I hate mayonnaise based cole slaw, and this is the perfect answer. The leftovers go GREAT on fish tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REDSONJA92"
},
"reviewBody": "I added juice of a lime for some extra zest and a fresh taste to top chicken tacos. My partner said it was the best dinner I have ever made for her. And that, she says, is saying something!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary D."
},
"reviewBody": "We really like this. The amount of cayenne is perfect for us but we do cut it down a little for guests. Makes the best pulled pork sandwiches. I added some cumin and garlic to the dressing. It just gets better after a few days in the fridge so make lots. Thanks for posting this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "im sure this would have been pretty good as written but to suit to our tastes (and my laziness) we made the following changes.. after shredding 3 cups of cabbage i was in no mood to chop an onion so i just seasoned with onion powder.. didn't have bell pepper.. didn't deseed or devein the baby jalapeno.. only used 2 T of canola oil and added the juice of two limes.. didn't add the sugar.. really wanted to add cumin but was out.. very tasty and im sure the longer it sits the better it will taste.. ty for the beginning of our side for tonight"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "simpleisgood"
},
"reviewBody": "Too much onion. The onion overpowers the other flavors. Even though I doubled the cilantro, I couldn't taste it in the end, or the bell pepper. I used a medium sized red onion and only used 3/4 of it because I had a feeling it would be too much.I should have used even less. I also cut the cayenne in half, but it was still very spicy. Any way I look at it, it didn't knock my socks off. I'm going to try it in fish tacos tonight, maybe I'll like it better that way than as a side dish for pulled pork. I will say that it is a beautiful looking dish. Very colorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "Different. We didn't add the jalapeno since we didn't have one &amp; you sure don't need it. We cut back on the cayenne pepper a little, but will try 1/2 tsp next time. Also reduced the onion, pepper &amp; oil. Instead of going through the hassle of shredding cabbage we just bought a bag of coleslaw &amp; that worked well. We put over pulled pork &amp; was very tasty. Usually use creamy coleslaw for things like that, but this was a nice change. Will make again with our reduction changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kc Nordquist"
},
"reviewBody": "Loved the flavors in this. The only change we made was to dump the jalapeno and substitute a milder pepper, 'cause we're weenies. Amazing enough that my picky 12 year old had thirds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sauramomo12"
},
"reviewBody": "I added a second jalapeno - might have been a bit too spicy. It is a great summer cookout side dish! We had it with grilled chicken - it was a delicious summer supper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rita Tucker"
},
"reviewBody": "Excellent if you like spicy. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri Baker"
},
"reviewBody": "I also used broccoli slaw and finely julienned jicama. Big improvement on boring old-style coleslaw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "djf"
},
"reviewBody": "The only reason we did not rate this a 5 was that we thought there was just a little too much cayenne. We will cut it back to about 3/4 tsp next time and may also try adding some cumin as another reviewer suggested. Overall though, thought this was a great twist on coleslaw. I have several recipes that this will work well with. We have to be careful of fat and sugar so I did make a couple of changes in the dressing. Used 3 tbsp cider vinegar, 2 tbsp canola oil, 1 tbsp lemon juice, and 1 tbsp water. Instead of sugar, I added the low calorie sweetner equivalent of 2 tbsp sugar. Really helps reduce calories and tastes great with that combination. I'm planning to serve this on my son's birthday. Think it will be a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "v~"
},
"reviewBody": "Really 5-star but made few personal pref changes for that so gave it 4 star as is ~ great base recipe! thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "scootersandi"
},
"reviewBody": "I liked this a lot, but even though I cut the oil in half, it's too oily for my taste. I used it on pulled pork sandwiches, and they were delicious, but I wouldn't eat this as a \"stand alone\" slaw because of the oil. To moisten a sandwich, it's fine, and you don't need anything else. I'd make this again, but adding only a tablespoon or so of oil. I like the mix of vegetables &amp; spices, though! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DGREENWOOD"
},
"reviewBody": "this was nice and different and had a great spicy bite to it. I will make again but have to learn to make less for just hubby and I."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Haverhals"
},
"reviewBody": "I was looking for a spicy slaw to put on top of a corned beef sandwich. This definitely fit the bill. Maybe a little less onion would have been better. Not something I would want to eat by the spoonful. It just makes a great side dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "This is truly a beautiful dish. It will improve the appearance of any meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "I took this delicious slaw to a hog roast. The jalapeño and cayenne pepper added a nice amount of zing to this recipe. This is recipe that we thought got better as it sat overnight. A nice change from the usual creamy coleslaw and it went really well with the pulled pork. Thanks DEBNJAMES for sharing your version of coleslaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lis"
},
"reviewBody": "Made as a side dish to squeeze in some veggies with our tacos and now I'm hooked. A great change to regular coleslaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Morrison Aleman"
},
"reviewBody": "Love, love, love this!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "desertbaker"
},
"reviewBody": "Spicy hot, but oh so cool! This is a very good side dish to BBQ, Mexican food, or any grilled meat, such as pork, chicken or fish. This is even good scooped up by a tortilla chip. I like that this slaw has no mayonnaise - the oil really seals in the flavors. I embellished the recipe by reducing the vinegar to 1 TBS and adding the juice of 1 lime. I also added more cilantro (but that's to my taste) and 2 TBS of minced radish. I halted the amount of cayenne pepper and added 1 TSP of cumin powder. As a note, the color of this slaw is beautiful, and if you use a combination of green and purple cabbage, it's even more so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maricee"
},
"reviewBody": "I Love this recipe. I do add a lot more cilantro (approx. 1/3 to 1/2 cup fresh), because I love cilantro. I've made this several times and now I'm thinking I'd like to have this on fish tacos. Easy and probably better for you than traditional. Keeping it under constant refrigeration isn't an absolute, so would be great at picnics/cookouts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daymon"
},
"reviewBody": "Cut the cayenne to 3/4 tsp &amp; still plenty of kick. Imagine this would be good in tacos or burritos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefdaddy"
},
"reviewBody": "Is it a slaw or is it a salad?Some people do not know which it is.So they call it both.But this people is a slaw.I know this combo of ingredients will be excellent,but the cayenne pepper will have to be reduced.Plus it is not a Mexican type slaw without cilantro.Cilantro is a Mexican/Spanish herb/seasoning and without it,it is not of the Mexican flair!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I was looking for a coleslaw without mayo when I found this. The spiciness was a hit with the men in my family. Not so much the girls. Couple hints .. unless you truly are a fire breathing machine, there is not near enough slaw for the amount of heat in this recipe. I followed the recipe exactly using 3 cups of a bagged slaw mix ... and ended up using 2 pounds of bagged slaw to make the heat more palatable. This would be awesome on top of hamburgers or hotdogs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yeags80"
},
"reviewBody": "Absolutely loved this recipe! Perfect amount of heat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dianemwj"
},
"reviewBody": "This was pretty good. I cut down the oil to 1/4 cup and increased the vinegar because we like salads tangy. I also used Splenda instead of sugar and added a mango as suggested by another reviewer. I thought this was okay, but DH just loved it! Thanks so much for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "khaith"
},
"reviewBody": "As with the other reviews I added in about a cup more cabbage. I also decreased the oil to 1/4 cup. Great Slaw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chuck"
},
"reviewBody": "Excellent! I've substituted different types of peppers, but it's good every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ardys"
},
"reviewBody": "Refreshing and not sweet coleslaw."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin"
},
"reviewBody": "I followed this recipe pretty much to the t... it is AMAZING. Just the spicy munch I was looking for. Glad I still have the ingredients, I will probably be making more. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BUTTERCUP_CA"
},
"reviewBody": "I didn't have any fresh cilantro, so used dried cilantro instead. It turned out fine. We didn't eat up all of the slaw, so the next day had leftovers. It was HOT!! lol so my advice, if you don't like it too spicy, eat all of the salad the first sitting! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deanna"
},
"reviewBody": "too hot! toned it down and was better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Oily and somewhat tasteless, even after sitting a day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YOULIKADASPICE"
},
"reviewBody": "This was a major hit with my modifications. I followed all directions except i did 1/4 cup of olive oil, and 1/4 cup of red wine vinegar, also used a splenda packet. I also added the juice of a lime. But the biggest addition and what i got raves about was the mango that I added. I used a firm unripened mango (actually, half ripe which is firm, but still has a touch of sweetness) - this got RAVE reviews at the party and EVERYONE wanted the recipe. This modified version will be a staple at my home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soup Loving Nicole"
},
"reviewBody": "I added more cilantro due to personal preference and this tasted very fresh and was very colorful. I will definitely make again! It is a great side for any Mexican dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Dayle Windley"
},
"reviewBody": "My fiance hates coleslaw. HATES it. So I wanted to find an alternative approach for slaw, that would also work with our Mexican food themed 4th of July cookout. This looked worth trying....and SO glad we did. Other than adding habanero to the recipe, we followed it to a T. And it was delicious. My anti-slaw man has been converted and even made regretful noises when the leftovers had to go. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHEESECAKEMAKER"
},
"reviewBody": "In my opinion, this recipe needs some \"tweaking\" with regard to measurements ...3 cups bagged cole slaw, 1 cup red cabbage, 1 cup shredded carrots, 1/4 cup red onion, 1 jalapeno, 1/4 cup fresh cilantro 1/2 cup vinegar (cider or rice wine), splash of oil and pinch of splenda and pinch of cayenne. refrig for 2-3 hrs. Great spectrum of ingredients. Alter measurements to suit your tastes! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "erz2002"
},
"reviewBody": "I made this as directed but I wasn't thrilled with the results. I didn't like how oily it was. And although we can tolerate heat pretty well, this was almost too hot to eat. While we did eat this, I don't think I'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Emily M."
},
"reviewBody": "I don't know why but this dish just didn't turn out for me. All it tasted like was oil to me; the flavors didn't meld very well in my opinion. I don't think that I'll be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSANDERSON"
},
"reviewBody": "Fabulous recipe. I did cut the oil back to 1/4 cup and added a few dashes of cumin. Super yummy!! Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ZeldaSayre"
},
"reviewBody": "I think the problem I had with this recipe was entirely my fault, and not the recipe's. I used a bag of pre-shredded coleslaw mix and instead of measuring out 3 cups, I just used the entire thing. As a result, the dressing was a little muted, and even though the cayenne still made your lips tingle, the result was a little bland. Still, I'm giving the recipe four stars because I have high hopes for it; the dressing (before adding) was simple but terrific, and it's so nice to have a fresh Tex-mex-ish side dish that I know I'll try this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle Roth-Kiva"
},
"reviewBody": "Neither my fiance or I cared for this. For me, this was so-so (I didn't hate it as much as he did...). Perhaps if this sat in the fridge for longer than an hour, it would be better??? I too was afraid that a t of cayenne and an entire jalapeno would be too much, but oddly enough, it wasn't at all. I could definitely detect a spicy bite, but it was never overpowering. Sometimes I tasted a very subtle sweetness and sometimes just a spicy punch (which was odd). The flavors never seemed to mingle together as they should have. I think this would be much better as a garnish for fish or shrimp tacos. The crunchiness of the slaw would complement the tender fish nicely. Add a chipotle mayo or Amy's Cilantro Cream Sauce (also on this site), and you'd have one darn good taco. NOTE: To make this extra pretty (and to speed prep), I used a combo of shredded slaw mix (i.e. green cabbage &amp; carrots) and purple shredded cabbage, both found in my grocer's produce section. I also want to mention one tidbit about jalapenos. The heat is contained in the membrane and seeds. As long as you remove both, you won't get any spice from it (just a nice crunch). Although I'm not jumping out of my seat to make this again, I would consider it as suggested above (I'm considering Chipotle Shrimp Tacos!). I think my fiance might like it this way also. Thanks for sharing! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunnyb"
},
"reviewBody": "Twice my husband said this was really good. If he likes it, it's a keeper. I thought it was better than the usual coleslaw I make and it was certainly a lot more colorful. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melanie"
},
"reviewBody": "DELICOUS!! Only change I made was to omit the cilantro. Will make it again and again. New Favorite. Thanks!! Only change I might make would be to use less oil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusieQ"
},
"reviewBody": "Tasty for a slaw with vinegar dressing versus mayonaisse."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jason"
},
"reviewBody": "this was an exceptional addition to my pork tacos for the night and the family thought so to"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "charisha"
},
"reviewBody": "I made this recipe last night adding half a minced jalapeno and only adding half an onion and the only person who liked it was my 8 month pregnant friend who has been \"liking weird foods\" according to her. It has a very strong raw onion taste even though I only added half. It was okay on the tortilla with carnitas but not by it self."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BARBIEFISH"
},
"reviewBody": "I make a similar slaw but I use red pepper flakes instead of a jalapeno or other spices;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoftballMom"
},
"reviewBody": "No red pepper in the house, so I subbed green pepper. Also, per other reviews, I altered the oil and vinegar amounts -- 1/4 cup of each. DH says this one is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bbqgirl"
},
"reviewBody": "Awesome recipe, thanks! I didn't put in all the cayenne called for in the recipe only because I was serving this with Chipotle Shrimp Tacos &amp; they were plenty spicy. Yumm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Bachmeier"
},
"reviewBody": "I loved this recipe and have shared it with friends. The flavor lasts for several days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amandak23k"
},
"reviewBody": "This was good just a little greasy!!! I made this the night before and it was a little on the greasy side, but still good. I tried to follow the recipe except I used cumin instead of cayenne pepper because I have not been able to find it in the store for some reason, I didn't have cilantro and I used jarred jalapenos instead of fresh and sliced the carrots instead of shredding. I will make this again, it's a nice change from the usual creamy milky coleslaw!!!! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Reneered"
},
"reviewBody": "This is based on a very traditional recipe which I, too, have been using for years. The addition of jalapeno and cayenne can make this too hot for some tastes but either one or both can be reduced or left out. The only change I would make is to increase the vinegar to oil ratio. By the way, this keeps very well, and only improves in the next few days."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zan"
},
"reviewBody": "I've been making this slaw for years! My husband and I love very very spicy hot food, so I usually crank up the cayenne and the jalapeno!! My husband is a very finicky eater, but he absolutely loves this slaw. We generally have it as a side dish to other sort of spicy entrees like jamaican jerk chicken, spice rubbed ribs or spice marinated, spice rubbed chicken. For those that don't like it too spicy, just adjust the cayenne and jalapeno. Fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wendy Sanders"
},
"reviewBody": "some liked it, others didn't...don't know if I'll make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Basil Scott Roland"
},
"reviewBody": "What a change! This will be my most requested slaw!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "Great flavor! Nice change from the norm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bakerbecky"
},
"reviewBody": "I liked this, it was good. I made it as is except to leave out the cilantro b/c I didn't want to buy it since I rarely use it. It didn't taste *too* spicy, but maybe it was since my mouth is all tingly-burny now!!! I eyeballed the cayenne and probably came up a bit short. I ate two (ground turkey) tacos tonight, one with this on the side, and one with this as a topping. I preferred this as a side dish, but i think it would make a great topping for a more delicate meat, like shrimp or fish tacos, and some avacado to mellow it out. I'm going to try that with the leftovers. One more thing...probably a little less oil next time. Vinegar was right, though. **ETA: I made a single shrimp taco for lunch with the leftovers (sauteed 5 med. shrimp in butter with cumin and chili powder, piled in taco shell, topped with chopped avocado and a generous helping of this slaw)--DELICIOUS! I prefer this slaw used this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mammaw"
},
"reviewBody": "If you love spicy hot food, this is delicious but it's one of those love/hate dishes. If you don't like \"fire\" in your slaw, you'll hate it. Definitely not a potluck dish because a lot of people won't be able to eat it. I gave it 5 stars because my son raved about it. I think next time I'll use mild green chiles in place of the jalapeno and cumin for the cayenne to try to keep that delicious flavor but lose some of the heat.Excellent recipe as is if you tolerate super spicy foods well and I will make it again with those changes.Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jerry Haas"
},
"reviewBody": "I used half the oil and doubled the vinegar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danceqn"
},
"reviewBody": "A family favorite! I leave out the jalapeno and reduce the cayenne, and it's still quite spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kenandcamille"
},
"reviewBody": "Flavor overload!This was slaw-a-riffic! The flavors were fresh and the dressing was light and delicous. This is a SPICY slaw. Maybe next time we will use a little less cayanne pepper but overall you will love this festive mix!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "floofery"
},
"reviewBody": "Super easy and delicious way to get more veggies. I'd go with a little less oil and a little more vinegar in dressing. Excellent as garnish for the \"Grilled Fish Tacos with Chipotle-Lime Dressing\" recipe on this site. This will be in regular rotation at my house!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20390/spicy-southwestern-slaw/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/218/salad/coleslaw/",
"name": "Coleslaw Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16684/salad/coleslaw/no-mayo/",
"name": "No Mayo"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20390/spicy-southwestern-slaw/",
"name": "Spicy Southwestern Slaw"
}
}
]
}
}
, "about": [
]
}
]