				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spinach Balls"
,"datePublished": "2019-04-02T02:43:05.000-04:00"
,"dateModified": "2023-03-21T11:16:33.172-04:00"
,"author": [
{"@type": "Person"
,"name": "JEN VINYARD"
,"url": "https://www.allrecipes.com/cook/247421"
}
]
,"description": "This spinach balls recipe uses stuffing mix, Parmesan cheese, butter, eggs, and savory spices, shaped into balls, then baked for a fun-to-make treat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WI8DQ4GqBGb_UDZHgbiF7u_dlzA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5739475-cd36c72fa8984f5ca33bc391f611bf1e.jpg",
"height": 1254,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spinach Balls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "261"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "259 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "77 mg"
,"fiberContent": "2 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "732 mg"
,"sugarContent": "3 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
, "recipeCategory": ["Appetizer","Snack"]
,"recipeCuisine": ["Italian"]
,"recipeIngredient": [
"2 cups finely crushed herb-seasoned dry bread stuffing mix",
"1 (10 ounce) package frozen chopped spinach, thawed and drained",
"3 large eggs, beaten",
"0.5 cup grated Parmesan cheese",
"0.5 cup melted butter",
"2 teaspoons garlic powder",
"1 teaspoon Italian seasoning",
"0.5 teaspoon ground black pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine stuffing mix, spinach, eggs, Parmesan cheese, melted butter, garlic powder, Italian seasoning, and black pepper in a large bowl; mix well. Use your hands to shape spinach mixture into walnut-sized balls and place on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until heated through and browned, about 20 minutes."
} ]
,"recipeYield": ["11"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Miss Miss"
},
"reviewBody": "Turned out great but, my stuffing needed more spice, adding poultry seasoning or sage next time. I made a dipping sauce of cranberry sauce and mayo, you can also use, Greek yogurt or sour cream or whatever. Good appetizer recipe, thank you. 😊"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jimidi"
},
"reviewBody": "Excellent healthy snack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RIELLA"
},
"reviewBody": "Grandma Mildred made this as written. A family tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tarponqueen"
},
"reviewBody": "I made this to take to a dinner party. Everyone loved them until I told them they were made with spinach. Even though they \"hated\" spinach, they loved these balls. They disappeared quickly and quite a few even asked for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luna Reynaerts"
},
"reviewBody": "Really really good! .It’s simple, healthy, and delicious! I will definitely be making this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Cool Swain"
},
"reviewBody": "They were great, definitely will make these again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LeeB"
},
"reviewBody": "I love to cook. I had to check the recipe a few times to see if I did something wrong. I baked for the amount of time in recipe.They were hard and I ended up tossing them. I was supposed to bring to a party . very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Manny Bophus"
},
"reviewBody": "They were very well received. I have someone in the family who doesn't like cheese, so I subbed silken tofu, added a little salt for flavor, and it worked just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon acosta"
},
"reviewBody": "Everyone loved them ??\nMy fiance was a bit apprehensive but he tried them and loved them so did my 10 yr old daughter who does not like spinach nor stuffing she loved these spinach balls. I am been asked to make them again lol. Very easy to make and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Derek"
},
"reviewBody": "I always use the ingredients as stated but added more Parmesan cheese and parsley flakes. Also added a little more garlic and some Mrs. Dash seasoning as a personal touch. I was able to make 12 medium large balls. They were all gone within 15 minutes of making them. :) Family and friends LOVE them! Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy"
},
"reviewBody": "I have made spinach balls numerous times. They are always a big hit at dinner parties!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacy"
},
"reviewBody": "I just made these exactly what the recipe calls for &amp; they are delish!!! Based on the previous reviews, I baked half of the mixture &amp; froze the other half &amp; will bake them in the future. I am literally eating them as I write this! So simple &amp; yummy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "toby"
},
"reviewBody": "I used seasoned bread crumbs instead of stuffing mix. They turned out really good but I did have to cook them about 10 more minutes to get them to brown a little. I will make them again and try the stuffing mix instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ANN MOORE"
},
"reviewBody": "There seemed to be too much bread crumbs for me. Later saw parmesan spinach ball recipe on your site with 2 cups of bread crumbs to two boxes of spinach rather than one box. Will try that one next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Lou Spear"
},
"reviewBody": "These were very good but didn't go over as well as I thought they would at our New Year's Eve party. No problem, I had great leftovers for days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tmiller"
},
"reviewBody": "I loved it, husband thought they were just OK. More for me next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sassy Davis"
},
"reviewBody": "Ended uo using it for oysters Rockefeller."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fulovebnzs"
},
"reviewBody": "One of my all time favorites and a great appetizer. Added a pinch of salt, fresh minced garlic, extra Parmesan and used a drained 27oz can of Glory Seasoned Southern Style Spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Slate"
},
"reviewBody": "These are so yummy! And I feel healthy eating them! I was able to make them GlutenFree for someone who has Celiacs Disease. I just made sure the Parmesan cheese was GF, the bacon GF, and use a GF stuffing mix, or crumble your own GF bread loaf (that's what I did). They taste the same! I have made them both ways. My mother used to make them for Christmas and I ate so many! My all time favorite appetizer or snack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Diana L. Bush"
},
"reviewBody": "I added a little dried minced onion"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheStrawberryGirl"
},
"reviewBody": "These were great, everyone loved them and couldn't stop eating them! Great appetizer for being on a boat.\n\n The first time I made them, I got 30 from this recipe and the second time I actually was able to get 60! \n\nAlso, I used the entire package of 16 ounce package of frozen spinach (that was all they had in my supermarket). \n\nThey were delicious, great warm or room temperature. Next time I may add some shredded mozzarella, also.\n\n***Update - I have made these with the mozzarella, both alone and mixed with the Parmesan cheese. SO GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sony Xiang"
},
"reviewBody": "Novice cook and first time making these, so probably wouldn't be the best anyways. \n\nIt was really delicious. A little too salty for my taste, but that varies from person to person (my friends all loved them).\n\nI found that if you don't bake them long enough they fall apart really easily and if you bake them enough so they don't fall apart the outside is a little too crunchy. \n\nI found putting the mix in the fridge or freezer helped a lot before rolling them into balls. When I didn't do that I had a hard time getting them to form and not mush out of my hands. \n\nChanges I want to make in the future:\n\n-a little less garlic powder/salt\n-freeze before rolling balls\n-more spinach"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ginger K."
},
"reviewBody": "Made recipe as written and they ended up being too salty for my tastes, I'm assuming it was the stuffing mix crumbs. May try again with some Italian style panko breadcrumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "whitebert"
},
"reviewBody": "Very good, tasty. Very buttery, may cut down next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "These are awesome! I tripled the recipe for a party, made the mixture in the morning and baked them in the afternoon and they were wonderful! If time allows, make the mixture in advance. It gives the ingredients time to soak and soften, and makes it easier to shape into balls and stay together during baking. I used a combination of parmesan mozzarella cheese and added some diced onion. I used 2 tsp. of garlic powder for a triple recipe since I was adding the onion. They were really buttery, so I may decrease the butter next time by a stick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "My daughter loves these. I don't really care for spinach but these are delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle!"
},
"reviewBody": "Fantastic--even my teen and tween girls ate it and they avoid spinach like homework...! I did add a bit of cayenne, just because I love it in everything. Thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aMidnightSun"
},
"reviewBody": "Made for book club. Everyone enjoyed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yaya_77"
},
"reviewBody": "Big hit! Really easy to make and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristan Massimino Brown"
},
"reviewBody": "My family loved these! I added a few shakes of cayenne pepper to it like another person mentioned in the reviews. Love, love, loved it! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fraucha"
},
"reviewBody": "I have made these as is which is a five! Now for playing... I substituted spinach for frozen kale and used stove top stuffing. Took out the butter and added 2tbsp of olive oil then a pound of ground chicken. These were good as well! This recipe as written is awesome and it also leaves room for a cook to play. Thank you for submitting it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitchen sweets"
},
"reviewBody": "This was great, I made it with as an appetizer at a dinner party I hosted tonight,these went so fast the platter was empty before I could get one I will make them again for just me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "Very good results!! I'm rating 4 stars bc next time I'd punch up with more spices, probably cayenne as others have suggested. In my first batch I did a few substitutions: fresh spinach (turned out great), I cut out 3 tbsp of butter and used olive oil instead (this was slightly challenging and required adding in extra olive oil later to congeal the balls), and I sauted finely chopped onion with garlic in place of garlic powder (delicious)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ida Crombine"
},
"reviewBody": "Fantastic! These were a lifesaver when my husband needed non refrigerated lunches for work. So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Magda Borowicz"
},
"reviewBody": "My friends didn't like this at all, neither do I. We are a healthy bunch, with me on the fringes (I give in to fried food every now and then). I don't think I'll even try it a second time with different recipe, it just didn't go over well enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn cp"
},
"reviewBody": "Not having stuffing mix on hand, I used Italian bread crumbs instead. Also used liquid eggs and low fat butter (made with yogurt) to lower the cholesterol and fat even more. And for a kick, added some sliced almonds. The spinach balls were delish! I can see trying this recipe using cooked flavored quinoa as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KEB"
},
"reviewBody": "great to make ahead for thanksgiving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ami"
},
"reviewBody": "Delicious appetizer, great for parties. Hard to not eat them all on the way though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah"
},
"reviewBody": "Deliciously moist. My 3 year old just entered the \"veggies are yucky\" phase and these fooled her into thinking that they're regular meatballs. I melted some mozzarella on top and she loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heilau"
},
"reviewBody": "These are a great nutritious snack to have on hand or for a party. Instead of stuffing I used what I had, which meant a mix of quinoa, chopped walnuts, and breadcrumbs. And cheddar cheese instead of parm. They're like spinach cookies haha!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LibertyBelle78"
},
"reviewBody": "Wow! These exceeded my expectations by far! I made them to add a vegetarian option for a party, and they ended up being the most popular dish of all. So quick and easy to mix in the stand mixer, then portioned out with a cookie scoop. These are going to become a standard for us...and I didn't change the recipe a bit. Thanks for sharing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lin"
},
"reviewBody": "I have made these before, and really liked them. I think the problem some people are having is using breadcrumbs instead of stuffing mix. I think the breadcrumbs compact too much, and when I use stuffing mix, I actually use the 1 cup of water and make the stuffing. My spinach balls are tender and soft, and absolutely delicious. I also tweak the recipe, and add different cheeses etc. I DO NOT add any butter or oil, and they are fine. I use a one inch ice cream scoop and it works perfectly for the 20 minutes at 350, and use silicone aluminum foil, so they do not stick. I also have made broccoli balls, and they are great too. Am now thinking about cauliflower balls, lord help me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSICA SEIBERT"
},
"reviewBody": "super easy! you can keep ingredients on hand so you can make as a last minute appetizer (or even side dish)\n\nmine came out a little dry. I think I let them cook to long (25 mins) because they didn't look golden. but I fixed it by dipping them in pizza sauce (or marinara). \n\nI think this could be really good as an appetizer or as a side dish with pasta (in place of garlic bread) \n\ngood as is but now that I have tried it I can see how the other suggestions with cheddar cheese and cayenne pepper would be delicious too"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fj62"
},
"reviewBody": "These are easy and outstanding! Now if you want to take it into another stratosphere, serve with this easy but AMAZING sauce (so not kidding) that I found when making appetizers for our NY eve party: http://hostthetoast.com/crab-cakes/#comment-191639"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "spice of life"
},
"reviewBody": "Very good. I thought they could use more garlic, but I LOVE garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LSR1011"
},
"reviewBody": "Good but too unhealthy to make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anna"
},
"reviewBody": "I doubled the recipe and I debated about the amount of bread crumbs and I was right, 4cups was way too much. So watch out even on doing it single."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Adams"
},
"reviewBody": "I used fresh spinach and a food processor just on pulse / chop. Baked the balls as a side to my tilapia dish. Everyone loves them! So simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coreo"
},
"reviewBody": "SO good! These are quite heavy so beware but absolutely tasty. I served them at a fondue party and they went over great! I think a spicy sour-cream based dip would be great with these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Miller"
},
"reviewBody": "I made this with fresh garden spinach and unseasoned bread crumbs. I used fresh herbs from the garden (basil, rosemary, thyme &amp; oregano) and blended them with the eggs and butter in our nutri-bullet blender. It was a hit and we will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christy007"
},
"reviewBody": "these are so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GLITTERMISS"
},
"reviewBody": "My spinach balls were too moist and tasted heavy with butter. I first measured out my stuffing to 2 cups BEFORE crushing them so I might have had too little stuffing to soak up the butter. Still delicious however. Served it with marinara sauce. Added 2 teaspoons of chili flakes b/c I like things hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rhonda Warner Robinson"
},
"reviewBody": "I absolutely love these! A client gave me the recipe and I \"doctored\" it up a bit as I'm notoriously known to do. I added cheddar cheese, extra garlic and shrimp! Everyone loved them at the party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kileighsmom"
},
"reviewBody": "Tried this recipe this morning. Sorry but they came out terrible. I don't find that the recipe calls for enough seasonings. They turned out very dry and bland. I will definitely have to tweak this recipe till I come up with something much more tasty and moist. I've made these in the past and decided to try a different recipe this time. Sorry that I did."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamatoast"
},
"reviewBody": "Amazing! Unfortunately, I had to change a few ingredients (which I hate doing on a first trial) but they turned out wonderfully! The parents and children in my playgroup raved and I had to give them a link to this recipe! \r\nNice recipe that you can adjust to what you have in the pantry and fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eibbed0001"
},
"reviewBody": "These are great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abigail Smith"
},
"reviewBody": "Watch out - these little guys are lethal.\n\nMy husband came home late from a flight and he ended up eating half the batch, just standing and chatting. I've started the second go-around now. \n\nI used fresh spinach on hand, boiled it down. I'd use some Pam spray on the pan, they sorta stuck.\n\nDipped in homemade marinara sauce - yum!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenjen63"
},
"reviewBody": "i made this today 3-29-13, to bring to a crawfish boil, everyone LOVED them... i did make some changes... i used Stove Top Savory Herb instead of bread crumbs.. also added feta cheese flavored tomato &amp; basil kind..i think next time i make these, i will add artichoke hearts and use Italian mix cheese with the Philly cheese in it.. also i thought that by just using parmesian cheese, made these a little salty to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenni AB"
},
"reviewBody": "I was looking for vegetarian appetizers and found this. They were very good. I sub-ed a can of artichoke hearts for one of the packages of spinach. (Just because) Just drained and chopped them. Also sautéed onions and garlic in the butter. And used bread crumbs instead of the stuffing mix, so I upped the Italian seasoning a bit. Served with Marinara sauce and there were none left!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DEADTIRED"
},
"reviewBody": "I made these for a Christmas appetizer &amp; most people seemed to enjoy them, even the ones that don't like spinach. I forgot to add the garlic powder &amp; I can see where it would add the kick they were missing. I used the stove top stuffing for chicken bread crumbs so there was a good seasoned taste to the balls. We used the leftovers in spaghetti with a tomato sauce 3 days later. They absorbed a lot of the moisture from the sauce &amp; were better then they were the first time around. I will make these again &amp; get all the ingredients in!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SMARIGOLD717"
},
"reviewBody": "This recipe needs a lot of work. As is, it is very bland. I decreased the amount of bread crumbs by a cup and added a ton and it came out very dry and bland. I had only baked 10 to test so with the remaining spinach mixture, I added garlic sauteed in oil, a little vegetable bullion cube and more garlic powder. It still came out bland and dry! I won't be making this again but I suggest sauteeing the spinach and adding all the flavoring and THEN adding it to the bread crumbs. Frozen whole cut spinach works better than chopped and consider covering the spinach balls with foil towards the end of baking to keep in some of the moisture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pureaustralians"
},
"reviewBody": "VERY good and VERY easy. I made a whole bunch of them thinking I would freeze them....and they all got eaten before I could sneak them to the freezer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "Good but was lacking something. I altered recipe to include 1/2 chopped and sautéed onion, dash cayenne pepper, 1 clove of minced garlic and 1/2 cup of feta cheese. Took the recipe to 5 stars then. I served with another reviewers suggestion of: mustard sauce 1/2 c sour cream, 1 tsp yellow mustard, dash of worcestershire and 1 tsp soy sauce. Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jusagurlie24"
},
"reviewBody": "Me and my little one loved these!!!! I doubled it and froze some for later"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharr"
},
"reviewBody": "Wow! I had never heard of spinach balls, but had to use up some fresh spinach, so I thought I would try these. These are really good! I didn't have stuffing, so I used italian style bread crumbs. I added garlic and white onion cooked in EVOO, then added the spinach in and added just 2 tbsp of butter at the end, then added to the dry ingredients, plus a little cayenne. I used shredded parmesan (didn't have any grated) and the result was sooo yummy. Even my super picky 5 year old, and my non-spinach loving hubby liked them! Thanks for the delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LR"
},
"reviewBody": "Very good, made them last week and my husband asked me to make them again this week. Substituted meatballs with the spinach balls on the spaghetti"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rooster"
},
"reviewBody": "Okay, I messed up and used seasoned bread crumbs instead of the crushed stuffing mix, but they still tasted pretty darn good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "i've made this a couple of times now; most recently i didn't add any butter or substitute, and i really don't think they need it. try rolling the balls in panko crumbs before putting them in the oven, it's so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liliana Magdaleno"
},
"reviewBody": "Delicious and EASY to make (I used fresh spinach which did make it a bit difficult to roll into a ball but no biggie)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SESi"
},
"reviewBody": "I was looking for a vegetarian app and am so glad I found these. They flew off the plate at the party I attended! The only adjustment I made was adding about a quarter of an onion, sauteed. I make them often now due to request. Dee-licious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emilyoga"
},
"reviewBody": "Love this idea! I turned this into my new favorite veggie burger to pack for my work lunches. I used my food processor to speed up prep time. I don't buy stuffing mix so I started with a few slices of whole wheat bread, then added a tsp of poultry seasoning, threw in a small onion, used fresh garlic, and omitted the butter altogether. Made 4 large patties out of this, and topped it with a little mayo and spicy mustard on a whole wheat bagel."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gracecc5249"
},
"reviewBody": "I just love these. I basically made them the same except I used Italian seasoned breadcrumbs and didnt add the Italian seasoning. I kept them after cooking in the fridge. I am a vegetarian and I found the consistency of these remarkably like meatballs I had while growing up. So I tried a batch using basil, oregano, and marjoram. I cooked up some pasta about a day later (because the consistency of meatballs comes after a day or so in the refrigerator) and used these as meatballs. I no longer miss meatballs with my pasta. They were fantastic. So from now on along with the forty I make that are a little over an inch in diameter, I will make some larger ones, maybe twenty or thirty, for meatballs. Thank you for this recipe that I will be sharing with friends. I know even my non vegetarian friends and relatives will enjoy them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "excellent recipe! Made exactly as stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Stefanie"
},
"reviewBody": "These are very dry. I think they contain too many bread crumbs and too little spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skulhowvick"
},
"reviewBody": "Everyone raves about these whenever I make them. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fantastic however that is my opinion. For whatever strange reason was not a hit with my extended family when I made them a few Christmas's in a row!! Try dipping them in a little green Tabasco sauce for a kick. My opinion is they are Super tasty &amp; very easy. Definately Superior to the breadcrumb version on this site. I think my family who didn't like them are nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill"
},
"reviewBody": "Oh these bring back memories... my grandma always made these, so they remind me of her. I love spinach balls :) They're so addicting! I think she used mozzarella cheese, can't remember."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie_0509"
},
"reviewBody": "These were delicious! I had never made spinach balls before and they turned out great and everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "machsnell"
},
"reviewBody": "I made these last night, but I had to adjust the recipe quiet a bit. First I scaled the recipe to make about 30 spinach balls. I used three 10 oz packages of spinach. About 2 cups of Italian bread crumbs instead of the 5 cups it said. I also adjusted the butter and eggs. Otherwise it would have been too mushy. Even with less butter it still was a bit too much. The way I made them they turned out perfect. The prep and cooking time was longer though. I put the spinach in the toaster oven to dry it out easier and I ended up baking these for about 30 minutes instead of 20. This recipe is a good guide though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "an awesome appetizer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fairyfalls55"
},
"reviewBody": "These are PERFECT for Thanksgiving and Christmas appetizers, we make them every year! My personal recipe, which I got from somewhere else, requires 2 packages of spinach and also half of an onion, chopped. I think that helps with the dryness. Also substituted garlic salt for powder, and made them even tastier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chef Cee"
},
"reviewBody": "These were good, these were okay, nothing too spectacular. I followed the recipe except I added more spices to try and get more flavor into these balls. I baked for 17 mins. I served with a marinara sauce. Again, these were good, just don't expect greatness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Neeley"
},
"reviewBody": "These were delicious!! I added a lot more cheese. Any kind of cheese can be used. Served with a spicy marinara sauce. Will def be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MellyLV"
},
"reviewBody": "These were too dry. I followed the recipe exactly and was very disappointed. Not one person at our party had seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LittleAn24"
},
"reviewBody": "If you chop the spinach up really really fine in the food processer, they look much better when they are done baking. They are best dipped in marinara sauce. Super good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marci"
},
"reviewBody": "Mediocre and a bit dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi"
},
"reviewBody": "LOVE these!! I followed the recipe exact and they're just delicious. Everyone liked them but my son &amp; I really loved them and (DON'T TELL HIM) he hates stuffing, he hasn't had any of any kind in years - he's refused to eat any since he was little so needless to say I didn't tell him that these are made with stuffing mix lol and he said quote \"the spinach balls were a lot better than I thought they would be!\" I'm so happy about that - we'll definitely have these regularly :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KRISRIZZIO"
},
"reviewBody": "Very good! Followed recipe exactly. Would make a great appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Canadian"
},
"reviewBody": "I was very disappointed with these. I love spinach and I love stuffing, but these were not enjoyable. I was looking for a fun way to add veggies to my family's diet, but these struck out with everyone. Just not tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Condon Jones"
},
"reviewBody": "Made a healthy version:\n\n1 10oz pkg of frozen chopped spinach thawed and drained\n2 cups of Italian Style Panko\n3/4 cup of reduced fat Sharp Cheddar Cheese\n2 tsp garlic powder\n1/2 tsp black pepper\n1 tsp Italian Seasoning\n2 tsp Extra Virgin Olive Oil\n2 Eggs\n2 tbsp of Bragg's Amino Acid (or Tamari)\n\nThis was so delicious without the butter and the panko is made with wheat flour instead of white!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Recipejunkie"
},
"reviewBody": "Added chopped green onions and a dash of nutmeg. Good served with a nice honey bourbon mustard for dipping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moemoev"
},
"reviewBody": "These are fantastic! I brought them to a party, and people loved them! I think I'll try subbing some of the bread crumbs with ground oatmeal, and using some olive oil in place of some of the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Hardy"
},
"reviewBody": "They were a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bakingmomof2"
},
"reviewBody": "I have made these before for an appetizer on Christmas Day! So easy and they go quick;-)!!! Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "audb"
},
"reviewBody": "Made this as an hors d'oeuvre for Thanksgiving and they flew off the plate. I took the advice of some reviewers and added a pinch of cayenne. Served with marinara sauce for dipping. This recipe is a winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Whittier"
},
"reviewBody": "I make this recipe all the time. Today I used the mix to stuff mini pumpkins. Baked at 375 for 45 minutes. It turned out great and looked amazing. I added the picture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Pascale"
},
"reviewBody": "I really liked these. Mine did come out a little dry, but dipped in various sauces is delicious!!! These little tasty morsels will be revisiting my kitchen again :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dina"
},
"reviewBody": "Wow! I just made them and followed the recipe almost exactly, except for putting in slightly less butter. I am typing this as my two kids, ages 2 and 4, are stuffing their mouths. Phenomenal! My kids haven't touched spinach for quite some time. I love this recipe, it's a keeper!!! UPDATED: Spinach-hating hubby loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mother of Trixie"
},
"reviewBody": "I make these as written except I exclude the italian seasoning. They are dee-lish and fairly inexpensive to make."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25273/spinach-balls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/",
"name": "Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25273/spinach-balls/",
"name": "Spinach Balls"
}
}
]
}
}
, "about": [
]
}
]