				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spinach Lasagna"
,"datePublished": "2000-06-13T06:21:15.000-04:00"
,"dateModified": "2022-05-25T23:09:09.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Robbie Rice"
,"url": "https://www.allrecipes.com/cook/257438"
}
]
,"description": "This fresh spinach lasagna recipe with plenty of ricotta, Romano, and mozzarella makes a deliciously cheesy, vegetarian dish that&#39;s sure to be a hit!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/V5WbrzVbIVyAYubtz2buQuhF2T4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9301086-spinach-lasagna-torilugo-1x1-1-f1f2c4daf764496891087ab866603da2.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2203071691001",
"description": "This hearty meatless lasagna offers plenty of cheese and fresh spinach.",
"duration": "PT4M27S",
"name": "Spinach Lasagna III",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/bfa32d99-813d-4200-93aa-99f491cee22f/5045e17d-d23e-4f57-b659-4adcce84915c/1280x720/match/image.jpg",
"uploadDate": "2021-06-22T19:21:24.687-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spinach Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "724"
}
,"cookTime": "PT75M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "289 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "50 mg"
,"fiberContent": "2 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "851 mg"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"15 lasagna noodles",
"2 tablespoons olive oil",
"1 cup chopped fresh mushrooms",
"1 cup chopped onions",
"1 tablespoon minced garlic",
"2 cups fresh spinach",
"3 cups ricotta cheese",
"0.66666668653488 cup grated Romano cheese",
"1 egg",
"1 teaspoon salt",
"1 teaspoon dried oregano",
"1 teaspoon dried basil leaves",
"0.5 teaspoon ground black pepper",
"3 cups shredded mozzarella cheese",
"3 cups tomato pasta sauce",
"1 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add lasagna noodles and cook for 8 to 10 minutes or until al dente; drain."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, heat olive oil in a skillet over medium-high heat. Add mushrooms, onions, and garlic and cook until onions are tender; drain excess liquid and cool."
} ,{
"@type": "HowToStep"
,"text": "At the same time, bring a small pot of water to a boil; add spinach and simmer for 5 minutes. Drain and cool slightly; squeeze out any excess liquid and finely chop."
} ,{
"@type": "HowToStep"
,"text": "Combine ricotta cheese, Romano cheese, egg, salt, oregano, basil, and pepper in a bowl. Add cooled mushroom mixture and spinach; beat with an electric mixer on low speed for 1 minute."
} ,{
"@type": "HowToStep"
,"text": "Lay 5 lasagna noodles in the bottom of a 9x13-inch baking dish. Spread 1/3 of the ricotta-spinach mixture over noodles, then sprinkle with 1 cup mozzarella cheese and 1/3 cup Parmesan cheese. Spread 1 cup pasta sauce over top. Repeat layers two more times, then cover with aluminum foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/V5WbrzVbIVyAYubtz2buQuhF2T4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9301086-spinach-lasagna-torilugo-1x1-1-f1f2c4daf764496891087ab866603da2.jpg"
}
]
,"text": "Bake in the preheated oven for 1 hour. Cool 15 minutes before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth McCoy"
},
"reviewBody": "I made this recipe exactly as written. It was a real surprise about how I didn't miss the meat (my husband too). This is a delicious recipe and it is now added to our regular meal rotations!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crawling"
},
"reviewBody": "It's a wonderful recipe to start, and read the positive reviews. It will make a better recipe and can add veggies to make it yours! Like others, I changed 1 cup mushrooms to close to double and 2 cups of Spinach to 1 pound (tub). Tomato pasta sauce to marinara sauce. Have fun with it and take care!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cardra"
},
"reviewBody": "Really love this recipe. Don't think I'd use five lasagna noodles per layer next time, however. Four is enough for me. Scrumptious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JF02367"
},
"reviewBody": "Excellent recipe. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used the basis of the recipe but substituted from my garden….fresh Swiss chard instead of spinach, substituted less expensive cottage cheese instead of cheeses which are not in my budget, used spinach lasagna noodles which I had in pantry and I needed to par cook and added 1lb of chorizo just because I had it in the freezer and I wanted a meat lasagna. Method: removed 1lb (454 grams) chorizo from casing … mince up and fry in a pan with a bit of canola oil, when slightly browned added a 15oz tin of crushed tomatoes (use MUTTI brand tomatoes if available) and add a tablespoon of white sugar to the mix. Bring mixture to a boil.. lasagna noodles boiled to par.. 3 per layer… 3 layers… mix in a separate bowl 2 cups of cottage cheese, spices, egg mixture…in separate pan sauté chopped whole onion, with 3 cloves garlic, 6 large mushrooms chopped, in some oil…when onions nice and translucent added chopped Swiss chard about 4 - 5 cups until chard is nicely wilted. When this mixture is cool mix together with cheese and egg mix. Layer 1/3 meat sauce on bottom, 3 noodles, 1/3 cheese egg chard mixture, 1/3 mozzarella cheese and parm, layer meat sauce, 3 noodles, rest of cottage cheese mixture, remaining 3 noodles, meat sauce, and rest of mozza and parm cheeses.. bake 45 minutes, remove foil bake until cheese is golden. 😋 Serve with homemade garlic toast. Thank you to all the chefs for their inspiration and contributions to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "advancedcat"
},
"reviewBody": "I've made it a few times and it's really good. Only adjustments I made was to add 1 pound of fresh spinach that I cooked down in a skillet and added 4 cups of chopped mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Berger"
},
"reviewBody": "No changes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruce C."
},
"reviewBody": "This is the best spinach lasagna recipe I've made. To simplify the prep I used a large saute pan with a lid. I sauted first the onions for a minute, then added the garlic and mushrooms and sauted all of that for another minute or so, then added fresh spinach leaves on top and covered it all with the lid until the spinach steamed and softened (about 5 minutes). I also used twice as much spinach as called for (20 oz instead of 10.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matt Meixler"
},
"reviewBody": "Maybe I did something wrong but there didn't seem to be enough of the ricotta mixture for three layers. Also, despite squeezing as much moisture out of the spinach as possible, the final product turned out a little liquidy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chanel Morris"
},
"reviewBody": "Delicious i used more spinach then it called for otherwise it came out perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Michelle Reuser"
},
"reviewBody": "Pretty good veggie lasagna! I used an entire 10oz package of spinach and three chopped roasted green peppers instead of mushrooms. It could’ve used much more sauce but that’s my personal opinion. The flavor could’ve been more vibrant if I used fresh herbs instead of dried. All in all, really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gnarlo"
},
"reviewBody": "Delicious, but tweaks are needed to get it to look like the photo. For that much spinach, one would need ~4 cups of fresh spinach or two bushels (maybe less if you are using the kind in a tub since those leaves tend to be flatter). We only baked 50 minutes and found the lasagna a bit dry. Next time, I'll add another 1/2 cup of pasta sauce. I also used 1.5-1.75 cups of sliced, fresh crimini mushrooms and would do that again. One could probably go up to a whole onion depending on how smooth or chunky you like your filling. Lastly, we didn't have any parmesean, but we had cotija on hand, and it worked out great. We dialed back on the salt a little since some brands of cotija (Cacique in particular) can be very salty. Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brittany Schmitz"
},
"reviewBody": "So many changes had to be made but it ended up being a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Awful Cook"
},
"reviewBody": "Hey, it's me again. Guess what? Even though I botched it, it still WORKED!\n\nNow understand, my husband is an apex carnivore. He PRIDES himself on his \"guys' \" lasagna. (No ricotta, etc) Each pan of his weighs +12 pounds using sausage and 7 kinds of cheese. He always says \"if I want ricotta, I'll get a cannoli.\"\n\nAs I was making this, he kept saying \"please stop calling that lasagna.\" And \"you're SOAKING your noodles?\" etc. As it was cooling, he tried to cover it w/tinfoil and asked \"who is this going to?\" (He was going to immediately give it AWAY!) Sheesh!\n\nSo, when it was done cooling, I asked \"Would you like to try it?\" and with a lot of drama/eye-rolling, he cut himself a piece/ate while I was cleaning up. He sheepishly looked at me grinning/holding his plate up &amp; asked \"can we have another piece?\" (Meaning he and the dog). He cut himself another HUGE piece! Well what do you know. As others said, even MEAT eaters like this lasagna! And yes, I did give the rest away because it was far too large for 2 people. I'll make it right next time.\n\nYeah, don't get on me about rating a recipe \"5 stars\" that I didn't make. It's not the recipe's fault I botched it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KelliontheCoast"
},
"reviewBody": "This really good. Next time we'll use a whole bag of spinach. I also used no boil noodles. It made this a quicker, easier recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DKB"
},
"reviewBody": "It was awesome. Even the meat eaters loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosie526"
},
"reviewBody": "This took longer than we expected. We added more sauce... approximately 1&amp;1/4 jars for 8 servings, although made in a 9x13 pan with 4 layers. Type of sauce would likely make a difference, we only had Classico tomato and sweet basil and Prego on hand. Overall pretty yummy for a veggie lasagna. I think the mushrooms made it taste meaty which was good without the need to use meat. Delicious, Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "john"
},
"reviewBody": "I added some Cabernet Sauvignon to the sauce doubled the garlic, 10 cups spinach and 4 cups mushrooms. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dkaros"
},
"reviewBody": "Very good recipe. Added a little more sauce (used a 28 ounce jar of Raus) and a 12 ounce package of whole wheat lasagna noodles (16 not 20). This lasagna is good enough for breakfast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "It’s tasty. I’d submit a photo but the size limit prevents me. Pro tip: don’t try to shred the mozzarella. Just slice it. Also, directions are incomplete. As written, you’ll have five noodles left over. Instead, make a fourth layer of noodles and sprinkle with additional Parmesan and/Romano and more slices of mozzarella. Then bake for 30 minutes covered with aluminum foils (spray underside with cooking spray or tent to ensure cheese and foil don’t touch). Then remove foil. Bake for another 30 minutes uncovered so cheese browns. I’d make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Geneva Lizzy"
},
"reviewBody": "I added some red pepper flakes to the tomato sauce because it needed just a little more of a kick - and agree the recipe calls for more lasagna noodles than can fit in a lasagna pan, but otherwise great recipe! Received rave reviews!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meghan Holt"
},
"reviewBody": "Haven't made this yet but plan to for dinner. I live in a town with no grocery store. Just curious if anyone used canned mushrooms. I have all the other ingredients other than fresh mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carlee carter"
},
"reviewBody": "thank you so much!! this is soo good! it took me forever to make, it was my first attempt at making homemade lasagna, i added more spinach and backed off the cheese just a little!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mw11385"
},
"reviewBody": "I tripled the amount of spinach, doubled the mushrooms and it still didn’t seem like enough. Once it was mixed in with the cheese and the eggs (I added one, to make sure it tightened up properly) and I started layering it, I knew it was going to be killer. My family LOVED this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Amundson Smith"
},
"reviewBody": "I’m a recipe cook. Meaning I’m afraid to try too many tricky things without a good recipe. I just made this one for a Father’s Day dinner surprise and I was surprised at how simple it was! Lots of pre-bake steps but they were so carefully laid out it was easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anjali Shah"
},
"reviewBody": "Delicious! We used SarahWilkerson's advice, sauteed the spinach, garlic &amp; onion. We did not have romano cheese, so subbed parmesean. Finally, we did not use mushrooms. This was delicious and full of taste!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Abby Lauri"
},
"reviewBody": "This was delicious! My boyfriend doesn’t like mushrooms, so I used chopped up BUTTERNUT SQUASH instead, bc we had it, and it was AMAZING!!!!!! GREAT lasagna recipe... thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicia Parson"
},
"reviewBody": "We truly enjoyed this. I tweaked it a little. Just added more spinach and mozzarella cheese. It was the bomb."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ToriKibbs"
},
"reviewBody": "Really good :). I added three more cups of spinach"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn Benedict"
},
"reviewBody": "My Family loved this spinach lasagna!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sam"
},
"reviewBody": "vary good and and simple to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pegs"
},
"reviewBody": "Great. Very tasty with all the different cheeses. Works best with organic spinach, organic good good pasta sauce. Guests loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Kanabe"
},
"reviewBody": "Only use mushroom caps or omit. Follow proportions of my usual lasagne (9 noodles, 2/3 Cheese called for)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "writer_mom"
},
"reviewBody": "One of the things I love about this dish is that 1) it tastes a little BETTER then 2nd day, 2) it's quite filling even though there's no meat in this, and 3) my older son actually enjoyed it KNOWING it was meatless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisacoody"
},
"reviewBody": "AMAZING! My husband found the recipe and asked me to make it. I was skeptical, but did it anyway. It was the best lasagna I've ever had!! We'll definitely be making this again.\n\nTo make the prep time easier, I used ready-to-use noodles (adding 1/3 cup water to the cheese mixture), and sauteed the onions, garlic, mushrooms, and spinach together. I added MUCH more garlic than the recipe called for because we love garlic in our house. I used more spinach too, chopping it up straight out of the bag before sauteeing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharonras"
},
"reviewBody": "I used the no cook noodles and added extra sauce. We will definitely be keeping this recipe. I did only use 9 noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Viviana Buxeda"
},
"reviewBody": "As yummy as it looks! A fave of mine! Never disappoints"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary P"
},
"reviewBody": "Good recipe. I followed it exactly except for cooking the spinach. I used a package of frozen chopped spinach, next time I will use 2. I sautéed onion and garlic, then the thawed and drained spinach. Everything else I followed. Like another reviewer said the step of mixing the cheeses with the spinach was brilliant. Oh and way to many lasagna noodles, used 12, was just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sliversparks"
},
"reviewBody": "Followed the directions exactly and loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Cooper"
},
"reviewBody": "I used a lot more spinach and two cups of mushrooms. I sautéed the spinach with the onions and mushrooms as others have recommended. I used an extra cup of sauce too. It turned out wonderfully. A hit at Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pamela Chomper Rivera"
},
"reviewBody": "Took out the mushrooms and added a lot more fresh spinach. I steamed the spinach instead of boiling it to avoid adding too much extra water. My guest absolutely loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Kopp"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I added more spinach as most of the reviews I read recommended but will add even more next time. Very tasty and enjoyed by everyone"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jay Irwin"
},
"reviewBody": "I absolutely love this recipe and have made it now 4 times. I have made some changes to it. I put many more mushrooms in than what is called for and added Nebiola Blanco, Maitake, Shitake, Crimini, and Portobello. I also saute'd the spinach with olive oil and garlic, and used a ton! A ton, and it's amazing. Full large onion and 5 garlic cloves. All amazing and went all organic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bart"
},
"reviewBody": "I loved the taste of this recipe and will make it again. It was particularly great the next day, and I froze a couple pieces for later!\n\n ==&gt; Some comments:\n1) The prep time of 35 minutes seems VERY low, at least for me. I think it took me closer to an hour to prep. The timing matters when you have folks coming to dinner!\n\n2) I decided there was not enough tomato sauce in each layer, so I increased it, but I think I overdid it -- next time, I think I will stick to the recipe for the sauce.\n\n3) This is the first lasagna I had ever made. To keep the noodles from sticking together after I drained the water, I laid them on cookie sheets that I had sprayed with vegetable oil spray. I used several cookie sheets for this, which meant a lot of clean up. I need to figure out a better way before I make lasagna again!\n\n4) My dish could have stood a bit more baking -- I wish I had had the extra time (note the extra prep time in #1 above!)\n\n5) I used a bag of baby spinach which I boiled, drained, and pressed. I didn't bother measuring out 2 cups.\n\n6) As a 1st time lasagna maker, the number of noodles in the recipe confused me. I knew to overlap the noodles for each layer, so that wasn't a problem. While the recipe calls for 20 noodles, the box at the store contained 18. So I was afraid I would be short. In the end, I think I only used 15 noodles (3 layers of 5), so the box of 18 was plenty. I didn't have room for any more noodles, so I certainly didn't need 20."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gail"
},
"reviewBody": "Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirsten Herman"
},
"reviewBody": "Delicious. Picking up on some other reviews, I used 4 c. of mushrooms, around 12 oz of frozen spinach (that I microwaved and drained prior to cooking), a jar of artichokes, and sauteed it all in one pan. I couldn't find romano cheese so I substituted around 1/3 c. of parmesan. I forgot the egg but it was fine without it. I didn't use a mixer but just stirred the veggie and cheese filling vigorously with a large spoon. I also used more tomato sauce and no cook noodles. This all made for a very large lasagna that spilled over a bit but it was totally worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean Minorini"
},
"reviewBody": "Turned out great, and I am not an exceptional chef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sport1girl"
},
"reviewBody": "Yummy. Possibly the best lasagne I’ve ever had! And I’ve had a lot. First off, I made my own Pomodoro sauce, cheaper and tastier. Other than that I followed the recipe, exact for the egg. I think what made this stand out was mixing the yummy spinach, onions, mushrooms, spices and grated cheese with the ricotta cheese. I usually think it’s too bland but what was so full of flavor. Thank you! I’ll make it quite often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cwisconsin"
},
"reviewBody": "My Husband was skeptical that I was making a Lasagna without any meat....After his first helping he said it was a 9 out of 10! \nI added a alittle bit more ricotta cheese and used a food processor to combine the mushrooms, garlic, and onions so the pieces were not as big. \nThe only negative is that it was pretty greasy on top from all the cheeses"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaggieNM"
},
"reviewBody": "I didn’t bother with lasagna noodles. Just used bow tie pasta cooked to al dente. Used a lot more spinach (frozen, chopped). less ricotta, no egg, more mozzarella. Also added my secret ingredient: PESTO. Added a generous tablespoon of it (Costco brand) to the spinach mixture. As others commented...no need to cook spinach separately or using a mixer. I Sprayed the dish well with Pam before adding sauce as the bottom layer, then kept layering pasta, spinach mix, mozzarella, and sauce. Didn’t measure at all. I poured a few tablespoons of water over the top before covering and baking as the pasta will absorb more water and you don’t want it all to dry out. I call this dish LASAGNISH as I use other pasta instead of lasagna noodles (too much trouble.) This gets RAVE reviews at potlucks where it is especially appreciated by non-meat eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marta Becker Howell"
},
"reviewBody": "I followed the recipe but increased some quantities: I used two bags of fresh baby spinach, and next time I may use one more. I used a full 32-oz container of whole milk ricotta cheese, and a full box of fresh mushrooms. I used a full box of lasagna noodles, which I think are more than 20. Finally, I think Rao's Homemade Marinara sauce is the best, and I used a full 28-oz jar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "Make it more than once. The family loves it. I usually make double the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Absolutely delicious. I’ve made it several times and people always ask me to make more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheira"
},
"reviewBody": "I added a lot more spinach (about 6 cups or so) and had no fresh mushrooms on hand, so I chopped up canned mushrooms. I followed the recipe otherwise. It's more of a \"white\" lasagna and I personally like it saucier so I'll serve it with more tomato sauce on the side. Other than that it's a good recipe and I'll make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dale Muckerman"
},
"reviewBody": "Pretty good basic plan, but I tweaked it using homemade lasagna noodles and more spinach than in the recipe. I don't see how anyone could fit 20 regular noodles in a lasagna. I used 12 (3 per layer) but perhaps mine were larger than some store-bought ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Ruttan"
},
"reviewBody": "More garlic and herbs, less cheese, more spinach - delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alessandra"
},
"reviewBody": "No changes, I’ll make it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brit Aly"
},
"reviewBody": "I did not use eggs, used small curd cottage instead of ricotta and I went with my own sauce recipe, but the technique for the spinach in the white cheese sauce is genius! Making it for the second time tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georgann thomas"
},
"reviewBody": "My family loved it, hardly any left overs. For sure will make it again. Left out the mushrooms, used ravioli instead of lasagna noodles"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Esmeralda Bocanegra Jarvis"
},
"reviewBody": "Easy to make and it came out awesome, all my guests raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Randall"
},
"reviewBody": "I made this the day before and baked it the following day. It was fabulous"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "n9dug"
},
"reviewBody": "Our guests and we loved it. Didn't miss the meat at all"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa McKay-Conroy"
},
"reviewBody": "Loved this recipe. I didn't have Romano, but I didn't miss it. Made with homemade tomato sauce, definitly enjoyed more than a meat lasagna. Brought it to a Christmas pot luck and received a lot of compliments"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Resnick-Clark Trimboli"
},
"reviewBody": "made it with stuff shells instead. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "malott72"
},
"reviewBody": "I left out the mushrooms and onion. it tasted amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jemia Robinson"
},
"reviewBody": "No changes . I will make it again cook time will be less than hour ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chesapeake"
},
"reviewBody": "Absolutely fabulous! Amatuer in the kitchen but with the help of the video (step-by-step), it was amazing! Making it for New Years!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah Holman"
},
"reviewBody": "This was delicious! I didn't boil the spinach - seems very unnecessary. Next time I make it, I am going to try adding way more mushroom, spinach, and onion. The top didn't get a browned/crispy like I wanted, so next time I will remove the tinfoil with 10-15 minutes remaining or try the broiler at the end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chiapas"
},
"reviewBody": "just perfect! I did this for a small get together with friends and everyone loved it. This lasagna was super tasty, even for the meat eaters. I did the recipe just as directed, but added one more layer =4. It turned out delicious. The last layer was pasta with sauce and mozzarella cheese. Will do it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna Schwartz Gudmestad"
},
"reviewBody": "Delicious! I made it with no boil noodles, 1 lb of fresh spinach added 8oz cottage cheese and doubled the sauce. It was a hit with the family and the neighbors! This one’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alyssa Sanchez"
},
"reviewBody": "Super yummy!!! Would recommend for a great family dinner :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lis"
},
"reviewBody": "Delicious!! Will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Lewis"
},
"reviewBody": "Used two bags of spinach, 9 noodles, 1 large tub of ricotta. Skipped the mushrooms for Jack."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri-Lou"
},
"reviewBody": "Excellent recipe. New staple in our home"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tiggersweetypie"
},
"reviewBody": "Five stars! So yummy and easy! Only change I made was cook the spinach in the mushroom mixture like others suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Hood-Morris"
},
"reviewBody": "Very popular recipe with everyone including the meat eaters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Kohn Murtha"
},
"reviewBody": "I'd gladly make this again. I did make a few changes. Chopped up the spinach and sauteed it with the other vegetables and used a bit of seasoned salt in there. I also, blush, blush, forgot to add the tomato sauce until the end, so I loaded up my top layer with extra parmesan and mozzarella and dumped a big jar over the top of it all and covered it up and it was fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Ann Rudd"
},
"reviewBody": "An awesome vegetarian dish! I put zucchini and spinach in it and made it with Alfredo sauce because I have tummy issues and can't take tomato products. 20 noodles were way too many for me and hubby. Wonderfully delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elsiejay"
},
"reviewBody": "I had so much fun making this. I live in Guatemala and while people have heard of lasagna, few have tried it, nor really understand what is in it. We had a family of 7 drop in as I was getting ready to assemble, and pretty soon had 5 young men chopping veggies, grating cheese, and standing in line to assemble it all. \"Another layer of cheese?\" \"It already has 4 kinds of cheese in it.\"\n\nI made one batch vegetarian, and the other with baked chicken breasts, as my husband won't eat anything with mushrooms -- go figure. We had guests from Spain and Mexico for dinner, and the dish was a hit!! If you have never made lasagna before, follow the recipe. If you have made it in the past, you can add other ingredients as you choose. I added zucchini slices to the mix, and a few red pepper flakes to the sauce, because I like it just a bit zesty. Remember to spray the aluminum foil before you put the pan in the oven or you will lose all the top cheese. Enjoy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLUEGIRL5"
},
"reviewBody": "This is a wonderful recipe. I used only 12 noodles, doubled the vegetables, and mixed the sautéed onions and mushrooms into the sauce (in place of where many might put ground beef in other recipes). The result was a gorgeous, delicious lasagna. Thanks for the post!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda Kim"
},
"reviewBody": "It was very tasty, but I think as-is it may have not been quite as good. I doubled the spinach (probably will add more next time), and added a cup of zucchini with the mushrooms. This was really good. My 5 year old thought there was too much ricotta, and I kind of agree, but I'm not sure if lowering to 2 cups ricotta would be a good idea, I will experiment a bit with that one... thanks for the recipe though, I'm glad I tried it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Kesler Tewalt"
},
"reviewBody": "It was really good overall, but a bit dry. Next time I will use more sauce, less ricotta, and add extra spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "grupbeav"
},
"reviewBody": "This is very good! Made it for a potluck at work and it was gone in a flash! I am not a stickler for measuring ingredients and added way more mushrooms and at least 1.5 times the spinach it called for. Other than that I followed the recipe pretty closely - or at least as close as I ever do. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna W"
},
"reviewBody": "I made a few changes just to make it quicker and because I didn't have a few ingredients on hand. I used frozen spinach that I had and sauteed it with the onions instead of chopping and boiling fresh spinach. I also used 2 containers of cream cheese instead of ricotta. It was quite the hit at dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beeg"
},
"reviewBody": "Yes\nAdded 2tbsp tomato paste to Muir Glen pasta sauce. Also sautéed green and red bell peppers, celery, carrots and 1/2 small jar sun dried tomatoes chopped to sauce along with 2 tsp each oregano and basil. Only had 16 Oz ricotta so added 8oz low fat cream cheese. Used 1 bunch of fresh spinach and probably could have used 2. Did not use mushrooms as we don’t like them. Used 12 lasagna noodles. Not sure how 20 would fit a 9x13 dish. all else as written. Came out beautifully. Cuts well. And for you green-o-phobes you don’t even notice the spinach. Adds texture mostly. This is a keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Ng"
},
"reviewBody": "Used a whole bag of spinach instead of 2 cups. Used 2 cups of mushrooms and more onions than called for. Sautéed the spinach instead of boiled cuz I was too lazy to wash another pot! I put a bit of spinach into the cheese concoction, but mixed most of it with the mushrooms and onions instead and layered it separately from the cheese mixture. Sauced the bottom of the pan, 2 layers inside, and the top topped with mozz and parm. 1H cook time was perfect with foil on. Guests loved this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Stephens"
},
"reviewBody": "Excellent recipe. I added zucchini, fresh mushrooms and a large sweet onion. I also added fresh spinach into the mixture toward the end so it was all combined vs boiling it separately. The sweetness of the onion really came through in the end. \nI also added some extra sauce to keep it all moist. I recommend you use a pizza mozerrella ball as it has more flavour and triple the basil. Awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernice Dray"
},
"reviewBody": "This was easy to fix. Everyone gobbled it up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yeeli Lee"
},
"reviewBody": "Amazing! My teenage son who doesn't like to eat veggies, ate it all. Raved reviews from everyone.\n\nI was only able to fit 2 lasagna side-by-side for each layer. I replaced the Romano cheese with Cheddar cheese. I also added a little bit of clove (saw it in a different recipe) and didn't use any salt at all, and it was so flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meve"
},
"reviewBody": "I add a small amount of ground Italian sweet sausage to my sauce 1/2 cup. It gave it a little zip in flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Paysour"
},
"reviewBody": "Delicious! I actually forgot o add the tomato sauce as I layered, so had to put it all on top. Still came out very good. Can't wait to remake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmi"
},
"reviewBody": "I will do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ifacey"
},
"reviewBody": "This recipe was easy to make. Everyone went back for seconds, and I will certainly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S-Marie"
},
"reviewBody": "I was concerned it wouldn't be good because I didn't have any onions or Ramono cheese but it was yummy!!! I also added more spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennamae89"
},
"reviewBody": "Such a great lasagna! I made it just as described! My 2 year old LOVED it! Hurray!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Hileman Rothman"
},
"reviewBody": "I added cooked acorn squash because I had some on hand. It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cyndi Harris Divsalar"
},
"reviewBody": "This turned out well. I did what others did and sautéed the spinach with the onions, etc. also., I used fresh mozzarella and sliced it instead of shredded. It could use a little more spinach but it was a hit!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/22729/spinach-lasagna-iii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/22729/spinach-lasagna-iii/",
"name": "Spinach Lasagna"
}
}
]
}
}
, "about": [
]
}
]