				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spinach and Cheese Stuffed Pasta Shells"
,"datePublished": "1999-07-22T10:44:11.000-04:00"
,"dateModified": "2022-07-14T17:38:40.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Katherine Denning"
,"url": "https://www.allrecipes.com/cook/124863"
}
]
,"description": "A stuffed shells recipe for magnificent jumbo pasta bursting with cheesy spinach filling."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/LNlsgdSFbbfuw2EQD7wsD0fKdyQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2858066-910011c6ba674d0f95cf35ac389cbb83.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spinach and Cheese Stuffed Pasta Shells"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "205"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "703 kcal"
,"carbohydrateContent": "95 g"
,"cholesterolContent": "59 mg"
,"fiberContent": "10 g"
,"proteinContent": "33 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1004 mg"
,"sugarContent": "16 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"32 jumbo pasta shells",
"2 cups ricotta cheese",
"2 (10 ounce) packages frozen chopped spinach, thawed and drained",
"1 cup grated Parmesan cheese",
"2 tablespoons fennel seed",
"2 teaspoons dried basil",
"4 cloves garlic, minced",
"salt and pepper to taste",
"3.5 cups spaghetti sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of salted water to a boil. Gently place pasta shells in boiling water; return water to a boil. Cook until shells are just tender; drain well."
} ,{
"@type": "HowToStep"
,"text": "Squeeze spinach dry and place in a large mixing bowl. Add ricotta, 1/3 cup Parmesan cheese, fennel, basil, and garlic. Season with salt and pepper; mix well."
} ,{
"@type": "HowToStep"
,"text": "Spread 1/2 cup spaghetti sauce evenly over the bottom of a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Fill each pasta shell with spinach-cheese mixture. Arrange shells, filling-side up, in the baking dish. Spoon remaining spaghetti sauce over shells. Sprinkle remaining Parmesan cheese on top of shells."
} ,{
"@type": "HowToStep"
,"text": "Cover the pan loosely with aluminum foil and bake in the preheated oven until heated through, about 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Perla"
},
"reviewBody": "I used a 16 oz package of frozen spinach. It was very dry so that was good. And I used a 32 oz container of ricotta. And made two pans full. So I used a full jar of spaghetti sauce to go over it and some mozzarella cheese on top. Abondanza!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Gayle Allan"
},
"reviewBody": "Next time I would grind the fennel in a mortar/pastel and add oregano and garlic powder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita"
},
"reviewBody": "DELICIOUS! LOVE HIS RECIPE! Spinach and ricotta stuffed shells is one of my family's favorites! The recipe is simple and easy to follow with just the right amount of ingredients! Simply delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Reynoso"
},
"reviewBody": "Made Saturday night everyone truly enjoyed it followed the recipe as is except I didn't have Mozzarela Cheese I submitted with Asiago Cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAA"
},
"reviewBody": "A keeper. Easy! The fennel is a wonderful taste surprise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimber"
},
"reviewBody": "I’ve made these stuffed shells many times it’s a great recipe love the fennel seed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Goodman"
},
"reviewBody": "I will definitely make this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Esterak"
},
"reviewBody": "This is an awesome dish to make! I totally love this dish. I am always asked to make this dish for get togethers and birthday parties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YVONNE J"
},
"reviewBody": "I didn't have fennel seed so I used Italian seating to make up the flavor. Everyone in the extended family loved it. The Barilla brand shells has 40 shells in the box so I think next time I will double the ricotta cheese so I can fill all the shells nicely. It did have a lot of spinach but everyone liked it fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mikkismith"
},
"reviewBody": "I had to give away the first batch because I didn't know that fennel is licorice flavor. Second batch without fennel was wonderful, topped it with mozzarella cheese. I make large batches regularly, Everyone loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacey B."
},
"reviewBody": "It was so yummy even my 5 and 12 year old gobbled it up!! I added the shells to boiling water and let them boil for a few minutes then turned the burner off and let them sit in the water while I made the cheese and spinach filling, this way they were firm enough for me to fill them and they finished cooking in the oven. They were perfect! I added mozzarella, ricotta, cottage cheese and shredded parmesan(I prefer over grated), to the spinach along with garlic and basil it was so tasty!! I also topped it with mozzarella and shredded parmesan! Everyone loved it I will definitely make this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bluewink"
},
"reviewBody": "Really good. I used Bertolli Vodka Sauce and 1 tsp crushed fennel instead. I followed few suggestions -- added 1 egg and 1 cup mozzarella and only 10 oz. of spinach and sprinkled mozzarella on top. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef V"
},
"reviewBody": "Excellent! I really enjoyed the fennel in here. I used 2 tablespoons of basil pesto in place of the basil. A nice change in pasta dish. Your choice of sauce will make or break the dish.. Use a good quality sauce. I used Barilla tomato basil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tasha"
},
"reviewBody": "My daughter helped me cook this tonight and my family thought it was delicious. Definitely a repeat maker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "Thank you for submitting your recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GM406"
},
"reviewBody": "The fennel gave it a wow factor. I did add some fresh mozzarella and a small amount of pesto since I had no basil in the filling. Home made sauce with sausage is what my family loves. This is a keeper. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DarleneG"
},
"reviewBody": "YUMMY"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erndie"
},
"reviewBody": "I enjoyed making It and it was great! Tonight was my turn to make dinner and everyone loved it! I listened to the comments and made some adjustments. I also made some sweet corn to go with it. Just delicious, definitely a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Mory"
},
"reviewBody": "Very good! I left out the fennel and halved the ricotta with cottage cheese for extra moisture, and added mozzarella as some of the reviews suggested. Cooked the shells until just tender enough to manipulate. Filling the shells took a little practice, over filled them at first, but got the hang of it quickly. Since it is just my husband and I, I used 8-9 shells for one meal. The rest I laid out on a cookie sheet and froze, then placed in a Ziploc bag. I made it again sometime later and it worked perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Garcia"
},
"reviewBody": "Easy to make and delicious! I added an egg as suggested and left out the fennel. I used hot breakfast sausage and added it to the sauce. Perfect amount of \"zing\". I found that only boiling the shells for a few minutes made things a lot easier when filling. Everyone loved this! Been asked to make this for peoples potluck as \"their\" dish !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cstillwell"
},
"reviewBody": "I liked the fennel seeds, however, I need to use low fat cheeses as I'm trying to lose weight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erikae"
},
"reviewBody": "I used fresh spinach instead of frozen. I threw in a handful of mozzarella too. I used a sun dried tomato pesto vs regular spaghetti sauce. My husband had 3 servings. Thumbs up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEBX2"
},
"reviewBody": "Followed the recipe as it is written, came out great. I have made this several times, always a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angelika"
},
"reviewBody": "OH My gosh, was this recipe delicious! Adaptable and customizable too. I made the recipe as listed except I didn't have fennel. I used fresh spinach, cooked down and stuck it in to the food processor with the ricotta, parmesan and whole cloves of garlic. Easy peasy! I scooped the processed filling into a ziploc bag and cut off the corner. Piped the filling into the shells. SO tasty and my fiancee was completely in heaven. Will be making this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "SBFRIAR"
},
"reviewBody": "The fennel absolutely overpowered the flavor of this dish. If I were to make it again I would omit the fennel and possibly add sautéed onion or some other spice for additional flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "onetiredmom"
},
"reviewBody": "It needed more ricotta and less spinach. It's a good start....but needs definite tweaking. I'd probably use fresh spinach too instead of the frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dslaughter"
},
"reviewBody": "I really liked it but the reason I didn't give 5 stars is because I felt that it calls for too much garlic. I love garlic but it overpowered all the other flavors and mainly just tasted like garlic. Next time I would add one maybe two cloves at most, not four. Also I added mozzarella and cottage cheese and put mozzarella on top. Will make again and cut down on the garlic next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arnandlor"
},
"reviewBody": "This turned out great! I used 2 cups of cottage cheese (don't like ricotta) and used canned spinach drained and pressed super good in a strainer. Excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AZ93"
},
"reviewBody": "A little too much basil and though I halved the spinach, it still seemed a bit much. Not quite cheesy enough for me either and I added mozzarella in the stuffing and on top. Go easy on filling the shells also because I wound up with a lot left over. Not bad, but just not my favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NewCookinMama"
},
"reviewBody": "This was really easy to make especially since it was my first time making stuffed shells. I altered it a little bit though. I added cooked ground beef, italian seasonings &amp; mozzarella cheese. I took out the fennel seed, salt and pepper cuz I thought it was just not needed. I did double the recipe for our large family but still only used 10 ounces of spinach and 4 garlic cloves. I think doubling either of those would've been overkill on the finished product. Since this was my first time making these, I wasn't sure how much filling to put in each shell. I think I may have overdone it bc I had quite a few shells left over, but whatever. I'll just use those for an easy lunch for the kids tmrw with sauce. :) With my adjustments, I filled a 9x13 pan and a 10x13 pan. Both were packed with shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Me"
},
"reviewBody": "Very good! A little heavy on the spinach. Could have used more ricotta instead. I notice some pictures show with mozzarella. Totally not needed! My 14 yr old came back for 2nds and said we need to buy spinach more often! LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karatepenguin"
},
"reviewBody": "It was alright-not one of my favorites"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rayna"
},
"reviewBody": "very good, but I would like to keep looking. Though, my biggest complaint was the sauce. Maybe next time try it with MY spaghetti sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melodee"
},
"reviewBody": "I made some slight changes and these were delicious. It was only me and my husband and so I halved the recipe. Instead of plain parmesan I used the shredded Italian cheese mix. I used 1 tsp ground fennel and 3 cloves garlic. I still spread 1/2 cup sauce in the dish before putting the shells in. I removed the foil the last 10 mins of baking. My picky 2 year old ate this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Camille"
},
"reviewBody": "For me (a seasoned gourmet cook), the filling needed more fennel and basil. I would double the basil and add another TBSP of fennel....which I ground. I released all of the water from the spinach and I believe that made the filling too dry. A little moisture in the spinach may have made it easier to mix. Bake it only 30 minutes or the shells begin to dry out. And choose a sauce your really enjoy as that can really enhance the recipe. I used vodka sauce, but think that next time I would use a sauce that is more garlicky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Yummy!! I changed the original recipe a bit to the ingredients I had on hand. Made my own spaghetti sauce, added 1 egg,1c. mozzerella and 1c. of cottage cheese to the ricotta cheese mixture. I also used a bag of fresh baby spinach (finely chopped) and sauteed it with chopped onion and about four cloves of garlic in olive oil. I also only used 1 tbl. of fennel. I only cooked the shells 5 min. as someone else said. Came out great.My husband loved it. I will definitely will make this again. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WatsonGrl"
},
"reviewBody": "This was good, but needed a little heat. I used fresh spinach rather than frozen. Next time I will add some crushed red pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alska Du"
},
"reviewBody": "I made this tonight for dinner. I made it for \"4\" servings instead of 6 because I didn't have that many shells. I added an extra teaspoon of fennel seeds .. and I added extra sauce as I like saucy shells and sprinkled mozzarella cheese on top. Came out excellent! I will be making it again for sure :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Janafay25"
},
"reviewBody": "I felt this meal was average. It needed something to give the dish an extra kick. Maybe spicy sausage or beef added. I don't think I'll make this again, but it was fun to make...stuffing the shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassie Carola"
},
"reviewBody": "I made this recipe with FRESH spinach and FRESH basil that I chopped in the food processor and mixed with ricotta, LOTS of garlic, and Parmesan cheese (I didn't have fennel seed on hand). I boiled the shells for 5 minutes and they were perfect to fill without cracking. I topped with fresh grated mozzarella, tomato basil sauce and more Parmesan. Absolutely delish! I think using all fresh ingredients really makes a big difference. I made it a second time for a girls night and everyone loved it, and all my vegetarian friends were really happy to have something good to eat too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AimezBeacoup"
},
"reviewBody": "Made this tonight and it was a huge hit. I used the fennel called for in the recipe and didn't find it too strong...it added just the right amount of depth to the taste. I did use a spicier spaghetti sauce and added some red pepper, so perhaps that balanced it out a bit. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LMVarga"
},
"reviewBody": "We loved this. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dannynewnun"
},
"reviewBody": "This was really tasty...I actually used some ideas from it for my recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SlickSil"
},
"reviewBody": "These we're really good! Never made shells before, I will be making these again! One good way to add veggie's and my girls ate them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yvetteski"
},
"reviewBody": "I upped the veggies by adding a bunch of scallions and chopped artichoke hearts. I punched up the flavor by doubling the fresh chopped garlic and adding fresh basil, and some red pepper flakes. For the sauce I mixed Safeway's Artichoke Pesto and a can of Muir's Glen fire-roasted crushed tomatoes . I reduced the Parm and subbed some low-fat mozzarella. \n\nWhile I loved it my daughter didn't like the fennel seeds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yum Yum"
},
"reviewBody": "This was good but lacking in the flavor department..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TOELESSINCA"
},
"reviewBody": "I think this is a good recipe. It needs more than 3 1/2 cups of sauce though. I probably used 5 cups and it could have used a tad more. I didn't need all the pasta shells. I used about 26 instead of 32 which means I may have stuffed too much into each shell. I did add some grated mozzarella cheese on top which was really yummy. I will make this again and I loved the fennel seeds in the stuffing. It was quite a taste surprise when biting into one of those little gems."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "emmascookin"
},
"reviewBody": "Did not like this dish... :P"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Andy Jehly"
},
"reviewBody": "I love spinach but there was too much spinach in proportion to the cheese. I would only use one package next time. The fennel was a really nice touch, although I only used about a teaspoon because that's all I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Beverly Jane"
},
"reviewBody": "Yummy! Thanks very much for the recipe. I had to change just a wee bit cuz hubby is very fussy. But used all of your ideas and these are my keepers too. I made enough to freeze three more meals :-) Thanks again. Bev"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LFeeley"
},
"reviewBody": "I loved it! And it was easier than written since I took the lazy way out and used uncooked lasagna noodles and simply let the dish sit for the afternoon before cooking it. I made a quick sauce with canned tomatoes and left all the liquid in so the noodles coudl soak up the liquid (the trick is to thin your sauce, and also to make sure the noodles are completely covered) The fennel seeds in this gave the recipe such and interesting and fantastic taste. It was even better the next day, and I'm always looking for dishes I can cook ahead... this is one! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KathyO"
},
"reviewBody": "Had it for my sons, a vegetarian friend, and a bunch of college age kids. Everyone devoured them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "druzgal"
},
"reviewBody": "I left out the fennel, used only 1 package of spinach, added 1 cup of shredded mozarella to the filling, and mixed everything in the food processor to better disguise the spinach for my two year old. It was good,, maybe could use a little more seasoning to the filling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roxanne J.R."
},
"reviewBody": "I left out the fennel seed, added shredded cheddar to the mixture along with some cayenne and black pepper. Sprinkled extra cheddar on top before baking. Was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "superkarynfragilistic"
},
"reviewBody": "Dinner of sides is my traditional Thanksgiving meal. Not that I don't like sides, but I wanted...more. I made these shells to share with the omnivores of our clan and they were met with rave reviews. I did find the fennel to be a touch overpowering when added as the recipe states. I made another batch using a teaspoon of fennel and that seemed perfect. I also used a bit more ricotta and mixed in some mozzarella cheese in the second batch and it was quite tasty. I found that using my immersion blender to mix the cheese and spinach mixture helped blend the spinach more evenly throughout the mixture--made it much creamier, too. Overall, an excellent standard and easily tweakable recipe that I am sure to use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EValChi"
},
"reviewBody": "This was quite tasty I think! I did add an onion - which I sauteed with the garlic, spinach and basil before mixing it with the cheese. Very easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Cain"
},
"reviewBody": "these were AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "melissassm"
},
"reviewBody": "My advice is SAUTE THE GARLIC! If you don't saute it before adding it to the mixture it stays pretty much raw and is what I think ruined this for me. This has all the elements to be good, but wasn't quite there! I skipped the fennel, just personal taste. I also found that there was too much spinach and it made the filling quite stringy instead of nice &amp; smooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael and Lori"
},
"reviewBody": "To us this wasn't the greatest dish we ever had. We love spinach but this dish had way to much. It was all spinach and not enough ricotta. The recipe calls for 1/3 C. parm to go in the recipe and 2/3 C to go on top. I think this was a typo and 1/3 C. was suppose to go on top. WAAAAY to much parm on top. I will search for a better recipe and if I do make this again I will use 1/2 the spinach and make up the missing spinach with ricotta. The spinach also needed precooked some because the 30 min. cooking time left the spinach to tough and the stuffing of the shells was just barely warm. I think it needs to be cooked at least 40 maybe even 50 minutes. Tonz of ppl love this recipe though so thanx for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meganann"
},
"reviewBody": "Good, but would do without the fennel next time. Would also top with more sauce and mozza cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mackenziegrove"
},
"reviewBody": "Great recipe, only used one tablespoon of fennel seeds and it was way to much. Next time I will try it with only a half a tablespoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Happy_Mom"
},
"reviewBody": "Very great recipe def. a keeper...I added Hamburger meat seasoned with italian seasoning...my family are all meat eater so I didn't think the cheese would be very filling by itself!! Great for entertaining as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whadevergood"
},
"reviewBody": "This is an outstanding recipe. I enjoyed making it. Moreover, the family loved it! This is a keeper, definitely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrs.2akoi"
},
"reviewBody": "It was really yummy! I used red onions instead of yellow. I also used mozarella instead of parmesan cheese because it's what I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LareinaK"
},
"reviewBody": "We made quite a few changes to this recipe. Those changes just fit our taste better. First of all I used creamed spinach and instead of ricotta cheese (none of us like it) we used a little bit of cream cheese and about a cup of mozzarella. We only put 1 Tbsp of fennel seeds, but next time I would definitely leave them out. I found the whole thing a little bland so next time I think I will add some spices to kick it up more. I used four cheese sauce since that is my husbands favorite. Also, I didn't need anywhere near 32 shells. I bet we overstuffed 20 or so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chloexr329"
},
"reviewBody": "Yummy, i halfed the recipe and left out the fennel b/c I didn't have any on-hand. Next time I will use the fennel b/c I think it would have been more flavorful with it. Also I used low-fat ricotta instead, couldn't taste a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SNOSHARK"
},
"reviewBody": "I scaled back this recipe to make 3 servings, and we still had a few left over. Yay! Now we have more yumminess to enjoy for another meal. I made a few minor adjustments to the recipe: added one egg, and used about ½ c. shredded mozzarella on the shells before adding the sauce on top. The shells came out looking beautiful- even the MIL complimented me on how they looked picture perfect. One suggestion- I LOVE fennel, but it made a difference ( in a good way) to make the filling before so that the fennel has a chance to mingle and mellow with the other flavors. I think next time I make these will add about ¼ c. chopped pine nuts to the filling. This is certainly a make again recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PG523"
},
"reviewBody": "I liked it but my family didn't like the fennel (they said it tasted \"minty\"). Next time will use less fennel, and consider chopping it smaller so you can't feel/taste it as much. Otherwise great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlcrew531"
},
"reviewBody": "I left out the fennel seed and added ground beef. It was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Davis-Engfer"
},
"reviewBody": "This is a very easy recipe that is actually pretty good. I made a few modifications -and next time I will make a few more. I like spinach but the spinach very much overwhelmed the ricotta cheese. Next time I would add 2 containers of ricotta cheese to the 2 packages of spinach. I like the flavor the fenel gives but I really do NOT like biting into a fenel seed! So next time those suckers are getting CRUSHED before I add them! I added minced garlic instead of cloves, and I used more spaghetti sauce than the recipe calls for. I also added mozzarella cheese on the top along with parmesan. Instead of boiling the shells until they are super soft and pliable I soaked them in boiling water until they were still firm- but moveble- this made it soooo much easier to fill! but yet they cooked all the way through in the oven. I also added the mixture into a ziploc bag and cut the corner off the bag to fill the shells- works fairly well if you do not have a piping bag! Plus you can get more filling into the shells and it's a let less mess- and looks more presentable and uniform!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nmswer"
},
"reviewBody": "I used fresh spinach and omitted the fennel...They were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Scott"
},
"reviewBody": "This recipe was amazing! I made it without fennel seed(just didn't have any) and used fresh spinach and homemade ricotta........super yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "This would have been great without the fennel seed. If you like fennel seed you will love it, but we don't care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YELLOW6"
},
"reviewBody": "Delicious. We served them to a crowd of 25 guests at a going away party. Everybody there loved them. I am making them for Sunday dinner this week for my family. I will bake half and freeze half for another nights dinner. Yum. We used Ragu Roasted Garlic and Onion sauce. My favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLM216"
},
"reviewBody": "Easy to make and yummy to eat. I used both parmesan and mozzerella cheeses in this recipe. I like the \"servings calculation\" feature at this website. Also, you can adjust some of the ingredients to suit your taste. Try it with a vodka creme sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEMERY"
},
"reviewBody": "My family loved these. My husband has to have lots of meat in everything we make so I added sausage, and chopped up pepperoni to the mix. I also found that adding sauce to the bottom and sides of the dish before adding the shells helped to keep them from sticking on and drying out. I added more sauce and cheese to keep them from drying out and because we love cheese. This was a wonderful recipe. It was quick and easy to make and turned out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa B!"
},
"reviewBody": "It was good but Blah. It was missing something. It needed egg and something else in the filling as it didn't seem substantial enough, especially if you use a heavier sauce. I would make enough changes that it wouldn't be the same recipe. That is just my preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bakeaholic"
},
"reviewBody": "I added cooked italian sausage to the filling, and that made it even tastier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "Very good stuff. I did half the recipe and added some mozzarella to the top. We really enjoyed these filling rich shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Simchanna"
},
"reviewBody": "This was really good. My family recently became vegetarians and I'm always on the lookout for good meals. This one definitely made the cut. The fennel was an amazing (and unexpected) addition. This one is going into permanent rotation. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LINDA MCLEAN"
},
"reviewBody": "This was a snap to put together and very good with some minor changes. The fennel addition didn't appeal to me so I left that out and used fresh basil from my garden. I always add an egg to my filling and because I wanted the filling to be extra cheesy, I also added shredded mozarella in and on top of the shells. Thank you Kitkaty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CeliaBelia"
},
"reviewBody": "Very good! My BF won't eat anything unless there is meat involved, so I browned some ground italian sausage and added to the spinach and cheese mixture. Also covered with mozzarella cheese for the last 5 minutes of baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "susiekew"
},
"reviewBody": "Easy to put together and pretty tasty. One daughter said she would like it better without the fennel seed, and another daughter said she would like more cheese and less spinach, so it's not out favourite, but still pretty good. There was not enough filling for 32 shells, but it still made a lot. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jamie_dh"
},
"reviewBody": "I made mine earlier in the day (while my 9 month old was asleep!) Then put it in the oven at dinner time. Was very simple but super delicious. My hubby loved it and assumed I was in the kitchen all day making it!! Hehe! I did substitute cottage cheese for the ricotta cheese. And left out the fennel seed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cupcake"
},
"reviewBody": "This recipe was super easy, and VERY yummy. I didn't have any fennel seed or basil handy, and I only used 1 package of spinach. I also used smaller shells. This is a good dish to make to take to a get together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Jarquin"
},
"reviewBody": "This was delicious! I left out a couple of ingredients and added more spinach, it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Reyes"
},
"reviewBody": "I loved this recipe. But it took me a long time to make it :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Easy. Delicious. Also makes great leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jodi Fox"
},
"reviewBody": "These are great! I'm usually only cooking for 2 so I fill the shells and freeze them in small portions. I allow the shells to thaw and bake as stated in the recipe. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "strawberrygashes23"
},
"reviewBody": "This is the basic stuffed shells recipe that I was hoping it would be! I thought the fennel seed was a little much, so next time I won't add that. I also added hot italian sausauge to half of the cheese/spinach mixture for my husband."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "Great recipe! I bought fresh spinach and used half the amount. Would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missiej"
},
"reviewBody": "I followed the recipe except I added fresh spinach,YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "heiseygrove"
},
"reviewBody": "Fennel seed is overpowering. i would change the amount to at least 1/2 what this recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rfarmer098"
},
"reviewBody": "Very good recipe. My family loved it. Although I did change a few things. I left out the fennel and added some browned italian sausage. It was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sumchelle"
},
"reviewBody": "Yum! A little time consuming / labor intensive, but then again so is manicotti or any other \"stuffed\" dish... I halved this, and didn't measure a thing. Added in sausage, and spiced it to my liking with fennel and Penzey's Italian Herb. The shell noodles were a real kid-pleaser! (And, totally distracted them from the fact spinach is in it!!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherri Rochester"
},
"reviewBody": "My boyfriend loved this. He is a dedicated pasta lover. I thought it was a little too mushy. Maybe I filled them too much. I did love the flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin411s"
},
"reviewBody": "Everyone Loved this recipie!! I'll definately make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Krissi"
},
"reviewBody": "I modified this recipe based on the reviews and made each half differently to experiment with tastes. One egg and one cup of mozzarella were added to the filling. One half had spinach and fennel seeds (measurements cut to fit recipe)and one half without. I did not like the addition of fennel seeds as their hardness and abundant flavor don't seem to mix well with the dish. However, that is only personal preference. Otherwise, the dish is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri"
},
"reviewBody": "My family enjoyed this recipe. I followed some other advice and reduced the spinach to 1 pkg., added 1/4 lb. hot sausage, and 1 cup of mozzarella in place of one cup of the parm. Thanks for sharing."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16663/spinach-and-cheese-stuffed-pasta-shells/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16663/spinach-and-cheese-stuffed-pasta-shells/",
"name": "Spinach and Cheese Stuffed Pasta Shells"
}
}
]
}
}
, "about": [
]
}
]