				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spinach Tortellini Soup"
,"datePublished": "2000-01-29T14:19:58.000-05:00"
,"dateModified": "2022-11-14T06:21:04.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Nicole"
,"url": "https://www.allrecipes.com/cook/24327079"
}
]
,"description": "This spinach tortellini soup is super quick and easy to make by combining frozen spinach and packaged cheese tortellini in a garlicky chicken broth."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/-ug0oCtqPS0bjIS4FZMuC8H0IpM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7309254-ac88c891b1ab42388bd32cdcb8bfe970.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spinach Tortellini Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "295"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "224 kcal"
,"carbohydrateContent": "33 g"
,"cholesterolContent": "28 mg"
,"fiberContent": "4 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "294 mg"
,"sugarContent": "2 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT5M"
,"recipeIngredient": [
"2 (14.5 ounce) cans chicken broth",
"1 (10 ounce) package frozen chopped spinach",
"1 (9 ounce) package cheese tortellini",
"0.25 tablespoon dried basil",
"0.25 tablespoon garlic powder",
"salt and pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine chicken broth and spinach in a large pot over high heat; bring to a boil."
} ,{
"@type": "HowToStep"
,"text": "Reduce heat to medium-low and stir in tortellini; cook uncovered, stirring occasionally, until the tortellini float to the top and the filling is hot, about 3 to 5 minutes. Season with basil, garlic powder, salt, and pepper."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT15M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "It was 96 degrees out today but this looked soooo good I had to make it. Delicious and looked so fancy. I did add shredded carrots for color and doubled the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LBrooks"
},
"reviewBody": "Great easy, basic recipe! Couldn’t find chicken broth (thanks Covid-19!) so I used mushroom broth. Added a can of diced tomatoes with Italian seasoning, so didn’t have to use the additional spices. I’ll be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindyr697"
},
"reviewBody": "This was excellent! I made a few changes as follows: 8 cups broth, added 1 lb mild Italian sausage which I sautéd w/onions, carrots and zucchini. Also added 4 garlic cloves and dash cayenne pepper, 10 oz frozen spinach added with a 19 oz frozen cheese tortellini at end. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "This soup was very easy to make and really delicious. My family loved it. I will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjb3655"
},
"reviewBody": "I liked this and have made it several times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L Dillard"
},
"reviewBody": "Very simple and tasty. I liked that there was not many ingredients. Very flavorful.I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia Conway Crocker"
},
"reviewBody": "Delicious and a quick warming meal on a winter Friday night! I added shredded carrots and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Crumpton"
},
"reviewBody": "I have made this several times! It is the best!! Try it you will love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsilkrx"
},
"reviewBody": "Delicious, and very quick and easy to make. I cooked the tortellini separately and added them at serving time to avoid them being over cooked, but otherwise a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hariet Brown"
},
"reviewBody": "Our local rotary club chapter had a call out for locals to submit the best soup recipe that can feed 10 people for under $10. Thanks to Alfred, our Sons’ younger friend who works for the local grocery outlet, we were able to get a great discount on nearly expired broths. Needless to say, we were able to make it work for the competition and the Rotary members loved this soup! One sour gentleman wasn’t keen on the Italian flare of the dish, rude! Sadly, the “potato wedge casserole soup”, got voted best of the bunch. We’ll still be serving this for our friends and family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rhonda Bromley"
},
"reviewBody": "Disliked this recipe. The soup did not look anything like the pretty picture. The frozen spinach fell apart in the broth and the soup looked like green slop. Every spoon full was saturated with spinach, which is all I could taste. I used the exact amount I was supposed to use. Not sure what went wrong here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Enrique Piñero"
},
"reviewBody": "Fast and easy meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daveburkevt"
},
"reviewBody": "This is a great guide for making a delicious soup. I kept the tortellini separate and poured the soup over them at serving time. Also added parmesan at serving. As for the base, started with 1/2 lb of ground pork. (Could have used a pound.) Then removed and sauteed garlic and red onion. Added red pepper and grated carrots. A can of stewed tomatoes followed by the chicken broth. Didn't have lemon pepper so added squeezed lemon and additional pepper. Added fresh chopped spinach about the time I started the tortellini. For those who said it was bland, it's our job to taste as we go, since it depends on how much broth is added and other particulars. Used a seasoned salt along with a bit of ground jalapeno and the basil. Really one of the most delicious soups I ever made. Thanks, Nicole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Baggett"
},
"reviewBody": "Super easy. Made with chicken broth and it was delicious. I will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aynsley"
},
"reviewBody": "Delicious and easy! Added some carrots as well and it was perfect. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lex"
},
"reviewBody": "I always rate a recipe based on making it specifically by the instructions. That being said, this was very bland and lacking. However, I will make it again and use some of the other user's suggestions: add carrots, onion, and lots more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Rickrode"
},
"reviewBody": "I made no changes and loved it will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "chuck14_16"
},
"reviewBody": "Measurements didn’t make sense. Way too much spinach! And not enough broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Delgado"
},
"reviewBody": "I originally made this because I had everything on hand but if I were to make it again I'd try with fresh spinach or just leave spinach out altogether. The frozen spinach made it kinda bitter and we had a ton of leftovers that nobody ate. I'll try it again but with the changes I mentioned."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Tapp"
},
"reviewBody": "I liked this recipe quite a lot. I added shredded chicken, mushrooms, a little oregano, parsley, and a pinch of cayenne pepper to the recipe, though. I also use fresh baby spinach instead of the frozen spinach. I use the water I boil the chicken in as the base of the soup and add the store bought chicken broth to that. It has become a regular staple in my household and is my favorite soup to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia G."
},
"reviewBody": "So delicious!!! Thanks Nicole!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri Scott"
},
"reviewBody": "Made the following changes- melted 2 T. coconut oil (didn't have any olive) added 1 chopped onion, 6 sliced cloves of fresh garlic, 1/2 pound fresh sliced Portobello mushrooms, and 2 thinly sliced carrots, salt and pepper. Sauteed about 5 minutes, added 1 slivered basil leaf, 1 chopped fresh tomato, and 2 quarts home made chicken stock. Simmered for about 20 minutes. I boiled the frozen cheese tortellini in a separate pan for 3 minutes then drained. I put fresh spinach in the bottom of a bowl with a scoop of tortellini on top then put a few cups of broth with vegetables on top of that. Top with fresh shredded parmesan......SO Delicious!! For leftovers, I also kept the broth, tortellini and spinach separate- to be put together when ready to eat. It might also be good with a splash of white wine it, maybe some chicken or Italian sausage, etc.....Great as a base for whatever you might like in it! (I chose to keep it meatless though)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "MAGNIFICENT!!! This is definitely one of the best tasting soups ever! I added some onion and celery as I usually do when making soup as well as paprika. But when reaching for the paprika I accidentally grab the Hot Mexican Style Red Pepper and practically poured it, as I usually do with paprika, into the soup. Thought it was ruined but it was fabulous and really wasn't hot at all. I will most definitely make again and again! Thank you so much for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Carroll Young"
},
"reviewBody": "This is delicious and easy!!! I'm a vegetarian so I used vegetable stock and added some cannelloni beans. Great flavors ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Andrejcak"
},
"reviewBody": "We really enjoyed this soup. It was quick, easy, and delicious. The kids loved it and wanted seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Wilson"
},
"reviewBody": "I used fresh spinach because I had a bunch in my fridge to use up. Probably my new favourite soup. Will definitely make this regularly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lcji"
},
"reviewBody": "Love this recipe! I even got my parents and in laws making it! I don't even like spinach so I used less and I gobbled it all up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Busy Lady"
},
"reviewBody": "Very good on a cold rainy night. I sautéed onions, celery and grated carrots in with some garlic. Then added the chicken broth, salt and pepper and lots of flakes of dried basil. Next time add a full teaspoon of minced garlic instead of 1/2 a teaspoon. Served with fresh baked bread. Hubby really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef V"
},
"reviewBody": "This was good. I used 1 tablespoon of basil pesto instead of the basil. A nice change from a regular soup I would make. I also sautéed a sweet onion and 3 cloves of garlic before adding the broth... I really feel that this soup needs that extra 5 minute step."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kittyboy"
},
"reviewBody": "Simple and tasty. I took advice from other reviewers and sauteed chopped onions, garlic, and basil first. Then added vegetable broth, spinach and grated carrots (for color and texture). I added the pasta at the very end and just let it simmer in the broth for about 5 minutes. Very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cara Johnston"
},
"reviewBody": "I'm glad I tried this recipe because it was new and different! First I saluted a bag of Pictsweet Seasoning Blend (10 oz pkg) in some olive oil for about 5 mins. I then added a couple cloves of garlic and a handful of shredded carrots and cooked a few minutes more. I seasoned with lemon pepper, black pepper, salt, and fresh basil. I then added my chicken stock and spinach. I brought to a boil and then simmered on low for 20 minutes. I cooked my pasta separately and added them to my soup before serving, as other reviewers suggested. Great flavor. Great color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dina"
},
"reviewBody": "Excellent soup. And so very easy. We all love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gert MacPhail"
},
"reviewBody": "Used spinach cheese tortellini. Great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DECAR48"
},
"reviewBody": "I made exactly as stated. Easy, yummy! Will become a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gary Weigner"
},
"reviewBody": "Very good very simple. But I made a few Adjustments.I sauté shiitake mushroom, red onion moist garlic little bit of butter . Threw in some celery. Used fresh basil and fresh spinach. Delicious!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "easy. simple. and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Casey Grissom Anderson"
},
"reviewBody": "Loved it. Just added some meat(sausage)for the hubby."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eve"
},
"reviewBody": "Loved it, made a few adjustments , added more stock as I found the spinach too much. It was easy and will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb C"
},
"reviewBody": "This is simple and tasty, perfect for your homemade chicken broth. I added more tortellini than instructed which worked for us. Best served topped with freshly grated parmesan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maryann"
},
"reviewBody": "Really simple and delicious. I tweaked it a bit, adding some broth from a roasted chicken, along with about 1 c. cooked chicken, fresh spinach, garlic, celery and onion, as well as 1 c. skim milk whisked with 1/3 c. flour to thicken the broth just at the end. It's wonderful! Enjoying it right now. Perfect weeknight meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Lia"
},
"reviewBody": "Good recipe. WAY too much spinach. I'm a spinach lover and I thought it was too much. Next time I'll use half of what's suggested. I added minced garlic and some carrots because I already had them. The flavor was great and it was very quick and easy. Great weeknight dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Carroll"
},
"reviewBody": "I have made this soup many times and have not changed a thing. It is incredibly easy and delicious. I don't know why everyone has to feel the need to change recipes. The only thing i do is sprinkle with parmesan cheese each serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wilmany64"
},
"reviewBody": "I read other reviews and made adjustments. It came out really god and husband loved it! I put olive oil in pot and added crushed garlic cloves, sauteed and then added chopped spinach. I boiled tortellini separate and then added to broth and let it simmer. I served with olive oil garlic toast. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTGerl112"
},
"reviewBody": "I made this soup as is, except I added Johnsonville chicken Italian sausage. It was very good and very healthy!! Other reviews said not to cook the tortellini in the soup because it makes it thick but I did not have that experience. I think that if you boil the tortellini in the broth for only about 5-7 minutes, it has the perfect consistency and it still cooks in the broth after you take it off of the heat. Very good, will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GhostLover"
},
"reviewBody": "This was perfect! The only thing I changed was, I used vegetable broth instead because I'm a vegetarian. Anyway it was an astonishing dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky O'Neal"
},
"reviewBody": "I made it as the recipe. Was wonderful. My mother who doesn't like any soup I make love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TMAYDER"
},
"reviewBody": "Very good basic recipe. I will use less spinach next time, but will add a few extra veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "flower80"
},
"reviewBody": "This was really good! But helpful hint, only cook the amount of tortellini you are going to eat right away. I put leftovers in the fridge and the pasta soaked up all the liquid and got really mushy. Next time I will just cook one serving of pasta, and then put the broth on the fridge and just cook the next serving in it when I heat it up again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twiggy"
},
"reviewBody": "Very good! I added a can of white beans and used half the amount of tortellini. Very simple and quick recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "corinne doherty"
},
"reviewBody": "i really used this recipe as a base. i started with a large frozen chicken breast in a crock pot with 2 cups of water, 2 chicken bouillon cubes, garlic, celery salt, and the basil on high for 6 hours in order to create the broth called for in the recipe, then just left the chicken in the soup for bulk. added fresh chopped spinach, fresh chopped basil, a few baby carrots, one roma tomato chopped, and 20 oz. tortellini with 2 extra cups hot water for another 1/2 hour. added salt. it was delicious, and no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaraAnne"
},
"reviewBody": "Quick, easy and delicious! Will make again. I added rough-chopped carrots for color. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenMuth"
},
"reviewBody": "i tweeked this recipe.... a lot actually..i'm big on spices when i cook so i added little bit of this and a little of that.. i took 4 frozen chicken breast (comes in a bag) and boiled them (in water) with bay leaves, thyme, steak seasoning, garlic powder and tatefully simple dried tomato and pesto seasoning... added celery (previous recommendation) and dehydrated onions back to he broth with 2 cans of carrots (out of fresh) (previous recommendation) , 1 1/2 can of corn (had 1/2 can left over from hushpuppies)(previous recommendation, italian tomatoes (previous recommendation) and 16oz of frozen spinach. i did boil the pasta and added to the soup before served. oh..i did use a box of chicken broth.. ;) enjoy.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATHYSH2000"
},
"reviewBody": "Wonderful soup!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TamLou"
},
"reviewBody": "I was disappointed in this recipe as written. If I were to make it again I would make several changes to make it taste better.\nMy hubby liked it though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BEVERLEY3"
},
"reviewBody": "I made this soup exactly as stated but since there was about 1/4 cup more broth in the carton I used it all. It was very tasty but don't know how you could call it soup. There was no liquid left by the time the tortellini cooked so served in on a plate as a pasta dish"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harmonica"
},
"reviewBody": "I probably doubled the amount of broth this was supposed to have but otherwise I made it as written. I used fresh basil instead. It was fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COBANNERO"
},
"reviewBody": "Loved it for several reasons. It's quick, easy &amp; my family loved it. Even my 4 year old ate the spinach (Little Miss anti-vegetables).\nI did the sauteing the onions &amp; garlic thing and added my home made chicken stock, then added barely a pinch of lemon/pepper frorm Mrs. Dash. My 7 year old declared it better than my home-made chicken soup (that's really big coming from her).\nThanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ernie Rohan"
},
"reviewBody": "this was definitely quick &amp; easy. i read through the reviews first to see what people suggested. when it came time to making it, i didnt really follow a recipe - just kind of went with it. waaaaay too much spinach for my liking, i ended up removing about a quater of it. i had no fresh veggies on hand, so i added a can of diced tomatoes - i thought it added great flavor. i just seasoned it with s&amp;p, garlic, and basil to taste. i also added some red pepper flakes to give it a kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Sue Morris"
},
"reviewBody": "awsome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OHWEEZY"
},
"reviewBody": "Good soup! I added carrots for color."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elaine"
},
"reviewBody": "So I did this recipe and added carrots and a onion like someone mentioned. Problem was that my store bought stock wasnt very flavorful. This posed a real problem. I ended up adding salt but nothing helped, until I added a dash of soy sauce and the ahhhh...much better. Anyway, I did not add too much soy sauce until it tasted like soy sauce I just added a little and it really livened up the stock. I would do this recipe again but this time with the changes I suggested and a different brand of tortellini"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "This was really good. I used fresh spinach and homemade chicken broth. The addition of the cheese tortellini was excellent as it was a nice change to just plain pasta. thanks for this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ridgebacklover"
},
"reviewBody": "This was very good. We cooked the tortellini separate, as some had suggested, and added it about 5-10 minutes before serving. We also used fresh spinach vs. frozen, and added some thinly sliced carrot for color and flavor. Very tasty and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katy barnes"
},
"reviewBody": "Super easy to make! I did put extra broth in though because I like it a little more liquid-y"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "honeypie4321"
},
"reviewBody": "Good soup! Followed the recipe exactly, except sauted some ginger and onion in the beginning. Might add some ground sausage to it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CINDYLOUWHO2"
},
"reviewBody": "so good! I took other's advice and sauteed onions and garlic before adding broth. Also added carrots and fresh spinach, and kept the tortellini separate until time to serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missjones"
},
"reviewBody": "I make this with chicken tortellini. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alayna B"
},
"reviewBody": "This is a great base recipe...I made with the following additions: 1) browned 1 lb. sausage with some garlic 2) Drained and added 4 cups chicken broth and 1/4 cup white wine 3) Added 4 carrots sliced into coins 4) Added an entire bag of fresh spinach leaves 4) Added grated Parmesan cheese 5) Also, I boiled the tortellini separately and added right before serving"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doraluz"
},
"reviewBody": "This was a great soup, i didnt have basil so i used oregano instead, and also some ground italian herbs and seasoning, as well as red pepper flakes to add a bit of spice, then i squeezed some lemon juice in and tossed julienned carrots in. It was delish, oh and i used spinach tortellini with cheese filling and fresh spinach instead of frozen ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "proverbs31girl"
},
"reviewBody": "This is a very good meal BUT we used fresh spinach instead and the dry tortellini....which was much more delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lydia Bragg"
},
"reviewBody": "Delicious! I feel a little guilty not making this exactly as advertised...but I cooked the tortellini separate, baked up some chicken breasts (later diced prior to adding to the soup, and added a few diced carrots and mushrooms. I did not have any frozen spinach on hand, so I chopped up some fresh leaves. A few readers mentioned adding lemon pepper, but I thought the lemon was a little too strong. Overall, a nice soup with lots of add-ins possible (as evidenced by all of us that can't follow the original recipe on try one!) :P"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary C."
},
"reviewBody": "I made this soup over the weekend, and it was delicious! I tweaked it a little - I added maybe half the spinach (which was plenty), 4 cans of broth, twice the tortellini, some onion powder, sliced carrots (which I boiled separately as they tend to overpower with flavor) and cooked, sliced sweet Italian sausage. I'll be making this one often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "TENNISMOM"
},
"reviewBody": "Not much to brag about here. Tastless is how I sum this up. Possibly the addition of stewed tomatoes would liven this up a bit. I will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily"
},
"reviewBody": "good recipe, I added a can of petite diced tomatoes with the juice, gave the chicken broth a new flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ronnie R. Johnson"
},
"reviewBody": "a fast solution for a quick and easy meal to prepare and very tasty too. I love this soup and you will too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "like the others i sauteed onion and garlic. added mushrooms and carrots and since i didn't have chicken stock in the house used beef stock. i think the beef stock aided the mushrooms because it was FULL of flavor. really delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dottie Lorenz Paton"
},
"reviewBody": "I hate it when people do this - but here I am . It's 5 stars BUT I added a can of fire roasted tomatoes, slivered carrots and sweet Italian sausage. Plus I sauteed onions in garlic and olive oil. I destroyed the original recipe - but ohmygoodness - THE BEST SOUP EVER! Cook the pasta separately!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christin Yuppa"
},
"reviewBody": "I sauteed 1/2 chopped onion and 2 tsp minced garlic in 1 Tbsp. butter. Next, I added about 7-8 cups chicken broth, 1 can of diced tomatoes (drained) and 1 package of frozen spinach. I also added a (frozen) cube of fresh basil. I brought that to a boil and then added a 19 oz. package of frozen cheese tortellini. I let it boil for about 5 minutes, until the tortellini was ready. Served with garlic bread. Hubby and I both LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "McBacon"
},
"reviewBody": "Very good! My family enjoyed this. I am adding more tortellini, a little less spinach and more broth next time because my kids ate all the pasta :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "klhodges27"
},
"reviewBody": "This was A-M-A-Z-I-N-G!!! It is a rare occassion when I can get my son to eat all of his dinner! Especially when there is something green added to the mix! He loved it! I changed very little from the original recipe. I used fresh Kale (which I love!) instead of spinach. I already had it. I added cooked onion and celery and an extra can of chicken stock... a little bit of white wine (not sure how much I just know I was about out and I used what was left). Added the garlic powder and basil like it said. I did add some garlic salt too. I cooked some bacon and sprinkled it on the top at the end with parmasan cheese and it was fantastic! LOVE THIS! I am cooking it again tomorrow night for a big Christmas get together with my husbands family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Louise"
},
"reviewBody": "This soup was amazing, and my fussy family never eats soup, well they did this time! It is delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl in VA"
},
"reviewBody": "I think this is a very quick, easy, and delicious soup. It was a hit with my spouse, as well as our teenage daugther!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KJR"
},
"reviewBody": "good, easy and lots of options to use what you have in the fridge. thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Douglas"
},
"reviewBody": "This was definitely one of the easiest soups I've ever made and one of ~ if not THE~ best I've ever had. My family rated this a definte \"do again\". The only changes I made were to use some roasted garlic I had and I added some low fat sausage. This is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Avid Gardener"
},
"reviewBody": "Couldn't wait to rate this - WONDERFUL! Made a few adjustments based on previous comments - sauteed 2 cloves garlic, about 1/2 onion and portobello mushroom cap in little butter first, then added rest of ingredients. Used fresh spinach cause I wanted to and used frozen tortellini that I cooked in the broth. Was intending to use leftovers for lunch, but my husband ate it all last night! Sprinkled with parm. cheese. Might make again this week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof2girls"
},
"reviewBody": "I made this recipe using garlic flavored chicken broth. I also used a bit of garlic salt (not to much) garlic powder, onion powder and some cheese. It was a great quick meal. Delicious!!!! (I also used fresh garlic ) we love garlic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookingMonster"
},
"reviewBody": "I used fresh garlic and added garlic with a touch of cayenne pepper. It was beyond fantastic and incredibly easy. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lora"
},
"reviewBody": "tasty, quick &amp; simple! added some coined baby carrots for color; will try sauteing some onion &amp; mushrooms with minced garlic next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon ssf"
},
"reviewBody": "I like this a lot. (A great base for cleaning out the refrigerator of leftover vegis too.) Very satisfying.. don't forget the parm at the end. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nolava"
},
"reviewBody": "Excellent soup and easy to make. I've served this to my small kids and they love it. I've used fresh spinach and frozen (both work). I've added a little oregano and nutmeg, giving it a little zing. All in all, makes a great lunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gia"
},
"reviewBody": "I used vegan tortellini, vegetable broth, I also added a ton of fresh veggies.. mmmm soooo good.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lsims5523"
},
"reviewBody": "Super yummy soup! I've used a similar recipe that starts off with sauteing chopped bacon and chopped onion (start the bacon first) , then adding a can of diced or crushed tomatoes and a can of drained kidney beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Long"
},
"reviewBody": "This was our first time making this recipe and we loved it. Things we wanted to add: *2 stalks of celery *Fresh spinach *2 roma tomatoes * 2 cups of tomato sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Instead of garlic powder, I used 4 cloves of garlic, minced and sauteed it with 1/2 a small onion. I added salt and pepper while the onions were softening up. Instead of frozen spinach, I used 3 giant handfuls of fresh spinach, chopped up, plus one can of diced tomatoes and a pinch of crushed red pepper. I cooked the tortellini separately and added them to the bowls as I was ready to serve. So good! There are a lot of spinach tortellini soup recipes out there and they all follow about the same outline. Definitely add tomatoes. Thanks for the great base!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee Land Moore"
},
"reviewBody": "I made this with a 12 oz bag of spinach tortellini and a 3rd can of low-sodium chicken broth and used fresh spinach that i had on hand (not nearly as much as the recipe called for). I squeezed the juice from several lemon slices after reading a review which stated lemon pepper was 'the missing ingredient'. I sprinkled some minced dried onion instead of using fresh onion like some suggested. This was a huge hit with my hubby, but my 2 year-old wasn't that thrilled. I will most likely be making this again as I often keep tortellini on hand!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chicorpio"
},
"reviewBody": "Delicious! I added fresh spinach instead of frozen and added carrots, celery, can of diced tomatoes, and diced cooked chicken. I also recommend cooking the tortellini separate. My fiance and I loved it! Definite repeat recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hummel97"
},
"reviewBody": "Great soup. I used fresh spinach and added some chopped carrots, onions and some sauteed mushrooms I had in the fridge. A real hearty soup and quick to make, which I just love. Quick, easy and soooo good. Thanks, Nicole for anotherkeeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Belaire"
},
"reviewBody": "I'm all for easy and quick! I usually a \"add a little bit of this and that\" kind of cook. It's rare that I don't switch stuff up with a recipe, but honestly -- this recipe is perfect as is! (I'm SERIOUS!) My kids even love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i love this soup! it is great for entertaining (super cheep). i add a can of Italian seasoned crushed tomatoes, a pinch of red pepper flakes and sprinkle some Parmesan cheese right before eating. also, i like to use dried tortellini (barllia makes amazing tortellini with spinach) so i add an extra cup of broth (and i use vegetable broth to make the dish vegetarian friendly)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16332/spinach-tortellini-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14736/soups-stews-and-chili/soup/vegetable-soup/spinach-soup/",
"name": "Spinach Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16332/spinach-tortellini-soup/",
"name": "Spinach Tortellini Soup"
}
}
]
}
}
, "about": [
]
}
]