				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Split Pea Soup"
,"datePublished": "1999-08-07T16:51:14.000-04:00"
,"dateModified": "2022-11-03T10:53:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Sandra"
,"url": "https://www.allrecipes.com/cook/5603040"
}
]
,"description": "This hearty split pea soup recipe features potatoes, carrots, celery, marjoram, and chunks of ham; perfect nourishment on a cold and blustery day!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8JTErB4eGgJU0RnpbksGgH7ClgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Split-Pea-Soup-Maggie-Stryjewska-Kara-2afe02a1fb5942a4a4ac5d5582acfba6.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2575604268001",
"description": "See how to make hearty split pea soup from scratch.",
"duration": "PT2M38S",
"name": "Split Pea Soup",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/61bf85ea-ad28-4d6f-8a98-de3eb61f3366/759c1886-c9f0-485b-8994-c3345ca337d9/1280x720/match/image.jpg",
"uploadDate": "2021-03-08T22:46:01.471-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Split Pea Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1396"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "310 kcal"
,"carbohydrateContent": "58 g"
,"fiberContent": "22 g"
,"proteinContent": "20 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "255 mg"
,"sugarContent": "10 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2.25 cups dried split peas",
"2 quarts cold water, plus more as needed",
"1.5 pounds ham bone",
"2 onions, thinly sliced",
"0.5 teaspoon salt",
"0.25 teaspoon ground black pepper",
"1 pinch dried marjoram",
"3 stalks celery, chopped",
"3 carrots, chopped",
"1 potato, diced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place peas in a large stockpot and cover with several inches of cold water; let soak, 8 hours to overnight. Drain, rinse, and return peas to the pot."
} ,{
"@type": "HowToStep"
,"text": "Add 2 quarts of cold water, ham bone, onion, salt, pepper, and marjoram to the stockpot. Cover, bring to a boil, and simmer for 1 1/2 hours, stirring occasionally."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/8JTErB4eGgJU0RnpbksGgH7ClgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Split-Pea-Soup-Maggie-Stryjewska-Kara-2afe02a1fb5942a4a4ac5d5582acfba6.jpg"
}
]
,"text": "Remove ham bone; cut off meat, dice, and return meat to soup. Add celery, carrots, and potatoes. Cook slowly, uncovered, until vegetables are tender, about 30 to 40 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT615M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Annmarie"
},
"reviewBody": "I started out with making this recipe, but quickly realized that I didn't have all the ingredients! I only had one bag of split peas, no marjoram, no onions so I improvised, and adjusted the entire recipe. I rinsed the peas and soaked them overnight, and rinsed them again in the morning. I added the peas back in the pot with 2 boxes of reduced sodium chicken broth, dried onions, pepper, a small ham bone, and garlic powder and boiled it all for about 5 minutes on high and then brought it down to the simmer for 1 hour 30 minutes. I cut up the celery, carrots, and all of the ham steak I had on hand. I added the celery, ham, and carrots to the soup along with more pepper and garlic; and boiled the soup for another 37 minutes. I stirred the soup throughout the entire process and tasted. So good!!! Only gave it a 3 star rating because I didn't make it exactly as written...and it was amazing!!! Thank you for the starter recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "britchef"
},
"reviewBody": "Has made split pea soup many times with many different recipes this was one of the best. Used half chicken stock and half vegetable stock instead of just water. Did not use potatoes, adjusted the seasonings to taste"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pierre"
},
"reviewBody": "The recipe was easy to follow. I added soda in the soaking water 1 teaspoon. I used salted porc instead of ham bones. Worked out well. Very tasty recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SassyDad"
},
"reviewBody": "I've always omitted the pre-soak of peas. Yes, commits to 2 hrs of time, but I personally see as building the best flavor profile. Looking for people's different varieties. The vegetables and seasons are unlimited. Will gently season cut veggies used. I traditionally hold back on added salt. Ham hocks and shanks do very well. If desire is to use store bought broth, go 50/50 with water. Taste test halfway into cook, if needs a boost, go easy with seasoned bases. The batch I started today is a 2 step method. Yesterday had lots of onions and carrots from a pantry. Cleaned and rough chopped. Seasoned well with my salt free mildly spiced house seasoning and Tajin Mexican. Pressure cooked for 25 mins, twice, in 2 batches, to gauge the cook of carrots. Then pureed well with hand stick blender hot. Cooled properly and used it today. I always start my recipe on medium heat until gentle boil, then reduce to simmer. Stir every 10 or 15 mins. Today is: 7 cups of water, 2 bay leaves, and leftover frozen ham, around a cup, from a cooked ham shank. (I have rope sausage, Polska Kielbasa, ready and waiting. Chose that for it to enhance the Mexican spices.) No added salt yet. - The ham and seasoned puree will determine later-. Taste tested by dipping clean spoon after 45 mins. Close, but no need for salt. Will cut up the sausage near end. I cut mine down the length, then cut into chunks. At the 75 mins., I cut up the kielbasa and stirred in. After comes back to simmer, cook additional 15 minutes. This batch I will cool and enjoy tomorrow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TmoT"
},
"reviewBody": "Good 'starter' recipe but too bland for me. I used Chicken Stock instead of water and added 5 tbls of 505 Hatch Green Chilis from Costco and it brought it to life nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Brooks"
},
"reviewBody": "The soup was nice, thick, and delicious. The recipe was easy to follow and not difficult to make at all. My husband loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meowzer31"
},
"reviewBody": "Delicious, very filling, and couldn't be easier. I made following modifications: 1. Did not use ham bone; replaced water with chicken broth 2. Used 2 pounds peeled and sliced carrots 3. Added two large cloves garlic 4. 1 pound chopped ham I prepared in a slow-cooker. Garlic, peas, potato, and chicken broth cooked on high 3 hours, then pureed with an immersion blender. All other ingredients added and cooked on medium 4 hours. Check the softness of the carrots at three hours and turn to high if not softening quickly enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As another reviewer has noted: you do not need to soak the peas prior to using. Rinse them and go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I also used this recipe as a guide for a slow cooker version with a Ham bone. Added three minced cloves of Garlic, 1 rib of celery diced, 1/2 a large shallot with half a Vidalia onion, chopped parsley, ground, smoked black pepper (no salt), and I used 2lbs of peas and two quarts of low salt chicken stock, plus about 2 cups of water to start. Once cooked, I added last nights oven roasted carrots cut on a bias (they were roasted with butter and fresh dill), generous 2 cups of diced ham, and Wow...I didn't use potatoes, but I was wondering if anyone has ever used a sweet potato in this recipe???? Recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary A"
},
"reviewBody": "You don't need to soak peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annabama"
},
"reviewBody": "Was a bit concerned when I saw some reviews saying they had added stock, or that they hadn’t and it was bland. Well, I trusted the fact there were so many reviews and didn’t add anything and this was SO TASTY! The ham and vegetables add enough flavour on their own. I didn’t soak the peas as I didn’t leave myself time, but given they are cooking for 90 mins it’s plenty. I also couldn’t get bone in ham but it was still plenty tasty without bone. Recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used dried oregano (didn't have marjoram) and, since the price of ham bone in NYC is obscene, I boiled the split peas In 1/2 lb of kielbasa sausage and 3 1/2 cups of chicken bone broth which I prepare over 2 days and always keep in the freezer. Then added the rest of recommended water using the one the rinsed peas had been brought to a brief boil in (did not have 8 h for soaking). For extra taste, I sautéed carrots and celery in butter and olive oil with garlic and onions before adding to the soup. Tastes very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "I was intimidated to make this recipe. I have never cooked with a ham bone before and my mom holds the title of making the BEST Split Pea Soup. But after making a ham for Thanksgiving and so many leftovers! I said this was the year!! Followed EXACTLY except there was not enough ham on the bone - so I used my chopped leftovers in addition to the meat stripped from the bone. I also used the “quick method” for preparing my dried peas. Wow! A darn close second to my moms….and maybe the only difference is because I made it and not her!! Winner!! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! Added radishes in place of potatoes and it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So hearty and satisfying. Not the exact ingredients I remember from my childhood, but nostalgia was still present. No changes necessary. Altho' he expected not to, my 12yo grandson gobbled it up! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Well explained recipe, and delicious! Like the site too; straightforward, not a lot of commercial dreck, ability to customize quantity, and nutritional info. Will be back. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tulip"
},
"reviewBody": "This is not my usual recipe but I couldn't find the other one. It was really very good. I made some necessary changes: diced the onions, used cut up pre-cooked ham, Hampeas (which included a flavor packet), used 2 cans of chicken broth along with the water and eliminated the potato and marjoram because I didn't have them. My pot wasn't big enough for all the water, so it was thick, but I added water when I reheated. It was nice and creamy! I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keebdaisy"
},
"reviewBody": "Loved it! Cooked it with my granddaughter and it was a huge success. We even made it later again in the year when she was with me again. Kept right with the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved it didn't make any changes. The best split pea soup I ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Granny Lin"
},
"reviewBody": "Deliscious! I couldn't find a ham bone, so just used some chopped up cooked ham. Before serving, I mashed it well with a potato masher."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Burr"
},
"reviewBody": "This really is the best recipe for pea soup that I’ve ever tried! No food mill either! I am less precise with the vegetables and water amounts. I usually use a ham bone, but last time that I wanted to make it, I didn’t have one. I decided to use a large slab of smoked ham instead and it turned out just as good as with the bone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I really only have a few words. Just make it and eat it and enjoy it. My kids loved it as did the rest of the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "candysmom"
},
"reviewBody": "I always make the recipe exactly as printed, the first time. Second time, I tweak it to my liking. I omitted the potato and grated the carrot; also added one chicken flavor cube. Our kids always liked buttered toast, cut into strips rather than crackers...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redsnana"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisbeth"
},
"reviewBody": "Even before putting in the carrots and celery, so tasty! It’s plenty thick without a potato also (didn’t have one on hand.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dancer"
},
"reviewBody": "I added more carrots. I used a mandolin for quicker slicing. Afterwards, I distributed to my family and friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kathyp"
},
"reviewBody": "I don't like peas but my husband loves split pea &amp; ham soup. So I made it today after Easter dinner and he said it was delicious, and he never gives compliments. I followed the directions and will definitely make foe him again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So good! A great winter meal. I didn't have a ham bone so used pork rashers, it worked beautifully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "added a bit more water to the quick soak of the split peas. It was great the first night but perfect the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahrebekahj"
},
"reviewBody": "Delicious! Made this in the slow cooker for 6 hours, threw in my favorite seasonings, used bacon as it was what I had on hand and ran the immersion blender through to smooth the consistency…it came out awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! Wanna try this one. Thanks for sharing. Would like to share this too, Panlasang Makabayan food restaurant with a twist! Get your Pinoy food favorites and freshly baked bread only here at Ka Tunying's Cafe and Restaurant!\" https://katunyings.com/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elisequi"
},
"reviewBody": "Loved this recipe. Did the quick soak method. Added some aromatics while the peas were simmering with the ham; 1 1/2 tsp granulated garlic, 1 1/2 tsp granulated onion, 2 bay leaves, a big carrot, celery leaves from the center of a bunch, and a small bunch of frozen parsley stems (I keep them in the freezer from other recipes using fresh parsley). Once the peas were falling apart and the carrot was soft I puréed everything with an immersion blender. I threw the bone back in with the chopped vegetables to get a bit more flavor out. Husband said it was he best split pea soup he’s ever had and I agree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Scott"
},
"reviewBody": "Pretty good for the first time making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "orliv96"
},
"reviewBody": "My family loved it!! Tastes just like our Oma ( Grandma) used to make!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Les Hart-Kidd"
},
"reviewBody": "It was good, and I will make it again. It is a bit bland, as I can’t use onions, so I substitute cabbage for the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Benson"
},
"reviewBody": "Will make it again and again! I did not have a ham bone or ham, so I substituted a boullion cube that was Chicken Herb and Spices and a seasoning packet of ham seasoning. The soup was SO Good! Thank You for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SDELEHANTY"
},
"reviewBody": "Good not great. Definitely needed a flavor boost in the way of garlic, powdered chicken bouillon - or just use chicken stock instead of water . It will thicken up after a day - add chicken stock to get it to the consistency you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly"
},
"reviewBody": "Thanks to all who left reviews to use chicken stock. I combined suggestions. Cooked my ham separately...in the chicken stock, skimmed fat. I did soak the beans, drained them and used the ham/chicken stock to cook the peas/veggies. Turned out perfect. Hearty and flavorful. Thanks to everyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "iyahukdee"
},
"reviewBody": "I followed the recipe but mine tasted ok but next time I will add more split pea to the soup . My daughter made hers and it was absolutely amazingly delicious ! Tell next time I guess . I will know better next time and that's how we learn .\nThanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mzzlty"
},
"reviewBody": "I’m in the middle of making this soup. It sounds delicious, but I used fresh chicken stock as my base and added garlic, thyme and a bay leaf as one of the ladies said previously. Can’t wait to try it. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharitelek"
},
"reviewBody": "This comes as close to my Mama's as I can find on the internet. She used 2 bags of peas and it was rich and thick like this. I love it this way! I love the potatoes as well. She always ripped her ham which I think is better than chunks. I will be making it again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dave Harvey"
},
"reviewBody": "I make this recipe every year with the leftover bone from my Christmas ham. Every time I add the 2 quarts of water to soak the peas overnight, I say to myself \"this doesn't seem like enough liquid\" to make the soup. But It really is. I guess it is because the once dried peas really do add to the total liquid volume as they break down. \n\nI've read several reviews that talk about using chicken stock instead of water. That's fine, but I think I prefer the more pure flavor that comes from the ham and the ham bone cooking for a long time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail"
},
"reviewBody": "left out the potatoes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "boriskarlof"
},
"reviewBody": "I really enjoy this soup. It is easy to make and so versatile. I added a lot of herbs because I wanted the soup taste like my mom's pea soup. She used a ham bone, and I used ham steaks. It tasted the same. My Mom is gone now, but this soup reminds me of her!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary"
},
"reviewBody": "I love this soup. It was thick and hearty. I wasn't keen on all the celery at first but followed the recipe. I did add a bay leaf but can't tell you if it added anything or not. I was filling and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ancestorsalivegenealogy"
},
"reviewBody": "I love this recipe. I made stock with smoked pork neck bones, then added chicken stock to fill the recipe's requirements. I used that meat, red onions, and left out the celery (don't like the cooked consistency). Replaced marjoram with fines herbes, and used the crockpot. It makes up so nicely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dorothy"
},
"reviewBody": "It’s very flavourful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "miagracecole"
},
"reviewBody": "This soup is amazingly delicious! I made some adjustments based on reviewer feedback and what I had in stock. Used chicken broth and add 1 extra cup since many people said it was a thick soup. Sautéed half the onions, carrots and 3 cloves garlic. No celery since I didn’t have it. I crisped up the diced ham and set aside. Blended the soup to silky smooth. The extra cup of broth I used made it the perfect consistency. Then I added the crispy ham. So, so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary G"
},
"reviewBody": "Just like Grandma used to make, but she never soaked the peas; just put it all in the soup pot or slow cooker and let it go till done. I did it in the slow cooker. Great stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pd60"
},
"reviewBody": "This is a great recipe. I’ve made it several times and will make it again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "JoLynn"
},
"reviewBody": "I made this as directed and it was very bland. In order to fix it, I used my hand blender to puree one half of the mixture. Then I added more cubed ham and seasoned salt to taste. If I make this again, I'd use chicken stock instead of water and add more than one potato and more cubed ham and seasoned salt to taste as I did this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JESSICA OKAL"
},
"reviewBody": "This is my all time favorite recipe for split pea soup. I have tried several recipes and I always go back to this one. This recipe also works well in my pressure cooker. I just follow the manufacturer guidelines for the amount of time the soup needs to be cooked for. Depending on the make and model of your pressure cooker there may be an adjustment in the amount of water (or chicken stock) you use. \n\nNote: My personal preference for this recipe is: 1. Simmering my peas for two minutes and letting them sit for 1 hour instead of soaking them in cold water overnight. I found that it gives my soup the perfect consistency. 2. Instead of using just water, I add chicken bouillon (1 tsp per cup) to enhance the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christina_2003"
},
"reviewBody": "Followed Blinkley’s review and added a spin: instead of ham I cooked up bacon and chopped it up. Saved for end.\nChopped up the potatoes, add olive oil and seasoned salt. baked in oven 400 degrees for 20 min. Saved for end. \nAfter the split peas cooked. Blend in blender. The added in the chopped bacon and baked potatoes. Mix. Add salt to taste. Anderson’s needs to watch out! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beavwarius"
},
"reviewBody": "Added green, red , serrano peppers. Cilantro. Roux. Less ham. No potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rogue- Fael"
},
"reviewBody": "I make this every holiday now with left over ham from christmas.. LOVE THIS SOOO MUCH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BayJoe"
},
"reviewBody": "Delicious! Super recipe. I added more water and spices, but this is a super base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanette Malcolm"
},
"reviewBody": "Very easy to make. Hearty and delicious, we will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Fraser"
},
"reviewBody": "Awesome soup, would not change a thing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike K"
},
"reviewBody": "I've made this many times, always delish. I add a couple cloves of garlic. Sometimes replace some water with chicken broth or add bullion. I don't soak or rinse the peas, but let the soup simmer for hours, all afternoon. Makes a delicious thick, hearty soup. One other thing- I cut a lot of the ham from the bone and save it to add after removing the bone for better texture and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "307"
},
"reviewBody": "Thought I hated pea soup...loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis Ann Martinez"
},
"reviewBody": "I made this recipe and the only different thing I did was that I added garlic (I don’t know how to cook with out it! Lol) and added chicken breast to add more protein. Once the soup was done I shredded the chicken! This was a very tasty soup! Loved the thick texture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissusB"
},
"reviewBody": "Turned out fine. I skipped the pre-soak. I used a bone from a spiral-cut ham, and then added 8 ounces of cubed ham. I substituted Bay Leaf for Marjoram. Next time, I might pre-cook the celery some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne St Clair"
},
"reviewBody": "I added some canned corn, some garlic, diced zucchini from my garden.....it’s perfect for a cold stormy dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SandyJean"
},
"reviewBody": "Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheree Vegas"
},
"reviewBody": "Super easy &amp; delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Nordland"
},
"reviewBody": "Very balanced and mild. I used the hambone from New years. I spiced it up with more black pepper and 1 teas of red pepper flakes. I also used Yellow split peas, which I believe to me more appetizing for the eyes. I also added colored red and green peppers with the onions. Great hearty soup on a cold winter night. Served with corn muffins and Romaine salad. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Rourke"
},
"reviewBody": "Very good. The only change I made was using chicken broth instead of water. Hubby loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great recipe! I only added one onion instead of two. I also did not add the potato or carrots. Instead I added a frozen bag of broccoli rice and a frozen bag of cauliflower rice. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jana"
},
"reviewBody": "made this without the potato. Added garlic and a few other spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Chalk"
},
"reviewBody": "I’ve made this recipe several times and it’s always good...but this time I used a leftover spiral ham and the glaze remnants added a touch of sweetness to the soup. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josi B"
},
"reviewBody": "The only split pea soup I make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Burr"
},
"reviewBody": "I made a few changes recommended by a couple of other cooks. Added a chicken boullion cube while cooking - added a bay leaf and garlic. My husband can't eat ham so I used a turkey kiebasa ring and boiled it with the peas. The flavor boiled out o the meat but that was what I wanted. Made the soup very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmtuckerrn"
},
"reviewBody": "Absolutely fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Mcfarlane"
},
"reviewBody": "I made this soup as written. It was delicious. This recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brenda Hill"
},
"reviewBody": "I really liked this soup. I will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "troyinthekitch"
},
"reviewBody": "Crowd pleaser. However added chicken broth in place of some of the water, added granulated garlic, onion salt, oregano and some cayenne pepper to give it a little pop. Also used the expedited method for cooking peas.... who has time to plan a day ahead.?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jula247"
},
"reviewBody": "There is no need to soak split peas. It’s a delicious hearty soup that is done in a few hours !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bea"
},
"reviewBody": "Second time I am making this and it is my favorite to-to recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CJ Wood"
},
"reviewBody": "Husband loves this soup - I used chicken broth vs water and added some garlic powder and thyme"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Army Guy"
},
"reviewBody": "It's OK as it is but I made a ham stock with a whole ham instead of water and a ham bone. With a ham water, I put everything in a slow cooker for 8 hrs but easy on the salt, the ham water is salty. Once cooked, I used my hand blender to puree the soup and a spoonful of sour cream. Now that's a five stars soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb McClenny"
},
"reviewBody": "Very good &amp; healthy. No cream added or needed. Yummy taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "isabel1"
},
"reviewBody": "Love this soup so warm &amp; filling, perfect for a Fall night"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kurt Jeffers"
},
"reviewBody": "My mother used to make this soup when I was growing up; but I never knew how she made it. But I do remember that she always called it the poor man's soup. Regardless, I always liked it. However, call it nostalgia, but recently I sought out this recipe. I am so happy that this is basically the same recipe that my mom use to make. I never thought that a recipe could ever really bring back those special moments from your youth. This one did......."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Barnes Clarke"
},
"reviewBody": "A good recipe. Makes a sturdy soup. I like it even when the weather is warm. But I use ham chunks and not the bone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginny"
},
"reviewBody": "This was exactly what I was looking for in split pea soup! Perfect balance of flavors! Wow!!! I had cooked my ham bone the day before so I could chill the broth to remove the congealed layer of fat and to pick the meat from the skin and fat as much as possible before draining it. Then I added the peas (just rinsed them, didn’t pre soak), all the veggies and spices. Only additional ingredient was a good sized clove of garlic that was minced and enough chicken broth to equal 2 quarts liquid. I boiled the ingredients for about 15 minutes before turning temp to high slow cook. About 20 minutes later, it was perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daneen Schneider"
},
"reviewBody": "The soup came out great I did add vegetable broth a pinch of garlic and more salt and pepper also added extra potato because I wanted a hearty soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "old fashion cooker"
},
"reviewBody": "Love this recipe. Very tasty. I followed the recipe pretty close, I added garlic and used chicken stock in place of water, but basically followed. . I love split pea soup, I will make this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shannonc"
},
"reviewBody": "Delicious, we loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Poole"
},
"reviewBody": "I will say because I'm more on the lazy side, I did alter things a bit. I put everything in the pot at once, gave it a good stir, covered it, and cooked it on low about 2hrs or till my potatoes were tender, stirring occasionally. This is an amazing recipe that you can change and alter to your preference and liking. I don't care for adding salt or pepper while I'm cooking (I like people eating my food to control that for dietary reasons) so I did not add that like the recipe said, nor did I have the other spices it called for, so I I turmeric and others that I cannot remember. I also didn't have celery on hand so I just added more carrots. I'd love to make this in the crock pot at some point, but the stove top works perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Tersigni"
},
"reviewBody": "Excellent Recipe, kids loved it too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Mikel"
},
"reviewBody": "Definitely agree with others who suggest substituting chicken stock in place of water. I too added garlic clove and bay leaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marci"
},
"reviewBody": "Excellent recipe! It was a heavy consistency, just the way we like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny Anderson"
},
"reviewBody": "It was very good. I added garlic and bay leaf"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jblu"
},
"reviewBody": "The required 2.25 cups peas is equal to a one-pound package of dry peas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Kiefer"
},
"reviewBody": "If you change this recipe you should post it as your recipe and stop at that otherwise just tell us how you like this one. if you change things you can't say you made this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "It was good I added chopped celery and carrots and bay leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "Yes, I followed along for the most part, but made half the portion—I just added 1/2 cup more of water, 2 bey leaves and a pinch of garlic powder. I didn’t have marjoram, so I added a pinch of oregano. I had a hard time finding ham homes, so I got the last ham hock in the store, and it was smoked already. Cooked this for my little ones and it was delicious! Will make again, but next time I’ll try using half and half with chicken stock and water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey Sayes"
},
"reviewBody": "I skipped the potato, added some salt, and used more than a pinch of marjoram. This soup was delicious and my husband went back for a second bowl!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allnaturalcmd"
},
"reviewBody": "Just excluded the salt. This was a very easy to make healthy recipe. It was delicious!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/13384/split-pea-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14728/soups-stews-and-chili/soup/beans-and-peas/split-pea-soup/",
"name": "Split Pea Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/13384/split-pea-soup/",
"name": "Split Pea Soup"
}
}
]
}
}
, "about": [
]
}
]