				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Spritz Cookies II"
,"datePublished": "1997-11-01T23:08:04.000-05:00"
,"dateModified": "2020-06-18T22:54:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "This is the recipe we have always used at Christmas."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TrdqovrR9ZyFr5yujzcXvQBe5K0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2793282-ffb0eba93f9d4e7bbb9c6e661beffdd9.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2430905769001",
"description": "See how to use a cookie press to make buttery, incredibly beautiful Christmas cookies.",
"duration": "PT2M54S",
"name": "Spritz Cookies II",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/dd29bfbe-57e8-4e7f-8753-443538376e69/533e3c37-a3ba-4842-89fa-b3194f43d2a4/1280x720/match/image.jpg",
"uploadDate": "2021-07-25T03:05:16.500-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Spritz Cookies II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "193"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "144 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "46 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "56 mg"
,"sugarContent": "6 g"
,"fatContent": "8 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 cup butter, softened",
"3 egg yolks",
"2.5 cups all-purpose flour",
"0.66666668653488 cup white sugar",
"1 teaspoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix the butter or margarine, sugar, egg yolks and vanilla. Add the flour and mix by hand."
} ,{
"@type": "HowToStep"
,"text": "Spoon into cookie press and press onto ungreased cookie sheets. Sprinkle with colored sugars."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TrdqovrR9ZyFr5yujzcXvQBe5K0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2793282-ffb0eba93f9d4e7bbb9c6e661beffdd9.jpg"
}
]
,"text": "Bake in preheated 400 degrees F (200 degrees C) oven for 7-10 minutes."
} ]
,"recipeYield": ["24"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "I wanted to use my mother's ancient cookie press so I chose this recipe. While it tasted ok, I didn't find it to be a cookie I will make again. They were really small, and not all were uniform (I'm thinking newer models might be easier to use)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sheehanhill"
},
"reviewBody": "These had zero flavor. They were dry. The press part worked beautifully because I have an OXO press and that's pretty much fool proof. However, these left so much to be desired -- even after I added almond extract etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irene Mancuso"
},
"reviewBody": "I made a double batch of this recipe as written. No cookie press problems at all (Pampered Chef), and the cookies are delicious. Did not need the full 10 minutes of baking time - more like 8, but my oven tends to run hot. Thanks for sharing great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marianne Zwicker"
},
"reviewBody": "We make spritz cookies every year at Christmastime. For some reason, I thought I would leave my tried-and-true recipe and try something new. (Why? I don't know) I was so disappointed. The dough is so dry and had a hard time coming through the cookie press. We salvaged it by adding back some of the egg whites. We were able to salvage the dough, but the taste was not nearly as rich as it should be. I'm going back to my tried-and -true recipe next year"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMG"
},
"reviewBody": "Excellent! Dough was perfect for the press. Buttery and quick and easy. I think the yoks without the whites made it perfect. This is my go to now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Todd Emersen"
},
"reviewBody": "Turned out great. Just like the ones my mom made when I was a kid. I saved it to my favorites"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenzie"
},
"reviewBody": "I am not sure how you can go wrong with this recipe. I use it every Christmas and never have trouble with the dough. I add food coloring depending on the shape I make (green for Christmas trees). The only difference I do is a much shorter baking time for a softer cookie. Just a family preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "I made this recipe exactly as it is stated. They worked great in my press and taste yummy. I didn't give them a 5 because I have never made press cookies before. I thought they were a little dry, but maybe not as this is my first time with this recipe so maybe this is exactly how spritz cookies are supposed to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joann Rinear"
},
"reviewBody": "I have made this recipe for many, many years. Also try with almond extract as well. They are delicious too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anita Bruce"
},
"reviewBody": "I made these as a child. Now my little girl is , she loved them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Caswell"
},
"reviewBody": "They were great but I made one change to the recipe, I used almond extract instead of vanilla. Just like mom used to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "aholler824"
},
"reviewBody": "No taste at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dearheart"
},
"reviewBody": "This is to a T the same recipe that my mom passed down to me (with the exception that our instructions say to sift the flour first, but I've made it both ways, either works fine. Sifting makes the cookies lighter and fluffier). We made these for Christmas every year with a twist.\n\nWe would triple the recipe, keeping every all three batches separate from each other. We would then add red food coloring to one batch, green to another, and leave the third one alone (so it remains white). Then she would chill them (usually overnight and make them the next day).\n\nThen, the magic is you take a hunk of each of the colors, and press them into the cookie press. Once you get going, the cookies will have red, green and white swirls of colors on them. You just keep adding each of the colors till you run out of dough. Towards the end the colors won't be so distinct, but it is worth the effort.\n\nFor those wanting to try but unsure, these are my all time favorite cookie. I am not a huge sweet fan, and these are not overly sweet. You could easily add sprinkles or top with sugar to make them sweeter if you wanted, but to me they are perfect the way they are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SoniaO"
},
"reviewBody": "First I have to say I've never made Spritz cookies before. This recipe was perfect. They tasted the way I remember my grandmother's cookies tasting and such an easy recipe. One thing to keep in mind is the temperature of the dough is very important. After chilling in the refrigerator for about an hour was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Doverspike"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Diaz"
},
"reviewBody": "Really good cookies. The recipe work great with my cookie press. Not too sweet, just the way I like it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karinalouise"
},
"reviewBody": "These were just OK. A bit dry and not much flavor. My cookie loving daughter didn't even like them. Just not great. I'll stick to my mom's recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina McKean"
},
"reviewBody": "I just made these today. The only thing I did different was add a teaspoon of almond extract in addition to the vanilla extract. They taste amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Shaw"
},
"reviewBody": "This is the one that Betty makes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Darlene"
},
"reviewBody": "Even though I checked them at the earliest suggested time, the first tray got too dark. Turned down the oven to 375 - perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Buttercup"
},
"reviewBody": "We made this four times this Christmas and did not change a thing. They are delicious and the kids love decorating them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Gale"
},
"reviewBody": "Love this recipe first time I didn't struggle with the press cookies came out perfect I did melt the butter before using to dissolve sugar more easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "swtncal"
},
"reviewBody": "I had to add more butter to make it more doughy. I didn't have a cookie press so I flattened the dough and used some cookies cutters. They where a little doughy in the middle so I put them back into the oven. I added some red sprinkles to add more taste. Would I make it again sure I would."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "This is the same exact recipe my Grandmother handed down to me. It's wonderful.\nIf you want to shake it up a little, use almond flavoring instead of vanilla, or lemon and lemon zest.\nIf you are going to ship these tender cookies, freeze them first and wrap two cookies together in cupcake papers. Pack in tins with popcorn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elina"
},
"reviewBody": "I followed exactly the recipe. They were delicious. I had problems in working with my cookie press, needed a lot of efforts to press the cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arctic200"
},
"reviewBody": "Very good! I couldn't find my cookie press so ended up rolling the dough into logs, wrapping in waxed paper, and chilling in the fridge for about 30 minutes. I then sliced the logs into 1/8-inch slices and baked as directed. The cookies turned out great! Crispy and buttery! If the cookies turned out so well in spite of not using a cookie press, you know it's a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne Marie Barnett"
},
"reviewBody": "Never made these before.... Loved this recipe! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JamieAnn"
},
"reviewBody": "My great grandma always made Spritz and Rosettes for Christmas and mailed them to us, she's getting too old to move around in the kitchen, so I went on the hunt for a cookie press and the perfect Spritz recipe, and this recipe is it.\nThese cookies are so delicious, I was so excited to send friends and family off with a tin of them!\nthey're buttery and not too sweet!\n\nI used real butter and put them in the oven for 8 minutes exactly.\nthe first time I made them it was a test batch and I learned quickly to use an ungreased, chilled cookie sheet. that way they have no problems sticking, just be sure to remove the cookies immediately after taking them out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan S"
},
"reviewBody": "Self-respecting Swedes only use Almond Extract in Spritz, not vanilla! \nAnd if you use margarine, you will end up with an inferior cookie that is too soft to keep a shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "nicole"
},
"reviewBody": "Followed recipe exactly. Did not like them. First batch burned on the bottom. Lowered temp for next pans that went in and turned out blah. Not sweet enough, lacking in flavor. I don't know why because I didn't change anything in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PPC7882"
},
"reviewBody": "Great recipe. I used the egg whites brushing each cookie with egg whites before adding sprinkles helps them stick and also gives them a shine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donnette Anderson"
},
"reviewBody": "Wonderful recipe..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nonnarossi"
},
"reviewBody": "These were a hit with my visiting friend when I made them for a baby shower tea using the heart disc of the cookie press. Very quick, very buttery. All the ladies loved them. I'll use this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nicola Wright"
},
"reviewBody": "I followed the recipe, used real butter but the dough was too heavy to use with my cookie press. After adding sone water to make the dough easier to manipulate it worked ok. I would use again but add less flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Blackburn Engel"
},
"reviewBody": "Just like my great-grandmother's."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "calimom"
},
"reviewBody": "Easy and great for my cookie press. So much easier then the traditional holiday cookie dough you have to refrigerate for hours before using :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BevKat"
},
"reviewBody": "Good little cookie. Seems like the bottoms always darken first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "I used this recipe to try out my new cookie press and it made it very easy! One of my huge reservations about spritz cookies is that they often call for so much butter, and I'm too cheap to part with four sticks in one recipe! lol But yes, this one worked perfectly, and I ended up with a generous amount of perfectly sized butter cookies in the end. I even bumped it up a bit with one batch by adding a pinch of salt, about two teaspoons of grated orange zest and I used about 1 cup of sugar to yield a sweeter cookie (and combat a bit too generous of a salt pinch). The extra sugar probably isn't crucial but I recommend the zest! It opens up a ton of flavour possibilities and these cookies were MUCH less time consuming than other holiday cookies I've tried. These will definitely make it into the cookie tins this December as well as all year round! :)\r\nETA: my cookie press BROKE in the middle of a batch of these, and I just patted the dough flat and cut out with a small star-shaped cookie cutter! They held their shape and were very cute, kind of a shortbread texture and pretty lovely. I will hang onto this recipe even now that I don't have a cookie press at my disposal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "k_austin562"
},
"reviewBody": "DO: try these cookies. They are pretty tasty once done! But if you have never made spritz cookies unsupervised or are a relative novice at \"fancy\" baking, learn from my epic fail and:\nDON'T sniff the flavor bottles. I wanted 3 different colors with 3 different flavors, and thought I would revel in every moment of this magical Christmas-cookie-making adventure by breathing in the imitation strawberry (which, come to think of it, was probably 20 years old anyway). Avoid the fume headache.\nDON'T hand mix if you can help it, unless you were already planning on knocking out an upper body workout, anyway.\nDON'T put the dough in the fridge for too long. Maybe a little bit to help stiffen it for a clean press, but don't leave it in there for a half day while you finish your last minute shopping, thinking you are all clever and a good time manager. You'll come home to solid bricks.\nDON'T assume you will have natural instinct on how to artfully and effectively use the cookie press.\nDON'T expect your experience will replicate the fairy-tale memories you had of making the same cookies in your Mom's kitchen when you were five. My cookies were the most hideous things I had ever spawned from my kitchen, and no amount of sprinkles and slivered maraschino cherries could camouflage the truth. I was almost sad enough to tear up a little bit, until I tasted them... and then it was okay. That's why, even after the long string of don'ts, I still recommend you give them a try :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "k_dog"
},
"reviewBody": "Just tried this recipe. Very good and easy to use. Didnt think this year I was going to make Christmas cookies....just one of those lazy years. But Im very happy I did. I parted the dough in 3 sections, colored 1 red and 1 green and rolled the three together. They came out adorable. Not bad for someone who was going to be bah humbug to cookies this year lol lol Merry Christmas!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aliseb"
},
"reviewBody": "I found these to be dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jvu61"
},
"reviewBody": "very nice cookie. not to strong a flavor very understated and great to eat. i made them for a party and they were placed out on a table with 4 other spriz cookie trays. these were the last ones put out and the first ones gone. they work best when made with a cookie press as this will allow you to make them uniform and uniform cookies always bake better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly Mc"
},
"reviewBody": "I just received a cookie press for my birthday and this is the first recipe I have made with it. The cookies are delicious, and very easy to make. Total cookies was about 7 dozen. Very tasty, and I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "These were very bland!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "Best recipe for Spritz cookies that I have found. Great tasting cookie and the dough is good consistency to place inside cookie press. Only thing is, my cookie press stopped working half way through. I have two, a battery operated one and a manual. I couldn't get either one to work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danie"
},
"reviewBody": "I have been making Spritz cookies for 10+ years and have used several different recipes, and finally found my favorite one a couple of years ago, but couldn't find it this year :( So I thought I would try this one... It is amazing. So simple to make, and worked so well in my cookie press. \nI added a little bit of Almond extract to the recipe tho, and they taste Fabulous!!! I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maidmarian68"
},
"reviewBody": "Wonderful! Reduced flour to 2 1/4 cup and increased vanilla by 1/2 teaspoon. Dough squeezed thru press beautifully! Very simple and great buttery flavor....thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julie b."
},
"reviewBody": "The cookies are great, but the pan I put on the lower rack of my oven, the cookies burnt. Thats ok, because I learned from my mistake and made a new great batch after."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "razowu"
},
"reviewBody": "I have never been moved before to write a review, but these cookies were amazing! I kept pretty close to the recipe, just doubling the amount of vanilla (a preference I usually indulge in) and adding a 1/2 tsp. of salt, as others have suggested. They came out perfect the first time! I didn't have to refridgerate, and I used a Pampered Chef press. Thank you for my new favorite cookie recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Iowa Amy"
},
"reviewBody": "Fabulous tasting cookie and super easy to make. The cookie was nice and buttery tasting, and worked in my cookie press really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TResa54"
},
"reviewBody": "This is a great recipe. I read some of the reviews that mentioned floury tasting or dry - You have to use real butter (salted), then I added 1-1/2 tablespoons more sugar and 1 tsp more of vanilla - these are the best Spritz Cookies I've ever made and I've made a lot. As usual I tripled this recipe for fam and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHERIKCMO"
},
"reviewBody": "A lovely basic spritz. I added a touch of salt, just to be sure it wasn't bland. And it's such dry weather right now, I added a tablespoon of water to make it workable dough. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lacyd123"
},
"reviewBody": "They were very plain but still good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Nicoleodeon"
},
"reviewBody": "I really didn't like this recipe. The dough was hard to work with and stuck to the press more than with other recipes I have used. I was disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DOMSMUM"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jen B."
},
"reviewBody": "Nothing says Christmas to me like spritz cookies, and I was anxious to give this recipe a try. These mixed together well and I had no trouble getting the dough through my Wilton cookie press, but all I taste when I bite into one is the flour! Not sure why, except that I did use unsalted butter; maybe the flavors would have been more well rounded if I'd used the salted kind?!? Anyway, I'm still on the lookout for that \"perfect\" spritz recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cmkennedy7"
},
"reviewBody": "Thanks for the great recipe and all the ideas from everyone. I did only 3 cups of flour also and love it. I haven't ever done Spritz cookies because I thought they would be hard. I have had the battery powered press for 3 years without using it. Love it now and will use it more often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janebabes"
},
"reviewBody": "I found the dough to be too stiff for my battery operated cookie press, which was a little frustrating, but I managed to fix that by thinning it out with 2-3 tablespoons of milk. They taste and look great and were quite quick to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mctm2000"
},
"reviewBody": "Dough is way too dry to go through the cookie press. I had to add egg and water. Cookies were ok."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "discdogshayne"
},
"reviewBody": "Followed the directions to a \"T\" and ended up with dough so stiff it crumbled coming out of the cookie press. I will be sticking with my normal spritz recipe. Plopped the dough down on cookie sheets to not waste it and the flavor was great, just not so much for being able to use it with a cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wktkw"
},
"reviewBody": "Everyone loves these cookies-it's a nice selection for your cookie tray-something a little different then the usual."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LuLu"
},
"reviewBody": "This is the original recipe from a Betty Crocker Cookbook from the 1950's. It has been used by my family, and myself, for decades and is always a crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JackS"
},
"reviewBody": "NO STARS! Dry tasteless and impossible to get to come out of the press. DO NOT USE THIS RECIPE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Athyna"
},
"reviewBody": "I followed the directions to the T &amp; came up with a VERY thick dough - I was fighting with my cookie press the whole time until I just gave up. The cookies that I did make were very plain tasting to me &amp; way to heavy. I like butter cookies but these were just too plain for me. I think that if I am to make these again I will only do 2 cups of flour next time &amp; that should thin out the dough enough to not have to fight with the cookie press. I might also try to use the whole eggs instead of just the yolks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "For years I have tried to make Spritz that taste as good as hers. ( When I follow her recipe they don't come out the same.) This makes a cookie like hers. It is delicious. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat LG"
},
"reviewBody": "These cookies are great. I just made them the other day and now i have to again so my husband can take them to work. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eve"
},
"reviewBody": "Just what I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAJANDKPJ"
},
"reviewBody": "Great recipe. I make chocolate chip meringue cookies during the holidays and this is a great recipe to use up all those egg yolks! I've also made with just a bit of almond extract added as well. So yummy and festive!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kpaigel"
},
"reviewBody": "This is a good recipe. I didn't think the first batch was sweet enough so I used 3/4 cup of sugar and I thought that worked better. I also use green food coloring after mixing the flour. My mom and I made Spritz cookies when I was a kid and she can't find her recipe. This one is close, but something is a little different--we used to sift the flour so that might be it. Also, you don't want to chill the dough before using the press. I noticed some other reviewers did that and had trouble. The dough works best when it's at room temperature."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cherylf"
},
"reviewBody": "Just got done baking these. They turned out great. I did use almond extract in place of the vanilla. They also have a buttery taste! tasting great with my cup of tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KiltimaghRose"
},
"reviewBody": "Very good! I followed another review that suggested adding 1tsp of salt since I used unsalted butter. I also used 2 eggs instead of 3 egg yolks. I only baked for 6 min &amp; they were perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Gurden"
},
"reviewBody": "Love the flavor! Easy to make. Was hard for it to stick to the baking sheet so we added 3 tbsp. milk and it fixed the problem!!! Try it..it works and the flavor stays the same!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rayan"
},
"reviewBody": "i tried a lot of cookie recipes and all of them were horrible but last night i came across this wonderful recipes and i tried it they came up very tasty and soft the dough was easy to work with i just had a hard time to make the christmas tree shape i don't know why i' m using martha stewart cookie press so if somebody has a suggestion i' m listing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becca Jean"
},
"reviewBody": "At frist when I tried these they were good, but not grandma good, so i put the dough in the fridge all discouraged. I didn't want to waist it so I backed the rest last night, and WOW they are great! They might be able to compeate with my grandmas. I would recomend letting the dough rest for a big in the fridge.... I also made a cream cheese frosting. yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tscarlile"
},
"reviewBody": "Very good. Light and slightly crisp on the edges. A simple cookie for a yummy treat. My 8yod helped me, but rather I helped her. She did most of it. Perfect for this November day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swaswa"
},
"reviewBody": "I bought a cookie press in a thrift store a while ago, and researched on the internet for spritz cookie recipes. I read a lot in forums about how cookie presses suck in general and are complicated to use, how the dough sticks to the cookie press but not to the sheet, and so on. However, using this recipe for my first time with the cookie press, I have no idea what all those people did wrong, but I bet it was that they used the wrong recipe. This was fantastically fast and easy, and absolutely no hassle whatsoever. Using the cookie press was lots of fun with this recipe and I can’t wait to do it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CPA"
},
"reviewBody": "Very good. I used 1/2 tsp of almond extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Dry and tasteless"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy F."
},
"reviewBody": "These weren't bad, and I knew not to expect a super flavorful cookie, but I have to say these tasted like sweetened flour. I probably would have enjoyed them more dunked in tea, but as they were, they just weren't the cookie for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vanessa"
},
"reviewBody": "The cookies were pretty good - I added another teaspoon on vanilla to boost the flavor. The dough was a perfect consistency for my cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LD1959"
},
"reviewBody": "I agree, butter is essential in this recipe. Because these are a little dry, we always frost them! I just use about 2 cups confectioners sugar and slowly add milk, a little at a time until it's the right consistency. Then I put about 1/3 cup in 4 different custard cups and add a couple drops of food coloring, and we have green, blue, yellow, and red/pink frosting. It's very easy then to decorate the cookies with sprinkles, dragees, colored sugar, etc. Even small children can help. Just give them a little plastic disposable knife for each color, and they will go to town."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ksbaxter"
},
"reviewBody": "Made Christmas Eve. They turned out very flat! I used 2 cups flour and one cup sugar. The cookies are very light/delicate. Would probably not make again. I will try recipe on the cookie press next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BethyB"
},
"reviewBody": "I didn't love these cookies, they turned out a little dry, which is definitely not what I remember eating every Xmas when I was little. I baked them for less time, and at a lower temp, still kinda dry, tasted a lot like sweet flour. Also, just a tip for a beginner Spritzer, ALWAYS use aluminum foil, or a pan that is NOT non-stick, if you use any type of nonstick anything, the cookies won't even separate from the press. I followed the recipe as stated, until the first batch came out very hard, that's why I lowered temp and time, but I wouldn't make these again, even after the adjustment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "megustacomer"
},
"reviewBody": "This is my first time making spritz cookies and using a cookie press (Pampered chef). The dough was so soft and easy to work with. I couldn't believe how perfect the cookies turned out. They have a very delicate, delicious flavor. I added only 2 cups of flour and added 1 cup of sugar. I think they turned out tasting perfect! These cookies are not bland; they're supposed to have a subtle flavor and a melt in your mouth texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CMCO"
},
"reviewBody": "Very good. I mixed in the flour with my mixer and they turned great. It would be to much work to mix the flour in by hand. They turned out so well I'm going to make a second batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cygnusjen"
},
"reviewBody": "These cookies have a nice texture and a nice light flavor, but I had trouble with these working in my press. I had to add a little milk to loosen them up.\n\nUpdate: I bought a new press this year - an old Mirro aluminum press on ebay - and the dough works just great without any modifications in this press. Last year I used a plastic Wilton, and it just didn't agree with my hands nor the dough. Changing this to 5 stars! Great flavor, delicate texture that melts in your mouth - not hard or too crispy at all. Great for my grandma who can't chew crispy cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nd farm girl"
},
"reviewBody": "These cookies turned out great. I split the dough in half and added a few drops of food coloring to each half and they turned out very pretty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "casidee"
},
"reviewBody": "Very good!!! Light and buttery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilu"
},
"reviewBody": "This is my first time using a cookie press. my cookie press is the cheapest electric press you could find and I still did great with this dough; the consistency is perfect for the cookie press. do not need refrigerating, maybe if you handle the dough too much. About the flavor I found it a little bit bland so I double the vainilla and also made a second batch with 2 tsp almond flavor. and put a whole cup of sugar instead of 2/3, I also used coloring for the cookies and turn out great! cooking time was more 6 mins than 7-10. I will be including these in my Christmas cookie tin cans gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "tasha"
},
"reviewBody": "I am very dissappointed in this recipe. My dough was incredibly crumbly, even though I used less dough than the recipe called for (at the suggestion of other reviews). Also, the dough came out of the cookie press, it would not stick to my pan. I'm not an \"experienced\" baker, so maybe it was me...but I will not be attempting these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KEVINANDBARBIE"
},
"reviewBody": "this recipe turned out perfect! I used 2 cups flour and half a cup cornstrach. I used almond extract in place of the vanilla. It came out of moms old crank cookie press perfect. I baked them at 375 degrees for 6/7 minutes. Just Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet Apron"
},
"reviewBody": "I have tried several spritz recipes from this site with mixed reviews. This one was terrific. The cookies came out of the press easily and no chilling required! Use the dough as soon as it is made. I may add a pinch of salt next time to bring out the nuttiness of the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lindawagg"
},
"reviewBody": "not as good as the cookie press recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Staceylyn"
},
"reviewBody": "I actually made a sugar-free version of this cookie and it came out wonderful! I substituted a generic version of Splenda in the same quantity as the sugar listed in the recipe and I used 1 tsp almond extract and 2 tsp. vanilla for the flavorings...I really thought they were great. I have a small home-baking hobby and I have a lot of friends who love for me to do their baking for them...so this will be guinea-tested on some of my diabetic friends who have been feeling left out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julee"
},
"reviewBody": "I agree with some of the comments about the flour-y flavor. I used unsalted butter but the last time I loaded my cookie press I mixed in a little salt. Next time I would put in more and I think it helped the flavor. I might also use some sprinkle sugar on top for sweetness. I would consider making this recipe again. I also used whole wheat flour (only flour I have) and substituted the vanilla for almond. The WW worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "geranium"
},
"reviewBody": "I didn't like these very much. The dough was too thick, Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista"
},
"reviewBody": "The recipe is absolutely delicious and super easy. The dough also comes together perfectly. The only complaint I had was that a few of mine got slightly brown around the edges which would be fine for other cookies but never for spritz. The solution is very simple however: Bake only 6 minutes and they will come out perfectly. Most spritz recipes call for only 6-8 minutes anyway."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MizSlick"
},
"reviewBody": "I would honestly give this recipe 20 stars if I could!! I'd never used a cookie press before and this recipe made it so simple. I made the cookies with the Christmas tree stencil for my family for the holidays and they were a HUGE hit. My mother especially couldn't stop eating them! I'll be making another batch for her next week for her Valentine birthday. I used orange extract instead of vanilla and they're just luscious. I can't wait to try the recipe with other flavors like maple or almond. Or maybe lemon poppy seed! The possibilities are endless with this wonderful, simple, delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Billingsley Cox"
},
"reviewBody": "One of the best Spritz cookies I have made. I used to use my mom's recipe, now I have my own. I had to make another batch the next day, my husband ate all our \"Santa\" cookies that night. Wonderful cookie. One note, to make cookie more formed when using cookie press, refrigerate in bowl 30 minutes before pressing."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10056/spritz-cookies-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/15057/desserts/cookies/butter-cookies/",
"name": "Butter Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/858/desserts/cookies/butter-cookies/spritz-cookies/",
"name": "Spritz Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10056/spritz-cookies-ii/",
"name": "Spritz Cookies II"
}
}
]
}
}
, "about": [
]
}
]