				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Squash Relish"
,"datePublished": "2020-06-18T23:46:18.000-04:00"
,"dateModified": "2022-10-12T10:03:10.000-04:00"
,"author": [
{"@type": "Person"
,"name": "mbrancherwife"
,"url": "https://www.allrecipes.com/cook/2506220"
}
]
,"description": "This colorful, sweet and tangy canned relish is made of yellow summer squash, green and red peppers, and onions. It&#39;s a great way to store your garden&#39;s bounty for later on, and a jar makes a great gift."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OokhfpqgDMuhGPwwhOIIjHX8o84=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9332636-squash-relish-Ssipos-66d0268d228b4b0194640427e827a1c5.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Squash Relish"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "40"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "15 kcal"
,"carbohydrateContent": "4 g"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"sodiumContent": "109 mg"
,"sugarContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"8 cups diced yellow squash",
"2 cups diced onion",
"2 red bell peppers, diced",
"2 green bell peppers, diced",
"3 tablespoons salt",
"3 cups white sugar",
"2 cups vinegar",
"2 teaspoons celery seeds",
"2 teaspoons whole mustard seeds",
"6 (1 pint) canning jars with lids and rings" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place the squash, onion, and red and green bell peppers into a large bowl, and sprinkle with salt. Toss to combine, and allow the vegetables to drain for 1 hour. Discard juice."
} ,{
"@type": "HowToStep"
,"text": "Place the sugar, vinegar, celery seeds, and mustard seeds into a large pot, and bring to a boil over medium heat, stirring to dissolve sugar. Stir in the squash mixture, and return to a boil. Cook the mixture until the vegetables are tender, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the squash relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
} ,{
"@type": "HowToStep"
,"text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes, or the time recommended for your area."
} ,{
"@type": "HowToStep"
,"text": "Remove the jars from the pot, and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
} ]
,"recipeYield": ["192"]
,"totalTime": "PT175M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie Boudot"
},
"reviewBody": "I used zucchini instead of yellow squash. I LOVE this chow chow! I hand chop the vegetables so it's a little chunky. It's great on peas and beans and we enjoy it on hamburgers, hotdogs, brats."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Nokes Biggerstaff"
},
"reviewBody": "Absolutely love this added Jalapeños to mine"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Have made this for several years and really enjoy it during the winter with Purple Hull peac, White beans and ham hock and on Grilled hot dogs. You won't be disappointed with the results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy Cassady"
},
"reviewBody": "I canned over 100 pints of this, my mother in law even had me swap out the yellow squash for zucchini and make 24 of those. They weren't quite as good as the squashbut still very good. Anytime I had to bring out a jar for a meal, it didn't last. I have already got requests for this year when I start canning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Fanning Noack"
},
"reviewBody": "Made this recipe last year to use as a Christmas present. However once I tasted it we ate it all. This year I’m making four times as much. The only change I made is that I cold pack my vegetables into the jars then pour my brine on top. This keeps the vegetables crisper. We have served this as a side dish both cold and hot and both are excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sometslee"
},
"reviewBody": "Just made this, very excited to try them in a few weeks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "Good relish! A little sweet, but goes well with salty foods like brats. I made a few minor adjustments. I didn't have any red peppers, so used some yellow ones. I coarsely chopped the vegetables and put them in the food processor to make like relish consistency. I added 2 jalapenos and put the relish in 1/2 pint jars and processed for 5 minutes. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momof3boys"
},
"reviewBody": "This is soooo good! I cut back on the sugar, and it was still very sweet! I will definitely be making more of this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Fuqua"
},
"reviewBody": "I've made this recipe twice, once in pint jars and then in half pint jars. We really enjoy the taste! I'm planning to share some jars as gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia"
},
"reviewBody": "My husband loves relish, chow chow etc., but was a little leery of me making so much (6 pints per recipe). When he tasted it, he loved it. He said he would buy this. He loves it. I’ll make more squash relish and experiment with pimento and jalapeño."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sickofwk"
},
"reviewBody": "Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb K"
},
"reviewBody": "I made 2 batches of this, and on both I only cooked the veggies about 8 minutes to keep a little bit of firmer texture. I made the first batch exactly as written. It was really really good, but a bit too sweet for my taste and not enough kick. 2nd batch I added 3 diced jalepenos, 2 diced cayenne, bumped up the mustard seed to 2 TBS, added a pinch salt, and reduced the sugar to 2 cups. I liked the 2nd batch better, but I think that is all a matter of taste. Wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOKINGKIM43"
},
"reviewBody": "my husband loved it. Did replace sugar with 1 cup of splenda. Outside of that, no other changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mundo131"
},
"reviewBody": "The was a really easy recipe. I didn't use quite as much sugar as it calls for and it still turned out really well. Would definitely recommend this recipe and will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bentley Wentley"
},
"reviewBody": "I’ve grown organic yellow squash for years. I never knew I could can! This recipe did the trick. Beautiful presentation and very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StoleURfood"
},
"reviewBody": "This recipie is good, i have made it two years in a row now. Its the best recipie i have for my squash. I eat it as a side on just about every meal :) Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "diana"
},
"reviewBody": "Excellent!! I chopped everything up really fine, like a pickle relish. I tried it on cornbread first, and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "I ran across this recipe last summer as we had an overabundance of squash and I was looking for squash recipes and decided try it. It was a huge hit in our household. We use it on hamburgers, hot dogs, as a side, and it is also great on collards and kale when they start coming in during the cool weather months. I plan on making extra this year. Followed the recipe as written and it turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karyn Gideon McDuffie"
},
"reviewBody": "Delicious, can't wait for more squash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa_n_tn"
},
"reviewBody": "Made my first batch last night! Missing and substituting a few ingredients; I only used 1/2 of a green bell pepper( that's all I found in the fridge, I was completely out of Red Bell peppers so I found a small jar of diced pimentos (Hey they're sweet red bell peppers so it has to work!) I also had yellow squash as the recipe called for, but I also added Yellow Zucchini from my garden! I also misread the recipe directions( I read it no less than 5 times) at the beginning so my veggie mix sat stewing in their own waters and salt for one whole hour! I then saw my mistake and used a sieve to press out most of the water at the end of the hour, lol\nIt still came out delish! WOW this was a real easy recipe~!~"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilikefrenchies"
},
"reviewBody": "This is SO good! I had a giant cucuzza squash that I needed to use up, and found out that people often use them interchangeably with summer squash. I decided to try this recipe, but halved it to see if I liked it first. We LOVED it, and I will probably make more asap!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Enigma"
},
"reviewBody": "I only cooked the squash 5 minutes. Turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Klug"
},
"reviewBody": "This was so quick and easy(i used my did processor for the vegis). my fiance and I both love the sweet taste. But can anyone tell me why these say to be refrigerated if they are sealed?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smileyme"
},
"reviewBody": "I love this recipe. I made 3 batches last year and just did a double batch for this year. It is great on and in everything. I hand dice all of it because I love the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TK"
},
"reviewBody": "This is a family favorite! To save time I throw the veggies into the food processer and pulse/chop until they are fairly finely chopped. My recipe calls for turmeric, and I leave out the mustard seed entirely. It's nice as a side as well as a relish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Roy"
},
"reviewBody": "I am giving it 5 stars for the prep work. I just made a batch this afternoon and haven't tasted it but what a easy recipe. I really hope it turns out as yummy as it looks! I am dying to taste it but I know it will need a few weeks for all of the flavors to settle.\n\nupdate 8/3/2019: I can't believe that it has been 7 years since I have updated my review. THIS RELISH IS DELICIOUS!!! I have made it every summer as written and it is perfect on pork, chicken, in potato salad...you name it. Everyone loves this recipe and beg me to make it every year! My (now) 6 year old son loves the relish and begs to eat it straight out of the pot. \n\nMake it-you will not be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "msddsk"
},
"reviewBody": "This relish is by far better than any cucumber relish!! I make this every year and it is the only relish my family wants me to use. I put it in potato salad, tuna salad, chicken salad... anywhere I would normally use pickle relish! The squash actually seem to hold up better and stay firm longer in this relish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacymom"
},
"reviewBody": "I make this every summer with extra veggies from the garden. My family loves it with meats and as a relish for hotdogs. I always add 3 jalapeno peppers for extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Niroszyckame"
},
"reviewBody": "I made this yesterday and so I haven't had a chance to taste it after it has sat in the can for awhile but the initial taste was wonderful! The perfect ratio of sweet to tangy. The reason I am giving it only four stars though is that is is quite liquidy. I think I will use less vinegar the next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dana"
},
"reviewBody": "My mother used to make this relish every summer. It is a wonderful relish that goes well on a southern table. She always sliced her squash and onions in rings though, not diced them. They are much prettier in rings rather than diced."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/219189/squash-relish/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
"name": "Sauces and Condiments"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13378/side-dish/sauces-and-condiments/relishes/",
"name": "Relish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/219189/squash-relish/",
"name": "Squash Relish"
}
}
]
}
}
, "about": [
]
}
]