				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Steak Fajitas"
,"datePublished": "1999-10-14T17:45:29.000-04:00"
,"dateModified": "2022-07-14T18:05:14.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tali"
,"url": "https://www.allrecipes.com/cook/26842504"
}
]
,"description": "Beef strips are marinated for 2 to 4 hours in lime juice with cilantro, then sauteed, and simmered with green pepper, onions, and additional lime juice."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/kvWDc2CAwZZDG4LA74i4twYb8is=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4602636-f7f501bd62db41f584578b0b6a29cbb1.jpg",
"height": 1080,
"width": 1080
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Steak Fajitas"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "79"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "896 kcal"
,"carbohydrateContent": "104 g"
,"cholesterolContent": "76 mg"
,"fiberContent": "10 g"
,"proteinContent": "38 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1182 mg"
,"sugarContent": "6 g"
,"fatContent": "38 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 pound lean steak, cut into strips",
"0.5 cup fresh lime juice",
"0.5 tablespoon ground black pepper",
"1 tablespoon chopped fresh cilantro",
"2 tablespoons vegetable oil",
"1 large onion, cut into thin strips",
"1 julienned green bell pepper",
"2 lemons, quartered",
"salt and pepper to taste",
"6 (12 inch) flour tortillas" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Combine the lime juice, ground pepper and cilantro in a shallow dish. Place steak strips into the marinade and refrigerate for two to four hours."
} ,{
"@type": "HowToStep"
,"text": "Heat 1 tablespoon vegetable oil in a large skillet over medium-high heat. Add steak strips, and fry until cooked to your liking. Remove meat and set aside."
} ,{
"@type": "HowToStep"
,"text": "Add remaining oil and onions to the skillet. Cook over medium low heat, until translucent, stir in green peppers and steak. Squeeze the juice of 1 lemon over the top and stir. When the green bell peppers are just tender remove the pan from the heat. Season with salt and pepper to taste. Serve the steak fajitas with tortillas and lemon wedges on the side."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT160M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow love it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used a little less lime juice due to some complaints on other reviews, about 1 1/4 lb of New York Strip steak, and red, yellow and orange peppers. (they came in a pack) Sprinkled a little taco seasoning from Spice Island (maybe a Tbls) and squeezed 1/2 a lemon over the whole pan before serving. Used flour tortillas and topped with Monterey Jack cheese and a little salsa before rolling it up. Loved it, better than other recipes using a lot of taco seasoning for flavor. Wife also really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophia Ivy"
},
"reviewBody": "We made some slight modifications and this turned out great! Use a green pepper with 4 bumps on the bottom, it is sweeter. Thoroughly douse the meat in marinade but do not let it sit in liquid marinade; dump out the rest of the juice after each piece is covered. Sautés the onions and pepper with the lemon juice THEN add the steak to finish. This was the perfect amount of citrus flavor without being overpowering!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Twistinory"
},
"reviewBody": "Very nice. Only difference is that i seared the steak first, when it was about done to medium rare, i cut it into slices along with veggies, came out very delicious! Toasted tortillas on direct flame, a little bit of home made salsa and you have flavors bursting!\nThank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J Richardson"
},
"reviewBody": "I used red &amp; yellow bell peppers I marinated the steak in lemon &amp; pepper marinade store brand. along with springled dry celantroes. I cooked the steak with porta belly mushrooms red onions. and topped with 4 cheese mexican cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spencer Johnson"
},
"reviewBody": "Have made it 3 times now. Absolutely delicious! I like to add a little mozzarella cheese on Tom to add a little flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fred306"
},
"reviewBody": "A little too much on the lemon and lime for me, but I'm picky . My wife thought it was great, she loves either. I also tried a variation with less lime and no lemon using leftover steak and at least I loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnneC"
},
"reviewBody": "Marinade is key to the recipe as it made the meat very tender and it had a wonderful taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amhartls05"
},
"reviewBody": "Icky. I made this recipe and I ended up putting cumin and other spices for flavor. It didn’t taste like fajitas at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Jones"
},
"reviewBody": "Made for dinner tonight and everyone enjoyed! Will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cara S"
},
"reviewBody": "Super YUMMY!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JANAT"
},
"reviewBody": "Marriated everything for up to 24 hours. Added mushrooms. Didn't add lime til the end"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rick Powers"
},
"reviewBody": "I did not use onions, since they cause a bad reaction for me -- and I did not use the cilantro -- and I just sprayed it with lime juice -- and I added garlic powder -- and vodka -- but hey, the recipe was a good inspirational start! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Anne"
},
"reviewBody": "Obviously if you marinate the beef in lime for so long it's going to taste strongly of...you guessed it...limes. So if you don't like the strong citrus flavor avoid this recipe. Personally we loved it. I added a clove of diced garlic to the marinade as well and some guac or avocado slices pair really well with this when served."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loretta Asencio"
},
"reviewBody": "I made this recipe for three friends. It set off my smoke alarm! Very easy and so good! I made homemade salsa, and guacamole. It was wonderful. The secret is to marinate the meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "To counter the overpowering lime flavor, use fajita seasoning (from scratch, if you like) to cook the meat. It may be an omission that it isn't there. The recipie is fantastic without tortillas for low-carbers and I've make it many times adding salsa, sour cream &amp; guac alongside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "No one would eat it. Way to limey. Maybe 3 T. lime and some spices to marinate like cumin chilli powder. Will not make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samanthasmith576"
},
"reviewBody": "I used lemon juice instead of lime juice for the marinade, and I let it marinate for about an hour then cooked it. Everyone that tried it loved it and said that it was the best they have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amanda Bates"
},
"reviewBody": "The lime overpowers everything. None of my family would take more than a bite or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "akppsu"
},
"reviewBody": "I bought a strip steak on sale and since I made this before and everyone loved it, I did it again. Here's what I do - 1st pound out steak to tenderize (usually doubles the size) and season with sea salt and fresh ground pepper. Then I whisk together the lime juice and cilantro. I then rub that mixture into the meat and let it marinade in the refrigerator.\n\nI then cut the steak in 2 and cook them with the veggies and lemon juice, with a little extra sea salt and pepper. Once the steak is done and is resting, I make sure the veggies cook down and the onion caramelizes. I put a strip of sour cream in the tortilla first, add the steak (now cut on the bias), veggies, cold lettuce, a little taco sauce and cheddar or colby jack shredded cheese.\n\nWith the leftover steak, I make a steak salad.\n\nVery good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy L"
},
"reviewBody": "This was a good basic recipe. I read everyone's reviews that the recipe was too limey, so I cut the marinade with 2 tblsp of olive oil, then I discarded the marinade, and only cooked the meat. It still came out limey, but when I added everything else, it tasted great! I rolled steak into a tortilla with sour cream, cheese and hot sauce. The lime added a hint of flavor to the meat and it made the meat more tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nealbailey"
},
"reviewBody": "I did not care for this recipe. My wife and I have tried this three seperate times and the lime juice is so strong that you can't taste anything but lime."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "I did not care for this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "?Carol?"
},
"reviewBody": "I did my steak fajitas a bit different, I did not have time to marinate so I skip that, instead I combine the lime juice, cilantro, and black pepper and added a bit of onion and fresh garlic put it in the blender machine to make a sauce. I added a little bit of salt as well then I mixed it with the steak strips, then put it in the refrigerator for 5 min then mixed with Onions, green bell pepper, red pepper, and yellow pepper, I added black pepper and salt. \nIn a hot pan with oil I started to put just the meat, let it cooked then after few minutes put the veggies on top, I added more salt, pepper and red chili pepper to make it a little bit spicy, cover it until is done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "virginia capistran"
},
"reviewBody": "i added chiles to make it spicy for my husband"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "dfitzgerald18"
},
"reviewBody": "Too much lime. As lime is an acid, it will start to break down the meat. Try making a tomatilla salsa and use that to marinade the meat instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "KatyJoan"
},
"reviewBody": "Wow--I doubled the meat, and this was still VERY peppery and lime-y. Will NOT make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amandak23k"
},
"reviewBody": "The steak and peppers were cooked perfectly, but I had to add some seasonings for more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "magicbeanbuyer"
},
"reviewBody": "Only marinaded for about 45 minutes and that seemed to be the right amount of time to keep the meet from getting too lime-y for my taste. Also added minced garlic to the pan when I cooked the steak....because everything tastes better with garlic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Erika904"
},
"reviewBody": "Very bland and did not taste like steak fajitas in my opinion. Maybe this recipe was more for letting other toppings shine such as guacamole and salsa. I made mine just like the recipe said and added sour cream and cheddar cheese. Not a repeat make for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "serena22304"
},
"reviewBody": "It tasted so good aside from too much lemon flavor. Calls for 1 lemon squeezed over it then stir. Next time I am going to try maybe a quarter to half of a lemon"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "atasteofcreole"
},
"reviewBody": "Lime was over-powering. Needs garlic, onion, chili powder, cumin. All the basic staples of Mexican cooking. I also enjoy adding a splash of Patron for more of a robust flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybuggs5224"
},
"reviewBody": "These were very yummy, if your not a fan of lime cut back, not a fan of cilantro leave it out. You def have to be a lover of both to enjoy these but we certainly are and we loved them. I used petite sirloin cut into thin strips and cooked them to a med. rare and they were perfect. We served with lettuce, tomato, cheese, homemade salsa, whole pickled jalaps, avocado slices, sour cream, cilantro, and lime wedges which we squeezed over everything. Super good and will make again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "This was delicious, I loved the lime marinade, made the steak juicy and tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitten"
},
"reviewBody": "Now, that was good. Thsi is my first time to have fajitas. All the rest of the family has had them plenty of times so they helped me with mine.I made the fajita strips in my new Geroge Forman Grill. I put the strips on one side and the veggies on the other side. It tool longer for the veggies to cook so I put those on first then the steak. When they were done, I slipped them off the grill onto a platter and mixed the veggies and meat. I warmed the torillas, we used whole wheet tortillas, trying to eat healthy, and added the steak and peppers and it was very good.It took me less than 5 minutes to cook everything. Boy, talk about yoyr fast-food. We will definintely have these again. Easy to prepare, great tasting, sounds like a winner to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "This was pretty good for a meal in a hurry. I used a frozen blend of fajita veggies (onion, green and red peppers cut in strips) and a couple of shakes of store brand beef fajita seasoning as it seemed a little bland without it. I used an inexpensive cut of steak (maybe it was top round?) Thanks, there were no leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mango"
},
"reviewBody": "I really liked these fajitas! I added extra black pepper and cayenne to the marinade. I left off the green peppers, and added some sour cream to the tortillas... so good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kittie24"
},
"reviewBody": "Absolutely heavenly! A bit of sour cream to top it and it was all ate. Thanks for a yummy recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "OregonGirl"
},
"reviewBody": "I agree that the meat IS a little too strong on the lime! But I only marinated it for an hour and a half, and added my own spices (Mrs. Dash extra spicy blend) to it along with the fresh cilantro. I served it with black beans, Spanish rice and homemade guacamole, and when mixed with the above in a warm flour tortilla, it's actually VERY GOOD! I will make this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mis' Kitchen"
},
"reviewBody": "I love lime, but these were too much, or maybe just not enough of a balancing flavor. Maybe some spice would do it good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This was a nice starting point for a simple fajita. I had to add some extra seasonings and fresh garlic for extra flavor. An enjoyable dinner. :o)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Stobbe"
},
"reviewBody": "I have been using this recipe for over a year now with chicken or steak. I really love it. I have high blood pressure, so low salt is a must. I really like the lime flavor and even squirt more lime on my steak when it is finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HOLLIE704"
},
"reviewBody": "Even though others found the lime overpowering, I really liked it. And I was only able to marinate the steak for an hour. I would definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "EGCOMPTON"
},
"reviewBody": "Awful. The lime juice was so strong that I had to start over and find a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOMINANYC"
},
"reviewBody": "THIS RECIPE WAS ABSOULUTLY WONDERFUL I MARINADED FOR 5 HOURS USED RED AND YELLOW PEPPERS COOKED FOR ABOUT 10 MINUTES TILL VEGIES WERE SOFT THAN ADDED A DROP OF LEMON PUT MIXTURE ON HALF OF TORTILLA COVERED WITH OTHER HALF BRUSHED A DROP OF WATER ON TOP BAKED FOR 5 MINUTES IN OVEN (YOU CAN ALSO PUT SOME CHEESE MONTERAY JACK AND CHEDDER ON TO MAKE FAHITA QUSEDILLAS) WAS SO GOOD THANK YOU FOR RECIPE \"MAKE SURE TO REALLY DRAIN STEAK IT GETS QUITE OILY\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "When I first started using this recipe, there was no lemon listed - I just use the lime in the marinate and squeeze 1/2 lime over it just before serving. They are awesome! I use fillet mignon. Great every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "GREEBO"
},
"reviewBody": "If you like lime, you will probably like this recipe. It was very easy, but we thought the lime was too overpowering. It wasn't the flavor my family was looking for, but if you want citrus flavored fajitas, try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was pretty ordinary. I chose to add a habanero pepper after realizing it was kind of bland. Oy vey, that was a mistake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "this was an ok fajita, it lacked origionality"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momof2"
},
"reviewBody": "I will admit that I agree with some of the other reviewers that there is a very dominant lime taste to this. I did reduce the amount and it still was pretty strong. I might tinker around with this again....and see what happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "MKCRITES"
},
"reviewBody": "I don't know if I did something wrong, but the steak had a bitter taste. I marinated it for about 5 hours, maybe this made a difference. No one in my family would eat it. I will not try this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is awful. The lime is WAY overdone - the meat tastes like lime juice. I threw the whole thing out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CHRISB1022"
},
"reviewBody": "The meat tasted like lime, which did not excite anyone at my dinner table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esmee Williams"
},
"reviewBody": "Making fajitas from scratch is just as easy as using one of those fajita seasoning mixes. All the taste without the MSG. Made a believer out of me."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14668/steak-fajitas/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17504/world-cuisine/latin-american/mexican/main-dishes/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1220/world-cuisine/latin-american/mexican/main-dishes/fajitas/",
"name": "Fajita Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14668/steak-fajitas/",
"name": "Steak Fajitas"
}
}
]
}
}
, "about": [
]
}
]