				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Steamed Fish with Ginger"
,"datePublished": "2018-04-11T21:39:09.000-04:00"
,"dateModified": "2022-08-15T00:53:59.000-04:00"
,"author": [
{"@type": "Person"
,"name": "lenochka"
,"url": "https://www.allrecipes.com/cook/2347532"
}
]
,"description": "Ginger and soy sauce provide the main flavors for this quick-and-easy halibut recipe. Smoking hot oil is poured over the top of the fish before serving to provide flavor and crispness."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/MmPLjllaLTIyA09uzysiQIu5XVw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2408608-steamed-fish-with-ginger-KissMint-4x3-1-e3713d77e48e42819575724666b27f5e.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Steamed Fish with Ginger"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "109"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "361 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "73 mg"
,"fiberContent": "1 g"
,"proteinContent": "48 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "1908 mg"
,"sugarContent": "0 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound halibut fillet",
"1 teaspoon coarse sea salt or kosher salt",
"1 tablespoon minced fresh ginger",
"3 tablespoons thinly sliced green onion",
"1 tablespoon dark soy sauce",
"1 tablespoon light soy sauce",
"1 tablespoon peanut oil",
"2 teaspoons toasted sesame oil",
"0.25 cup lightly packed fresh cilantro sprigs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pat halibut dry with paper towels. Rub both sides of fillet with salt. Scatter the ginger over the top of the fish and place onto a heatproof ceramic dish."
} ,{
"@type": "HowToStep"
,"text": "Place into a bamboo steamer set over several inches of gently boiling water, and cover. Gently steam for 10 to 12 minutes."
} ,{
"@type": "HowToStep"
,"text": "Pour accumulated water out of the dish and sprinkle the fillet with green onion. Drizzle both soy sauces over the surface of the fish."
} ,{
"@type": "HowToStep"
,"text": "Heat peanut and sesame oils in a small skillet over medium-high heat until they begin to smoke. When the oil is hot, carefully pour on top of the halibut fillet. The very hot oil will cause the green onions and water on top of the fish to pop and spatter all over; be careful. Garnish with cilantro sprigs and serve immediately."
} ]
,"recipeYield": ["2"]
,"totalTime": "PT25M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ilovemykids99"
},
"reviewBody": "Loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill R"
},
"reviewBody": "First time making steamed fish. Usually Chinese Restaraunt's make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Engel"
},
"reviewBody": "I did not have a ceramic dish so I used a liner in the bamboo steamer and that worked just fine. Served it with coconut rice and bok choy sauteed with ginger, garlic and soy sauce. Just an excellent meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bananasinorbit"
},
"reviewBody": "Cooked for less time than recipe called for and was a bit over cooked. Very strong ginger taste. Overall tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Emma"
},
"reviewBody": "Incredible recipe, but so few reviews! It is fresh tasting, healthy, simple, yet exotic! My 1.25 lb. halibut fillet steamed in about 11 minutes. As others have noted, any firm fish would work well, as long as it is thick enough. Next time, cod! You MUST try this wonderful fish recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsia Hill"
},
"reviewBody": "Very easy. Used the recommendations of others about the steamer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raeincerritos"
},
"reviewBody": "Absolutely love this recipe and will make it again....next week! The halibut was so moist and tender. The only change I made was to mix the oils with the soy sauce and green onions bring it to a boil, removed and spooned it over the fish. I julienned the ginger as pictured and did not mince it as directed in the recipe. I used a vegetable steamer to steam the fish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "am808"
},
"reviewBody": "Living in an area with many good Chinese restaurants I love to eat good Chinese style steamed fish. Followed this recipe to the letter and it came out as good as I've had. Most of the restaurants I go to use cod or sea bass or my favorite mullet but I used what I had which was Tilapia and it tasted great. I noticed a number of caveats from reviewers about the hot oil but my steamer basket is quite deep so I had no problem with spatter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenchenko"
},
"reviewBody": "Very yummy, healthy and easy! It nails all my requirements so it's a do-over for me. My picky daughter loved it too. Only thing I would do differently is not leave the fish sitting in the extra sauce for long as the fish soaked it up and became too salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy Yabu"
},
"reviewBody": "Super simple and really tasty! Will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARENEOC"
},
"reviewBody": "Chinese New Year 2017. I needed to do a lot of the fish at the same time, so I put the rack in my large turkey roaster, covered it with foil, poked holes in the foil, and then put the fish (I used cod) on the foil. I sprinkled the fish with salt, pepper, and chopped ginger. Poured a little water into the space under the rack and covered the whole roaster with foil. Baked at 425 for about 20 minutes or a touch more - checked it at 15 minutes. Warmed the oils and soy sauce together as another reviewer had suggested and poured that over the cooked fish and scattered the sliced scallions and some toasted sesame seeds over all of it. Fish was perfect; very good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lynette_r"
},
"reviewBody": "This dish tasted great! I just didn't have enough space in my ceramic dish to fish my fish. Next time I will put a little water in the bottom of a large pan, cover it with a lid, and baking them in the oven. My whole family enjoyed this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenmar"
},
"reviewBody": "I served this at a family dinner and was quite pleased with the results. I followed most of the recipe as is although I used haddock (halibut is just too expensive) and I omitted the peanut oil. I also steamed from frozen using my brand new InstantPot pressure cooker just to test the \"steam from frozen\" function. Really happy with the results, very quick to prepare and easy. This will be a regular for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarnandspicecook"
},
"reviewBody": "Easy and delicious. I combined the soy sauces with double the sesame oil (since I didnot have peanut oil) and heated it in microwave before pouring over the steamed fish. It worked!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Leckie"
},
"reviewBody": "I make slight changes: tilapia, not halibut, only low sodium soy sauce, no peanut oil, no cilantro and no green onion. Most of these changes are due to what's in the kitchen at the time. I have made it exactly as the recipe (except using tilapia) and it is delicious. If you have the slightest stomach issues, this is a great recipe as it is very easy on your stomach and you will want to lick the plate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Florio"
},
"reviewBody": "I steamed the halibut for 7 minutes. Used olive oil instead of peanut and added some garlic. did't have cilantro but used parsley and it was wonderful. It was fast easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kelly"
},
"reviewBody": "This was very tasty! I didn't have peanut oil, so instead I sprinkled some crushed peanuts on the fish along with the ginger and it came out pretty well. Next time I might try microwaving it rather than steaming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SIMIBURTONS"
},
"reviewBody": "Great recipe! I did alter a bit - cooked in a bamboo steam basket lined with parchment paper (over the wok). Heated Grape seed oil and walnut oil and then added in the soy sauces and about a tablespoon of ponzu. Mix thoroughly! Poured directly over the fish. Garnished with green onion. So fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David West"
},
"reviewBody": "Great recipe, I pretty much followed the recipe but topped it with sautéed mung bean sprouts and garlic roasted asparagus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moramay Ramos"
},
"reviewBody": "delicious!! my kid hates fish but he loved this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KissMint"
},
"reviewBody": "Simple and delicious. I didn't use sesame oil. Still need to get the timing right, I like tender fish and not too cooked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal S"
},
"reviewBody": "As one who is very familiar with Chinese cooking, this is excellent and definitely 5 star worthy. Sea bass, Halibut, Cod or any type of white fish 1\" thick minimally will work well with this recipe.\n\nHow to determine if your fish is cooked: Use a fork to poke the flesh of the fish to see if it separates easily. It should be white and not translucent. When finished place the plate in the kitchen sink. (Why? Because when you pour hot oil over the fish, it will splatter all over). As an alternative for steaming, put fish on a plate on top of 2 green whole green onions. This will prop the fish up so air flows beneath it, put plastic wrap over the fish and then into the microwave oven. Microwave on high for about 5-6 minutes; check for doneness as noted above. Try serving with Stir Fried Snow Peas and Mushrooms from AR for a great low calorie, low carb dinner. Family loves this one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melody"
},
"reviewBody": "This was super easy and delicious. I piled ginger on a filet of tilapia, steamed in an electric steamer for 15 minutes (which was a bit too long) and per the suggestion of another reviewer I combined the soy sauce and the oil and then heated it before pouring over the fish. I did not have toasted sesame oil so I just used regular. I served this with a side of cellophane noodles stir fried with minced garlic, shredded carrots, scallions and mushrooms. This recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DHANO923"
},
"reviewBody": "This was great! I steamed the halibut in my bamboo steamer for about 12 minutes, then mixed the sauces and oils together and poured them over the fish, instead of heating the oil separately. I covered it again and let it steam for another 2 minutes. Served with rice and sauteed ong choy with shiitake mushrooms. Everyone asked for seconds! Definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "franny234"
},
"reviewBody": "I make this with swai, which is very cheap in the frozen section. I don't add any salt, as the shoyu (soy sauce) has plenty. Serve with brussel sprouts and brown rice to feel good about yourself and your day :) Always impressive for something that takes very little time &amp; effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "etali904"
},
"reviewBody": "Quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VIVNIDHI"
},
"reviewBody": "Maybe the fish but it was halibut!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lshettle"
},
"reviewBody": "Didnt think I would be able to, but I did it! Thanks to the ppl who commented before, I didnt have a steamer so I used their ideas, I was missing a couple ingredients so I tweaked it a bit.. but it was great! I impressed myself and now I want to try it for my friends. It was simple and easy and delish! So for anybody who is interested I couldnt find peanut oil so I steamed the onion, ginger, and cilantro all with the fish (used tilapia) that I seasoned with black pepper and salt, after it was done, I warmed the sesame and soy and poured it over the fish, Amazing and I ate with steamed broccoli and sweet potatoes..Thanks again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rebecca"
},
"reviewBody": "so easy. insanely good. i made this with thick (2.5-3 inch) wild cod fillets, which steamed for 12 minutes. (perhaps could have done them for 10, and let them sit, as they continued to cook afterwards and got a bit firm). did not have peanut oil, which was fine. also did 1 tb dark soy and 1 tb braggs amino acids. amazing, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dustin1977"
},
"reviewBody": "Amazing dish and very quick. Asparagus is a great side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany"
},
"reviewBody": "So glad I found this recipe -- my Chinese grandmother used to prepare fish this way, and it was always one of my favorite dishes in her repertoire. I took a page from her book and just microwaved the fish until it flaked nicely, and it still tasted wonderful :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Kao Shirley"
},
"reviewBody": "This really is a very authentic Asian style cooking of fish! Reminded me of my mom cooking in the kitchen when in was growing up...and she's aboutmas authentic as you get! Very tasty, my husband love, love , loved it! And it's a very healthy dish too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa A."
},
"reviewBody": "This recipe was so delicious! I can't wait to make it again. I used only light soy sauce since that was all I had and omitted the sea salt and the cilantro and it was still amazing. I think I'll be steaming fish a lot more now since this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jester3325"
},
"reviewBody": "This is a great quick meal. I used Cod, and omitted the salt (no need for it with the soy sauce), used only dark soy sauce (mixed with a pinch of sugar to tone down the saltiness), and used sunflower and flax seed oil as that is what I had on hand. I also put the green onion on the fish in the steamer. Served over brown rice with chopped cilantro and more chopped green onion...deee-lish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MGonzalez"
},
"reviewBody": "A great recipe to have. I did this without the peanut oil (could not find!) and just used regular soy sauce. My fish was dory. It came out quite nicely. The cilantro makes it awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ardys"
},
"reviewBody": "Pretty fish. Very nice and easy, too. The drippings that are captured on the plate under the fish are great to put on your rice at the table."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nakkeya"
},
"reviewBody": "Tasty. The cooking process was a little overwhelming for me. i will just bake it next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Chef Ka Lee"
},
"reviewBody": "Caution: First, steam fish, drain plate of water completely, then cut 2\" scallion lengthwise very thin, ginger likewise in 2\" long thin matchstick size and scatter over fish. Heat oil and pour over scallion, ginger, and fish. NOW pour on soy sauce. Pouring 400+ degree oil into water-based liquid is a recipe for disaster!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannalyn22"
},
"reviewBody": "Very simple and easy to make. Bought a bamboo steamer about 3 years ago and glad to put it to use where the first time I used it the meal came out amazing. I agree with the rest of the readers who said - No need for any changes! I paired this with Jasmine Rice and at the bottom of the steamer steamed, broccoli, asaparagus and red pepper (so there was sweet plus crunchy texture)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellbell"
},
"reviewBody": "The best fish I've had in a long time!! My husband doesn't care for fish but loved this!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anitarl"
},
"reviewBody": "I realize that my review isn't necessary to encourage others to try this recipe as the reviews so far are stellar. But, I need to say that my first attempt was such a hit with my family. My 16 yr old son even raved. And I wantto reiterate what several people have said, that this recipe is very flexible. I used only what I had on hand: Costco's frozen steelhead trout (thawed, of course,) sliced yellow onion, purslane instead of cilantro, and instead of light soy sauce, I used pomegranate balsamic vinegar. Oh, and I used a wok with a glass pyrex baking dish to steam it. I think using the balsamic vinegar cut the saltiness that some reviewers mentioned. Whatever I did worked brilliantly. I really think I could have served this dish in a four star restaurant and no one would have been wiser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerry...USA to NZ"
},
"reviewBody": "This was a gorgeous recipe and I have added it to our favorites!!! This would be a great meal for entertaining. We served with asian coleslaw and cilantro brown rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paige"
},
"reviewBody": "Outstanding - I had to improvise on the steaming option too but it turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pnina Loifer"
},
"reviewBody": "Wow, this is SUCH a tasty dish!!! I did almost exactly what the recipe said except I only had dark soy sauce so I doubled it, and no peanut oil, so I doubled the sesame oil. Also, I had no fresh cilantro on hand, so I used the dried version. The taste is indescribable, this is definitely a must try!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "somegoodsomenot"
},
"reviewBody": "Great! I put the sesame oil on the fish and soy sauce in with the oil instead of on the fish. next time, i'll put the green onions in the oil / soy sauce mix too, since the green onions didn't pop. easy too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yamsicle"
},
"reviewBody": "I am just learning to cook, and am always looking for restaurant quality experiences at home. I don't like to eat anything unless it's very flavourful, so no standard meat and potato meals for us! My husband and i found this to be scrumptious. I didn't find it too salty, perhaps because I used reduced salt soy sauce. I paired it with Spicy Bok Choy in Garlic Sauce, also from this site. It was the perfect complement. Will make this again soon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aerobigirl"
},
"reviewBody": "This had a really nice flavor. I read all of the reviews first and heated the oil and soy together to avoid the splattering. The one drawback in my opinion is that it was really salty. Rubbing both sides of the fish with kosher salt and then pouring soy over the finished fish was a little excessive. Maybe next time I'll salt only one side or verrrrrry lightly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dinner for breakfast"
},
"reviewBody": "This definitely tasted authentic to me. Very easy to make, and nice flavours. I don't have a bamboo steamer (or any other kind of steamer) so here is what I did- I filled the bottom of a large pot with water, then put a bowl in the water. Then I placed the plate with fish on it on the bowl (about 3cm above the water level) and put the lid on the pot. There you have it, the easiest home made steamer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chellebelle!"
},
"reviewBody": "Outstanding! This was a nice diversion from the normal lemon/salt/butter/pepper fish I normally make. The fresh ginger really makes it special. I probably could have done with a little more sliced onions but that's the only thing I would change. I broiled it since I didn't have a bamboo basket. This was terrific with rice and carrots. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "erinmccartan"
},
"reviewBody": "I heated the oil until it was just barely starting to smoke, because I was worried about setting off the fire alarm and waking my landlord (the alarm is sensitive). Still very yummy, though maybe less crispy, gave it 4 stars because I found it a tad salty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "belle ogden"
},
"reviewBody": "This was delicious! Used swai instead of halibut (cheaper, and much tastier IMO) Definitely a keeper, will be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xuan2"
},
"reviewBody": "I made this with Tilapia. My husband, who is not a fan of seafood (fish in particular), ate it AND complimented it. It was SO easy and so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamarwex"
},
"reviewBody": "This dish is easy and fabulous! My husband - who typically dislikes fish enjoyed it. I only had dark soy and I followed the other cooks suggestion of heating it with the oils. Definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alaskabetty"
},
"reviewBody": "Really delicious- my husband called it \"restaurant quality\" which is amazing considering my usual fish dishes are nothing special. I don't have a bamboo steamer so I instead used the colander insert of a pasta stockpot. My 1.4 lbs. of fish steamed perfectly in 14 minutes and maybe could have been pulled a touch earlier. This will definitely be added to our regular line up of recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolene"
},
"reviewBody": "Great recipe. I love to use swordfish instead of halibut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "THINKDIFFERENT25"
},
"reviewBody": "Wow. This was good and super easy. YUM. Definitely a company dish. The sizzling oil had a nice \"WOW\" effect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashlou"
},
"reviewBody": "Great recipe--I used cod and it tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EyeLean"
},
"reviewBody": "Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "Good, but takes a bit of talent to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dubdub"
},
"reviewBody": "Clean, fresh and delightful. Will make this recipe again, and again, and again. OK, this is an update 4 yrs after posting those first 2 sentences. I can't even count how many times we have made this recipe, it is top-shelf. My wife and I love fish, and do a fair amount of fishing. When we have fresh Walleye we rarely can bring ourselves to cook it any other way. It is such a refreshing way to eat quality fish like Walleye and Halibut. I always put the ginger on the fish before steaming it, and don't fuss with 2 different soy sauces, just use 2 tablespoons of my favorite. I usually pour the hot oil over the fish and onions in the kitchen so as not to splatter on the table. And it goes fabulous with jasmine or long grain white rice. Serving on warmed plates is also beneficial."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mylamybabies"
},
"reviewBody": "Excellent. So easy to make and so flavorful too. Everyone in my family ages 12 months to 33 yrs LOVED it. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Adam"
},
"reviewBody": "Heyo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BEADPM"
},
"reviewBody": "Beautiful recipe with any fish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cbprseven"
},
"reviewBody": "My family loved this!! I followed another reviewers advice and put my ceramic dish into a large covered skillet with water since I did not have a steamer. I also used two different types of sesame oil since I did not have peanut oil on hand. And I used regular onions in place of green onions. Even so, this dish was awesome!! It was quick and easy. Next time I will try to have the right things on hand to see if it tastes even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne C."
},
"reviewBody": "This was great. Instead of pouring heated oil over the fish at the end, I mixed it with the soy sauce warmed it (not to the point that it smoked) and poured it on once the fish was cooked. I hate it when oil splatters and this avoided that mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SWEETJAM"
},
"reviewBody": "Hmmm, I think I am the lone dissenter here, but I just thought this was ok. It was way to light for my taste. Thanks for sharing I have been wanting to try this for a long time. I think I will stick with my favorite halibut recipe from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa L"
},
"reviewBody": "A very easy and delicious way to prepare almost any fish. I had never steamed fish before and wow - it was very moist and so flavorful. For me, the peanut oil seemed unnecessary so I used only the sesame oil and only regular (low sodium) soy. This will become a staple for us! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GuitarChef"
},
"reviewBody": "A very tasty, easy-to-prepare dish with a knockout presentation.I served this on a bed of savoy cabbage and got raves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "foxyloxy"
},
"reviewBody": "A surprise hit with my two finicky sons and husband. Very simple and easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mich"
},
"reviewBody": "YUM!!! We tried something new for the Chinese New Year and it's now a favorite of ours. I left out the peanut oil because I didn't have it and it's still great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Urdinarrain"
},
"reviewBody": "This dish came out perfectly! I followed the recipe but used striped bass as I like a lighter fish. This was a hit at our Chinese New Year party this year. Will definitely do this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dory M Rowe-Carlson"
},
"reviewBody": "My husband licked his plate clean...literally. Did not change a thing (except how I steamed it without a steamer using various items found around the house. Will definately make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LosGatosMama"
},
"reviewBody": "This is so easy to make and tastes delicious. I didn't use the peanut oil due to food allergies - I just used more seasame oil. I wouldn't change a thing with this recipe. What a healthy, simple, quick dish. Even my picky 5 yr old devoured it and asked for 2nds. My 4 yr old who proclaimed he only will eat salmon also couldn't get enough and said, \"I guess I like halibut, too.\" For busy moms who are looking for a fresh, healthy, quick meal - put this one in your recipe box!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SwimWaters"
},
"reviewBody": "This was my most successful fish dish ever. And I tried it for the first time with company, who raved. I didn't have a steamer large enough to handle servings for 6. So, I improvised with a large, deep frying pan with 3\" water, an ovenproof ramekin in the center to support a Pyrex dish containing the fish and ginger above the water, and covering all with a lid. This worked pretty well. Fish was very tasty and juicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KENNY1299"
},
"reviewBody": "Quick, healthy, easy and tasty. Couldn't ask for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vaz007"
},
"reviewBody": "great recipe.I will be making this agian soon awesome flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jonandchris"
},
"reviewBody": "This is excellent. This recipe also works well with Chilean sea bass."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/140570/steamed-fish-with-ginger/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
"name": "Chinese"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/140570/steamed-fish-with-ginger/",
"name": "Steamed Fish with Ginger"
}
}
]
}
}
, "about": [
]
}
]