				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Stef&#39;s Whoopie Pies with Peanut Butter Frosting"
,"datePublished": "1998-07-11T11:35:25.000-04:00"
,"dateModified": "2023-01-20T21:31:43.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Stefanie Sierk"
,"url": "https://www.allrecipes.com/cook/24328396"
}
]
,"description": "This easy recipe for homemade whoopie pies with peanut butter frosting are perfect for a peanutty, chocolaty, cakey treat!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/iOB8HEJ9zBeILh6uiZD29h0qr8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/666275-stefs-whoopie-pies-with-peanut-butter-frosting-Dina-Foglio-Crowell-4x3-1-349c2ac248d84e769f225eed9ae24330.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Stef&#39;s Whoopie Pies with Peanut Butter Frosting"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "85"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "811 kcal"
,"carbohydrateContent": "107 g"
,"cholesterolContent": "120 mg"
,"fiberContent": "4 g"
,"proteinContent": "11 g"
,"saturatedFatContent": "23 g"
,"sodiumContent": "513 mg"
,"sugarContent": "70 g"
,"fatContent": "41 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.5 cup unsweetened cocoa powder",
"0.5 cup hot water",
"1 teaspoon vanilla extract",
"1 teaspoon baking soda",
"1 cup white sugar",
"1 cup butter",
"1 large egg",
"1 tablespoon butter",
"1.75 cups confectioners' sugar",
"0.25 cup peanut butter",
"0.5 cup milk" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Cream together 1 cup butter and egg. Add 1 cup white sugar, vanilla, and hot water. Stir in flour, cocoa, and baking soda and mix well."
} ,{
"@type": "HowToStep"
,"text": "Drop from a teaspoon onto cookie sheets and bake in the preheated oven for 10 to 12 minutes; set aside to cool."
} ,{
"@type": "HowToStep"
,"text": "To make peanut butter frosting: Blend 1 tablespoon butter and peanut butter together until smooth. Stir in confectioners&#39; sugar and add enough milk to make frosting soft enough to spread. Spread between the flat sides of two cookies and sandwich together. Repeat with remaining cookies."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First time I've ever creamed butter and egg first! I followed the recipe pretty close. Definitely need to tweak the wording for inexperienced bakers. Using a teaspoon doesn't mean making the drop a teaspoon sized! I used a cookie scoop and they turned out perfect. You also shouldn't use all the milk. You can get by by using about half and I piped it out of a plastic bag. Only bake them for 7-8 minutes, take out and finish baking on the sheet. They are a little dry, I think adding an extra egg may have helped. Overall, good recipe. Lots if fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sherriblanchard2020"
},
"reviewBody": "The cake part was a little dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "djbing2013"
},
"reviewBody": "Me and my girlfriend both tried this neither turned out well. For both the frosting and the cake. The frosting was super thin and watery, cake tasted awful, and i tried using 1 teaspoon and one table spoon at 375. Both engulfed my ove with spoke and turned out wayyyy burnt. The only way i figured it out was eyeballing it and putting them in for 5-8 mins tops. Besides that they were incredibly flat and there wasnt enough peanut butter i had to add more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There is no acid to activate the baking soda. Use baking powder for a puffy cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lemon head"
},
"reviewBody": "5 star review! I made them with my mother and they turned out great! We got stuck where we have to make the frosting but overall it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "Overall a good recipe, however made a few adjustments, added 1/2 cup hot coffee, and 1/3 cup of sour cream to the batter. Added a 1/2 cup of peanut butter and 2 1/2 cups powered sugar to the frosting to make it thicker and more peanut butter flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Hagopian"
},
"reviewBody": "If your cookies are flat, check that your baking soda is new or fresh. Test by adding a teaspoon-full to a half cup of hot water. If it doesn't bubble it's time to throw it out. -Julia Child"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ambrose Hill"
},
"reviewBody": "Turned out great! I did add some marshmallow fluff to the icing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "This recipe sounded so good I made can double batch! And I was not disappointed! I'll be sending these to my granddaughters in Raleigh. These mm at just become a new tradition in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "smurffie22"
},
"reviewBody": "Made a slight change to the amount of icing sugar and milk used. I used 1 1/4 cups of confectioners' sugar, and only enough milk to make a nice thick frosting consistency. otherwise I followed all other measurements, cooking times and temps. These were nice and fluffy and were a hit at the office."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "faby styles"
},
"reviewBody": "This recipe was simple and quick. The cake was moist and the cream filling was awesome. I used margarine instead of butter. The kids demolished them. I will make this recipe often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "calvin goddard"
},
"reviewBody": "ADDED PEANUT BUTTER,CUT MILK, TO MAKE THICKER FILLING"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Thostenson"
},
"reviewBody": "Turned out perfectly and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Baker667"
},
"reviewBody": "I would not use this recipe again for the following reasons:\nthe chocolate cookie part was as i just said, a cookie. it was too crispy, when it's supposed to be fluffy. \nThe icing is a whole other story. It was WAY to runny, making me have to add much more confectioners sugar than called for, making it way to sweet, not even able to taste the peanut butter! Not only was it to sweet, but the runniness also caused the cookie part to slide, creating a mess.\nI would definitely like to find a better recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "colleenfmiller"
},
"reviewBody": "The cake portion rose nicely and looked fine, but they were much drier than I would have liked. And the peanut butter frosting was too thin - I prefer mine to be very thick so it stays with the cookie portion and does not run at all. Normally I love Allrecipes - so I am going to try to tweak it a bit and then I think they'll be a better fit. I think I will add a higher fat content milk - either whole or half and half and cook less time on the cookie portion and less milk and maybe a bit more 10x for the frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Aimee"
},
"reviewBody": "The cook time was too long for my gas oven. I only cooked them for 8 minutes. One batch makes 20 mini whoopie pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tina4583"
},
"reviewBody": "2 stars for the idea. They tasted ok but the cookie part was extremely dry. I baked the first batch for 10 min and they were dry so I baked the second for 8 min to try to help fix the problem. The ones I cooked for 8 min were not as dry but fell apart when I picked them up. I would not make these again as written-might use the frosting but not the cookie part of the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were really easy to make and inexpensive. The peanut butter frosting was delicious and gets 5 stars. This was my first time eating whoopie pies and making whoopie pies. I thought they were good. It's not something I would make often but once in a while. They were kind of fun to put together too. My daughter liked helping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "I noticed a discrepancy in this recipe and the instructions. The recipe calls for one Tbsp. of butter in the cookie portion as well as the frosting portion but in Stef's instructions she calls for 1 cup of butter in the cookie portion. Because of this error and because of the negative feedback, I followed the recipe \"whoopie pies lll\" for the cookie part. The frosting part was delicious. Though I did cut back on the milk. It would have been too runny. Hope this helps!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michael Tallman"
},
"reviewBody": "For a 1st attempt it was good. Other reviews have commented on 1/2 cup of milk for the frosting being to much .... they are correct. I used 1/4 cup and it was a bit thin but not to bad.\n\nYes the cake was dry but I did not made uniform cakes and thus my baking times were a bit long so no suprise there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rhoda Malone"
},
"reviewBody": "The frosting is just horrid and doesn't work for a whoopie pie at all. The cake cookies are edible but the flavor lacks. Instead of reworking the recipe, I'll keep looking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margie123"
},
"reviewBody": "The chocolate whoopee pies came out perfect, but my oven runs hotter so I cooked maybe for 8-9 minutes. For the peanut butter filling, I didn't use as much milk. maybe half and put in more confectioner sugar. maybe another 1/2 - 1 cup. didn't really measure and a little more peanut butter for taste. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LinvilleLion"
},
"reviewBody": "Let's be clear, whoopie pies are from either Lancaster county (Pa Dutch) or Maine. The pies from Maine have a distinctly different filling. Better is all about taste preference. I prefer the Pa Dutch style better. Who was first is another debate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorna"
},
"reviewBody": "Great recipe, and I utilized TRELLA72's suggestion of using a quality Devil's food box mix (thank you! I was in a hurry!). I followed the box instructions, reducing the water to 3/4 C. I used a 1\" disher to scoop the dough onto parchment, then baked for 10 minutes. For the filling I reduced the powdered sugar to 1 C (was too sweet with another 1/2 C), increased the peanut butter to 1/2 C (I LOVE PB) and didn't use quite the whole 1/2 C milk. Thanks for the start of a lifelong love affair with PB Whoopie pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Violet's Kitchen"
},
"reviewBody": "We followed the recipe and made no substitutions. The frosting didn't have a fluffy consistency. I used all the confectioners sugar and a little bit of the milk. Does anyone know how to make the Peanut Butter frosting fluffy? My daughter said that the frosting tasted delicious and similar to another snack called Puppy Chow. I used a Whoopie Pie pan and baked according to the directions. Our pies fell apart, yet tasted good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Hay"
},
"reviewBody": "My family isn't a huge whoopee pie fan but they loved these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Very easy to make. They came out nicely shaped and yummy tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline Wingerd"
},
"reviewBody": "I made this for my neighborhood cookout, but when I went to make the peanut butter frosting, there was waaaayyyyy to much milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Riley B. Hagel"
},
"reviewBody": "I found that the frosting lacked the usual \"oomph\" that whoopsie pie fillings normally have, so I added about a half a block of softened cream cheese to the mixture. It made it creamier, less sweet, and a little fluffier! Perfecto!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mango13"
},
"reviewBody": "I ended up splitting the recipe in half, which I think may altered it a bit negatively. But in the end, it was still good! Just I think I may have messed up the cookie part, but the cream was perfect. I also added extra peanut butter in order to have the mixture not so sweet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dragoncake"
},
"reviewBody": "tasted like eggs and frosting is liquidly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmc"
},
"reviewBody": "I just used the filling recipe on this and it is great. I did what another reviewer said and used a cake mix. All you have to do is use 1/2 cup of water and 1/2 cup of oil and 3 eggs. Beat for 1 minute and drop by Tbsp onto sprayed cookie sheet. Bake 11 minutes. They turn out perfect. Just the right size and consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hwag17"
},
"reviewBody": "I just made a batch of these and it's my first baking failure. I can follow directions, so I'm assuming it the recipe. The cakes were so dry and the filling was bland. I definitely would not recommend this recipe to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thatspaingirl"
},
"reviewBody": "WE LOVED this recipe!!!! I did take in consideration some of the other reviews and to keep them from being so flat I put in a tablespoon of baking powder. I also used an icecream scoop for scooping and got 12 cookies which makes 6 sandwiches. Also when I made the icing I put it in the freezer for 10 minutes but I live in florida and the humidity is so high that frosting just wants to melt as soon as you make it. It helped though to give it that same look as the picture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "someday139"
},
"reviewBody": "First time making these pies!! Not really my kind of sweets but my hubby requested them!! The cake part even on the minimum cook time was a little drier than I thought they should be, but over all they were great!! Filling was awesome and I DID add extra peanut butter like others suggested!! Hubby LOVED them so that's all that mattered!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "M"
},
"reviewBody": "The filling is like a sour paste and the cake/cookie part is ok but very dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "youmama"
},
"reviewBody": "Everybody LOVE this pies! All ingredients are in my pantry so anytime I am hungry for this I can make them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maryann Dekens"
},
"reviewBody": "Loved these, but sweet,sweet,sweet! Next time I'll fill them with a different cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "abermundo"
},
"reviewBody": "good but too sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "adaylia"
},
"reviewBody": "They were tasty and I enjoyed them. However, I found that dropping them by the teaspoon-ful made cookies that were a bit small. And they didn't flatten down like whoopie pies are supposed to as they baked. They just baked in a big clump, so even though they still tasted good, they were a bit awkward for eating. Maybe I did something wrong with the recipe. For the second batch I made them bigger and flattened them with a spoon before baking and they turned out great. Yummy overall though :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "purdueaoii"
},
"reviewBody": "You don't even need close to 1/2C milk or the frosting gets too runny. And it mostly tastes like sugar, not peanut butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shkoda"
},
"reviewBody": "These Whoopie Pies are AMAZING!!!!!! Others have been commenting on how dry it was. Sure, it was maybe a little dry, but if you don't eat it plainly, you wont even notice. The whoopie pies come off the baking sheet just like that. At first when i was putting the mixture onto the baking sheet, i was worried that it wouldn't come off. but to my relief it came of as if though it were fake. i have made these many times, each time making it differently, and everyone loved them each time. thank you so much for this recipe. if i could, i would definitely rate more stars for this!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GAIL1952"
},
"reviewBody": "I made these for a birthday party &amp; must say they were better than the bakery birthday cake! I baked the cookies for 10 minutes to keep them from drying out &amp; then added 1/4 cup more peanut butter to the filling to give it a bit more flavor. Definitely a keeper! Thanks Stef!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma <3"
},
"reviewBody": "I really really liked the icing ;) but the cakes were almost as flat as the sheet!!! they looked like chocolate potato chips! the taste was pretty good but the appearence was unbearable. it may have just been my lack of skills, being my first time making these, but i give it a 4 star!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cezeigler"
},
"reviewBody": "This is the first negative review I have written on the site: These turned out flatter than pancakes and by using a teaspoon to measure, I got 45 very small cookies. I didn't have an issue w/ dryness. I changed the second batch before it went it and this seemed to help, so this is what I would suggest: add 1 tsp. baking powder as well to the batter, add about 1/4 c. extra cocoa powder for a more chocolately taste and bake for only 6 minutes. Measure with a larger spoon, too. Hope this helps some of you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bailee Saurus"
},
"reviewBody": "I was not happy with these. The cakes were too dry, and they did not spread out as they baked; they stayed small and stiff. The taste was mediocre. The frosting was a disaster; I have no idea why it calls for 1/2 a cup of milk when you could never need that much. I only used about 1/4 cup and it was waaaaaaay too much; I had to add another 2-3 cups of sugar to make it thicker, and it was still runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "staceyb"
},
"reviewBody": "These were awesome, the only thing I changed was I added another 1/4 cup of peanut butter to the filling to have more of peanut butter flavor. Excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Candace Parr"
},
"reviewBody": "Fabulous whoopie pies. After reading the reviews, and noting that several people had mentioned the dryness of the cakes and the sweetness of the icing, I tried the following: 1 cup of powdered sugar instead of 1 3/4 cooking the cakes the minimum time listed The cakes were moist and delicious. The icing was peanut buttery goodness and not too sweet Yummmm!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "corndogmcp"
},
"reviewBody": "Because so many other reviewers said that the cookie portion of this recipe was waaaay too dry, I opted to make the cookie from \"Whoopie Pies III\" from this site. I used those cookies and the filling from this recipe, so this review is only for the filling. The taste and texture were good, but it was entirely too sweet for me. I could hardly eat one it was too much. The recipe is aptly named with \"frosting\" in the title because that is exactly what it is. If I decide to make whoopie pies again, I'd probably fill them with some sort of whipped cream-based filling. I'd be curious to try a peanut butter flavored whipped cream instead of this frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jmpn"
},
"reviewBody": "Tasted great, but mine were very flat.. put them in the fridge and it helped a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marty"
},
"reviewBody": "I found the cake part dry, after wasteing a cup of real butter. I had much better result using a cake mix and reducing the water to 3/4 cup. The frosting was great though and I will use that many times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetobake"
},
"reviewBody": "Excellent. I did not change anything about the recipe. These taste a lot like those new Oreo cakesters, just less greasy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoagie"
},
"reviewBody": "I only used the P/B frosting recipe, FIRST P/B frosting I loved!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "higgipop"
},
"reviewBody": "Just made these and the cake did not rise at all. The filling was very sweet. My 8 year old wouldn't finish one, but my husband thought they were okay."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "I found the whoopie pies to be very soft so much so that they fell apart when handled. After a few did this I put them in the refrigerator to harden up in the hope that they would be more managable. The flavor was just OK and they did not puff up when baked so they were more of a flat cookie. I don't know if I did something wrong or not but I followed the recipe exactly and didn't find these to be very successful. I would not try this again. The filling was tasty so I might use this with another whoopie pie recipe since I favor the peanut butter filling over the white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen D'Orsay Smith"
},
"reviewBody": "These are DELICIOUS!! I know that these will last only a day or two in my house! My daughter went crazy for these the second I put one in front of her. I didn't think they were too dry at all. Very moist and the peanut butter frosting is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "~*Ashley*~"
},
"reviewBody": "SUPER delicious!! Very soft, moist and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "Perfect recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanMcD"
},
"reviewBody": "Just when you thought whoopie pies couldn't get any better!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "cookies- average\nicing- did not care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "The person who said they are too dry, they are sappose to be they are like a cake. They where wounderful I will deffinitly make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Wendy"
},
"reviewBody": "very easy recipe to follow, cookie WAY WAY, TOO DRY!!, the filling was a good starting poit, however I like a bit more peanut butter taste I will not make this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRELLA72"
},
"reviewBody": "Hi all! This is a SUPER idea! EXCELLENT recipe. Instead of making the \"chocolate cake mix\" I actually had a Duncan Hines Moist Deluxe Devils food cake mix that I had to use up so I used that but cut the water down to 1 Cup rather than the 1 1/3 it calls for. Mixture was thick enough to make really nice tablespoon \"plops\". Thank you, Stef, for such a quick and fun recipe!\n\nJust need to add a bit of info --- I made these for our Church potluck farewall luncheon for our Athletes in Action Baseball team. They were a HUGE hit!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Liz Funke"
},
"reviewBody": "Fabulous creamy peanut butter filling, but the cake portion is too dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FONDUE79"
},
"reviewBody": "These were very good, my husband and daughter loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Dry, dry, dry. Not at all like the moist whoopie pies I remember from childhood. I will be more careful about recipes I try from this site from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These Whoopie Pies are out of this world!! Stef - you're such a good cook!! Love, MOM"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "As a child I enjoyed whoopie pies, but this recipe is \"top shelf\". They didn't last long once they were out of the oven. A big hit with everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this whoopie pie recipe because it does not have shortening as a main ingredient for the filling, and therefore a much more tasty and more nutritous treat."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/10994/stefs-whoopie-pies-with-peanut-butter-frosting/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16417/desserts/cookies/whoopie-pies/",
"name": "Whoopie Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/10994/stefs-whoopie-pies-with-peanut-butter-frosting/",
"name": "Stef&#39;s Whoopie Pies with Peanut Butter Frosting"
}
}
]
}
}
, "about": [
]
}
]