				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sticky Buns"
,"datePublished": "1999-03-19T16:52:48.000-05:00"
,"dateModified": "2022-08-04T10:03:43.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MARBALET"
,"url": "https://www.allrecipes.com/cook/39277"
}
]
,"description": "A delicate sweet dough that&#39;s topped with a gooey mixture of pecans, cinnamon and brown sugar."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/GhY0-qEffs6WwCIZWXDw0fRdYTc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2638654-45b0d6bb8a5547e99195597ea1cfce04.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sticky Buns"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "73"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "488 kcal"
,"carbohydrateContent": "71 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "3 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "586 mg"
,"sugarContent": "23 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 (.25 ounce) packages active dry yeast",
"0.5 cup warm water (110 degrees F/45 degrees C)",
"1.25 cups buttermilk, room temperature",
"2 eggs",
"5.5 cups unbleached all-purpose flour, divided",
"0.25 cup butter, softened",
"0.25 cup white sugar",
"2 teaspoons baking powder",
"2 teaspoons salt",
"2 tablespoons butter, softened",
"0.5 cup white sugar",
"2 teaspoons ground cinnamon",
"0.5 cup butter, melted",
"0.5 cup packed brown sugar",
"0.33333334326744 cup raisins",
"0.66666668653488 cup chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Combine the yeast mixture with the buttermilk, eggs, 2 1/2 cups flour, 1/4 cup softened butter, 1/4 cup sugar, baking powder and salt; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. Dough should remain soft and slightly sticky. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes."
} ,{
"@type": "HowToStep"
,"text": "Divide dough in half and roll each half into a 12x7 inch rectangle. Spread each half with 1 tablespoon softened butter and sprinkle with 1/4 cup sugar and 1 teaspoon cinnamon. Roll up halves, beginning at wide side. Seal well by pinching the seams. Cut each roll into 12 slices."
} ,{
"@type": "HowToStep"
,"text": "Coat two 9 inch round cake pans each with 1/4 cup melted butter, 1/4 cup brown sugar, 2 tablespoons raisins and 1/2 cup chopped pecans. Place 12 dough slices in each pan, leaving a small space between slices. Cover and let rise until doubled."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake in a preheated oven for about 30 minutes. Invert pans onto plates and serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT100M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really liked it! I gave it a 4 because I'd prefer more glaze or even a frosting. I used a bundt cake pan with rolls on the bottom and then I cut smaller pieces to form more of a pull apart bread. I layered some pecans between. I prepared it the night before and took it out 4 hours prior to baking to rise. I had enough dough to make a small 9 in round pan as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gasuser"
},
"reviewBody": "Forgot the egg but they were great anyway. Made a half recipe!! Used the proof on my oven and they only needed 45 min to rise"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stephanie H"
},
"reviewBody": "These came out ok, they were pretty dry and not as ooey gooey as I’d hoped. Next time I would definitely add more butter/sugar inside and a lot more in the bottom of the pan. We had to make an icing to go on top since there wasn’t enough topping"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sadiebea"
},
"reviewBody": "They turned out amazing! I added another rise before i rolled out the dough. Doubled the brown sugar/pecan mixture. It was the perfect amount. Baked them all in a 9x13 instead of 2 pans. Will make these again! I couldn’t find buttermilk so I added a tablespoon of lemon juice to the milk and let it sit for a bit. Worked out fine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Bell"
},
"reviewBody": "Made these and the family loved them, awesome recipe, I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elle"
},
"reviewBody": "These are really simple and yummy. The roll recipe is a good one with a nice light, but not too “fluffy”, dough.\nNext time I will double the amount of butter and sugar for the bottom of the pan. And maybe use brown sugar instead of white inside the roll. These could have a bit more “stuff”."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandra H"
},
"reviewBody": "Need to double the sugar and cinnamon along with the topping . But the bread portion is really light and fluffy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RHo816"
},
"reviewBody": "Great recipe! I let the dough rise for 3 hours. Double the topping for sure. Or add an icing at the end! Use foil for the pans for easy clean up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef Paul Davis"
},
"reviewBody": "loved it it turned out well thankyou sorry no pic they went to fast"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Whitesell"
},
"reviewBody": "Happy National Sticky Bun Day everyone! Made these this morning and I love the roll part; they're soft and fluffy and have a great flavor. This is the first time I've made sticky buns but I have made homemade cinnamon rolls and they're almost the same thing. That being said, I will be using this recipe for my cinnamon rolls and sticky buns dough part from now on. As for the filling and the topping, I did double both and it worked well for the filling but the topping isn't quite right. There's too much butter flavor and not enough gooey sticky stuff. \n\nFYI I halved this, subbed soured milk (milk + lemon juice) for the buttermilk, and made in my pyrex 11x17 pan. I did need some extra flour, but I'm learning that the amount of flour required in dough recipes fluctuates so expected as much. I used my oven as a proofer as advised in other reviews and they rose beautifully in 30 minutes. My bake time was just 20 minutes.\n\nBasically, I'd say the roll part is a 5 star recipe but the filling and topping aren't awesome so I split the difference and went with 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Parisi"
},
"reviewBody": "This by far is the best Sticky Bun ever"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEdwards77"
},
"reviewBody": "Our family just moved to Virginia a couple months ago. Our house had pecan trees so we've been making ALL the recipes I deemed too expensive when I had to buy pecans. Now we just gather them up by the bushel! This recipe will be going into regular rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley"
},
"reviewBody": "I mixed by hand. I’m relatively new to dough making, but they came out great and was very delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Disappointing. Proofing an oven to make it rise worked, but you need to cut down the time on actually cooking it it came out somewhat hard and brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "winstonvonstout"
},
"reviewBody": "The dough is wonderful! It will be my go to dough for sweet rolls. It has excellent flavor and consistency. I used the quick method of proofing in the oven.\n\nI followed directions. but the pecan topping came out granular - not gooey at all. Too bad! Next time I'll heat it in a sauce pan first to dissolve the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The dough is wonderful! It will be my go to dough for sweet rolls. It has excellent flavor and consistency. I used the quick method of proofing in the oven.\n\nI followed directions. but the pecan topping came out granular - not gooey at all. Too bad! Next time I'll heat it in a sauce pan first to dissolve the sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "georgia"
},
"reviewBody": "Next time I would use more brown sugar, butter and nuts in the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean N Shannon Goss"
},
"reviewBody": "Made these with my daughters, so easy! We let the dough rise for about 15 minutes before rolling and cutting. I am not a fan of super thick breads and these were the fluffiest and lightest rolls I had ever made! Thank you for the Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tod Williams"
},
"reviewBody": "Made it just like the recipe. NOT sticky buns! These are just cinnamon rolls with pecan topping. Not even GOOD pecan topping. Nothing special at all. Dry and boring. Not gooey and sticky and dripping with goo like sticky buns are supposed to be. Honestly-- This is NOT a recipe for sticky buns... just a recipe for simple home-made rolls. Will NOT make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tescamz"
},
"reviewBody": "Very soft and delicious, I added honey to the brown sugar and nuts on the bottom and it was delicious!!!! Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryce Blackford"
},
"reviewBody": "My yeast didn't turn creamy, my dough accepted about a cup less dough than the recipe called for, and it seemed really heavy and unforgiving when I was rolling it out. I had my doubts that it would rise, but it did. And the results were very good! So....all in all a mixed review, but I can't argue with the results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenbrash"
},
"reviewBody": "These sticky buns were delicious and not too hard to make. I didn't have buttermilk so I added 1 Tbs of vinegar and they still came out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaAng"
},
"reviewBody": "Absolutely delicious!! Didn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ina"
},
"reviewBody": "I made these and they tasted good but I would suggest a few tweaks. I would roll the dough out larger so you can have more cinnamon swirls in the roll, add more butter and cinnamon to the centre. \nI doubled the sticky topping like suggested but found it still wasn't enough. Also once the buns started to cool the sticky topping got very hard and the rolls were too hard to eat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslee Moore"
},
"reviewBody": "Nervous nelly here... got my very first kitchen aid for xmas (I am 60 lol@) and I have picked this recipe to begin with! I see others have tried it and it works out well... wish me luck. I have one question, can I make these and before baking, freeze them? If not is there a stage I can freeze them? I have out of town guests coming and I would like to make ahead and take out the night before to thaw and bake in the AM... will that work? help!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "Absolutely make again. Taste just like my mother used to make a long time ago. They DO NOT need icing. In fact icing ruins the cinnamon taste and over powers to buns. I used a little more butter and brown sugar when coating the pan. There are only two of us so I halved recipe and froze what we did not eat. Next day I cut in half, buttered two sides and toast in frying pan. I am 77 years old and this is the best recipe I've found for cinnamon buns. Never buy store made. They are terrible. Its funny how you never loose the taste of certain foods you ate as a child. Oh well I guess I'm just in my second childhood. Enjoy your sticky buns"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "I made this. Followed recipe, except cut in half because full recipe was too much for family of 3. Kneaded dough for 8 mins and it was still super sticky, so my husband whose worked at a pizza shop before, suggested it definitely needed more flour, I'd say we added atleast a half cup to full cup of flour to make it manageable. Im my new oven 30 mins and the outside/tops were a little too done, but not burnt. The gooey stuff should've been melted on stove before adding to pans to smooth out brown sugar, I'm not sure double would be needed but maybe to get everywhere top and bottom. I'm a stay at home mom and use Allrecipes for all my recipes, but this one needs work. Don't suggest this,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelly Scofield"
},
"reviewBody": "Excellent recipe. Mine cooked in half the time. I used half the amount of salt, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VRoth"
},
"reviewBody": "I halved the recipe in order to make only one pan and also doubled the topping (1/2 cup butter, 1/2 brown sugar, 1 cup pecans) and omitted the raisins. These were perfect and the dough was easy to work with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael & Emilee"
},
"reviewBody": "They are great, the reason I am 4/5 on it is they need a little more butter/sugar between the rolls. A simple fix, I will just add more next time. I also found the 30 minute cook time to be a bit to long, I think 25-28 would have been better. Other than than they are fantastic, I am glad I read about proofing my oven. It made the world of a difference in the rise time. I will use this again and continue to tweak it until I am happy, like any recipe it is a base to get you started."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia O'Hara"
},
"reviewBody": "This was easy to make and absolutely delicious! Reminded me of my childhood days when my mom would make sticky buns! Tasted almost as good as hers. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lalelei"
},
"reviewBody": "So yummy! The dough was super fluffy, and the cinnamon-sugar between the layers was just right. The only thing I'll change next time is doubling the butter/sugar on the bottom (if you want a caramel glaze like in the thumbnail you'll have to) and cooking at 350F or lower. I checked 20 minutes in and the tops were starting to burn so I turned off the oven for the last 10 minutes. To be fair, I may have just let them rise too much (if such a thing is possible!) cause they were sticking up all over the place by the time I put them in. They were super delicious as-is, but better with frosting or maple syrup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lori Pensel"
},
"reviewBody": "Great recipe! They really rise good! The only thing is that even with doubling the filling and the \"goo\" there was not enough. Next time I will at least triple if not quadruple both. The addition of vanilla is awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Mans Clan"
},
"reviewBody": "This turned out great using my kitchen aid mixer and following the suggestion of \"proofing\" my oven at 350 degrees for 2 min. turning it off and then letting the rolls rise in the warm environment. Made the process much faster as my kids were anxious for thier new treat. Excellent and yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yehudis"
},
"reviewBody": "These were delicious! I got rave reviews. I used margarine instead of butter and substituted the buttermilk for milk + lemon juice. I also added vanilla sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunny"
},
"reviewBody": "These turned out awesome and we do not have much luck with dough in our house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ibcookin"
},
"reviewBody": "I'm going to try these, however, I noticed that everybody is waiting for hours to rise. As a pastry chef, use your oven as a proofing oven. Turn it on, knob or setting at 350, for two minutes, just to get the oven warm. Then turn it off. Rise your rolls in the oven. You'll find that your rolls will rise in about 20 - 30 minutes. I'll review the recipe later when I try it. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Purple Baker"
},
"reviewBody": "These were delicious! I halved the recipe and made them in a bread machine. I shaped them and refrigerated the rolls over night. They didn't rise as high I as would have liked, but I cut wider and shorter rolls and got 12, which I fit into a 12x9\" pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family enjoyed and asked me to make again. Made as written. The only thing I forgot to do was put a cookie sheet under the cake pans. Had burnt sugar all over the bottom of my oven. But that was my own fault. I was just so mad at myself. Will do next time I make these and I will make again. This is a GREAT recipe! Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ryan Sharp"
},
"reviewBody": "I'm a beginning cook, and this recipe is written well and has turned out great for me 5 times. Thanks, Marbalet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tiffany"
},
"reviewBody": "Very good and fluffy! Next time I think I will double the topping, I like them more gooey!!! Will make again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shae's Mama"
},
"reviewBody": "OMG ~ these are dangerous...my family loved them! Made them the night before since I knew I wouldn't be able to in the morning in time for breakfast. I let the dough rise in warm place for about 1 1/2 hours which seemed fine. Then I covered them with foil and put in the frig until ready to bake in the morning...worked out great. Only needed to bake in my oven 25 minutes. Used a knife to loosen the edges before inverting onto plates. Will double the brown sugar &amp; butter topping next time as other reviewers suggest. Will also cut recipe in half next time, since two pans was much too much for my family of 3. ~ Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "johndwaugh"
},
"reviewBody": "very tasty, but felt like it took longer to prep..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BigDRob"
},
"reviewBody": "very good, kids loved 'em"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLynn04"
},
"reviewBody": "This was my first time working with yeast and making a dough. I was a little nervous but everything turned out great! It is a wonderful dough, easy to work with as well as delicious. If I make these again (which I probably will) I might add a little less butter IN the rolls as a lot of the butter oozed out when rolling the dough up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jillian"
},
"reviewBody": "Wow!!! This is a great recipe! The dough is so easy to work with - I didn't change a thing. It's basically a cinnamon roll if you don't add the nuts/raisns/melted butter&amp; brown sugar in the bottom of the pan. If you do, then it's a sticky bun. I doubled the mixture for the inside and I doubled the \"sticky bun\" bottom of the pan mixture. The rising part takes about 3-4 hours, so cover these with a dish cloth and be patient. While these were baking in the oven I made an icing as if these need any more sweetness, but I just couldn't resist because I was sending these to work with my husband : 3 oz. cream cheese softened, 1 Tbsp butter softened or butter flavored shortening, 1 &amp; 1/2 cups confectioners' sugar, 1/2 tsp. vanilla, 2 Tbsp. milk. Add all the ingredients together and add the milk gradually untill you get the desired consistency. Spread the icing over the sticky buns or cinnamons rolls while they are still warm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "landed"
},
"reviewBody": "These were good and it was quick and easy for homemade bread dough ( I didn't add raisins or nuts due to picky kids). I didn't wait for the buns to double in size before baking though I did let them sit for about 10 minutes and they turned out fine. I do prefer to just use store bought bread dough when making sticky buns but I had none on hand. I also used sour milk (milk and vinegar because I didn't have buttermilk)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "I love baking!"
},
"reviewBody": "The dough was quick and easy to work with. I would have to make more of the filling and topping next time. In the pan specified, it cam out more like a coffee cake. I also made an icing to drizzle on top, once slightly cooled. It tasted so good with the icing. I will make again, but with some modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GARSKESD"
},
"reviewBody": "I have made these 3 times within 1 week! They are so good! The dough is easy to work with and makes for a very tender roll...only change I made is extra butter and brown sugar to make more gooey stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Good recipe, with a rather soft dough...they where a hit when I served them to friends with Tea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babiebite"
},
"reviewBody": "These are great. Tatse almost like my mom use to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "~TxCin~ILove2Ck"
},
"reviewBody": "I didn't make the dough, I used crescentr rolls flattened out instead but used the filling and directions. I didn't use the round cake pans I used a larger rectangle dish so when they were done it was harder to invert them as I had to find a tray the right size and cover it with parchment paper. They didn't come out of the pan as pretty and it would have been a lot easier and more presentable looking if I had used the two round cake pans instead. I should have just followed directions! I was trying to keep from dirtying \"another dish\". DH loved these sticky buns and they were just what he was craving in a hurry. Next time I will make the dough from scratch, but yeah these were really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "This really is a light sweet dough, just a little \"biscuity\" texture I'm guessing from the all-purp. flour. Took about 3 hours from start to finish cause I let it rise plenty. Very easy dough to work with; I just topped them with Pillsbury Whipped White icing. I also had enough dough left over to make a dozen \"cinnamon knots\" which only had to bake 10 minutes. Delicious! Next time I will probably double the filling!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WILLOWDANCE"
},
"reviewBody": "Wow, were these good! I used instant yeast and added chopped apple to the filling. As soon as they came out of the oven I poured a simple glaze over them. I'll be sending this recipe to my sister!! Thanks for the great recipe Holly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mothero1"
},
"reviewBody": "I made the recipe for the dough and mixed it with a recipe from my sister in law for the cinnamon filling and topping (bottom). I have to say that it was a FANTASTIC dough recipe and I really enjoyed it. You defintely have to be patient and make sure you let it rise thoroughly. I'm going to try cutting it in half today. Hopefully they'll turn out just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie C."
},
"reviewBody": "I used this to make monkey bread and it was absolutly perfect! It took me longer than the recipe said, but it was SO GOOD!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "christinasbakery"
},
"reviewBody": "i made these for a charity bake sale and they were a huge hit! not too difficult to make and tasted just like the kind you get at the bakery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The only thing that changed about the recipe is the use of Rapid rise yeast and a frosting for the buns when they were done. Other then that this was an awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Should have waited longer for them to rise."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21831/sticky-buns/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/156/bread/",
"name": "Bread"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21831/sticky-buns/",
"name": "Sticky Buns"
}
}
]
}
}
, "about": [
]
}
]