				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Strawberry Torte"
,"datePublished": "1998-04-15T20:56:08.000-04:00"
,"dateModified": "2022-07-14T17:49:18.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Star Pooley"
,"url": "https://www.allrecipes.com/cook/26842771"
}
]
,"description": "This strawberry torte with ladyfinger cookies, a luscious creamy filling, and a homemade strawberry sauce makes an easy yet elegant dessert!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Ei4RXYu8mhxzOWCGu0YUG5O2Nto=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/640860-444496123ab540d182b530630a71d8f9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Strawberry Torte"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "245"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "514 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "207 mg"
,"fiberContent": "1 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "175 mg"
,"sugarContent": "20 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"11 ounces cream cheese, softened",
"0.75 cup white sugar",
"2 teaspoons vanilla extract",
"1 pint heavy whipping cream",
"2 (12 ounce) packages ladyfinger cookies",
"1 (16 ounce) package frozen strawberries",
"1 tablespoon cornstarch" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Strain strawberries and set aside, reserving juices. In a saucepan bring cornstarch and strawberry juice to a gentle boil. Remove from heat and let cool."
} ,{
"@type": "HowToStep"
,"text": "Whip cream cheese, sugar, and vanilla together in a large bowl."
} ,{
"@type": "HowToStep"
,"text": "In a separate bowl beat whipping cream until stiff peaks form. Fold whipped cream into cream cheese mixture."
} ,{
"@type": "HowToStep"
,"text": "Arrange ladyfingers around the sides and bottom of an 8-inch springform pan, standing ladyfingers lengthwise around the sides of the pan. Pour 1/2 of the filling into the pan, then arrange a layer of ladyfingers on top of the filling. Pour remaining filling over ladyfingers."
} ,{
"@type": "HowToStep"
,"text": "Spread strawberry sauce over top of cake and arrange whole strawberries on top. Refrigerate overnight until thoroughly chilled."
} ,{
"@type": "HowToStep"
,"text": "Remove from pan to serve."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT515M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MORANFOUR"
},
"reviewBody": "Cream mix is perfection! Layered lady fingers, thick layer of lightly sweetened fresh strawberries, and the cream mix. Filled a 10\" springform. Topped with white chocolate dipped strawberries and stabilized whipped cream. Italian filo cookies from Aldi on the edge provided a bit of sweet crunch. This is so adaptable and a great WOW factor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made a few changes because of various shopping issues. My frozen strawberries had no juice! So i got a strawberry glaze. I didnt get enough ladyfingers so no middle layer of them. Middle layer i just used glaze and fresh strawberries. I also used part strawberry cream cheese and part regular. This was a hit!!! My husband said best cake hes ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Only change my daughter Brandy and I made was we used strawberry cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Simmons"
},
"reviewBody": "I loved it!!! My version was a strawberry/rhubarb. I made more filling so I had 2 layers - more flavor! Here is the recipe for the filling......."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jboggio"
},
"reviewBody": "I cooked the full bag of strawberries down as others suggested and layered it in the middle of the cake. Used the firm ladyfingers to make a prettier presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Family loved it! I put fresh strawberries in food processor with juice &amp; sugar (saving the best whole berries for top) &amp; put in pan with corn starch. Added half of berry mixture in middle layer too. My brother thought I got torte at bakery! So yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luann"
},
"reviewBody": "I had to use vanilla wafers and I used a pie plate with wax paper. It was so good. Not too sweet. Next time I may use fresh strawberries. Will make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather DeCarlo"
},
"reviewBody": "I used a strawberry glaze instead of cooking down the strawberries which I'm sure was a lot easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gram ma"
},
"reviewBody": "Made this recipe years ago, in the middle of moving and can't find my recipe. Thank you! Just got done making this for my daughter-in-law's birthday cake to serve tomorrow. While I like it the way it is, my kids always asked me to double the strawberry sauce. Done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Richard Zaccone"
},
"reviewBody": "Made this for my wife and daughter (also a Mom) for Mothers Day, got great reviews from both!\nNext time I will slice fresh strawberries and layer them in with the ladyfingers in the middle for more texture.\nI sprinkled powdered sugar on the top for more eye appeal.\nThis will be a family favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Dzurilla"
},
"reviewBody": "replaced: Ladyfingers with strawberry fig newtons (couldn't find ladyfingers at the store)\n\nAbsolutely killed with the family. I haven't even been able to get a piece yet, myself (watching my food, have to get some calories squared away to 'spend')\nI think we're all under the same agreement here, though. Ladyfingers would have been an additional 'soft, vanilla' flavor that's already pretty overwhelming in the cream portion. The use of soft, strawberry cookies, instead, was a good choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KC"
},
"reviewBody": "My mother in law made this a few times so this was my first attempt to make it &amp; it was a hit. Everyone enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yoon Lim"
},
"reviewBody": "This is a great recipe. My mom used this recipe to make her cake and now I make it for our family. Some changes we made were: \n- Using Mascarpone instead of cream cheese\n- Added sliced 16 oz fresh strawberries, mixed in syrup (taste for sweetness). We also used frozen strawberries for the syrup and extra strawberries\n- Only found Bellino Savoiardi Lady Fingers which are hard an tall. To make a 10\" torte, 1 quart heavy cream was needed. These ladyfingers needed to be soaked well in syrup - they tasted great!\n \nIt's a great dessert for any season! It's one of our family's favorite :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PINKFIREBALL21"
},
"reviewBody": "I made this recipe as-is and got great reviews, but I wasn't entirely convinced it was a \"make again.\" However, I don't think it was the recipe's fault! I bought the only ladyfingers my grocery store carried and they didn't look like the same as all the pictures. If I could find the right kind of ladyfingers I would definitely try again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fd1218"
},
"reviewBody": "OUTSTANDING! I followed the recipe as is - the only issue I had was that it did not fill to the top of the lady fingers. Next time I make this I will double the recipe (filling only) so that it is filled to the top of the lady fingers. It is excellent and delicious! A KEEPER! THANK YOU for this recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betsy"
},
"reviewBody": "This is an excellent recipe. It is light and tastes really good. I used low-fat cool whip instead of the whipped cream and low-fat cream cheese. I also used 2 and 1/2 packages of the soft lady fingers. I added two layers of fresh, sliced strawberries. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vatech90"
},
"reviewBody": "This is a great quick and easy recipe that looks and tastes like it came from a gormet shop. It's not overly sweet and it's light and airy which is perfect for summer or after dinner. I will definitely be making this one again and again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelley"
},
"reviewBody": "Rave reviews each time I make this. So easy to prepare and looks fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIHAELA"
},
"reviewBody": "Easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dingena Biester-van Den Boomga"
},
"reviewBody": "This was a winner! THE Easter cake for 2014!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dparsell"
},
"reviewBody": "Made this for Easter Sunday. Looks very pretty &amp; everyone loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela S."
},
"reviewBody": "I didn't have a spring form pan so I made it in a 9x13 glass cake pan. Used 2 pkgs of lady fingers but 2.5 would have been better. I bought a 16oz pkg of frozen strawberries and thawed them but didn't have any juice to make the sauce so I added 1/2 cup sugar and let them stand til I had juice. I made the corn starch and juice sauce and then took the rest of the frozen strawberries and put the. In my magic bullet and puréed it until it was a thick sauce made white whole fruit. I put some on top of the dessert and put fresh fruit on the top also. then when I serve each serving I used the remainder of the purée to decorate the plate and add more to each serving. Taste wonderful and even looked nice served!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Theresa "
},
"reviewBody": "Made just as recipe was written for five guests. No one made a comment about it, which said it all. I did not like it. This was very bland, was not sweet enough, and the ladyfingers added no flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ArtishaTatianna"
},
"reviewBody": "My Family Loved it, Thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookiemonstar"
},
"reviewBody": "Holy smokes this was good!!! Not to mention incredibly easy. The submitter must use a different kind of lady fingers because the ones they sell at my local Safeway came in 3oz packages and I ended up only using 2 1/2 packs. Also, I took other reviewers advice and cooked down whole unsweetened strawberries with sugar and cornstarch and also added real strawberries into the cake layers. Awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAZSIL"
},
"reviewBody": "This was so easy and so good! Followed as directed but added 1/2 tsp of almond extract to the cream mixture. Also cut up two fresh strawberries to mix in the cream. So YUMMY!! (I needed 3 packages of Ladyfingers. The only packages I could find were 3oz, so I bought a ton. But ended up only needing 3.) I think this recipe would be amazing with cherry as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elvispiks"
},
"reviewBody": "I tried this but failed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mellissa"
},
"reviewBody": "Easy as can be looks like a \"wow\" you made that. Yeah like in 15 min thanks. Love this is a keeper for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "samcat2107"
},
"reviewBody": "This is so fabulous!! Wish I could give it 6 stars! It has many steps, but the end result is worth it! Your guests will love it. I never have any left over;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thebartbart"
},
"reviewBody": "Absolutely fantastic. Couldn't find ladyfingers and didn't want to make them so I replaced them with lightly toasted angel food cake. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Celeste Begley"
},
"reviewBody": "Easy and Elegant"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kessie"
},
"reviewBody": "Super easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Edie Talley"
},
"reviewBody": "I made this for a dinner party and it was beautiful. Because I'm on a special diet, I used fat free cream cheese, fat free Cool Whip, and Splenda instead of sugar. It was delicious and came together perfectly. A big hit! Thanks for a easy, tasty, and visually stunning recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BakingBot"
},
"reviewBody": "Makes for nice presentation. You can use cookies similar to lady fingers as well. Fairly basic, and while the photo has the ribbon around it, I found it unnecessary for the final product to remain intact."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bets425"
},
"reviewBody": "I made this recipe twice and both times it was delicious! The first time, I used the soft ladyfingers and split them and that works out better when trying to fit them in the bottom of the pan. The second time, I used the hard ladyfingers and didn't like how they turned out on the edges (remained too hard). I did use the frozen whipped topping and fresh strawberries and they both worked out well. I would definitely make it again! Everyone raved about it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brittany"
},
"reviewBody": "This was very easy to make and as a great presentation. Just FYI, two 3 oz package are enough lady fingers for this. I ended up with a ton of extra lady fingers. Instead of using just the juice of the frozen strawberries, I mashed the frozen strawberries and used them as well as the juice. Fresh fruit worked best for the top to give it it's finishing touches. I highly recommend this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna"
},
"reviewBody": "Awesome, awesome!! This was a big hit in our house. The whipping cream made the cream cheese not so rich, I generally don't like no bake cheesecake and was worried this was going to taste like it, but it didn't! Everyone was amazed that I made it and didn't buy it from a store :) Only part I didn't care for were the soggy ladyfingers on the second day. I suppose that would be an excuse to eat it all in one day though. I'm making this tomorrow for a family BBQ and I plan to use a graham cracker crust instead. We'll cross our fingers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "freckles"
},
"reviewBody": "Lovely and easy. I will use the beauty of this recipe to inspire more desserts. I used Pepperidge Farms Milano cookies and trimmmed the bottom of the cookie to get it to stand in the springfoam pan. I will use half of the frozen cooked strawberries next time. I also used the ribbon to wrap the torte to keep everything in its place. Very beautiful and \"summer-ish.\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillcasey84"
},
"reviewBody": "This is truly a GREAT recipe. I followed the directions to a \"T\", and it was absolutely delicious. A perfect, light, summertime dessert! :~)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jkcooks"
},
"reviewBody": "I had to change this slightly, but only by using a sauce of fresh berries, and home made ladyfingers. This is really delicious, and I do recommend letting this set for 24 hours before you serve - for consistency and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dana and owen"
},
"reviewBody": "I laugh when I read how people give negative reviews to a recipe that they completely changed. I made this just as the recipe said and it was not only beautiful it was perfectly perfect tasting. Just follow the recipe, you will be so happy you did. And it is EASY!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "dublinireland05"
},
"reviewBody": "I made this cake last night as a test run. Well, it looked awful, but I hear it tasted good. I'm glad I did the test run because I was going to bring this to Mother's Day gathering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsey Beth Aldridge Chinni"
},
"reviewBody": "A huge hit! **Note: A pkg of ladyfingers is only 3oz...I think the recipe means 2 pkgs of 12 ladyfingers (not 12 oz)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHUCKP23"
},
"reviewBody": "The torte filling was amazing! Layered with fresh strawberries in the middle. Also added a little sugar to the frozen strawberries when I reduced them for the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Paternoster"
},
"reviewBody": "Very easy and very tasty! I made a few changes, I used the Ladyfingers recipe from this site and made my own lady fingers the day before, I also piped out 2 big 7inch circles using the ladyfingers recipe, I like to do that instead of laying ladyfingers on the bottom and middle. I also put the strawberries in a pot with 3/4c of sugar, once the sugar was dissolved I added a couple of tablespoons of the sauce into the cornstarch and than mixed the cornstrach back into the sauce. That makes the sauce thicken without getting any cornstarch lumps. Than I blended the sauce and cooled off in the freezer for about 15 minutes. I also used 1/2c of sugar in with the cream cheese, I changed that since I had added sugar to the strawberries. After pouring 1/2 the filling into the pan on top of one of the ladyfinger circles I poured about 3/4c of sauce than placed the other circle on top of that. Than the other 1/2 of the filling and topped with some big drops of the strawberry sauce that I swirled into the cheese mixture. I fanned out some strwberries and dipped them into a simple syrup to make them shiny and placed them on top of the cake. I had left over filling and sauce, I used a 8inch springform pan. Everyone loved it, it wasn't overly sweet, I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missz174"
},
"reviewBody": "Absolutely AMAZING!!! So easy to make and looks so elegant. I brought this to Easter Brunch and everyone thought I bought it at a bakery. People were standing in line to get a slice. This cake is so light and fluffy. The key is mixing the heavy whipping cream to stiff peaks then folding it into the cream cheese. Instead of 2 tsp vanilla I use 1 tsp vanilla and 1 tsp almond extract. If you plan to add strawberries to the top you must use fresh strawberries NOT the frozen ones. The frozen strawberries are too soggy. They work but they do not look as good and the mushy texture is weird. Trust me, you will thank me later. I used a 10\" spring form pan and added 1/2 the cooked down starwberries between the 2 layers and other 1/2 on top. Looks appealing when you slice the cake and adds extra flavor. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla"
},
"reviewBody": "yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "Have made this a number of times. It definately has a WOW factor! Everyone loves it and it is so impressive. Made for Easter as the only dessert and it did not disappoint. The only change I made was to add some lemon zest to the filling and some fresh sliced berries in the middle, on top of the ladyfinger layer. I also used 2 1/2 packages of 3 oz. ladyfingers.Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "T Lynn"
},
"reviewBody": "What a fabulous recipe! I've been waiting to try it because it looked really hard but it wasn't at all. I finally decided to do it for easter this year.\n\nI made two of these. Used chocolate ladyfingers on one and regular on the other. I added about 4 Tbsp kahlua with the vanilla for the chocolate one and I added about 4 Tbsp of Chambord liqueur to the other one. I don't think I would use Kahlua again because it was too strong but the Chambord tasted amazing! Maybe I'd try Bailey's next time? I topped them with whole strawberries and drizzled melted chocolate over the chocolate one. Everyone raved about the presentation and the taste!\n\nThe only hard part is getting the ladyfingers to stand up in the pan. It's tricky but worth it for presentation! I followed some of the other reviewers suggestions regarding the strawberry layer... put it above the second ladyfinger layer and put the strawberries in the pan with the juice &amp; cornstarch. Next time I think I'd try a layer of sliced fresh strawberries in the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karma Wells"
},
"reviewBody": "Incredible! This cake will definately impress with not only it's beautiful presentation but also with the taste, scrumptious! Used the shorter cake-like ladyfingers in the 3 oz package which I found (finally!) in the bakery dept. of grocery store. Used 2 (3 oz) packages. I did follow some advice given in the reviews and did not strain the strawberries but added whole package of frozen berries to saucepan with 1 cup sugar and then pureed in blender, returned to pan and added cornstarch mixed with water. Allowed to cool for a couple hours and it did thicken. I did add some of this to the middle layer. I allowed the cake to chill for 24 hours before removing the springform pan, and it cut and served beautifully! Will definately be making this again, Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChelleBelle"
},
"reviewBody": "Made this for an Easter dessert.So good!\r\n I followed another's suggestion to cook 2 lbs. fresh strawberries with a cup of sugar~ mashed down. Added 1/2 cup water with 3 Tbs. cornstarch( mixed thoroughly) to strawberry sauce. Cooked til thick. Cooled and used for topping. Very yummy with a beautiful presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elizabeth A Tennyson"
},
"reviewBody": "Easy and everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Pallotta"
},
"reviewBody": "Super easy and tastes just as good as it looks! I added a tsp. of Almond Extract to the cream cheese mixture and sprinkled sliced almonds on the top of mine. Yumm-O!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I made this along with some other desserts for Easter. I'm not a cheesecake fan so I didn't have any. It did get rave reviews, and there wasn't much left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KJAKI"
},
"reviewBody": "Great recipe! I made this for Easter and everyone wanted the recipe. \nA couple of notes...lady finger are really light. I bought 2 (3oz) packages of them. I can't imagine how big a 12 oz package would be! That was plenty for the crust and sides. I skipped the ladyfingers in the middle and instead added some of the strawberry sauce to the middle.\nI added a little sugar to my strawberry sauce and 2 tbl cornstarch but otherwise followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Heather Booth"
},
"reviewBody": "This is a very pretty looking dessert but I would say simple strawberry shortcake is better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAISIN1"
},
"reviewBody": "Quite possibly the best dessert I have ever made (and I have made thousands). Creamy, fresh, light, and just the right amount of sweetness. I subbed low fat coolwhip for the whipped cream and used 8 oz of regular cream cheese and 3 oz of the reduced fat. This was in an attempt to keep the fat content down. The flavor wasn't compromised at all! Per others suggestions I cooked down the strawberries with 1/3 cup of sugar and cornstarch and then partially pureed in the blender. The result was a strawberry sauce that was awesome. I actually made a double batch of this to freeze and serve later with strawberry shortcake. I layered the lady fingers, then cc mix, then strawberry sauce, and repeated. I topped with some sliced fresh strawberries for presentation. Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cute Brunettes"
},
"reviewBody": "Ok. We (my sis and I) made this recipe with a little variation and it came out great. We put all the frozen strawberries, corn starch and a little powdered sugar in the sauce pan and heated it through and then put the sauce in the fridge to cool a bit. We arranged the ladyfingers on the sides and the bottom of the pan and poured a mixture of the cream, followed by a layer of strawberry sauce, another layer of ladyfingers, cream and strawberry sauce. We arranged some fresh whole strawberries on top and piped some of the reserved cream mixture in the center. It came out so pretty and we were so proud that we took a pic and uploaded it here. =)\nThanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rockerchic821"
},
"reviewBody": "I also cheated and folded in store bought whipped cream. Instead of making the sauce, I melted down seedless strawberry preserves and drizzled it on the berries which were fresh, not frozen. I tweaked this a bit, by using my cheats, but OMG is this thing delicious! It's like strawberry shortcake collides with strawberry cheescake...decadent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMARTIN"
},
"reviewBody": "Great recipe! I put the strawberries, juice and cornstarch in saucepan and cooked as directed. It was thick when it cooled. The cake is beautiful and everyone loved it and easy to make!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Olthof"
},
"reviewBody": "Made this and won top prize in our local Incredible Edibles contest in the Sweet Treats category. This pretty dessert tastes as good as it looks! I found it needs 2 tablespoons of cornstarch to prevent the topping from being too runny. Otherwise, don't change a thing! It's a winner! (I won a $300 watch with this recipe!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toothfairy"
},
"reviewBody": "I have to give this 5 stars because I made this for my husband's birthday party, and everyone said wow when they saw it, simply because it's a beautiful cake, but it became double wow when they ate it. I cut the sugar to half a cup but added a little homemade strawberry jam mid layer to enhance the strawberriness. I also made the topping with fresh strawberries and it was absolutely delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Megan Oxford"
},
"reviewBody": "So easy, yet so elegant... I made it last summer for a bbq and received so many compliments :) It's great after a heavy meal- so light and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweethooth07"
},
"reviewBody": "I just made this a couple of weeks ago and it was immediately gone within a matter of days, what i love about this recipe is that it doesn't leave you this sickly feeling of eating too much?because it is light but you still get the cheesy taste, unfortunately for me, i didn't have strawberries at the moment so i improvised blueberries instead,it turned out to be a new kind of blueberry cheesecake in my opinion GREAT nonetheless!:) you get to really let creativity shine in this recipe!:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugar Dottie's"
},
"reviewBody": "So yummy! Will definitely be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Micha Mi"
},
"reviewBody": "This was oh so good. I got rave reviews. However, I only made minor changes to the recipe. 1st change is that I only used 1/2 cup of sugar. 2nd change is that I didn't get a lot of strawberry juice so I followed another user's review and cooked down the frozen strawberries and pureed them with sugar. When doing this, I learned that 1 tablespoon of cornstarch is not enough. My strawberry topping was very runny and ran all over the cake. I also couldn't get a very thick layer since that was the case. Next time I make this, I will either use more cornstarch, or perhaps some pectin, or even gelatin to make it nice and thick. I found getting the ladyfingers to stay upright very difficult so I laid the bottom with ladyfingers, and put a dab of the cream cheese mixture in a small bowl and dipped the bottoms of the ladyfingers in the mixture to act like an adhesive. That worked extremely well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becky"
},
"reviewBody": "This was very good. And it is beautiful to look at."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kmarie0218"
},
"reviewBody": "I could not find lady fingers! I used Vienna Fingers instead, which was tricky, but I made it work. This is an easy recipe and it tastes great. Like cheesecake without all the work to bake it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "vikingsjana"
},
"reviewBody": "I bought 4 packages of ladyfingers with 3oz. each 12 oz. altogether and it was enough for the pan. Which is good because they are not cheap, 1.79 a package. Thought it was an expensive dessert to make and was only \"good\" at best. Directions could be a little more detailed as I didn't know if I was supposed to seperate the ladyfingers or not. Judging from the fact that they seperated around the outside I guess I should have. I think the review from the person who added strawberry to the center is right on, it needs it and the 16oz package is not enough, although the Ladyfingers and the filling according to the recipe are too much for a springform pan. Don't think I'll spend the money on this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cecilia Vazquez"
},
"reviewBody": "This is so easy and so looks impressive. I made it for my mother in law and the whole family asked for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Angulo"
},
"reviewBody": "Amazing! My only suggestion is for the topping. Use 2 pounds of fresh/frozen strawberry's, mush down in pan with potato masher and add 1 cup of sugar. In a separate bowl add 1 cup of water and 3 tablespoons of corn starch (MIX WELL) gradually add to strawberry mixture and thicken. Once thick enough let cool. Add to top of torte and believe me it makes the dish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryLou"
},
"reviewBody": "This was fabulous! I made just a few changes though, I used 1/2 cup of sugar in the cream mixture and used fresh strawberries. It looks and tastes great - I will definately make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Madicakes"
},
"reviewBody": "I have made this several times and it is always quite a hit! I do add a layer of strawberry sauce and lady fingers in the center to add a little more texture to the finished cake. I just swirl strawberry sauce (made from fresh strawberries, cooked with sugar and cornstarch) on the top, add some fresh strawberries for garnish.....viola, beautifl tied up with a pretty ribbon as pictured."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kym76"
},
"reviewBody": "Easy to make and delicious. I used fresh berries, for slices in the middle layer, and for the puree on top. I didn't need cornstarch to thicken up the puree but did add a little sugar when I heated it. Excellent recipe and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "I just took this to an Easter dinner, and it was a success! Just the right consistency and mixture of flavors. Not too tangy, not too sweet, really delightful! Since the grocery store informed me they did not carry the ladyfingers, I made them myself the night before using a recipe from this site. It wasn't hard, and they turned out great. I loved this torte, and would make it again in a flash!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Schelle70"
},
"reviewBody": "This is a spectacular dessert if made properly. Some of the bad reviews people have written are not the fault of the recipe,but the person trying to make it. Ladyfingers are soft,sponge cake like cookies,and that is what this recipe calls for. It does not call for any kind of hard cookie whatsoever. Also,the strawberry topping turns out fine if you use whole frozen strawberries with a little sugar added with a touch of water. Bring this to a boil,and then mash them with a potato masher. After that,make a cornstarch slurry to thicken it up,and add a little red food color if you like to make it bright red. This recipe is easy,and delicious,and has become a staple in my family for springtime and summer holidays/get-togethers. Thanks for posting it. A couple more things,I cut the vanilla in half,and add about a teaspoon of almond extract to the cream cheese mixture. Also,make sure to whip the cream cheese mixture well(definitely use a stand mixer if you have one),and then gently fold in the whipped cream. Your dessert will be lighter and fluffier that way,and will definitely make enough to fit into a 9 inch pan(I use a 10 inch pan for this dessert and it is filled to the top)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John & Steph"
},
"reviewBody": "A.M.A.Z.I.N.G. I made it for my mother-in-law's birthday, 12 adults and 3 kids in attendance. Every single person LOVED this. The only problem was there was only enough for everyone to have one piece!! I made a graham crumb bottom because I didn't have enough ladyfingers to do the whole bottom and sides. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Rogers"
},
"reviewBody": "NOTE: 1 pint of whip cream is not enough to do a 9\" pan. Need more. I Layered top 1\" with sweetened whip cream and then decorated with sliced &amp; whole strawberries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz_Perry"
},
"reviewBody": "Easy and quick to make, beautiful when finished, and tastes fantastic! This is the perfect party pleaser. I love fast recipes and I have this one down to ten minutes flat, start to finish. I don't do the cornstarch because it takes more time -- I just cut up strawberries and spiral them on the top to make a lovely design. It tastes just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Claudia Parra"
},
"reviewBody": "I can not seem to find any Ladyfingers anywhere."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Schulte"
},
"reviewBody": "I whipped this up in 25 minutes and it was so tasty and BEAUTIFUL. Everyone talked about this dessert the whole night. Thanks so much for sharing this one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Akasma"
},
"reviewBody": "I really enjoyed this a lot and as many have, I have modified it after my first try. I have made this several times since as everyone requests it! My changes: I get 2 lbs of fresh strawberries and pull out the prettiest ones to put all across the top. The rest I slice and add with the frozen berries and juice to make into the sauce, doubling the cornstarch. This gives me considerably more sauce to spread in the layers and that gives it all that much more strawberry flavor! It is so beautiful and to make it even easier to make I layer the entire thing into a trifle dish. Love it, thanks so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel Barbosa Velozo"
},
"reviewBody": "This is really good. I usually use the soft ladyfingers if I can find them instead of the hard ones. I also usually just use a can of strawberry pie filling for the topping instead of using the frozen kind. Also great with blueberry or peach pie filling"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kathy"
},
"reviewBody": "Pretty and very tasty. I could have left in the fridge for 48hrs. rather than 24 hrs., the cookies were crunchy and hard to cut. Didn't last long!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karyn1701"
},
"reviewBody": "Simple, quick and delicious! Great to make with kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Lam"
},
"reviewBody": "This recipe was so delicious! I made this cake for my brothers birthday in the summer and everyone LOVED it! Instead of using ladyfingers i used vienna fingers because i couldn't find ladyfingers anywhere near me. My strawberry sauce came out not as good as i wanted but it was my first time trying, so it was good. I used the strained strawberries and put it between the layers as filling, my brother loved that idea. On top i arranged new strawberries(halves). Overall, everyone enjoyed this cake. I will make this again, definitely!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Loves2Bake"
},
"reviewBody": "I tried to make this as a dessert for a BBQ and it turned out bad. I mean it tasted good, but the presentation was horrible. it slid all over the place and started ozzing the minute I took off the springform pan. Alas, practice will make perfect but I will definitely be doing it another way next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "TF"
},
"reviewBody": "What a disappointment!! After reading all the 5-star reviews, I was quite eager to try this recipe. It definitely did not live up to the ratings. There is not enough moisture in the cream cheese mixture to soften the cookie layer in the middle, so it can't be sliced. The filling is bland and is only sufficient to reach about 2/3 of the way up the surrounding biscuits (even with an 8\" pan), so it looks like a souffle that flopped. The lack of flavour is certainly not offset by the mushy berries on the top. The glaze can't possibly become shiny without the addition of sugar and becomes a sticky waxy-looking mess that covers the top. I went on faith by the instructions, suspecting that it wouldn't result in the delicious-looking dessert in the pictures (and how could it without any fresh strawberries required in the recipe??) I made this to bring to a friend's house but was too embarassed to take it along. Next time I'll be more careful to read between the lines in the reviews - when so many of them say \"I changed the recipe by...\", this should be interpreted as \"This recipe cannot be used successfully as it is written.\" The five-star ratings are, in truth, evaluations of other recipes altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was so elegant and easy to follow. I put my strawberries in the center with fresh mint leaves as accent. I made mine a day in advance. It tasted wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RosannaL"
},
"reviewBody": "Definetly a 5*! Made it exactally how it said. I put just a little whip (from a can) around my strawberries on top..dont do it because it melts &amp; screws up the prettiness. I impressed everyone at a family gathering with this. It tastes sooo good also. thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tanya S."
},
"reviewBody": "I'm only giving it 4 stars because I modified the recipe. Modifications: -I used 2 packages of cream cheese, with the sugar, vanilla extract and 1 container (1 L) of cool whip (thawed). -I did not make the strawberry sauce. Instead, I used my homemade strawberry freezer jam and fresh sliced strawberries. It turned out delicous!!! Can someone please explain how the ladyfingers stand around the pan? I always have a hard time making them hold before pouring in the mixture!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucie Michaud"
},
"reviewBody": "So good. The reviews don't lie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANNEMILY"
},
"reviewBody": "I have never posted on here just had to with this dessert I made it for Fathers Day and it lasted 5 seconds my daughter LOVED it. Thank you for such a great dessert. I followed the filling exactly and made a brownie shell for it and crumbled brownie pieces with fresh strawberries in the center. YUMMY."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PattyQ"
},
"reviewBody": "Amazingly good! I made two tortes: one with Italian ladyfingers, which extended well over the rim of the pan - good and pretty but the best results were with the small ladyfinger I found in a 3oz package. As someone else mentioned, these are very easy to layer because they are soft, and come attached in 5 cookies which can easily mold around the pan (I used 3 of these packages). I use 1 lb of fresh strawberries, leaving 5 for decoration, and cooking the rest with 4T of sugar until soft.I took 4T of the liquid and mix with 2T of Grand Marnier, and added the juice to the middle layer of ladyfingers.I took the strawberry sauce from the heat and added 1T of cornstarch dissolved in 2T of water (very important) and let cool and thickened. I continued with the torte by adding a thin layer of straberry sauce to the middle layer of ladyfingers annd continue with the cream cheese mixture, then topped with the rest of the strawberry sauce. I slices the fresh strawberries and place them on top of the sauc with the points (top of the slices) facing the middle, and it looked very professional and pretty. Absolutely wonderful, and I got many requests for the recipe - all gone in 60 seconds!! The one with the Italian ladyfingers was not as good on the outside and I had to do what another reviewer suggested- place some cream to the bottom in order to stand the cookies since these ones refused to stay put! My daughter ate it all in one day anyway, and since she had not tried the other one, sh"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shakinmaibooty"
},
"reviewBody": "Delicious! I used Alessi Ladyfingers Biscotti for a different texture. Instead of laying ladyfingers in the middle, I chopped up lemon cupcakes I had and used that instead. What a fantastic strawberry dessert!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betty"
},
"reviewBody": "AMAZING!! The one thing I did was to cut the ladyfingers in half to make the outside of the tort - i loved the way the ladyfingers tasted after they had soaked in the cream mixture, and I thought the crunchy parts that were too tall to get soaked didn't go well with this soft torte (and also tend to make it look like a fortress...). I've also used light cream instead of heavy, and the presentation isn't as good (because it doesn't get quite as stiff) but I actually thought it tasted lighter and better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "I made this for mother's day (for my in-law and my mom) and it was a huge hit. It was light enough to eat after a heavy meal, too. One thing I did different, the strawberries I bought were not in juice, so I chopped them in my mini-chopper, put them in a pot with a little bit of water and a sprinkle of sugar, and brought to a boil. I pureed the mix in a blender and stuck it in the fridge to cool. When i put the filling on top of the ladyfingers I also added a thin layer of this mixture, then more ladyfingers (they soaked up the juice and were exquisite). I sliced strawberries and filled the gap (my ladyfingers were too tall) on the top of the torte. Thanks for an awesome recipe! I will submit a photo. It really was a big hit, and I would make it again. It reminds me of strawberry shortcake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sophiabakes"
},
"reviewBody": "i made this about seven hours before it was served. everybody loved it. i think that it could have a little bit less cream cheese. I followed a review and cooked the strawberries and cornstarch then pureed it with sugar for the sauce and used fresh strawberries to decorate. the sauce was very liquidy and therefor covered the sides of the cake when we cut it, but it tasted great. next time i will add some gelatin to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUSANMUR"
},
"reviewBody": "Thank you, cookiemonstar. I saw your beautiful photo of how you decorated your torte, and I made mine the same and won first place in the the strawberry festival. The cake sold at auction for $150.00. This is a wonderful recipe, Star. Thanks for sharing it with us. It makes an absolutely striking presentation."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7409/strawberry-torte/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
"name": "Strawberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7409/strawberry-torte/",
"name": "Strawberry Torte"
}
}
]
}
}
, "about": [
]
}
]