				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Strawberry Rhubarb Custard Pie"
,"datePublished": "2012-06-07T13:48:50.000-04:00"
,"dateModified": "2022-08-16T23:51:58.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "The beautiful pairing of strawberries and rhubarb, combined with a smooth custard, creates a mouth-watering and irresistible pie."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_T-_4eIX_CcauncKqRLJqDXvnkg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4518623-strawberry-rhubarb-custard-pie-Oksana-Seaman-1x1-1-dc62e19e77b74440a3f4af577dd4bdd8.jpg",
"height": 1000,
"width": 1000
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1667914973001",
"description": "See how to make a super-simple strawberry-rhubarb pie.",
"duration": "PT6M",
"name": "Strawberry Rhubarb Custard Pie",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/724191f7-57d5-47bf-9fc4-5eceb0a9f818/f7c53a0d-1ac8-446f-afbd-da14a60a5d99/1280x720/match/image.jpg",
"uploadDate": "2021-07-05T13:26:31.067-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Strawberry Rhubarb Custard Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "213"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "342 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "74 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "159 mg"
,"sugarContent": "42 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (9 inch) unbaked pie crust (see footnote for recipe link)",
"3 cups rhubarb, sliced 1/4-inch thick",
"1 cup fresh strawberries, quartered",
"3 large eggs",
"1.5 cups white sugar",
"3 tablespoons milk",
"3 tablespoons all-purpose flour",
"0.25 teaspoon freshly grated nutmeg",
"1 tablespoon butter, diced",
"2 tablespoons strawberry jam",
"0.25 teaspoon water" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Place rolled-out pie crust in a 9-inch pie plate and set on a baking sheet lined with parchment paper or a silicone baking mat."
} ,{
"@type": "HowToStep"
,"text": "Combine rhubarb and strawberries in a bowl; transfer to the pie crust, distributing evenly."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, sugar, milk, flour, and nutmeg together in a medium bowl. Slowly pour filling over rhubarb mixture until it just reaches the top edge of the crust. Scatter diced butter evenly over the top of the filling. Lightly tap and shake the baking sheet to remove any air bubbles."
} ,{
"@type": "HowToStep"
,"text": "Transfer pie to the preheated oven and bake, turning halfway through, until rhubarb is tender and custard is set, about 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/_T-_4eIX_CcauncKqRLJqDXvnkg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4518623-strawberry-rhubarb-custard-pie-Oksana-Seaman-1x1-1-dc62e19e77b74440a3f4af577dd4bdd8.jpg"
}
]
,"text": "Mix strawberry jam and water in a small bowl; heat in the microwave until warm, about 15 seconds. Glaze the top of the pie with the jam mixture and let cool. Refrigerate until ready to serve."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Blank"
},
"reviewBody": "This is so delicious! I made a homemade crust, fresh rhubarb, frozen strawberries and almond milk. Best I could do living on an island in the middle of the Pacific ocean. My son in law gives this rave reviews! No problem with runny custard, even with using frozen strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CatPurrson"
},
"reviewBody": "FABULOUS! So easy to put together and comes out perfect every time! My father, who is 101 years old, said it's the best pie he's ever eaten! And he has had MANY pies! Try this recipe! Even if you are intimidated by pie making. It's wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dogwood229"
},
"reviewBody": "Chef John did us a great favor. This is the best pie I've ever made. Perfect. I never liked Strawberry Rhubarb pie because it is usually sickeningly sweet, to counter the tartness of the rhubarb. With the custard addition, it is delicious and I can enjoy every bite. This is a new family favorite. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela Munson"
},
"reviewBody": "It’s absolutely delicious. My mom says it’s exactly as she remembered from the one she made when she and my dad were newlyweds. I followed the instructions exactly, except I used frozen rhubarb and frozen strawberries that I thawed and then gave 2 minutes in the microwave in a bowl and drained off the excess juices but I still had to increase the cook time to 1 hr and 25 minutes. Before the custard would set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Polly"
},
"reviewBody": "I'm only giving 3 stars because the recipe calls for baking about an hour and there is no way an hour is nearly enough. I left it in for an 11/4 hrs and it still came out VERY runny! I even put in a tablespoon of granulated tapioca...still runny 😭 if anyone has suggestions, please let me know. The flavor is really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Speckhart"
},
"reviewBody": "Everyone raves about this pie! SOOOO GOOD! 🍓🍓🍓"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn in Seattle"
},
"reviewBody": "I used half rhubarb and half strawberries, and reduced sugar to 1 1/4 C. It set up fine and was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was so so good. For anyone wondering if you can cut the sugar and have it still set, the answer is yes. I used a heaping 1/2 c and had no issues. I also added vanilla and ground ginger to the custard, subbed oat milk for regular, and glazed with apricot jam mixed with juice of 1/2 lemon. It was delicious even with all my modifications. My SIL claimed it her new favorite and requested a birthday pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mjjkg"
},
"reviewBody": "Way too much sugar in this recipe! I used just 1 cup and my son still thought it was too sweet. I don’t like tartness so I will stick with 1 cup. Because other bakers said that the pie was too runny, I left out the milk and did sprinkle some tapioca on the crust bottom before adding the fruit. I also put an upside down foil pie plate over the pie half way through the baking time to aid in baking the fruit. I baked it for the recommended time. It turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robin Griesser"
},
"reviewBody": "Most pies/desserts have too much sugar, as does this one. My rule of thumb is 1/3cup of sugar to 1 cup of fruit, but strawberries don't need any extra sugar. This recipe (minus the last two unnecessary ingredients) was perfect with just 1 cup of sugar. Needed to bake 20min extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Easy and delicious! I used a pre-made crust as stated in the video by chef John. I followed the recipe except I forgot to put the butter on the top. Still beautiful and delicious. Sweet and tart the fruit was nicely cooked. I did cook 10 extra minutes for the custard to set. Then cooled in the refrigerator for about 2-3 hours before cutting. Perfectly set in the middle. I will definitely make again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathy Paape Rassel"
},
"reviewBody": "I baked my pies over an hour and they still were very runny. I'm not certain if the rhubarb had extra moisture due to all the rain this spring. Next time I will toss my rhubarb in flour or add tapioca. But I will say that our guests said it was the best pie they'd ever tasted! lol!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "Only after I made this did I find out that the BF isn't a fan of rhubarb. I used 2 cups frozen rhubarb (because that's how my store has it) and 2 cups fresh strawberries. I par boiled the thawed rhubarb then drained well before following the recipe. He actually loved the pie. It wasn't the prettiest thing to look at, but tasted pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreen Jacobson"
},
"reviewBody": "This was delicious. I’ll make the recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Kellen Habib"
},
"reviewBody": "After cooking for an hour and 45 minutes, the pie never set up. It remained a soupy mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brykate"
},
"reviewBody": "Everyone loved it. Made exactly according to recipe. My nutmeg was old so we did sub Pumpkin Pie Spice instead. Yum, it was subtle. Forgot the glaze at the end tho, didn't miss it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shell"
},
"reviewBody": "This was amazing!! Had more strawberries than rhubarb - used the store bought crust, real vanilla, fresh nutmeg!!! OMG! The best pie ever!!! Will make again &amp; again - want to try this custard w/other fruits like peaches or blueberries! Made this yesterday &amp; is gone already! Thank you for the very easy custard recipe - I never knew it was that easy to make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Perfectly delicious! I didn't have strawberries, so I just made it with 4 cups of rhubarb and left them out. I didn't have any jam, so I swapped out honey. The crust was perfect, the custard set, and I didn't miss the strawberries at all, although I have to try it with strawberries next time. I also used margarine instead of butter because I was out. So it's as if I was deliberately trying to destroy the recipe, but I couldn't. It's a couple simple extra steps for the custard vs a regular fruit pie, but it's worth it. And to Chef John, in case you read the reviews: I love your videos! I'll never forget to tap-a tap-a, shake-a shake-a :) Thanks for another great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Chipman"
},
"reviewBody": "I used an additional cup of strawberries in my deep dish pie pan. Both of my pies tuned out amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherda"
},
"reviewBody": "Very good, the filling was not runny at all. I used closer to 5 cups of fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Irene"
},
"reviewBody": "I was hoping for a pie that was more of a custard pie, this was a little custard with lots of rhubarb. It was way to sweet and I reduced the sugar by 1/4 cup. It was to sweet and you really didn’t get the tart rhubarb taste at all. Very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "Definitely will make this again. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "haf"
},
"reviewBody": "I have made this four times now...First round: watery. So, I added heaping tbsps of flour on second and third attempt. Perfection. the glaze is essential for sweetness and the slow, painfully slow pour of batter is required if you don't wish to have it all over the pan. The shake-a shake and tap a tap are critical. Don't overlook the small stuff; do it. Perfection for anyone consuming large quantities."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DianeK"
},
"reviewBody": "Delicious and so easy. \n\nEmphasizing refrigerate to help it set. My fabulous pampered chef dish stays hot a long while so the custard of our first piece was slightly runny."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TNociti"
},
"reviewBody": "We thought it was good the night I made it. No one has gone back for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mightywog"
},
"reviewBody": "It was delicious. I added a teaspoon vanilla to the custard. Other than that I followed the recipe exactly. Probably one of my favorite summer time pies. Whole family loved it as well. Even my kids who were complaining about the rhubarb as they watched me make it. Perfect balance of flavors and I liked that it didn’t require a ton of sugar. I might add even less sugar next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Joel Allen"
},
"reviewBody": "Ah! Gah! My teeth are ringing from the sugar and acid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidi"
},
"reviewBody": "ok this is the closest to a recipe that I have ever made the only thing I did differently is I only had 2 cups of rhubarb so I did half strawberries and half rhubarb, this was delicious everyone loved it . I never had rhubarb before it was fantastic,but I also found out I am allergic to rhubarb which sucks because it is crazy good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peter"
},
"reviewBody": "I used shortbread piecrust and will cut sugar to 1 cup next time. Really great pie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Björklund"
},
"reviewBody": "Lesson learned, done your a store bought normal size pie crust. Use a deep dish pie crust . Other than that. This is excellent. Worth making"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Spacek"
},
"reviewBody": "So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Wong"
},
"reviewBody": "This is easy with excellent results. Followed the recipe as written and the results was one of the best rhubarb pie, I’ve made; not too sweet, not too watery, crust nicely baked (used store deep dish shell). Good advice to pour custard slowly when assembling the pie. Try and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob The Baker"
},
"reviewBody": "Many changes and will make again. I used the custard filling from this recipe but did not use the jam. The other recipe from Allrecipes was the crust. First prize strawberry rhubarb crisp.\nI used 2 cups rhubarb along with 1 cup frozen strawberries and 1 cup frozen whole strawberries cut in half. I placed these 1/2 strawberries all over the crust and then poured the other fruit over the cut fruit. I poured the custard mixture over this, plopped the butter on top and bakes in an 8X8 at 350 for one hour. Watch so it doesn't burn after 45 mins. Terrific!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Kidd"
},
"reviewBody": "Still had a hard bite from the rhubarb, but it was so tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenneth Kurtz"
},
"reviewBody": "Followed the recipe as given, turned out fantastic. A new favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tonya"
},
"reviewBody": "Changed it to a crisp mixed a crisp receipe topping no crust. Was a perfect blend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet"
},
"reviewBody": "This is absolutely the easiest and best strawberry rhubarb custard pie out there. My family only wants pie made this way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amstng"
},
"reviewBody": "I really appreciate everyone who takes time to review recipes! I made a few changes based on earlier reviews: I reduced the sugar to one cup, added half a teaspoon of vanilla, and replaced the 3 tablespoons of flour with 3 tablespoons of cornstarch. I also omitted the strawberry jam glaze. It was delicious and set up beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tishprint"
},
"reviewBody": "Made a lattice top crust and omitted jam (didn’t have any). Second time in two weeks. The dog got the first one Bad dog!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deb"
},
"reviewBody": "I liked the pie, but I also like more custard. Hubby and I agree, double the custard next time. Very easy to make. Mine looked exactly like the picture. (and for me that is a plus)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jhawkins"
},
"reviewBody": "No alterations required."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Pam"
},
"reviewBody": "yes, it was easy, yes it tasted good, but mine did not hold up. it was runny and i did everything as instructed. and just as he said, it was solid, but with a little jiggle like in the video. it smelled delicious, but didn't look great! I used a 9\" deep dish pyrex pie dish. Could that be the reason?The custard layer was not as thick as his. I would make it again if i knew how to remedy it. It definitely was not underbaked. Any ideas?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emohdeer"
},
"reviewBody": "I didn't have strawberry jam, so I used some rhubarb curd that I made the night before as the glaze. I'll definitely make this again. So. Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine Freek Garrison"
},
"reviewBody": "This was my first attempt at a strawberry rhubarb pie. It’s my husbands favorite. The addition of custard is a really great extra touch. It looks beautiful and tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RobynC"
},
"reviewBody": "It was really good, except, I should have used fresh rhubarb. I used frozen and it was mushy. Next time I will use fresh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Walter Faulkner"
},
"reviewBody": "made 2 and they both really stuck to the pan. I prebaked both frozen crusts store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Laurie Tower Eckroth"
},
"reviewBody": "I was so excited to try this recipe! Unfortunately, the custard never did set up. I think maybe there was too much moisture in the rhubarb, but I poured liquid off - put it back in the oven for an extra 20 minutes... more puddles to pour off. Won’t be doing this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "Easy to make, delicious and very pretty. lots of compliments received after serving this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin"
},
"reviewBody": "Made this for company when rhubarb was abundant in the garden. Everyone raved over this pie! It will be my go to rhubarb pie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne Queen"
},
"reviewBody": "Incredibly easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Athena"
},
"reviewBody": "I followed the recipe exactly as written because I love Chef John's picks and videos. However, I added an additional 6 minutes bake time since it was still slightly runny in the middle (could have been my oven?). Next time, I'll take reviewer Missy Huber's advise and add one tablespoon of tapioca to thicken it. No matter, it was FABULOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NADINETICHY"
},
"reviewBody": "Outstanding followed the recipe as given. Before serving put in the refrigerate cuts better--no need for ice cream or whip cream. Great flavor\nToday I'm going to make the same recipe without the crust and serve as a custard. Will see???? I think it'll work LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "2thaTEE"
},
"reviewBody": "so good, the only thing I added was butter/vanilla flavoring instead of milk I use half/half milk, a pinch of salt, nutmeg and cinnamon also I added my strawberry jam and butter to the filling... turn out very good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Copp"
},
"reviewBody": "Made this last night and it is delicious! As are all of Chef John's recipes! I did increase flour to 1/4 cup as others reviewers suggested. I also had used a larger deep dish pie pan so I added an additional 1 cup of rhubarb. Would have added more berry but was out. This took about 1 hour and 15 minutes for some reason in my convection oven but sometimes I don't believe my oven is working correctly but I am noting this for myself for future reference. I used raspberry jam with water for the glaze as it was all I had and I knew it would work. I will make this again for sure. Used the pie crust recipe on the Crisco box as I was low on butter and it was flaky and browned up nice and I have another crust to use for other things. Loved this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shanna"
},
"reviewBody": "Very easy and husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dori"
},
"reviewBody": "Definitely yes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GoBadgers"
},
"reviewBody": "Very easy and delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lolo2459"
},
"reviewBody": "Way too sweet and did not set. Maybe adding cornstarch next time and cutting the sugar? I was very disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "psychocat"
},
"reviewBody": "Followed the recipe and it tastes great. However it was quite runny. This is the second time I’ve made it and runny both times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MLes"
},
"reviewBody": "Loved the flavor but next time will add tapioca to thicken as some suggested. It was a little runny and I think would have benefited from a thickener. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coreo"
},
"reviewBody": "This was SO tasty! I had never tried rhubarb before (I know, ridiculous) so I decided on this recipe. Followed to the letter and it was insanely delicious! The custard IS really sweet but everything else is so tart and buttery that I found it a perfect balance (and I generally don't like things too sweet). Cook time was a a bit longer, but that's custard for you! My one complaint was after I refrigerated it the condensation from the cling wrap dripped down and made it look totally gross (user error here?). But once I got it in the bowl it didn't matter at all and it was SO good. I think this would be wonderful with an crumble topper or cherries instead of strawberry rhubarb. 10/10 will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "Hubby LOVES it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie Watson-Senior"
},
"reviewBody": "Fun recipe to make. Tasted delish. Only thing I would like the custard to taste more custardy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "So simple and delicious! Chef John's video is worth watching! A few nice tips that make the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMILIO'S GRANNYE"
},
"reviewBody": "Delicious - made it for the first time. Very easy! \nThe tapping is important to keep the custard from pooling in one spot and not cooking completely and the turning. \n I did not tap and am not sure if I did a full turn - all but one section settled (about one piece) and that is all I can think could cause it. Every morsel was devoured by 5 grownups...and left them wanting more! \nIf you use frozen berries or frozen rhubarb you MUST defrost and drain...or add extra flour, It will not set up otherwise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "This pie was perfect. The only change I made was I forgot to put the butter on top before putting the pie in the oven. The results showed that the butter isn’t necessary. I will definitely be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Meaghan Smith"
},
"reviewBody": "Followed the recipe perfectly, and had many issues. I ended up baking the pie for an extra half hour, and it didn't do anything to help the custard set. I thought that maybe this was the reason that it needed to be refrigerated (which I did for several hours), but that did not help either, as when I cut into the pie it was incredibly runny. The custard was also way too sweet. An okay foundation for a recipe, but if I made it again I would probably use a different custard recipe, as the one provided in this recipe just wasted ingredients and time on my end."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole'n'Lyle"
},
"reviewBody": "Like other reviewers, I had to let the pie bake quite a bit longer. The taste and consistency outweighed the problematic extra baking time. Simple and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "For many years I have made a rhubarb custard pie from a very old Better Homes and Gardens recipe book, but with out the strawberries. I was pleased to find this almost identical recipe with the addition of the strawberries. For those who found it to be runny, my original recipe called for 1/4 cup flour. That is what I used even with the strawberries, and it turned out perfectly. It was a big hit at my community happy hour tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jimmy shuffles"
},
"reviewBody": "a very good pie and easy to bake, this was my second pie to bake since I retired and became the main cook at home at 63!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "Worst pie ever! After cooking for an hour it was still not set in the middle. The next morning I pulled the pie out of the refrigerator to find it did not set in the middle. The rhubarb was not soft and the taste was bad. I will not make this pie ever again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Llianne"
},
"reviewBody": "I made this with a paté sucreé pastry, put it in a tart pan and flipped the untrimmed edges back over the filling so it looked like a gallete. The only change I made was to use frozen strawberries instead of fresh.\n It was spectacular both in appearance and taste. Chef John, you’ve done it again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evergreen Turkeys"
},
"reviewBody": "The only changes I made was using buckwheat flour for the crust, I used less sugar, I used muscovado sugar, I used half and half instead of milk, a little gelatin just to make sure things firmed up, and I used dates instead of strawberries since it was all I had. It turned out a little different, but good; I love food play!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Kampa"
},
"reviewBody": "YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice Henning Roebuck"
},
"reviewBody": "The only change I made was instead of the strawberry jam mixture on top, I sprinkled 1T of cinnamon and sugar mixture over top before baking and omitted the jam step. It was Amazing !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephen F Molo"
},
"reviewBody": "I made this recipe, it seemed to be very wet after cutting although the taste was very pleasing. My next one I will do some experimenting with corn starch or a bit more flour, maybe tapioca to thicken up the custard for a better base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SCARLETT1958"
},
"reviewBody": "Perfect balance of sweet, tart and creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "strnbrgr"
},
"reviewBody": "Easy and delicious - I had to tweak the recipe and add baking time since I only had a 9.5\" pie pan but it still came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "poodiesgirl"
},
"reviewBody": "Oh this pie looked so beautiful....I was so proud to give it as a gift for a coworkers' birthday, until it was cut into, and the too sweet custard spilled out the sides! I was so embarrassed. I had even put it in a pastry box. I made the recipe exactly as written and consider myself a very experienced baker having even worked as a baker in my twenties- in my mother's and grandmother's footsteps. It was way too sweet, and I had to bake it an additional 35 minutes. Just a waste. Reputation ruined. I just wanted to take it back and throw it in the trash but she was so gracious and appreciated the effort. If you must make this, decrease sugar to 1 cup and increase flour by a tbl or 2."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "I was introducing this to my bf who has never had rhubarb so I didn't want to scare him away with the tartness. I used half and half instead of 3-1 ratio of rhubarb. Turned out just as good!\nI ended up having too much to fill my pie shell (which was the same dimensions as John's) so I had a smaller shell on hand and put the rest of the berries and custard into that. It didn't fill it up all the way so I made a basic crumble for the top. Both turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SARAH_ANNEJ"
},
"reviewBody": "This was good and very simple to make. I did find that I thought the custard was a bit too sugary. Lots of the sugar sank to the bottom of the pie which then made a dense sugary layer across the bottom that I felt was too sweet. I will make this again and next time cut down on the sugar by a bit. Super easy and delicious though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth Fosnocht"
},
"reviewBody": "I liked it, but I would suggest you add a teaspoon of vanilla to the egg mixture. I used rhubarb from my garden, so the prep time was a bit longer than I expected, about 35 minutes. Otherwise it was a good recipe and I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Wagner"
},
"reviewBody": "It was super simple to put together, though I'm not certain I'm sold on the custard. It was tasty, but I think I like strawberry rhubarb pie without the custard flavor in there. I'll still probably make this again. I made two the first time around, they turned out perfectly, took them to work, and shared around. Very well received."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie Kay"
},
"reviewBody": "I ended up putting a crust on the top and it took near forever to bake, and still hadn't firmed up. By the time the crust had browned, it still wasn't firm so I just turned the oven off and left the pie in overnight. \n\nWOW! The next day I served it and everyone was crazy for this recipe. IT's a new go-to! \n\nPROTIP: Peanut butter whipped cream (whipping cream, powdered sugar, peanut butter powder) was a very surprisingly perfect addition as a play on peanut-butter and jelly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crhagen"
},
"reviewBody": "Ok, first off, this recipe is DELICIOUS!!! I just made it for the first time to take to my family's Thanksgiving dinner. It took longer to bake than the recipe said, but I had added some decorative crust to the top, so maybe that's why. A toothpick came out clean after 1.5ish hours in the oven. So even though it still jiggled a little bit, I figured it was done. It exceeded my expectations! Perfect balance of tart to sweet to creamy. I didn't cut the rhubarb smaller, just thawed a bag of chopped frozen stuff &amp; tossed it in with the strawberries. I will DEFINITELY be mashing this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol t"
},
"reviewBody": "Delicious! Added 1 T tapioca, 1/4 t vanilla and used Half and half ...... used frozen rhubarb and strawberries set out for about 30-60 min....perfect! (Baked longer too)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katherine"
},
"reviewBody": "This was the first time I have made this recipie. So easy and I wouldn't change a thing!! My family loved it !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelby Gantt"
},
"reviewBody": "Very yummy! This pie was super easy to make though I did not originally buy enough rhubarb stalks for 3 cups of rhubarb. I would recommend buying 4-5 stalks because 3 stalks only got me to 2 cups. I also added a little vanilla to the filling and used a premade unbaked crust from the store. I loved this pie it was yummy but not overly sweet. I ate it for breakfast this morning too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Redrockmomma"
},
"reviewBody": "If you use a store bought pie crust - as suggested by the chef - you will not be able to fit in all the prepared custard filling. If you try (I did), be prepared for a huge spillover and mess! Most of the custard was on the cookie sheet, and not in the pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FRITZIE"
},
"reviewBody": "I used about 50/50 rhubarb and strawberries as I had more strawberries then rhubarb. I didn't make a pie but used frozen tart shells that I had in the freezer and wanted to use. It was a bit messy to pour the custard into the shells but the end result was still delicious. I didn't put the glaze on it. After a few days later, the shells got soggy so next time l'll try using a pie shell. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Low Arrowood"
},
"reviewBody": "This is, above and beyond, the best pie I have ever made! I used my homemade strawberry-rhubarb jam to glaze the pie and it made it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Donahue"
},
"reviewBody": "I used all rhubarb and thought it a good recipe and product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noreen Smedley"
},
"reviewBody": "OMG! OMG! OMG! You all are in for a real treat with this one!!! It is the best strawberry rhubarb custard pie I have ever tasted!!! Just the right amount of tart/sweetness, and that custard, delicious!!!! I didn't change a thing and yes, I will definitely make this my go to rhubarb pie from here on out!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Boullosa"
},
"reviewBody": "I did watch the video twice and am glad I did. I didn't change anything but next time I will add 1/4 cup of flour.\n\nLoved it-----Judy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Made this and it was gone in 2 days. I have shared with friends who also grow their own rhubarb. Of all he rhubarb recipes I have used this one is the Best!!! For the topping I did change it some. I added 1/2 brown sugar, 1 cup oatmeal 1/2 stick butter, with the strawberry jam it gave it a nice crisp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Steinberg"
},
"reviewBody": "Chef John did it again. My dad and I fought over the last piece of pie. I did not change a thing and enjoyed every bite. Go for it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "L Jody Manwaring"
},
"reviewBody": "It was so easy to make and delicious....I was short on rhubarb only 2 cups so increased strawberries to 2 cups. Excellent! It is definitely a keeper recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jayne Roufs Hudson"
},
"reviewBody": "I made this pie today and it was incredible. I had an extra cup of strawberries and an extra cup of rhubarb so I added an extra 1/3 cup of sugar and 3 tablespoons of flour plus 1 teaspoon Almond flavoring. The strawberries were frozen so the pie turned out a little too wet. Next time I need to add a bit more flour. I made the custard as indicated. I didn't have strawberry jam on hand so I used strawberry/rhubarb. This truly is the best rhubarb dessert I have ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle Harshenin"
},
"reviewBody": "Store bought pie shells are always smaller than homemade so this recipe as written would way overfill one pie shell. I doubled this recipe and filled 3 pie shells perfectly. I also added 1.5-2 cups of strawberries to the mix just to use them up which worked out perfectly for my 3 pies. I baked in a convection at 325 on a cookie sheet, they were done at 1-hour (no spillage)."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/223069/strawberry-rhubarb-custard-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12954/desserts/pies/fruit-pies/strawberry-pie/",
"name": "Strawberry Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/223069/strawberry-rhubarb-custard-pie/",
"name": "Strawberry Rhubarb Custard Pie"
}
}
]
}
}
, "about": [
]
}
]