				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Strawberry Yogurt Pie I"
,"datePublished": "1998-06-29T11:36:17.000-04:00"
,"dateModified": "2022-07-14T16:12:54.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Donna"
,"url": "https://www.allrecipes.com/cook/24323027"
}
]
,"description": "Strawberry yogurt, whipped topping and sliced strawberries are combined, poured into a baked crust and frozen overnight. Garnish this creamy-sweet pie with sprigs of mint and whole berries."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bKvF2G5F5v6q9CAlbSFNxZhMavE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9204696-7be6b345847549cfbf5fffea4a7c2485.jpg",
"height": 2000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Strawberry Yogurt Pie I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "64"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "317 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "221 mg"
,"sugarContent": "26 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"2 (8 ounce) containers strawberry flavored yogurt",
"1 (12 ounce) container frozen whipped topping, thawed",
"1 cup strawberries, finely chopped",
"1 (9 inch) prepared graham cracker crust" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Mix yogurt with 3 and 1/2 cups of the dessert topping until blended. Sweeten the strawberries, if necessary. Mix in strawberries and spoon into crust."
} ,{
"@type": "HowToStep"
,"text": "Freeze for at least 3 hours or overnight, if possible, until it&#39;s firm."
} ,{
"@type": "HowToStep"
,"text": "Remove from freezer and top with remainder of dessert topping. Store in freezer."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StephN"
},
"reviewBody": "I just made this for a pie in the park with a bunch of other girls. They loved it! Had made two 6oz since my 9oz broke. Turned out really well, that I'm making another for Thanksgiving. I also added grated chocolate into the mix and on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peggianne "
},
"reviewBody": "I have made many a big tray of these in the restaurant I worked at for catering. Sometimes I used Oreo cookie crust and sometimes I used graham cracker crust. I prefer the Oreo cookie crust. I also used strawberry gelatin powder in the filling. This helped it firm up and also gave it a better flavor and color. I never froze it but did leave it overnight in the fridge to set. I saw several comments on here that said they were having trouble with it setting up and trouble taking it in and out of the freezer to thaw. I see no reason for that. This was a good start to a recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lisa Altmiller"
},
"reviewBody": "While definitely easy and for beginners, this pie was just ok for us. I used Yoplait strawberry yogurt. I also made 2 pies. One with a graham cracker crust and one with an Oreo crust. Both were good but the graham cracker crust was better. Next time I’ll use less yogurt because it really overpowered the strawberry taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lindsay"
},
"reviewBody": "We liked this. It's very refreshing so perfect for a hot summer day. I found it to be very hard to cut, even after sitting on counter a half hour to thaw. I bet this would be great with other flavors such as peaches with peach yogurt, or blueberries with blueberry yogurt. It 's not overly sweet despite the whipped topping, which for us is a plus."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jtcooks77"
},
"reviewBody": "This was very quick and easy to make! Due to dietary restrictions in my family, I made my own (gluten-free) graham cracker crust, and used non-dairy coconut-based whipped topping. Knowing when to cut into it, both for ease of cutting and eating, was a little tricky. Mine was in the freezer overnight and I let it thaw for about 1 hour before serving, and could have gone longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cupcakes and Cutlery"
},
"reviewBody": "This fun frozen Strawberry Yogurt Pie is a dessert I'll be making my family all summer long! The icy texture was super refreshing and creamy at the same time. The fresh fruit really gave it a flavor I know my kids will love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Confessions of a Grocery Addict"
},
"reviewBody": "Nice and creamy, though a little sweet for my taste. I'd like a bit more tang from the yogurt portion and a bit more salt, maybe in the crust.\n\nMy plan for next time is to use plain greek yogurt with strawberry preserves to \"make my own\" yogurt, and try a pretzel-graham mix for the crust. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Young Jennifer"
},
"reviewBody": "I have been making this pie since the '70's when one of my co-workers brought it to work. It is so refreshing and delicious, especially on a hot summer day. I have never frozen it- just put it in the fridge for a couple of hours and it sets up nicely. I also don't add the extra whip cream on top- I just use an 8 oz. tub of cool whip mixed with 2-8 oz. tubs of yogurt. This is such a fun recipe because you can really use your imagination to change it up. Any flavor of yogurt or combination of fresh fruit (or no fruit it you don't have it) works well. You can also used a chocolate graham cracker crust with shaved chocolate on top-yum! It is just as good with the low fat Cool Whip and low or no-fat yogurt, so can be made a little healthier depending on your crowd."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladyt"
},
"reviewBody": "I am not a fan of yogurt but I? find this recipe to be a very tasty and refreshing low calorie treat in lieu of eating ice cream. I made this recipe as listed, however I blended in all of the whip cream and it was simply delicious. Initially, I? let the pie sit at room temperature to soften up a bit before cutting into it. Once cutting it, I cut the entire pie in slices and this made it easier to serve any leftover slices at a later time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica McLachlan"
},
"reviewBody": "This was good! My family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce"
},
"reviewBody": "I made this with blueberry yogurt, fresh blueberries in a 'Nilla Wafer crust. Guests loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonniejean Suttlemyre Brucks"
},
"reviewBody": "My mother has made this recipe for years! It's a winner during the long hot days of summer! I love to add mashed banana in the mix! We don't add whipped topping on top. Mixed in is quite enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan"
},
"reviewBody": "I have been making yogurt pies since the mid '70's. I drove a truck for Dannon for 12 years. These can be made using any flavor yogurt that you prefer. I always used one 8oz. Dannon yogurt, one small tub of cool whip and one graham cracker crust. I never froze them. Just put in the fridge for a couple of hours and it will firm up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tim AndJoelle Haseley"
},
"reviewBody": "This wasn't so great. Just didn't taste well after being frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LIZARD7927"
},
"reviewBody": "This pie will always remind me of my grandma. Its good on a hot day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jason F."
},
"reviewBody": "Had a nice, light strawberry flavor. Found that the pie was hard to cut and eat after taking it out of the freezer though, even after sitting out for a little while. I really don't think this pie really even needs to be frozen at all. Next time I will just make the filling, fill the pie shell and keep it in the fridge instead of the freezer. Has a fluffy texture that way instead of being hard as a bullet when frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefK"
},
"reviewBody": "Easy and light. Love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "halster"
},
"reviewBody": "I have been making this recipe for a few years now and I can't get enough of it in the summer. I don't change a thing. I've tried it with others crusts and prefer the graham. Yes, I eat it for breakfast too. First, it's got 4 ingredients and it takes 10 minutes to prepare - love. Everyone always loves this pie, even people like my family who normally turn their noses up at Cool Whip. I find that the crust does get mushy on about the third day in the fridge but I haven't had problems with sogginess before that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "it was very good and easy to make everyone liked it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tenshi0019"
},
"reviewBody": "This pie turned out beautiful but that was about it. It's a hassle in that if you don't finish the pie right away, it turns into this nasty mush. The flavor is very mediocre. It's like eating strawberry with whip cream which is pretty much all that this is. I only give it 3 stars because of how pretty it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "CarolZ"
},
"reviewBody": "Can't really rate this accurately yet because I have not eaten it yet...I did taste it and it's delicious, that's not the problem. The problem is that this pie absolutely has to go into the freezer. I have it now in the fridge for over 10 hours and I can put a spoon right to the bottom of it...it's like mush. So no way (using 8 oz. yogurt cups and cool whip, does this gel..it just does not happen, it might taste great, but it is like mush, absolutely MUST go into freezer to set.) Problem with that is that when I made this about a year ago (this is only my second try) I did put it into the freezer...and the whole thing crystallized, then when it started to thaw, it was all wet from the ice crystals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Nutting"
},
"reviewBody": "Mad this with 2 key lime pie lite yogurts and 1 ff container cool whip. Yumm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "esue"
},
"reviewBody": "Followed recipe as stated - put in freezer.\nIt was to frozen to eat for dessert. Put in refrigerator\nand it was delicious the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicapower1"
},
"reviewBody": "Very good! \n\nMixed in bananas instead of strawberries.\nUsed the plastic cover for the pie crust to cover the pie (no freezer issues).\nUsed REAL whipping cream, trying to stay away from processed food I can easily make myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "2nekked"
},
"reviewBody": "I used a store-bought crust and the crust was 2x the size of regular ones and it had an extra 2 servings. On top of the crust, I layered it with banana slices. There werent any fresh strawberries at the local market, so I went for frozen unsweetend mixed berries instead. On top of the yogurt+whipped topping mix, I added another layered of sliced bananas then piled on the rest of the berries. I sprinkled some coconut flakes on top at the end. Freezed for a hour, then in the fridge for another. Tastes amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "mrsjonze"
},
"reviewBody": "I didn't care for this, but it could have been my error for not baking/heating the pre-made pie shell. I tried a couple versions since i was using tart shells; I did the original, but I also made a \"w/cream cheese version.\" Neither turned out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eacreativity"
},
"reviewBody": "Very good, and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TheBritishBaker"
},
"reviewBody": "First of all I did use a shortbread pie crust. I did like this recipe just felt it was far too much frozen yogurt. If I make this again, I will halve all the ingredients so that it only comes to the top of the pie crust. The pie crust was gorgeous, but so small compared to all the frozen yogurt. I made this and stored it in the freezer for a few days before we ate it. This recipe is so versatile, you could use all combinations of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kellib74"
},
"reviewBody": "Mixed review, My husband rated it a 4, yet my son and I didn't particulary care for it. Kepping it frozen, takes a very long time for it to thaw when you want a piece, and I don't like biting in to frozen strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "karrrrine"
},
"reviewBody": "I tried this recipe, and it was ok, except for the kind of wierd texture it got after freezing...So I decided to try an even lighter version, and it worked fabulous!! Instead of using strawberry yogurt, I used non-fat plain (a little over a cup), a cup and a half of light cool whip, and mashed about 2 cups of fresh strawberries. I stirred them together, topped it with sliced fresh strawberries, and let it set overnight in the fridge.....Hardly and liquid, and utterly delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried to make this a low fat and low carbohydrate as possible, so I made this using a low carb yogurt and cool whip free. I made my own crust using low fat graham crackers, melted butter and 2 packets of splenda for a little sweetness. It froze well, but would be better just refrigerated. All that sampled it thought it was really good. I will make this again, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie B"
},
"reviewBody": "I just mix all the whipped topping into the yogurt and place in the fridge, I never freeze it and my family makes this pie all summer long. Very easy and great with just about any yogurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janet"
},
"reviewBody": "I made this pie for a Valentine's dinner...so easy and tasted wonderful! I used a chocolate crust and sprinkled dark chocolate shavings on top. It complemented the filling beautifully. I let it thaw in the fridge about an hour before serving - perfect consistency. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ree"
},
"reviewBody": "everyone loved it, excellent very simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RMSR"
},
"reviewBody": "This is a definite go-to dessert for summer. The ingredients are simple, and the possibilities are endless! I did modify the recipe though. I used five, 100g yogurt cups instead of the two packs of 8oz. The flavours I chose were strawberry chantilly (X3) and raspberry-cranberry crumble (X2). I also used sliced bananas (three) instead of strawberries; I drenched some in lemon juice for the topping to avoid browning. I found the base recipe makes enough filling for two pies, but since I only had one crust I saved the rest for another dessert. I also skipped the whip[ped topping on the top of the pie as there was aready enough in it. Next time I will incorporate some coconut into this, as I think it would compliment this pie nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lesley"
},
"reviewBody": "Another hit with the family. Rave reviews &amp; so easy to put together!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bellydancer"
},
"reviewBody": "My family thought this was pretty good. It is way to hard and cold to eat straight out of the freezer, it needs some counter time to soften it some. I'm not sure if I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "Loved it! Used up the last of our Easter strawberries. Used a Keebler chocolate graham crust, low fat yoplait and cool whip. Put a few slice berries on top, but skipped the extra cool whip on top. Had no problems with funny taste or texture from the freezer. I actually prefer to serve it only partially thawed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ROWAN1099"
},
"reviewBody": "Really good with the graham cracker crust recipe from this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "teamparsons"
},
"reviewBody": "I have made this recipe for many years and it has always been a favorite summer recipe for our family! Great for company too! I tried it with the whip cream on top and felt like it was too airy and didn't need it, since there is already whip cream mixed into the main part of the pie. We love it on a chocolate pie crust with hot fudge drizzled over the top. You can even garnish with chocolate covered strawberries to make it pretty! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "family of five"
},
"reviewBody": "Just OK. When it was thawed it seemed too thawed and when it was frozen or still slightly frozen it was missing the flavor/ texture you would be hoping for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "countrycooker67"
},
"reviewBody": "I used frozen strawberry's that i picked this past summer and they where fine. My wife enjoyed the pie .I will make this again only with fresh strawberry's"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Camieyes"
},
"reviewBody": "I grew up with this same pie, it's definitely a huge hit with kids! I don't do any measuring though, I don't eat much pie so I like to use the mini graham cracker crusts. Either way, the pie is Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D"
},
"reviewBody": "Easy to make. Requires some advance thought to thaw before serving. It's much better after it's been thawed for an hour or so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blueeyes"
},
"reviewBody": "We used low fat strawberry yogurt. We didn't freeze it, we put it the fridge for an hour. We also didn't add any more whipped topping. It was delish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "paisleyduck"
},
"reviewBody": "This recipe is super easy! And I also feel like its not TOO bad for you. I used Dannon Light and Fit Strawberry Yogurt and Lite Cool Whip to reduce the calories. I couldn't find fresh strawberries OR sliced frozen ones at my grocery store so I used frozen unsweetened mixed berries to mix in. Delicious! Not too sweet, yum. The only resaon I am not giving this 5 stars is because in the freezing process the pie filling got a little crystally...It was kinda wierd. Maybe next time I will try mixing in some gelatin so I don't have to put it in the freezer to set up. Thanks for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha~"
},
"reviewBody": "This pie is great! I didn't layer the whipped cream on top of the frozen pie because I felt it would be better mixed in. I didn't have the freezer taste that others mentioned, but I also took the plastic inside from the pie crust and covered it with that. It worked out really well. It was like if you had froze a bunch of go-gurts and then put them in a grahm cracker crust. Soooo delish! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Zeke"
},
"reviewBody": "I love cool whip but I did not really like the pie. It had too much frozen taste and I covered it during the three hours in the frezer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Shorter Hicks"
},
"reviewBody": "This pie is the easiest pie ever to make and it's absolutely delicious! I made it with sugar-free yogurt and light whipped topping to cut the calories even further. I'm anxious to try it with peaches, raspberries and blueberries! Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigeater"
},
"reviewBody": "I just put this in the freezer and tried the filling and it's delicious!Can't wait till it's frozen. Thanks for the great and simple recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLINDDIAMOND"
},
"reviewBody": "We had a huge tub of raspberry yogurt and didn't know what to do with it; my boyfriend and I got tired of just eating yogurt. Found this recipe and it was super easy to make (I'm a college student just learning to cook.) He loves it! An \"A\" for ease and taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "we also tried this with Peach yogurt and low fat whipped topping. It was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Try this with a chocolate graham cracker crust!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12225/strawberry-yogurt-pie-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
"name": "No-Bake Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12225/strawberry-yogurt-pie-i/",
"name": "Strawberry Yogurt Pie I"
}
}
]
}
}
, "about": [
]
}
]