				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Strawberry Pretzel Pie"
,"datePublished": "2000-04-13T23:23:56.000-04:00"
,"dateModified": "2020-06-18T23:01:45.000-04:00"
,"author": [
{"@type": "Person"
,"name": "IMJEN2"
,"url": "https://www.allrecipes.com/cook/57499"
}
]
,"description": "Salty and sweet describes this delicious pie to a tee. This pie &#39;s crust is made from crushed and sweetened pretzels with a bit of melted butter to hold everything together. A sugared whipped topping and a cream cheese layer is spread over the baked crust, and finished with a chilled frozen strawberry and gelatin concoction. This recipe makes a large 9x13-inch pie."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/hmB-Zv05QW62uYhiB27m9ie1q4c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4503540-441b02c5ab574ddeadb2abb06c6ff2bf.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Strawberry Pretzel Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "91"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "332 kcal"
,"carbohydrateContent": "44 g"
,"cholesterolContent": "15 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "8 g"
,"sodiumContent": "368 mg"
,"sugarContent": "34 g"
,"fatContent": "17 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"2 cups coarsely crushed pretzels",
"0.75 cup margarine, melted",
"1 tablespoon white sugar",
"1 (8 ounce) package cream cheese, softened",
"1 cup white sugar",
"1 (8 ounce) container frozen whipped topping, thawed",
"2 (3 ounce) packages strawberry flavored Jell-O®",
"2 cups boiling water",
"2 (10 ounce) packages frozen sweetened strawberries (do not thaw)" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl mix together crushed pretzels, melted margarine, and 1 tablespoon sugar. Press mixture firmly into bottom of a 9x13 inch baking pan. Bake in preheated oven for 8 to 10 minutes, until lightly browned. Cool completely."
} ,{
"@type": "HowToStep"
,"text": "In a medium mixing bowl, beat together softened cream cheese and 1 cup sugar until smooth and fluffy. Fold in whipped topping and spread mixture evenly onto cooled crust."
} ,{
"@type": "HowToStep"
,"text": "Place gelatin in a medium heat-proof bowl and pour in boiling water. Stir gently until gelatin is completely dissolved. Add frozen strawberries and continue to stir until mixture begins to thicken. Chill until semi-firm but still pourable. Pour gelatin mixture over cream cheese layer. Chill at least 2 hours before serving."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kitchenista Jane"
},
"reviewBody": "Maybe I didn't let the crust chill long enough, but I was expecting crunchy and got soggy... the flavor combinations are really good, though, so I'll try again. It's a perfect use for strawberry season. Some recipes use frozen, others use fresh. I prefer fresh :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RusoJap"
},
"reviewBody": "Always a winner. I’ve made this multiple times and experimented with different jello flavors and fruit combinations, and ALL of them were tasty. (So far, though, the lime jello with a berry mix has been our unexpected favorite). Have fun with this one. And my family personally likes a thicker bottom pretzel base, so I add more of those ingredients to the bottom when making. But great recipe no matter what the alterations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kathy Lynds Clow"
},
"reviewBody": "2nd time I made itI left the sugar out of the pretzel crust and that was a mistake. I guess the sugar melts and keeps the crust together. I cut the sugar in the cream cheese in half and it was perfect. mad the top as suggested and everyone loved it but as I said the crust would not hold together. I will make this again but will add 1 tbsp of sugar to the pretzel mixture.\nMy advise to rocksteady is you need to leave the pretzels in small pieces not in a fine powder. the couch of the pretzels is what makes this dessert so wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellie Boyd-Agrusa"
},
"reviewBody": "I make this dessert for every family get together. It is the most requested food at our gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dkwangok"
},
"reviewBody": "A yummy sweet &amp; salty dessert. I cut sugar &amp; butter in half and it came out better. Cream cheese mixture is amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chacha"
},
"reviewBody": "Definitely a winner recipe &amp; always requested to be made at family gatherings. It’s a pretty dessert as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hannah Crandall"
},
"reviewBody": "My family loves this dessert so I was on the hunt for a good recipe. All in all this recipe was wonderful. My only complaint would be the frozen strawberry part. I found it was really difficult to get them to melt completely. If i were to use this recipe again, I would definitely use fresh strawberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joni Dee"
},
"reviewBody": "easy to make ... too fancy for my family but they loved it ... it's very rich in flavor ... great for taking to parties as a party dessert to share .. plenty for everyone. Add some chocolate syrup as a \"drizzle\" over a piece for a picture perfect dessert!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "I have made this recipe for years and is a family favorite. I mix the pretzels and sugar and spread the mixture over the bottom of the baking dish. Then, I drizzle the melted butter over the entire layer before baking it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sally Twesten"
},
"reviewBody": "We loved this and my 12 year old daughter was ready for me to make it again while eating the last piece. I made it as written except for scaling it back just a bit to fit a 7x11\" glass pyrex dish. Let the pretzel base cool and even put it in refrigerator to make sure it set nicely. Had plenty of filling (I didn't cut that back, just didn't use it all in this dish) so I could plop hunks in each corner and spread easily over the entire crust, making sure to seal all edges. I used 1 1/2 cups fresh strawberries since they were in season and sliced them, adding just 1 T sugar and a teaspoon of vanilla, letting them macerate in fridge while I made the base. Once berries had released some juices, I added them to the jello and let it set until it got thick but not set. Spread easily on the filling and set up nicely. Cut into squares easily and crust stayed on as part of the dessert square. One reviewer was not sure it was company faire, but I'd disagree. This would be a wonderful dish to take to a picnic or serve at home. Just make sure to cut big enough pieces so people don't feel badly because they want seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raechael"
},
"reviewBody": "This is DELICIOUS!!! I used 3 tbsp of sugar with the pretzel mixture instead of one, and halved the cool whip due to personal preference. It tasted wonderful! I will make this many more times!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Czuprynski"
},
"reviewBody": "This is one of my favorite deserts that I can actually make myself"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Smith"
},
"reviewBody": "After reading the many reviews, I want to add my two cents. I have been making this for over 20 years. The water has to be BOILING hot, if not, the jello will not set properly. Thus, the strawberries DO have to be frozen and WILL melt. If you do not know how the process of jello works, this is not the recipe you should start with. If you have non-frozen strawberries, you need to add ice. The idea is to have 4 cups of fluids to the large package of jello. The frozen strawberries add water. In summary: Boiling water to jello, dissolve, then add ice or frozen items/ice to set."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chenriksen"
},
"reviewBody": "I make it with real whip cream (because I don't like fake stuff) and it was still delicious . It holds up just as well.\nChenri"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel Bommarito"
},
"reviewBody": "I used fresh strawberries since they are in season. This is delish and unlike any other recipe I have ever tried or have had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef"
},
"reviewBody": "This dessert is awesome! I use brown sugar with the pretzel mixture but I'm sure white sugar is fine. I always make this for summer picnics &amp; it is a crowd pleaser! The combo of sweet &amp; salty is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "braniffb13"
},
"reviewBody": "My family loves this! Some people seem to be making it wrong and rating it poorly for it. The pretzels shouldnt be crumbled to dust, its not a pie crust, just broken into small pieces. Also, ensure that you are completely sealing the pretzel layer with the cream cheese layer to ensure that the jello layer doesn't seep through and make the pretzels soggy. When made right this dessert is amazing! (I messed it up my first couple times too, but I was doing it from memory of a friends recipe)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Jones"
},
"reviewBody": "Made this for a BBQ at my house and it was a major hit! Nobody had ever had it and they all loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jharwood"
},
"reviewBody": "This recipe was a big hit a my sons birthday party thanks for the recipe allrecipes.com"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bethany Vincent"
},
"reviewBody": "I love this. Easy to make and tastes GREAT. Very popular at picnics."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "rocksteady"
},
"reviewBody": "Very dissapointing, I cushed the pretzels up to very very fine pieces, looked like dust and crumbs and it still didnt stay together. I made 2 9in pies bc I was going to take one to a 4th of July family outting.....we tried it Sat, and I didnt feel it was something I would feel good about taking and saying I made it. The kids loved it but I was unimpressed-(the cream cheese layer was yummy though)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane K W"
},
"reviewBody": "good summer dessert"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashelena"
},
"reviewBody": "Mmm... this is so surprisingly good! Balances the sweet and the salty for an awesome taste explosion!!! Give this one a try! ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany C."
},
"reviewBody": "This was my first time making this recipe, I made it for a church dinner. Delicious! Not one spoonful was left! Will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ALL4SARAH"
},
"reviewBody": "I loved this recipe. It is a great way to use up our fresh Florida strawberries. I used about 2/3 of everything to make this smaller to fit in a glass pie dish. I don't know if I would fix it for company but overall it is a great weekday treat. Like other posters I wish I had made the pretzels very fine because they did not bind together. It all tastes good, just a bit messy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CrystalRose82"
},
"reviewBody": "This is the perfect combination of sweet and salty! Alot of the other reviewers suggested crushing the pretzels more finely, but I disagree. I think the crust was great. The only suggestions I have is to use fresh strwberries, sliced and frozen and double the cream cheese layer for a 9x13 pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "INCREDIBLE! A FAV AT A BIRTHDAY PARTY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YOOHOODREW"
},
"reviewBody": "This recipe makes a BIG dessert. I turned it into actual pies by dividing it into 2 pie pans. That way I had one to give away and one to keep. The pretzel and cream cheese layers are the best parts. That salty crunch next to the sweet cream. Mmmmmm. I'm not too crazy about the jello layer - it seemed too sweet. Next time I think I'll just do fresh strawberries on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy S."
},
"reviewBody": "Love this recipe!! We make it for all big family occasions... Thanksgiving, Christmas, Birthdays, etc.!!! Everyone loves it! We have even made it with raspberries and raspberry jello instead of the strawberries. Both ways are so good! My family picks buckets of strawberries during the summer and we freeze bags of strawberries already measured out for this recipe so that we can even make it in the winter! ALl we have to do is pull out and thaw the frozen bag of strawberries, very convienent. YUMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Twin Mom"
},
"reviewBody": "This has always been a favorite for my family. Be sure to make extra of this if you want any leftover. It will be gone in an instant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie F."
},
"reviewBody": "We really liked this. The crust is just the right touch to add that sweet and salty mix. Thought it would be good with a chocolate filling as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Spritegal"
},
"reviewBody": "this was pretty good, a friend of mine brought this to work, and everyone loved it, so i decided to make it for a family function. i wouldnt say its the best, but it was worth making i might make it again, because it wasnt too hard and it tasted pretty good. i would suggest really really crushing the pretzels...i thought i did pretty well but while eating it i decided it would of been better if i crushed them to dust! i think it would also be good with fresh strawberrys..would add more of a home cooked dessert taste to it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcedillo"
},
"reviewBody": "One of my family's favorite holiday recipes! I found that if you spread the cream cheese to where it's completely covering the pretzel layer, no jello will leak to the pretzels (which makes them soggy)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal"
},
"reviewBody": "If you're not too keen on mushy strawberries, raspberry jello with frozen raspberries is an AMAZING substitute! Also, using the same fruit you would normally use atop a cheesecake is really very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christen"
},
"reviewBody": "Thanks Jen! My sister makes this all the time and the whole family loves it. I wanted to make it today but didn't want to bother my sister for the recipe...she has a brand new baby at home. Thanks again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCDance"
},
"reviewBody": "This is a great recipe. I made it for a gathering of 6 people, and all loved it! The only thing I'll do differently next time is to crush the pretzels better for the bottom layer and possibly use more pretzels, since they just barely covered the entire pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drea"
},
"reviewBody": "I have made this recipe many times for family reunions and other get togethers and have been asked everytime for the recipe by more than one person. I don't use sweetened frozen strawberries though, I just use the plain ole frozen ones and slice them as I go and it tastes just wonderful. I also use a couple more handfuls of pretzels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "(ME)"
},
"reviewBody": "This is a GREAT recipe. I like to make this in the largest round glass pie pan I have. It doesn't use all of the cream inside, but I use it to dallop over the top. Any extra Jell-O I put in a small bowl to set (the kids take care of that for me :c). I usually arrange fresh berries over the cream mixture after spreading. It makes a fantastic dessert, or thing-to-bring for a picnic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "misspiggy067"
},
"reviewBody": "This is the exact same pie that my mom makes, she got the recipe from my sister whom I believe got the recipe from either Kraft foods!!!!I thought that the intention of this site was to post original recipes. It is a wonderful desert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marylu"
},
"reviewBody": "This was a very yummy dessert. Everyone liked it a lot. One note though, the jello and strawberries should be mixed last, because it sets up very fast. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "I absolutely love this recipe. I made it for a family get together and everyone raved about it. Thank you for the easy yet delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MomSavedbyGrace"
},
"reviewBody": "Made this for last night, husband and I went over our friends' house. My friend and I really liked it, I don't know that our husbands were as crazy about it. It is kind of a glorified Cool Whip/Jello dessert - but who cares - as other reviewers have said, the salty/sweet combo is brilliant! I wanted to make mine in a 9\" round dish, so it looked more like a pie. Plus a 9x13 would have been too much for the 4 of us. So I used about 1 1/3 cups crushed pretzels &amp; decreased the butter to 1/2 cup for the crust. I kept the cream cheese/cool whip/sugar layer the same, and then just used one box of gelatin/one cup boiling water/one bag of the frozen SLICED strawberries. Worked perfectly, was not overflowing at all, the pie had all the layers, sliced up very nicely after being chilled. This is a great summertime dessert, light and refreshing. Only next time I will probably crush the pretzels even finer, helps the crust to hold together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "B. Hyatt"
},
"reviewBody": "I did everything to the letter, and the ladies at church LOVED it. I did thaw the strawberries just a bit in the microwave so that I could break them up more. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNASEA"
},
"reviewBody": "I had this dessert at a picnic many years ago. I was pleased to find that when I prepared this recipe, it was the exact recreation I was hoping for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "This dish is a family favorite because of the sweet and salty tast. When you try this dish you are pleasantly suprised how great it tastes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Quick and easy - my kids love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kandi Brooks"
},
"reviewBody": "Great dessert, it reminds me of a strawberry sundae!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taryn C."
},
"reviewBody": "This stuff looks funny but taste great. The combo. of sweet and salty is awesome. You gotta try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINAH1"
},
"reviewBody": "This is awesome! I made it for a party recently and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Sancrant"
},
"reviewBody": "Thank you Jen! I've been looking for this recipe, had it a few years ago at a church dinner and lost the recipe I got at the time. I love that it's made with things most of us keep on hand, easy enough for young, aspiring cooks to make and it's really pretty enough for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PARADISO"
},
"reviewBody": "Ladies~ this is the perfect dessert for that special time of the month. It combines sweet and salty beautifully. I highly suggest adding an extra brick of cream cheese &amp; blending the extra sugar to taste. As for the crust, you do want it pretty finley ground and may need to put a bit of extra butter to have it hold together better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Let me start by saying that I am NOT a cook! It's not very often I make things because they often seem too difficult. This looked challenging and I thought I would try it. Turns out, its not hard at all! Everyone really enjoyed this, even my hard-to-please friends! The only problem I had was a few spots of the crust got soggy, and I believe that is because my cream cheese mix didnt cover the crust as well as I should have. I made everyone guess the crust and they were surprised when I told them what it was. VERY GOOD!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KARARNMI"
},
"reviewBody": "I could live off this. I also cut down on the butter and sugar and it still turns out great. Vastly different textures and flavors (salty/sweet/sour)makes it really unique but so simple. Fun and easy recipe to make with my six year old who likes to crush the pretzels in a freezer bag by stomping on them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SADDLESORE55"
},
"reviewBody": "Turned out okay, I was hoping it was be a little more elegant since it was for a birthday. Tasted like what it was- a cool whip dessert. I loved the crust though, I use that crust on my other strawberry pie recipe and get rave reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SEE NU"
},
"reviewBody": "This recipe is really good. I also have done it with raspberry Jell-O and frozen raspberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Chrissy Weldon Barbusca"
},
"reviewBody": "I made this to take to a party, and no one disliked it, but my husband and I were unimpressed. There's not much mixing of flavors, and even though it does have the sweet-salty combo going on. Most highly-rated recipes on this site are way better than this. If you're looking for something to make with strawberries, keep browsing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wrocklage72"
},
"reviewBody": "I would use more pretzels and crush them finer, it seemed like a lot of butter in the crust, and it broke apart somewhat when I spread the cream cheese mixture on top. Also, there's no need to chill the jello mixture, the frozen strawberries cooled it down quickly, and you want to put it on top while it is still pourable, of the top looks like strawberry jam instead of jello. I still tasted wonderful though, everyone at work loved it. I used a bag of mixed berries instead of strawberries and used raspberry jello since that's what I had in the house. GREAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Connie"
},
"reviewBody": "This is DELICIOUS!! We can't get enough of it!! I am going to try it with peaches when they are in season! You can add fresh raspberries or blueberries to the strawberry mixture for some added flavor. YUMMMMMMMY!!! Can I say it again? YUMMMMMMMY!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Suzanne"
},
"reviewBody": "Crunch the pretzels into smaller bits so that that crust stays together better. Also, make sure the cream cheese mixture is completely covering the pretzels, otherwise you end up with jello in your pretzels."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GINNYGOS"
},
"reviewBody": "Kids loved it- buy either fresh or thinly sliced frozen berries"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JULTODGAB"
},
"reviewBody": "I did not do exact measuring and still this recipe was perfect! Very hard to make this wrong and EVERYONE loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MOMZRIGHT"
},
"reviewBody": "I substituted pineapple juice for the boiling water and 1 pkg. raspberry gelatin/1 pkg. strawberry gelatin. Excellent excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was so different, yet so enjoyable. I used fat free whipped topping and low fat cream cream. I also only used 1/2 cup butter. It was really good. Everyone thought it was so unique. I would recommend using sliced stawberries not whole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "There weren't many kids around, plus the adults ate it so fast. It was a big hit at our picnic &amp; it's sooo easy to make. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Hilliard Nelson"
},
"reviewBody": "Two cups of pretzels didn't cover bottom of 13x9 pan so I added another cup. While this is easy to make, you need time for each layer to thoughly cool. I used fat free Cool Whip, and reduced margarine to half a cup. Everyone raved about this low fat dessert"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been looking for this recipe forever! Thanks.. It was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "schmerna"
},
"reviewBody": "The strawberry-gelatin layer was a little too sweet. Otherwise, this was a great blend of flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redbusc"
},
"reviewBody": "Tasty dessert recipe! I would partially thaw the strawberries next time I make it! It was too hard to break up the strawberries in the gelatin mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It sounds weird, but this is a GREAT dessert. It is SO good, it doesn't last more than a day or two! Its very rich, so one or two slices (if you're a glutton) will fill you up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DLK1021"
},
"reviewBody": "This is great to take to bar-b-ques!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nora"
},
"reviewBody": "This is a very good strawberry dessert, even people who say they don't like strawberries will come back for more.\r\n nora"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "sweet and salty at the same time!! Sure to please children and adults alike!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17757/strawberry-pretzel-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
"name": "Fruit Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/12954/desserts/pies/fruit-pies/strawberry-pie/",
"name": "Strawberry Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17757/strawberry-pretzel-pie/",
"name": "Strawberry Pretzel Pie"
}
}
]
}
}
, "about": [
]
}
]