				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Stuffed Flank Steak"
,"datePublished": "1999-10-26T17:41:58.000-04:00"
,"dateModified": "2023-01-27T06:58:41.000-05:00"
,"author": [
{"@type": "Person"
,"name": "BarbiAnn"
,"url": "https://www.allrecipes.com/cook/24321377"
}
]
,"description": "Tender stuffed steak with layers of prepared stuffing, green onions, and red bell pepper served with a mushroom and red wine sauce. Easy and elegant!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/mXRjTdSHyfPS6RHhe_XM2WUW7v4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4520039-e9fff42d2caf43ca80ef189870656fb9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Stuffed Flank Steak"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "92"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "497 kcal"
,"carbohydrateContent": "29 g"
,"cholesterolContent": "71 mg"
,"fiberContent": "4 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "1102 mg"
,"sugarContent": "4 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups dry stuffing mix",
"1 cup boiling water",
"2 tablespoons butter",
"1.5 pounds flank steak, pounded thin for easy rolling",
"2 green onions, chopped",
"1 red bell pepper, finely chopped",
"1 (10.5 ounce) can mushroom gravy",
"0.25 cup red wine",
"1 clove garlic, minced",
"2 tablespoons grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Combine stuffing mix, water, and butter in a medium bowl; mix well and let stand for 5 minutes. Spoon stuffing onto steak, leaving a 1-inch border; scatter green onions and red bell pepper on top."
} ,{
"@type": "HowToStep"
,"text": "Roll up from the long edge of steak and secure with wooden toothpicks. Place steak seam-side down in a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Combine gravy, wine, garlic, and cheese in a small bowl; mix well and pour over steak."
} ,{
"@type": "HowToStep"
,"text": "Roast in the preheated oven until internal temperature reaches 160 degrees F (71 degrees C) for medium, about 1 hour. Let stuffed steak stand for 5 minutes before slicing and serving with sauce from the dish."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pugaroo"
},
"reviewBody": "I did not use the mushroom gravy. I read the ingredients and it was too processed. Instead I substituted organic low sodium beef broth. This recipe was absolutely delicious and I will make it again. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sammijo217"
},
"reviewBody": "I have nade this for at least 40 years getting the recipe from a friend. My family loves it. You can use any dressing filling you might like. I have even used my husbands favorite, Stove Top Turkey Stuffing. I have never used flank steak as it is very expensive. I used to use round steak and cooked low and slow to be tender. I now use 1/4 inch sliced sirloin and make individual rolls as there are only two of us now. This freeze's well for a fast weekday meal. We do not like the wine so I add with a bit more water. Cream of mushrrom Soup works well also. The bell peppers are not necessary. Very forgiving and easily adapatable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leslie Shack"
},
"reviewBody": "I followed recipe exactly and my steak looked just like the picture. The flavors were good but the meat was TOUGH! Where did I go wrong?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmfrask"
},
"reviewBody": "Would have pounded the flank steak a bit more. I did not do a great job tying together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dmfrask"
},
"reviewBody": "Would have pounded the flank steak a bit more. I did not do a great job tying together"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MaryBeth Felton"
},
"reviewBody": "i will make this again....husband is a happy camper. Will add mushrooms, and will try with mashed potatoes ...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maria Markham Thompson"
},
"reviewBody": "Super fast &amp; easy. 1 hr. was rare for 1 1/2 lbs. Quick gravy sub: 1/4 cup red white in can of cream of mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JVernel"
},
"reviewBody": "Made lots of extra stuffing. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "So the first time I made this it was a train wreck. I didn't get it pounded thin enough and the toothpicks didn't hold it together so everything spilled out. It tasted amazing though with a few changes. I ended up having to use flexible wire BBQ skewers to hold it together and it was still a mess. So today I tried again because despite the mess it had a good taste. I pounded a little thinner but it was still challenging to roll. I used butcher's string this time to hold it all together and that worked well. To the stuffing mixture I added some parsley , little basil and a little garlic. I also mixed the veggies in with the stuffing instead of putting on top. For the gravy mixture I used apple juice instead of the wine I also used sargento six Italian cheese with a little parsley basil in it instead of the Parmesan cheese (mostly because that is what I had on hand the first time and it was so amazing I didn't want to change it ). My husband loved this and asked for it again today and he never asks for anything special to eat !!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laura Arrasmith"
},
"reviewBody": "Very good easy to prep,we loved it! We used crushed up cheese its for the dried stuffin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Tina Puzino"
},
"reviewBody": "The taste is great but the filling got to soggy. This one was a thumbs down from my family mostly because the texture, but I thought it was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CMcGill"
},
"reviewBody": "Trying it tonight. I can tell you, it smells delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcella"
},
"reviewBody": "This turned out great for me. I did pound the meat and removed what I could of the connecting membrane. It was almost, but not quite, fork tender. I made it exactly as the recipe says to, but next time I am going to experiment with a different stuffing and seasonings. Also, I think I could have taken it out of the oven a bit sooner and next time I will check the temp of the meat sooner. Very good and will be making many more times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shauna"
},
"reviewBody": "My husband loved this but I didn't :( It was good but simple. I think next time I make it I will kick it up with some extra spices and maybe even make my own gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyliz5"
},
"reviewBody": "Really great. So easy. I never really had a good, easy recipe for flank. Great one to have. It was a hit at my dinner table ages 3 - 40."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maggie"
},
"reviewBody": "I made this for the first time, and my family LOVE IT. Quick and tasteful. I will make it again and again. Thanks BarbiAnn for sharing this tasteful recipe...Maggie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "opals4me66"
},
"reviewBody": "very good and simple to make. I did my typical marinade for flanks steak first and then used the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mom2Vaida"
},
"reviewBody": "This was a great recipe, i however, did not use a flank steak because i already had shoudler steak (that i got on sale) thawed. i also used cream of mushroom, did not have gravy. the gravy wasn't the best part, the steak was! Photo added by me =) will do again!!! oh, &amp; i served it with twice baked potatoe casserole...b/c i'm a steak n potato kinda gal and a side salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TattooTracy"
},
"reviewBody": "I thought this was a good start recipe. I add a seasoning to the meat before I added the stuffing. And for a nicer gravy I used beef broth marsalla wine, heavy whipping cream and cornstarch.Cooked the meat as suggested next time I will cut the time 15 to 20 min..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "I preferred the stuffing over the steak. The steak turned out to be the consistency of a pot roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TerriC511"
},
"reviewBody": "This was great, I did use the G's Flank Marinade and something came up so it stayed 2 overnights instead of one , but other than the marinade, used this recipe except didn't pound it out, seemed thin enough and didn't have pepper but it worked out wonderful. Moist and really tender !! I loved it and my BF did as well... Great recipe thank you so much..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miranda Sewell"
},
"reviewBody": "AMAZING! I'm giving this one 5 stars because there was nothing that needed to be changed! Both my boyfriend and I love this recipe! We ate it for the next 2 days as left overs and wished we had more! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Desertdutchman"
},
"reviewBody": "Quite good. I would recommend cooking string to tie the roll together. I used toothpicks and about 3/4 of the way through the cooking time the stuffing expanded and the whole roll opened up. Still tasted fine, but wasn't as pretty to serve as I had hoped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KK03"
},
"reviewBody": "I will defintely make this again. My family devoured it. I didn't have mushroom gravy, so I used a packet of brown gravy and the sauce was fabulous. I found the stuffing to be a bit too moist so I will use less water next time. I also like a bit more seasoning, so I will season the meat before stuffing. All in all, this recipe is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mares"
},
"reviewBody": "I used Dales Seasoning to marinade the steak, used savory herb stovetop stuffing mix, sauted red pepper with celery ,then layered those on top of dressing. Didn't do too well butterflying the steak,but toothpicks helped. Two jars of gravy are needed. The aroma when this was baking was just as yummy as the actual eating. Great job.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley K"
},
"reviewBody": "My mother *god rest her soul* made this dish and everytime she made it, my step-dad would say AMBROSIA and he'd have twinkles in his eyes!\n\n\nAs I only had a .95 of a pound of flank steak, I had to recalculate for the 2 servings measurements.\n\nI used one cup of a stove top chicken stuffing mix. To this I added one stalk of chopped celery and half of a regular yellow onion which I sautee'ed both for a few minutes before adding it to the bread crumbs.\n\nInstead of water, I just happened to have some College Inn Beef Broth opened so in it went!\n\nPounded meat then seasoned both sides with some Mc Cormicks Steakhouse Grinder Seasoning and Fresh Cracked Pepper.\n\nDid'nt add any additional salt as the butter is salted and so is the broth.\n\nTo a jar of Heinz Savory Brown Gravy went in the wine, parmesan cheese and garlic. Top back on, I gave it a good shaking *notice how you dont have to use a separate dish for this step* ;-)\n\nServed over egg free noodles with some french style green beans *drool*\n\nThis truly is Ambrosia at its finest and I highly recommend eveyone try this recipe!\n\nP.S., please please please make sure to let the steak rest for awhile before slicing, it helps keep the stuffing intact! :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ETAINL"
},
"reviewBody": "I wasn't terribly impressed with this one, but it was interesting enough that I want to try it again. Felt like the microwave cooked it a bit bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Helen Lang Rosenbaum"
},
"reviewBody": "Very tasty! this is a very rich meal so be careful what you serve with it. Origionally I served it with Asparagus rolatina-not a good choice as both are rich. Now,I keep the side dishes light with just a salad and steamed vegetable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whitney Burns"
},
"reviewBody": "Tried this the other night and it was a hit. I've never tried stuffing any meat before and it was a lot simpler than I thought it would be. I'll definitely make this again and for company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Scully"
},
"reviewBody": "I found that the 2cups of stuffing was too much. However, I added half a small can of chopped mushrooms to the stuffing and put the remaining mushrooms in the sauce. Also, I cooked the flank steak for about 50 minutes-we like it more on the rare side-and it was great!\n I will definietly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanne Musella-Fling"
},
"reviewBody": "Delicious! I didn't put the gravy/sauce on though because I don't like to take away from the taste of the beef. It was delicious and the cooking time on the recipe was perfect - rare in the middle and more well done towards the ends. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lin"
},
"reviewBody": "This was a great recipe!! I had no intention of making this at first. I had defrosted a flank steak and was going to cook plain on the grill and then looked for a recipe containing flank steak. I already marinated it with olive oil, balsamic vinegar, and steak seasoning for a few hours so wasnt sure how it would incorporate into this recipe but it did. Also instead of brown gravy I used a can of campbells brown gravy w/onions (i also didnt have wine but the seasoning from my marinade was enough) which gave it a fabulous taste. I pounded down the meat as much as I could beforehand and also did additional seasoning of salt throughout to make sure it had flavor which it definitely did. I had to do a bit of a butterfly cut on both sides of the meat to ensure that I had enough room to roll it with all of the stuffing. I tied it with string and put toothpicks at the ends to be sure everything stayed in. I also put a bit of mozzarella. I cooked an hour and it came out perfectly and pretty tender, even my two young kids liked this recipe which is surprising as not alot of children like steak. My family liked this recipe and I was pretty impressed with the results. Dont hesitate to make this. I now have something else to cook other than the normal boring things."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ronjennp"
},
"reviewBody": "This was fabulous and my family loved it. I used a green pepper instead of the red and used brown gravy instead of the mushroom gravy and doubled the gravy. I sauteed mushrooms and added them to the top after it came out of the oven and it made a great presentation and was a great addition\nThanks for the recipe!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pastamom"
},
"reviewBody": "This was a really good one. I thought the gravy was a little overpowering in taste, but I'm not much of a gravy person. Will definitly make this again. Maybe next time I'll experiment a bit with the veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VORCHA"
},
"reviewBody": "I have made this twice now. The first time I found the stuffing a bit bland and the steak came out overcooked in the oven. The second time, I used regular onions, satued them in olive oil, added 1/2 cup Parmesan cheese, 2 cloves minced garlic and 1/2 cup slivered pancetta. Rub the outside of the roast with olive oil, rosemary, garlic and salt and pepper. I briefly browned the roast on all sides on the stovetop and then placed in the oven for 30 minutes. I added 1/2 cup of red wine, 2 tablespoons unsalted butter and 1 cup sliced mushrooms to the pan drippings to make the sauce to serve over the roast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jfish1282"
},
"reviewBody": "Used comments from other reviewers and marinaded the steak first. Did not use the peppers or onion, but still found it great. Enjoyed this recipe. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danni"
},
"reviewBody": "I did a lot of alterations to this. I stuffed the flank steak with fresh spinach and Onion Rice (see recipe on this website) I didn't have mushroom gravy, so I used cream of mushroom soup instead. My family loved it! Thanks for the recipe and idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I wasn't very impressed. I thought that the meat would have more flavor from the seasonings used in the gravy &amp; stuffing but it didn't. I was also expecting the meat to be a little more tender. I probably would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca S. Roth"
},
"reviewBody": "I made this using Monterey Style Musroom and Onion stuffing and cream of mushroom soup with roasted garlic. In addition, I added thin slices of colby jack cheese before rolling. This was a great, tasty, EASY recipe and a hit with my family. I think it will become one of my staple recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grace"
},
"reviewBody": "Easy and tasty dish. The stuffing/gravy is really good. I used condensed cream of mushroom soup instead of mushroom gravy. Next time, I might try a different cut of steak and I will try marinating the meat in some seasoning. It is a \"pretty\" dish as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emmy Cruzado"
},
"reviewBody": "This recipe is quite easy to prepare. I did preseason the steaks with garlic salt and pepper to add flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "COOKER476"
},
"reviewBody": "I used skirt steak instead of flank and baked the dish a bit longer. Also, I doubled the gravy mixture to have 1/2 of it leftover to serve at the table. Subbed apple juice for the wine, as the gravy seemed quite salty. This turned out DELICIOUS. My only problem was the presentation. When slicing the meat, the stuffing mixture squished out the sides, and I had goop in the baking dish that was not eye appealing. Any suggestions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really Good. I used some kind of loin steak and added sliced mushrooms. My husband liked it and I was happy because it is a great way to stretch the meat budget"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It had a very good taste, there was too much garlic and red wine though, next time I will just not put as much! Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JOHNREVERETT"
},
"reviewBody": "My wife and I loved it. We increased the amount of garlic to 5 cloves. I want to change this recipe at little... I think more peppercorns would give it a little kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LovingFoodInNYC"
},
"reviewBody": "Very easy, good and elegant to serve! I used someone's suggestion and make a double batch of gravy with fresh mushrooms and saved half of it to serve with the roast. I also added rosemary to give a better flavor. I pounded and marinated the meat overnight with red wine, steak seasoning and soy sauce and it make the flavor bake through the meat! I baked for only 50 minutes because I like my meat med-well and it was perfect! This recipe was very moist but I must admit that I opened the oven half way through cooking and put the fallen gravey back on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ACCARDI"
},
"reviewBody": "Great recipe. My kids loved it! I wouldn't change a thing with the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLARE L"
},
"reviewBody": "Excellent recipe. I didn't have the green onion or the bell pepper. Added regular spanish onions. Just as good. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CRISPYWAFERS"
},
"reviewBody": "This was a very easy and filling recipe. Pretty tasty. Next time I would just mix the pepper and onion in with the stuffing. I'll probably make this again-- but I'll also still look around for other stuffed flank recipes. So 4 stars out of 5-- not to die for-- but a pretty good dinner. BTW. Reduce cook time down to about 50 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JENNMCKENN"
},
"reviewBody": "Excellent recipe. It was nice to make something out of the ordinary. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CATECRUM"
},
"reviewBody": "Came out pretty good. My first time cooking flank steak. Changed a few things to accomodate my families tastes. Omitted the red pepper and green onions, added the garlic and parmesan directly to the stuffing and used brown gravy and apple juice. Needed to cook a little longer only due to my slow oven! Worth experimenting with!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AZNITESKIES"
},
"reviewBody": "Here I am Christmas time looking for this recipe. It has become a tradition in our house. With Christmas with the extended family and the usual turkey and hams at those events this makes a special dinner for us. Adjust and adding more of the gravy is the only change I make. Great dinner with mashed potatoes, a vegatable of choice. We serve the left over wine with dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sioranth"
},
"reviewBody": "I thought this was ok, not great though. The stuffing was prettty good, but the cook time was way too long and the steak got tough &amp; dry. Might be a lot better if the cooking time was adjusted for a med. rare steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was really a pleasant surprise!! The sauce ingrediants didn't sound appealing to me \r\n, but it was wonderful and oh the smell while it cooked! the only part my kids didn't like was the bell pepper ( they are a definate must for flavor though)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The stuffing got yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my family and they went crazy over it! I would suggest sauteing the red peppers and green onions before adding to the stuffing. Otherwise it was perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelley W"
},
"reviewBody": "If you're looking for a new way to cook flank steak THIS IS IT! It was easy and delicious! I used a 2lb. steak and left everthing the same and it was perfect! I wouldn't dream of doubling the gravy because this would seriously detract from the wonderful flavors of the steak and stuffing. It's a keeper and makes great leftovers too! Yummmy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CYNIGAL"
},
"reviewBody": "Delicious!! I tried this on a whim on a Saturday night. Red bell peppers were on sale. My family loved it. The stuffing was delicious! Thank you for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This IS the recipe!! It makes you feel like Emerils dad or something!! I couldn't imagine something so simple to put together with better presentation. A little red wine in the mushroom gravy makes it even better!! 4 Stars does not do this recipe justice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CULMOM37"
},
"reviewBody": "An excellent way to cook flank steak. I would recommend doubling the sauce. A definite new dish in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this for my husband for Valentine's Day, and he loved it. Next time I will season the meat for a little more flavor, but it's definitely worth making again. Oh, also, do double the recipe for the gravy. This is one of those recipes that appears much more gourmet and \"fancy\" when it is finished, more so than it is. Good for guests."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LILLEPTON"
},
"reviewBody": "Good flavor. The steak was cook just right (cooked for 1 hour). I wouldn't say it's the prettiest dish. The sauce has a pinkish tinge (from the wine), it doesn't look appetizing, but it's delicious.\r\nA great way to prepare flank steak."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "isbrac"
},
"reviewBody": "It was very good! I took a little longer to make but it was worth it. Next time I will double the sauce mixture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "preciouspkgs"
},
"reviewBody": "I made this for the first time last week and my husband and kids loved it. I had a little left over, and my mom loved it also!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CATBURT"
},
"reviewBody": "This was a good comfort food recipe. \r\nIt is fairly easy to prepare except for the rolling!!!\r\nMy husband rated it as a redo. So will do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was really easy to prepare. It took a while to cook - but it was worth it. No left-overs and everyone was full. The stuffing alone is a great starch. So, I'd serve it with some veggies or maybe mashed potatoes for the kids."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16319/stuffed-flank-steak/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
"name": "Steaks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1023/meat-and-poultry/beef/steaks/flank-steak/",
"name": "Flank Steak Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16319/stuffed-flank-steak/",
"name": "Stuffed Flank Steak"
}
}
]
}
}
, "about": [
]
}
]