				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sugar Cookie Cutouts"
,"datePublished": "2000-01-17T22:42:27.000-05:00"
,"dateModified": "2022-09-25T00:07:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Laura"
,"url": "https://www.allrecipes.com/cook/25115"
}
]
,"description": "I found this to be the best sugar cookie recipe for cutouts! very good flavor even without the frosting."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uK678rwDZERbUJXodWTkyo5fzuM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/255319-sugar-cookie-cutouts-Diane-S-4x3-1-38c360f8053e48dd85478da869b9a52d.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sugar Cookie Cutouts"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "361"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "135 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "26 mg"
,"fiberContent": "0 g"
,"proteinContent": "2 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "68 mg"
,"sugarContent": "8 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"1 cup butter, softened",
"1 cup white sugar",
"2 eggs",
"1 teaspoon vanilla extract",
"3.75 cups all-purpose flour",
"2 teaspoons baking powder",
"0.25 cup heavy whipping cream",
"0.5 cup colored sugar for decoration" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the butter and sugar. Stir in the eggs and vanilla. Sift together the flour and baking powder, stir into the creamed mixture alternately with the heavy cream. Cover dough, and chill for 2 to 3 hours, until firm."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "On a lightly floured surface, roll out the dough to 1/4 inch thickness. Cut into desired shapes with cookie cutters. Place cookies 1 inch apart on the prepared cookie sheets. Sprinkle with colored sugar if desired."
} ,{
"@type": "HowToStep"
,"text": "Bake for 12 to 14 minutes in the preheated oven, until bottoms and edges of cookies are light brown. Remove from baking sheet and cool on wire racks. Store in an airtight container."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "vjoyce405"
},
"reviewBody": "These cookies turned out like tiny cakes, not cookies! The first thing that troubled me was the heavy whipping cream in the recipe. Then the dough was way to sticky to cut out and when I pulled the first batch of cookies from the oven and tasted them, they tore apart like a cupcake and never firmed up like a cookie should. This is an awful recipe and I highly advise against it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Auntie A"
},
"reviewBody": "it was not a firm cookie, crumbly and awkward. it is because of the milk, and i knew that and used the recipe anyway. oh well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "busycook"
},
"reviewBody": "Followed the recipe exactly but was completely disappointed. Chilled overnight still had a sticky mess. Could not cut out shapes had to roll it into a big blob and bake. Ended up with basically a flat cake which wasn’t sweet. Very strange definitely not a cookie. Luckily this was a test case as someone asked me to bake cookies for an event but I don’t yet have a go to sugar cookie recipe -still searching"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Turkey13"
},
"reviewBody": "These held shape beautifully. The dough was nice to work with, and they tasted good. If I were choosing a recipe mostly by taste, there's another one I like better that holds its shape relatively well. \nIf I really wanted my cookies to look good in addition to tasting pretty good, I'd go with the \"Sugar Cookie Cutouts\" recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whitney RenBry"
},
"reviewBody": "Was looking for a recipe that tasted like my mom’s sugar cookies and this is it. Nothing but compliments when I make these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "??? ????? ??????"
},
"reviewBody": "Did anyone else experience these cookies needed more sugar? And I felt like these cookies were bland. Ugh thank you for the recipe but these are not for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Melissa Hamilton"
},
"reviewBody": "This recipe was really great for a cutout recipe, the cookies held their shape exactly as they were supposed to. The only problem I had was that they were dry and crumbly, almost like a Royal Dansk cookie. The flavor was also a bit absent. I made batches using both vanilla and peppermint extract- neither batch was particularly flavorful, although they were both very fragrant. Definitely great if you're looking for cookies to decorate, but it doesn't really stand up to traditional cookie recipes. It may improve with some personalization."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Babette Russell"
},
"reviewBody": "Made these for our exchange student/foreign son’s play. I followed recipe except used 1 tablespoon Watkins double strength real vanilla. Best &amp; easiest sugar cookie recipe ever! Rolled out super easy after 3 hours chilling. Had no issues rerolling scraps! Baked up to perfection &amp; did not lose a single cookie after baking! These cookies got rave reviews from hubby, son &amp; a school friend’s dad! This recipe is a keeper! Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JuniorChef"
},
"reviewBody": "When I made these cookies, I added everything according to the recipe, and by another reviewer's suggestion, doubled the vanilla, and added 1/4 tsp of cinnamon. They came out of the oven really puffed up. Their texture is more cake-ish than a cookie consistency which wasn't what I was expecting. If you're looking for a crunchy cookie, make sure you add less baking powder, or use a different recipe. Also, it wasn't very sweet, like barely sweet at all. Not nearly enough for a sugar cookie. Next time if I make it, I'll add 1 1/4 cups of sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MYPRETTYPEONIES"
},
"reviewBody": "This dough is easy to roll. Good plain, decorated with granulated sugar, or iced. Easy to roll thin for crispy cookies or thicker for chewy cookies. My go-to recipe for sugar cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZACLOCO"
},
"reviewBody": "I made these twice for Christmas and everyone loved them. The dough was easy to roll out, I personally like these cookies rolled out thin and they come out a little crispy. These also freeze well. For those that like anise flavored cutout cookies (my husband's family is Polish), substitute 1 1/4 tsp. of anise extract for the vanilla."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaT"
},
"reviewBody": "they were really good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ffeather"
},
"reviewBody": "Very good recipe. Nice soft cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcia Bean"
},
"reviewBody": "Very nice dough to work with, great tasting cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Altmiller"
},
"reviewBody": "This is the best cut out cookie recipe I’ve tried. The cookies held their shape when cutting and don’t puff up and lose their shape. The cookies aren’t sweet, which I like because we put fronting and sprinkles on top which is sweet enough. My cookies baked perfectly at 350 for 11 1/2 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "I've been making these cookies for years. Everyone always loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaMel"
},
"reviewBody": "I doubled the recipe and followed it exactly and got great results. I found the dough very easy to work with and about as flavorful as any sugar cookie recipe. The cookies do not brown at all when done, so watch them carefully. You could turn the oven down to 325 for a larger margin of error. I did a couple of thinner batches and a couple of thicker batches, both were good. These were softer cookies, a little more cake-like than most I've made. I plan on keeping this recipe but doubling the vanilla and chilling the dough for longer than an hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashty Elias"
},
"reviewBody": "1st time ever making cookies! I’m used to bake cakes but never cookies. So I changed the heavy whipping cream for milk ( heavy whipping cream is expensive in my country), the same amount that it was called. And I only used 3 1/2 cups of flour. It is a grrreat recipe. Thanks a lot!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "derpderpityderp"
},
"reviewBody": "WHY DID YOU KILL THESE POOR SNOWMEN FOR A PICTURE!?!???!?!?!!! ;-;"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2003florida"
},
"reviewBody": "Excellent recipe, easy to follow, dough works well and tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "VictoriaSe49896"
},
"reviewBody": "I wasn't crazy about these. The cookies were not sweet or soft/moist at all. Thankfully we planned on icing them so that should give them the sweetness they need. For some reason the dough came out a little crumbly/coarse. I had to spend extra time working the dough to overcome that. I even mostly melted my butter like another reviewer suggested but I don't think it would have made a difference. Ultimately I had a beautiful looking dry and bland tasting cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindy h"
},
"reviewBody": "Best sugar cookies! I did use a little more vanilla than called for. Easy to roll once chilled."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vera"
},
"reviewBody": "Amazing recipe. Excellent , easy dough to handle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Green Howson"
},
"reviewBody": "This is the best dough I have made. Easy to work with and holds it shape when baked. I did add extra vanilla and almond extract for more flavor after reading reviews. I have always made sugar cookies with my grandaughters and never was happy with the dough. This year I feel that my effort has paid off. The cookies are great. Thank you and Merry Christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Long"
},
"reviewBody": "Excellent, is my new go-to sugar cookie recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afmomy"
},
"reviewBody": "I haven't rolled and cut cookies in years because I was simply terrified. These were SO EASY! I followed the recipe exactly, didn't have heavy whipping cream, panicked, found a recipe to make myself, and the dough turned out perfect. I did chill overnight just to be on the safe side. Rolled on parchment paper using flour w/some powdered sugar mixed in. I did find rolling out thicker than 1/4 inch worked out much better. The flavor is a perfect match for my sweet royal icing recipe.\nThank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Johanna Benson Bettinger"
},
"reviewBody": "We also posted a picture to this recipe of our cookies!! They are just wonderful~!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Clayton"
},
"reviewBody": "Okay, two teaspoons vanilla and I threw in an extra yolk (because of someone else's recipe - not sure that made a difference) but these turned out GREAT! Followed recipe closely. chilled dough etc. let chilled dough rest on bread board an hour before attempting to roll out. No one ever says that! Cold dough just won't roll out easily.\nAnyway, 350 degrees, 12 minutes. Whaaaa Laaaa! Nice!\nOooh, frosted with a powdered sugar + milk glaze with a couple drops of vanilla and orange flavor added. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WolfePackMama"
},
"reviewBody": "The cookie itself tasted very good and had a great texture to it! I put my cutouts on parchment paper on top of the cookie sheet and in the freezer for about 15 minutes prior to baking. They held their shape very nicely. My only complaint/warning is that these cookies double their height/thickness while baking. In many cases this would be just fine. However, I used this recipe for stackable or \"pinata cookies.\" One cookie requires 2 thinner cutouts and 1 thicker cutout with the middle carved out of it. You then \"glue\" the thicker cookie with the middle carved out to 1 piece of the whole thinner cookie, fill the middle with sprinkles, then \"glue\" the 2nd thinner cookie on top. I rolled them to them to the thickness I wanted and was taken aback at how much taller they had become during baking! Therefore, after all of my assembling, I had very tall stacked cookies, lol. This was my first time making them and they were for the kiddos, so I had no complaints! I would just roll them a little thinner in the future! Overall, very good recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Katie Peeren"
},
"reviewBody": "Not much flavour in these cookies but rolled out nicely"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nolan's Mom"
},
"reviewBody": "This recipe is super easy for kids to work with! I made this recipe with 4 kids ages 6 to 9. I also rolled out some myself. One set of kids used gluten free baking mix and the other used the regular all purpose flour. These were great! It didn't seem to matter how long the kids worked the dough. All of the cookies seemed to turn out well. I chilled the dough for just over an hour- 1/3 of each batch went to each child. My favorite bunch was the cookie sheet baked on the top rack ... they were slightly more crispy than the others."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Livy Hansen"
},
"reviewBody": "This is a great cookie recipe. The only thing to remember is to make the dough ahead of time, wrap it up, and let it sit in the fridge for more than an hour. Overnight is the best. Not a good last minute idea. I made these for a party, but I started after they had gotten here, and trying to roll out my dough was a disaster, because it was so wet. Also, don't add excessive flour when rolling out the dough. The flour flavor will come across in the cookie. great recipe overall though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "2Hughes"
},
"reviewBody": "I'll keep looking. Tasty, but puffed up too thick. A good cookie but maybe just for frosting and not conducive to semi-detailed decorating that I intend to do. 1/4-inch thick was too thick after cooking, for me. I doubled vanilla, added 1/2 tsp almond extract, and subbed 1/2 cup brown sugar for white in the mixing. I used powdered sugar to roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sylvr G. Randall"
},
"reviewBody": "I'm surprised by the great reviews earlier. flavour, meh..... they are kind of cake-ish, spongy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I used half and half instead of heavy cream, added a tsp of almond extract and chilled the dough about 1 hour. They rolled out like a dream. I baked them between 10-11 minutes and iced them with royal icing. I will make these again and again. They're delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamaturtle"
},
"reviewBody": "I will make this again. However, I took others advice and doubled the flavoring, added a bit more sugar w/half of it powdered, added a bit of cr. of tartar, and half of the baking powder listed.\nDough was great to handle. It's important that the dough is rolled out to the same depth for a good even bake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SheenaBeena"
},
"reviewBody": "super duper easy to roll out. taste ok, too but can't emphasise enough how easy this dough is to roll."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lcji"
},
"reviewBody": "Good!! I use powdered sugar to roll the dough out, always helps give a better taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarmama"
},
"reviewBody": "Followed recipe exactly and after chilling the dough overnight it rolled out beautifully. No cracking. Cut outs came out great. Will be using every Christmas!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missrochester"
},
"reviewBody": "Boy let me tell you I normally dont have very good luck with cut out cookies but this recipe made it so easy! The dough was an absolute dream to work with I never even chilled the dough also the cookies held there shape beautifully and they tasted AMAZING!!! VERY GOOD recipe! This is a no FAIL recipe!! Perfect as is no need to change a thing...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Ryan Copeland"
},
"reviewBody": "It was extremely dry and wouldn't stick together. It crumbled as I was wrapping it up to refridgerate. Let it \"set\" for over an hour and it still fell apart. Was going to put it in a cookie press but all it did was compress it so it wouldn't come out of the cutter. Tried using a knife to just make round cookies but the dough just fell apart. There was also no taste what-so-ever. Won't use this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bevvie"
},
"reviewBody": "I love how easy this dough is to work with. It's very easy to roll, cut and move to baking sheets without losing it's shape. I will most likely use it again but I have to find some way of adding more flavor to the dough. The cookie, as-is, has no real flavor at all. Maybe more vanilla or some spices in the dough would help? Icing and decorating sugar makes them better and it is an easy dough to work with so thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LolaWBT"
},
"reviewBody": "Cookies tasted great and the dough was easy to roll out two or three times. I used powdered sugar instead of flour for dusting before rolling and cutting out. Cookies didn't break. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Huber Gelakoski"
},
"reviewBody": "Very easy to roll out and cut. Yes, bland until frosted. They are delicious! I flavored my icing with lemon and they were just right. (Not too sweet)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashlei"
},
"reviewBody": "Wonderful sugar cookie recipe! They were more like a shortbread cookie really... Shapes held very well- my family loved them with or without icing! This will be my only go-to sugar cookie recipe from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kirabeck"
},
"reviewBody": "First time making sugar cookies and I was nervous because people write about how tricky they are. Well, these were super easy and turned out so cute and tasty! Only change was to add 2 teaspoons of Pure Vanilla instead of one per another raters recommendation. Happy Halloween!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mishmomo"
},
"reviewBody": "Never tried making sugar cookies from scratch before this. Very easy to roll out the dough. Cookies tasted light and were firm enough to decorate. No need for me to find another sugar cookie recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Key West Cook"
},
"reviewBody": "I cannot believe how nice these cookies roll out. I made exactly as stated except I added I extra tsp of vanilla. I had them in fridge for about 5 hours before I rolled them. I rolled them on lightly floured parchment paper and baked them for exactly 12 minutes. These will be my Christmas cutouts from now on but I will add anise during that holiday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Marina Marina"
},
"reviewBody": "This produced a dry and crumbly cookie with bland flavour even after I increased the vanilla and reduced the flour. Thank-you for submitting the recipe, but I will not use this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bestamjo"
},
"reviewBody": "Like the texture to work with but tastes too powdery/ dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Espie Hurtado"
},
"reviewBody": "Easy recipe and very good. indeed a keeper. These will be good for any holiday not just Christmas cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Banbury"
},
"reviewBody": "Best cookie cutouts ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "carina"
},
"reviewBody": "This cookie is not as sweet as many other sugar cookie recipes...which made the cookie popular with some folks, but not so much those with a real sweet tooth. I liked them, though. The dough definitely needed to chill for at least 2 hours to be able to roll it out without sticking. I also followed the hint from another reviewer about rolling out on parchment paper, removing the excess, and then putting the whole sheet of parchment with cookies on the pan to bake...this was a GREAT tip for keeping the cookies' shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lynn Pl"
},
"reviewBody": "They are pretty good just a bit on the dry side and made them twice and followed the recipie but other then that they are ok and i think they need more sugar as don't really taste like sugar cookies compared to the other recipie that i made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susana Magalhaes Burgess"
},
"reviewBody": "I added 1/4 cup more sugar and doubled the vanila. It puffs up a lot do make it thin or maybe cut on the baking powder. Used half and half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daveen-robinson"
},
"reviewBody": "OMG! This is the most wonderful sugar cookie recipe. It was easy to make,cut out perfectly, and took about 12 minutes to cook. Everyone in my family loved them. I am baking some to give out as gifts this Christmas for my neighbors and friends. Loved them :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamara Whorton Becker"
},
"reviewBody": "Best Sugar Cookie Recipe Ever, I do this recipe every year. It is easy and I never chill the dough before using I just roll and bake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ljayess"
},
"reviewBody": "Wonderful! I completely avoid baking, especially cut-out cookies. SO many bad experiences. I have tried many, many sugar cookie recipes in the past, all ended in frustration as I tossed the recipe in the trash. This year I promised my kids I'd bake again, and I went on a new recipe hunt. I found this recipe, poured over the reviews, and gave it a try with little hopes of changing my attitude. I was so happily surprised. This is, by far, the best roll-out sugar cookie recipe I have ever tried. The dough seemed sticky as it came out of my mixer, but after chilling, it was the easiest dough I have ever worked with. It rolled like a dream from start to finish. I made two double batches. The first, I refrigerated overnight. The second, I refrigerated just a couple of hours. Both rolled out exactly the same and baked up the same. Just make sure they are chilled thoroughly. I separated the dough into smaller section and made the lumps of dough kind of flat after I wrapped them in plastic wrap. I laid them directly on the glass shelves in my refrigerator to chill. The dough needed little flouring and released from my plastic cutters wonderfully. The cookies taste great. I cut the cookies 1/4\" as recommended, and I baked each sheet of cookies for exactly 12 minutes, just until the edges began to turn brown, and they were perfect. I decorated them with a sugar cookie glaze (also found on this site), sprinkles, and piping, and they taste even better. You won't be disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoriaren"
},
"reviewBody": "I've been searching for the Best cut-out cookie recipe for years, and I think I've found it.. Doubled the vanilla, as recommended by others, and added 1/2 t salt. Only chilled 2 hours. Made half the recipe and was not standing there all night cutting out cookies. Love that they're not too crisp, nor too chewy. Maybe perfect. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerry"
},
"reviewBody": "This dough is super easy to work with, but the cookies' flavor is lack-luster, even when sprinkled with sugar, and a little on the floury side. I will still make these because the dough is so easy to work with and I want to ice the cookies with a flavored icing. Mine cooked up nice and soft and held their shape well. I used parchment paper instead of greasing the sheets. Finally, I was pleased that the yield was accurate--I got 75 cookies with various shapes of 3-inch cookie cutters."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hdub"
},
"reviewBody": "This is my new go-to recipe for cut out sugar cookies! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "food"
},
"reviewBody": "these cookies tasted SO good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELLESAN"
},
"reviewBody": "Best sugar cookie ever! Meant to be used with frosting or sugar on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SYLVERWARE"
},
"reviewBody": "This is the best sugar cookie recipe I've found so far. The dough was easy to work with and didn't get all sticky when it started to warm up when I was working with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nanner"
},
"reviewBody": "Made these sugar cookies yesterday for my daughters' Valentine's Day tea and they turned out great! I am not a fan of making cut out cookies normally because the dough is either too sticky or cracks or the shapes lose their shape, etc, but this dough erased all of those problems for me. It was an absolute breeze to work with, baked perfectly and held its shape beautifully. I am not sure why this dough came out sticky for some reviewers, because mine was only refrigerated for one hour and was not sticky at all. I rolled the dough out between two sheets of parchment paper, but honestly probably didn't even need to, and did not use one bit of flour or powdered sugar for rolling, because I just didn't need it. My cookies baked in about 10 minutes and came out firm but chewy not crunchy, if that makes any sense. lol I did make a couple of modifications: I used butter-flavored shortening in place of the butter, substituted half and half for the heavy whipping cream (because I didn't have any) and added 1 tsp of salt and some extra vanilla. I do not think any of those changes would have dramatically affected the way the dough turned out, though, so I am still giving the original recipe 5 stars. This is now my go-to for sugar cookie cut-outs. Thanks for a great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C. McDaniel"
},
"reviewBody": "Before I was even done mixing this dough I knew it was going to be fabulous. Smooth, easy to roll, and smells divine. This recipe puts the fun back into cookie making. Cooks up quick with no rising so cookies stay true to form. This would be the perfect dough for 3D cookies. Not too sweet, they are perfect for frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaMadeWaffles"
},
"reviewBody": "Perfection! I added 2 tsp of vanilla, per the other reviewers suggestions. These dough was the perfect consistency for rolling and cutting. I let the dough chill in the fridge for 2 hours and then took it out of the fridge about 5 minutes before I was ready to roll. I also put the pan of cutouts in the freezer to chill for about 3-5 minutes to help them retain their shape. Great flavor and perfect for decorating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blair"
},
"reviewBody": "These were delicious! Didn't make any modifications. Turned out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jenkandt"
},
"reviewBody": "They taste like flour and are not nearly sweet enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vababe"
},
"reviewBody": "I have tried a few different recipes from this site and have had to tinker with them all. I will say that this one, was the easiest to work with after chilling over night. I feel that it is very bland by itself and the cookie from this recipe must be frosted. But I overall enjoyed the cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mari"
},
"reviewBody": "Loved this recipe!! I reduced the baking powder to 1 tsp and increased the pure vanilla extract to 2 tsps. I also increased the sugar to 1 1/12 cups. That made the cookies have great flavor even without frosting and have just the right amount of softness. I also chilled for 8 hours in the fridge in 3 separate balls. You may want to even let them chill over night. Other than the chill time, the cookies were amazing! This is my new go to sugar cookie cut out recipe! My 6 year old loved making these and eating them too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heatherb"
},
"reviewBody": "I made this using my stand mixer, which worked out great! I baked them on the lower end of the suggested time, when they were just starting to brown around the edges. They turned out slightly crispy on the outside with a little fluff on the inside. My only regret was not doubling the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mexican lover"
},
"reviewBody": "Ok. I have to admit that I was a little sketchy after seeing the cream in this recipe. I decided to give it a go after having read some of the reviews and after several other recipes from this site turn into a total fail. I followed this recipe perfectly and the results are amazing! They are soft but still hard enough to frost, they have a nice texture on the top after they are baked, and my favorite part is that they actually taste great too! Usually I feel like a good cut out sugar cookie lacks in the flavor department, but these definitely do NOT disappoint! Happy to share these with friends and neighbors on our Christmas goodie plates!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammi Vik"
},
"reviewBody": "I would give tis recipe 41/2 if I could. I couldn't give it a full 5 because I didn't find it very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Boxer"
},
"reviewBody": "Reliable basic recipe. I did add 1/4 tsp of salt and 1/2 tsp of cinnamon to add some flavor. I also used 1/2 cup less flour so it wasn't as flaky when rolling. Simple and easy to use for any occasion! My Maple Leaf cookies for Canada Day turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taylor White"
},
"reviewBody": "I actually really loved this recipe! They tasted good, and the texture was decent. I even made them gluten free and they turned out fantastic! I was thrilled when they didn't crumble when decorated. They frosted quiet nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "This dough is excellent for cut outs. The cookies keep their shape and size while baking. For that I would give the recipe 5 stars. But the flavor was a little lacking. And they were very dry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OHMARGI"
},
"reviewBody": "These are tasty cookies that are perfect for cookie cutters and decorating. They are strong and won't break when you decorate them. But they aren't too hard! Especially good when doing cookie decorating with kids who can be a little rough. This is my go-to recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "hobmania"
},
"reviewBody": "They stuck like glue to the racks and the ones that didn't, broke apart. In pieces, they tasted good though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gracey"
},
"reviewBody": "These were amazing! Really easy to make, and with just the right amount of sweetness. I added some cinnamon to boost the flavor. Didn't have any problem when rolling, even if I didn't wait for the full 3 hours for the dough to chill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tracy"
},
"reviewBody": "Makes a perfect cookie. Soft, really good flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah Hug"
},
"reviewBody": "I was fairly surprised by all the positive reviews. I found these cookies to be very dry and they had hardly any taste. \n\nI'll be choosing a different recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "xocolat"
},
"reviewBody": "I completely agree with MAMASHAKE in that I hate sugar cookies because they're always so sticky and finicky, and I have tried several of the more popular recipes on this site without much success. Because of her review, I tried this one and was not disappointed. I find this recipe 10000 times easier to work with than other sugar cookies, while still tasting great. Thanks GLJCAT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mychiquita"
},
"reviewBody": "best i have ever tasted in my entire life"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "They held together beautifully when rolled out and when they baked they kept their shape. Not too sweet, so when you added the buttercream frosting for decoration, the cookies didn't taste sicky sweet. Perfect recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dasih"
},
"reviewBody": "i love these cookies. i've used this recipe numerous times. i'm a preschool teacher and i used this recipe with my 5 year old students and it was very easy to work with and roll out- never sticky!!! i also make this for my family for the holidays and use different cutouts for each holiday. i have to add that i HATE using butter because of the unhealthy fats that it has. i ended up using 1 cup of oil instead ( specifically smart balance omega oil) and it came out just as great as if i used butter. i also cant have dairy and i used non-dairy coffee creamer/whitener. i would definitely recommend this recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Great tasting cookie! My teenage boys loved them. Great for cutouts and decorating!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ItzAmazingAmy"
},
"reviewBody": "The best recipe I've found by far. Not overly sweet so that when you ice them you're not puckering over the insane sweetness in some cookies. I make the dough the day before and wrap in wax paper in small work balls. When I'm ready to roll and cut the cookies I rotate between the balls of dough so I can reform the dough in the fridge quickly between batches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kt"
},
"reviewBody": "EVERYONE loves these cookies. Try almond extract instead of Vanilla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "K. Crumpton"
},
"reviewBody": "perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "missmonkey"
},
"reviewBody": "Just made and iced these cookies. What a great cutout recipe. I only left it in the fridge for a couple of hours, and it was good to go! I did follow other suggestions of adding more sugar and cutting down the flour. No cracks, nice and evenly puffed and no spreading while baking. Very pleased with the results and will definitely use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "srobertson"
},
"reviewBody": "Dough was very easy to work with. However, I felt the cookies themselves looked perfect once baked, but tasted a little dry. More like a shortbread than a cookie to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Dauterman"
},
"reviewBody": "These are great and the dough is easy to work with! This will be my go-to recipe now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerry"
},
"reviewBody": "These were very yummy and worked quite well for cutouts after being chilled. \nHere is an idea for those that want to decorate with/for kids, but don't want to use frosting. You can use food coloring put into an egg yolk wash. For two eggs, separate the egg yolk, mix it up, and split it into two small containers (small coffee cups), so that you have 4 containers. Add food coloring and paint the cookies with a brush before you cook them. It is still fun for the kids and does not have quite so much sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "sahmof2"
},
"reviewBody": "This recipe was not to my liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mizzkitty"
},
"reviewBody": "Awesome recipe. I didn't crack a single cookie!! I took the advice of several other reviewers and made it a little thicker and used real vanilla.. amazing.. coming from a working mom who has no time, it was easy to put together, chill overnight, then roll out. it made over 40 cookies for my daughters class. i did top it off with cookie frosting (also from this site) and added some decorations for the visual stimulation of 7 year olds but the cookie on its own is great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie"
},
"reviewBody": "This is the first sugar cookie recipe I have found that kept it's shape while baking. Made exactly as per recipe. Not too sweet before they're iced, but perfect with sugar sprinkles or icing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Hermann Coovert"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ychick"
},
"reviewBody": "I refrigerated the dough overnight like other suggested. It was very easy to work with. The flavor and texture of the cookies is very good but they do need icing. I baked the first batch for 12 minutes and they were too crispy so the next bath I baked only 6 minutes and they were perfect. My tip is if you are using dark non stick pans to either lower the temp by 25 degrees or bake for a shorter time. You can get crisp cookies if you roll the dough out thinner and more substantial cookies if you roll our a little thicker, I would make these over and over."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15149/sugar-cookie-cutouts/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/859/desserts/cookies/sugar-cookies/",
"name": "Sugar Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15149/sugar-cookie-cutouts/",
"name": "Sugar Cookie Cutouts"
}
}
]
}
}
, "about": [
]
}
]