				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sun-Dried Tomato Pesto"
,"datePublished": "2018-06-08T09:16:21.000-04:00"
,"dateModified": "2022-09-20T15:17:44.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Cindy Schmidt"
,"url": "https://www.allrecipes.com/cook/239738"
}
]
,"description": "Sun-dried tomatoes are blended with fresh herbs, pine nuts, garlic, balsamic vinegar, red wine, olive oil and Parmesan. This is fabulous on pasta, pizza and sandwiches."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/T5CX9G7M77e0Wz0xQb5EadHo6Ec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/800396-c3457d08d3e24c0cb20a991eaa2fac73.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sun-Dried Tomato Pesto"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "91"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "44 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "81 mg"
,"sugarContent": "1 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"4 ounces sun-dried tomatoes",
"2 tablespoons chopped fresh basil",
"2 tablespoons chopped fresh parsley",
"1 tablespoon chopped garlic",
"0.25 cup chopped pine nuts",
"3 tablespoons chopped onion",
"0.25 cup balsamic vinegar",
"1 tablespoon tomato paste",
"0.33333334326744 cup crushed tomatoes",
"0.25 cup red wine",
"0.5 cup olive oil",
"0.5 cup grated Parmesan cheese",
"salt to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place sun-dried tomatoes in a bowl and cover with warm water for 5 minutes, or until tender."
} ,{
"@type": "HowToStep"
,"text": "In a food processor or blender combine sun-dried tomatoes, basil, parsley, garlic, pine nuts and onion; process until well blended. Add vinegar, tomato paste, crushed tomatoes and red wine, and process. Stir in olive oil and Parmesan cheese. Season with salt to taste."
} ]
,"recipeYield": ["40"]
,"totalTime": "PT20M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "valc"
},
"reviewBody": "I had run out of basil pesto and needed some for my chicken sandwich on homemade focaccia. I looked at what this site had and found this highly rated recipe. I adjusted as followed by using staple ingredients: 4 ounces/1/2 cup dried and soaked sun-dried tomatoes, 1/2 teaspoon each dried basil and parsley, 1/4 cup tahini to replace the pine nuts, 2 tablespoons balsamic vinegar, 3 tablespoons onion, 1 roma tomato, 3 tablespoons olive oil, and 1/2 cup grated Parmesan. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Key-bible"
},
"reviewBody": "I love the fresh made Tomato Pesto. I had to use dry parsley and tomato puree as substitutes for fresh parsley and tomato paste, but it still turned out wonderful! I love this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elaine"
},
"reviewBody": "I did Not make any changes. \nLoved the pesto it turned out great. \nUsed it in a recipe. We all really liked the meal I made With it. I love making thing from scratch, this recipe is definitely going in my recipe book.\nThank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pellinwood"
},
"reviewBody": "used as a sauce for grilled shrimp...huge hit with my peeps"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dragonfly0187"
},
"reviewBody": "Made this for our wedding cocktail hour it was amazing! If double or triple this recipe you have to cut back on the olive oil a little. Served on a crostini. Guests raved!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joko"
},
"reviewBody": "Absolutely delicious, a nice change up from my normal pesto."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KTChaplin"
},
"reviewBody": "We were given this recipe at Tony's at Walt Disney World. I leave out the onion, and it takes a while to puree the heck out of everything, but everyone I make it for loves it. My advice is to use the sun-dried, dry tomatoes in a sealed package, not the oil packed tomatoes for best results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mary P."
},
"reviewBody": "Pestos are a blend of 5 or 6 simple ingredients. This recipe tastes like a salad dressing over pasta. Bummer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lu Ann"
},
"reviewBody": "to my surprise, my adult son and husband loved this sauce! We're all big fans of traditional pesto, but, wasn't sure how it would be received. I served it with grilled boneless chicken, grilled zucchini (sliced lengthwise), and jarred roasted peppers. Really gave the dish that wow factor. Can't wait to try it with shrimp and bow tie pasta as recommended in one of the reviews. The recipe made a lot, so I'm looking for additional ways to use it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marilyn Stevens"
},
"reviewBody": "The flavors blend beautifully! This was one of those days when I was about 20 minutes before preparing supper with no idea of what to make. Then I realized I had sun dried tomatoes -- perfect! The only thing I changed was using crushed hazelnuts instead of pine nuts (hard to find here in Costa Rica). I am currently waiting for my pasta to cook, and I can't stop dipping in to the pesto for \"just one more little taste.\" A real keeper -- when my vegan family comes to visit, I will simply sub out the cheese and add some nutritional yeast -- I'm sure it will be just as yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam Bullock"
},
"reviewBody": "I made this exactly as described and it was fantastic!! I will definitely make this again and again. It made enough to serve two with enough left over for 4 to 5 more dinners for two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ja"
},
"reviewBody": "Too much vinegar and Parmesan, not enough nuts. Herbs has definitively to be fresh.\nI liked the idea though. Worth giving an other try with more at my taste adjustments.\nFor a light diet, no need of serving this sauce with pasta. I served it with steamed yellow beans and a fish filet and it was very suitable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J and L"
},
"reviewBody": "I will make this again to use with pasta, black olives, artichokes, sundried tomatoes and parmigiana regiano cheese. I made 4 times the recipe and froze batches to use later. My changes were to use crushed tomatoes instead of two types of tomato and to use red wine vinegar instead of balsamic vinegar because that is what I had in the pantry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlotte Moore"
},
"reviewBody": "This pesto is great. I followed recipe exactly. It does not need anything else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Friday 2018"
},
"reviewBody": "THANK YOU FINALLY SOME ONE GAVE A GOOD PESTO"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHANONHART"
},
"reviewBody": "This was fabulous, even though I didn't have fresh herbs, just cut them in half for dried. Also had to sub walnuts as thats what i had on hand. Used it to make spinach and feta bake from this site, and it was really, really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Marena B."
},
"reviewBody": "The red wine and balsamic vinegar were overpowering, so I added in some extra pine nuts and park to mellow them out. After that it was edible, but next time I will add to taste or ditch those ingredients altogether."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denise Gregorio"
},
"reviewBody": "This was great! I just loved it! Made extra and put it in the freezer!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan in MD"
},
"reviewBody": "Excellent. Will definitely make again. left out the wine because I wanted my 4 year old to try it. So easy and so yummy. Served it over pasta and also with chicken. Next time will try with the wine. Wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dgessner"
},
"reviewBody": "This is very, very good. I didn't change a thing except use almonds instead of pine nuts as I didn't have any. Very flavorful. Plan to use it as pizza sauce and a sauce for pasta. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shoebear"
},
"reviewBody": "Hmm. I subsistuted with something called \"semi oven dried tomatoes\" that were packed in oil but otherwise I followed the recipe as written. The result tasted pretty good but had an unfortunate color. Pale brownish tinge. I will toss it with pasta or use as a spread for hamburgers. Next time I will try a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jonnim"
},
"reviewBody": "oh my! very good. great rich tomato flavor. used extra garlic. used dried basil. did not put parmesan in the pesto...i like to keep things vegan. Ate tons with sourdough bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Yum! A tad heavy on the balsamic vinegar for bf's tastes, but I thought it was good. I just used spaghetti sauce instead of crushed tomatoes, and I was worried it was too liquidy until I added the cheese, then it was perfect. I didn't add extra oil bc I used sun dried tomatoes in oil--about 1/2-3/4 cup. Very easy and delicious. For a smaller amount, less ingredients, and a less liquidy pesto, the Vegan Sun Dried Tomato on here is good too--I like them both, though. Delicious! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen614"
},
"reviewBody": "Made this recipe tonight but all I had was sundried tomato's I was soaking in olive oil for another use. I took them out, and used them in this recipe and instead of using olive oil, I used the olive oil I had the tomato's soaking in. The balsamic vinegar adds the best zing. Also I just added two heaping tbls. of homemade basil pesto as I didn't have all of the other ingredients like fresh basil and pine nuts. It is DELISH!! Made a pizza on a tortilla and used this instead of pizza sauce and substituted feta cheese and spinach as toppings.... again, it was DELISH!! I would highly recommend this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda"
},
"reviewBody": "Delicious! I'll definitely make this again and again. I like garlic, so I doubled the garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "l<3s2cook"
},
"reviewBody": "yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daymon"
},
"reviewBody": "Only had oil packed sun dried tomatoes, so I used 8 oz and didn't add any (extra) oil. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvonne Weston"
},
"reviewBody": "This is a very rich sauce. I thought it was delicious, but my husband found it too rich. (He's not big on anything tomato based though.) I absolutely loved this recipe and will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jpo"
},
"reviewBody": "This did not turn out as good as I expected it to. I served it over pasta and I thought it was just ok. I had alot left over so I gave it to my parents, they loved it! Who knows, maybe I should have waited a day before tasting??? I'll never know because I probably won't make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Schaefer Hoffman"
},
"reviewBody": "Wow--followed it nearly to the letter and thought it was amazing. Rich and meaty-tasting sauce without the meat Tried it tonight and will freeze the leftovers. Thanks so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen"
},
"reviewBody": "This is definitely a delicious recipe. I am curious as to where you got it from. A few years ago we visited Disney World and ate at Tony's in the Magic Kingdom. The sundried tomato pesto was so good that I had to ask for the recipe and they were kind enough to give it to me...and this is it exactly, even the measurements."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Foery"
},
"reviewBody": "I thought that the pesto alone was a bit too sweet for my taste, but I added the leftover to a quick marinara sauce that I made for my kids, and it added an exciting kick to the sauce. (I often wish that my marinara had a bit of a sweet zestiness- that isn't sugary.) I think that I have solved my problem. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I didn't have any red wine on hand that I wanted to experiment with so I left it out and the pesto turned out just fine anyway. Great on \"spinach and feta pita bake\" on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina Coelho"
},
"reviewBody": "very good and full of flavor!!! I didn't have pine nuts so I just used walnuts. Came out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "We didn't care for this sauce at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tawny Gause"
},
"reviewBody": "made with almonds instead of pine nuts, used dried basil, SO SO good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlos"
},
"reviewBody": "Not so good after a night in the refrigerator, but fresh, it's one of the best recipes I'm made on this site. Delicious! I forgot to pick up crushed tomatoes, so I substituted with half a fresh tomato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GOBUCKS"
},
"reviewBody": "This was fabulous. I used sun dried tomatoes in oil, and then mixed that oil with the EVOO, for a total of a 1/3 of oil combo (otherwise I think the oil would overpower the taste). I also reduced the balsalmic (rec'd from others) to 1 Tbsp. I used this with Ham and Fresh Basil Pinwheels (from this sight). I did freeze the remainder to toss with pasta or to put on french bread. Thanks for the recipe Mrs. Schmidt!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "EmmileaTheNotorious"
},
"reviewBody": "I really didn't like this at all. Maybe I just don't care for sun-dried tomatoes, but I didn't like the texture or the flavor of this. All I could taste was the tomatoes and the vinegar, but I had been really looking forward to the fresh flavors of the parsley, the basil, and especially the pine nuts. It didn't taste good to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Keller"
},
"reviewBody": "I made this with roasted red peppers instead of the sundried tomatoes, because I bought the wrong thing at the grocery store. It turned out great that way and I would love to try this recipe with other vegetables. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jillia"
},
"reviewBody": "Great starting point. I wanted to recreate the sun dried tomato pesto a local restaurant makes. Turned out great! Didn't follow it exactly - didn't really measure and omitted the pine nuts, red wine, and tomato paste. I think a couple of splashes of balsamic vinegar and some fresh tomato really made this. Boyfriend loved it and even thought it was better than the restaurant's (less oily he said)! Just served it with a loaf of Italian bread as a little appetizer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Sagheb"
},
"reviewBody": "I made this vegetarian by omitting the Parmesan cheese, and it was delish. I will skip the balsamic vinegar next time, though, as I found it made this a bit too sweet for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "slcgirl3"
},
"reviewBody": "I made some modifications so I could just use the ingredients I had: no sun-dried tomatoes, but I added in an extra tbs of tomato paste and added a little bit of sugar to counter the tomato paste. Didn't have red wine to add, either. I added in a little extra garlic, too. This was extremely yummy-- thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Tuckey"
},
"reviewBody": "I needed a sun-dried tomato pesto for a stuffed pork tenderloin recipe. I googled this and tried it and found it amazing. The next night I made more as a sauce for gnocchi - stunning! A definite keeper for no fail, favourite recipes. So versatile."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "new veggie"
},
"reviewBody": "I didnt give it 5 stars because I made modifications to the recipe. I added a lot less balsamic and more basil (2 Tablespoons more), more pine nuts (total 1/3 cup), more olive oil and red wine(1/8 cup more each). I also added cracked pepper and 2 lbs of salad shrimp. I think this recipe is a good starting platform. My family liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cassandra"
},
"reviewBody": "Used this recipe for a pita pizza. 5 out 5! I went ahead and mixed all the ingredients into the blender.\n\nUpdate: Being pregnant, I omitted the red wine and it was still fabulous. Also didn't have pine nuts or parmesan on hand but still love the taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Singer6"
},
"reviewBody": "Amazing pesto recipe. We absolutely loved it. I only made 10 servings because all I needed was a couple of TBS for the \"Pizza Without the Red Sauce\" recipe from this site. I wish I had made more to have o n pasta! The only change I made was to use Sun-Dried tomato paste instead of regular paste. I had it in a tube and didn't want to open a can of regular paste for a TBS or so. Still, it came out just great. Thanks so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Antonio"
},
"reviewBody": "I enjoy this pesto. I used it to make another recipe on this site and I had a hard time getting my blender to work with me but the flavor was good in the recipe that I used. I had *lots* left over and look forward to throwing it on a warmed up Boboli for lunch or as spread for a snack. Very easy, especially if the ingredients are standards in your kitchen, which for us it was. I'm a fan of garlic, red wine and basil - therefore would probably add in more of those 3 ingredients the next time I make this. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peanut"
},
"reviewBody": "I'm not a huge fan of pesto, however, I really enjoyed this sauce. It was a great spin off of traditional pesto. I love sun-dried tomatoes. Not only was this flavorful, but it's also rather low in calories/fat. I used red wine, not red wine vinegar, and I forgot to put in the balsamic vinegar, but it still turned out really good. I'm excited to try it with the balsamic vinegar next time, and maybe I will try it with red wine vinegar instead of actual red wine. This recipe is versatile, and could be good either way! I also didn't have a food processor, so I used a blender. It takes a bit of patience and time compared to a food processor. I had to stop and stir it now and then to make sure it all got blended/chopped, but my blender doesn't work well, and it was definitley worth the effort! I put this over farafalle and served it with fresh french bread and the Easy Garden Green beans recipe on this site. Like other reviews have said, this recipe makes a lot. There are only two of us in the house, and we are gladly freezing the rest of the sauce to use for quick pasta dinners in the future. Thank you for sharing this simple and yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roshanthi"
},
"reviewBody": "Great recipe, also fabulous on sandwiches."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tatersmom"
},
"reviewBody": "I was not too sure how this one would go over because I tasted it in the food processor and it seemed a little heavy on the balsamic flavor. However, once I tossed it with the pasta (you don't need nearly as much as if you were using say meat sauce),...heavenly. Maybe even the best pasta dish I have eaten in or out of a restaurant! The only subs I made were that I used asiago instead of parmesan because mine had gone bad and I added some of that seasoning stuff that you are supposed to mix with olive oil and dip bread in because I add that to everything. My meat loving husband was also a fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DARCIE"
},
"reviewBody": "The color ends up looking like something you wouldn't want to eat and the flavor was lacking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AllyDee"
},
"reviewBody": "This was very delicious even without the addition of wine. I thought it was a bit rich, but then you only have to use a little sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Wakefield Willis"
},
"reviewBody": "Delicious! Freezes well, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VIVNIDHI"
},
"reviewBody": "Used sun dried tomatoes in oil.........drianed them, soaked them in hot water and then re-used the oil:)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samitestar"
},
"reviewBody": "Excellent. I didn't have crushed tomatoes so I left them out, nor the onion or balsamic so I subbed red wine vinegar(a visit to the grocery store was out). Also, I added some brazil nuts, extra basil and parsley and hand crushed it in batches in my mortar and pestle(my blender jammed). My shoulders hurt, but it was worth it for this heavenly concoction."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia"
},
"reviewBody": "Really, really delicious. In my opinion, the oil needs to be reduced by about a quarter, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Honey"
},
"reviewBody": "Great recipe...Don't forget you can add cooked, diced chicken or pork; shrimp, clams etc...We like things more garlicky so we use more garlic...If you want to thin it out any, use a little of the pasta cooking water....This can be adapted to so many things"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JennyJen2009"
},
"reviewBody": "my version: 4 oz sun dried tomatoes, 3/4 c fresh basil, 1/4 c fresh parsley, 1/2 small onion, 1/4 c pine nuts, 4 cloves garlic, 1 can diced tomatoes, 1 small can tomato sauce, 1/4 c red wine vinegar, 1/8 c balsamic vinegar...combine in blender and then add parmesan cheese on top.\n\nThis was sooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "inthekitchen"
},
"reviewBody": "Fantastic! Despite having to omit the red wine &amp; Parmesan, the flavor was phenomenal. I like that this recipe uses \"dry\" sun-dried tomatoes instead of the oil-packed ones, because they're easier to keep on hand (&amp; more economical). I added triple the amount of basil because I thought I would like more basil flavor in it. Had to also sub dried parsley for fresh. Still amazingly good stirred in with spaghetti, can't wait to try it with Parmesan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ANNSU"
},
"reviewBody": "a little troublesome, but tastes great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NPEAKE"
},
"reviewBody": "This was awesome. I used this to make the Artichoke and sun-dried tomato chicken (on the site) and it is a family hit. This recipe is a keeper! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Gross? do you know that is what Pesto is supposed to look like? Omitting the Parmesan cheese is illogical. why? then, it isn't pesto = a key ingredient taken out. Understand what you're making.\n\nI found this absolutely fantastic &amp; creative."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MtnBikeGirl"
},
"reviewBody": "I love this! I had some dehydrated roma tomatoes in my freezer from last summer's harvets. I made a half batch only because my mini-chopper is small. Gross looking, buh? That's what pesto looks like! I would hardly call it gross looking. I omitted the canned tomatoes, because I didn't feel like opening a can for half of a 1/3 cup. It turned out great. I froze half so I could enjoy pesto and bread later on. I omitted the cheese too because I'm lactose intolerant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow does this ever look gross... and I have the tomato paste to thank for that. If you can get beyond the look and put it on french bread with melted cheese on top it is wonderful. I left out a number of things: Parmesean and red wine for example; but I doubt that those things would AID in how awful it looks. This is not something I would ever serve on pasta but as an appetizer hidden beneath cheese it is yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GANGWISH"
},
"reviewBody": "This was super yummy on fresh bread. Even my young cousins (9, 11 &amp; 14) liked it. One batch is plenty for a party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "DAGNYH"
},
"reviewBody": "Waaaay to much tomato, I added a bunch of extra garlic, basil, and pine nuts and some extra balsamic and olive oil to cut down on the tomato paste flavor and it turned out alright, but I would not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "RJTABER"
},
"reviewBody": "There was so much red wine and vinegar, I could hardly stand to eat it. Next time I'll put in maybe half of each."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ORIONOC"
},
"reviewBody": "I tripled this recipe and it was such a big hit that I still ran out! Great flavors - perfect with a rich red wine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good sauce with Angel Hair pasta! Fairly quick to make and actually has a texture similar to meat sauce. A good vegetarian substitution."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was great! I added shrimp and bowtie pasta and it was definitely a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALETIA"
},
"reviewBody": "Very easy to make and very quick. It stores well for a quick pasta dinner."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25307/sun-dried-tomato-pesto/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/496/side-dish/sauces-and-condiments/sauces/pasta-sauces/",
"name": "Pasta Sauces"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1200/side-dish/sauces-and-condiments/sauces/pasta-sauces/vegetarian/",
"name": "Vegetarian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25307/sun-dried-tomato-pesto/",
"name": "Sun-Dried Tomato Pesto"
}
}
]
}
}
, "about": [
]
}
]