				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Swedish Ground Almond Spritz Cookies"
,"datePublished": "2020-06-18T23:09:05.000-04:00"
,"dateModified": "2020-06-18T23:09:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "AKBELL"
,"url": "https://www.allrecipes.com/cook/298034"
}
]
,"description": "This is an authentic Swedish Almond Spritz recipe handed down through the family from Swedish Ancestors. It&#39;s the only recipe I&#39;ve ever know that includes real almonds and not just almond flavoring. It&#39;s a delectable cookie!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/uEdb35DuG_GYD3XlnXNX22ylUiE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/228875-c2f122b83e2548c0b4d53ddc429ae7d1.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Swedish Ground Almond Spritz Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "28"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "84 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "14 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "43 mg"
,"sugarContent": "4 g"
,"fatContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
,"recipeIngredient": [
"0.75 cup blanched slivered almonds",
"1 cup butter, softened",
"1 cup sugar",
"1 egg",
"1 teaspoon almond extract",
"1 tablespoon milk",
"2 cups all-purpose flour",
"0.125 teaspoon baking powder",
"0.25 teaspoon salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Spread the almonds out on a baking sheet. Bake in the preheated oven for 10 to 15 minutes, until lightly browned or until they give off an aroma. Remove from the oven, and allow to cool completely. Grind to a consistency resembling rough sand in a food processor or blender. Be sure almonds are cool, or you will make almond butter."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the butter and sugar until light and fluffy. Beat in the egg, then stir in the almond extract and milk. Sift in the flour, baking powder and salt, and mix in along with the ground toasted almonds to form a soft dough. Refrigerate the dough for 15 to 20 minutes. This will help the cookies keep their shape after pressing."
} ,{
"@type": "HowToStep"
,"text": "Lightly grease cookie sheets, and fill cookie press with dough. Press out cookies at least 1 inch apart depending on the size. You can experiment with different cookie designs. I&#39;ve found most true Swedes tend to use the star shape, however, you&#39;re free to use whatever shape suits your fancy."
} ,{
"@type": "HowToStep"
,"text": "Bake for 8 to 10 minutes in the preheated oven, until cookies are lightly browned. Cool on the cookie sheets for a minute before transferring to a wire rack to cool completely."
} ]
,"recipeYield": ["48"]
,"totalTime": "PT80M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John"
},
"reviewBody": "recipe was great. I probably added 20 percent more almonds than the recipe called for. I also used whole almonds which were much less expensive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emily E"
},
"reviewBody": "This recipe is very tasty, judging by the dough. However, I too found the dough too sticky and soft to press. Unaltered, this recipe may work best using a cookie press with a type of icing tip (instead of the design plates). To make this work with the cookie press design plates, I added 2 1/4 cups flour. This made the consistency perfect but really weakened the flavor. So, if adding more flour, you may want to also add a little more sugar, salt, and extract. I've found that working flour into the dough with my hands is the best way to judge the consistency of the dough. Once my hand comes clean easily, I've gotten a batter just stiff enough to keep shape. To get a finer almond grind, use a mortar and pestle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie B"
},
"reviewBody": "Very yummy! I used almond flour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "These were excellent. I used almond paste that I had on hand and reduced the sugar by a third. The cookies got even better over time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SkeezicksDuke"
},
"reviewBody": "Very easy to make and absolutely fantastic taste. They will definitely be a hit this Christmas. Tip - I did not keep the dough in the fridge as I found it too hard to dispense out of the cookie press."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "susana"
},
"reviewBody": "These cookies are really delicious. BUT you must let the flavor develop overnight, it makes all the difference!\nAlso, don't have a cookie press so I made them like peanut butter cookies with crisscross fork. Think smaller thinner cookie press type would be even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Won't make again. Bland, could not detect the almond flavor. \nDid have proper spritz consistency and a crisp, well shaped cookie: too bad it was lacking in flavor!\nNancy Smith"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Turnbull"
},
"reviewBody": "I subbed 1/4c brown sugar for white because I ran out, and omitted the milk. I had absolutely no problem with the consistency for the cookie press. I personally would have preferred more almond extract, I think. But these are a good chewy cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberlee Marshall-Coleman"
},
"reviewBody": "Great flavor, but for me I changed the recipe.. using Confectioners sugar instead of white sugar. Still a bit sticky, but refrigerate to dough before using the press. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toytle"
},
"reviewBody": "Great Spritz recipe! I followed the recipe as written, but refrigerated for 2 hours as some suggested. I kneaded the dough to soften it before putting it in the cookie press and I had no problems. I had bought sliced almonds instead of slivered and the first batch burned. I put a second set of almonds in for only 5 minutes and they came out fine. I also baked the cookies for 7 min, as they were a little more brown than I liked. I didn't grease the pan, and didn't have any problems with sticking. Sometimes larger pieces of almonds clogged the holes of the cookie press, so next time I will try sifting the ground almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ErichKD"
},
"reviewBody": "Very difficult to spritz them, cookie press clogged up every time after two time pressing a got a triple cookie, had it in the fridge as recipe directed. taste was OK"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Su"
},
"reviewBody": "These cookies taste good with the mix of the almonds in the flour, which gave it a creamy taste. They tasted even better the next day. The only changes I made are that I used almond flour instead of the slivered almonds &amp; reduced the almond essence by half as my family &amp; I are not big fans of the almond essence. I used almond flour as it was faster and easier for me to use this as opposed to slivered almonds as in the recipe. I converted the recipe into metric (in the conversions portion at this site) and then took the measurement from there as being 110gms of almond flour as opposed to blanched slivered almonds. I then lightly toasted the almond flour in a pan over the stove till fragrant but stirring it constantly to prevent the almond flour from burning on the stove top. Baked the cookies at 160°C for about 13-15 minutes for a crispy cookie – again a personal preference. The cookies did puff up in the oven but for most part kept its shape, without retaining too much details of the cookie press set shapes used. The dough was too soft to handle but I did not want to add any additional flour to compromise the taste. So I kept refrigerating the dough and using bits from the fridge. I live in a tropical country with a very humid and warm temperature, ranging between 25-30°C. All in all a good recipe for cookies that my kids, husband, guests &amp; I enjoyed. Will definitely make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bohlenn"
},
"reviewBody": "Tasty good! This is the recipe I've been looking for, for years! They pressed out perfectly except that I didn't grind the almonds finely enough, and so when I tried to use cookie press discs that only had little holes, those holes got plugged up. So I used discs that had bigger slots, like one that makes a snowflake. Grind your almonds finely! Other than that, I'm very happy with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Logan"
},
"reviewBody": "I love, love, love this recipe. I had almond meal so used about a 1/2 c of that instead of the almonds in the recipe. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momo"
},
"reviewBody": "I used only scant 2/3 regular sugar, and 2 tsp. almond ext. 1 tsp. vanilla, and only 1 tsp. milk, I baked 12-15 minutes, we like them\ncrispy-till bottoms &amp; edges are a light golden--You will have trouble with the almonds getting stuck in cookies press, so just remember to\nuse the \"1/2 inch Star tip\"-&amp; they won't do that-and also when you \ngrind the almonds, make sure they're cool-&amp; add 2 Tbsp. sugar to\nthe almonds-use \"slivered almonds\" -chill briefly-these are truly a delicious swedish cookie-our favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mason"
},
"reviewBody": "I just made these and they are great! I had no problem with using this recipe in my cookie press. I use a Teflon cookie sheet that I do not grease and I place it in the freezer for five minutes before using, it helps the dough stick to the pan. I do this for all Spritz recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "physicsemily"
},
"reviewBody": "These were wonderful. I love the roasted almonds. I disagree with all the people who said they were difficult to make with the cookie press. The first few are never pretty. They turn out great if you follow the instructions. If the dough gets too soft, try tossing it in the freezer for a few minutes, then load up the cookie press and try a few test cookies as it warms up to the right consistency for a nice, clean pattern."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Incredible flavor, poor performance as spritz cookie... make them anyway! I was really excited about this recipe because I love almonds so much. Other reviewers were right in saying that this recipe is NOT a spritz recipe. The dough is way too sticky and will not hold it's shape once you run it through the cookie press. I added an extra 1 cup of flour, allowed it to chill in the fridge for 8 hours, and it still was difficult to press and completely lost its shape in the oven. I even tried rolling it out onto a floured surface and cutting with a cookie cutter... the dough just pulled apart and stuck to everything. BUT... all of that became no big deal once I tasted the finished cookie. DIVINE! They taste like no other and are absolutely amazing. I ended up using a spoon and dropped them onto a cookie sheet and baked as directed. I'm thinking about drizzling them with dark chocolate before serving them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ExMilitaryWife"
},
"reviewBody": "I agree with Jen 100%. Dough was way, way to soft to press out. Even after dough sat in fridge for over an hour. Lost their shape while baking. I ended up just rolling them into balls. They did smell and taste great. But if you want shapes look for another recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "The taste was OK. I'm glad the almonds were roasted, or there wouldn't be much flavor in these! Refrigerating the dough is a MUST before baking! I really wished I liked these better, because I like the idea of the actual almonds for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kmac"
},
"reviewBody": "I've been making these cookies for at least 5 years, and they're my Swedish hubby's favorite. I follow the recipe exactly, except I refrigerate the dough for 2 hours. I've never had a problem with my cookie press, but I also make sure that I'm pressing these cookies onto cool cookie sheets. If you don't have any available, press the next batch onto parchment paper, and slide that onto the warm cookie sheet. The flavor of these cookies is outstanding, and, as with most spritz cookies, well worth the time and effort!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "D Novello"
},
"reviewBody": "Very tasty. I could have eaten the whole batch by myself."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These cookies absolutely do not work. The dough is way too soft to press, even with 1 cup extra flour. They spread into a shapeless puddle when you try to cook them. The only positive thing about this recipe is the smell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I liked this recipe. It was easy and made soft almond cookies. I was looking for a recipe of almond cookies dipped in chocolate where they are very chewy and more sugar texture, so I didn't give it the highest rating because of that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is awesome but the cookies are hard to press with the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cinnamon Smith Kellenberger"
},
"reviewBody": "Very tasty, was told by an Italian they tasted like something from home. I like actually using almonds in a recipie instead of just using extract. Didn't have a cookie press, just spooned tbs and cooked same amount of time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/50859/swedish-ground-almond-spritz-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
"name": "Scandinavian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/50859/swedish-ground-almond-spritz-cookies/",
"name": "Swedish Ground Almond Spritz Cookies"
}
}
]
}
}
, "about": [
]
}
]