				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet Jalapeño Cornbread"
,"datePublished": "2020-06-18T23:53:08.000-04:00"
,"dateModified": "2022-07-05T06:16:16.000-04:00"
,"author": [
{"@type": "Person"
,"name": "hotsauce"
,"url": "https://www.allrecipes.com/cook/2563857"
}
]
,"description": "This jalapeño cornbread is tender and moist with spicy jalapeños in every bite. Sure to be a hit if you like sweet cornbread and love spicy peppers!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/WAdNrtA8U4cC_hbx_VuqhykpHz8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9283988-1ac5ce98ba6e469c9ca69a8c30935d2d.jpg",
"height": 1580,
"width": 1284
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Jalapeño Cornbread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "151"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "294 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "49 mg"
,"fiberContent": "2 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "3 g"
,"sodiumContent": "532 mg"
,"sugarContent": "13 g"
,"fatContent": "13 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.66666668653488 cup margarine, softened",
"0.66666668653488 cup white sugar",
"2 cups cornmeal",
"1.3333333730698 cups all-purpose flour",
"4.5 teaspoons baking powder",
"1 teaspoon salt",
"3 large eggs",
"1.6666667461395 cups milk",
"1 cup chopped fresh jalapeno peppers, or to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking pan."
} ,{
"@type": "HowToStep"
,"text": "Beat margarine and sugar together in a large bowl until smooth."
} ,{
"@type": "HowToStep"
,"text": "Combine cornmeal, flour, baking powder, and salt in another bowl. Gently stir eggs and milk together in a third bowl. Pour 1/3 of the milk mixture and 1/3 of the flour mixture alternately into margarine mixture; whisk until just mixed. Repeat with remaining flour and milk mixtures; stir in jalapeño peppers. Spread mixture evenly into the prepared baking pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 22 to 26 minutes. Cool in the pan for 10 minutes before slicing."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jon Horowitz"
},
"reviewBody": "Best cornbread, jalapeño or plain, that I've tasted. Has the corn taste without a grainy texture. I used 4 oz of canned jalapeños and 4 oz of canned green chilies and hit them in a food processor and then drained. Perfect balance without too much heat. It's going to a party to be paired with tri-tip but first it's the accompaniment to my baby back ribs. I used this recipe because others used too much flour and other ingredients. So good. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've done the same cornbread recipe for years until I discovered this one. I did pre-measure ingredients, mixed dry in a mixing bowl, then everything else went in. Key to this recipe is not to over mix or your going to have tough cornbread. Also the first time I did it the end product came out a bit dry which could have beed due to my cast iron baking dish. This go around I added water, probaly 1/2 cup. Bingo, great moist cornread. This recipe is built around the jalapeno peppers. It does not over power with heat, sugar and corn meal prevent that. I would say if you have issues with the pepper heat as mild as it is, search for another recipe. It might work but might not."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lyanne Paddick-O'Leary"
},
"reviewBody": "Could not find my tried and true recipe so made this one.Followed the recipe exactly and it did not rise, and was crumbly with a very gritty texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is exactly what I was looking for. I used the recipe exactly as it was written and it turned out perfectly. My only deviation from the instructions was when I substituted Carlini Olive Oil Cooking Spray for grease in the 9x13 baking pan. This will be my go to recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I don’t understand how anyone can give this recipe a bad review. It’s DELICIOUS. I used unsalted butter, 1 cup of sugar, 1 cup of (diced very finely) pickled jalapeños from a jar and an 8x11 ceramic baking pan for 26 minutes. I wasn’t planning on making chili today, but now, I MUST! This wonderful cornbread plopped in the middle of a bowl~~~what a meal! Thank you so much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "St Copper"
},
"reviewBody": "I made this with creamy stick of butter and almond milk that made it more filling and extra sweet to balance the spicy of the jalapenos for the kids. It was well liked and will do it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish"
},
"reviewBody": "I followed the recipe with the exception of using an 8x8 pan instead of 9x13. I cooked it at 400 for 26 minutes and it was still not done so I lowered the oven to 325 and cooked it for an additional 7 minutes. My husband is picky about cornbread as he likes it sweet and approved so this is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "Great recipe as written! Everyone loved it... it was moist and flavorful. I wish people would review recipes as written... how do you review a Jalapeño corn bread recipe but don’t use jalapeños!?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Vicky East"
},
"reviewBody": "Flat as a pancake. And the baking powder wasnt old. i used the adjust calculator as i didn't need 12 servings. Only 6. Whether this was the problem i don't know. I've made cornbread many times and this was a complete waste of time and ingredients. Find another recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "So I didn’t do the three bowl thing. I just added the dry ingredients to the butter/sugar mixture and then slowly mixed in the eggs and milk. I also added bacon because bacon makes everything better. And I did my in a cast iron skillet. It was perfection. Can’t screw this recipe up: it is so easy and forgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ZAKKIE"
},
"reviewBody": "Excellent flavor! I did a one-bowl mix--dry ingredients stirred together, added 1 1/2 cups finely chopped jalapeno (about 5 large peppers) and stirred well, then added beaten eggs, milk and finely melted butter (I don't use margarine). Easy. The jalapenos were well scattered throughout the bread and spicy but not too hot (took out the seeds and membranes)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renee Nicole"
},
"reviewBody": "Cornbread with several things, including chili and split pea and ham soup, are traditional in our family. I was looking for a recipe with more flavor, but not a ton of heat as my husband is not a fan. I love this recipe! I seed my jalapenos when I cut them to help reduce the heat and this recipe is perfect. This cornbread has full flavor without being hot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ian J Jabloner"
},
"reviewBody": "I added fresh corn to the mix. Came out awesome. Everyone enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChefBigE"
},
"reviewBody": "Recipe is great! I made it gluten free and dairy free, because of my daughter's allergies. I used a plant based margarine, 1 to 1 gluten free flour and unsweetened almond milk. Put cast iron skillet in the oven as it preheated. When it was ready, I coated the skillet with olive oil, making sure I also coated the sides. It was awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunflower Madison"
},
"reviewBody": "Absolutely delicious!! I followed almost everything, except I used real unsalted sweet cream butter. It was such a hit that I decided to make some without jalapeños also. Definitely saving this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sunny Mills"
},
"reviewBody": "I baked according to these instructions but the center of the cornbread did not bake, I had to turn the oven down to 325 and then bake an additional 8 minutes. It was tasty and a firm consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debrapet"
},
"reviewBody": "Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patrick"
},
"reviewBody": "I added bacon. ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Hines"
},
"reviewBody": "Great recipe! I actually added fiesta corn and cheddar cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Ann"
},
"reviewBody": "Perfection! Truly the best cornbread recipe. Everyone raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bernadette Corsaro"
},
"reviewBody": "We enjoyed every bite! Very easy to make too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Savage"
},
"reviewBody": "This was very tasty. I used 6 jalapenos and the cornbread came out having a good kick without being overly spicy. As another reviewer suggested, I combined the wet and dry ingredients separately and then combined them right before baking. I used oil instead of margarine because I don't use margarine and didn't feel like getting out a mixer or melting butter. It rose fine. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanie"
},
"reviewBody": "I loved this recipe. I used about 3/4 cup of jalapenos from a jar. Since I like spicy food, I'll use 1 or 1-1/2 cups of jalapenos the next time I make this recipe. Note that the jarred peppers were good. Just make sure you cut up the peppers and remove the seeds and drain them on a paper towel. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoriaren"
},
"reviewBody": "Made it just as shown. It was delicious. I took it to. A Mexican happy hour and the cornbread muffins were the hit. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Gamauf"
},
"reviewBody": "Came out perfect! I will likely add more sugar next time to sweet it up some more. Following the directions exactly made a great textured cornbread. It was a big hit for Mother’s Day dinner with my slow smoked pork butt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thejustinemachine"
},
"reviewBody": "It was really easy to follow and turned out beautifully. I generally don't follow recipes allll the way- Here's what i switched up:\nI subbed out the mararine for butter and I also subbed out milk for coconut milk. I also made mini cupcake style cornbread as opposed to a sheet. Finally switch up- I added shallots as well! It was #nomnom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Itsjasmin1"
},
"reviewBody": "I make this for my husband and he loves it every time! Not too dry which is what I like the most and he loves the jalapeños."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "codemasterg"
},
"reviewBody": "Followed as written. I used some hot peppers from last year's garden that i froze and added some real bacon bits. Made in a cast iron skillet that i preheated in the oven for about 15 mins (while oven was preheating). Simple and so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Fantastic!! I used honey instead of sugar, butter instead of margarine , and diluted the milk with water to equal the 1 2/3cup. Great recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Surama Barroso"
},
"reviewBody": "I added cheddar cheese and fresh yellow corn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gwen renton"
},
"reviewBody": "I made this for the first time for Super Bowl Sunday to go with the homemade chili. I used pickled sliced Jalapeños and also added sun-dried tomatoes in oil. I topped the cornmeal with grated parmesan and cheddar cheese the last few minutes of baking. It turned out perfect. Definitely would make this again. Don't be afraid to be inventive, add whatever you want to the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robert Rickman"
},
"reviewBody": "Pretty solid recipe. I would say a full cup of diced jalapeno is a bit much for most people. I used two peppers, each about 3-4\" long and that was enough to allow the peppers to showcase themselves without becoming the star of the show. If you cook this recipe in a cast iron cornbread pan you should check doneness at 20 minutes"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "I made this recipe into muffins as someone suggested. It took about 25 minutes. I loved the flavor of this cornbread! I little heat with the sweetness was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Queen"
},
"reviewBody": "It was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "phorne101"
},
"reviewBody": "I actually made it gluten free by using corn flour and it came out better than the first time I made it with regular flour which was a little dryer than the corn flour version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "Very good. I made it a wee bit healthier. Used 1/3 cup whole wheat flour &amp; 1 cup of all purpose. Add 1/2 cup pureed cauliflower &amp; u couldn't taste it at all. Subbed 1 of the eggs for egg white &amp; used 1/4 cup of truvia. It was plenty sweet for me with a bite of spice from the jalapenos. I may leave out half the butter next time. Good stuff."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chatsnoir"
},
"reviewBody": "just a note that diced, sauteed sweet onion is also a good addition to the jalapeno cornbread. i make it simple and use the K_______ brand honey cornbread mix as the base for the recipe. very yummy! also good with a little shredded cheddar thrown in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "Really liked this recipe. Easy to make very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "This was really delicious. Family loved it as a BBQ side. I was happy because I was worried the family would think it was too spicy. I only used one jalapeño for that reason. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dwight"
},
"reviewBody": "I used a half cup of sugar and could have gone with a quarter of a cup. Corn is sweet to begin with. I also used jarred jalapenos and it was great! I like the ration of corn meal to flour. So many recipes use too much flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Chitra Patel"
},
"reviewBody": "The only thing I changed is that I used butter instead of margarine. The cornbread is bland and so dry. I'll be sticking with recipes that have a 1:1 ratio of flour and cornmeal from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lora"
},
"reviewBody": "I made no changes to recipe and will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tripp"
},
"reviewBody": "Perfect just the way it was written!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Quita Mathis"
},
"reviewBody": "Made this dish to pair with some cabbage soup and it was delicious. I had to cut down on the peppers to ensure the kids could enjoy it. Next time I will make a separate pan bc I love jalapeños. I would appreciate any tips on making my bread more fluffy next time around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gretchen West"
},
"reviewBody": "This is a great recipe, even if you leave out the jalapenos. I sometimes substitute sweet red peppers. The consistency is like cake &amp; the flavor is sweet &amp; indulgent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol D'Amelio"
},
"reviewBody": "This is delicious cornbread. Although we loved it. I will reduce the sugar a little next time. I prefer my food to be less sweet than my husband does. I will search for a happy medium."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Zinaman Haynes"
},
"reviewBody": "I cut this recipe in half and baked it in a 8X8 pan. I added a small amount of chopped red bell pepper and onion along with the jalapeno. I also added 1/4 cup yogurt to keep it moist. It was moist and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan J. Jacobsen"
},
"reviewBody": "I left out the jalapeños and it came out awesome!! Used three bowls and that totally made a difference, then only using one. Was moist, soft and very well made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eileen Paulson"
},
"reviewBody": "Loved it I used only 1 bowl but it turned out great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amie Herndon- Matthews"
},
"reviewBody": "It was so good I don’t think I’ll ever make regular cornbread again!!! I uploaded a picture after my family finished their meals..Only a few pieces left!?? Wonderful recipe!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lkedmiston"
},
"reviewBody": "I make it with gluten free 1 to 1 baking flour and my jalapenos come from a jar. (wrapped in paper towel to remove excess moisture) It makes me smile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Theresa Wang Chen"
},
"reviewBody": "Removing the seeds took away the heat but you still get wonderful flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Seth Blackstock"
},
"reviewBody": "This. Really good cornbread recipe and the jalapenos kick it up some, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hogenb"
},
"reviewBody": "Easy to make. Chopping a cup of jalepenos took the most time. Made it for a chili cook off and it fared about the same as the other 2 cornbread options."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sean Anderson"
},
"reviewBody": "Just finished making this. First time ever making cornbread and it's amazing. I substituted butter for margarine, did half a cup of sugar with about a tablespoon of maple syrup and brushed some butter and maple syrup on the top after it came out of the oven. Highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Char Roberts"
},
"reviewBody": "One of the best cornbreads I've ever made! Not too sweet (although if you want it sweeter just add more sugar). I halved the jalapenos and added 2/3c shredded cheese. Poured it in to a hot cast iron skillet and baked it in the oven. Kids LOVED it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaC108"
},
"reviewBody": "I loved the combo of sweet and heat! Wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leon Folson"
},
"reviewBody": "no changes made. Yes I would make it again and again! Very delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lara Raich"
},
"reviewBody": "FINALLY!!!! A cornbread recipe that actually turned out for me! I'm a fairly decent cook but baking is not my strong point. I have tried several scratch cornbread recipes and they always miss the mark in one way or another. For me, this one turned out A-OK. I changed the serving amount to six, because there are just three of us here. And I followed another reviewer's advice and just used one bowl. I also added a little more sugar because I'm a sweet cornbread fiend - I must admit - it was probably a little too sweet after that. And instead of fresh jalapenos, I used pickled, because that was all I had. The cornbread was maybe a tiny bit crumbly but I didn't follow the steps correctly so that may be why. I will definitely use this recipe again. (Oh, and I added a little salt.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin"
},
"reviewBody": "Great! Followed directions to a \"T\", and it turned out wonderful. Mine took about 27 minutes to get just right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Roy"
},
"reviewBody": "I love this recipe, the only thing I changed was that I added Sharp Cheddar Cheese and Whole Sweet Corn"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Rochelle"
},
"reviewBody": "My hubby does not like cornbread, but he loves this stuff!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Shari Twigg"
},
"reviewBody": "This was terrible. The driest, most crumbly cornbread I've ever made. I have a great recipe for this already but thought I'd try another one for a change. Worst mistake ever. I make cornbread about once/month, and Ive been avidly baking and cooking for 25+ years. Look elsewhere for a good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SCARLETMAPLE"
},
"reviewBody": "This was tasty and attractive - I added a bit of red pepper. The problem was that it crumbled like crazy. Could it be because I didn't use the 3 pots?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Whittaker"
},
"reviewBody": "Lovely cornbread. It went well with the black bean salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CARMEN"
},
"reviewBody": "Super recipe...good idea about using less sugar. Very good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Robbin"
},
"reviewBody": "Made it for a gathering. Most people enjoyed it. Used Anaheim peppers so spice was mild which turned out well as the gathering I took it to didn't really care for hot foods. I'll make it again for myself but will use jalapeno peppers as I prefer a little heat. As some others suggested I did add a cup of corn and shredded cheddar. Worth making again. Would probably be great with a bowl of chili or stew."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Holly Adams"
},
"reviewBody": "a friend made it but it was not as sweet as my husband and i would've liked it so we added a little bit more sugar to it, but the heat level was right on for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jazzy"
},
"reviewBody": "Great! Used poblanos since that's what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saraielle"
},
"reviewBody": "Just as described. It did not disappoint. We made it to have with our pea soup. Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kotaishi"
},
"reviewBody": "Added chopped up applewood smoked maple bacon and jalapeños. D Lish! Oh, by the way, I've never baked anything in my life before!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MIRANDA"
},
"reviewBody": "Delicious with nice bursts of heat from the jalapenos! The only thing I did differently was use butter instead of margarine. You can even freeze your leftovers for later, and it's just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KAREN160"
},
"reviewBody": "Great taste. Directions easy to follow. Light taste and not greasy or oily . Next time I'll add fresh corn and a handful of cheese for variation. This is my new favorite recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina D'Andrea"
},
"reviewBody": "with most jalapeno cornbread recipes with jalapeno cornbread ratio is usually off but with this one there was a perfect amount of jalapeno. I did one cup of sugar because I like my cornbread on the sweeter side, but other than that I did it exactly as the recipe said"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam3213"
},
"reviewBody": "Great with pinto beans. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Geipa"
},
"reviewBody": "I made this twice. The first one I threw out because the toothpick was clean and I let the bread sit for a half hour. The center sank and was not cooked. I bought a bigger pan and the second time it was fine. I liked the flavor (used whole cup of sugar)and would probably make again. Next time I will add some cheddar cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Lyle"
},
"reviewBody": "I did make a few changes to the recipe. I used coconut oil instead of butter. Used 1/2 cup of sugar and 1/3 cup of chopped jalapenos. Baked it in an oiled preheated cast iron skillet @375 degrees for 28 minutes. A very good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clmerritt1"
},
"reviewBody": "This cornbread is sooooo good. I followed directions aside from the amount of jalapeno. I had only about a half cup worth of jalapenos. It still came out pretty spicy with a hint of sweetness....delicious! I seriously couldn't stop eating it. Served with chili on a cool Indiana fall day while watching football...perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Clifford"
},
"reviewBody": "This recipe was AWESOME! I shared it with my neighbor, some friends and some family and they all raved over it. The only change I made was that I used unsweetened butter in place of the margarine. I'm going to make it again this week and will replace 1/2 of the butter with coconut oil which should make it a little lighter. It was moist much to my surprise too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baker54"
},
"reviewBody": "I don't ever remember liking cornbread, nevermind making it. I like this recipe. I used red jalapeños - a little sweeter; less heat. To be perfectly honest... I forgot the baking powder. Having said that, as far as I and my cornbread loving wife can tell, it looks just like the picture (but with red jalapeños) and tastes amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "8-1-2016 ~Since I wasn’t planning on having any of this (I’ve been carb free for nearly two months) it didn’t bother me to make a cornbread I knew would be too sweet for me. Hubs said he prefers it sweeter, so sweeter it was. (Funny it should make a difference to him at all, since he’s no real corn bread fan in the first place) But this was a pleasant surprise for both of us – I did give it a taste and it wasn’t nearly as sweet as its title would imply. As for Hubs, he enjoyed it more than I thought he would and I’m thinking it was the added interest of the jalapeno that was the deciding difference. (Due to his sensitive innards I used just half the amount called for and it was just right – even if you don’t have sensitive innards!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zvikki"
},
"reviewBody": "well, I just made this to go with red beans &amp; rice. It is good, but I felt like the jalapeno flavor overpowered the cornbread flavor? Which is why I went with 4??'s. \nIt has a nice texture and it comes out of the oven looking perfect! But, if I make this again I think I would cut the jalapeno's down to a half cup and maybe increase the sugar slightly. Oh, I did add 1 cup of cheddar cheese, as some here suggested, and I was using up frozen jalapeno's from last season. So, that may have affected my results to. \nStill, I would recommend it to all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark W Turner"
},
"reviewBody": "It was very good. A little too fluffy for my taste. More like a cake! It would be great for sopping up gravy or other such liquids, ie red beans and rice, jambalaya, etc. I will definitely make it again but will cut the baking soda down to 2.5 teaspoons, and will add probably two cups of whole kernel corn. Maybe 1.5 cups corn... Oh yea Instead of 2/3 cup sugar I will try 1/3 to 1/4 cup. I used a 12 inch Cast Iron Skillet (preheated to temp and about .5 Tablespoon of coconut oil in pan) and it filled it up fine and was still 2.5 to 2.75 inches high! It is the best Jalapeno Cornbread recipe I have found so far!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Whit Bit"
},
"reviewBody": "This was soooooooo good. The best cornbread ever. I'll definitely be making this again. I used real butter lol instead of margarine. I did follow the instructions provided with 3 bowls. I used 1 cup of sugar. Mixture of powdered turbinado and white sugar. I baked the cornbread on 400° for 20 minutes but it wasn't ready so I put it back in on 325° for another 10 minutes. I put foil on top though because I didn't want it any browner. It came out perfectly. I'd suggest letting it cool for 15-20 minutes. I couldn't wait though! It'll crumble so be careful. Omg it's so good. I used whole milk and greased my 9x13 glass pan with EVOO. It's a cornbread cake!! You have to open your mouth big to eat it. That's my kind of cornbread ;-) ;-) ;-) thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bobbi church"
},
"reviewBody": "no changes loved it as is..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HP"
},
"reviewBody": "This cornbread recipe was easy to prepare, moist and delicious. My family enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lrp93"
},
"reviewBody": "Very good flavor! I wanted to use maple syrup instead of processed sugar so the batter didn't look like a muffin batter - it was very grainy. Baked in muffin cups and they turned out just fine. Do be sure to use rubber gloves to chop the jalapenos. I know better, but I was in a hurry so I skipped them and paid for it all night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pupsmum"
},
"reviewBody": "Oh My Goodness....Throwing out all other cornbread recipes! Thanks for sharing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mammycooker"
},
"reviewBody": "Why use 3 bowls, too much to wash. I'm with Tea's single bowl method, it turned out fine. Mix wet ingredients, eggs, milk and honey in main bowl, then add dry ingredients. I used 1/2 cup honey instead of sugar and 1 can Ortega chilies, that way it was not too hot for my family. You can also add 1 cup cheddar cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carson Christopher Myers"
},
"reviewBody": "Delicious. I love corn bread, I never realized how easy it is to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Made this with gumbo and it turned out great!! Was nervous because it was for a group of people but I'll be making it again and again. Wouldn't change a thing. Seeded the jalapeños because the gumbo is spicy. Otherwise, left the recipe as is. The 3 bowl thing was a little off-putting (because I'm lazy on cleanup) but I just used two large measuring cups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keeli"
},
"reviewBody": "To quote my BF \"This is what cornbread should taste like!\"\nI didn't change a thing except turning them into muffins and baking for only 15-20 mins topping each muffin with a thin slice of jalapeno. So cute and perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie whitmire"
},
"reviewBody": "excellant.. a little hot for the one person who didnt care for spicy food much but the rest of us who love hot food.. it was great.. if you or someone else dont care for the heat factor as much just do half the pepper amount and try that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "desiree"
},
"reviewBody": "This is the best cornbread !! Perfect consistancy, sweet and slightly hot; just wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I made this bread just how it says on the recipe and it's delicious! I just cut everything in half though cause the original makes way too much for just 2 people."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lekili_"
},
"reviewBody": "This is great without any changes needed. I omitted the jalapenos as I am using the cornbread for stuffing, next time I make it I'll add them. My partner lived in the south for a few years, said it treated as good as any he had in Georgia. It has just the right amount of sweetness, and is very light."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl's Cooking Now!"
},
"reviewBody": "We love this bread. Very moist, good texture, not dense. Adding enough jalapenos to your liking is a plus!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff N"
},
"reviewBody": "Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yaninab"
},
"reviewBody": "Added kernel corn and cheddar cheese to it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230999/sweet-jalapeno-cornbread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/342/bread/quick-bread/cornbread/",
"name": "Cornbread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230999/sweet-jalapeno-cornbread/",
"name": "Sweet Jalapeño Cornbread"
}
}
]
}
}
, "about": [
]
}
]