				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet Potato Gnocchi"
,"datePublished": "2019-04-02T02:45:29.000-04:00"
,"dateModified": "2019-04-02T02:45:29.000-04:00"
,"author": [
{"@type": "Person"
,"name": "ELA33INE"
,"url": "https://www.allrecipes.com/cook/717963"
}
]
,"description": "A new and yummy twist to Gnocchi. Pair this up with butter or your favorite alfredo sauce. This recipe can be made with butternut squash instead of the sweet potatoes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/3eDylYSG_q6uIVH2Y3lobnWpXB0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8061343-7544c15a51694067be0457191b1524ec.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Potato Gnocchi"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "216"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "346 kcal"
,"carbohydrateContent": "71 g"
,"cholesterolContent": "47 mg"
,"fiberContent": "5 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "372 mg"
,"sugarContent": "5 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 (8 ounce) sweet potatoes",
"1 clove garlic, pressed",
"0.5 teaspoon salt",
"0.5 teaspoon ground nutmeg",
"1 egg",
"2 cups all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Bake sweet potatoes for 30 minutes, or until soft to the touch. Remove from the oven, and set aside to cool."
} ,{
"@type": "HowToStep"
,"text": "Once the potatoes are cool enough to work with, remove the peels, and mash them, or press them through a ricer into a large bowl. Blend in the garlic, salt, nutmeg, and egg. Mix in the flour a little at a time until you have soft dough. Use more or less flour as needed."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. While you wait for the water, make the gnocchi. On a floured surface, roll the dough out in several long snakes, and cut into 1-inch sections. Drop the pieces into the boiling water, and allow them to cook until they float to the surface. Remove the floating pieces with a slotted spoon, and keep warm in a serving dish. Serve with butter or cream sauce."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family and I loved this! I’m surprised at how good it came out! The only things I’d mention are that you should just throw the dough in two piping bags and slowly squeeze with one hand while I used a pair of tongs to cut inch pieces right into the water!!! So much easier! Also having a recipe for a sauce to go along with it would have been cool! https://www.foodnetwork.com/recipes/giada-de-laurentiis/sweet-potato-gnocchi-with-maple-cinnamon-sage-brown-butter-recipe-1950511 I did this one. And threw some spinach in after cause why not. I don’t know about everyone else but my potatoes were still a little hard but no big deal I mashed my way through!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peter Yerdon"
},
"reviewBody": "I used butternut squash instead I also used a measuring cup for my 8 oz in future I weigh the squash. I also added a little parmesean cheese to the mixture. about a 1/4 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Verna"
},
"reviewBody": "Super easy! Used canned sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ron"
},
"reviewBody": "We doubled the garlic because we love garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Simone"
},
"reviewBody": "This recipe is easy and delicious! I wish it came with a bit more guidance (for example, how the dough should look/feel when it’s being rolled) because I thought it was too sticky and kept adding more flour which resulted in them being pretty firm once cooked. It was still delicious and really depends on how you prefer to eat them! I’m also a first timer, so more details would’ve been appreciated.\n\nAlso, I didn’t have nutmeg so subbed a bit of cinnamon and clove and it tasted great. \n\n Great recipe overall!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa G"
},
"reviewBody": "Best tasting Gnocchi I have ever had. It was a bit denser that I like but I think I worked the dough too long. We loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James Brako-McComb"
},
"reviewBody": "Good recipe. Had to add a bit more flower than in the recipe. Used the Ziploc piping trick as described in one of the comments and it worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Manning"
},
"reviewBody": "i did not add garlic or nutmeg. I added tony chacheres seasoning with s&amp;p. was very easy to make and super tasty. will definitely make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Andrew Rauschkolb II"
},
"reviewBody": "An excellent recipe that produced a fine meal. I am wondering if it would be possible to make a gluten free/dairy free version for those in my family that have dietary restrictions. Maybe use\nbrown rice flour and or almond flour with some arrowroot starch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Morrissey"
},
"reviewBody": "Heres the trick to making these that they are light and airy. I make them up like mashed potatoes butter , milk ,salt let them cool then add 2 eggs, nutmeg mix that in start off with a cup of flour get your hands messy the trick is adding enough flour to the un sticky point flour surface and kneed folding in extra flour to flour over the dough. cut nice size portion and roll out like play dough in a long log. I use a floured fork to roll them on keep a little pile of flour on the side to dip the fork in after you make them stick them on a tray and put them in the freezer no need to cover after 20 min to 1/2 hour check and see if they are semi frozen that helps them keep the shape. These cook super quick when they float let them sit in the water for a few min more and they are ready to dress with Gravy/ sauce/ butter/browned butter. sure its a little more work but I haven bought these for a long time and I got no complaints! However I get asked when am I making these again LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey"
},
"reviewBody": "I’ve made this twice and both times it turned out great. I found that rolling all the dough into roughly 12” snakes, transferring the roles to parchment paper as I finished each one, and then cutting them all at once really speeds things up and keeps the pieces uniform. You can tidy up the individual pieces if you feel the need. I didn’t. My family loves this recipe. I actually got a collective “yeah” when I said I was making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mikem78"
},
"reviewBody": "I made this and my wife and I loved it. The second time I made it I added some honey to the recipe. All the other ingredients dilute the sweetness of the sweet potatoes. The honey helped bring it back out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joan Rovira Palau"
},
"reviewBody": "I used a mixed of potatoes and sweet potatoes. Really fun to make and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Sugarman"
},
"reviewBody": "After boiling, I sauteed it in butter with onions. Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenn "
},
"reviewBody": "Didn't make too many changes. Used a little more than the 8oz called for, had to add some additional flour. While the gnocchi were good, they float when they are cooked, they didn't have a rich sweet potato taste. I will make them again, but play around with different ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "cindy lograsso"
},
"reviewBody": "Had to throw it out, didn’t turn out"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Claudia"
},
"reviewBody": "I used my homemade butter alfredo sauce turned out much better than i thought, lots of compliments! Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Silver"
},
"reviewBody": "Made this and normal potato gnocchi at the same time. Normal gnocchi was a lot easier to make and needed less flour and wasn't as dense as the sweet potato gnocchi . Was nice, but not as nice as normal gnocchi ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bazpeter"
},
"reviewBody": "Will make it again and I made it with Sage and Brown Butter Sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "radfox59"
},
"reviewBody": "Adding vegetables to fresh pasta mix is always good, I try to make it more savory than sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Gunderson Bonicelli"
},
"reviewBody": "Wonderful!!! I served it with browned butter sage and it was absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PatG"
},
"reviewBody": "I've been making this for several years. I like to serve it with a sauteed Walnut and Gorgonzola or blue cheese cream sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kirsty Hellens-Barkhuizen"
},
"reviewBody": "Was delicious!! Found it a bit more challenging to make than with potato as it’s incredibly sticky. What worked for me was rice flour on my hands and on the surface that you’re going to roll the dough on. Works like a charm! Served with a chunky napolitana sauce and topped with a bit of chili and parmesan. Yum :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissy"
},
"reviewBody": "Our go-to recipe for gnocchi! So delicious. It’s definitely important not to use too much flour in order to get the right texture. These also freeze very well, so I alway double the recipe (since I’m making a big mess anyway...)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wolf Wellington"
},
"reviewBody": "I probably won't make this again. The recipe was easy enough, and came out well but I really hate the taste of sweet potato, and these tasted like sweet potatoes. I thought maybe the flour would make the flavor dull enough I wouldn't mind but it did not. That being said once put in some sauce and some Parmesan cheese, it was still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Rheuark Certuche"
},
"reviewBody": "To be honest I didn't really measure but watch Chef John's video on making gnocchi. I microwaved about 2 1/2 lbs. of sweet potatoes, 2 eggs, a little sprinkle of salt and then added dough a little at a time until it barely held together and then cut into about 6 chunks, rolling into a snake and cutting into 1/2 inch pieces. I even did the fork roll. Not perfectly done but pretty good. I boiled them in a pot of salted water until they floated. I put them in some of my homemade spaghetti sauce. My husband didn't know what to think of them but my daughter and I loved them, as did my grands. I think next time I would like a different sauce because my sauce really overpowered the gnocchi. It was way too much sauce for the amount of pasta. I can't wait to make some to freeze. It was a fun project with my 6-year granddaughter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hil"
},
"reviewBody": "Huge hit with my family, will definitely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kendra swim"
},
"reviewBody": "A tip for anyone trying to make these in less than 2 hours, microwave your sweet potatoes rather than bake them! It takes far longer than 30 minutes in the oven to get the potato soft enough to mash. Easy fix: wet the potatoes, wrap them in saran wrap, and microwave them instead!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah McCausland"
},
"reviewBody": "Great recipe! I did need to add extra flour to make the dough less sticky! I used While Wheat flour. The gnocchi tasted incredible!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meagan"
},
"reviewBody": "I loved it, made it a couple times. Sometimes I like to add bacon and mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swim mom"
},
"reviewBody": "My family has allergies, so I made it with butternut squash, whole wheat flour, and egg replacer. Even my pickiest loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "APinTO"
},
"reviewBody": "Delish!! We tried this recipe and loved it! This was my first time making gnocchi and I couldn't believe how simple it was. Initially tried serving it with a fantastic tomato sauce (that we slaved over), but quickly determined a simple herb butter/parm combo was better suited to balance out the flavours of the dish. We also chopped the sweet potatoes before baking them in an attempted to speed things up, but would recommend baking them whole if you have the time to avoid roasting and browning. Will definitely be working off this recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jbraniff"
},
"reviewBody": "This recipe didn't turn out right. I followed the directions to a tee. It took quite some time to prep and make, and in the end, was a disappointment. I used a butter garlic sauce w a dash of cinnamon. The dough was way too sticky. I read everyone's comments beforehand and was quite sure the recipe would be delicious. Most likely will not try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nightfall"
},
"reviewBody": "They were very tasty, but I made a terrible mess in my kitchen. I even tried the ziplock baggie suggestion, but that somehow made an even bigger mess. They are good enough that I'll make them again. Maybe with better planning I'll be able to do a neater job."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mandy Monell"
},
"reviewBody": "I'm a total newbie chef. Whenever I make this recipe, I end up with super sticky dough and end up adding a ton of flour to get it to even resemble something to work with. I'm not sure if it is me though. I did enjoy the overall flavor of this recipe and have made it on more than one occasion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "otokoyama"
},
"reviewBody": "Great stuff, however. Giving 4 stars due to cooking time of the sweet potato. An 8oz sweet potato takes about an hour at 350° F. This could be oven specific, however my sweet potatoes were still rocks at 30 min. ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef V"
},
"reviewBody": "Im SO happy i came across this recipe!..what a fantastic Idea!!! I didnt follow this recipe to a T..as i used leftover mashed sweet potato(a recipe from this site with maple syrup). This came together beautifully!..and i LOVED the addition of the nutmeg. I used 1 cup of mashed potatoes total, along with the 1 egg and flour suggested. Although did need to increase the flour by about 1/2 cup..but i figure that's because i had additional moisture when made the sweet potatoes. Mine took about 4 minutes to boil, and then i immediately transferred them to a hot skillet with a touch of olive oil for about 1 minute to lightly brown. I served with an additional sprinkle of nutmeg and sea salt .What a wonderful Sweet/Savory dish :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Naegele"
},
"reviewBody": "Made this a couple times according to the recipe, and it was delicious. Then I subbed carrots for the sweet potatoes, and it was still great :)\n\nTime saving tips: I microwave the potatoes/carrots instead of roasting. I also don't mess around with rolling and cutting, just pinch off pieces of dough and throw them in the water. Obviously they're not as pretty that way, but they taste just as good and are way quicker and easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DWilliamson"
},
"reviewBody": "I made this VEGAN! I used Energ Egg Replacer instead of an egg, and tonight [when I make this awesome recipe again] I'm going to try a flax-egg. I baked the potatoes for 30 minutes, then let them sit in the oven (turned off) for about 10 more. I rolled the pasta into very thin, short \"snakes\" to control the size better and ran it over it with a hot fork that i'd left on the oven. I was really surprised by how fluffy these were even on my first try! So very filling too! I made a creamy pasta sauce with mixed vegetables to top this delightful dish, and what a wonderful meal it turned out to be! Thanks for the recipe. ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessa Singer"
},
"reviewBody": "I've made this recipe twice now, and overall it is really good. That being said, its only alright when its cooked immediately, but awesome if you chill or freeze the gnocchi before boiling them. And the prep time is always longer than half an hour. I used an all purpose gluten free flour (celiac disease), mama's blend the first time and pillsbury the second. I add 1.5 cups to the sweet potato mix and see how sticky it is. The first time I made it with extra big sweet potatoes apparently, because it took about 2.5 cups to get it workable. The second time it took 1.5 cups mixed in to get it sticky but workable. I tried rolling the dough, but it was much faster and easier when I squeezed it out of a bag with the corner cut off onto a floured surface. You can make them pretty by pressing a fork into them, but I don't normally bother. I like to boil them til they float, then sautee them in sage butter right before serving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daphneryan"
},
"reviewBody": "Really tasty! I subbed sweet potato for butternut squash and pureed it with some water instead of mashing it. Then I served it with feta alfredo sauce. At first I was a little befuddled but I quickly got the hang of making the gnocchi. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sarahb"
},
"reviewBody": "This was my first attempt at making gnocchi. Thanks so much for a delicious and easy to follow recipe! I used some of the reviewers tips by microwaving potatoes and only using 1 1/2 cups of flour. Sautéed with shallots and brown butter. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca G"
},
"reviewBody": "These were wonderful! They were so easy and once the sweet potatoes were cooked, were a snap to assemble and cook. Omitted nutmeg and garlic, still were tasty. May add in next time. Served with Pork Tenderloin with Mushroom Ragout and they were scarfed by my two sweet potato hating family members (along with a request to make again). Liked the idea of serving with a little sage brown butter next time!!\n\nSecond time: Added 3 cloves of garlic shredded on a microplane. Added 4 T browned butter with 1 T dried sage, juice of 1/2 lemon and topped with shredded parm cheese. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay H"
},
"reviewBody": "This is a family favorite, and is divine when cooked, fished out into a bowl to drain, then sauteed in crispy sage brown butter. I make a double or triple batch, starting with about 2/3 of the flour recommended, add nutmeg, ginger, and cinnamon, and fridge the dough for a day or so (it'll be play dough texture on top and wetter inside). Cover tightly in plastic wrap; otherwise, the air exposure turns the dough from bright orange to brown. It makes for pretty marbled gnocchi with the two colors, though. I flour the top of a big blob, then flour the bottom, and roll into snakes on a floured baking mat. Roll to about a finger thickness and use a paring knife to cut small pillows about 1/2 x 1\". You really do want small; I've made them way bigger and they just turn into enormous dumplings. Freeze half on parchment paper (not touching much), then dump into a freezer bag when frozen solid. Boil from frozen (it will take a few mins longer, but thawing will result in mushing together)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joderita"
},
"reviewBody": "These were super tasty, but also super messy and time-consuming. It definitely took longer than 35 minutes for me, and it got really frustrating trying to get the dough into small enough balls to cook. HOWEVER if you're willing to get a little messy and spend some time to get it right, they are super tasty! To those who have never had gnocchi, it's supposed to be similar to a dumpling. If it comes out too rubbery for your liking (I personally like them a little more cooked than most chefs make it), try boiling them for less time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BezzyJ"
},
"reviewBody": "Pretty simple and yummy. I microwaved my potatoes for about 10 minutes ahead of time and mashed them with the garlic, salt and pepper (I didn't have nutmeg). About a half hour before dinner I gradually added the flour - I used about 1.5 cups and generously added flour to the rolling board. I used my floured hands to roll them into 'snakes' and cut into small pieces. I would cut about 20 pieces at a time - throw them into boiling water - cut up some more and then transfer the cooked gnocchi to a pot with my warmed Alfredo sauce. It didn't seem to take too long. I find gnocchi to be fairly bland already and I thought the sweet potato version was tastier! Would be tempted to add some bacon to the sauce next time...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colinb"
},
"reviewBody": "My suggestion is to keep the dough a bit on the thin side by using less flour and more egg. Then, put it into a pastry tube with a large star tip and squeeze it out while cutting gnocchis off with scissors. Let the gnocchi fall directly into the boiling water. This cuts the time needed in half and is much less fussy. You may find it takes two people to do this, but it is well worth it.\n\nDelicious flavor; add more salt as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMBUCKLES"
},
"reviewBody": "Very good basic recipe but, as with everything, tweak to taste. You will need to adjust flour to amount of sweet potato you use. You want the mixture to be sticky. If it sticks to your fingers but you can roll it off, it is done. I added brown sugar, cinnamon and a dash of maple syrup to mine. Was great but I may add some ricotta for a bit more creaminess next time. I took another reviewer's advice and put it in a Ziploc bag with a corner snipped off. I pushed it through the bag and used kitchen sheers to snip into a boiling pot of salted water. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin:D"
},
"reviewBody": "Rather than rolling the dough. I piped it in long rows on wax paper with my accent decorator gun, froze it &amp; then cut them into small pastas. I also added a pinch of cinnamon &amp; orange zest. Plan to serve with vanilla bean cognac sauce &amp; lobster."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "shimmy"
},
"reviewBody": "Super interesting...love sweet potatoes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Beth Wray"
},
"reviewBody": "I only gave this 2 stars just because it was the first time that I tried this and it didn't turn out at all. The potatoes that I thought were sweet potatoes ended up being purple potatoes and I think thats part of the reason it didn't turn out. They were really soft and not at all like the gnocchi that my boss had made. Sad it didn't turn out but I know that if I keep working at it these they would be amazing. Great idea..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "Two tips to make this a 30-minute meal instead of 2-3 hours as one reviewer said.\n\n1. Use precooked sweet potato or butternut squash (in the frozen section of your supermarket).\n\n2. Make the dough a squeezable rather than rollable consistency and put it in a pastry bag or ziploc bag (as another reviewer suggested). Squeeze the dough a little at a time and cut with kitchen shears right into your pot of boiling water. \n\nYou'll have to pause and scoop out the floaters as they finish cooking, but this method is much faster than hand rolling the dumplings. And, in my opinion, the amount of flour you have to use to make the gnocchi rolling consistency completely ruins the texture and flavor of the gnocchi.\n\nMine came out tender and delicate not gummy and doughy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "I don't particularly like regular, white potato gnocchi, but this is to die for! The best part is that it can be frozen-- I make all the \"snakes\" and cut into individual pieces, but I don't cook them. It is so handy to just have on hand. If you're going to cook some sweet potatoes, cook a few extra so that you can make a batch. I serve it with ribbon-sliced sage butter. I grow sage right outside the kitchen door, so it's really handy! I have my sweet potatoes cooking right now; I think I'll make a double batch today. Such comfort food! This with a green salad--Heaven. I prefer a dressing with a little bite, like Roquefort, when paired with the gnocchi."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Netsy3"
},
"reviewBody": "easy to make and delicious. I made a light cream sauce to serve with this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kalynn Sinnamon"
},
"reviewBody": "the texture is much chewier than regular gnocchi.. ill stick to the regular pillows next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "AmyJo"
},
"reviewBody": "These were pretty ok. Easy to make. Served them with a bleu cheese sauce. Needed something though. Can't put my finger on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Holly Arnold"
},
"reviewBody": "They are 'okay' I found them very bland. I don't see myself making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanaya Thomas"
},
"reviewBody": "very good. I cooked them and drizzled oil oil with a sprinkle of salt and sugar on top. My kids all loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "Easy to make, delicious to eat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "starburstORsupernova"
},
"reviewBody": "Word of caution with this one, don't use pumpkin as a substitute for the sweet potato. Unless it's from a can I suppose, but I tried this one with the original recipe and they were awesome. Then I had a small pie pumpkin that was getting old so I baked it up and tried to use it..... not the same."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "margisouth"
},
"reviewBody": "Like some other contributors, I added a sprinkle of cinnamon and some brown sugar to the sweet potato. I also baked the potatoes for much longer, close to 50 minutes. I was nervous that the garlic wouldn't cook fast enough and would taste raw but I chopped it very small and it added a nice bit of flavor. I still wish they were a bit more flavorful and will try to find something else to add to the dough itself. I served with some pre-made alfredo sauce from Trader Joe's and cracked fresh pepper on top. A salad of baby spinach/mandarin orange made a nice accompaniment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NAVYPINSTRIPES"
},
"reviewBody": "i doubled the recipe but needed a bit more flour to get it to stick. also added cinnamon and a little brown sugar for added flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "Tasted more like flour than sweet potato"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "loskeets"
},
"reviewBody": "Bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sbautsch"
},
"reviewBody": "Was pretty interesting and good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keri"
},
"reviewBody": "More flour = easier to roll. This is great with a pesto sauce!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "taudet"
},
"reviewBody": "Delicious!! I added just a little cinnamon and it was wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Horselvrtina"
},
"reviewBody": "Fantastic, time consuming, but very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sunflowerluver1277"
},
"reviewBody": "I followed this recipe to a T and did not care for it. I am sure it is too much flour. If I were to attempt this recipe again, I would skip the garlic and reduce the flour by 1/2 a cup (or more)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lawyer_Cook"
},
"reviewBody": "These gnocchi are great! \n\nI saw that some reviewers commented that they were looking for a good sauce. This balsamic reduction is AMAZING! You will not regret trying it! \n\nhttp://www.howsweeteats.com/2011/01/06/easy-dinner-idea-balsamic-gnocchi/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+howsweeteats%2FsmSp+%28How+Sweet+It+Is%29"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mouseketeer"
},
"reviewBody": "Very tasty! We all liked them a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kidcallous"
},
"reviewBody": "Ohhh boy. These are alot of work, but they are extremely tasty, especially with a little butter and salt. This recipe is very time consuming, and for me at least - took longer than the prep time listed here - about an hour to get the dough ready, and then roll and cut all the bits of dough. With that being said, they are worth all the hard work and elbow grease. (I upped the garlic to 3 cloves , because I love garlic) They were VERY VERY yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Clara"
},
"reviewBody": "These were a little too sweet for my taste and a little gummy too. The texture might have been my fault, but the flavor was just not there."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NikkiC"
},
"reviewBody": "While it takes time, this was an easy enough recipe to put together. I used about 1 1/2 cups of flour (including the flour to roll out the dough) and it came out well though it was kind of a messy process. Next time, I will use the top reviewer's tip of putting the dough in a bag and squeezing it out. I served this with Giada DeLaurentis' sage brown butter sauce which you can find on the Food Network website or another version on this site too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca Reece"
},
"reviewBody": "This was delicious and just fun to make. Tossed it with a nice sage-butter sauce and fresh Parmesan. Goes great with roast chicken."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Nakoski"
},
"reviewBody": "To shorten the prep time for this, I microwave the sweet potatoes in a \"potato bag\" for 5-10 minutes (instead of the 30-50 minutes you need for baking). They come out just as soft and pliable as baking but it cuts the time almost in half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cake_lady"
},
"reviewBody": "Came out great. I saw someone wanted a recommendation for a good sauce so here you go. I used a cream sauce that also works great with butternut squash raviolis. 1 jar of Bertolli alfredo sauce, 1 TBSP brown sugar and 1 TSP of maple syrup, dash of salt &amp; pepper. The sauce is sweet , but you can alter the sugar/syrup to your own taste. I also sprinkle with toasted walnuts or pecans for a garnish. Might also be good with just a butter, brown sugar and sage sauce too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jog Dish"
},
"reviewBody": "Too much nutmeg, it's overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "wavingmadly"
},
"reviewBody": "Way too much nutmeg for my liking. It was a lot of effort for 'meh' results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LoudaZ"
},
"reviewBody": "This recipe was Super Easy! I used leftover sweet potato and it made the recipe a piece of cake. I can't wait to try them with a sage butter sauce. I'm wondering if they'll taste too garlicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "onfiya"
},
"reviewBody": "Loved it - even without the egg!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "These were delicious and made for a filling dinner with a restaurant-y feel! I used a lot less flour than the recipe called for (a little over 1 cup), which is why I can't give the full 5 stars. This is a recipe worth trying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NICOLE518"
},
"reviewBody": "Gluten free option: 1 cup white rice flour, 3/4 cup potato starch, 1/4 cup corn starch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bette"
},
"reviewBody": "Yum! My whole family will be enjoying this gnocci all year. From pulling the already cooked potatoes out of the freezer, to putting the dishes in the dishwasher, I was in the kitchen about 2 hours. I thought the recipe was perfect, and didn't feel the need to change a thing, though I didn't actually measure how much flour I put in. Like other reviewers have said, the dough has to be obnoxiously sticky. I roll mine into logs, keeping the outside coated with lots of flour. I had enough potatoes to make 4 batches of the recipe, so I froze my well-floured dumplings individually on cookie sheets, then moved them into a baggie. Now they're ready to boil whenever we get the craving for gnocci. My favorite preperation is to saute some garlic and sage in butter, then add the boiled gnocci just long enough to get a little crisp on the outside. Mmmmm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kimko"
},
"reviewBody": "The sweet potatoes took a super long time to bake in the oven...much longer than the recipe said. It was a pretty sticky dough but don't add too much flour and make your gnocchi tasteless either. I think mine turned out pretty good. I served them with a simple brown butter and they were really filling. My husband and I both had two servings from this batch and I probably have another 3 servings I put into the freezer for another day. It was a little bit bland, though, I'm not sure what else you could add to it to make it more exciting but it was a nice comfort food on next to no money."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "janelly_welly"
},
"reviewBody": "This gnocchi is worth the work, but it is REALLY important to use a ricer or SLIGHTLY MASH with two fork very gently and spread it out in a thin layer to cool to room temperature. You have to be super gentle while mixing in the flour as well. The technique (and it really IS a technique) can be seen in videos online and is important to follow so as to get light, soft gnocchi instead of dense little blobs. Another important point - don't add too much flour (again, it will become dense) and let the \"dough\" rest for 5 minutes before rolling/shaping. I strongly urge anyone to check out some videos first to make your gnocchi experience a pleasurable one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kkathleenm"
},
"reviewBody": "The gnocchi turned out great!! I followed the recipe as written and my husband and I enjoyed it very much. The sauce I made was an improvised brown butter with sage with crumbled up bacon. Once the butter is brown and sage is fried, I tossed in the gnocchi and cooked bacon and cooked until it was warmed through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BLyn"
},
"reviewBody": "Very, very good. I used pumpkin instead of sweet potato because my 9 month old has a sweet potato intolerance. His stomach just won't keep them down. I can only imagine what it is like with sweet potato. I used a decorators tip and disposable pastry bag, which made clean up very easy and the execution of this recipe much neater. I served this with alfredo sauce and oven baked italian chicken. We will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Leisl Lundy Larson"
},
"reviewBody": "I made this last night and we thought it was great! Because it was already 9 pm and it was on an impulse I didn't want to have to wait for the potatos to cook so I just sent my husband to the store for canned sweet potatos. They are in a light syrup so I just rinsed them off with cold water and they worked fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esmeq"
},
"reviewBody": "I left out the egg... It was a lot sticker than i thought it was going to be but I managed and it is pretty tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Bentley"
},
"reviewBody": "Absolutely delicious! The flour ratio is wrong though. In order to form the \"potato dough\" you will need a bunch of flour. Once cooked freezes well for a fast meal (just thaw in a pot of boiling water)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ssh"
},
"reviewBody": "excellent nutrious meal. i used a holladaise sauce and it was great. did 3 cloves of garlic as well. will do alot of this cause it is easy and yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2Cook"
},
"reviewBody": "These were fabulous. I prepared them a few hours in advance and placed them on a sheet of wax paper/cookie sheet in the fridge. They were fine and maybe the cooling firmed them up a bit and made for a nicer and even cooking. Once removed from the water I put them right into a pan with shallots, parsley and butter...YUMMO"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "strayredbolt"
},
"reviewBody": "I used the bag method. It worked great, but i had to add a lot of extra flour. I served it with a cream sauce but i think that butter and cinnamon would have been better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chitownamateur"
},
"reviewBody": "This took 1h30 min start to finish, and I baked the potatoes in the microwave. The tip about \"soft dough\" was dead on, and I also took the other advice on here and added cinnamon and brown sugar (just a touch of the former and 1 1/2 tsp of the latter). I only used probably 1 1/2 cups of the flour for the recipe itself, and another 1/4 for the rolling of the dough. Once the gnocchi were all boiled, I stir-fried them with olive oil and 3 more chopped garlic cloves and served it topped with fresh basil and grated parmesan. Next time I make this, I'll use my plastic cutting board; the gnocchi ended up tasting a little like the wood from the one I used. Anyone know how to find the tofu cream sauce recipe someone else mentioned? Couldn't find it and it sounds yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "capelilly"
},
"reviewBody": "Loved this dish! very easy to make, I didn't make any changes to the recipe. I served this tossed in mint pesto, and it was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mocha'n'me"
},
"reviewBody": "This was a lot easier than I figured. I used cinnamon since I didn't have any nutmeg. I didn't measure the flour, just kept adding until right consistency. Very yummy, and will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "I'm not a great cook...and have never made gnocchi before, but this turned out okay. The recipe is good, the only things I'll change in the future have to do with my cooking style. For example, you might want to make the individual gnocchi's smaller rather than bigger to help with cooking, and make sure you use flour when rolling it out...pretty sticky, but the end product is worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayeli"
},
"reviewBody": "I made this with pureed butternut squash because I had it left over and finely ground white spring wheat flour. I put the dough into a plastic kitchen storage bag, twisting the top to extrude through the cut off corner. I used a sharp kitchen scissors (love my Joyce Chens) to cut right into the boiling water. That was easy and mess free. These were very good and light in texture, but will make again with sweet potatoes to compare the flavors."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/56311/sweet-potato-gnocchi/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/56311/sweet-potato-gnocchi/",
"name": "Sweet Potato Gnocchi"
}
}
]
}
}
, "about": [
]
}
]