				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet Potato, Carrot, Apple, and Red Lentil Soup"
,"datePublished": "2020-03-09T22:51:29.000-04:00"
,"dateModified": "2022-10-17T17:34:41.000-04:00"
,"author": [
{"@type": "Person"
,"name": "zhidaoma"
,"url": "https://www.allrecipes.com/cook/3182426"
}
]
,"description": "Sweet potatoes, carrots, and apples are pureed with red lentils and seasoned with ginger, cumin, and chili powder for this warm and flavorful winter soup."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4YEa-HgEUINhpEXhQ63ApdHmHg0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-597-6227c2370f994dabb2701afe0435eee0.jpg",
"height": 720,
"width": 1280
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6129802135001",
"description": "This bright soup has all the vegetables you love!",
"duration": "PT1M",
"name": "Sweet Potato, Carrot, Apple, and Red Lentil Soup",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/e665ff6a-da72-4b54-b142-af08980b1478/c4f73619-62b1-49c8-b00b-576e7b02520e/1280x720/match/image.jpg",
"uploadDate": "2020-12-18T11:34:09.481-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Potato, Carrot, Apple, and Red Lentil Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "1206"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "322 kcal"
,"carbohydrateContent": "53 g"
,"cholesterolContent": "22 mg"
,"fiberContent": "10 g"
,"proteinContent": "9 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "876 mg"
,"sugarContent": "15 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.25 cup butter",
"2 large sweet potatoes, peeled and chopped",
"3 large carrots, peeled and chopped",
"1 apple, peeled, cored and chopped",
"1 onion, chopped",
"0.5 cup red lentils",
"0.5 teaspoon minced fresh ginger",
"0.5 teaspoon ground black pepper",
"1 teaspoon salt",
"0.5 teaspoon ground cumin",
"0.5 teaspoon chili powder",
"0.5 teaspoon paprika",
"4 cups vegetable broth",
"plain yogurt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Melt the butter in a large, heavy bottomed pot over medium-high heat. Place the chopped sweet potatoes, carrots, apple, and onion in the pot. Stir and cook the apples and vegetables until the onions are translucent, about 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir the lentils, ginger, ground black pepper, salt, cumin, chili powder, paprika, and vegetable broth into the pot with the apple and vegetable mixture. Bring the soup to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the lentils and vegetables are soft, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Working in batches, pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4YEa-HgEUINhpEXhQ63ApdHmHg0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-597-6227c2370f994dabb2701afe0435eee0.jpg"
}
]
,"text": "Return the pureed soup to the cooking pot. Bring back to a simmer over medium-high heat, about 10 minutes. Add water as needed to thin the soup to your preferred consistency. Serve with yogurt for garnish."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious soup!! I made a few changes: cut the butter, using small amount of olive oil; doubled the amount of red lentils; increased the cumin to 1 tsp., because I like the taste; reduced the salt and added more low salt chicken broth. I did not puree the soup as we like the chunky texture. Even my husband enjoys the soup, and it freezes very well for a quick, nutritious lunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ateam47"
},
"reviewBody": "I made this for dinner the other night and it was delicious! I didn't have cumin, so substituted lemon pepper. It's a wonderful hearty soup and will definitely make again. My husband loves, vegetables, and was thrilled that he got his fix. Paired it with a nice green salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MamaMia"
},
"reviewBody": "Really good and filling. Made as written except I used regular lentils as I could not find red and used chicken broth. Can see adding some cooked chicken apple sausage or other cooked sausage to this to add more protein, if desired."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Used chicken broth"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Was absolutely a WINNER!!!! Instead of butter, I op for 2 tbs of coconut oil. Also add 1C of red lentil instead of 1/2 and a 1/8 tsp of turmeric. Will definitely used this recipe again. Husband and guests singing praises to the perfect thickness of the soup as well as the flavour. Many thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aharman69"
},
"reviewBody": "Excellent flavor! I left it as a stew and it was excellent, but I may try it pureed next time. I did add some Kale about 10 minutes before it was finished. I did not have any plain yogurt and I did not feel like it was needed. I couldn't find red lentils, so I used regular, and it worked great. I might add more lentils next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michele"
},
"reviewBody": "Soup is very tasty! Love it ❤️"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beachbum12b"
},
"reviewBody": "Love this soup. Used olive oil instead of butter. Other than that made as written. Delicious and freezes pretty well. (Needs a good stir after freezing as the consistency changes a bit.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Bamford"
},
"reviewBody": "I was delighted with the results and was happy to share the recipy with my daughter in law."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina E."
},
"reviewBody": "It was delicious — the recipe is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybug2021"
},
"reviewBody": "I prepared this soup today and couldn’t believe how creamy it was, considering there is no cream in the recipe. It’s great to enjoy all of these veggies as comfort food. Requires purée w blender but we’ll worth it! Thank you for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jennyk"
},
"reviewBody": "This was excellent! I made as written except that I used chicken broth and I blended half of the soup and left half chunky. It was perfect that way! My picky husband even liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foodsprite"
},
"reviewBody": "I did not have fresh ginger on hand so I used 1/4 tsp dry powdered ginger instead. I also cut the salt in half, which I do with most recipes. Otherwise I followed the recipe and it was delicious. My kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Miller Smiley"
},
"reviewBody": "I really wasn't sure what to expect, but it was very good. Definitely don't skip the yogurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ada Scott"
},
"reviewBody": "It is pretty thick but very tasty and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "Terrific recipe for vegetarians. I substituted olive oil for butter because I wasn’t sure if my friend was vegan or vegetarian. Absolutely delicious and so very easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Hines"
},
"reviewBody": "All the adults that ate it loved this soup. Sadly my children don't like sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CAcooking"
},
"reviewBody": "This is outstanding. Hearty, thick and delicious. Made it exactly as indicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Pointon"
},
"reviewBody": "Its the most popular soup I have made will make it many times"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Carrol22000"
},
"reviewBody": "Definitely not worth the effort. Made according to the recipe it tastes like I would guess soggy cardboard tastes. Not wanting to waste the nutrition I was forced to make improvements. I added curry powder, toasted fennel seeds, honey, and biryani curry paste by Patak’s. Now it’s pretty tasty; nothing like the original recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "supersusan"
},
"reviewBody": "Very tasty. I used instant pot as I am trying to use it more. Used a little oil instead of butter and then mostly water sauté of vegetables in sauté mode then pressure cooked on “soup/broth” mode low, which was about 6 minutes and since I was going out for a walk, I set it to slow cooker mode after that. Finished with my immersion blender and done. No yogurt needed. Followed directions for content and very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "Loved how such basic ingredients could make such a delicious soup. I used actual sweet potatoes, rather than yams, so mine came out light colored and quite sweet, and using plain yogurt on top balanced that out nicely. A nice addition to my meatless menu for Fridays during Lent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Illona Santillan"
},
"reviewBody": "Never had soup like this and was really great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BKLYNCOWGIRL"
},
"reviewBody": "I loved this soup! I must admit that I made a few minor changes. One was a senior moment when I grabbed the curry powder instead of the chili. I'm sure that it is good with chili, but let me tell you, the curry really enhanced the flavor of with rest of the ingredients. The second change was opting for butternut squash to supplement 1 lonely little sweet potato. I wasn't going out to the store for another. Again, a win as far as flavor. Lastly, as a preference, I used a potato masher to crush some of the vegetables. I like chunky soup and the partially mashed ingredients still gave it a creamy texture. A fabulous soup for a cold, winter's day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frosty Cat"
},
"reviewBody": "I followed the advice of others and did not puree. This soup is wonderful. It's definitely in the favorites list."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oliviaC"
},
"reviewBody": "I absolutely love this soup! I have made it again and again because I keep craving it. It is savory and a little sweet with a great spice to it. I typically add a bit of olive oil in the beginning instead of butter. I have also used some dehydrated onion flakes instead of onion and I double the dry ginger instead of using fresh. Perfect for a fall or winter day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riki"
},
"reviewBody": "The combination of spices gives it a really wonderful taste. Black lentils work well with this too, but will give the whole dish an unappetizing color (lesson learned). \nThis will definitely go in my make-again-and-again-recipe book, but I will change the name to something shorter, lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "olgaskitchen"
},
"reviewBody": "This is delicious! I skipped the yogurt but otherwise followed the recipe exactly and it was quick, flavourful and filling. Next time I might add garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama Babs"
},
"reviewBody": "This was a hearty, tasty soup that was perfect for a cold winter night. We were out of lentils so I subbed 1/2 c. quinoa. Also did not have fresh ginger, so I used crystalized ginger... worked great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "This is easy and delicious. I made it exactly as directed except that I omitted 1/2 teaspoon salt because I used Vegetable Better Than Bouillon that already contains salt. I knew I could always add more salt later but I did not need to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Simbari"
},
"reviewBody": "This is fabulous. I should have taken a photo before it was gone.\n\nI am adding tips because an advertisement covered this part . So - puree in batches (I have a vitamix but I am certain a high speed blender is fine). Make sure each batch is smooth is smooth. Pour each batch into a large clean pot and simmer over medium heat. Add water, as needed.\n\nThis is worth all the peeling and chopping; enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "D'Anne Avotins"
},
"reviewBody": "Outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookie"
},
"reviewBody": "Awesome dish!! I tweaked it by adding turmeric instead of ginger and used a masher instead of blender so it was still chunkyish.(Is that a word? lol) Also put a dollop of sour cream instead of yogurt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Murray"
},
"reviewBody": "WOW!! I made this for my family and it was an absolute hit! I added a little less than a 1/2 teaspoon of curry powder and I really think it added a lot. \n\nSome folks topped it with a little sour cream and others with a splash of heavy cream. We ate it with some homemade artisan bread.\n\nEverything was absolutely divine! I will definitely be making this again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "normal"
},
"reviewBody": "This is a good comfort food soup. I do agree it has more flavor several hours after cooking. I was not impressed with the flavor right after it was finished. Several hours later, I had some and then some MORE. I did add 12 oz. mild sausage to make it more hearty and have more protein. I will save this recipe to use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TRACYRE"
},
"reviewBody": "Oh my, I LOVE LOVE LOVE this recipe! I've made it 100 times and it is so nourishing and hearty. With some toast points it's a great little meal. It's obviously perfect in the fall but I make it all year long, and usually end up freezing half of it for another meal. \n\nI cut the butter in half and then add a little chix stock when I cook the veggies. It's fun to play with the spices a bit too...In addition to the recipe, today I made it with a touch of Chinese 5 star, Garam Masala, Cinnamon, allspice, cloves, smoked paprika as well. I put in a ton of ginger - maybe 2 Tbsp. A big minced clove of garlic is also added. All in all it just rounds out the flavor. \n\nOn top I'll put some fresh chives or maybe a little parsley with the fat free greek yogurt. This recipe is literally in the top 3 of all recipes I make. Nothing like a thick soup in the fall and winter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dianne Dalich"
},
"reviewBody": "Easy to prepare with ingredients I always have on hand. The whole family loved it. I thought I made enough to have some left to freeze for the future but it all got eaten in one sitting. Made me very happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MUNCHIE66"
},
"reviewBody": "Delicious flavour will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wednesday"
},
"reviewBody": "This was delicious! I feared the cumin and paprika would give it a Southwest or Tex-Mex flavoring so I used most of reviewer grampnana's modifications. I kept the butter, used 3/4 cup yellow lentils for a smoother texture, 1/4 tsp powdered ginger and 1 tsp curry. I omitted the cumin, salt and chili powder. I added water and chicken bouillon. I didn’t have 1 1/2 cup coconut milk as suggested and it turned out so good. Next time I’ll add the coconut milk. I used an immersion blender to purée. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Foody"
},
"reviewBody": "Very nice, and comforting soup on a cold, wet autumn evening. Mild tasting with a hint of heat. Very easy and quick to make in my Instant Pot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rplummer"
},
"reviewBody": "I'm psychologically allergic to yogurt and sour cream, so I left them out and used 1/4 the recommended salt. Nevertheless, it came out as a 10..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "inthekitchen"
},
"reviewBody": "I reduced the cooking time because we were too hungry. I just made sure that the lentils were soft. It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joyce"
},
"reviewBody": "This soup is perfection! My new favorite lentil soup. Followed the recipe exactly and the balance of flavors is amazing. Will definitely make again and again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "This recipe is delicious.\nI used coconut oil instead of butter, cut the salt in half, and left out the yogurt on top. Like others I didn't puree it, but left it like stew. \nMy husband also really enjoyed it. He's not much for adventurous recipes, but this is a keeper for both of us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gennifer Birnbach"
},
"reviewBody": "YUMmm! I made this exactly as directed and it's delicious. I wouldn't change a thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "Turned out awesome, made exactly as described?. Super easy to make, outrageously healthy! Yum! A new recipe in my itinerary, thank you! For sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorna "
},
"reviewBody": "I loved it. But I did add some more vegetable stock after blending as it was thicker than I like. But delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bellemichelle27"
},
"reviewBody": "I’ve made this recipe before and loved it, but it does take a long time. Today I tried it in my instant pot, and am very happy with the results. There’s a lot of chopping, so I started the onions and butter on sauté mode while I chopped the rest of the ingredients and added them to the pot, stirring occasionally. Deglazed with the broth and added lentils last. I pressure cooked for five minutes. It was actually too long, and next time I will do three minutes. I will also try coconut oil instead of butter because I think it would add to the flavor. Didn’t bother to purée. Super happy with how fast it was!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chancy W"
},
"reviewBody": "I've been making variations of this recipe for years! It makes an excellent soup. Sometimes I will add different squash instead of the sweet potatoes when my garden is producing a lot. \nGive this recipe a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa Rice"
},
"reviewBody": "Excellent recipe! I didn’t bother to puree it, I didn’t mind the chunks of veggies. The ginger really adds something special. This will become a part of my regular rotation of soups."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "This is such a terrific recipe. I love the added sweetness of the apple in it. I followed it as written but o did not purée all of it since I like some chunks in my soup. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Serio"
},
"reviewBody": "my family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "addielleyes"
},
"reviewBody": "This turned out tasty. However I did make adjustments. Olive oil instead of butter. And way more of all the dry spices. I didn't measure, I just dumped a bunch in. 1/2 teaspoon is not nearly enough.\n\nOne thing that's nice is that it uses all ingredients that last a long time in the pantry or fridge. So it's something I can make with vegetables even though I haven't gone grocery shopping in 2 weeks. Great during this pandemic when I'm trying to minimize trips to the grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Trish-"
},
"reviewBody": "Carrots, apples &amp; sweet potatoes all in the same soup made it much too sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Pfaff"
},
"reviewBody": "This was a very flavorful soup. So easy to make too (especially if you have a food chopper)! I agree with the reviewer who mentioned that one thing that makes this recipe great is that the average person has these ingredients on hand. This is in fact how I found the recipe, through an ingredient search of what I had available. I'll definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruthann Pike"
},
"reviewBody": "It’s a keeper. If you like puréed soups, like me, definitely consider an immersion blender. Life is much easier with one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "I am not a huge sweet potato fan, I have to admit, but made this soup for my son who loves sweet potatoes. This recipe is fantastic as written and will be added to my recipe box. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Victoria"
},
"reviewBody": "This soup was very flavorful. I took the suggestion of another reviewer and used coconut oil instead of butter. I also kept in stew form instead of blending it smmoth. The pepper was a little too much for my personal taste since I don’t like anything remotely spicy so I will probably reduce that spice next time. I am also going to try adding a few more lentils next time. Highly recommend this soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CHERYLASTRA"
},
"reviewBody": "I replaced some of the vegetable broth with 14 oz coconut milk, traded the butter for olive oil, and puréed it all with an immersion blender. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kim Arnold"
},
"reviewBody": "The recipe is mainly fine. Can be adapted somewhat to what you have on hand. But you know what happens when you put the pureed soup back on the stove to simmer? It explodes all over your kitchen. A note about that would have been...nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AdinaMarie"
},
"reviewBody": "This recipe is sooo awesome. I made it exactly as the recipe is described. I put 2 apples in as I had 2 apples that were overripe and had to use them. I added 4 cups of fresh spinach at the end to add great color and added nutrients as suggested by another reviewer. The added apple made the soup a little sweeter but I dont mind and my husband loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEileen Foster"
},
"reviewBody": "I will definitely make this soup again. We loved the flavours and the texture of this soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hungry Dreamer"
},
"reviewBody": "Delicious! We had this soup for dinner tonight. I let the soup rest for a couple of hours in the Dutch Oven before serving it. My son ate all of the yogurt before I could garnish the soup, so I used a few sprigs of coriander instead. We had some naan bread on the side. Very satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy S."
},
"reviewBody": "This soup was delicious! It is sweet due to the sweet potatoes and carrots with a very small hint of spice. I didn't have sour cream, so I left it out. I only had green lentils on hand, so I used those. I normally don't like changing recipes, but due to the pandemic, I used what I already had at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose Burch"
},
"reviewBody": "Wonderful soup! A cup of 1/2&amp;1/2 or cream makes it a delectable bisque. Not too spicy. To be savored."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EWalsh"
},
"reviewBody": "I didn't have any lentils so added 1 package on Madras Lentils and one can of butter beans. Also, added one yukon gold potato (peeled &amp; diced) to thicken. Thinned at end when needed using canned chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janice"
},
"reviewBody": "This soup is excellent. I followed the recipe exactly and may only consider one change when I make it again....that is, it wouldn't hurt to increase the amount of lentils a bit. Love the fact that it is all done in one pot start to finish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elena6324"
},
"reviewBody": "I used 1 cup red lentils, added chopped garlic, sprinkled nutmeg and pumpkin seeds on top. Absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenellen"
},
"reviewBody": "I have been making this soup for about seven years now and it’s always a winner! Everyone loves it. The only thing I do differently is I roast the sweet potatoes while, in their skins in the oven for a good hour before I make the soup. I also sometimes roast the sweet potatoes the night before and scoop them out and add them the next day. It adds a layer of depth to the flavor. Even my picky kids gobble up this soup. I triple the recipe and freeze a batch every time. It’s hearty and nutritious too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "My husband and I really enjoyed this. I did add garlic and deglazed with white wine. I used smoked paprika as well. The next time I make this I won’t simmer quite as long but the soup is definitely worth making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SarahMc"
},
"reviewBody": "I liked it...can’t say the same for my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anabel"
},
"reviewBody": "Very good when you’re in need of a change. I don’t eat spicy so I skipped the chili and I substituted the yogurt for sour cream and since it only goes on the plate, it’s optional (my family likes that)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vic"
},
"reviewBody": "great soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Dybalski"
},
"reviewBody": "Definitely will make again. The texture -thick and smooth and flavors are delectable! Great on a cold night. The only thing I did different was roasted all the veggies instead of sautéed. The job looked overwhelming to sauté. My husband who is not fond of soup really liked this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sktracey"
},
"reviewBody": "Great recipe, very filling and flavorful and a nice comfort food for these challenging times. I used all ingredients as listed but didn't puree. Next time I will use olive oil instead of butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "topangamama"
},
"reviewBody": "I used smoked paprika which gave this a lovely flavor. It was creamy without cream, and slightly sweet from the apple and carrots."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momcat"
},
"reviewBody": "No changes. Would make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cathy Groat"
},
"reviewBody": "Turned out good, however I think I used too large of sweet potatoes so I had to thin it and it lost some of it’s wonderful flavor. Will make it again though and adjust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ecastle Vania"
},
"reviewBody": "It doubles really well and freezes beautifully!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valeeta Howard-Washington"
},
"reviewBody": "I LOVE THIS SOUP. I USED CRUSHED RED PEPPER SEED IN PLACE OF CHILLI POWDER. SO GOOD AND I WILL MAKE IT AGAIN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlimon"
},
"reviewBody": "I cheated and used ground ginger. Plus, since my apples were small, I used two. Finally, because everything goes nicely with a tasty IPA, I reduced my veggie broth and added some of that. Can’t wait to try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blue"
},
"reviewBody": "We did not add the chilli powder and put in half the cumin and paprika since we don’t like a lot of spice. It was just perfect for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonnie"
},
"reviewBody": "This soup is really fantastic; one of my favorites. It's the spices/seasonings that really make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Richard"
},
"reviewBody": "Really a good soup! And except for peeling and chopping the sweet potatoes, it's easy as pie. I used small to medium sweet potatoes; I think if I had used two large Georgia sweet potatoes I'd be eating this for over a week. And I had chicken stock that needed to be used, so substituted that for the vegetable broth. Increased the paprika. Wish I had increased the ginger. This was excellent with homemade chicken salad on toasted whole wheat English muffins. And did I say how easy it was? Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lgoodman"
},
"reviewBody": "My husband said it was a smashing success. He isn't usually effusive, so I wanted to share that with you. I substituted more of the paprika for the chili powder, but otherwise made the recipe as written, but leaving it on the chunky side. We dabbed Greek yogurt on top and enjoyed the contrast of its cool creaminess with the hot soup. We ate it with a soft loaf of Italian bread to sop up the remnants from our bowls at the end, and savored every bit. I may need to double the batch the next time I make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love Sunshine"
},
"reviewBody": "Made ALMOST as directed. My partner and I made this together and had so much fun. I highly recommend this as a couples activity! As it turned out we only had a half of an onion, and although absolutely delicious we will use a whole sweet onion next time. I think a Vidalia onion would taste best. We used fresh garlic and fresh ginger. The fresh ingredients are key, however we both agreed that next time we will double the amount of herbs and spices. I suggest making it as directed, so that you can customize to your taste as some reviews report too much spice. AMAZING color, texture, nutrients, and taste. We used sour cream instead of yogurt. Yogurt, sour cream, or a creamy vegan alternative is recommended but not necessary. So good puréed! Not at all like a baby food. Elegant, gourmet, and heartier than expected. This can be served as a side dish, appetizer, or main course. As for servings: You know when you go to a restaurant and they ask if you would like a cup or a bowl of soup? This makes six bowls. I hope that helps. This is a dish that will impress in both fun and yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Terry Vere Matheson"
},
"reviewBody": "Great recipe, everyone loved it. Perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Ann"
},
"reviewBody": "My husband and I both really liked this soup when I made it a few days ago. Great flavor! It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mama"
},
"reviewBody": "I mistakenly put in a full cup of lentils, but other than that. I followed the recipe. It's really yummy - very thick and filling. There's a bit of a kick in the spices which I really liked. It's a great meal for a cold winter evening."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Meyer Neenan"
},
"reviewBody": "Sooooo easy to make ! Delicious ! Great for a cold day..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia Soroosh"
},
"reviewBody": "I made it as is and it was out of this world delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ghendsey"
},
"reviewBody": "very good soup. I did not puree it , used 8 cups of low salt chicken broth and 2 tsp of no salt chicken bouilion , omitted the salt . wanted it more like a soup and made it less spicy ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz Grossman"
},
"reviewBody": "So delicious after made but better next day....freezes great flat in zip lock bags"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Susan Fagan Hughes"
},
"reviewBody": "So good. Mashed about 1/2 of it. Excellent the next day too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aliog"
},
"reviewBody": "Delicious on a cold winter’s night. The yogurt really pulls this soup together. Easy to make and very nutritious. I had most of the ingredients on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "campingmom247"
},
"reviewBody": "I had just been to Whole Foods and had their Pumpkin Curry Soup. It was scrumptious! I found this recipe while looking to use my sweet potatoes. I only had one and I had an acorn squash so I used that as my second sweet potato. Instead of ground cumin, chili powder, and paprika I used curry. It turned out very good and I will make it again. Very close to WF's pumpkin soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Ann"
},
"reviewBody": "So YUMMY! A little bit SWEET with a RICH flavor. I used green lentils x 1 cup and added a cup of water and did NOT puree just for simplicity sake and it was perfect with plain Greek yogurt on top. The veggie chopping was a little time consuming but otherwise super SIMPLE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam"
},
"reviewBody": "Marvellous. I added some chicken as wanted to include the taste of meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sis"
},
"reviewBody": "Delicious; tastes healthy in a good way. Don’t believe the serving sizes, though, as you will eat more than you plan. Our six servings were more like four."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/186378/sweet-potato-carrot-apple-and-red-lentil-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17305/soups-stews-and-chili/soup/vegetable-soup/sweet-potato-soup/",
"name": "Sweet Potato Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/186378/sweet-potato-carrot-apple-and-red-lentil-soup/",
"name": "Sweet Potato, Carrot, Apple, and Red Lentil Soup"
}
}
]
}
}
, "about": [
]
}
]