				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Sweet Potato Pecan Pie"
,"datePublished": "1998-10-22T11:46:33.000-04:00"
,"dateModified": "2022-08-17T23:19:02.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Lorrie Sterling"
,"url": "https://www.allrecipes.com/cook/26842626"
}
]
,"description": "For this luscious pie&#39;s filling, sweet potatoes are mashed and combined with egg, sugar, salt, cinnamon, ginger, cloves and cream. Pecans are combined with brown sugar and butter to make a rich caramelized topping that&#39;s spooned onto the cooked pie before it&#39;s slipped under the broiler for a moment or two."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/p-PrZAGK9a2DeBv-mcxe4GRDEXk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/12446-sweet-potato-pecan-pie-DDMFS-4x3-1-d958bd4f7d474f50a51a4925d201afef.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Potato Pecan Pie"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "88"
}
,"cookTime": "PT90M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "519 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "91 mg"
,"fiberContent": "4 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "354 mg"
,"sugarContent": "40 g"
,"fatContent": "29 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 (9 inch) unbaked pie crust",
"2 cups cooked and mashed sweet potatoes",
"2 eggs",
"0.75 cup white sugar",
"0.5 teaspoon salt",
"1 teaspoon ground cinnamon",
"0.5 teaspoon ground ginger",
"0.25 teaspoon ground cloves",
"1.6666666269302 cups light cream",
"3 tablespoons butter, softened",
"0.66666668653488 cup packed brown sugar",
"0.66666668653488 cup chopped pecans" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake sweet potatoes until fork-tender, 40 to 50 minutes. Cool until easily handled."
} ,{
"@type": "HowToStep"
,"text": "Peel and mash sweet potatoes. Make sure all lumps are removed, straining if necessary."
} ,{
"@type": "HowToStep"
,"text": "Lightly beat eggs. Blend together eggs and sweet potatoes. Stir in sugar, salt, cinnamon, ginger, and cloves. Blend in cream. Pour into pie shell."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 45 to 55 minutes, or until knife inserted halfway between center and edge of pie comes out clean. Cool completely on a rack."
} ,{
"@type": "HowToStep"
,"text": "Make the caramelized pecan topping. Combine butter or margarine, brown sugar, and pecans. Gently drop by spoonfuls over cooled pie to cover top. Broil 5 inches below heat until mixture begins to bubble, about 3 minutes. Watch carefully, if cooked too long, top will turn syrupy. Cool on rack."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT110M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Wolf"
},
"reviewBody": "this recipe will make 2 - 9 inch pies, I've also made tarts with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We have a baby and I make baby food…. I had a lot of sweet potatoes, and my husband found this recipe. For the record He HATES SWEET POTATOES SOOOO First time making it It came out PERFECT IT IS SOOOOOO GOOD AND my husband LOVES IT !!!! Yes I had a couple substitutions with what I had I had on hand, but the recipe is spot on for a perfect pie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "evildcvma"
},
"reviewBody": "I used evaporated milk, came out great. Used more pecans than recipe . Topping is really good. When you eat this pie , you know you ate something, seems like this pie weighed 5lbs. Very rich and filling. I boiled my potatoes instead of baking, hardly any lumps at all, worked best for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyK"
},
"reviewBody": "So easy and so yummy. A friend said the filling was so smooth and creamy. Served it with fresh cinnamon whipped cream. Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Weber Haas"
},
"reviewBody": "I've made this for the past 10 Thanksgivings, or longer. Everyone loves it! Save flavor profile of pumpkin pie, but a much better in texture, imho! \nI use low-fat evaporated milk and don't put as much topping on as stated in order to save a few calories! Watch out that you don't burn the topping!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryellen Rose Marino"
},
"reviewBody": "Lovely and delicious.\nMy new thanksgiving pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hvandehoef100"
},
"reviewBody": "11/25/18: I made this for Thanksgiving in place of pumpkin pie. The pumpkin pie lovers thought that this tasted the same so that was a win. I made two pies with the filling in place of one (you'd need to use a big deep dish pan to get this in one pan). I would make this with 1.5X the spice next time. I decorated the top with pie crust in the shape of a turkey. I had to wait for the pie to set-up enough to hold the extra pie crust so the edges got a bit darker than I wanted. I would 100% make this again with extra spice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lg27"
},
"reviewBody": "I’ve made other recipes/versions of this dish and this is clearly superior. I used half and half instead of light cream and ready-made mashed sweet potatoes. Very easy to follow instructions. The only thing to keep in mind that the liquid filling might be too much for the shell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lindsay Webb"
},
"reviewBody": "It was definitely delicious !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CLIFF W"
},
"reviewBody": "I used canned sweet potatoes and a deep dish pie crust, turned out awesome! Will probably leave out the cloves next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Anderson"
},
"reviewBody": "First time making sweet potato pie and this was delicious! Pecan topping kicks it up a notch. Makes a lot, use a deep dish crust. I used 1/2 &amp; 1/2 for the cream. I cut back on the sugar in the topping a little. My new favorite holiday pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LBURKY"
},
"reviewBody": "This will be the 3rd year I've made this pie...I only tweak the spice amounts . I have a hard time eating just one piece. I tried this recipe because I don't like pumpkin pie but we also had a jumbo crop of sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Haro"
},
"reviewBody": "I didn't have ginger, added pumpkin pie spice &amp; cinnamon, used evaporated milk. The pie flavor was delicious, and recipe was easy. Only problem I had was that the brown sugar was griddy, not smoothe. Only broiled for 5 min. Not sure why, any suggesions?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jerrdale"
},
"reviewBody": "I added some dark rum to the pecan topping for a more robust flavor. Totally awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "darbaker"
},
"reviewBody": "Made this pie today. First time to make and eat sweet potato pie, so I have nothing to compare it. Used one 1 3/4 lb sweet potato &amp; it was 2 cups..Washed, quartered it. Placed in glass bowl with 1/4 cup water &amp; microwaved it till tender. Next time I'll boil them. Put potatoes in blender. Made recipe as stated except used a scant 1/4 tsp of PURE stevia in place if the white sugar in the custard. I did use brown sugar in the topping. Delicious! For our tastes, I'll probably cut back the cloves to 1/8 tsp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jean"
},
"reviewBody": "very sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raesteele218"
},
"reviewBody": "Delicious! I cut back on the sugar by half, added real vanilla extract (1tsp) to the filling mix, and a dash of tapioca starch to the topping. I'm planning on making this pie more often! We also used a gluten free pie crust, perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ray Johnson"
},
"reviewBody": "Sounds like a great recipe but I am new to cooking terms so wat does add cream mean"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GleeKikCoachT"
},
"reviewBody": "This was the best sweet potatoe pie for our Holiday desert. Instead of whole pecans, I used pecan pieces. It's very easy to follow and the family has been craving for more. I think I'll make mini pies so that everyone can take home more.\nHappy Holidays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tvan"
},
"reviewBody": "This pie was just ok. It was better out of the fridge on the second day but I think I'll just stick to regular sweet potato pie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hannah Cook"
},
"reviewBody": "I think that this may be the best version of Sweet Potato Pie that I have ever eaten, let alone tried to make myself. I substituted the white sugar for brown because that is my preference. I also hand mashed the potatoes because I like the texture better than a pureed version. Even so, it was much better than I could have expected. I will definitely make this over and over again..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deed"
},
"reviewBody": "Excellent pie! Good combination of textures and with a few changes, not too sweet. Love the crunchy topping!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy76"
},
"reviewBody": "Simply delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ramonasma"
},
"reviewBody": "This pie is really really good. I did make a couple of adjustments, though. I used 1.5 cups buttermilk instead of light cream and I nearly doubled the pecan brown sugar topping. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "schampion"
},
"reviewBody": "Yummy! But watch the praline topping closely while broiling to avoid burning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Frye"
},
"reviewBody": "My husband thinks this is wonderful. You could probably cut the cream down to 1 cup. Before I added the cream I thought the flavor was good. The cream diluted the flavors, so I added more seasoning. Next time I won't add as much cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rose Shoafstall Young"
},
"reviewBody": "This pie tastes better if you make a few days ahead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Agent Orgeat"
},
"reviewBody": "This was UNBELIEVABLE! I added bourbon to the topping the first time, and the second time I made it added dark rum to the topping. This is definitely going to become a turkey day staple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lara Fors"
},
"reviewBody": "This is delicious! It is sweet and creamy. FYI, I washed 4 large sweet potatoes, cut them in 3-4 chunks each, and baked them at 350 for about 30 minutes (I think) and then slipped the skins off. It was about right for the 2 cups. I also used half and half for the light cream, and I baked it in the \"Spiced Pecan Crust\" (recipe found here). I used finely chopped pecans for the topping, and it was very good--complementary to the texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacy"
},
"reviewBody": "I made this for Thanksgiving and chose not to tell anyone it was sweet potatoes until after they ate it everyone loved it they thought it was pumkin had they known it was sweet potatoe they would not of tried it. Now I should have no problems getting my kids to eat sweet potatoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blackberry botanicals"
},
"reviewBody": "awesome a classic in our family now"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyMom"
},
"reviewBody": "This has become THE Thanksgiving dinner pie in my family. I have made it for 3 years in a row now. I suggested not making it this year, and everyone howled in protest - so I'll be making it again!\n\n2016 now - and I'm still making this pie every year. A couple of notes - it usually takes about 4 large sweet potatoes to make 2 cups of mashed. Also, I use 1 cup of heavy cream and 2/3 cup whole milk for the light cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "The filling is custardy and delicious, but way too sweet. I'm going to cut down the sugar in the filling and the pecan topping by a third. Also, I bought deep dish pie crusts but had a lot left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REDHOTRS"
},
"reviewBody": "Soooooooooo good! Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jujubean"
},
"reviewBody": "This was so good, I will definitely be making this again. My husband who is a pumpkin pie fanatic was not excited about the idea of sweet potato pie, but once he tasted it he was in love!!! I used walnuts instead of pecans (what I had on hand) and also used heavy whipping cream (what I had on hand), but followed the recipe otherwise...a definite keeper! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JimnKimAllRecipes"
},
"reviewBody": "Wonderful recipe! I managed to make yam/sweet potato lovers our of my in laws! Many took it because they thought it was pecan pie. SURPRISE! they loved it. The flavor is to die for! As a matter of fact, someone 'stole' what few leftovers I had in the fridge ;) One tipe for a newer baker like myself... broil the pecans, brown sugar, and butter on LOW - not hight. Burnt the first batch. Thanksfully I had back up! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Scharolina"
},
"reviewBody": "I loved the topping to this pie The pie wasn't sweet enough for me BUT the topping is the best yet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovincookin"
},
"reviewBody": "I have made MANY recipes from this site, and this is the first one I am reviewing because it was so incredibly FABULOUS! You will never be able to eat Pumpkin Pie again. I never imagined it would be so good...I usually make 8 - 14 pies for our family Holiday get-togethers and this is at the top of the list now. This is my first sweet potato pie, and I'll never look back! My mom said it's her new fav and g-pa who doesn't like pumpkin pie or pecan pie said its his new fav (after lemon meringue which can't be beat) I used 3 eggs and milk instead of cream and allspice instead of cloves and it turned out so perfect that I'll never make it any other way! I also boiled the SP instead of baked and used a handmixer to get them smooth - let them cool before you add eggs. YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisyk"
},
"reviewBody": "I made this for Thanksgiving and again at Christmas. My only warning is that you need a really big pie crust to use both fillings. This made two of the standard store-bought pie crusts.\n\nI also made whipped cream sweetened with maple syrup for it, which people liked a lot. And my father, a pie lover, was in heaven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luv2cook"
},
"reviewBody": "Pretty good pie, but the caramelized pecan topping is only good immediately after preparing. Wait a few hours and the crunchiness is gone. Don't get me wrong: it's delicious just as it cools to a crunch, but alas, by the next day, the caramelized sugar is dissolved and the pecans are soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "This recipe was awesome. Everyone liked it better than my tried and true pumpkin. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mistletoes"
},
"reviewBody": "The pie filling was great - all was successful until I broiled the pie with the caramelized pecan topping. It burnt at only 3 minutes. I suggest leaving out the broiling portion. I believe the pie will be more savory if not done."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jade"
},
"reviewBody": "I love this recipe! I only use 1 cup of cream though as I find that anymore yields too much filling... I also use only half a cup of brown sugar with the pecans so that they caramelise better. I add extra spice because I LOVE chrismassy flavoued desserts. I highly recomend this recipe to all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squeeziebrb"
},
"reviewBody": "Adjustments I made for this recipe:\nADDED: 1/4 tsp. ground nutmeg\n 1 1/2 tsp. vanilla \n 1 1/2 tsp. bourbon\n 1 tbps. all purpose flour\nadded these extra ingredients to the sweet potato mixture. I also used half and half rather than light cream. I added a pinch of salt to the pecan/butter/sugar mixture as well. This pie is amazing!!! Ive never even had sett potato pie let alone baked it, hands down the best pie Ive made! Thanks Lorrie!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia B."
},
"reviewBody": "I've used this recipe 4 times already! If you times it by 1.5, it makes the PERFECT amount for 2 deep dish pies. I used Kahlua instead of bourbon and got rave reviews from family, friends and coworkers. The first time, I made it exactly like directions (with Kahlua exception) and it was too chocolatey, so the next few times, I used 1/2 and then 1/3 the chocolate... the best was with the least chocolate, although I do think the chocolate adds/accentuates flavor, so don't leave it out altogether. Overall, an EXCELLENT recipe - I will use over and over and over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clay"
},
"reviewBody": "I have made this recipie 3 years in a row for thanksgiving. It is amazing! Don't use mararine! Use butter! It's better for you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rach"
},
"reviewBody": "This recipe is so awesome. Delicious. I made as a pie the first time. The second time, I tripled the recipe, left out the pie crust &amp; cooked it in a 8x12 glass dish. It came out wonderful. Also, the first time I strained the sweet potatoes through a screen to get out all lumps. It was a pain. I did not do this for the casserole dish &amp; it was just as good. No need to strain. I mixed everything with my kitchen Aid and it came out nice &amp; smooth. I also subsituted the cloves for freshly grated nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "GRANDROYAI"
},
"reviewBody": "I followed this recipe exactly and found the pie a bit watery on the inside. The top was too sweet and the inside not sweet enough. I would not make this pie again. It was very easy, which i liked, but still not worth my time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ceci"
},
"reviewBody": "very easy and SO good! the pecan topping made it extra fancy and added a different texture to the smooth filling. i used yams instead of sweet potatoes as they're less starchy and lumpy when mashed. made this with a basic flaky pie crust (also from allrecipes), and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "atomeve"
},
"reviewBody": "YUMMY! This pie was absolutely delicious, and was a hit at Thanksgiving. I accidentally used half-and-half instead of light cream, but that worked out fine. I didn't find the sweet potato mix spicy enough, so I doubled the spices (more or less) and added a little nutmeg. The sweet potato mix came out to be FAR more than my 9 inch pie could handle, so I made a few small tarts to use up the extra. As someone else said, watch the sugar mixture on the top VERY carefully - mine was done in just under 2 minutes. I also tried to add whole pecan halves on the top, but they burned under the broiler - I would say if you are going to add \"decorative\" pecans, do it just after you pull the pie from the broiler, while the sugar is still soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SOCAL REINER"
},
"reviewBody": "THIS IS SOOO GOOD. I can't stop eating it. I've never really liked pumpkin pie but this is 10 stars. I used baked yams (1-1/2 lbs = 2 medium size yams - perfect for 2 cups), cut back sugar in the pie to 1/2 cup (1/4 cup white, 1/4 cup brown) and 1/3 cup brown sugar in the topping. I also used pumpkin pie spice (1 teaspoon) and 1/2 teaspoon cinnamon. Yam mixture seemed very runny when I put it in the pie crust but cooked up nicely. Watch the topping carefully under the broiler - cooks quickly. The ''Butter Flaky Pie Crust\" was easy and delicious too. This pie IS NOT low cal but it doesn't have corn syrup or sweetened condensed milk (YEAH). You could probably make it with Splenda, egg beaters and fat-free half &amp; half and it would still be good. My compliments to Lorrie ... this pie will definitely be on my holiday table!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I found this recipe years ago and it made this non-cook very popular that Christmas. I lost my copy of the recipe until just now! My mother flipped and we're on our way to the grocery store now! Thanks for everything."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DMARKLE"
},
"reviewBody": "Wow! I overcooked the topping on this the first time I tried it. (The TOP of the pie should be 5\" from the broiler, not the rack) But it still disappeared! I've since baked it to perfection and several people have asked for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very smooth and creamy. I did add a dash of vanilla extract and 1/4 tsp. nutmeg to the recipe. Absolutely wonderful.\r\n\r\nI used a deep pie crust though, and still found that I had a lot of mixture left over when finished."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KIM22871"
},
"reviewBody": "I have just had my first bite of this pie and WOW! It came out so creamy. I did as another suggested and decreased the brown sugar in the topping to 1/3 cup but should have done the whole 2/3 cup. My husband did not find it sweet enough. So maybe next time I will either increase the sugar in the filling to 1 cup or increase the brown sugar to the amount called for in the recipe. Either way this is surely one recipe that I will make again and one for my personal favorites cookbook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "Wonderful, my first ever attempt at a pie! The only mistake I made was when the recipe called for the sugar to be creamed together with the other ingred. I added the brown sugar to it... OOPS! Next time I won't put the brown sugar in the pie... I'll save it for the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is absolutely the BEST sweet potato pie I've ever had!!! I did reduce the brownsugar in the topping to 1/3 cup and it was just perfect. Everyone loved it at thanksgiving and is already requesting I bake it for Christmas too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Loves Food"
},
"reviewBody": "I took this to a \"southern\" style dinner and it was thoroughly enjoyed (especially the topping). While I would make it again, would try decreasing the filling sugar a bit. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misha"
},
"reviewBody": "This is the best sweetpotato pie I have ever tasted! Sweet potato was very creamy, and I loved the pecan topping. Would make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The pie filling was really good, Too much sugar for the pecan topping!\r\nI would make this agian with less sugar for the topping! This is a great pie for begginers really easy to follow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Pecans make this a not so plain potato."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMBREY1"
},
"reviewBody": "I no longer fix \"regular\" sweet potatoes in the casserole with marshmellows on top...this is the only way my family will eat them now...\r\nThe best one I have found yet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "crayn"
},
"reviewBody": "Great for a Thanksgiving meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kate519"
},
"reviewBody": "Great served warm, even keeps well and reheats for a couple of days.\r\nOur two year old loved it and that says a lot!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/12446/sweet-potato-pecan-pie/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
"name": "Pies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/822/desserts/pies/sweet-potato-pie/",
"name": "Sweet Potato Pie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/12446/sweet-potato-pecan-pie/",
"name": "Sweet Potato Pecan Pie"
}
}
]
}
}
, "about": [
]
}
]