				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet, Salty, Spicy Party Nuts"
,"datePublished": "2012-11-16T12:23:51.000-05:00"
,"dateModified": "2023-01-04T12:21:17.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/author/chef-john/"
}
]
,"description": "This nut spice blend is made with walnuts, pecans, almonds, and cashews coated in a spicy sugar syrup, then oven-roasted until crunchy and toasted."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dRV2iK-NI00c-BnSyHDDFs5Q4Dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1082000-69a8b23162604f77875a506ed2011c33.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1920249445001",
"description": "See how to make homemade gourmet spiced party nuts.",
"duration": "PT4M36S",
"name": "Sweet, Salty, Spicy Party Nuts",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/fd66cb8e-93dc-40e1-b3e0-22e73b3115b7/fd50196c-e277-4155-9656-1b3b0256e488/1280x720/match/image.jpg",
"uploadDate": "2021-07-03T19:56:08.571-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet, Salty, Spicy Party Nuts"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "427"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "219 kcal"
,"carbohydrateContent": "13 g"
,"cholesterolContent": "2 mg"
,"fiberContent": "2 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "206 mg"
,"sugarContent": "8 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"cooking spray",
"1 cup untoasted walnut halves",
"1 cup untoasted pecan halves",
"1 cup unsalted, dry roasted almonds",
"1 cup unsalted, dry roasted cashews",
"1 teaspoon salt",
"0.5 teaspoon freshly ground black pepper",
"0.25 teaspoon ground cumin",
"0.25 teaspoon cayenne pepper",
"0.5 cup white sugar",
"0.25 cup water",
"1 tablespoon butter" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and lightly coat with cooking spray."
} ,{
"@type": "HowToStep"
,"text": "Combine walnuts, pecans, almonds, and cashews in a large bowl. Add salt, black pepper, cumin, and cayenne; toss to coat."
} ,{
"@type": "HowToStep"
,"text": "Heat sugar, water, and butter in a small saucepan over medium heat. Cook until butter is melted and sugar is dissolved, about 1 minute. Slowly pour butter mixture over nuts and stir to coat."
} ,{
"@type": "HowToStep"
,"text": "Transfer nuts to the prepared baking sheet and spread into a single layer."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dRV2iK-NI00c-BnSyHDDFs5Q4Dc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1082000-69a8b23162604f77875a506ed2011c33.jpg"
}
]
,"text": "Bake nuts in the preheated oven for 10 minutes. Stir nuts to coat with warm syrup; spread out in a single layer. Return to the oven and bake until nuts are sticky and roasted, about 6 more minutes. Allow to cool before serving."
} ]
,"recipeYield": ["16"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NotoriousATB"
},
"reviewBody": "Seasoning perfect for a party. They are yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judi Rovner Colgan"
},
"reviewBody": "They were delicious, but I added a 1/2 tsp cinnamon and I will add an additional 1/4 tsp of cayenne pepper next time. Overall they were a hit at a party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "johnny p"
},
"reviewBody": "EXCELLENT, EASY, AND DELICIOUS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "BEST I've ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Having read previous reviews I doubled up the spices and also added a crushed clove of garlic to the syrup. I lined the tray with greaseproof baking paper so the nuts didn't stick (much better than foil). Separate the nuts with your hands while still warm and you won't end up with a solid sticky mass. I will definitely make again, thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Spectacular and always a hit with the crowd for game day, holiday, or just a quiet family day. I add a little smoked paprika to the mix too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Danielle Bercier"
},
"reviewBody": "Not much flavor; needed more spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetnsalty"
},
"reviewBody": "This is a great recipe to bring to a party or to make as gifts. Easy to make and I've never met anyone who doesn't love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "erma"
},
"reviewBody": "I followed the recipe as is with one exception - more cayenne. A lot more. :-) Thanks for sharing Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Williams"
},
"reviewBody": "These were delicious!!! I used mixed pecans, cashews, almonds, &amp; pistachios. Like many others, I put my spices in with the butter/sugar/water mixture. I felt that they would be incorporated better in the warm liquid mixture. I added a teaspoon of cinnamon along with the specified cumin/cayenne/S&amp;P (I may have put an extra dash of cayenne) . I also used 1/4C truvia &amp; 1/4C swerve brown sugar. The chef's directions to stir &amp; mix for at least 4 minutes after the first cooking time was KEY! The syrup got thicker &amp; thicker, and every nut got coated. I appreciate the advice of other readers who said to put the finished nuts in a bowl &amp; stir intermittently as they cool. I am thrilled with the tasty result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "esthie"
},
"reviewBody": "Wow our guest went nuts , so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacyanne"
},
"reviewBody": "The only thing I would change about this recipe is the amount. It should automatically be doubled. I made this for a party recently and it was a huge hit. The spice blend was perfect and the instructions resulted in glossy, crunchy nuts. The only change I made was substituting peanuts for cashews. I will definitely be making this for parties again as well as to snack on. Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these for the first time for a girlie lunch. Went down a storm. I will make them spicier next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whirlycook"
},
"reviewBody": "Man, these are TASTY! I need an appetizer for a party and found this recipe. Did not alter the spice mix. Used a half sheet pan lined with foil sprayed with nonstick butter flavor spray. I did put the spices in with the sugar butter mixture after the sugar had dissolved, at the last minute. Stirred everything well, to make sure the nuts were all coated. It did look runny but do not worry, it dried up in the oven. I transferred the nuts to a big plastic bowl after the initial 10 minute roasting period and stirred them again for a full 5 minutes. I got a bit worried because they looked kind of grainy, not glossy at that point, but all the liquid was absorbed. Put them back in the oven for more than the 6 minutes. Kept checking them and stirring them around with a silicone spatula until they got that nice glossy look, all in all about 15 minutes. Then I transferred them to a big cutting board covered with baking parchment paper and separated them as they were cooling. They are glossy, lovely, crunchy, sweet and spicy. Perfect! EXCEPT I have to make another batch as these will go FAST. Not nearly enough of these delicious beauties. Having to keep my husband away from them because he won't leave them alone and they're for the party! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marian Phair"
},
"reviewBody": "These are addictive! My husband kept eating them and when I took a look at the container, it was half empty/full! :-)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Claytor"
},
"reviewBody": "I make these often as gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dorishealey"
},
"reviewBody": "Absolutely fabulous! I've doubled and even tripled the recipe. You don't need as much syrup as it calls for....I used double for a triple batch. Using raw nuts, I've found that they need longer in the oven (at least 20 minutes....up to 30) in order to have a bit of crunch. Keeps well in a lidded jar. These were a hit as Christmas gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike M."
},
"reviewBody": "Absolutely perfect as written! If you want a little more zing though, try ground ghost pepper flakes in place of the cayenne! I double dog dare you! It's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was awesome! It made my night. The nuts were so delicious! Thank you for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ME"
},
"reviewBody": "Sooooo good! As far as ingredients, I only added a smidge more Cumin than the recipe called for. It's my favorite spice, and I love the spicy/smokiness of it. As far as preparation, I completely did it different - as in I used my Ninja Foodi to make it a one pot/pan recipe. Measured 4 cups of nuts, and put all spices overtop, put a lid on the bowl, and shook it real well, and set aside. I melted the butter/water/sugar in the Foodi's pot on sear/Sautee for a couple minutes. Dumped the nuts in the pot. Stirred well. Set to air crisp on 350°, closed lid and let it go. --- I stopped the machine and stirred every 5 minutes. Making sure all the nuts were getting coated well --- It took about 15mins/3 good stirs . . . I laid a large sheet of parchment on the counter, and immediately dumped the nuts on it. I separated them as well as I could with my spoon, and let cool. They came out PERFECTLY! Nice and glossy from the simple syrup glaze, but not a bit sticky! Sweet, but with heat that sneaks up on you every few pieces. I will make this repeadly, I'm sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley "
},
"reviewBody": "This is an awesome recipe! I used my own mix of nuts, basically what I had on hand including pecans, pepitos, pistachios, cashews and macadamia nuts. I added more cumin and cayenne, next time I'll add even more. But it is delicious! Not sweet, not too spicy, just excellent! A winner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These are delicious! My dad keeps asking me to make them in subtle ways like “oh look! We have extra nuts we could use…” \n\nOur family doesn’t care for walnuts because of canker sore situations, so I use peanuts instead. They also pair well with dark chocolate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bette Stanford"
},
"reviewBody": "I followed the recipe exactly and watched the video and still ended up with a gummy mess. I had to continue cooking the nuts at a low temp, checking and cooking till the gumminess dried up. I'm talking hours. This made me wonder if Chef John had tried his own recipe. Friends liked the nuts but this was way too much hassle. I won't use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SFinster"
},
"reviewBody": "I should have listened to the people who said amp up the spices. They're good, but bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "debbiecg4"
},
"reviewBody": "I just made 4 batches for holiday gifts. A few things I learned. The 350 temp was important to get the glossy look. The caramelization was very tasty, but I did have to watch for burning. Stirring for several minutes after the first 10 minutes of baking really helped. I also added some pistachios and macademia nuts, and a little cinnamon as well. Will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anne"
},
"reviewBody": "I’m so glad I watched the video, because the instruction to stir for 3-4 minutes is what makes ALL the difference for all that lovely glaze to end up on the nuts rather than leaving it behind on the pan. (I would’ve just tossed and returned them quickly to the oven, without giving the glaze a chance to cool a bit and thicken up.) Simple ingredients and a nice scientific technique…that’s the little edge that a really good recipe provides! So quick, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LoriMc"
},
"reviewBody": "Delicious! I've always made sugared, spice nuts to give away at holiday time. I tried these and they are excellent. I added garlic and onion powders, (because I like those all the time!) and they were crispy, savory, salty, sweet, spicy....perfect! And very easy to make! I did 1/2 batch at a time to give lots of room on the pan to separate the nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "glowarr09"
},
"reviewBody": "Non-stick aluminum foil is a must for this recipe! I used smoked chipotle pepper instead of cayenne and doubled all the spices. Turned out fantastic! I did add the spices to the water/sugar/butter while it was cooking to make sure the spices were distributed evenly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Y U M M Y! I only have raw almonds and cashews on hand so I roasted the nuts a little longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tamara910"
},
"reviewBody": "I love sweet and spicy nuts and this recipe is terrific!! Spiciness can be adjusted to taste, I added a little more cayenne and cumin. I also used peanuts, cashews, almonds and pecans because I forgot walnuts. Next time I may use all peanuts because this reminds me of some sweet and spicy peanuts I had years ago but can't find anymore. The one tip I have ia to stir them once every minute or two while they're cooling to prevent the nuts from sticking together and becoming brittle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Rosen"
},
"reviewBody": "Easy &amp; wonderful recipe. Agree with others, 1.5 X Cayenne for extra bite. Keep stirring after you remove from oven or they will all stick together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TassieHomeEconomist"
},
"reviewBody": "These are absolutely incredible!!! So easy to prepare. I even made them with Truvia ( stevia) ! Follow the directions exactly:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BKK"
},
"reviewBody": "I used a deluxe nut mix so that I had closer to the unsalted amount called for and they were incredible. However, the next time I made the recipe, I tried to half it and it didn't work as well. I semi-burnt them and ended up having to eat them all by myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Qu"
},
"reviewBody": "Perfectly made, I love nuts. To nourish my stomach, I also eat Echemi noodles. I decided to eat well in the future and not to eat too much fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Doreen Jacobson"
},
"reviewBody": "Turned out excellent. I also made a sweet batch for the grandkids using the hot sugar mixture, 1tsp cinnamon and 1 tsp pumpkin pie spice. Love how easy this is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Gutt"
},
"reviewBody": "Delicious salty and sweet snack, great with the small cayenne bite, that is very easy to make. Note that the butter/sugar mixture hardens a bit and makes the nuts stick, like a softer form of nut brittle. But they break apart easily."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dwhitley1964"
},
"reviewBody": "I’ve made this recipe twice with wonderful complements both times. I also added the spices to the sugar mixture for ease. Just the right amount of sweetness vs. spiciness. Great gift idea!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef of the house"
},
"reviewBody": "Followed recipe as written. For those wanting more heat, i thought the heat was just right. It kinda hits you in the back of your throat. A good recipe to keep for the holidays."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Songstriss4Jesus"
},
"reviewBody": "I loved these so much I made a whole bunch, put them in decorative jars &amp; gave them as gifts! I had to back off the cayenne for some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Wayland"
},
"reviewBody": "Great mix,I added granulated onion and garlic, as well as a shot of bourbon to the water......can't make enough for the family or friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy O"
},
"reviewBody": "I doubled the recipe and made as gifts for neighbors and coworkers at Christmas. Watch the video and do stir thoroughly to coat each nut at the halfway mark of baking. I also stirred as they cooled to keep the nuts from sticking together in clumps. They came out beautiful and tasty. Seasoned per the recipe with a little extra cayenne. (We live in Texas, spicy is appreciated!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Everyone that has had them wants MORE!!! Absolutely fabulous. I cut back a bit on the cayenne, but they are one of the best things I've ever made for a snack!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doe98"
},
"reviewBody": "These are delicious. Made to take to my nephew's for a get together. Needed to make another batch after my husband and I ate the first batch!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bob Daye"
},
"reviewBody": "These came out really good. Did not have any cumin, but made them per the rest. Too much heat for my wife and daughter but they sweat when they see a pepper.\nWill make another batch with no ceyenne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KatieW9908"
},
"reviewBody": "These were good but didn’t knock my socks off; I generally prefer stronger seasonings and spicier kick. It’s also a good thing I was keeping an eye on them because they would’ve been REALLY singed if I had kept them in the oven as long as the recipe suggests. Consider cooking at 325 or for fewer minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desiree Oosterberg"
},
"reviewBody": "absolutely delicious and not too spicy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin"
},
"reviewBody": "These are really good as a bar or party snack! Exactly what you think they'd taste like!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bettie Combs"
},
"reviewBody": "Excellent! I followed the recipe with one change as suggested, I added the spices to the butter mixture. They taste really good! Now I’m making 2 more batches. I will add chipotle pepper and fresh chopped rosemary along with the other spices. Thanks Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jacqueline Travels"
},
"reviewBody": "I made these, and was disappointed. The coating is not quite burnt and none of the flavors from the spices come through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betsy B"
},
"reviewBody": "I've made these several times now. Quick and easy. And Tasty! Thanks, Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gloria"
},
"reviewBody": "These are fantastic just as written. They have a perfect balance of sweet, salty, and spicy. One does not take over the other. I followed the recipe as close as possible. I couldn't find the untoasted/unsalted nuts so I used \"Pre-Roasted Deluxe Mixed Nuts with Sea Salt\". Because they were pre-salted, I omitted the salt from the recipe. I didn't have a problem with them sticking to the tin foil but I did use non-stick tin foil. Great recipe and one you could tweak to have many different flavors. Thanks for the recipe!!\n Update: I have made these so many times now. Everyone loves them!! They are so addicting. This last time, I ran out of white sugar so I used light brown sugar. I would not recommend doing this. The brown sugar made them stay sticky even after they cooled and the flavors were just very bland. Couldn't taste the sweet, salty, or spicy! Next time, if I run out of white sugar, I will just wait until I can get more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chief Dragonfly"
},
"reviewBody": "Wow. This was such a simple to follow recipe and the nuts came out so yummy. Kids loved them so much. Had to hide a batch to share with my sisters. Can’t wait to have a family get together so i can show off new recipes I have found. Thank you for sharing this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "Great recipe, easy to make! I had a couple of cans of mixed nuts I needed to use and it made for a semi healthy snack to have sitting around! I followed the recipe except for adding more cayenne, we like things spicy! They turned out perfect, great flavor and crispy texture, not chewy or sticky like some I have tried! Will definitely add this to my favorites!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DESIREE MARTIN"
},
"reviewBody": "It was delicious. I found this to be the easiest and most effective way to make it. We all enjoyed it and have some more for whenever we need a great tasting snack. \nThanks for sharing this recipe. \n\nDLM - TN."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Capasso-Fortney"
},
"reviewBody": "Delicious! I loved this recipe! I used a little less sugar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C. Levens"
},
"reviewBody": "Love this recipe and have made it twice already. The parchment paper was a great save and highly recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gearley"
},
"reviewBody": "Delicious, you can’t eat just one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "I made this today, and they are so good!! I added a light sprinkling of Johnnie's seasoning and cayenne pepper after they were finished roasting because I thought they needed a little extra flavor for my taste. I highly recommend this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "edmonton"
},
"reviewBody": "The recipe was easy to follow. Flavour was delicious and enjoyed by everyone. I would add a bit more cayenne next time. However, I had to bake it for almost 20 mins before it got to a nice golden brown colour and all the liquid got absorbed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelli Holden"
},
"reviewBody": "This is a killer recipe for mixed nuts. I amped up the spice a bit (not quite doubled) and followed the directions exactly. It's important to mix and stir the nuts after the 10 minute baking time as directed until the glaze is incorporated into the nuts completely. Had to ration these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nanci"
},
"reviewBody": "Very easy &amp; straight forward recipe. So much better than the usually super sweet glazed nut recipes! A perfect blend of sweet &amp; spicy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fred Slocombe"
},
"reviewBody": "I'm no longer including cashews and almonds because they are much more dense than pecans and walnuts and require either a higher or longer cooking time. I also bumped the oven temperature up to 375 for an additional 12 minutes to get much crispier results. The Walnuts had the best results as their surface area is such that the seasoning packs into the gaps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JulianneB"
},
"reviewBody": "I stumbled upon this recipe while looking for a gift idea for my dad for Christmas. I made it exactly as the recipe instructed, then I read the reviews. The only reason there are four stars and not five is the cooking method. I agree with other reviewers - remove the mixture to a glass bowl while it's still warm. Otherwise it's practically impossible to get it out of the pan when it's cold and if the syrup gets under the foil, it's almost impossible to clean the pan. I thought the finished product was great though. My dad ate it all in about three days. Per other reviews, I would also add the spice mixture to the melted butter mixture instead of directly on the nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Hickerson Cracraft"
},
"reviewBody": "These are so tasty! Served them on New Year's Eve and they all disappeared. Would recommend making a double batch if you have a large crowd. I used mixed unsalted nuts from Costco and it worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sucaron"
},
"reviewBody": "WOW! Big hit all around! Thanks Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lena Rodriguez"
},
"reviewBody": "I would put 1/2 theblack pepper-but otherwise SO GOOD!!! We also used dairy free butter-it was perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Faith"
},
"reviewBody": "I looooove spice, so I added about 1/2 tsp of creole seasoning, a few dashes of chili powder, and a few shakes of cinnamon. \nMade these earlier today for the family to snack on and they're already gone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sherry"
},
"reviewBody": "I would definitely use parchment or wax paper instead of foil as I had a problem with the nuts sticking to the foil. Next time I make these, I will up the spices a bit as these were more sweet than spicy for our taste. That all said, these are very good and addictive."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Williamson Farrell"
},
"reviewBody": "Did not make but received them as a gift. OMG IS RIGHT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "The best! Everyone has loved it! First pass I followed recipe. Was good but I thought more pizzazz would be better. So next round I added more cayenne and more cumin. I used Trader Joe’s grinders for both lemon pepper and garlic salt! Fab! Today I tried adding some Worcestershire and we’ll see. Super yummy. Also first time I used deluxe mixed nuts, raw. Next time I used roasted unsalted and I think they were better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Stanley Wesson"
},
"reviewBody": "so easy and soooooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "five cents"
},
"reviewBody": "This a winner~A few of the nuts stuck to the foil so I will try parchment paper next time. Highly recommended A+++++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "Easy to make! Tastes great! Very happy with it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "petersse"
},
"reviewBody": "Easy to make but not as spicy as I expected so will increase the cayenne pepper or may ale add some Tabasco sauce. \n\nThe cumin imparts a rather stinky smell so I will Drop it from the recipe next time\n\nThis recipe results in spiced nuts with a nice light sweetness and excellent crunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tulip"
},
"reviewBody": "I made these a few minutes ago &amp; they are great! I used parchment paper and had no stickiness problem. Followed the recipe to a \"T\" except I got a jug of mixed nuts that included peanuts, almonds, cashews, hazelnuts and pecans.\n\nWill definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rosebud"
},
"reviewBody": "I cut the recipe in half just to test out the flavors before I made an entire batch. The flavors are good; not too spicy, not too sweet. I can see where people who are used to a sugar cinnamon coating would find these to be odd. Hubby, not a nut lover, liked them. I would definitely make them again. Nice recipe, Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenO"
},
"reviewBody": "I’ve made this twice already and there are still 10 days until Christmas! Family ate them up! I bought bags of mixed nuts. Delicious and satisfying!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane H. Bock"
},
"reviewBody": "The end product is delicious, but....\nIf you use untoasted nuts, it takes 20 minutes of oven time to get the cashews, walnuts, and pecans to taste delicious. Otherwise, they are not crunchy. The spices and syrup are perfect. Be sure to taste the 'finished product' as the recipe suggests before you serve the nuts because they can be starchy and chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoJo731"
},
"reviewBody": "These nuts are fantastic and are now my go-to Christmas goody to give to my family and friends. I'm glad I read several reviews before beginning as it helped know what to expect. So I used a Silpat mat on my baking sheet and had absolutely no problems with the nuts sticking. I also added all the spices to the butter sugar mixture as I thought that would make for better distribution and it worked well. I immediately transferred the finished nuts to another baking sheet lined with Silpat mat for faster cooling. The nuts will tend to stick together at this point so just break them up with your fingers once cool enough to handle. These are not very spicy at all so if you prefer spicier flavor, double up on the spices. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "I made 90 servings as I had 2 x 1.13 kg jars of deluxe mixed nuts. I halved the cumin as I am not a huge fan and omitted the salt since my nuts were salted. I baked for 20 minutes, stirring and turning the pans halfway through. They were still pretty wet, I turned off the oven and left in for another 20 minutes which was perfect. I lined with parchment paper which made it very easy to stir and break up the nuts. Taste was good, at first I thought no spicy at all but it snuck up, I think chipotle powder would be nice too as it would add a smokiness to the nuts. I hope everyone enjoys this addition to their Christmas baskets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "drumac"
},
"reviewBody": "Followed the recipe with one modification. Instead of butter I used a tablespoon of BACON grease and OMG, they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kay"
},
"reviewBody": "WONDERFUL!!! Perfect balance.. not too sweet.. not too spicy. made it with walnuts and pecans ( I have picky people who only eat certain nuts).. It works perfectly.. I did not have a sticking problem. I stirred them when I got them out the last time and set the timer again for 5 minutes and stirred them again.. no problem.. I love them warm and if I still have any left, I am sure I will love them cold."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Super easy and is amazing!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ttkc"
},
"reviewBody": "These are awesome, and your guest will love them. I strive for an equal balance in flavors, because you’re might not always know your audience. I like sweet/ hot, while my relatives like salty/ savory, so I try to give just a little to everyone’s taste buds. VERY IMPORTANT NOTE: reading reviews, everyone talks of sticking. I had no problems and here is why. He says to stir the nuts and hot mixture 5 minutes until the liquid starts to stick to the nuts. This is key."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flakybabe"
},
"reviewBody": "Love this! As written nuts are delicious. I've made this several times and have tweaked it a little. I double the recipe but replace 2 cups of nuts with dried cranberries. I also add Paprika for color. Other spices with the cumin also work well...just don't over spice it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLo"
},
"reviewBody": "Excellent flavor, everyone enjoyed them! Followed the video directions and they were perfect. Definitely will be added to my rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivon Esmersoy"
},
"reviewBody": "IT WAS GREAT. LOVE THE AMOUNT OF SPICES IN THERE AND WAS REALLY EASY TO PREPARE....CONGRATS"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "goodeats"
},
"reviewBody": "These are so delicious!! Definitely use parchment paper. I use extra spices because I like the after burn. I also bake a little longer so they aren't as sticky. Always a hit and keep well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Kiteley"
},
"reviewBody": "I add 1/2 teaspoon granulated garlic"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "miss415"
},
"reviewBody": "Not sure what possessed me to purchase raw mixed nuts. w/ NO seasoning but they were so boring! I could not decide if I wanted salty, spicy, sweet and this had it all. I'm avoiding sugar as much as possible so i subbed cinnamon and just a teaspoon of swerve (erythritol). Very tasty &amp; satisfying. Plan to make more. I gave 4 stars only because I have nothing to compare them to since this is my 1st attempt at seasoning nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynne"
},
"reviewBody": "This is the absolute best technique for spiced nuts because boiling the the sugar and butter makes a glaze that helps the spices stick to every single nut. With every other recipe I've used there is inevitable a pile of spice at the bottom of the bowl. Not with this recipe. Flavors worked well together, too. I added 1/4 tsp of cardamon because it adds a warm smokiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta"
},
"reviewBody": "I omitted the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Laviano"
},
"reviewBody": "Added smoked paprika and swapped out the butter with olive for my vegan friends. Deeee lish. Everyone loved them. The perfect balance of sweet and saltey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jan"
},
"reviewBody": "No changes. I love to give these away for holiday gifts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Catherine Koziatek"
},
"reviewBody": "I did not have cayenne pepper but added smoked paprika. I used unsalted nuts. The recipe needs more salt than what is indicated for my taste. I could not add garlic salt or garlic powder or onion powder because one person who may eat these nuts has allergies. Still rather bland. Added pepper and Maggi seasoning and curry powder. Could not add Worcestershire because it contains onions. Next time I make a batch just for my husband and me, I will add garlic salt and Worcestershire. I think this would be good also dusted in Ranch dressing powder and omit some of the other spices. I will also go a buy a small container of Cayenne, even though I don’t like very spicy food. It’s fun to experiment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jan kreutzer"
},
"reviewBody": "I used pecans, peanuts, cashews, almonds and some macadamia nuts. I gave them as part of gift baskets to co-worker and got rave reviews. Next time, however, I will increase the nuts -to-coating ratio; they were a bit too moist"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vms7749"
},
"reviewBody": "I made it and so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suet517"
},
"reviewBody": "Excellent recipe, I always double it as they are a huge hit. I use the Costco salted mixed nuts (remove the Brazil nuts) and omit the salt. Using parchment paper is the only way to go. Love the kick of the cayenne but when I’m making them for the grandkids I only use about half the cayenne. Excellent recipe! Always get asked to share it..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I made it as written. Not enough flavor for me. It wasn't bad, but not so different from a can of mixed nuts. I'll try a different recipe next time."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/230159/sweet-salty-spicy-party-nuts/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
"name": "Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16429/appetizers-and-snacks/snacks/party-mix/",
"name": "Party Mix Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/230159/sweet-salty-spicy-party-nuts/",
"name": "Sweet, Salty, Spicy Party Nuts"
}
}
]
}
}
, "about": [
]
}
]