				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet Potato Minestrone"
,"datePublished": "2000-09-11T18:09:00.000-04:00"
,"dateModified": "2022-07-14T17:56:39.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Shelley"
,"url": "https://www.allrecipes.com/cook/154033"
}
]
,"description": "A hearty and delicious vegetarian minestrone soup with sweet potatoes, carrots, green beans, celery, tomatoes, onions and garlic."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/TPlxk_WF8i5wez0R0QFRPZaeraU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/561951-d6d9a31cc5e54332882115abfe2564a5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Potato Minestrone"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "293"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "201 kcal"
,"carbohydrateContent": "40 g"
,"fiberContent": "8 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "611 mg"
,"sugarContent": "16 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"1 large onion, chopped",
"2 large stalks celery, chopped",
"2.5 teaspoons Italian seasoning",
"salt and pepper to taste",
"1 (28 ounce) can Italian-style diced tomatoes",
"5 cups vegetable broth",
"2 large sweet potatoes, peeled and diced",
"2 large carrots, sliced thin",
"6 ounces green beans, cut into 1 inch pieces",
"5 cloves garlic, minced" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a soup pot over medium-high heat. Sauté onion, celery, Italian seasoning, salt, and pepper until tender, about 5 minutes. Stir in tomatoes with juice, broth, sweet potatoes, carrots, green beans, and garlic. Bring to a boil; reduce heat to low and simmer, stirring occasionally, until vegetables are tender, about 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Art Hoskins"
},
"reviewBody": "A fall/winter classic!! Good and good for you. Have made it many times. Usually double the recipe and freeze individual portions for lunch. Everyone in the breakroom will ask about it because it smells that good. Sometimes I'll shred spinach and add it to increase nutrients. If I have extra carrots or celery, I'll throw them all in. Lots of latitude with this recipe and it tastes great every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I have made this many times and with many variations. I always try a recipe just as the recipe is written first and this is great as written. Never any leftovers. I think it's one of my favorites because you can use up any fresh veggies in your fridge before they go bad, so there's never any waste....all you have to do is change the name you tell others to reflect what you've added!! But, the additions that I have found, quite by accident, that have had the biggest request for \" can I have the recipe\" is when I have added a couple handfuls of fresh spinach leaves, 2 cans of drained cannelini beans, 4 Tbsp fresh chopped Italian parsley, 2 cups chicken stock, which changes the vegetarian status but adds flavor and.....about 2 cups small chopped mushrooms. All in all, this is a great recipe for a hearty healthy soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Srscott"
},
"reviewBody": "Delicious, I made it according to directions and added elbow macaroni the last 10 minutes. I will definitely make this again. The hubby loved it! I did add a little sweet and spicy Tabasco to mine for the heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stef"
},
"reviewBody": "I didn't have some ingredients in my cabinets so I used onion powder, minced garlic, basil and oregano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VegLady"
},
"reviewBody": "Added mushrooms. Used bouillon. Used basil, rosemary, thyme."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Larry Dempsey"
},
"reviewBody": "We loved it, I added an extra carrot and about a half a celery stick more cause I like a little more of them. It’s a definite remake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Taylor Klusman"
},
"reviewBody": "Didn't have celery, but added black-eyed peas, kidney beans and vegan protein broth to make it creamy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "I will definitely make it again, I might try adding edamame beans to it, I didn’t put the noodles in. Great tasting hearty soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Catherine Gallaway"
},
"reviewBody": "This turned out superb! To make it easier, I put the garlic, onions and celery in the food processor and used frozen green beans and carrots. I only had about a teaspoon of Italian seasoning so I used half a teaspoon of dried basil. Just the right balance of flavours! Great served with crusty bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alyson Maxwell"
},
"reviewBody": "This was a great way to use up a sweet potato and to vary my usual minestrone. I didn't have Italian spice so I added dried oregano, cumin, parsley and basil-probably a tablespoon total of the dried herbs and a teaspoon of cumin. I also salted the veggies while sautéing them. I think the soup needed the extra spices and turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lanie"
},
"reviewBody": "I waited to add the green beans until the last 15 minutes so they weren't overdone. I also added cooked elbow noodles at the end then let is set for about 3 hours. I topped with fresh parsley when served. The dish was a hit with the whole family, including the kids. I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Hymen Randi Goodwrench"
},
"reviewBody": "A little sweeter then expected. My daughter didn't like it but I found it satisfying."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laboss121"
},
"reviewBody": "This is a winner! I leave out the pasta and add a can of pink beans!!! Awesome my family loves this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NatesNana"
},
"reviewBody": "Excellent. My first attempt at a vegan meal for a friend. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bcobb35"
},
"reviewBody": "Made as directed with just one change, I added only 2 cups of vegatable broth and 4 cups of beef broth. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carolhude"
},
"reviewBody": "I made a couple of tweaks, but nothing major to this delicious soup. Added a can of cannellini beans and a can of diced green chilies. This was great, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Pippin"
},
"reviewBody": "Awesome soup. It was perfect when made as the recipe read. I will be adding some fresh spinach next time though and maybe some cannellini beans. It was great the first night and even better after it set in the fridge.\n\nEdited to add: Ok, I made this again and added an Italian squash, cannelline beans &amp; some fresh spinach. It was even better than the first time. This will be a new go to for me, perfect with a slice of crusty bread on a cool night."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Theresa Doss Rendziniak"
},
"reviewBody": "The soup was good. It could have used more vegetable broth ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine Somervell"
},
"reviewBody": "This is my go-to soup recipe. So much more than the sum of its parts! I've made it many many times - sometimes exactly as written, sometimes with variations because I have different veggies on hand - but it's always delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Theresa Sarlo"
},
"reviewBody": "Made it today. Used beef broth instead of vegetable broth and added a little tomato juice for more broth. Delicious. Totally enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meg Love"
},
"reviewBody": "Great recipe! We have made it twice now, I added some apple cider in place of chicken broth and it was so good! I recommend trying it, and add the white canned beans minus the juice to the mix. We have also played around with different veggies, added mushrooms. All in all a fantastic recipe that we will use regularly! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caro Salvatierra"
},
"reviewBody": "yes! it's delicious..I used fresh tomatoes instead..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Meg"
},
"reviewBody": "A good soup. Minestrone is not my favorite, but this is a neat take on it. Sweet potatoes take over the role of starch in this soup, instead of noodles and/or beans. Definitely use fresh green beans. They are a nice touch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "it seemed like there was something missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarinJoy"
},
"reviewBody": "I was surprisingly impressed. Great recipe. I changed a couple things. Added one can of rinsed and then puréed cannelloni beans. Extra crushed garlic and chopped onions. Browned up a few sausage slices so my husband would eat it. He ended up having two bowls. And I put all the ingredients in my crockpot and cooked it all day in there. I sprinkled the servings with a little parmesan cheese. It was great. Thanks for the wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie Nolen Woods"
},
"reviewBody": "Picky husband loved it... enough that he even took some to his parents (high praise that he thinks they would eat it!). Could have used a few more minutes for the carrots and green beans. I added cooked elbow noodles the last 2 or 3 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Easy to make and very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eastoffel"
},
"reviewBody": "Very easy and super yummy! I was surprised at how rich the broth was. I added quinoa to boost the protein content. My kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Maire"
},
"reviewBody": "Trying to make this Paleo. Using cocunut oil and organic veggies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lady Sam"
},
"reviewBody": "Good starter recipe. Just throwing a few more things in makes it excellent. Used olive oil to sauté the onions, celery, garlic and some fennel. Added about a tbsp of basil, and some oregano, parsley, thyme and marjoram. Also added about a tbsp of crushed red pepper. Once the tomatoes and broth boil I added the sweet potatoes and carrots. After that bubbled for a while I added some cannelllini beans, frozen peas and Lima beans and finally a handful of ditalini pasta. Really good. Better the next day and freezes well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saraj"
},
"reviewBody": "This was SO good with the following alterations. Instead of olive oil I used garlic infused olive oil. Instead of veg broth I used 3.5 C Veg broth &amp; 1.5 C chicken broth. I did the green beans in ½ inch sizes and instead of garlic cloves I used minced garlic where ½ tsp. = 1 clove. And I did heaping tsps. full. For the sweet potatoes I did one orange/yam type and one white. But it was SO good we are going to do it again. Though will dice the potatoes smaller next time, so they cook faster because it took about 20 min longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrew Oliver"
},
"reviewBody": "I actually hate sweet potatoes due to childhood trauma (think day care and canned sweet potatoes), however, I wanted to see if there was a way I could like them. This was it! As usual I doubled the garlic. I also accidentally doubled the Italian seasoning but it worked. I used low sodium veggie stock because the wife is trying to cut down on salt. This was easy to make and paired nicely with my other vegan courses (Quinoa Black Beans and Balsamic Strawberries). It definitely needs to cook a bit longer even with small sweet potato cubes (I slice them and use a \"chop magic\" to do this efficiently and evenly). Both of us sweet potato eaters ate the whole bowl!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SBfan2010"
},
"reviewBody": "Wanted a veg. soup recipe that would help me use up a sweet potato. As others said, I was skeptical just reviewing the ingredient list that it would be something crazy delicious - but it really was. Very good. Exactly what I was looking for and could easily be changed based on what you have on hand and would still be just as good, I think."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dawn"
},
"reviewBody": "Love this recipe! Easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia Maynard"
},
"reviewBody": "I made a double batch of this soup for a fall-themed baby shower, and it was loved by ALL! I was asked to email everyone the recipe! I added some seashell pasta, but other than that, didn't change a thing, and it was FABULOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanied"
},
"reviewBody": "Agreed that white beans or lentils would've made this a full entree with protein. Used homemade veggie broth for a delicious no preservative, gluten free vegan meal. Also subbed peas for green beans for the kids. Will make this a lot! Served with a side of homemade gluten free bread brushcetta. Perfect! Thanks for posting :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KittyMama06"
},
"reviewBody": "Delicious! Perfect meatless option to have during Lent and full of veggies. My family doesn't really like sweet potatoes but they are so good for us. This is one of the few recipes I can make with sweet potatoes that everyone will actually eat. My mom, who loves sweet potatoes, gobbles this recipe up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajaderecio"
},
"reviewBody": "I added fresh herbs. The potato was the best. Use real sweet potato, not yams."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Wrzesinski"
},
"reviewBody": "Wow, what a soup and so simple!! OK, I used yams and added 1# of cooked ground turkey. It is totally colorful for Halloween and Fall. I especially love the five garlic cloves!! Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheri Reynolds"
},
"reviewBody": "My family loved this recipe, from the 3 year old up to the 26 year old, and including my husband. One son only took a small amount to start because he thought sweet potato soup sounded weird, but he soon came back for a big bowl and said it was great soup! He also commented that it was sweet. I could have eaten the broth alone, it was delicious. I followed the recipe exactly (I did add the minced garlic at the beginning with the onion) until the end when I added a can of garbanzo beans (all I had) and some pasta like others suggested. With or without the additions my family would have enjoyed it. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ZeldaSayre"
},
"reviewBody": "For a vegetable soup, this is pretty good. I added some white beans to bulk it up a bit. This recipe makes a ton - easily 7+ servings for us - so I'll be eating it all week, but I don't think I'll make it again. Thanks anyway!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "moxie & mirth"
},
"reviewBody": "This was weird, to me. I like everything in it, but just not together. The family said they liked it, but no one went back for seconds (unusual) and the leftovers sat in the fridge. Really disappointing. Also, as someone else mentioned, it's not even Minestrone unless you don't have beans and pasta. It's just vegetable soup. Sweet vegetable soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristel"
},
"reviewBody": "This was delicious, hearty and healthy! Only thing I did differently was that I used chicken broth instead of the vegetable broth and also added a few teaspoons of chicken bouillon powder. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "Easy and delicious. I did not cook the veggies (especially the green beans) for as long as was stated because I don't like my veggies too mushy. I also added a can of cannellini beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Calicook"
},
"reviewBody": "So delicious, and even better as leftovers. We made it exactly as is and loved it. It's a wonderful fall soup. Super easy to make once you chop up all the vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cowjam"
},
"reviewBody": "Thank you for this recipe. My son, who NEVER eats vegetables ate 3 bowls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MJ"
},
"reviewBody": "Yum. This is different, but I really like it. My husband doesn't like sweet potatoes, but he liked it too. I added some apple cider vinegar (about 1 tsp), and I like the flavor even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tnbelle"
},
"reviewBody": "Surprisingly good, even with all the substitutions I had to make. I used only 1 large sweet potato, a 14 oz. can of Rotel instead of the 28 oz Italian tomatoes, peas instead of green beans, 1 T. onion powder instead of onion (I was completely out of onion), 3 cups broth and 1 cup apple cider, no oil, no celery. Very forgiving soup base. I did use the 2.5 t. Italian seasoning, 2 large carrots, and 5 cloves garlic as written. I just dumped everything in the pot and simmered for 30 minutes. Also added 1 cup of spiral pasta about 10-12 minutes from the end. Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CA cook"
},
"reviewBody": "Oh so good! Thanks for a great recipe. I followed the directions (mostly); instead of green beans I added a can of light kidney beans and added a handful of little pasta for the last 8 minutes. I also put the garlic in at the beginning and sauteed it with the onion and celery.. I also had some fresh basil, chopped it coarsely and sprinkled it over the soup right before serving. I am already looking forward to leftovers tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eliza"
},
"reviewBody": "Made exactly has written. Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KEZ"
},
"reviewBody": "This smelt so good when cooking. To me minestrone isn't minestrone unless it has pasta in it so I added in some tiny shells about 10 minutes before the end of cooking. Other than that this is a great soup very flavourful. Thankyou Stormywoman."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StarlessClay"
},
"reviewBody": "Inexpensive, easy, healthy, filling, delicious! This is one of my all-time favorite recipes. The Italian seasoning and garlic give it loads of flavor, and it reheats perfectly. I usually end up having to add more liquid, and it's better if you cut down on the sweet potatoes and increase the other veggies a bit, but otherwise I make it just as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "missdrea"
},
"reviewBody": "This was okay. I felt it was a lttle too sweet for me but was glad I gave it a try. Just not as flavorful as I was expecting"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kandra Stephen Palmer"
},
"reviewBody": "This was a good base. We had to season it up a bit. We added about a cup of spinach the last 5 minutes. Really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Quite good as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KT Fish"
},
"reviewBody": "I really enjoyed this soup! It was great on a cold night. I kept to the recipe except I pureed the sweet potato. A soup I'm proud to serve my toddlers! Next time I'll cut down on the broth a bit and add more pureed sweet potato for a creamier texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ElenaW"
},
"reviewBody": "Love this soup! Full of veggies and flavor. The only soup that my picking kids will eat. Wonderful have on cold days!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "charlotte"
},
"reviewBody": "Had this over the weekend with my vegetarian friends and all enjoyed it very much.This will be a keeper.The sweet potatoes gave it just the right sweetness.Thank you to the person who first make it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bryan"
},
"reviewBody": "It was okay nothing spectacular, thanks for the try though my family did enjoy it and it is quite a healthy recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bo"
},
"reviewBody": "The broth was really tasty. I used one large sweet potato and any more would have been way too much. Definately could have used some beans, pasta or rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chell424"
},
"reviewBody": "We loved this! Even my kids enjoyed eating their vegetables when I made this! I did add some boneless, skinless chicken breast pieces to the pot, but otherwise followed the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaryLou"
},
"reviewBody": "This soup is so delicious!!! After reading the reviews, I too added some to beans. Thanks for the recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Sandler"
},
"reviewBody": "Everyone loved this! I added a little more garlic and a few drops of tabasco for an extra punch. It is loaded with vegies and anti-oxidants. My daughter couldn't stop eating this and said it was the best vegetable soup she ever ate! I loved it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Liane Ralston"
},
"reviewBody": "Really healthy. February 2011"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amyjune"
},
"reviewBody": "This was a big hit! I was short on many ingredients, but it still worked out well. Only had green onion, no celery, only had chicken broth on hand. I did not have italian seasoning so I just threw in whatever dried herbs I could find. This was seriously so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luv2teachu"
},
"reviewBody": "Loved this! So did my fiancé who doesn't like sweet potatoes. He ate two bowls. I microwaved the sweet potatoes for about 4 minutes and let them cool to make them easier to peel and cut. I also used chicken broth instead of vegetable. Next time I will cut the sweet potatoes into smaller chunks. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bernice Dray"
},
"reviewBody": "Excellent flavor and so easy to make. Was enjoyed by the whole family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kareno"
},
"reviewBody": "Really good, tasty, hearty. I added a can of rinsed kidney beans and served with cooked tiny pasta shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trevor Mehalik"
},
"reviewBody": "Brilliant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zestychef"
},
"reviewBody": "The best soup I ever made...though I don't think that's saying too much. ;-) It came out wonderful. I didn't know what \"Italian Seasoning\" meant, so I put in oregano, sage, thyme, and chervil. It was still wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marlakay"
},
"reviewBody": "I loved this! I'm not a huge fan of sweet potatoes (except in the form of PIE!), but they are so incredibly good for you, not to mention that they were only 16 cents a pound at Walmart before Thanksgiving. I've been trying out new ways to use them. This soup has been my favorite so far. The sweet potatoes absorb so much of the seasoning flavor, the actual sweet potato flavor was very subtle. I liked that. Like others, I added a can of beans (white beans) and about a cup of macaroni. Most of my family enjoyed it, too, but those who didn't are picky so they hardly count! Try this one. You won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Clarissa Spehl"
},
"reviewBody": "I added a little apple cider vinegar like some other reviewers and extra garlic (don't do that if you don't LOVE garlic-our family does). Fantastic. I was out of regular green beans the second time I made this, so I put in frozen mixed veggies. I was worried about the corn not meshing, but it turned out to make the dish. It was an extra crunch that I will be sure to use from now on. The second time I also subbed some of the broth for beef broth and it was even better than the first time. In the end, it was a really good recipe that ended up fantastic with some tweaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sally"
},
"reviewBody": "Delicious and just what I was looking for, a yummy vegetable soup with sweet potatoes. I did add a little sweet chili sauce (Mae Ploy is the kind I like). Just enough for a hint of heat. I also used a small can of tomato juice in place of one cup of the broth because I wanted to use it up. I think the combo of the sweet potatoes and the garlic really makes this soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yogimom"
},
"reviewBody": "Very tasty soup, especially on a cold Winter evening. I used olive oil rather than veg oil. I skipped the Italian seasoning. And I lessened the veg broth to 4 cups, to make it thicker and more stew like. It's really very hearty and yummy. Next time I will add beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dutchgirl"
},
"reviewBody": "We are in the middle of a blizzard today so this was my lunch choice. YUM! Followed the basic recipe. Substitued asparagus for the beans as that's what was in the fridge. Added a bit more celery, tossed in some cooked pasta at the end, tossed in a can of water chestnuts for a little crunch, threw in about a half cup of leftover chianti and a box of apple juice in addition to the chicken stock and the juice from the tomatoes. Nice flavor and texture. It's just what the doctor ordered!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Denise Soto"
},
"reviewBody": "I did like the sweetness of this dish. However, I made a few changes by adding chopped black olives and capers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "EPONINA"
},
"reviewBody": "Delicious! Only change is that I browned some Italian sausage in the pot before I added the onions. Also, I added the sweet potatoes after all the other veggies, as some others mentioned that the sweet potatoes cook a little faster. It turned out amazing, and even my 4 year old daughter asked for seconds. Thank you for this great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Guillotte"
},
"reviewBody": "Loved this, I love sweet potatoes, didn't miss the meat at all, I did add a can of beans to. can't wait to have the leftovers for lunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChristineM"
},
"reviewBody": "This is very good! I used about half vegetable stock, half turkey stock (made this after Thanksgiving) and since I was using leftover steamed green beans, I added them during the last ten minutes of cooking. I also used a Tuscan blend seasoning mix and I added a cup of whole wheat seashell pasta in the last ten minutes also. I was going to add some kidney beans, but held off. This made such a big batch that it would be easy to toss some in later to change things up a bit for a serving or two. Overall, I thought this was hearty but healthy, and very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica Higuera"
},
"reviewBody": "Absolutely delicious! And nutritious! Threw in pretty much anything I had (added mushrooms and quinoa during the final 30 minutes) and the soup was amazing. Note: I did not peel my potatoes and they were just fine. Thanks so much for the wonderful recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tania McCabe"
},
"reviewBody": "this was a delicious soup that was easy to make. I mashed the sweet potatoes a little when it was almost done cooking and the broth was nice and thick. Very hearty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bneherzog"
},
"reviewBody": "Yum! Fabulous with grilled cheese on rosemary bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin Walker"
},
"reviewBody": "I LOVE this soup! I don't use veg oil to sautee, instead I just use veggie stock &amp; I sautee the onions &amp; carrots, then add some more stock &amp; the beans (don't like them too hard) and then I add everything else. I also ADD about 1c barley &amp; 1/2 box ditilini (tiny soup pasta) and it's just hardier and soooo yummy! I also put about 4 sweet potatoes and make a larger batch so I can share with family and friends...they love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MandyLu"
},
"reviewBody": "My kids and I loved this soup! I'm not a sweet potato fan, and this is a nice savory way of getting those good vitamins in. Thanks! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Percy Lee Owen"
},
"reviewBody": "This is fantastic!! Literally, this is one of the better soup bases I've come across. Rather than using 28 ounces of diced tomatoes, I pureed a 14.5 ounce can of diced tomatoes instead. I needed to add about 1.5 teaspoons of salt at the end to get it properly seasoned. I think next time I'll add some corn and shell pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Realmom"
},
"reviewBody": "This is absolutely outstanding! Quite frankly, I was not expecting to like it; I only made it to use up some produce. It was exceptionally good-the sweetness of the sweet potatoes was terrific. The bonus was that it was so healthy I didn't have to feel guilty about eating it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannan Guilbeault de Blois"
},
"reviewBody": "This soup was really good! We just happened to have everything on hand. Threw everything in a pot and let the magic happen! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tori3"
},
"reviewBody": "Amazing! Thank you for the recipe:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkreeves"
},
"reviewBody": "Added noodles and cannelini beans as suggested by others. Used frozen green beans and left out the carrots. My 2 year old son enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "shelbriggs"
},
"reviewBody": "Didn't like the Italian seasonings with the sweet potatoes. Combo didn't work for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "afrikamommy"
},
"reviewBody": "I have to say this soup is great! Next time I will use some sort of noodle and possibly a bean but other than that fantastic. I took one of the reviewers advice and added a dash of chili powder. I also used veggie bouillon cubes with sea salt and herbs....DELISH!......no celery because I didn't have any and I used frozen green beans and only had one sweet on hand but there is still plenty. This recipe is very versatile and wonderful The big bonus is that my 19 month old loved loved the veggies out of the soup. Nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohsherry"
},
"reviewBody": "So good! I had never used sweet potatoes in a soup before, and I really enjoyed the flavor of this soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter"
},
"reviewBody": "I joined All Recipies just so I could comment on this recipie. My daughter is vegitarian so I am always looking for healthy recipies to make for her that we will all like. The closest thing I could find to \"Italian style tomatoes \" was canned tomatoes for brushetta but other than that I followed the recipie as written. Wow what an amazing healthy tasty hearty soup and its so easy to make. Thank you Pete"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "christine cochrane"
},
"reviewBody": "Even my 7 year old loved this. I added a little orzo pasta for him!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcjj"
},
"reviewBody": "Very inventive soup...easy to substitute or add whatever to. I found this trying to find a way to use up leftover sweetpotatoe. BTW: EASY SWEET POTATOE PEELING METHOD...Slice through the skin all the way around the potatoe at the middle. Kind of alike a sliced belt around the middle. Place in boiling water for about 20 minutes. Take one by one out and place right into a bowl of ice water. Once the skin is cool enough to touch it..pick up the potatoe at the slice and simply squeeze off the skin. Slipps right off and no peeling needed! Saves me tons of time in the kitchen when making any kind of boiled potatoe. Then you can just slice or dice for whatever dish or mash away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kyleandali"
},
"reviewBody": "This was good! I don't think I've ever had sweet potatoes in a soup before. I added some noodles and next time think I may add some beans to help balance out the sweetness. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larkspur"
},
"reviewBody": "This is a very healthy and tasty soup! I made it pretty much as written, except I used olive oil instead of vegetable oil, and regular tomatoes instead of Italian-style. Other than that, I didn't change a thing! This soup came out really well...I wasn't sure how I was going to like sweet potatoes in a tomato based soup, but I discovered that I LOVE it! Thanks so much for sharing this wonderfully tasty, hearty, healthy, and altogether delicious soup recipe! I'm definitely going to make it again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REFarns"
},
"reviewBody": "This soup is great. I made it for some kids I was watching, they were still eating when there mom walked in. I announced that the kids were eating sweet potato soup and her jaw dropped. Seems her kids 'hate' anything potato. Her daughter spoke up and said she only likes potatos in \"this soup\" and that is it! Followed the recipe to the 'T' save for adding beans and serving over rottini pasta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nevada mom"
},
"reviewBody": "Normally we do not like sweet potato but this soup is wonderful. The entire family likes it. It is filling low on the calorie count and I have yet to serve it anyone who did not ask for the recipe. I do add some cured ham chunks for my husband but it is good with our without the ham."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21013/sweet-potato-minestrone/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
"name": "Vegetable Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17305/soups-stews-and-chili/soup/vegetable-soup/sweet-potato-soup/",
"name": "Sweet Potato Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21013/sweet-potato-minestrone/",
"name": "Sweet Potato Minestrone"
}
}
]
}
}
, "about": [
]
}
]