				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Sweet Irish Bread"
,"datePublished": "2020-06-18T23:08:50.000-04:00"
,"dateModified": "2022-07-14T17:54:50.000-04:00"
,"author": [
{"@type": "Person"
,"name": "D Bagley"
,"url": "https://www.allrecipes.com/cook/24322437"
}
]
,"description": "A sweet breakfast bread with raisins that tastes most excellent toasted."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/IYiPUZOrhfaahvBVmcbAIi57bpc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/13870-011fef50f8174f1d929e786bf569579f.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Sweet Irish Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "40"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "323 kcal"
,"carbohydrateContent": "53 g"
,"cholesterolContent": "60 mg"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "124 mg"
,"sugarContent": "30 g"
,"fatContent": "11 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.25 cup butter",
"1 cup white sugar",
"2 eggs, beaten",
"2 cups all-purpose flour",
"0.5 teaspoon baking soda",
"1 teaspoon cream of tartar",
"1 pinch salt",
"1 cup sour cream",
"1 cup raisins" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan. I use a glass one."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the sour cream. Sift together the flour, baking soda, cream of tartar and salt; stir into the sour cream mixture until just blended. Fold in raisins. Transfer the batter to the prepared loaf pan."
} ,{
"@type": "HowToStep"
,"text": "Bake for 50 to 60 minutes in the preheated oven, or until a small knife inserted into the crown, comes out clean."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT75M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was outstanding. I added a tsp of vanilla, 1/2 cup of dried cranberries and a tbsp and a half of orange zest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Lewman"
},
"reviewBody": "This was SUPER easy and turned out great! I used greek yogurt instead of sour cream, half monk fruit sugar and half coconut sugar, added some vanilla, and used craisins. Per another user's issue, I baked it at 325F instead. The edges were still a little overdone, so I'll probably try 300 next time. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gloria"
},
"reviewBody": "I really liked this recipe and enjoyed the sweet bread filled with raisins. To that end I did add more than 1 cup of them. I also added 1 heaping teaspoon of vanilla. Next time I'm going to try vanilla yogurt instead of the sour cream. My only problem was in the baking section of the recipe. I did it in a glass pan on the lower oven rack for 55 min. It was getting too brown on the bottom but the knife was not coming out clean from the middle. I left it in a little longer. The middle was still a touch too soft and the bottom was too dark. It made the top hard and difficult to cut without it crumbling. I am not sure how to fix this issue with the recipe. But the flavor is still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arianna gaylord"
},
"reviewBody": "My family loved it and it Is good with hot tea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geipa"
},
"reviewBody": "I love this bread and have made it 3 times already. sweet and yummy. Followed recipe but added 1 tsp cinnamon the second time I made it. Made this for visiting family and they loved it also. Will be making this bread often, a definite keeper. Thanks so much for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Miller"
},
"reviewBody": "Do I love this sweet bread toasted. I followed the recipe as written, but used diced dried apricots and golden raisins to equal the 1 cup for the recipe and added a handful of chopped pecans. \n\nVery tasty and doesn't stick around my kitchen for very long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Miller"
},
"reviewBody": "Made this bread exactly as listed and waited for the next morning to try it toasted. YUMMY! As the title suggests, this is a sweet bread. I made it for a treat bread to be served on St. Patrick's Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Green Thimbles"
},
"reviewBody": "Friends and families alike have raved about this bread. I've tweaked a few things around to use what I had at hand. Here goes: fat free sour cream instead of the real one. Threw in other dried fruits I had stock instead of raisins. It worked out well. It is a tad bit dry, but oh so perfect to top it with jams, honey butter, and what have you. This is a keeper and inked in my cabinet! Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hmmohler"
},
"reviewBody": "Moist and sweet. I used golden raisins and cranberries. Also, I used 3/4 cup Greek yogurt instead of sour cream. I baked them in a bar pan for 45 minutes. These were delicious toasted and served with coffee the next morning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlene"
},
"reviewBody": "I made this today for the first time and my family loved it. We had corned beef, cabbage, carrots, potatoes and this bread. What a treat! The only change I made was using splenda instead of sugar. I used the same amount it called for. It turned out great! Will definitely make it again next year for St. Patrick's Day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nicoleguerrero"
},
"reviewBody": "As I'm typing this, it's baking right now; ten minutes ago, after an hour of baking, I inserted a knife through the crown as directed and it came out chunky and still dough-y. Just a second ago, after I added ten minutes, I did the same thing and it still didn't come out clean. I could already tell this bread would be tasty, but I think the time needed should be adjusted... unless it's just me. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "This is quite nice. Mine turned out a little dry, but we had custard with it and it was very nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonna"
},
"reviewBody": "This was such a simple and nice tasting bread. I left out the raisins and added cinnamon in the middle of the loaf for a swirl. Baked up nice and high. However, the first loaf I made I left out the baking soda and it came out flat and dense and a tad fudgy...so I tore it up and added the stuff to turn it into bread pudding and it was awesome:) Thanks for the recipe! It is great with coffee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "Recipe looks very simple, and from the reviews I have read, looks yummy as well, will try it today....St. Patrick's Day. Have been looking for an Irish sweet bread that is simple and doesn't have to rise, thought the soda bread recipes I have found online were not sweet enough, so will try this...wish me luck!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patricia OHara"
},
"reviewBody": "I made this tihinking my sister would like this so I added the raisins. She never even tasted it but I did. I loved the bread, I hate cooked raisins ( am a wee bit fussy), so next time I will omit the raisins. But I ate the whole bread by myself and told my brother about it. He has taken the recipe home with him so he can make it. Definitely a keeper. Thanks for sharing this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shweta"
},
"reviewBody": "Absolutely wonderful recipe ! I made the following changes : 1) Used 1 1/4 C of dried mixed fruit bits (apples, apricots, plums, cherries, raisins) and chopped dates, in place of just the raisins. 2) Added 1/2 C of toasted, coarsely chopped almonds. 3) Added 1 teaspoon of cardamom and 1teaspoon of ground ginger. 4) Baked it for 65 minutes. Just after taking the bread out of the oven, I loosened the bread from the pan and wrapped it in many layers of aluminum foil (in order to keep the moisture in). Tastes dense and cake-like, and is even better the next day. Yummy ! I am definitely going to make this many more times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FNChef"
},
"reviewBody": "A tasty quickbread recipe that is simple--both in preparation and flavor. I enjoyed the moistness of it...I used golden raisins, as it's what I prefer. For extra St Patty's Day color, I threw in a handful of white chocolate swirl chips (white and green... fished out the red/white swirl from Christmas!!) It was actually quite a hit with a few people... they also enjoyed the subtleness of the flavors. Just a good, moist quick bread. Not a regular, go-to recipe, just a nice change up. Happy to give it a shot again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "Amazing bread! My Grandma was Irish and made Sweet Irish Bread all the time. This is a good bread to eat any time of day and is good cold, warm, toasted, etc. Extremely moist and is also a good bread to make a Strata out of."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Breadsmith"
},
"reviewBody": "My mom loved this! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoseInOhio"
},
"reviewBody": "I made this sweet bread just the way the recipe called for...I changed nothing! It was wonderful! I will be passing this recipe down to my grandchildren!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Ann"
},
"reviewBody": "I was looking for a Irish soda bread recipe but saw this one and tried it first. I made it exactly as written except used lite sour cream. This bread is delicious and will be good toasted with a little butter on it. I think next time I will use less sugar , maybe 3/4 cup instead of the whole cup. This is a must for anyone that loves warm bread right out of the oven and would be great with a cup of hot tea. Very tasty , very moist.....5 stars Peggy Ann"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RockStarPrincess"
},
"reviewBody": "Delicious! Wonderful! I didn't have any sour cream so I substituted vanilla yogurt. I didn't have raisins either, so I put in dried blueberries. Sooo good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lov2cook"
},
"reviewBody": "It was good but I think it would be better if I used crasins instead of raisins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "I made this bread for St Patty's Day, and it was extremely easy to make! My family all loved it and have asked for the recipe. I will keep making this for years to come! I have to make it without raisins for one person, but it is still a yummy bread! Its great toasted, or if you let it sit for a bit, you can use it for french toast as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "genregypsy"
},
"reviewBody": "Not being a fan of sour cream, I was worried I would be able to taste it in the bread, and the slice I had warm out of the oven did taste a little like sour cream. However, the flavor actually improves a day or two after baking (stored in the refrigerator). Now I can't taste the sour cream at all--just delicious, hearty bread! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "wisweetp"
},
"reviewBody": "Very good. I had to substitute a couple of ingredients...did not have cream of tartar or sour cream and used baking powder and buttermilk instead. I also added a bit of vanilla extract. It turned out beautifully. This one's a keeper for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CyM"
},
"reviewBody": "Yummy Yummy Yummy\nThis was great. I used the Splenda baking blend and my family can't get enough of it. I don't bother sifting the ingredients; I just use a fork to stir. I've sifted and I can't tell a difference. It's a little time consuming, but definitely worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roxanne J.R."
},
"reviewBody": "I wanted a change from my old raisin bread recipe, plus I had sour cream that I wanted to use up so I was delighted to find this recipe. All I got to say is \"Wonderful!\" This bread isn't like your typical bread though...it came out moist sort of like a cake but it is so good! I added in 1/2 cup extra raisins to the batter cause I love raisins. I only made this bread last night and half of it is gone already! (That's alot considering it's just me and my dad eating!) It's really good with a glass of cold vanilla milk. I'll definitely be using this recipe in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "I also used the Vanilla yogert, but added a dash of vanilla extract and a tablespoon of cinnamon. I served it at work for St. Pat's day with icing on the side. Toasted, then spread with icing it was a big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hardrockgirl"
},
"reviewBody": "Absolutely wonderful bread. Not too sweet, and kinda reminds you of a nice sweet cornbread at the same time...raisins add an awesome flavor, too. I used light sour cream to save some fat &amp; calories, it is as moist as other sour cream cakes I have tried. This is a tasty recipe, try it, you will like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef Anel"
},
"reviewBody": "Considering you don't need yeast for this recipe, it turned out WONDERFUL! I had the kids help make it and they loved the end result. The entire bread was gone in one night. I hate bisquick so trust me that it doesn't come out like bisquick. Eat it warm with a pat of butter, great comfort food."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ESTEPHAN"
},
"reviewBody": "Very yummy. I used half the amount of butter and added some applesauce as a substitute, also low-fat sour cream and part whole wheat flour. This came out with a very nice flavor and texture -- I was surprised that such basic ingredients combined to have so much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MARMARL"
},
"reviewBody": "This tastes like BisQuik biscuits with a little sugar and raisins added. Nothing special, sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is absolutely delicious. I didn't have any sour cream or plain yogurt on hand, so I used vanilla yogurt instead. The result may have been sweeter than intended, but I think it's fantastic. The bread wound up sinking a bit in the middle, but the taste far outshadowed the appearance. Thank you so much. I'll definitely be making this again!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/47903/sweet-irish-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
"name": "Breakfast and Brunch"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
"name": "Breakfast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/47903/sweet-irish-bread/",
"name": "Sweet Irish Bread"
}
}
]
}
}
, "about": [
]
}
]