				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Syrian Bread"
,"datePublished": "2000-08-29T09:17:40.000-04:00"
,"dateModified": "2023-03-03T12:45:59.121-05:00"
,"author": [
{"@type": "Person"
,"name": "Sue Litster"
,"url": "https://www.allrecipes.com/cook/24328490"
}
]
,"description": "A versatile Middle Eastern-style flatbread that you can serve with lunch or dinner. Mix the dough in your bread machine or stand mixer."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9QVOVfoUnJOFfaSd-yfN3-FhOCo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1302898-55fad4da6aab4faa9f5f3071f3cb7be7.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Syrian Bread"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "136"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "204 kcal"
,"carbohydrateContent": "36 g"
,"fiberContent": "1 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "438 mg"
,"sugarContent": "0 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1.0625 cups water",
"2 tablespoons vegetable oil",
"0.5 teaspoon white sugar",
"1.5 teaspoons salt",
"3 cups all-purpose flour",
"1.5 teaspoons active dry yeast" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Dough cycle; press Start."
} ,{
"@type": "HowToStep"
,"text": "When the Dough cycle is almost complete, preheat the oven to 475 degrees F (245 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Turn dough out onto a lightly floured surface. Divide into eight equal pieces and form into rounds. Cover the rounds with a damp cloth and let rest."
} ,{
"@type": "HowToStep"
,"text": "Roll dough into thin flat circles, about 8 inches in diameter. Cook two at a time on preheated baking sheets or a baking stone until puffed up and golden brown, about 5 minutes. Repeat for remaining loaves."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT180M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg Inch"
},
"reviewBody": "Delicious! ...and not real difficult"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adriannaV"
},
"reviewBody": "I love this recipe it was simple and easy to follow"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bionicstarsteel"
},
"reviewBody": "I used a ratio of two thirds whole-wheat flour and one third all-purpose and the bread still turned out very well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mia Fox"
},
"reviewBody": "Three stars because this is a decent pita recipe but it is most definitely not Syrian bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Palen King"
},
"reviewBody": "So easy! My young daughter and I loved the experience and the end result!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Litster"
},
"reviewBody": "This was my mom’s, Sue Litster’s, recipe. She passed away last year (2017). I wish I could convey how important this bread is to our family. It is at every family holiday get together, every potluck, and at every weekly family gathering. Mom, I miss you. I didn’t know you posted the recipe here. I did a search for ‘Syrian bread’ and your recipe was the number one search result. Thank you. I now can make this bread and carry on the tradition. It is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "saramarie123"
},
"reviewBody": "I have made this bread about a dozen times now using the exact directions except I cook it at 500 degrees and of course I use my preheated baking stone. I have used both instant and active dry yeast. The active dry is denser and the instant is fluffier. My husband is from Syria and says it tastes exactly like the bread served in the high end restaurants. He’s over the moon excited every time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "I made this for a Syrian friend and she loved it! She suggested after baking to cover it with a damp towel. That made the bread very soft and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gourmette"
},
"reviewBody": "Great job, Sue."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rdearing"
},
"reviewBody": "I made this bread for my family, and we all loved it. I will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Majid"
},
"reviewBody": "Simple in terms of ingredients, moderate in terms of work, but worth every minute."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I am very glad to find this recipe. These are just like the bread we get at a local Mediterranean restaurant, and I made them to pair with bowls of Greek lemon chicken rice soup. The changes I made were to use bread flour (instead of all-purpose), and I did not use a bread machine. I mixed the ingredients in my countertop mixer for about 7 minutes using the dough hook. Once mixed, I drizzled a little oil along the sides of the bowl, turned the dough to coat, and let the dough stand to rise for an hour at room temperature. I then turned the dough out on a lightly floured surface, kneaded a few more minutes by hand, and divided into 8 equal segments. I covered the dough with a towel to let it rest for about 15-20 minutes, then I started to roll out the rounds into 6-8\" circles using a rolling pin. I placed two circles at a time on a pizza stone I had heating in the oven. Per the recommendations of other reviewers, I heated the oven to 500 degrees. Using a long pair of tongs, I turned the first few circles over half-way through the five minute baking time, but did not do so for the last several circles. Turning them over did not make much difference. I will definitely use this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jesspet"
},
"reviewBody": "This recipe is very easy and so good. I have made this bread twice and mixed the dough in the food processor. The first time I used half white flour and half whole wheat and this time I used all whole wheat. I divided the dough into 12 pieces and baked on a pizza stone. All but one puffed beautifully. This really is a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suegibson1960"
},
"reviewBody": "This is so easy and turned out great!!! I'll be making this again. I gave one to my Palestinian friend and he loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GeeQTmom"
},
"reviewBody": "I made homemade hummus and was looking for a recipe to use it with. I found this Syrian bread. So easy in bread machine, and smells delicious when baking. Used a pizza stone, 475*, flipped and took out before too brown. Nice chew, but tender. Enjoyed it waaaayyyy more than the disappointing hummus I ended up making and throwing away. Served bread as a pita pocket with tuna salad, only sandwich fixing I had here. Big hit! Will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "porcelina831"
},
"reviewBody": "Very good recipe and perfectly authentic. The flour/salt/sugar ratios are spot-on. I wanted to wait before reviewing to make sure I wasn't doing something wrong with the recipe. I've made this many, many times and the bread always comes out just a little too tough. No, I'm not kneading too much. I do make sure to cook just under the time recommended or else on day two it is a little too crispy and breaks easily. I will continue to use this recipe though as I'm sure it is the best. As a side note- this is more like Lebanese bread. Syrian bread would be kept in a slightly flattened ball and baked for about an hour and turn out more like a crusty dinner roll. Both are delicious though. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chloe Jane"
},
"reviewBody": "Best flat bread recipe I've encountered!! It was so exciting to see the little loafs in the oven puffing up! Some were soft and some were a bit crunchy after we broke into them. I rolled them in parm and chopped up some basil in some."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "Pressed for time, and wanting to use this crust for individual pizzas, I mixed everything up in my KitchenAid® mixer. After letting the dough rise I made 8 pizza crusts and cooked them on an electric griddle. They worked great for the purpose I wanted them. I topped them to make 'Pineapple Jalapeño Pizza' from AR. A great recipe that I know I will use again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie List"
},
"reviewBody": "I cooked at 550 was great. My thin pan cooked the bottoms more than I liked so I flipped with one minute to go. The air pans worked great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandra Benth Moldenhauer"
},
"reviewBody": "I make syrian/lebanese bread all the time but pat it into rounds the size of a tennis ball then I use a rolling pin making dough thin and edges thin. I use my hands and wrists (like tossing pizza dough) stretching and tossing to desired thinness, dusting it lightly with flour then \"bake\" it on an electric griddle til bubbles appear brown, turn and bake other side til lightly brown bubbles appear. This takes only a few seconds. I then stack them between two dishtowels until all dough is used up and let them cool before packaging into plastic bags. Much easier than the hot oven. We love the flat type of bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Lemonakis"
},
"reviewBody": "I previously left a rave review about this but thought everyone would enjoy this little bit of \"serendipity\". We make these about every two weeks because we love them so much! I throw the ingredients into the bread machine and go to the gym. When I get home the dough is ready. Last time, by accident....I hit the WRONG button on the machine. I baked it!!!! LOL! It looked okay so I sliced it and used it for breakfast toast. It didn't have a lot of \"flavor\" but it made a nice white loaf of bread that was fine with some butter and apple butter and/or jam. I used the rest for bread crumbs by processing them in my food processor. So even though I made a mistake, this was STILL a fantastic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lou"
},
"reviewBody": "Easy &amp; Yummy!\nI made this exactly as stated, using a bread machine. The loaves came out well. They weren't all exactly round, but I certainly didn't care. They tasted delicious! This was quite simple, even with the rolling of the pieces. I hope anyone who reads this recipe tries it once!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bianca Morgan"
},
"reviewBody": "Incredible! These turned out just like the ones at our favorite Middle-Eastern restaurants. I followed the recipe exactly, but did everything by hand since I don't have a bread machine. My husband and I LOVED these! I will make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shanna Fagan"
},
"reviewBody": "Now, I'll admit, I have no clue what Syrian bread is. I have never heard of it before, but it was one of the results that came up when I searched for \"pita bread\" so that's what I'm rating this as. I goofed and used 1tsp sugar and only 1/2 tsp stalt, but the results were still good. My bread machine is the LeftHandRightHand model, so I proofed the yeast in warm water with the sugar and added the flour, oil and salt in a little bit at a time. After the dough had pulled together, I kneaded it on a floured board for about 10 mins before putting it in a lightly oiled bowl, covering it, and letting it rise for about a hour (and WOW did it rise!). I followed the rest of the directions as written and was quite happy with the results. Only one of the 8 pieces did not puff up. Easy and fun to make. Will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "YehuditO"
},
"reviewBody": "This was great! I needed to add more water + a bit more oil in order to make the dough pliable, as it was very dry prior to that addition. Delicious and simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "oumhurayra the frenchie"
},
"reviewBody": "thanks a lot it's very easy and very gooooood!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CheeryWazel"
},
"reviewBody": "These were yummy. The salt tasted wonderful against the rest of the ingredients, like the sugar. I had trouble finding a good baking time though. I cooked them a bit longer and they were kind of crispy. You could still cut most of them and find a pocket. One though was a thin crisp piece in the middle. I thought they looked better with brown heat marks on them, but if I would have left them the whiter color after the end of 5 minutes I think they would have been more soft like bread. But I couldn't tell if they were done so I baked them longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DoggieGirl"
},
"reviewBody": "this makes a great pita bread. I use it and add different bread spices to give it different flavor. I use a rolling pin when I want a big pocket and when I'm just looking for a flat bread I hand press it. It also makes a great pizza crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sdbooker"
},
"reviewBody": "Very good texture and taste. Dreamy with butter and honey! I did however, change the salt to 3/4 and sugar to 1-1/2tbs. I also made the dough into small round circles as directed but made half with a rolling pin and half by manipulating the dough with my hands. The half made by the rolling pins had hugh puffiness but the half made by hand raised just perfect without a hugh puff. Wil make wonderful bread for small pizzas but I'm eating thess tonight with Peanut Ginger Chicken from this board, Allrecipes, should make the perfect meal, thanks for posting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chloe"
},
"reviewBody": "this bread works perfectly every time. i've tried varieties with part whole wheat flour, some with oat bran, i've put various herbs in the dough...all delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Staci Cain-Carter"
},
"reviewBody": "Used half ap and half wheat flours. Turned out great! Cant wait to make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "solberg2141"
},
"reviewBody": "I made these to go with some italian sausage soup. I brushed with a little italian seasoned garlic butter and sprinkled with parmesan cheese. Not a traditional pita, I know, but they were fabulous! We were eating them warm right out of the oven! yummy! I used leftover pitas for pizza crusts for my kids' lunch. Perfect to let them \"decorate\" their own and carry it to the oven. love this bread idea...so versatile!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "keff"
},
"reviewBody": "It's regular Pita Bread and to name it Syrian Bread is just simple way to HIJACK Common Mediterranean Bread and to make it specifically Syrian.\n\nNow, about the Pita Bread itself what make it more Syrian is the fact that the Syrian makes it specially thin so to make balls of 4 OZ each will gives you More tasty Pita Bread with more Body, which will hold the juices from salads and other ingredients you will stuff it with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "farmermike"
},
"reviewBody": "This is a great recipe as I used to get homemade Syrian bread regularly from my brother's mother-in-law. She is Syrian.\nI increased the sugar to 1 TBS and kept everything else the same as far as ingredients were concerned.\nAt baking time I only divided the dough into 6 pieces rather than the suggested 8.\nAs had been mentioned about the bread not browning on the bottom, I used mesh pizza rounds that allow the heat to penetrate the bottom of pizza crusts. This worked beautifully to solve the problem of under down bottoms and no need to turn bread during baking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linmacken"
},
"reviewBody": "These were great. I made these with the Moroccan Tagine recipe from this site. Fantastic!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redheadedwonder11"
},
"reviewBody": "Yum! I made these exactly as written and they turned out fabulous. I might have to add some garlic to them when I make them again to make them even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacie McMullen"
},
"reviewBody": "Loved it- just like the Afghan restaraunt my husband and I like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Willms"
},
"reviewBody": "Awsome bread!! My family was amazed that I had make this myself! I doubled the batch and we even had them toasted the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ccampbell23"
},
"reviewBody": "Very good dough. Used them to make Lebanese meat pies with a filling recipe from chucklingpigblog.\n\nThey are AMAZING!!! you have to try these... you will not be sorry.\n\nthe filling recipe may seem a bit odd to some newcomers to Lebanese food, but it is one of the best things ever.\n\nThere is a bakery here in Fall River Ma. called Sam's bakery that sells these meat pies almost exclusively and they make a killing!! It is the most popular thing around, and for good reason.\n\nI can't stress enough how good they are.... and apparently easy to make. We have been buying these since I was a little boy, and if I had know the recipe and how (fairly) easy they are to make, I would have been making them as much as possible. Look up \"Sam's Bakery\" in Fall River, Ma. 02721 and see what people are saying about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHRISTA920"
},
"reviewBody": "Loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maddenba"
},
"reviewBody": "This bread was excellent. So easy and quick, and much more rewarding than buying it. I liked that it was a little more crispy and thin than store-bought. I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa "
},
"reviewBody": "Thank you for posting this. I am Arabic and this is the same recipe my Grandmother and Mother used. I leave out the oil and still get excellent results. I also used this recipe for pizza on the grill, meat pies. It also freezes very well. Teresa"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BJREEVE"
},
"reviewBody": "Fun and easy, and they taste great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erica"
},
"reviewBody": "Excellent, easy to do recipe. I used half white and half wheat flour. Turned out great. Will definately make this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Soshi"
},
"reviewBody": "AMAZING! I thought the dough would be too heavy after it had processed, but it was not. It was perfect. I got the pocket effect with little effort. AMAZING! I am so happy for this recipe. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieB"
},
"reviewBody": "OMG! Sooooo Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "D.J."
},
"reviewBody": "Well, let me say...this recipe deserves 5 stars if I were rating it for pita bread. I was in search of true syrian bread, or at least what our area calls syrian bread. The dough was wonderful to work with and I will be using it again just not as \"syrian bread.\" One last thing, I do not have a bread machine so I did it in my kitchenaid and by hand. Unless this may have caused the bread to turn out differently. Otherwise I followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Christine Shaver"
},
"reviewBody": "Not bad but keeps turning out a bit tough and chewy. Could be because I don't have a bread maker. Tried using less water but to no avail. It is still good though and does puff up nicely."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "Very easy, very nice. Several of mine puffed up like pita bread but the rest didn't. I'm not exactly sure why--maybe the thinness of the puffier ones had something to do with it? It's a very easy and simple bread, and I think it would work well with 1/2 ww flour as well. I may try that next time. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noura"
},
"reviewBody": "this is a great recipe! i've been adding mahlab (ground cherry pits) to the dough to give it an extra authentic flavor. you can find mahlab at international or arabic grocery stores. i also tried making the recipe using wheat flour. it doesn't come out quite as nice and fluffy, and the loaves didn't puff as they should. it was still good, but not as good as with white flour. if you use wheat flour, i would suggest using the full amount of salt. i decrease the salt to 1 t. when making it with white flour, but the wheat flour needs the whole 1.5t to make it taste better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Theresa"
},
"reviewBody": "Everyone else loves it so I must have just messed up. The dough came out of the bread machine too sticky and the loaves don't open well. I will have to try again tomorrow. Maybe I will use bread flour instead of all purpose and canola oil instead of olive"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "iman"
},
"reviewBody": "It tasted ok but it was tricky to get them to puff up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmyBear"
},
"reviewBody": "It tasted alright, but it's tricky to get them to puff up and not burn. Second batch was better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alejandra"
},
"reviewBody": "i loved this bread.although it tasted like the flour tortillas made by the tortilla's flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RoseRover"
},
"reviewBody": "I was quite satisfied with the results. Not all of the pitas puffed up uniformly, but that's error on my part, not the recipe's. I made the dough by hand as I don't have a bread machine. UPDATE: Made them again, every one of them puffed up. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Irene Y"
},
"reviewBody": "I would rate this higher, but I found that the bread was way too crispy when I cooked it at the time/temperature stated. After the first few, I cooked the bread for only 4 minutes and that did the trick. I think even less time or lower temp (my oven runs hot) would work for a soft, more 'foldable' bread. BTW I made the bread by hand and it worked great. Proofed the yeast in warm water with sugar for about 15 minutes, added the oil, and then the dry ingredients. I kneaded for about 10 minutes and let the dough rise for about 30-40 minutes. Then, baked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "queenvalerie"
},
"reviewBody": "Great recipe! After reading reviews I set the oven at 500, and then flipped the loaves at 2-3 mins to brown both sides. Really fantastic. THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zeze_74"
},
"reviewBody": "I did it, but i had some few tips which i think are required for this recipe: 1- dough should be left to raise for at least one hour before dividing it into 8 pieces, and another one hour after that. 2- put you oven temperature on BROIL 10-15 min BEFORE you start baking. 3- try should be adjusted in the middle of the oven. 4- through the bread dough into your flat tray, close the oven door, and wait for 2-3 minutes only. Bread should be puff and done by then. if you let it for more than 5 mins , i'll become crunchy. 5- At the end, when you take out the bread , but it over a kitchen towel/napkin, and cover it with another towel.. DO NOT put it into the plastic bags before it bocomes at room tempreture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRSLYNN"
},
"reviewBody": "Awesome recipe! We like to jazz it up a bit, sometimes before baking it we'll brush on melted garlic butter and sprinkle with parm cheese. Great for dipping in pasta dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie"
},
"reviewBody": "Great recipe! I used whole wheat flour instead of white and I don't have a bread machine so I just made it by hand and even though my fire alarm went off for the first batch, they still tasted great! I love how they puff up and you can cut them in half and stuff them with whatever you like! I like tuna with hot pepper, so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOUCH73"
},
"reviewBody": "excellent as is.......... A definite keeper"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yasmeena"
},
"reviewBody": "we loved how it tastes..but it's kinds hard? should it be that way?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "emo"
},
"reviewBody": "Really good and really easy. I'm just planning on using a little spice next time, like roasted garlic cloves or fresh herbs or something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rachel M."
},
"reviewBody": "Delicious! Made it to go with Hummus III on this site. I used Rapid-Rise yeast, and it worked just fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacykr"
},
"reviewBody": "These were a hit! Having a baking stone made things much easier than fidgeting w/ baking pans. The pizza stone preheated (on 500 degrees) as the dough was being made. We flipped the bread over after about 2 minutes to brown on the opposite side. Any longer &amp; the bread would become crispy instead of chewy. Froze beautifully. Rave reviews – can’t wait to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raechel"
},
"reviewBody": "These were great! I too am not a lucky girl with a bread machine, so I mixed the yeast with the water first, then added it to the wet ingredients and added the dry ones to that, and kneaded it by hand (about 7 or 8 minutes). Instead of the vegetable oil, I used 1 tablespoon of applesauce and 1 of olive oil, to keep the fat down and nutrition up. I also used white whole-wheat flour, as I am trying to bake with more whole grains, and this gave the finished rounds a nice \"earthy\" flavor without too much \"grainy\" flavor. I tried the paper-thin rolling approach, but settled on a bit thicker piece, poked all over with a fork as I like a flatbread more than a pocket bread. They came out wonderfully soft and delicious, and have had rave reviews from friends...awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coral"
},
"reviewBody": "I made it completely by hand since I don't have a bread maker. It was very easy and we love it. My Boyfriend even says he likes it better than naan bread! The dough was fun to play with too.. it reminded me of play dough from when I was a kid!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "QuebecGirl"
},
"reviewBody": "This is a keeper, even my husband who does not like bread told me he liked this one. I served it with roasted garlic in olive oil. I tried different shapes, a barely stretch mini loaf worked best for me. I find that using bread flour gives better results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momi"
},
"reviewBody": "This bread is delicious! Bye-bye store bought pita bread! I used 2 1/2 cups bread flour, 1/2 cup whole wheat flour and used garlic salt. I let the dough balls \"rest\" for 5-10 minutes before rolling them out. I baked mine on an oven stone. We filled our pita pockets with falafel, cucumbers, tomatoes and tahini dressing. Thanks for the recipe, Sue!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noor"
},
"reviewBody": "I have thrown out all other recipes for pita bread and put this one! This bread does not disappoint! I don't have a bread machine, so I just kneaded it until smooth, oiled it a little and let it rise about an hour an a half before finishing it following the recipe. My family loved it and the kids were so cute with their little noses pressed to the oven window watching it puff up like a balloon, they got a real kick out of that! Thanks for the great recipe! One tip I did was to put my oven on 500, the hotter, the better, and after it puffed up like a balloon, flipped it on the other side so it could brown a little for another half minute or so before removing it. Otherwise, the first piece didn't brown at all on top and I thought it looked prettier with some browning on both sides. If you leave it too long to brown, it will start to toast and get crunchy so be careful of that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Gagnon"
},
"reviewBody": "This recipe is so good. Before adding the olive oil I sauteed minced garlic until browned and added it to the dough.\nAwesome Awesome Awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shawn"
},
"reviewBody": "this is awesome I will never buy store bought again, the only thing I wish I knew was does the dough freezer well or the bread it self? I will be making this a lot. thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen Johnson"
},
"reviewBody": "This recipe turned out great. I used 1 cup of wheat flour since I ran out of white flour and I baked for 4 minutes instead of 5 and they turned out so soft and yummy! I cant wait to serve them to guests!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Karen Martin"
},
"reviewBody": "This bread was easy to make using my breadmaker and worked out great for my Indian dinner since I coulnd't find a quick recipe for naan on this website. It also worked very well sliced thinly in half and then into wedges and toasted for dipping crackers. I found it a little tough, but maybe that's the way it's supposed to be or maybe I overworked the dough when rolling out (I'm not an expert bread maker). I also found it a little bland, like it needed more salt or a more3= flavorful oil. This was not a problem on the first night I served it since it accompanied very heavily spiced Indian food and was more of a utensil. The following day, however, I used it as garlic bread for leftover spaghetti and I noticed the lack of flavor (plus it doesn't absorb butter very well, so it got pretty messy!). I think this bread will be limited to very specific uses for me so I won't make very often. I would also like to try to cut the recipe in half (it made too much bread for 2 people to get through quickly) but I don't know if that's possible since I'm not too knowledgeable about bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewMommy101"
},
"reviewBody": "Growing up one of our favorite treats was my grandmothers homemade syrian bread. I enjoyed making this recipe, thinking of her... The taste and aroma in the house brought back memories! I overcooked them a bit, but will try them again, making larger loaves. Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ms~sunshine"
},
"reviewBody": "This was very good. I used one cup of wheat flour and two cups all purpose and it came out perfectly. Not as traditional but still just as good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Sullivan"
},
"reviewBody": "I made this with the curry coconut chicken recipe. Everyone loved it. Easy to make. Will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann Davis"
},
"reviewBody": "This is delicious. I just came back from visiting my daughter in Ohio and the Whole Foods there had a restaurant type area. Among the foods prepared was pizza made with flatbread. When I got home, I was looking for a recipe to duplicate that, and this is the recipe. I bake the breads 5 minutes and then either put a topping on it and bake until melted or just break the bread in pieces and toast it with my morning coffee. What a versatile recipe. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FUFARFITA"
},
"reviewBody": "This is a great recipe and so simple. Goes well with Hummus and even goes nicely with non mediterranean dishes. (like chicken salad) wouldn't change a thing with the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JONIRENE"
},
"reviewBody": "Easy to make. Tastes better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennw/4"
},
"reviewBody": "Simply, deliciously awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "I sometimes poke holes in the dough right before I bake it if I don't want it to be puffed up. And if I want it to be a softer bread, I will not cook it quite as long."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "moroccantreasuresdotcom"
},
"reviewBody": "Easy to make, first bread I have ever made! Just needed to know how long to let it rise. Tastes great, looks pretty as well. Went out and bought 25lbs of flour today and will make this a regular bread for our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TwoDCsPlus1"
},
"reviewBody": "This recipe was great, and really easy to make. I had a little trouble with my breadmaker, which made my dough really runny for some reason, and I had to end up adding more flour. These tasted fantastic with home made hummus!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Lee Ferrare"
},
"reviewBody": "Super easy and so authentic! Absolutely loved it! Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenInCalifornia"
},
"reviewBody": "Wow, this bread was amazing. I'm terrible at bread, but this was very easy and so authentic. We loved it, thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "A great pita bread! Goes great with the Curried Coconut Chicken on this site. Yummy and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elegant Chef"
},
"reviewBody": "I love this recipe!!! It was amazingly simple to make ddespite the fact that I do not have a bread maker and had to knead the dough by hand. Because I am an ameture bread baker I was also unsure of how long to let the dough rise and rest but I winged it and it came out perfect. Thank you so much for this recipe !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRETCH1978"
},
"reviewBody": "Outstanding. Thank you for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ahmad Ghosheh"
},
"reviewBody": "This is the best one for pita bread. I am an Arab and I tried to make the bread for a long time without success until this recipe. This is as good as the store bought one. The only thing is that home ovens just don't have the high and even heat needed to cook the bread quickly to golden brown without drying it. So I cook it until it is just begining to brown then take it out while it is still moist. When I want to eat one loaf, I use a toaster oven to heat it and brown it quickly. Also the toaster oven will repop it for the stuffing to go in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We have tried various middle eastern bread recipes and this was the easiest and tasted good. it is plain all by itself, but dipped in some good sauces it was wonderful. next time we might try topping it with a tiny bit of butter and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee"
},
"reviewBody": "Bread was very tasty! My family loved it. It was very similar to my sister in law's, who happens to be Syrian. Only problem I had was with huge air bubbles. After I had made them, my SIL told me to pierce the top of the bread with a fork, all over, before baking them. I will do it next time, and I know they will be perfect then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dasvid"
},
"reviewBody": "Excellent recipe. Tasted better then store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SUNYA94"
},
"reviewBody": "This recipe is GREAT! It is very easy. My mother-in-law is Lebanese, and my husband craves her syrian bread. He couldn't tell the difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is easy and very delicious. My kids love it and my husband too. Why bother with store bought?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used to make syian bread the old fashioned way with my grandmother as a child. Now I can make it in less than half the time and I can keep the tradition going. I took some to my grandmother and she couldn't tell the difference. Thanks!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe!! Next time I make this, I will lessen the amount of salt added to 1/2 t. I thought 1 1/2 t salt was a little much. Also, I had to keep mine in the oven for longer tnan 5 min to give the bread color. And, instead of making 8 small circles, why not make one as large as the pizza stone I use and just cut pieces to serve to guests. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AUNTPT"
},
"reviewBody": "Excellent!! I make a lot of different kinds of breads but I haven't tried a flat bread like this before. Next time I think I will make the sections smaller so I can take them to work for potlucks. The flavor and texture was very good. Thank you!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I love this bread! I orginally made it for a cultural presentations I was doing, but I like it so much that I am going to have to make it again! Oh and I found out adding extra sugar (what a wonderful accident lol) makes it taste even better to me!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/20834/syrian-bread/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
"name": "Yeast Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
"name": "Flat Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/20834/syrian-bread/",
"name": "Syrian Bread"
}
}
]
}
}
, "about": [
]
}
]