				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Taco Bake I"
,"datePublished": "1999-10-08T16:30:55.000-04:00"
,"dateModified": "2022-07-14T17:58:20.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Leslie"
,"url": "https://www.allrecipes.com/cook/24325647"
}
]
,"description": "Browned ground beef mixed with dried taco seasoning is layered in a casserole with canned refried beans and salsa. It is topped with shredded Monterey Jack cheese and baked for 20 to 25 minutes."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/cdHkMT5KNuT_N_ick5p7Ci7sowc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1124863-828d7702a1b14e32ab311335978c9f49.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Taco Bake I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "353"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "413 kcal"
,"carbohydrateContent": "15 g"
,"cholesterolContent": "94 mg"
,"fiberContent": "4 g"
,"proteinContent": "26 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "1037 mg"
,"sugarContent": "3 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 pounds lean ground beef",
"1 (1.25 ounce) package taco seasoning mix",
"1 (16 ounce) can refried beans",
"1 (16 ounce) jar salsa",
"2 cups shredded Monterey Jack cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (160 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a large, heavy skillet over medium-high heat, brown ground beef, and drain fat. Mix in dry taco seasoning."
} ,{
"@type": "HowToStep"
,"text": "Spoon browned meat into a 9x13 inch glass baking dish. Spoon a layer of refried beans over meat, then salsa. Top with shredded cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake about 20 to 25 minutes in the preheated oven."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RonGoings"
},
"reviewBody": "Made several changes. Added half cooked rice, pinto beans with jalapenos, venison instead of beef, corn tortilla chips, bbq sauce instead of salsa and cheddar cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I LOVE this! I LOVE all these ingredients. I “invented” this dish a few years ago to take to a family party, as a dip, and used tortilla chips on the side. I LOVE tomatoes, so I cut little pieces of tomatoes and put on the top layer, on top of the melted cheese. I also used Rotel tomatoes mixed in with the ground meat. I mixed in Salsa with the refried beans. My elderly aunts are so snooty and think I could never prepare a dish even close to their standards. Well, they all sat around the table eating it up, wanting to know who made this dish, what is name of it and where did I get the recipe. I told them some crazy name for the dish. The looked so puzzled and said I never heard to that…me either…no, I haven’t either. I was so happy. This dish was gone at the beginning of the party. I’m going to make it tonight. It’s so yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JackiG"
},
"reviewBody": "I made it and topped the salsa with tater tots then the shredded cheese. So hearty... I also added green chili’s to the ground beef. Delicious. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetthang1864"
},
"reviewBody": "So easy and delicious! I didn't brown the top that much because I will be reheating the leftovers in the oven, so they'll brown more then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KMayday"
},
"reviewBody": "Pressed for time for a yummy dinner... this is a great go to! It was so yummy and can add sliced avacado on top when serving!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jame Sealey"
},
"reviewBody": "Great starter recipe! I added rice to my taco meat and used about 1/4 jar of salsa. I also spread the beans on tortillas as my bottom layer. My family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mimir59"
},
"reviewBody": "Very tasty!! I would have liked a little something extra in there, I’ll experiment with it and enjoy doing so."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "Made this for Father’s Day and it was a hit! I added corn and green chilies to it because my husband likes those. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrh"
},
"reviewBody": "I used the taco seasoning recipe on here vs store bought pkg, as one reviewer suggested, as my husband has to watch his sodium intake. Used ground turkey and Had black beans left over from another recipe so layered those on top of of ground turkey . Lined the balking dish with corn tortillas I baked for about 15 min until they were crunchy and it was a wonderful and tastee meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "geneadelle"
},
"reviewBody": "So simple.......ingredients very healthy....no bad carbs. Family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Matt Miles"
},
"reviewBody": "I just made this last night on a whim. While it is easy to make and very filling it's pretty basic and doesn't really have enough going on as far as taste goes. However it becomes exceptionally good with a few simple and cheap additions. I would suggest adding a layer of saffron rice over the beans before baking, and then topping the finished product with diced tomatoes and sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie C."
},
"reviewBody": "Made this for NYE. It was a success. Served with tortilla chips. Only issue I had was I forgot to get the picture.\nMade it again for the Superbowl. My family loves to eat this as a dip with tortilla chip scoops. I added some shredded lettuce to top their scoops and it was so good!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyMom"
},
"reviewBody": "This was very good. I made this to bring to a friends. I increased the servings to 10 which was 2 lbs of ground beef. I added 2 full cans of diced tomatoes &amp; 2 packs of taco mix &amp; increased the water. Not much of a change. I omitted the sour cream because my Husband &amp; I don't like it. Served Tostito scoops on the side. Came our great &amp; everyone liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ziggymoonunit"
},
"reviewBody": "It was good, it was easy. I wanted a little more kick so I only used half the salsa called for and added hot taco sauce. I garnished with romaine lettuce and black olives. It was missing something. I can't put my finger on it, but it was."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorayan1b"
},
"reviewBody": "AMAZING TASTE and EASY to make A+++++++++++++++++++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lluvbear"
},
"reviewBody": "I made it just like it said.....but I served it with a lot of extras---shredded lettuce, diced fresh tomatoes, black olives, fresh avacado, sour cream! So delightful with all the trimmings! Like a taco in a casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sngr4sball23"
},
"reviewBody": "This was a hit! I added crumbled tortilla chips. Also, I topped it with lettuce after baking. It was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Salena Blackburn Potter"
},
"reviewBody": "Easy to make and delicious! Boys loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimnic"
},
"reviewBody": "good quick and easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joann Lai"
},
"reviewBody": "Delicious, I just mixed everything instead of layering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DiningDiva"
},
"reviewBody": "This was great! I included a layer of cilantro lime rice before the salsa, and the bottom layer was corn tortillas with re-fried beans on them. Next time I will mix the beans and beef, they were hard to spread. This went quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMMS001"
},
"reviewBody": "I make this all the time but I add a container of sour cream to the top and serve with \"Scoop\" tortilla chips. We call it Mexican Dish. It's great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Cashdollar"
},
"reviewBody": "This was yummy! I served it with tortillas to make it more of a meal rather than a dip. Very messy to eat but so worth it. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "singlemomcooking"
},
"reviewBody": "I used ground turkey, light colby jack cheese and fat free refried beans to lighten it up. Since I was baby sitting a friends kids I let them use this as a dip with multigrain totsitios. It was tasty but I was at a loss as to what to serve with it. I will use it as a hot dip but itsn't practicle as a main dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DAISYCRAZY88"
},
"reviewBody": "I made this last night and the whole family loved it. I did make a couple of changes: I added a layer of crushed up tortilla chips on the bottom, then the meat. I also combined the salsa with the beans and added some cheese, then spooned it over the meat. I topped it with the remaining cheese and bake until the cheese browns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Very good and very easy! My kids love to eat this with tortilla chips and my husband with rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beadfxr"
},
"reviewBody": "Excellent dish. This dish is excellent as it is, but I think you can make it seem different by adding to it. Next time I may add rice or corn or add black beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AnAngelsKiss"
},
"reviewBody": "One of my kids does not like salsa and another does not like tomatoes. So I secretly mixed about 1/2 cup to 2 cans of beans before spreading beans over beef. I added corn across top of cheese (to give a veggie) and crushed tortilla chips after baking on top of casserole. I placed guacamole and sour cream additional salsa for options of who wanted. This was so simple and great this recipe is going to my box."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meganmcintyre"
},
"reviewBody": "AWESOME quick recipe! Served it with the Tostido Scoops."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danni Skaricki"
},
"reviewBody": "My husband loves this since he is usually on a low carb diet. :) The kids and I also love it and usually mix it with some rice and put it on tortillas. It is good as written but you can jazz it up. My kids love corn in it and kidney beans instead of the refried for a change. Either way- this is good and easy and makes a filling meal with leftovers. If you don't want to put the rice in the casserole- just serve it with Spanish Rice and Taco fixings on the side. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rex Hutcheson"
},
"reviewBody": "8-30-11: Pretty good, but heavy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HeisLord"
},
"reviewBody": "Wish I could give this recipe more than 5 stars! I had thawed out my hamburger, planning on having a family favorite recipe, and then realized that I was missing an ingredient.. It wasn't too long before my husband would be home, and I had a really hungry 18 year old, who had also just come home from work. What to do?! I got on Allrecipes web site, and found this recipe, and I had all the ingredients! Everyone was agreeable, and so away we went! The only changes I made, were to tear up a tortilla and put it at the bottom, then put 1/2 the meat. I only had a 28 oz. can of refried beans, and I used nearly the whole can. I put a layer of beans, then the salsa. I got 2 layers in my dish, and topped it with a mixture of cheddar and mozz. We loved it! My son went back for seconds, and he took more on the 2nd time than he did the first! My husband at his, and then ate what I couldn't eat. Our son is taking all of the leftovers to work today. This is definitely a keeper, and thank you to whoever posted this recipe! You saved my bacon, so to speak, and we really love it, and will be making it again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Butler"
},
"reviewBody": "I did make a few changes however. I put a box of Jiffy@ cornbread in and bake it first then put all ingredients over the cornbread. Then i substituted American Cheese Slices for shredded pepper jack(I was out). Was very flavorful and added picante sauce when served. Everyone loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rock_lobster"
},
"reviewBody": "Taco Bake I Haiku: \"Pretty sloppy meal. But wow did it taste awesome! (Serve with rice or chips.)\" This was a really liquid-ey, difficult dish to serve, so when I make it again, I'd plan on eating it over rice, or crumbled tortilla chips, or maybe scooped w/ a slotted spoon into tortillas. I used refried BLACK beans, a mexi-blend of cheese, and added a little sauteed garlic and onions to the meat. No major additions or substitutions, so I feel confident in calling this recipe an easy, tasty, (albeit, messy) dinner that I'd gladly prepare again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "I added crushed chips, sour cream and guacamole. Very easy to make, which is nice after busy day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "VictoriaSe49896"
},
"reviewBody": "I made this tonight because my family is eating low carb. My husband liked this, my son thought it was ok and I was not impressed. There is certainly something missing and this needs more seasoning. Perhaps some cornbread dumplings on top and more seasonings would make this better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Means"
},
"reviewBody": "I added some corn and used cheddar cheese. Very good. Served with chips. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C_WHITES_"
},
"reviewBody": "I halved this recipe and made it in an 8x8 pan. My family really enjoyed it. We used it with soft shell tacos."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mumkim"
},
"reviewBody": "This was really great and SUPER easy! Like throw together in a minute easy!!! Served on warmed tortillas or over nacho chips! Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "nothing spectacular. good way to empty the pantry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drea Drea "
},
"reviewBody": "This was very good and very quick. The only thing I did different was not adding the salsa until after it cooked. I dont care for warm salsa, just a personal choice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cpmcgill"
},
"reviewBody": "I used ground turkey and refried beans with Jalapenos. I then had garnishes of tomatoes, lettuce, onions, sour cream, and black olives with Jalapenos, on the side. I laid out chips and flour tortillas, and let everyone choose to use the dish as a dip, as a burrito, or as nachos. They loved it! Everyone was happy and full! I also used the Taco Seasoning I on this site. I have a feeling that this recipe is going to be another favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sinyuhkjing"
},
"reviewBody": "I put jalapenos on mine and it was great served with tortilla chips. I made a taco salad out of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jameeb"
},
"reviewBody": "This was good - but almost better as a dip than a meal. We ate it with tortilla chips and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kristin84"
},
"reviewBody": "It was real good. I used taco sauce instead of salsa. next time will use salsa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reginab"
},
"reviewBody": "A very quick, easy and yummy recipe. This is a nice twist to our usual Taco Tuesday dinner. I added a can of corn and some black olives, which I will do again next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sigmasuperstar"
},
"reviewBody": "Very simple to make, my hubby and sons ate it all!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monaco"
},
"reviewBody": "Made this as part of South Beach phase one diet. It was delicious and low carb. Added canned green chiles to the beef for extra spice. Served with a salad. Yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Langead"
},
"reviewBody": "Yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bonnette McNichol Lepley"
},
"reviewBody": "I only had a pound of ground beef so used that and only had about a half a jar of salsa so used that all too. We all really enjoyed this. I bought the Scoops and placed the filling in each scoop and topped with cheddar and heated in the oven to melt the cheese. We all loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pegmus"
},
"reviewBody": "I love to try new recipes rather than making the same dishes over and over. There is a joke in my house that if my family says they like it, then I don't do it again (of course that is not true). My husband said this last night after the first bite! It was wonderful! The only change I made was to spray the bottom of the pan with olive oil spray and then put two tortillas on the bottom and spread the beans on top (as someone had suggested), spread half the meat, then the salsa, and repeated the layers. Put the cheese on top. I will be adding this to my own \"recipe\" book! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amanda J."
},
"reviewBody": "Good, simple and homey feeling food. Tasted to me just like the inside of a burrito, but the whole family loved it. I served it with Mexican Bean Salad from this site that is loaded with corn and bell peppers so it was a nice combination. Thanks for the recipe :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loves2Share"
},
"reviewBody": "This was great! I was low on dinner supplies but this totally fit what I had! I didn't include the refried beans because I didn't have any, but it was still great- possibly better b/c my husband isn't a huge r.f. bean fan. I served it with tortilla chips, but tried it with just a fork too- either way is great. Reheated well too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TINACABINA"
},
"reviewBody": "Based on another reviewer addition, I also added rice. Plus I tossed in a can of corn. It was incredible the way my family liked it! I served it with both tortillas (for burrito style) and blue corn tortilla chips."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Iheartgnomes"
},
"reviewBody": "This was quick, easy, and tasty. Will definitely try adding a rice layer next time we make this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MostAwesomeChefEver"
},
"reviewBody": "I give this a four star rating for chip dip, but this is not an entree by any means. Yummy chip dip though :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JamieW"
},
"reviewBody": "Easy, cheap and yummy! I made a few changes...I mixed all the ingredients together plus added olives and corn and used black beans instead of refried (to make it more healthy). I lined the bottom of the pan with tortillas then I layered with my \"mixture\". It was a big hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "I Love Troy"
},
"reviewBody": "This was so easy! I made mine a little healthier by 1 pound of ground chicken mixed with one can of corn (drained) instead of the beef, used fat free refried beans, and on 1 cup of reduced fat cheese. Although it was runnier than I anticipated, it was still very tasty :) I also added some onion and made my own taco seasoning (less salt). We ate this with tortillas kinda like a burrito. Rice would be a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "millertime"
},
"reviewBody": "we had this a few nights ago. it was ok just ok. would i make it again probably not. i made it as written the only thing we did differant was i made our own taco seasoning from this site. the dish was way easy to make and the flavor was ok. it seems to be lacking something is it worth trying to tweek nope!!! will not be making again. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlin"
},
"reviewBody": "This is absolutely delicious, healthy, fast and SO simple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CNM CATERING"
},
"reviewBody": "We loved this! The only change I made was to use Taco Seasoning 1 by Bill Echols from this site because I dont use package taco seasoning anymore. Quick and easy! I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel22"
},
"reviewBody": "We loved this, even my 2 year old eat this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yummy!"
},
"reviewBody": "I loved the ease of few ingredients and quick time to cook it in. We made tacos and burritos. Next time we will take the leftovers and make nachoes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Slagle Gent"
},
"reviewBody": "A very quick and filling app. I put pickled jalapenos on the top as \"decoration.\" This is even better the next day. I usually scoop the leftovers into taco shells, and eat it like a soft taco topped with cheese and sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "queenofthekitchen"
},
"reviewBody": "This receipe is alright, though nothing fantastic or creative. It's basically taco dip. I found it really helpfull to make as a full meal by adding two cups frozen corn, and layering with tortilla chips before baking. Makes a WONDERfull texmex casserole."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Hayton"
},
"reviewBody": "So easy! Very delicious. I might serve it with some sour cream next time. Great heated up for a left over lunch the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vanessa"
},
"reviewBody": "quick and easy, cheap ingredients. made some spanish rice and added a layer of that on the bottom, served with tortilla chips. very nice meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "very good! There were no leftovers. Our son doesn't normally like refried beans. He was even shocked in liked it that much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "swimminash"
},
"reviewBody": "Nice alternative to traditional tacos. I used ground turkey, browned it my cast iron skillet, drained the fat, and layered all the ingredients over the meat. Then I baked it all in the same skillet. It was a very nice one-dish meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Flynn Hendrick"
},
"reviewBody": "really quick, easy and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "love1616"
},
"reviewBody": "i made this about 4 hours ago and it was amazing straight out of the oven and just as good warmed up in the microwave my mom loves it! i added more cheese and toped it with sour cream and tomatoes. its good as thick dip or by its self with crushed corn chips! 5 out of 5!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brook Waddell"
},
"reviewBody": "Nice and easy recipe. Don't think you can go wrong. Perhaps next time I'll add some onions and sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JKL"
},
"reviewBody": "Great basic recipe - i used black beans instead of refrieds, added sauteed onions and green peppers and rotel. used as a filling for burritos. yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phr0glegs"
},
"reviewBody": "Really good! This was excellent. I served sour cream on the side and as another reviewer suggested, made my own taco seasoning similar to \"Taco Seasoning 1\". A little spicy that way but most of us love spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Est10865"
},
"reviewBody": "eww! I, nor did my family, care for this dish. It was low in the taste factor and the visual appeal didn't rate much higher. Perhaps, it could be used for a dip, but not a main dish. I won't fix this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy Krause"
},
"reviewBody": "My whole family liked this recipe. We ate it in tortilla shells, as a dip with chips, or just plain. It was good with sour cream on it as well. I doubled the beans though. Easy and tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KATEMUR"
},
"reviewBody": "One of our favorites. I add a canned spanish rice (sounds weird, but works great, just be sure to drain a little) and black beans. I also saute some onions and garlic before adding the meat. We eat it with tortillas, fast and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nina"
},
"reviewBody": "This recipe was supposed to be an easy, inexpensive meal for my boyfriend and I one lazy tuesday night, and it turned into his favorite meal!!! He is a huge taco/burrito/nacho fan, and after eating this dish two nights in a row, he confessed that if we could have this readily available in the freezer, he would never go to another mexican resturant again!!\nI just had to write and say how helful the other reviewers were, as I opted to mix the meat, rice, salsa, and cheese together and then bake (rather than layering). We ate the mix in a soft tortilla shell as a burrito, and also with chips as nachos to eat the next night.\nI never thought such a simple meal would turn into a household favorite...but it was really a huge hit! Thanks for reminding me I don't need a 20-ingredient meal to make a delicious dinner. What a relief!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JEM5383"
},
"reviewBody": "My hubby and I love this, we have it aleast once a week. Tastes like a taco but so much easier to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ginger"
},
"reviewBody": "Very very good. Would need a side if serving company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "minders"
},
"reviewBody": "My husband and I loved this recipe!! We really like spicy food, so we added some crushed red peppers while browning the meat, then after we layered in the ingredients, sprinkled some Texas Pete on top before the cheese was added. We also left out the beans, and serve it with the Fritos \"scoops\" as sort of a dip! One time we were out of ground turkey, so we used sausage! Delicious!! One of our weekly meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary K"
},
"reviewBody": "SUPER easy and very good. Easy to manipulate to make it spicy or mild based on inividual preferences. I used the Taco Seasoning recipe from this site, mixed the beef and beans together in the skillet and then layered it on top of some tortilla chips in the bottom of an 8x8 dish. Topped it with teh salsa and a 4 cheese mexican blend and it couldn't have been easier! Served with sour cream and it was devoured during dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SILENCE182"
},
"reviewBody": "My husband raved about this recipe and it was easy to make! I served it in tortillas with some fresh lettuce and taco sauce. Next time I'll add even more fresh toppings!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellybean1046"
},
"reviewBody": "this is the most awesome thing ever. my husband asks me to make this all the time! We use it as dip with chips, it's awesome"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon Pedigo Skaggs"
},
"reviewBody": "Great recipe! I didn;t bake as directed, but I will in the winter months. Instead, I saudeed everything and made into burritos. Wonderfully tasty, and hubby loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "angelinstl"
},
"reviewBody": "Great recipe. The kids loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelley Lyn"
},
"reviewBody": "Simple and tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brendareed"
},
"reviewBody": "wonderful and easy to fix. i add onion and hot pepper to it. great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rolanda"
},
"reviewBody": "My son loves this recipe. The first couple times I made it as the recipe as is then I changed a few things which made it way better. One, more meat is definitely needed at least 2 or 2.5 lbs to offset the other ingredients. After browning the meat and adding the seasoning, I mix in half the can of refried beans,half of the salsa, and some of the cheese (you can add more or less of these ingredients according to your liking and how much meat you used). Then I mix it on the stovetop melting the cheese. I put the meat mixture in the pan (w/o the cheese) and bake it about 20 minutes, then add some cheese to the top layer and bake the last ten minutes so the cheese on top isn't burned. To me this is way better than layers. The flavors blend together very well. I definitely prefer this way better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ChicoGirl"
},
"reviewBody": "I absolutely loved this! It's almost too easy and good to be true. I'm pregnant, and I'm craving mexican food on a daily basis so having the leftovers was pure bliss. I have a feeling this will be my little boy's favorite once he gets here :-) Thanks for the delicious recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Gilli"
},
"reviewBody": "Great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inkble"
},
"reviewBody": "Very, very good and easy to make! I used a 9x9 pan, an extra can of beans and extra cheese. A perfect meal for 4 people!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "teri11"
},
"reviewBody": "Definitely delicious as a dip. As soon as I scooped it onto the plates, my husband wanted some chips to eat with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "This is so delicious! My family gets so excited when I make this and the whole thing gets eaten every time! I changed just a few things. I added a 1/2 onion, finely chopped to the ground beef as it was browning, an extra can of refried beans and only 1/2 a jar of salsa and make it in a 9X9 pan. This amount is good for a family of 4. For more people, add 1 lb of ground beef, use 2 taco seasoning packets, 1 jar of salsa, 1 onion, make it in a 9X13 dish &amp; always use lots of cheese!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Evergreen Queen"
},
"reviewBody": "This is a really good recipe but not 5 stars. I served it as an appetizer for 3 people with chips one day and used the leftovers with lettuce,tomatoes and sauce rolled into tortillas the next day for lunch. Yummy! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erin Shiflett"
},
"reviewBody": "Good. See note."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Dahl"
},
"reviewBody": "This was great! I put the beans on the bottom layer and added extra taco seasoning to the beef. I served it with sour cream, chips, and lettuce. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim"
},
"reviewBody": "Loved this recipe!! Great for a snack or covered dish party.\n\nMy husband raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becki J"
},
"reviewBody": "we thought this was good as a dip for chips. Did not think it was as good as a cassarole type/main entree. I will add a layer of guacamole next time I make as a dip."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14651/taco-bake-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
"name": "Dips and Spreads Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14651/taco-bake-i/",
"name": "Taco Bake I"
}
}
]
}
}
, "about": [
]
}
]