				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tempeh Mock Tuna Salad"
,"datePublished": "2020-03-09T22:51:16.000-04:00"
,"dateModified": "2020-03-09T22:51:16.000-04:00"
,"author": [
{"@type": "Person"
,"name": "bibliobubba"
,"url": "https://www.allrecipes.com/cook/2368594"
}
]
,"description": "This flavorful mock tuna salad is made with tempeh soy protein and soy mayonnaise, a real vegetarian treat. Serve it as a salad filling or on fresh greens."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/bBRWstJK3ZUSvXfMcS10yaFVRjo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/889788-93c88be4eac445c6a4437822977d262c.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tempeh Mock Tuna Salad"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "30"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "128 kcal"
,"carbohydrateContent": "8 g"
,"cholesterolContent": "3 mg"
,"fiberContent": "1 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "677 mg"
,"sugarContent": "2 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2 cups vegetable broth",
"1 (8 ounce) package tempeh",
"2 tablespoons soy sauce",
"2 tablespoons lemon juice",
"1 clove garlic, minced",
"1 tablespoon seaweed flakes or granules",
"0.5 cup minced red onion",
"1 cup chopped celery",
"1 cup chopped dill pickles",
"0.25 cup soy mayonnaise" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the broth to a light boil over medium-high heat. Add the tempeh to the broth, and simmer for 25 minutes. Drain and let cool to room temperature for 15 minutes. Once cooled, grate tempeh into a large bowl."
} ,{
"@type": "HowToStep"
,"text": "In a small bowl, whisk together the soy sauce, lemon juice, garlic, and seaweed flakes. Pour the seaweed mixture in with the grated tempeh and stir until well mixed. Mix in the red onion, celery, and dill pickles. Toss with the mayonnaise. This salad can be served immediately, but is best when chilled for several hours to allow the flavors to blend."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Olivia Palacio"
},
"reviewBody": "Made this ahead of time for a camping trip. I replace the soy sauce with liquid amino. It was a fantastic easy lunch on the road."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Chung Ryder"
},
"reviewBody": "I've been making this for 5 years and it's always a hit with everyone I've served it to. First question is always \"what's tempeh?\" :) but they happily enjoy it. Tempeh is fermented whole soybeans, and an awesome whole food packed full of phytonutrients.\n\nA few adjustments:\n*I use water instead of broth, there's enough flavor with the rest of the ingredients that I save our broth (and $$$)\n*I also include lemon zest since it adds a fresh vibrancy and there's also a lot of nutrients in citrus peel that we don't normally get into us\n*I don't use a cup of pickles but chop up as many as I'd like, typically just a couple will do (the crunch and salt comes naturally from the celery which I definitely use a cup of, or 5 stalks)\n*For the tempeh, I simply chop it up into little cubes (looks like feta) or simply crumble up once cooled\n*I also throw everything into one container in whatever order (cooled and crumbled tempeh goes in last) \n\nI've also started to add fresh chopped purple cabbage since it's a cruciferous and packed full of great antioxidants. And it also makes the overall salad/mix a lot prettier. The added crunch it provides is also a great addition. \n\nOverall, this dish is nutrient-dense and delicious as a sandwich, with crackers, mixed with arugula or spinach, or on its own (which our toddler loves). Thanks Bibliobubby for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Baby Whisperer"
},
"reviewBody": "I did not have seaweed flakes, so I left that out, and used relish for the pickle. I also added lots of black pepper. The tempeh grated easily. I let the mixture sit overnight in the frig before eating to let the flavors mingle. Made a sandwich with lettuce and tomato, wow! Really great! My husband, who is new to vegan, loved it and asked me to make more so he could have it through the week! A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SaEofDoom"
},
"reviewBody": "I've always hated fish but for some reason have been craving my mom's tuna fish sandwiches from childhood. I omitted the seaweed flakes as I don't like fishy flavors (I know, I know...supposed to be tuna), reduced the soy sauce to 1.5 tbsp, used some dill relish with the liquids strained out in lieu of pickles, and used light mayo. I broke the tempeh apart with my hands instead of grating it which was easier. This would also be great using mashed chickpeas instead of tempeh. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "judithfunny55"
},
"reviewBody": "This totally satisfied my vegetarian urge to eat meat. I skipped the seaweed and it was still delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nottoyield"
},
"reviewBody": "I'm a vegetarian, but I do miss eating tuna salad. I made a few alterations (I don't like celery, so I used cucumbers instead, and I doubled the mayo). The result was perfect! Served over fresh-from-the-oven ciabatta bread, and I'm in heaven. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vee"
},
"reviewBody": "Yum. This was great. Made it for my son to pack for lunch. He liked it so much he asked me to make two sandwiches!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa"
},
"reviewBody": "I can't believe how good this is! I accidentally added a cup of veganaise and thought it had a great creamy texture. My husband, a tuna hater, loved this. Thanks for the recipe, it's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BikramFan"
},
"reviewBody": "Just made this for dinner tonight. I was amazed by how much this tastes and looks like the real thing. This recipe is a keeper. I will definitely be making this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VeggieGal"
},
"reviewBody": "YUM!! I will confess... I had my doubts about this while I was putting it together. I played around with the recipe a bit - using sweet pickles instead of dill, adding chopped carrots for extra crunch, and skipping the seaweed, simply because I didn't have any at home (tho I might get some now simply for this recipe!) This is great straight out of the bowl, and I'm sure it will only get better as the flavors meld. I'm planning to enjoy a big scoop of this on top of a green salad... YUM! Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allison Shauger"
},
"reviewBody": "Pretty good. I added chopped radishes because I had a ton of them from farmers' market. I also substituted capers for the pickles because I had no pickles. I added freshly ground pepper. It seems a tiny bit runny, so I might adjust the mayo/dressing or try using a little oil instead of mayo next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bibliobubba"
},
"reviewBody": "I'm glad so many people liked this recipe. Thank you very much for your comments. The recipe is very easy to modify; for example, if you prefer pickle relish or bread and butter pickles to dill, you can certainly substitute. I have also added green pepper for extra crunch, as well as kalamata olives. Additionally...I myself don't like mayonnaise, so I substitute 1/4 c. olive oil. I just tried pulsing the tempeh in a food processor after simmering it and before adding the other ingredients. The texture is smoother that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wilma Laura Wiggins"
},
"reviewBody": "Very nice substitute for mercury-laden tuna. Cooking the tempeh in the broth first is important, and I used fish sauce instead of soy sauce. I think next time I will add some fish sauce and seaweed to the broth to add a little more sea flavor. Adding chopped boiled egg makes it seem even more realistic (to me)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MOLLYES"
},
"reviewBody": "This was excellent--everyone who tried it loved it, even my meat and potatoes friends. I didn't add the mayo because I didn't have it--just used a tiny bit of oil to help bind it. Also, it was a little too salty, but I'll just cut back on the soy sauce a bit next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cyclical"
},
"reviewBody": "So yummy!! I've been craving tuna but not all the mercury so this was absolutely amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "COURTWOLF"
},
"reviewBody": "this wasn't too bad. it is not really a good substitution for tuna salad in my opinion. i prefer preparing tempeh in other ways - like with bbq sauce on a sandwich or in a stir fry with pepper sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EMILYAAA"
},
"reviewBody": "this was my first experience with Tempeh (i could only find the 5 grain kind, so that's what i used) and it was delicious! I was sure it was going to be too funky for my 2 and 3 year olds to eat, but i added it to our \"tuna\" melts and they ate it up! I'm not a vegan, so i just used real mayo, which was just fine. And i didn't have celery, so i added cucumber--great texture! I'm a big believer in eating fermented foods, and now this is a fun addition to my recipe box! thanks for this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Chartier"
},
"reviewBody": "This was just \"meh\" for me. Not a fan of celery in things, so not sure why I didn't omit them to begin with. Did remind me of tuna salad though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juliemay7"
},
"reviewBody": "This is so good it took willpower not to eat the whole batch as soon as I made it! I was going to make half a batch and save the rest of the tempeh, but as soon as I tasted it I threw the rest of the tempeh in and made the whole batch. I used to enjoy tuna salad a lot, and this is every bit as good. I didn't have any seaweed, so I sprinkled some Old Bay on the tempeh after it was done cooking; and I reduced the soy sauce by about half, but other than that followed the recipe closely, and I think I may like this even better than real tuna salad! It's nice and filling too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ypsirenee"
},
"reviewBody": "Ok, let me just say that I added too much of the mayo dressing, so I decided to add more veggies. I added shredded carrot, some green onion, and finely diced red pepper. YUM!!! I'll definitely make this again, only with less mayo. Thanks for the yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Quelyn"
},
"reviewBody": "I've been a Vegetarian for 5 years and I've been looking for a good replacement for Tuna for Tuna Melts. I used this recipe to make some Mock Tuna Salad and some Tuna Melts. I thought it was very good. The taste was good &amp; the sandwhiches were great. It wasn't really a good substitute for straight up Tuna, but it was a good one for Tuna Salad. It takes a while to prepare so I'm not sure how often I would make this, but overall very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb Glinsmann"
},
"reviewBody": "Love this recipe a friend told that if you like organic carrot juice use the pulp instead of the temph makes a nice change with a bit less picle. Tastes just as good with no carrot waste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen"
},
"reviewBody": "YUM. Seriously delicious, even without the celery (although the consistency is a bit runny because of that omission. who cares about that!?!?). I also decreased the amount of dill pickle, since I thought a cup was overkill. Next time I'll be adding a little curry, just for kicks. I didn't bother grating the tempeh but just chunked it - it naturally fell apart during the cooking process. I used vegetable bouillon plus water instead of broth and then added cracked pepper at the very end, before I let it sit in the fridge for a couple hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Parjata"
},
"reviewBody": "Fantastic! I followed the recipe almost exactly, except used a bit more tempeh and mayo. The taste and texture are convincingly close to the real thing. Perfect for those who like tuna salad but would rather avoid tuna because of mercury, dolphins, overfishing, etc..."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/141768/tempeh-mock-tuna-salad/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/408/salad/seafood-salad/",
"name": "Seafood Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2809/salad/seafood-salad/tuna-salad/",
"name": "Tuna Salad Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/141768/tempeh-mock-tuna-salad/",
"name": "Tempeh Mock Tuna Salad"
}
}
]
}
}
, "about": [
]
}
]