				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Teriyaki and Pineapple Chicken"
,"datePublished": "2019-04-02T02:45:47.000-04:00"
,"dateModified": "2019-04-02T02:45:47.000-04:00"
,"author": [
{"@type": "Person"
,"name": "HEZZZ1223"
,"url": "https://www.allrecipes.com/cook/707222"
}
]
,"description": "Bell peppers, pineapple, mushrooms, and chicken combine to make a hearty main dish that also tastes great as leftovers."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1CPbebKjfmYnsesvk3Yrl5ydKNk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1852286-47865162224941619cefdf1c6119f9c9.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Teriyaki and Pineapple Chicken"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "317"
}
,"cookTime": "PT25M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "187 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "35 mg"
,"fiberContent": "2 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "1413 mg"
,"sugarContent": "11 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 tablespoons vegetable oil",
"1 pound skinless, boneless chicken breasts, cut into cubes",
"1 green bell pepper, sliced thin",
"1 yellow bell pepper, sliced thin",
"1 red bell pepper, sliced thin",
"1.25 cups sliced fresh mushrooms",
"1 onion, chopped",
"1 cup teriyaki sauce",
"1 (8 ounce) can pineapple chunks, undrained",
"1 teaspoon garlic powder",
"1 teaspoon crushed red pepper",
"0.25 cup all-purpose flour" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat the oil in a wok or large skillet over medium-high heat. Cook the chicken until no longer pink in the center and the juices run clear, 7 to 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Place the green bell pepper, yellow bell pepper, red bell pepper, mushrooms, onion, teriyaki sauce, pineapple chunks with the juice, garlic powder, and crushed red pepper into the wok, and turn the heat to medium. Bring to a simmer, stir in the flour, and continue simmering 15 minutes until thickened."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT40M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "marion"
},
"reviewBody": "Followed the recipe but the teriyaki sauce made it so salty I couldn’t eat it. Next time I would probably cut the teriyaki sauce to a quarter cup and maybe use some chicken broth in place of the liquid. It has potential. Love all the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I used pork instead of chicken but either would be good. I also only fixed 1/2 of the sauce and used corn starch instead of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tkw1130"
},
"reviewBody": "Really good. Husband said it can make in regular rotation! Flavor close to sweet and sour chicken. I added full can of pineapple as I am a fan, followed rest of recipe as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hiveof5"
},
"reviewBody": "I marinated thin, boneless breasts in teriyaki sauce and cooked them on the grill. Cooked other ingredients in large frying pan, eliminated green pepper and used fresh garlic instead of powder. Layered cooked chicken in large serving bowl and poured all the sauce on top"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookee"
},
"reviewBody": "This is absolutely scrumptious. I made my own homemade teriyaki sauce and served it over ice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Drake Adams"
},
"reviewBody": "Delicious! Next time I’m going to add cashews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bzy-mom"
},
"reviewBody": "Great recipe! The only change I made was I halved the flour. I didn’t feel that it was too much sauce like some of the reviews stated. We loved it and will make it again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Tarpley Bilyeu"
},
"reviewBody": "It was a winner! I did add Sriracha to give it some pep, but got great feedback."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glenn-O"
},
"reviewBody": "Very good. I actually served it in the pineapple skin after slicing it in half long ways and carving out the pineapple to use. Have to remove the core, of course. A little bit of work, but it makes a nice presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Van Steen"
},
"reviewBody": "So delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Phil Clowes"
},
"reviewBody": "As with any recipe, I always find myself tweaking it a bit. I marinated the meat for 20 minutes in a soy and sesame oil with garlic marinade. \n\nStarted with putting the crushed garlic with red pepper flakes in oil first to season the oil. Cooked the chicken and removed it from the pan. Added my veggies which was comprised of orange and yellow peppers, carrots, onion, and broccoli. Sauted them a bit before adding Kikkoman Teriyaki Sauce - this is very salty. I cut the salt by adding half a can of the canned pineapple juice, reserving the other half for a slurry of pineapple juice and 3T corn starch. Combined the cooked chicken for 15 minutes with the slurry and canned pineapple. \n\nTurned out really great. My only suggestion is to add a touch of fresh ginger. Served over Jasmine rice. Yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie"
},
"reviewBody": "It was great, made it exact and will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "amelia"
},
"reviewBody": "Very good stir fry. I will make it again but I will cook the sauce separate and then pour it over before serving. The sauce was too thick and hard to stir so it stuck to the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ladybug"
},
"reviewBody": "Delicious, no changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sookar"
},
"reviewBody": "I made it without pineapples. Changed a few things but came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Adrienne Orlando"
},
"reviewBody": "This is second time I'm making this. I made a few changes to my liking. I omitted the green pepper and mushrooms (not a fan of them) and the garlic powder. Every thing else the same. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Eileen L. Pierre"
},
"reviewBody": "I thought the recipe had a variety of different peppers in it. It was very good .. the only change i made is i did'nt use as many mushrooms as asked for and i used a cut up pineapple instead of canned pineapple plus i didn't have crushed red pepper so instead i used Cayenne Pepper also.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Desiree"
},
"reviewBody": "Great base meal to build off!\nI added snow peas, cauliflower, broccoli, carrots, and leftover asparagus. I also added fresh pineapple juice and soy sauce to the sauce base to thin it out a bit and cut the strong teriyaki flavour. Left out the flour, not needed. My boyfriend said it's his new favourite meal! Served it in the shells from my pineapple I cut up for a fun alternative to regular dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Monica"
},
"reviewBody": "This is a great recipe! I did reduce the sauce to .75 of a cup of teriyaki sauce and put less flour, but everything else was kept the same. Loved the dish, but next time i will make it a little spicier to make it more sweet and spicy to my preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Renee Z"
},
"reviewBody": "Really good! I served it over brown rice. I added broccoli. I made one mistake. I put more than a cup of teriyaki sauce. It was to much sauce. I know better next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stoly"
},
"reviewBody": "I made this for my husband for Valentine's Day and he loved it! I did make some changes just to suit his personal taste. I used fresh pineapple rather than canned since I served it to him in the hollowed out pineapple. I left out the mushrooms and only used red bell peppers. At the end I made a slurry of cornstarch and water to thicken rather than using flour. I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pineappleexpress"
},
"reviewBody": "This is wonderful! For my own palette preferences and after reading reviews, I made a few adjustments. \n* Used a fresh pineapple instead of canned....I cut the pineapple so I could use it as a bowl to serve the meal in. It was a pain to scoop the pineapple out but worth it for A BEAUTIFUL PRESENTATION! *I used only green peppers. \n *I marinated my chicken in Teriaki sauce for an hour or so. \n* Once it was simmering, a taste test revealed it was too salty for my liking....so instead of adding sugar like others have suggested, I added honey. Maybe 2 tbsp.\n*I felt the sauce had a decent consistency, so I added flour but only by spoonfuls until it looked like the right thickness.. I don't think you need 1/4c. At least I didn't....perhaps because I used fresh pineapple and didn't have he juice from the can to add to my recipe.\n*Also, added a bit minced ginger root. \n*Added a bit more red pepper flakes. Some suggested they omitted it completely because it was too spicy. Guess it all depends on what you consider spicy but adding a tad more was a great decision.\n*Served with a side of brown rice\n\nThis is a delicious meal....not healthiest but I made it for a special occasion.\n\nThe ONLY thing I feel that I could have done differently to make this tastier, was to wait to put the pineapple chunks in...maybe simmer the last five minutes. Couldn't taste the pineapple as it was soaked with Teriaki sauce. So I think adding it at the end may allow the pineapple flavor to stand o"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Moluvjoe"
},
"reviewBody": "Way too spicy. Lol. Next time, we'll sprinkle the red pepper flakes towards the end. The meal was very good, even with our mouths on fire. Can't wait to try it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "marjohnal"
},
"reviewBody": "Pretty good. Chicken was very moist. Only criticism is it was a bit salty because of the teriyaki sauce. I served over quinoa which added a nice crunch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "francine lemasurier"
},
"reviewBody": "I followed the recipe as is, except for substituting 3 cloves of finely chopped garlic for the garlic powder"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lexie Helstrom"
},
"reviewBody": "I've made this twice now, the first time I used fresh veggies and the second time I used frozen stir-fry veggies, both times my entire family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LANEYSTRAND"
},
"reviewBody": "This was a great recipe, however I did make a few changes. I didn't have any teriyaki on hand so I used some chicken BBQ sauce instead. I also used chopped garlic and a little ginger too. I also substituted the flour with chickpea flour which I use in all recipes calling for flour. Oh, and I left out the red pepper flakes because it was for my kids. We ate it over noodles. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Forget the mushrooms and add a tablespoon of ginger instead. Much better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn Clayton"
},
"reviewBody": "oh my heavens this is good. i did not add the red peper flakes or yellow peper my won wont eat it. i also used only half the pineapple juice as i cant use flour allergie came out fine and it was yummy this is bookamrked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ladybugz2009"
},
"reviewBody": "I loved this so did my family. I added more veggies also I marinaded the chicken like other users in the teriyaki sauce chicken came out good juicy. I replaced the flour with cornstarch because I have made other Chinese dinners that came out great with cornstarch instead of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missthumper"
},
"reviewBody": "I made this recipe almost exactly as stated, besides changing out some of the veggies for ones that I had on hand, but kept the onion, mushroom and pineapple, and substituted corn starch for the flour. It was fantastic. Lots of sauce, but that makes it perfect for putting over some rice. Simple yet declicious, I will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tiffy"
},
"reviewBody": "I made this recipe with a few changes because of what I had on hand. I only had green bell pepper, omitted the mushroom but decided to add a few chopped carrots. I did not chop the onion instead did thin slices. I marinated my chicken for almost 30min in lawrys teriyaki marinade and used that instead of teriyaki sauce. I did not use the pineapple juice but used more pineapples(almost the whole 20 oz can). I did not have crushed red pepper so tried with cayenne red pepper. Served this over white rice. It was very good, but next time I will only use 1/2 tsp of rep pepper. The spice was very noticeable. Overall good recipe, plus quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cierra Lyons"
},
"reviewBody": "Love this recipe, but I made minor adjustments. I didn't want mushrooms so I added in a yellow and orange pepper. Also, I fried my chicken with flour first. I also added a half coup of brown sugar and a teaspoon of ketchup. I doubled my recipe as well by adding an additional cup of teriyaki sauce. It came out perfect. thanks so much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Huda Alaqeely"
},
"reviewBody": "I absolutely love this recipe! It's easy, quick, and delicious. Perfect for a busy working lady.\n\nDefinitely would recommend it to everyone!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Molly"
},
"reviewBody": "We really enjoyed this meal. The flavors blended well together. I did leave out the mushrooms, due to personal taste, so I added extra peppers and onion. Served this over 'Paleo Cauliflower Rice' from AR."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aliya Carmichael Jones"
},
"reviewBody": "Delicious. Added a little bit of kosher salt for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mpilar Ramirez"
},
"reviewBody": "Very good and easy recipe, I did some changes I added carrots, red and white onion. Also I used jalapeño instead crush pepper, it come very tasty my family loved it!."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrea911"
},
"reviewBody": "I was out of pineapple chunks so I left them out. I couldn't find teriyaki sauce so instead I used teriyaki marinade. The sauce was thick enough so I left out the flour. After those modifications, it was still pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bryanbabylon"
},
"reviewBody": "I heavily altered the recipe, but this was an excellent launch point for a dinner that came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terry Robinson"
},
"reviewBody": "I made this for the first time for two picky eaters and they liked it. I used corn starch instead of flour. I also reduced the crushed red peppers to 1/8th tsp. we all voted to keep this recipe and make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma Crawford"
},
"reviewBody": "It was slightly bland, added salt and pepper, that made it a lot better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emromiwe"
},
"reviewBody": "I doubled the recipe and made a couple of changes, fewer peppers, more pineapple and mushrooms. It was absolutely delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cook1965"
},
"reviewBody": "excellent recipe. Didn't change a thing and everyone in the family loved this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Herzig"
},
"reviewBody": "This was wonderful. I did not serve over rice, I steamed asparagus on the side. I cooked the chicken with olive oil and 1 tablespoon butter. I only had one large green pepper. I used fresh garlic not powder, about 2 tablespoons added at the end along with 3 tablespoons honey. I also used some McCormick roasted garlic and herb seasoning. It was delicous. My family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "audrey ajblackledge@cox.net"
},
"reviewBody": "This is very tasty. It's easy to make. I cut the size of the receipt and still had enough for lunch the next day. We'll have this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sublimenade"
},
"reviewBody": "Subbed cornstarch in place of flour. Also, I would recommend adding the bell peppers 5-8 minutes before done, unless you like them super soft."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "We really enjoyed this but I agree that it wasn't sweet/pineapple-y enough so I doubled the pineapple w/a can of crushed pineapple(it's all I had after using the regular chunks. I completely changed the cooking order/method so my chicken wouldn't dry out. Also used 2 tbl of cornstarch mixed w/oj instead of the flour called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CyndiG"
},
"reviewBody": "I just tried this recipe and love it! I didn't have any peppers so added a can of Chinese vegetables and used cornstarch instead of flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "This recipe was good, but I left out the green pepper &amp; added broccoli &amp; sugar snap peas. It's a pretty versatile recipe &amp; you can add &amp; delete veggies to your taste. Also, I used fresh pineapple, but served it on the side so people could add however much they wanted. It's actually fine without the pineapple, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Terry Privratsky"
},
"reviewBody": "as ok"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alicia N. Morgan"
},
"reviewBody": "I omitted the flour and mushrooms, reduced the teriaki to 1/2 cup, reduced the crushed red pepper to 1/4 teaspoon, and added a 20-oz can of pineapple with about half the juice. I cooked this in the slow cooker for 3.5 hours on high. It turned out pretty good served over honey, salt and butter-seasoned quinoa and bulgar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cmelia1"
},
"reviewBody": "I didn't think this would work with potatoes and roast Veg. Turned out good indeed. I've made this with fried rice and as far as I am concerned it doesn't matter what you have with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JLeo"
},
"reviewBody": "although i made a few tweaks including using less pineapples and soy sauce instead of teriyaki, i have to say that this dish turned out great. i also used about a teaspoon of sesame oil to give it that special Asian flavor! i would overall give this recipe a 5 if it weren't for the tweak i made to it. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelie Jones"
},
"reviewBody": "This was SO good and super easy. While preparing it, I thought it might need more than a teaspoon of red pepper flakes... while eating it, I found that I had thought WRONG. Needless to say, it turned out a little spicier than it probably should have been. STILL really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fiona Turro"
},
"reviewBody": "Exactly what we were in the mood for....super easy. Nice meal for a spring rainy day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "misstoni"
},
"reviewBody": "Agree too much sauce. I made the mistake of over cooking mine and the vegetables became mushy, but flavor was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "emidawn03"
},
"reviewBody": "Easy to make and very tasteful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly McNeeley Moore"
},
"reviewBody": "I am a firm believer that nothing can have too much sauce... until this dish. Follow the suggestions in the other reviews to cut down on the sauce. OR... add extra chicken and vegetables. Next time I will add more chicken as well as water chestnuts and peapods. This recipe was very easy and very delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIZ&#9829;"
},
"reviewBody": "In a hurry? This is a great Polynesian style dish that can be on the table in 30 min. I was worried that the chicken would be bland, but the heavy thick sauce gives it plenty of sweet flavor. I completely omitted the crushed red pepper because I wasn't up for a spicy dish. To my defense, I make my own teriyaki sauce that is quite peppery on its own, so it wasn't completely without spice. This recipe is definitely going to be in my regular meal rotation!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "basg101"
},
"reviewBody": "Quick and flavorful. I used crushed garlic and sauteed it along with the onion, before cooking the chicken. I used soy sauce instead of teriyaki; 1 cup is way too much, it should be cut to 1/3 cup. And since my family loves pineapple, I doubled that. Served it over rice, and the family really liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imabookfiend"
},
"reviewBody": "This was perfect. I thought the amount of sauce was great for putting over rice. We will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "reenap"
},
"reviewBody": "This dish was very good. Used crushed garlic and ginger instead of powder. Added soy sauce, vinegar and brown sugar to the pineapple juice and used corn starch to thicken the sauce! Also added green pea snaps cut in half. Also did not use flour. Best thing is it was quick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zarail"
},
"reviewBody": "Yummy recipe. I will saute the vege's first next time. Added more pineapple. Wonderful tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kugelblitz"
},
"reviewBody": "I think it would work better if you either use less teriyaki sauce or drained the pineapple juice. I found the sauce to be a little thick. I did include maybe a 1/4 cup of chicken broth when cooking the chicken. But I don't think that made it overly saucy. \n\nPersonally, I will next try this by first draining the pineapple chunks. I might even wait to add them until perhaps a few minutes before the rest is cooked rather than all at once. Saute the onions as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "julias1"
},
"reviewBody": "My family really enjoyed this recipe. The next time I will reduce the number of peppers. We thought they were over kill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim Shahan"
},
"reviewBody": "Followed basic outline of this excellent recipe, making just a few changes for my taste and/or using what was on hand:\n...added few baby carrot slivers\n...used cornstarch to thicken at end of cooking\n...used green onions (2/3 white, 1/3 green)\n...extra red pepper flakes for heat\n...used leftover cooked brown rice\n...used only green and red bell peppers (no yellow)\nThis turned out a very delicious meal; could follow basic recipe and make many adjustments and would still turn out good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "zimmerle"
},
"reviewBody": "4 out of 5 of us liked this recipe--thus the 4 star rating. Super easy to make. I also added snow peas, which was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "IMSHYNOMORE"
},
"reviewBody": "Made this recipe exactly as written, verdict around here...husband liked it, but didn't care if I ever made it again. Me, way too salty. I can't stand salty, so very sensitive to it. Maybe a little less teriyaki or a little more pineapple? Don't know! Thanks for sharing, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kessler43"
},
"reviewBody": "This is one of my favorite stir fry meals. You can stir in any veggies you like and it always turns out. My favorite is the onions, peppers, a little celery, and sugar snap peas. (I usually leave out the mushrooms). I also use fresh pineapple and stir in a little orange juice since the recipe calls for a can of pineapple undrained."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Yennj82"
},
"reviewBody": "This was okay. Nothing really special. I'm asian and making stir fry meals is a normal thing. This one didn't stand out to me compared to the many other recipes I have in my book. I used corn starch instead of flour. I love vegetable in my stir fry so I added many other veggies to the dish. I will make this again if I'm in the mood for something sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "Could use some tweaking, but still pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Zoila Hiribarne Zamora"
},
"reviewBody": "It is very good!!!! I added some hot pepper flakes to give it a bit of a ziiiing!! Changed the flour for corn starch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "This is a keeper for sure. I like how saucy this recipe is because I made it with brown rice. It goes wonderful with brown rice!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie Khoen-Raineri"
},
"reviewBody": "This was a good, quick, easy recipe. I followed to a T except for using fresh crushed garlic instead of the garlic powder. My family enjoyed it and I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Catnip23"
},
"reviewBody": "This was a bit too salty.....I thought the combination would taste great. It was a big turn off for hubby:("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne"
},
"reviewBody": "I followed the recipe except I added fresh green beans and WOW was it awesome over rice. I recommend this to anyone who loves Asian food.\n\nIf I had to describe this in one word, \"AWESOME\"!!!!! I also used fresh garlic cut up instead of garlic powder. You have to try this, yummy yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wayne"
},
"reviewBody": "I followed the recipe except I added fresh green beans and WOW was it awesome over rice. I recommend this to anyone who loves Asian food.\n\nIf I had to describe this in one word, \"AWESOME\"!!!!! I also used fresh garlic cut up instead of garlic powder. You have to try this, yummy yummy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daymon"
},
"reviewBody": "I thought this was really good &amp; quick (with the Cuisinart). David wasn't wow-ed by it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cookiewoman"
},
"reviewBody": "A very good recipe for teriyaki chicken. All the vegetables cook down to combine with the other flavors to make a very tasty meal served over rice. I added about 1 cup of wine to the mixture along with about 1/2 cup of low sodium soy sauce. Thought it was going to be too salty, but turned out just about right. Had to add a little more flour to thicken. Very good and will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin Miller"
},
"reviewBody": "This was so good! I had to cut some things out of the recipe because my son is very picky. So, I used chicken, one red pepper,1 20 oz. can of pineapple, garlic powder and Kikkoman Baste &amp; Glaze with honey and pineapple. I will make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Guy Rienzi"
},
"reviewBody": "Amazing recipe. Spicy,sweet. Wonderful recipe. A real keeper. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mienna"
},
"reviewBody": "Very good. Family loved it. On the hot side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lovetoeatpitt"
},
"reviewBody": "Yum! Use good teriyaki sauce and extra pineapple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lelewis19"
},
"reviewBody": "Two words: Add cashews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ShayGotCha"
},
"reviewBody": "I enjoyed this recipe very much. I marinated the meat; I mixed the flour in the teriyaki before adding it to the wok, that way it wouldn't get clumpy. I also put some sugar in my sauce- because it seemed like all the reviews said it was salty. I felt the sugar def. counteracted the saltiness of the teriyaki sauce. I felt the dish needed MORE pineapple-but that’s just my preference. I added carrots for color- Loved the mushrooms- what’s great about this recipe you can add what ever you like or use what have on hand- it’s a very forgiving recipe, SO don’t be afraid to get creative! It’s a keeper… Thank you very much!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lauralovesfood!"
},
"reviewBody": "Wow, this really blew me away. It's taste and consistency reminded me very much of what you would find at a restaurant, or one of those pre-made meals that you make at home-except tasting extremely fresh with no odd, preservative type after tastes. \nThis recipe made a lot, way more than just my husband and myself could finish, even the left overs! I think that next time I cook this for just the two of us I'll split it in half. I definitely recommended this recipe to friends and family though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HayMare"
},
"reviewBody": "Easy, tasty, but salty. Next time I will buy a lower sodium teriyaki sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "shannon_jones2006"
},
"reviewBody": "My family really, really disliked this recipe! The sauce is like a gravy and it really doesn't taste good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "ShueJJ"
},
"reviewBody": "We only used .5 tsp of red pepper and it was still hotter than the kids and Ashley liked. Just leave out the red pepper next time"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nolteteam"
},
"reviewBody": "Way too salty! I could tell there was a good flavor underneath all the salt though. Next time I'll try the low sodium Teriyaki sauce and maybe even a little less Teriyaki. It was a very easy recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle TR"
},
"reviewBody": "20 oz pineapple"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mwhitson14"
},
"reviewBody": "Absolutely delicious. I halved the recipe, served over white rice and it was great. Will not be adding the flour next time, and more pineapple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrotfoot"
},
"reviewBody": "This was great!! I was looking for a chicken recipe for dinner tonight and came across this. It smelled delicious, I marinated my chicken for an house in the teriyaki sauce thanks to other reviewers advice, and only used a green pepper, half an onion, 2 cups fresh mushrooms (my favorite), and a cup fresh pineapple. I had a can of crushed pineapple and used about alf a cup of that juice. It turned out perfect! next time i might through in a yellow pepper too, but there was more than enough veggies. The crushed red pepper added the perfect kick! Can't wait to eat the leftovers for lunch tomorrow (:"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ba"
},
"reviewBody": "I am a new bachelor, and am learning to cook at the first time @ 50 via this website. Made this recipe this past weekend - it is INCREDIBLE. For those with a sensitive stomach, halve the garlic powder and crushed red pepper - otherwise this recipe is fantastic - and I plan to make for other friends this weekend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lizzabelle0826"
},
"reviewBody": "I loved this recipe!! I followed it exactly the first time I made it, and everyone loved it. I am making it again today and making a couple of adjustments. I'm using a little less teriyaki sauce and adding some pineapple juice. I want a little more of the pineapple flavor. I will also be using canned mushrooms because I don't have any fresh. I will be skipping the crushed red pepper because my fiance cant handle the spicy. This is by far my favorite recipe so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle F"
},
"reviewBody": "My husband wants this like every week. I was looking for something with lots of peppers, and we really fell in love with this sweet&amp;spicy dish. I serve it on rice, and sometimes add sugar snap peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dennis Rhodes"
},
"reviewBody": "Well this was a huge hit with my family! My wife absolutely loved it. I had to double some of the ingredients as I made this for our family night meal. This is a great summer meal."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "snorkelyn"
},
"reviewBody": "Way too hot for me and my husband. The kids spit it out due to the heat. I will definitely make this again using half the crushed red pepper. I loved the pineapple, and will use the large can next time. Overall, I really liked the consistency and will try this one again with the above changes.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lirpab"
},
"reviewBody": "This was a very easy recipe to make and follow. I was elated with how heavenly it tasted. I will be making this recipe again in the near future."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/62124/teriyaki-and-pineapple-chicken/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16954/main-dish/chicken/",
"name": "Chicken"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/15938/main-dish/chicken/chicken-teriyaki/",
"name": "Chicken Teriyaki Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/62124/teriyaki-and-pineapple-chicken/",
"name": "Teriyaki and Pineapple Chicken"
}
}
]
}
}
, "about": [
]
}
]