				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "The Best Seafood Stuffed Mushrooms"
,"datePublished": "2019-07-10T03:00:05.000-04:00"
,"dateModified": "2019-07-10T03:00:05.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Terri Carroll"
,"url": "https://www.allrecipes.com/cook/1518799"
}
]
,"description": "If you&#39;re a stuffed mushroom connoisseur, this is a must try! These practically melt in your mouth and are always a hit when I&#39;ve served them to family and friends. The filling can also be used to stuff chicken breasts or fish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/fEpfGmYlJ3ZMMrbs0TlcjL4xn8Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/923390-a00f042d8329419e967cc82db7629ee0.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "The Best Seafood Stuffed Mushrooms"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "109"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "279 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "132 mg"
,"fiberContent": "1 g"
,"proteinContent": "17 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "389 mg"
,"sugarContent": "2 g"
,"fatContent": "16 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 (8 ounce) package softened cream cheese",
"1 egg yolk",
"1 tablespoon Italian bread crumbs",
"1 green onion, chopped",
"1 tablespoon lemon juice",
"1 teaspoon Worcestershire sauce",
"1 teaspoon garlic powder",
"1 pinch salt and ground black pepper to taste",
"1 (6 ounce) can snow crab, drained",
"1 (4 ounce) can small shrimp, drained",
"12 large white mushrooms, stems removed",
"1 cup Italian bread crumbs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil."
} ,{
"@type": "HowToStep"
,"text": "Place cream cheese, egg yolk, 1 tablespoon bread crumbs, green onion, lemon juice, Worcestershire sauce, garlic powder, salt, and pepper in the bowl of a mixer. Mix until smooth and evenly blended. Fold in the snow crab and shrimp. Stuff the mushrooms with this mixture, and press into the remaining bread crumbs to coat. Place onto baking sheet stuffing-side-up once coated."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven until the mushrooms have softened slightly, 12 to 14 minutes. Set oven to Broil, and broil mushrooms for a few minutes until the tops are golden and bubbly."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT45M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Betty"
},
"reviewBody": "first of all, I had 30 stuffing mushrooms so I doubled the recipe. What a waste of money! A single recipe would have been enough. I used the leftover to make a side dish. I cooked the extra in a casserole dish for 35 minutes and then added cheese on top and broiled until melted. Tasted ok. I certainly would not have titled this recipe \"The Best Seafood-Stuffed Mushrooms\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tchr257"
},
"reviewBody": "I turned these into seafood stuffed Portobello mushroom caps. They were delicious although I also agreed with other reviewers that the filling was bland. Before I stuffed them, I had to spice up the filling. I ended up adding some Old Bay, minced onion, minced garlic, Parmesan, and a few generous dashes of habanero sauce. My family all declared it an instant “make again” and said that it felt like dinner at one of the fancier restaurants at the beach in Florida they like to frequent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Rodrigue"
},
"reviewBody": "Came out AMAZING!! I only made mine with shrimp as I did not have the other ingredients on hand. Then topped each mushroom with shrimp cooked down in Tony Chacheres Seasoning &amp; Butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "elutxia"
},
"reviewBody": "Too creamy and mushy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Roger Wickboldt"
},
"reviewBody": "I thought this recipe would be outstanding based on the seafood ingredients. It was okay but not great - a little bland for my taste. As others have mentioned, it needed something. I did include 2 chopped green onions instead of one. Maybe next time I'll include some Old Bay seasoning and maybe a little parmesan. My wife liked it more than I did and would give it a 4 star rating so remember how subjective these rating opinions are."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Ferron"
},
"reviewBody": "The mushrooms need to be big. I bought large white mushrooms but they fit very little stuffing in them. I ended up making the entire box of mushrooms and still had filling left over. We stuffed crescent rolls with the leftover filling - those were so good too. I love making these mushrooms but need o find bigger caps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "You got Recipes Girl !!"
},
"reviewBody": "No changes made and I will definitely make it again.. delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "kellynoel"
},
"reviewBody": "The recipe leaves quite a bit to be desired. The stuffing mixture to mushroom ratio is way off; I could have stuffed twice the mushrooms I bought. I don’t find the stuffing particularly flavorful. I thought the egg might make it set a little firmer, but the filling was quite wet, so why bother with the egg?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Walter F. Hodge III"
},
"reviewBody": "Was a big hit with my fussy eaters. Easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dflan"
},
"reviewBody": "Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joycemfb"
},
"reviewBody": "Oh so yummy! I have to put the ingredients on a shopping list since they aren’t staples in my house but it’s well worth it. Tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "flossfairy"
},
"reviewBody": "I didnt make them exactly as listed so I didnt give 5 stars. These are great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "Great recipe I used more spices but otherwise, it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martin St.John"
},
"reviewBody": "I had a similar recipe at a restaurant at Sunset &amp; Vine in Hollywood in 1975 called \"Mushroom Caps La Mer\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassia"
},
"reviewBody": "sautéed mushroom stems, crab, and green onions. Deliciously Devine!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Grill Master"
},
"reviewBody": "Great taste. The only problem was that I ate 6 of them and felt bad afterward. I think eating 1 or 2 for an appetizer would be ok. Don't make as your main course."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol k Knutson"
},
"reviewBody": "Soooo good!!! I used baby portabellas, my fav mushroom! Didn't change recipe ingredients, followed it, only difference is the mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Melissa Hall"
},
"reviewBody": "Really bland, not sure I would even bother to rework it. Just sort of mushy and flavorless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeannerue"
},
"reviewBody": "I have made this a few times with 1 difference instead of the bread crumbs on top I use mozzarella cheese. Everyone loves them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patty Vasil"
},
"reviewBody": "I had so much fun w/ this recipe, I made my filling w/ Tonys creole seasoning, and extra seafood. I kept the Leeks out, I used peppers cut real small. I agree the seafood needed to be put in mini food processor, to chop them real small. Topping them w/the fresh parmisan cheese and a quick broil, I blinked and they were gone. My husband saved me one , I love to see everyone so happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cuteypie007"
},
"reviewBody": "Left out the egg yolk, cut garlic powder in half, added about 1/4 tsp old bay, added some parsley, and it was perfect!!! This recipe is a keeper!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Irene"
},
"reviewBody": "Easy recipe, very good! Make these"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frank Woolsey"
},
"reviewBody": "I followed the recipe for all except I used fake crab filling . My wife and son loved them .I did not care for the texture . The mushrooms had lots of moisture and the crab (fake) seemed dry. I would try again using the shrimp and crab .Seemed like a good idea. I'll just have to try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stabbinglions"
},
"reviewBody": "Made it all according to recipe with a light coating of bread crumbs on top. It was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Carolyn"
},
"reviewBody": "I made this almost exactly, using all crabmeat. Too cream cheesy and relatively bland. No one ate them at my party--thank goodness I had other hearty appetizers. I will go back to bread-based stuffed mushrooms or use a deviled crab recipe to stuff them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "Like it, used canned crab and tiny shrimp. Will improve next time using fresh crab and shrimp. Found the cream cheese to be main ingredient, probably due to canned seafood. I did add parm to bread crumbs and sprinkled more parm on top. Baked 22 minutes because my shrooms were very large. Also added dash of cayenne. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sdhawley"
},
"reviewBody": "This was a good basic recipe. I would have given it 5 stars if it had parmesan cheese added and either a few tablespoons of a diced green pepper or one jalapeño. Other reviews said it was \"missing something\" and its missing that green pepper or jalapeño flavor. I added three TB of parmesan cheese and three TB of pepper jack cheese along with the jalapeño and it was YUMMY. Other than that followed the recipe as is. It filled about 18 large mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "naples34102"
},
"reviewBody": "The filling for these mushrooms is very similar to a shrimp dip I've been making for decades. I LOVE that dip (could eat it with a spoon) so I knew I had a winner with these mushrooms. I took it easy on the garlic powder, using just half what the recipe directed. Better safe than sorry I thought. And it was a good call. I still tasted the garlic, but in a pleasant, delicate way. I sure wouldn't have wanted to taste it hours later, which I'm sure would have been the case had I used the full amount! Since I was making just enough of the these for Hubs and me, using both crab and shrimp wasn't practical as I didn't want to be left with partial cans of either. I used all canned shrimp and filled the slight amount I was short with frozen salad shrimp. I probably added more green onion than the recipe directed, but didn't measure. Just threw in what looked right to me. As for the bread crumbs, I didn't have Italian bread crumbs because I don't use Italian bread crumbs. I crushed some seasoned bakery croutons into crumbs which proved to be a delicious choice. I served these as part of a complete dinner, broiled lobster tails and \"Red Potato, Asparagus, and Artichoke Salad, also from this site, but these were so good I could have made a meal of them alone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marsha"
},
"reviewBody": "I enjoyed this recipe very much. Only change I did was to top the mushrooms with shredded mozzarella cheese. Yummy!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grammak"
},
"reviewBody": "This is a wonderful base recipe for stuffed mushrooms. It's creamy without being too creamy. I always read the reviews prior to making any recipe. I did take some of the comments into consideration when making it myself. I added about 1/3 C finely chopped vidalia (sweet) onion (omitting the green onion) along with some finely chopped fresh chives and fresh parsley from my herb garden. I also added 1 T Parmesan to the 1 T bread crumbs (I used whole wheat seasoned Italian). Also used baby bella/crimini mushrooms and finely chopped about 1/2 the stems and added them to the mixture.I used 1 pound of lump crab and omitted the shrimp. I also melted 1 stick butter with about 1 clove garlic finely minced and poured that into the baking pan before adding the stuffed mushrooms. Topped with a mixture of 1/2 C whole wheat Italian seasoned bread crumbs and added about 1/2 C Parmesan cheese to that. Baked them about 20 minutes then popped them under the broiler for a very short time til golden and lovely. As noted by others this recipes as it is, makes a lot more than 12 mushrooms, so be sure to have more on hand OR take the remaining filling and put it in a greased baking dish, then bake to heat through. Serve with your favorite crackers...YUM!!! I will add the adjusted/adapted recipe to my collection of favorite recipes. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane Edwards"
},
"reviewBody": "Used fresh lump crab meat. Delicious recipe. Had left over stuffing so I put it in a small crock and baked it 12 minutes. It made a delicious cracker spread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luvgoodfood"
},
"reviewBody": "The best....Everyone thought they were catered. I tried to put some away for later but couldn't. At the end of the night, there was none left. I served seafood dishes with them and I scored big. Thanks for this great recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Goodgf"
},
"reviewBody": "yummy! made as stated except for using fresh crab and shrimp. Not knock your socks off amazing, but pretty good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pjb"
},
"reviewBody": "This was my first time making stuffed mushrooms. Recipe is so easy and delicious. I substituted fresh shrimp and left out the crab because I was serving these with crab legs. Next time I will use both fresh shrimp and fresh crab!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "These were amazing. Added parmesan to the breading. Made 12 medium mushrooms. I had so much filling left over I chopped up the stems and added them to the filling, put it in a glass pan with some EVOL, covered with the crumbs and baked it. Made an amazing dip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashleyk"
},
"reviewBody": "amazing!!! make them all the time, best recipe I've ever tried"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kmblondie7"
},
"reviewBody": "These were some of the best mushrooms I've ever had! I used shredded cheese rather than cream cheese. I also used shrimp and scallops. Loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carrie Bell"
},
"reviewBody": "OPPPS... rated wrong recipe. Won't let me just delete so I am giving 4 stars as to not hurt the actual rating by those who have tried it. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "These were fine, but way too much cream cheese. Next time would cut cream cheese in half and add another can of crab. I would also add hot sauce to the mix. To cut back on carbs, I topped with parmesan cheese rather than bread crumbs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melissassm"
},
"reviewBody": "Rich and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jason Varner"
},
"reviewBody": "Outstanding mushroom. I uses clams in place of shrimp and added old bay. These are especially great given you do not add a signifcant amout of fat with butter like many other recipes. Thet were great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "3Girls"
},
"reviewBody": "Absolutely awesome mushrooms!! I kept the recipe exactly the same except for adding a little shredded mozzarella to the filling and then again on top. they turned out GREAT!! Not overpowering, perfect taste! I will definitely be making these again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gorf"
},
"reviewBody": "These were absolutely awesome. If you can find them definitely go for larger mushrooms so you can stuff more into them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carolina"
},
"reviewBody": "This was excellent. I did follow the suggestion of another reviewer and added some grated parmesan and 1/4 cup of the chopped stems and I used frozen, drained shrimp cut up fine. I cut the stuffing in half and it worked out just right using a large package of mushrooms (16 oz). This is a keeper for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dixiechickin"
},
"reviewBody": "I always try to make a recipe as written before rating it. These were OK, but needed more flavor, they were too bland for us. We put Louisiana hot sauce on them and that helped, but if I made them again, I would add some hot sauce or cayenne to the stuffing to give it a boost, the cream cheese taste is pretty predominant, maybe some pepper jack or even cheddar might have made them more tasty. The seafood flavor came out more after reheating them the next day, not so much right out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "lani"
},
"reviewBody": "We are from Louisiana and the canned shrimp and crab did'nt do it for us plus it was too much cream cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cooking disaster"
},
"reviewBody": "These were a huge hit at my last family event. I didn't have any shrimp on hand so I doubled up on the crab. They were wonderful and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cracker Jac"
},
"reviewBody": "Fantastic!!! Thanks for the recipe Terri."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carter_crazy"
},
"reviewBody": "These are great! I'm not sure why some folks think they are bland. They are quite tasty just the way they are. Thanks for sharing :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey"
},
"reviewBody": "Yum! 'Nuf said. Well, almost :) I did add the following ingredients to the mix before stuffing the 'shrooms... Some grated parmesan, about 1/2 of the 'shroom stems, minced, and about a TBSP of red onion, also minced. I generously sprinkled more Parm' across the tops just before broiling, then sat back and accepted compliments for the rest of the day from my friends/family. Yum was the word and I was \"da --it\"!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "OneAngryTurtle"
},
"reviewBody": "This is a very easy recipe that my friends really loved. I did not use the breadcrumbs and it was still very yummy but I admit a different texture may have made them great. Please not that if you plan to double the recipe you will have plenty of stuffing left. This could easily work for a double batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Patrick"
},
"reviewBody": "delicious and very easy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "apainter0703"
},
"reviewBody": "Great, just a tiny bit bland though. I wish there was something to spice it up. The texture of the seafood and the baking times are right on. I may add a small amount of diced Jalapenos next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Thurmond"
},
"reviewBody": "Such a great recipe! Very easy and fancy looking with very little fuss to make. I have even cut this recipe in half and it turns out fabulous!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer Baker"
},
"reviewBody": "I wish I could give these 4.5 stars! I saw no need for the egg yolk, so omitted it. My Christmas crowd enjoyed these, and I would make them again with a few changes--I think some parmesan mixed in would add a little something extra, and fresh chopped parsley would give nice color and flavor also. This did make much more filling than you need for 12 mushrooms--it would probably easily fill 24. Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jazzydes"
},
"reviewBody": "I'm sorry to have to say that I didn't like this recipe at all. I followed it exactly as stated. It was bland and I tasted the cream cheese and not much of the crab or shrimp. I was very disappointed and would not recommend this one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Koko"
},
"reviewBody": "OMG this recipe was so good... I just couldn't stop eating! I didn't use Worcestershire sauce though cuz we didn't have one at home... still perfect though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Front Porch Bliss"
},
"reviewBody": "These were incredible. However, I'm not quite sure why the egg is necessary.??? I left it out and thought that the mixture would also be a great dip with ritz crackers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pj"
},
"reviewBody": "yes!!!!!!!!!!!! Do dip your mushrooms in butter---not a fan of garlic. Add pre cooked bacon about 10 slices diced. Any seafood is great. If no seafood ?????? bacon always works! Love this-just love this!!!!!!!!!!!!!No extra cheese is necessary but does add to the presentation. Simply can't go wrong here!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelley Fulton Emery"
},
"reviewBody": "These mushrooms are amazing! I love the filling. I am thinking about trying the filling over a steak and broiling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tiff"
},
"reviewBody": "I followed this recipe to the T and I dont think I will be making them again. I love stuffed mushrooms and have 4 or 5 different recipes I love but I havent found a seafood stuff mushroom recipe I like yet. I thought Id try this one but I didnt enjoy the canned shrimp and canned crab. I did like the cream cheese and how creamy they were, I also enjoyed the bread crumbs on top, but I will not be keeping this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEGSCOOKIN"
},
"reviewBody": "My mom and I made this on Father's Day for my husband and father. Unfortunately we didn't have the mushrooms so instead we hollowed out a loaf of bread and baked it, yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mmtammymm"
},
"reviewBody": "These were really great. I didn't have the shrimp on hand but they were good with just the crab. Otherwise I followed the instructions exactly. They weren't dry or anything negative at all. I do suggest rinsing the mushrooms and wiping with a towel to absorb the water and then stemming. This way there isn't excess water in the pan while cooking. Delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nerdymom"
},
"reviewBody": "I get asked to make these as well as pass on the recipe all the time! They are a favorite at home and in the work place. My husband and I love garlic, so I add extra to my \"shrooms\". I also add an extra can of crab, lemon pepper, and omit the breadcrumbs. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "debbik"
},
"reviewBody": "These were tasty, but made WAY too much stuffing. I doubled the recipe, cause I was using 36 mushrooms (about a pound and a half total) and I had more than half of the stuffing left. I guess I'll make some more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I tried to make this a low fat treat by using fat free cream cheese. Not a good idea. If I made it again with the fat free I would only use 4 oz. - it was a little runny. I had 20 large mushrooms and still had lots of filling left over. I added the parmesan and it was good. I topped a couple with pepper sauce after they were cooked and I liked the added punch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy"
},
"reviewBody": "I am totally in love with these mushrooms! I added the grated parmesan in with the bread crumbs after reading the reviews and I also dipped the bottoms of the mushrooms in olive oil before placing them on the foil. They turned out amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "Loved it!I made this for a Super Bowl party and they were gone before kickoff!!! Will definitely make these again....but probably will have to double the recipe next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "someguy"
},
"reviewBody": "i ve made this recipe about 3 times now. use 1/4 of a clove of garlic mince it and cook it in a stick of butter. set up your mushrooms like the recipe says but before they go in the oven dip the bottoms in the garlic butter this will keep them moist like in the restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "momandboo"
},
"reviewBody": "This was great. I doubled the recipe which left way too much stuffing. I used it all up after buying more mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mommy of Five"
},
"reviewBody": "I love this recipe! I found immitation crab, baby shrimp &amp; lobster in a package in the deli section of our store &amp; used that. They were outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smilez"
},
"reviewBody": "D E L E C I O U S !!!!!!!!!!!!!!!!!!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charquetta"
},
"reviewBody": "This was awesome! My son (13 and wants to be a chef) and I made these. We added some Colby Jack cheese and Bread crumbs to the top. We dripped the mushrooms in butter. It turned out excellent...even with the Worcestershire sauce(ugh)!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Bouttaphom"
},
"reviewBody": "Loved this will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "angelsmiln"
},
"reviewBody": "This was just okay... I've been over the recipe many times making sure I didn't mess it up. I made it exactly the way the recipe called for. The filling was bland to me and it never really set. If I were to pick this up to eat, the dressing would just drip off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Iuliano"
},
"reviewBody": "I made this recipe last night, and I added grated Parm cheese to the breadcrumbs, baked for 20 mins. and then broiled for about 3-4 mins, and these are definitely ... The Best Stuffed Mushrooms we have ever eaten!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Henderson"
},
"reviewBody": "This turned out great. I had to cook it a bit longer as the mushrooms were not cooked enough for us. I also added parmasean cheese to the bread crumbs and brushed it with butter. YUMMY."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae07"
},
"reviewBody": "These are THE BEST EVER!!! I have been making these for several years now and they are great this way, but I usually mix in a little mayo and I always add Old Bay seasoning and some cocktail sauce, and a few scallions, according to taste. Many times I make this as a WARM DIP for crackers or breads and heat it in a casserole dish with cheeses and parmesan melted on top. It is fabulous either way and I hope you try it - it is the rave when I take it to Christmas dinner (since all the other food is traditional, folks LOVE it!)and I have people actually ask me to bring it to functions and no one seems to forget the wonderful flavors. IT REALLY IS THE BEST AND A MUST TRY! Thanks for this one! Rae in Virginia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ivanka"
},
"reviewBody": "These stuffed mushrooms are amazing. I have tried to make others from recipes on this site but this one really stands out. The whole package of cream cheese is needed as it makes the filling so creamy. I also increased the green onions to 3 and chopped them finely. I doubled the crab and shrimp which I pulsated in a mini-food processor/chopper first to make it finer. The finishing touch was a ton of freshly grated parmegiano reggiano on top of the mushrooms. I also cooked the mushrooms for a bit longer than what the recipe called for as I wanted the mushrooms to be fully cooked. Then I broiled for a few minutes until the cheesy tops were browned. Mmmmmm, good. This was a huge hit at the last family gathering. Everyone could not get enough."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cierra"
},
"reviewBody": "After I found this recipe I handed it off to my sister to make. It turned out really nice, and she isn't the best cook around! There was just enough mixture to fill all of the mushroom caps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bettney"
},
"reviewBody": "Absolutely amazing! I made them into stuffed portobella mushrooms, which worked great and actually used 2 cans of tiny shrimp (6 ounce) and 1 can of crab meat (6 ounce) My boyfriend and I had 2 each and we were both stuffed: SO GOOD!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CRYSTALADO"
},
"reviewBody": "This was really good! It makes a lot of stuffing so be prepared to get more mushrooms!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Kisting"
},
"reviewBody": "Loved it! I used large Portobello mushrooms, omitted the shrimp and used extra crab. A local restaurant serves their crab stuffed mushrooms with a bit of demiglaze in the baking dish. I used undiluted beef consomme and just added enough to cover the bottom of the dish. It gives a great flavor to the mushroom without affecting the flavor of the stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "A2Foodie"
},
"reviewBody": "Great Recipe. Used 2 green onions; added a couple of dashes of Old Bay Seasoning; added parmesan cheese to the bread crumbs"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue"
},
"reviewBody": "I made these for a New Year's party and everyone loved them. I too added a bit of parmesan cheese to the covering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue Carey-Bradley"
},
"reviewBody": "Followed recipe exactly. Found them a little dry and bland. Made way too much stuffing, I even hollowed out my mushrooms a little bit more than just the stems. Had 12 Large mushrooms, mounded the stuffing inside and on top, and still had almost 1 1/2 cups of stuffing left over. I don't know what these were missing, but I wasn't thrilled with the final outcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "I am a true cheese lover and we really enjoyed this recipe. I added some shrimp to the cream cheese mixture and also some parmesan cheese to the bread crumbs as suggested by someone else. I can't wait to serve this as an appetizer in the Christmas season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melody"
},
"reviewBody": "This is a wonderful recipe! I brought this appetizer to a dinner party and everyone loved them. I should have made more. The only change I made was to leave out the shrimp (It's a texture thing with me). Also, I doubled the recipe because I wanted to make 24 mushrooms. It turns out that a single recipe would have easily filled 24 medium sized mushrooms, or close to it. I had a lot of left over filling. I will definitely be making these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunchkin"
},
"reviewBody": "Delicious! I added an extra green onion, and baked a little bit longer just to get the mushrooms really soft. This made enough to fill 24 medium sized mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rusty's girl"
},
"reviewBody": "Didn't change a thing - these were awesome! I might add a bit of parmesan cheese to the breadcrumbs used for the last step! These will be added to my collection of appetizer favorites! Use a teaspoon to fill the caps. It makes it very easy to fill and shape the stuffing!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/143649/the-best-seafood-stuffed-mushrooms/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
"name": "Mushrooms"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
"name": "Stuffed Mushroom Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/143649/the-best-seafood-stuffed-mushrooms/",
"name": "The Best Seafood Stuffed Mushrooms"
}
}
]
}
}
, "about": [
]
}
]