				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "The Best Relish I&#39;ve Ever Had"
,"datePublished": "2020-06-18T23:35:45.000-04:00"
,"dateModified": "2022-07-19T12:29:55.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tammylou"
,"url": "https://www.allrecipes.com/cook/2401490"
}
]
,"description": "This relish recipe is easy to make with cucumbers and onions flavored with turmeric, ginger, and celery seed, for a sweet, tangy taste of childhood."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/yyOp7BuYHIOWySXzHQO5eTXbxPo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/878736-8c344c838cb04f96838b14eb0738fd2b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "The Best Relish I&#39;ve Ever Had"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "71"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "24 kcal"
,"carbohydrateContent": "6 g"
,"fiberContent": "0 g"
,"proteinContent": "0 g"
,"sodiumContent": "217 mg"
,"sugarContent": "5 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"7 large English cucumbers",
"4 large sweet onions, peeled",
"0.25 cup pickling salt",
"3 cups white sugar",
"0.5 cup all-purpose flour",
"1 teaspoon ground turmeric",
"1 teaspoon ground ginger",
"1 teaspoon celery seed",
"3 cups distilled white vinegar",
"1 cup water",
"4 (1 pint) canning jars with lids and rings" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Use the large holes of a box grater to grate cucumbers and onions into a large bowl. Sprinkle pickling salt over the top. Cover tightly; allow to rest at room temperature overnight."
} ,{
"@type": "HowToStep"
,"text": "Squeeze out as much liquid as possible from cucumber mixture; set aside."
} ,{
"@type": "HowToStep"
,"text": "Whisk together sugar, flour, turmeric, ginger, and celery seed in a bowl. Heat vinegar and water in a large, heavy pot over medium-high heat. Whisk in sugar mixture until smooth. Stir in cucumber mixture. Bring to a boil and cook, stirring frequently, until thickened, about 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with the lids; screw on the rings."
} ,{
"@type": "HowToStep"
,"text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until water level is at least 1 inch above the tops of the jars. Bring water to a full boil, cover the pot, and process the jars for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove the jars from the stockpot and place them onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (the lid does not move up or down at all). Store in a cool, dark area."
} ]
,"recipeYield": ["128"]
,"totalTime": "PT670M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the first relish I have ever made and everyone wants it after they try it…. So good…. It even won me a 1st place ribbon at the local fair…."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diane Miller Bertrand"
},
"reviewBody": "I made it today and it is not thickening up like I would like it to. Do you have any suggestion for this? Otherwise it smells so good and tastes good too. But I am concerned about the thickness !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila King"
},
"reviewBody": "I made this last year and OMG even my husband love it. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Fawkes"
},
"reviewBody": "I modified the spices a bit. I added pickle crisp 2tbsp, 1tsp cumin,1/4 cup course mustard,1/3cup cornstarch instead of flour and upped the turmeric to 1/3cup cuz I want it yellow.Hope to bust it out in a few weeks for hamburgers and hotdogs.The taste is slightly sweet, hint of salt, spices and turmeric give it a balance flavour. I think once allowed to sit and firm up it will be Devine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Craig Arndt"
},
"reviewBody": "Great recipe, it is definitely a keeper but I modified it a bit. For sugar I use only a cup and 1/4 for more tang, less sweetness. I also bought a large container of pickling spices from Amazon and use a 1/4 cup of that for a little more depth. But this is such a good recipe because it stores so well once canned. I've had this in the fridge for months and this year decided to go with smaller containers. I've given this for gifts the past couple years, people ask for it now. Its just a fresh cuccumbery like relish that is so much better than store bought."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vedwards7509"
},
"reviewBody": "I really like this recipe and it goes with so many different foods. I like the little kick you get from the ginger. I added a bit more the second time I made this to suit our tastes. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "peli2"
},
"reviewBody": "Really delicious - although like others, I cut the amount of sugar in half - more than sweet enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathe"
},
"reviewBody": "This is really the best relish I've ever made! Easy-peasy as well. No garden English Cukes so I used regular. Followed exactly as I've never made relish before. Delicious even before it had a chance to sit. Only one jar didn't seal and that's completely normal for me. Excelllent recipe!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Frerichs"
},
"reviewBody": "This is my favorite sweet relish! I hate the shredding onions part. Great in eggsalad, in bratworst, etc. Thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Micah's Mom"
},
"reviewBody": "Loved this recipe, although I admit I made changes. As other reviewers suggested, I cut the sugar in half (I couldn't imagine wanting to have 3/4cup of sugar in every jar). I also cubed the cucumber and omitted the flour. That way, it came out like regular pickle relish and not like a paste. The flavors were perfect together. I've made this recipe twice now. It's easy to size down if you have fewer cucumbers. I estimated that you need roughly 1lb of veggies per pint."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rhonda Renee Martin"
},
"reviewBody": "It was ok but I make a zucchini relish that I LOVE so this was a bit disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandy"
},
"reviewBody": "This recipe is perfect! I didn't change a thing! it's our new favorite! so delicious, thank you for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "daisyl376"
},
"reviewBody": "It really is the best relish ever! I haven't bought a single jar since making his for the first time last year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Friday"
},
"reviewBody": "I\"M fairly new to pickling but this was just fantastic!\nI did reduce the sugar to just over half though.\nI also added two red sweet bell peppers for ocular!\nThe best I have had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peter"
},
"reviewBody": "Made this at our cottage for the first time. Turned out fantastic. Need to let it set to get the full flavours. We eat it will all our meals including breakfast. Gets better everyday. Didn’t change anything from the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Colton Hornstein"
},
"reviewBody": "Excellent Relish recipe, needs red peppers though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NevadaMichelle"
},
"reviewBody": "This is really good. Because I don't fire up the water bath in 90 degree weather for nothing, I doubled the recipe and got exactly 12 pints. I used white and red onions, substituted Dill Seeds for the Celery Seeds (I was out) and chopped 3 large red/yellow bell peppers (that was with double batch). The review that suggested 1lb of cucumbers/pint was extremely helpful. I'll be making it again when the next wave of cucumbers is ready!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Harmony"
},
"reviewBody": "OMG my family used to make this but they called it “Kalamazoo”. I haven’t had it in years because no one seemed to have the recipe. Took me right back to my childhood when there was always a jar in the fridge. Is good on pork roast as well. THANK YOU SO MUCH FOR SHARING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "spunkalishis"
},
"reviewBody": "I'm going to be one of those people that others love to hate, but cooking &amp; taste is very personal, so hate away...I won't lose any sleep over it. I gave the recipe 5 stars nonetheless, simply because it's a good base recipe to play with &amp; customize.\n\nThe recipe was super easy to put together, I must say, and I definitely made changes, as I *always* do, based on what I had on hand &amp; wanted to use up, as well as my own personal spice preferences. I also made a much smaller batch to test the recipe out. I ended up with approx 500ml after cutting the ingredient quantities down = to 2 smaller jars. I cut the sugar in less than half (next time will use only brown sugar), used half apple cider vinegar with mother plus white vinegar (next time will use all apple cider vinegar), I used more turmeric &amp; ginger than called for, added cumin seeds, mustard seeds, coriander seeds (all whole), chili flakes, a tiny bit of whole cloves &amp; black pepper. I also used coarse sea salt rather than pickling salt, tapioca starch rather than flour, and some hot mustard paste with a bit of tamarind paste. YUM! As far as vegetables go, I used small Persian cucumbers (less water &amp; super crispy), added half a sweet orange pepper very finely diced, freshly grated ginger &amp; freshly grated turmeric rather than powdered &amp; replaced onions with shallots, just because I prefer them. Definitely will make again &amp; change up the vegetables, using a mix of cauliflower &amp; zucchini. Thank you to the recipe poster!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Northof55"
},
"reviewBody": "Won first place at our local Fall Fair with this recipe!!!! Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hoobski"
},
"reviewBody": "I could eat this right out of the jar!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "snowspiderak"
},
"reviewBody": "I've made this with cucumbers and with zucchini, and either way, it gets rave reviews. I could send it out by the carload to family and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janet p"
},
"reviewBody": "I read the reviews and decided to cut the sugar in half, added a red pepper and mustard seed. Turned out great. Will be making again. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "StoleURfood"
},
"reviewBody": "I made this relish, it was very tasty. It appeared to be a little soupy after making it. I think i was a little light on cucumbers, but it thickened nicely once refridgerated. Will more than likely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PeterinTO"
},
"reviewBody": "This worked out quite well. Like another reviewer i cut the sugar to just over half and it was still sweet enough. It seemed a little high in vinegar and acidity but after a bit It seemed to calm down. I also added some mustard seeds too, maybe 1.5-2 tsp. On the whole I like this recipe. I feel like it could be improved, but not sure how."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhonda"
},
"reviewBody": "This recipe was right on point. Wonderfully sweet and great on burgers. I'm not a fan of regular pickle relish, but this was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly M. Dworetsky Perry"
},
"reviewBody": "I added a variety of peppers, mustard powder, and substituted 2 cups of the sugar with brown sugar. I am very happy with how it turned out!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Magdalena Borisova"
},
"reviewBody": "It is marvelous and exceptional I just put 2 cups sugar and 2 cups vinegar so delicious and I add a bunch of chopped basil leavesAs well i substitude ground ginger with shredded fresh ginger I will make it again and again its so delicious......thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Mo"
},
"reviewBody": "I have made pickles in the past, but not relish! Great recipe and great flavor. I added a few zucchinis from garden as well. I will use this again! Maybe add some mustard seeds for some spice next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trish Dee"
},
"reviewBody": "I will definitely make again, it is so yum. I also made changes after reading the comments. 1 1/2 cups of sugar not 3 cups, and I couldn't buy celery seed so substituted with mustard seed. I also diced the cucumber and removed most of the seeds and added red capsicum. It is a good basic relish for all veges."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janine Cooper"
},
"reviewBody": "so so easily and very delish... Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelby"
},
"reviewBody": "After reading the comments, i decided to made the relish with 1 1/2 cups of sugar instead of 3 and it was great. With 1 1/2 cups of sugar its still quite sweet, so i really don't recommend adding more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liisa Rasanen McInnis"
},
"reviewBody": "yes, best relish recipe.. rated a full 5 stars by hubby!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa r"
},
"reviewBody": "good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marlys Jurko"
},
"reviewBody": "Truly the best. Love it. Easy to make as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maryann"
},
"reviewBody": "Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jackie N Matt Thomas"
},
"reviewBody": "Awesome relish! (But maybe a little too sweet) I skipped the turmeric but did everything else as per the recipe. Will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teresa_n_tn"
},
"reviewBody": "Its a great relish! I did however change things around a bit! I used cucumbers, onion,(3)Thai chili peppers, red bell peppers, garlic celery seed, mustard seed, distilled white vinegar tumeric sugar, flour, salt and water. \nI also only let it drain a couple of hours and then used a sieve. to help aid in draining. It worked wonderfully! It also had a little bite from the Thai Chili's!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrsmouselips"
},
"reviewBody": "You are so right. This is the best sweet pickle relish I've ever had. Much better than the store-bought relish. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "catohound"
},
"reviewBody": "I used half the sugar called for and it was plenty sweet. Like someone else said, the flour gives it a weird gluey texture that isn't very nice. Once it's in a sandwich it's fine, but I'll try a different recipe next time I make relish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol"
},
"reviewBody": "Thanks this recipe is very srumpcious.Canned 24 jars ,MERRY CHRISTMAS EVERYONE ....LOL"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SANDMOR"
},
"reviewBody": "Tried this recipe for the first time today and I LOVE it!Hoping to use it year after year :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "f.crystal88"
},
"reviewBody": "I didn't care for this, but thank you for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAM53"
},
"reviewBody": "I too have fond memories assiting my mother with this recipe in late summer early fall. We used the old hand grinder to grind the cucumbers and onions. We would have hambergers every Saturday for lunch and the relish would be a welcome topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Asphyx"
},
"reviewBody": "This relish is everything i hoped for. I remember having a simular relish as a 4-6 year old at the soccer club. Im 31 now and so happy to have found this recipe. I have been searching for a long time. It tastes exactly as i remember. I may reduce the sugar a little next time, but thats a personl preference. The stuff i remember was just as sweet as this relish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenifer Selwa"
},
"reviewBody": "I have never liked relish - until I made this. Absolutely outstanding! I used picklers, added mustard seed with two large sweet peppers (great color and taste!) and omitted the flour, and reduced the sugar slightly (not much). I can't wait to try this on my burgers and 'dogs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rhondam"
},
"reviewBody": "Absolutely DELICIOUS!! Everyone LOVES it! It's like having bread and butter pickles in relish form! Thank you SO MUCH for sharing this... :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Black"
},
"reviewBody": "I made this as the recipe recommended and it turned out great. I really don't have a lot to add about this recipe, except that it is a 'keeper'. Happy canning. Some recommended for hot dogs &amp; hamburgers, however, I can add that I use relish in my tuna and chicken salad as well and I also use it with my beans &amp; chili at times. Best wishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim O."
},
"reviewBody": "I just made this relish and although I know it's supposed to sit for 6-8 weeks, I tasted it warm and it already tastes very good; it can only get better! After reading all the other reviews (thank you!), I followed the one pound of cukes per pint recommendation and that seemed to work great. I used 3 very large onions instead of 4, and substituted one large red pepper for the 4th onion. I left the ginger out and substituted mustard seed instead. I ended up with almost 11 half pints. I can't wait to taste this again in a few weeks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lanie Pie"
},
"reviewBody": "ok taste but the flour made is a weird consinstancy...like glue"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "billyanne"
},
"reviewBody": "This relish is awesome and I really didn't use the exact items, used my big cucs from my garden and took the seeds out and used cooking onions...still is fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NewWife2006"
},
"reviewBody": "Great recipe! I just used regular cucumbers and didn't bother seeding them. The flavor is great on burgers and hot dogs. I submitted it for our county fair and won 2nd place!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abi Gregorio"
},
"reviewBody": "This is my second year putting up this relish. My family loves it! It's always such a hit. My only problem with the recipe, since I do a lot of canning, is that I like to know weights for the amount of vegetables needed. I use pickling cukes that we grow in our garden and I've found that a good estimate for the amount of cukes you will need is roughly 1 lb per pint. I also recommend letting the relish sit for a few weeks (6-8) before opening one of your jars so the flavors fully meld and the relish sets nicely, just like you would with pickles. This recipe is definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "This relish is very easy to make and good tasting, but it's waaaaaaaaaay too sweet. If I make it again, I'll use half of the sugar it calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "skygurlie"
},
"reviewBody": "A good starter recipe. I varied the recipe by using three different types of finely chopped cucumbers,diced red and yellow peppers, chopped cauliflower, tumeric,ginger,and cumin. I did not add the flour and added two tablespoons of brown sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattiwithani"
},
"reviewBody": "Absolutely amazing! Thank you for this terrific recipe. This was my first try at the canning process and I'm thrilled it yielded a great product!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Odie"
},
"reviewBody": "Made this and was so disappointed with the runny looks that I discarded the recipe-couple weeks later after finally getting brave enough to open a jar and try I was very surprised! Love it, found recipe again and starting second batch today...also on second package of hot dogs (normally don't eat hot dogs this often)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TAMMYANDFRANK"
},
"reviewBody": "This relish turned out to be delicious!! What a great starter recipe for someone who has never canned anything! I added red and orange bell pepper for color &amp; I cut up the cukes intead of grating them!! Very very nice! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gale Rudolph"
},
"reviewBody": "This was a wonderful starter relish for me. I put mine in the refridgerator overnight. I added two red jalapeno's for an extra kick and some color along with 1 TBL of mustard seed. I also added three green bell peppers just because I had some on hand. The results are great. I will use this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katy Woodbury"
},
"reviewBody": "So yummy! My only hang up was expecting the relish consistency when waiting for it to thicken, but it thickened up nicely when it cooled down. I would recommend this to any canning friend I meet!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Romayne Swim"
},
"reviewBody": "This is easy to make and the best relish I have had in years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gardencook"
},
"reviewBody": "Thank you for this wonderful recipe! This was our first time making relish. We used huge Ukrainian cucumbers that were too big for pickles. We followed the directions and the relish is superb. We just had it on burgers for lunch. Even my husband and my four year old loved it - and they don't like relish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tynna"
},
"reviewBody": "I love relish but never made it before. and this is really good!!! I'll be making this with my fresh garden cucmbers every year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marysia59"
},
"reviewBody": "this is truly the best relish. My mother has been making this mustard relish and we have been loving it for approx 30 years,only variation:omit the ginger, and add ground mustard and mustard seeds.This relish is also good on hamburgers and love it on ham sandwiches."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/166211/the-best-relish-ive-ever-had/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
"name": "Sauces and Condiments"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/13378/side-dish/sauces-and-condiments/relishes/",
"name": "Relish Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/166211/the-best-relish-ive-ever-had/",
"name": "The Best Relish I&#39;ve Ever Had"
}
}
]
}
}
, "about": [
]
}
]