				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "The Best Thai Coconut Soup"
,"datePublished": "2020-03-05T00:05:01.000-05:00"
,"dateModified": "2022-10-05T10:34:11.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jessica"
,"url": "https://www.allrecipes.com/cook/1317560"
}
]
,"description": "This Thai coconut soup made with red curry paste, lemongrass, lime juice, shrimp, and fish sauce is full of authentic, bold, and tasty Thai flavors."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xKptdwpGXDCfzusSblsr21L4FB4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2319909-the-best-thai-coconut-soup-Aja-1x1-1-d2385a72da884e75a7364d6ecca5680e.jpg",
"height": 1000,
"width": 1000
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3867642501001",
"description": "A delicious, must-have soup recipe.",
"duration": "PT2M1S",
"name": "The Best Thai Coconut Soup",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/9a77bd8d-305d-47eb-9b80-e69d47650051/ccfca1f3-863c-42c5-b882-19854d883241/1280x720/match/image.jpg",
"uploadDate": "2021-03-10T09:32:10.821-05:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "The Best Thai Coconut Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "1632"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "368 kcal"
,"carbohydrateContent": "9 g"
,"cholesterolContent": "86 mg"
,"fiberContent": "2 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "28 g"
,"sodiumContent": "579 mg"
,"sugarContent": "2 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 tablespoon vegetable oil",
"2 tablespoons grated fresh ginger",
"2 teaspoons red curry paste",
"1 stalk lemon grass, minced",
"4 cups chicken broth",
"3 tablespoons fish sauce",
"1 tablespoon light brown sugar",
"3 (13.5 ounce) cans coconut milk",
"0.5 pound fresh shiitake mushrooms, sliced",
"1 pound medium shrimp - peeled and deveined",
"2 tablespoons fresh lime juice",
"salt to taste",
"0.25 cup chopped fresh cilantro" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a large pot over medium heat. Add ginger, curry paste, and lemongrass; cook and stir in the hot oil for 1 minute."
} ,{
"@type": "HowToStep"
,"text": "Gradually stir in chicken broth, then stir in fish sauce and brown sugar; reduce heat to low and simmer for 15 minutes."
} ,{
"@type": "HowToStep"
,"text": "Add coconut milk and mushrooms; cook and stir until mushrooms are soft, about 5 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/xKptdwpGXDCfzusSblsr21L4FB4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2319909-the-best-thai-coconut-soup-Aja-1x1-1-d2385a72da884e75a7364d6ecca5680e.jpg"
}
]
,"text": "Add shrimp; cook until no longer translucent, about 5 minutes. Stir in lime juice; season with salt and garnish with cilantro."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Added some cayenne and served over basmati rice. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ANGELA97303"
},
"reviewBody": "Hands down the most excellent soup ever! The curry paste matters in my opinion. Mae Ploy Red Curry Paste is my go to. If I don't have lemongrass on hand, I will often zest a lime or lemon. I often skip the brown sugar and only use 2 cans of coconut milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimberly Ann"
},
"reviewBody": "Good base recipe! I had a few modifications. I didn't have lemongrass. I used 3-4 Tablespoons (not teaspoons) of red curry paste. 2 cans coconut milk (that's what I had). I used tallow from my farmer friend instead of grocery store oil. I felt like this combo was actually very good/delicious broth. I used minced jar ginger, very handy. I forgot the brown sugar and I didn't use any salt. I used Better Than Bouillon lower sodium chicken base for broth. I used a pound or more of large shrimp, thinly sliced red and yellow peppers, fresh green beans, scallions, &amp; Bella mushrooms. Fish sauce, cilantro and lime as recommended. I served it over Basmati rice and I also made rice noodles. My husband loved it, he added hot sauce, always wants more heat! He said next time add more shrimp and also could add scallops or use fish in general. My step son, age 12, also liked it well enough and he suggested more noodles, and more shrimp. My first time making a Thai red curry based soup, and will make this again! I agree to add lime leaves and red chili as desired. I also would try peas next time but whatever you like."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Inthecube"
},
"reviewBody": "Delicious! I varied the recipe based on other reviews. Added a teaspoon more red curry paste, only used 2 cans of coconut, used lemon peel and green onions (instead of lemon grass) sautéed the mushrooms before putting them in. Very tasty, will definitely make again! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This a wonderful base recipe and you can tweak it if need be. Definitely use sesame oil, you can “cheat” and buy minced refrigerated in a tube lemon grass, or buy the stalk pill and cut in larger pieces where you can fish them out, lol! Another important is the type of Thai paste you use, Mae Ploy red curry paste is the best and gives you the most authentic flavor. I add garlic chili pepper (in a jar from the Asian section at the grocery store) as we like it rather spicy, I use a variety of seafood, jumbo prawns, I buy the big bag of frozen seafood from Costco to add scallops, calamari, mussels and or the smaller ones from Trader Joe’s. Another thing I do is, in addition to baby Bella mushrooms, I add “seafood mushrooms”, you can find them at any Asian market in the produce area, the look like fat noodles, save a bit on the carbs. Kaffir leaves add also a great authentic lime flavor. Lime zest and juice works well as well! I buy the leaves in the Asian market, they are also available fresh through Amazon. Just wrap them in a damp paper towel, put them in a zip loc bag and keep them in the freezer… they remain bright green and fragrant when handled for a very long time. Just a wonderful all around recipe! Try it as will definitely enjoy it. I make a large pot as my family goes crazy over it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bobbi Bagwell"
},
"reviewBody": "This soup is fantastic! I only used 2 cans of coconut milk and that was plenty. I couldnt find lemongrass so I just used lemon zest and it was fine. I made with shrimp, but would make again with chicken or even without a protein - it's delicious on its own! And so easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marc Davis"
},
"reviewBody": "I made this for me and my son for dinner tonight and it was delicious. I followed the recipe but had to substitute green onion for the lemon grass. We have had this soup at our local Thai restaurant and this taste almost exactly like it. We will definitely keep it on our regular menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Gibson"
},
"reviewBody": "So easy and so GOOD. Better than any restaurant version I have had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turned out great! Wife said I have to make it again. Remember, it's soup. If you don't like something, like lemongrass, then skip it. I only used two cans of milk because that's all we had, but it worked. Used the juice of half a lemon because I didn't have limes, added onion and red pepper because it's soup. This would work good with chicken as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SPeters"
},
"reviewBody": "We all enjoyed it! Full of flavor and a bit spicy without overpowering the other ingredients. If you are watching fats, you might want low fat coconut milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mushypea"
},
"reviewBody": "This was a nice recipe to build on and tweak to one's own tastes if desired. Thanks to the OP for sharing. I always find it helpful to read reviews first. It helps to see other's substitutions or adapting to what one has on hand. I upped the Chicken Broth ('Better Than Boullion' Brand) to 6 cups (vs 4) due to larger appetites. I then eyeballed and slightly increased most of the ingredients; more grated ginger, much more red curry paste - 5 or 6 generous teaspoons (we like), another extra glug of fish sauce. I kept the brown sugar to 1 Tbsp. First time with woody lemongrass stalks, so I researched how to prepare and find 'the sweet spot'. I very finely minced what I had and enjoyed that addition. I decided to slice and pre-saute regular fresh mushrooms as I feel sauteeing them first lends a deeper, more intensified flavour to soup. As they were sizzling and browning in the skillet, I threw in some diced red pepper to the saute, as I had them handy. They added a nice layer of flavour and texture and look so pretty and colourful. If I'd had green pepper, I'd have diced some too, and better yet, if I'd had any summer jalapeno peppers left, a small addition would be a perfect touch for our taste. I took advice from some previous reviews and cut the coconut milk to 2 cans. I added frozen, cooked, peeled &amp; deveined shrimp a few minutes before serving. I'll also try this recipe with chicken in the future for a variation. I sprinkled some red chili flakes into the soup pot as we enjoy them. For garnish, chopped fresh cilantro and finely chopped green onion/scallions were used. In a small separate side bowl were diced, pickled jalapenos for ones that enjoy that extra heat addition. Earlier in the day, I'd prepared and refrigerated batches of both fluffy white rice and cooked rice vermicelli noodles so that the family can choose one or both to ladle this delicious soup over in their bowl. Some chose both. It was a very satisfying dish for all. Bravo! My family put this on the 'Make Again' list. It was a very delicious creation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Tastes just like the Tom Kha soup we order from our favorite Thai restaurant! I’ve been a connoisseur of this soup for years, trying it in dozens of restaurants all over the country and each one is different. This really hits the mark, combining all my favorite flavors into one delicious bowl. We’ll be making this at home now! Can make with shrimp or pulled chicken from the freezer &amp; add more heat if you like spicy. I loved it just as written. Thanks for sharing this recipe, it’s a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Samantha Stinson"
},
"reviewBody": "This is delicious and tastes just like the one we used to make at Mama Fu’s (if anyone knows what that is). The only thing I changed is I used 2 cans of lite coconut milk (unsweetened of course) and 1 regular can of coconut milk. I also used sesame oil instead of vegetable. You could probably used 3 lite cans if you wanted to and it would be fine. Also lemon grass to me is like eating straw (I cannot figure out how to make it edible!) so I cut it up length wise, cook it with the curry and ginger as directed and put it in a mesh basket so the flavors can absorb in the soup without leaving the straw in there to be unpleasant. Works like a charm. And if anyone knows how to make lemongrass edible, I would love to know!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Taste delicious I made it with my grandmother best thing every"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This turned out really well and it was pretty easy to make. I'll definitely have to cook some again in the future. For half of the coconut milk, I used coconut chunks ground up in a blender with water. I also used lemon juice instead of lime and added a bit more than the recipe called for. And since I didn't have any red curry paste, I used a bit of curry powder and 3 teaspoons of roasted red chili paste instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Christian-Wolf"
},
"reviewBody": "This was bomb ditty delicious! I like a little more heat, so I added chili paste to my serving, but it was perfect per recipe. Easy peazy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tasty! Creamy and mild. Did not use lemongrass. Couldn’t find it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Baker"
},
"reviewBody": "Delicious. I looked at everybody's comments first. So I heated the chicken broth and grated the ginger and lemon grass in it. Let it almost simmer for an hour. them I strained it. Got all the flavor with none of the fiber everyone complains about. The rest was text book. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherrybezanson"
},
"reviewBody": "If I could give this recipe 10 stars I would! Amazing flavor exactly the way the recipe is written. LOVE it &amp; SO Simple to make..... :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Perfect. Restaurant quality. Wow. We made it with fish fillets instead of shrimp. Will make again soon. Big hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved the recipe. I don't care for mushrooms, so I added eggs instead. It tastes so good. 😋"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila Adams- Webb"
},
"reviewBody": "BEST EVER! Although I had to change the recipe here &amp; there while cooking &amp; taste testing. I doubled the brown sugar w/Swerve brown sugar. I doubled the Curry paste, doubled the lime juice, used chicken instead of shrimp, added half cup of heavy cream, added green onions, tomatoes &amp; avocados. IT WAS AMAZING! Literally better than all restaurants we have tried it at."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hallsy"
},
"reviewBody": "Absolutely an amazing recipe as it is written. Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was soooooooo good!! It’s just the same as restaurant quality, I added 1 more teaspoon of red curry but other than that it was perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda Chua"
},
"reviewBody": "I read some comments about the coconut milk so I decided to use only 2 cans of coconut milk and I also changed the amount of chicken broth using about 48 oz (I wanted more soup). I also added broccoli to the soup. It was a hit with my teenagers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthony Zeigler"
},
"reviewBody": "Added chicken"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audyna Salsabila"
},
"reviewBody": "This was soo delicious! My whole family loved it! I reduced the coconut milk a bit, adding 2 pinch of ground black pepper, 1 more tbsp of the red curry paste, 1 more stalk of lemongrass, and 1.5 more tbsp of brown sugar. I didn't add the cilantro. I added some diced chicken, enoki mushrooms, vermicelli, tofu and some bok choi for a big meal. I'd definitely remake this dish again! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hprescott"
},
"reviewBody": "Authentic! Delicious. Used potatoes and edamame instead of mushrooms (did not have any)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Deere"
},
"reviewBody": "Made it without cilantro or lemon grass, plus lemon zest and extra ginger, only 1 can coconut milk, sriracha instead of curry paste, no sugar, and lots of bok choi and spinach added. still great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Aunt Susan"
},
"reviewBody": "This recipe is good but the choice of ingredients in terms of brand, fresh or packaged, etc., can make a difference. Example, fresh squeezed lime juice tastes worlds better than the processed packaged stuff. I made this again with some tweaks because my this recipe “as is”, for me, was not as flavorful as I prefer. 1) CHICKEN INSTEAD OF SHRIMP. The soup tasted heartier. I prefer using chicken.; 2) LEMONGRASS: I DID NOT MINCE the lemongrass stalks. Last time the minced bits tasted like lemon soap and felt like coarse sand in my mouth. I cut down to 2-3” and smashed the stalks to release the flavors and allowed them to steep in the soup.; 3) COCONUT MILK: I used three 13.5oz cans because I love coconut.; 4) LIME: I doubled down on the fresh squeezed lime juice. Such a bright contrast to the rich coconut.; 5) CHICKEN BROTH: Last time, I accidentally grabbed “fat free” chicken broth. This soup is so much tastier with full fat chicken broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IronChef"
},
"reviewBody": "This recipe is amazing! However, there has to be a mistake with the c. milk amount. It’s way too much. I made it exactly as recipe said the first time and the c. milk over powered everything else. The second time I used 6 cups of broth and one can c. milk. Of course you can always adjust the other ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Paprika114"
},
"reviewBody": "Made omitting the shrimp and mushrooms and adding chicken. But this was WAY too bland. Had to add a lot of extra lemon juice to come up with the lemony flavor we love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "soniajolliffe"
},
"reviewBody": "Strongly suggest doubling the red curry paste! Delicious soup - will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "acsarchitect"
},
"reviewBody": "This is a great base line recipe, but I think there is something wrong with the amounts of coconut milk listed. I've made lots of thai soups and the proportion of coconut milk is usually one can to 4 cups of broth. \nIf the author of the recipe doesn't mind, could they please check and see if this is a typo? Otherwise I like the recipe and was able to adapt it easily to make it vegan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dawn Sterling"
},
"reviewBody": "It is a good basic recipe to start with, It definitely needed more salt and pepper. Next time I will add more curry and red pepper flakes when saluting the ginger and garlic. Even use less chicken stock by one cup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "Jessica - this truly is the BEST Thai Coconut Soup recipe I have ever eaten!! Used ginger and lemongrass paste due to can’t find either right now (eyeroll) but still turned out FANTASTIC! It’s so good, I’m going to the store to make again for a New Years Day get together we have planned. A hit at my Asian-Inspired dinner party last night! Only recommend; make and add some coconut cilantro lime rice and scooped some into each bowl of soup. To die for! Thank you Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe! First time I made it, my tastbuds felt like they were missing a little something. So, next time I made it, I tweaked it to my taste. I juice from 6 limes (small), 2 stalks of lemongrass, and a little less brown sugar. Also, not crazy about red curry (too hot for me) so I used a yellow curry. Both ways were really good, but like I said, just changed a little to make my taste buds really happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BigGRUBS"
},
"reviewBody": "Whoa!!! This soup did NOT disappoint! Everyone was blown away. I didn’t change a thing. Perfect as is."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jxryrf2pvd"
},
"reviewBody": "I absolutely love making this recipe it’s incredible! I also add shredded chicken to it as well and sometimes rice noodles to make a thicker soup. Totally full of flavour &amp; the family loves it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G. Kim Taylor"
},
"reviewBody": "Great taste! I used powdered curry seasoning (Penzey's) and only one can of coconut milk (all I had) but it was still delicious. Definitely will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "j.mcfarland32"
},
"reviewBody": "Great recipe. As some have stated, I would use slightly less coconut milk. Two cans was perfect for me. Maybe slightly more curry paste. Also, take two to three stalks of lemongrass, whole, and let them simmer with the soup and remove before serving. I also subbed butter for the oil and added twice as much. Thai basil and jalapeno make great toppings in addition to the cilantro. Served with brown rice and you can't go wrong. Really great base recipe that you can tweak to your liking. Props to the original poster. Goes great with pork and beef as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sdouglas1226"
},
"reviewBody": "Simple and delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jobila"
},
"reviewBody": "Really delicious recipe! I sauteed a palm-sized amount of chopped ginger, a half tube of lemongrass paste, 1 crushed garlic clove, 2 tsp Maesri Thai Red Curry Paste. I then added 1 cup of chicken broth and let it all boil. I then added the 3 Tbs of Red Boat fish sauce, mushrooms, and 1Tbs coconut sugar, and another cup of broth. Let it boil and the ginger and garlic will dissolve. Then I added chopped colorful mini peppers, juice of an entire lime, 2 tsps of regular sugar, a tsp of white pepper, and the rest of the broth (2 cups). Then I added one can of regular fat coconut milk. I separately boiled rice noodles and then added them to the soup and added cilantro. Yum!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RReed"
},
"reviewBody": "This is super delicious, thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "londanian"
},
"reviewBody": "This was outstanding! The only thing I would do differently next time is put the lemongrass in cheesecloth because it did not get tender. The taste was superb!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jollylawley"
},
"reviewBody": "This had a nice flavour. I have never used lemon grass before and found it added an unexpectd texture which was enjoyed. The red curry paste was just the right amount for those folks that don't like things to spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Skurzewski"
},
"reviewBody": "delicious over steamed rice…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "This is delicious but could be hotter. Next time I’ll add more red curry paste and lime juice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "8h86dcn8ct"
},
"reviewBody": "Super yummy! Only thing I’d do differently next time is handle the lemon grass differently. I ended up with “shards” of lemon grass through my soup. It didn’t ruin it, but I would have had to seriously consider how to handle that if I’d been eating in public.\nHubby is one of those guys that tastes soap instead of cilantro, so we didn’t enjoy it with the fresh herbs, but I can only imagine that cilantro was 100% the missing ingredient. Otherwise this was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne Bamford"
},
"reviewBody": "It was easy and very tasty. Will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "tryhappiness1"
},
"reviewBody": "Too much coconut milk, way too much. No texture, its just like coconut water. One would be sufficient or way more curry paste, 4 tablespoons or mire. I luje coconut buy i almost couldnt finish it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pamela"
},
"reviewBody": "I’ve made this several times and love it. This time I added chicken as my protein. Extremely flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "This was a good base, but the soup was a little sparse. I added a red bell pepper and green beans. If I had baby carrots, I would have added those too. Top with bean sprouts and fried shallots. I also used only 2 cans of coconut milk and the flavor was perfect. Next time, I’m going to try sliced chicken instead. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aisling"
},
"reviewBody": "Looooved this recipe and I definitely will be making it again! I used chicken instead of shrimp and one less can of coconut milk. I tasted as the soup cooked and after two cans it tasted perfect to me. I was worried that the fish sauce would be too fishy but it wasn't at all. Can't wait to make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jo Jackson"
},
"reviewBody": "ABSOLUTLEY DELICIOUS!!! I sprinkled a little lime juice on at the end. I could eat this every week!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KiKi"
},
"reviewBody": "Delicious........."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Margaret McAden (Maggie)"
},
"reviewBody": "I didn’t get a wow factor tasting this soup as others described. I followed the directions exactly except I didn’t use FRESH grated ginger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "As-written, this recipe is okay, nowhere near the flavor of a Thai restaurant, so I'm not sure what all of these other reviewers are referring to.\n\nI tripled the amount of lime, added another tbsp of fish sauce, and crushed the lemongrass and let it steep instead of mincing it since it isn't edible. \n\nWith a bunch of extra lime the recipe is passable with very easily found ingredients. Next time I will try to find kaffir lime leaves and galangal as I think that will really make a difference. I also need to experiment with the amount of curry- my curry paste was very spicy so I only used a little which brought a lot of heat but not a lot of other flavors."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rushpete"
},
"reviewBody": "The smell confused and scared my kids, but my wife and I loved it!! I didnt use any Lemon Grass and put in an extra tsp of curry paste. Next time I will put it more veggies such as Tomatoes n green pepper along with some more spice"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sammie Allard"
},
"reviewBody": "My husband and I absolutely loved it. We fallowed the recipe exactly, except we added rice noodles to make it hardier. And added scallions with the cilantro. I have had thai coconut soup from thai restaurants and this was way better. I definitely recommend giving it a try."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mitchie"
},
"reviewBody": "It’s going to be very hard to not eat too much of this soup because it’s incredibly delish!!! I wonder if it can be frozen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Afton Fitzgerald"
},
"reviewBody": "Absolutely delicious! Total comfort food and exactly what I had been craving! Another high point, my kids LOVED IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Stuckey"
},
"reviewBody": "Wonderful soup . I added a chopped green pepper , 2 large carrots sliced , 1/2 cup yellow and red pepper strips and 4 oz of cod fish. Used 1/3 bottle of blue dragon Thai red curry paste for heat . Even adding the extras there was lots of broth. Will make it again ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia Shuman"
},
"reviewBody": "Love it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TDotTwo"
},
"reviewBody": "Fantastic recipe but with one important caution - if you scale up the portion size, the lime leaves can become overpowering. I've made this dish about a dozen times so obviously I love it. But recently I scaled it up to a larger portion. As with every other ingredient, the lime leaves were scaled up. That was a mistake. I wish I kept it to 10 leaves maximum. When I threw in 15 leaves, the soup became overpowered with lime leaves and had an unpleasant bittery, overly-fragrant taste that ruined the soup. It's also possible that I stewed them in the liquid slightly longer than necessary. Anyway, that's my only caution. Otherwise a fantastic soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leisha Kennedy"
},
"reviewBody": "I used tofu and mushrooms and it turned out absolutely fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley Graves"
},
"reviewBody": "I made a few changes due to lack of ingredients or personal taste, but it was delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bahar Stanat"
},
"reviewBody": "Amazing! I added chicken but otherwise didn’t change a thing and it’s my fifth time making this! Sooo good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Stephens"
},
"reviewBody": "This was delicious! I will double the shrimp next time to make it more hearty and add some thai chilis since we like thai food spicy. We will definitely be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is delicious! I added more chili paste for an extra kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blissful"
},
"reviewBody": "Pretty authentic taste. I like to add more greens like bok choy or collard greens. I have substituted chicken plenty of times with no complaints."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "WOW! This turned out great! Only thing I would change is to hold off on that 3rd can of coconut milk. It was rich enough. Make sure to \"small dice\" the ginger as it makes a delicious additional feel and flavor in each spoonful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "LandM"
},
"reviewBody": "Very bland. Will move on. Just buttery coconut flavor. Sigh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Patty Wells McPhee"
},
"reviewBody": "Yummy! A real comfort food. I love red curry, so I tripled the curry paste to two tablespoons. Am looking forward to leftover soup served on top of Calrose rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RetiredOneKenobi"
},
"reviewBody": "Great satisfying soup. I added a couple of Kaffir Lime leaves to the recipe. These are not always available, but when they are, I buy lots and freeze the excess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Missoni Lanzardi"
},
"reviewBody": "This was amazing I added green beans and cauliflower it was amazing I love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raven"
},
"reviewBody": "I couldn't find the lemon grass or paste so I added the juice of one lemon and cut the the tops of some leeks that I added at the end. Left everything else the same. Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G, M, and R"
},
"reviewBody": "I've made it many times and always a favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shep"
},
"reviewBody": "Thanks to some of the other reviews, I made a few changes some, added some others and ended up with the BEST Thai coconut soup I've ever made:\n\n1) Made broth using veggie stock, dried shrimp &amp; lemon grass whilst I got the spices going (cooked for ten mins)\n\n2) Sauteed ginger, chopped lemon grass &amp; 3 tsps (added one extra) of red chile paste\n\n3) Added the broth to the spices, then added ONE tin of coconut milk (that was perfect - more would have been too much)\n\n4) Added Thai rice vermicelli &amp; one large bunch of torn kale leaves (without the stalks) then simmered for 3 mins\n\n5) Added prawns, lime juice and then turned off the stove, covered and let sit for 20 mins.\n\nIt was brilliant - wonderful depth of flavor. Will make this again for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Dreher"
},
"reviewBody": "Added garlic and peppers. Also a bit more rad curry paste. Wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandy Williams"
},
"reviewBody": "I made this for dinner last night while nursing a cold and it was fantastic. I followed the recipes, except for the addition of chicken at the beginning and green onions at the end. I think this whole recipe depends on using high-quality coconut milk (I use Chaokok), fish sauce (preferably Red Boat but if not available, choose one without any additives), and curry paste (Mae Ploy is my preference). The soup was delicious and certainly rivals any of our local Thai restaurants."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "summer"
},
"reviewBody": "We LOVE this recipe! Have made it a few times and added noodles or rice or extra veggies and it is always delish!! Had to make it tonight without brown sugar and subbed in half of the amount of regular sugar and it was still awesome. A great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Englehart"
},
"reviewBody": "This truly is the BEST!!\nWe enjoyed this"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "This was delicious!\nI only had one can of coconut milk and I only added 1 Tablespoon of fish sauce. \n\nAlso, I didn’t have lemongrass. I used veggies I had on hand, added a couple of shakes of red pepper flakes and a dash of soy sauce and served it with a scoop of jasmine rice.\n\n All the delicious Thai flavors I was craving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Merritt"
},
"reviewBody": "Absolutely Wonderful!! It was gone in seconds - the entire family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "A-D"
},
"reviewBody": "Fantastic recipe - I ended up adding more red curry paste to my preferred level of \"kick\" but this recipe is simple, fresh/bright and has great complexity from the lemongrass and shrimp. Rave reviews at dinner and so many ways to customize this with other proteins and vegetables. Thank you for this simple yet decadent recipe that is truly a crowd pleaser. Will be making this over and over again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melinda Thomas"
},
"reviewBody": "Very good!! Looking forward to trying it again soon. I didn’t have any red curry paste (discovered this after I was already committed- lol), but I did have green curry paste, so I used that, plus some roasted red chile paste. It wasn’t super spicy at all, just a little zesty. Loved the flavors, will likely add more fish sauce next time. I think I would like to lighten up the “richness ratio”of chicken broth/coconut milk. It tasted great but was very filling. My husband loved it! Thanks for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Averena Maenz"
},
"reviewBody": "Delicious. I did 2 coconut milk cans and about 3 table spoons curry paste. Best soup I’ve had in a long time!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michaelle"
},
"reviewBody": "Burst of flavors!! I add a small amount of rice noodles too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy D"
},
"reviewBody": "This was my favorite new recipe all year! Wow - spicy, flavorful, great Thai taste. Just as good the next day. Worked well with lite coconut milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Fosnaugh"
},
"reviewBody": "Absolutely delicious! One of my favorite soups to make over and over again. The only changes I make is I add three kaffir lime leaves (I planted my own tree because I had a hard time finding them), and chrushed red peppercorns for spice. Use whatever ingredients you want. I add baby carrots, bamboo shoots, baby corns, any mushrooms, and I use the mixed frozen seafood pack from costco which contains shrimp, scallops, mussels, and squid. FANTASTIC!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jill greywolfe"
},
"reviewBody": "I've tried to make this type of soup so many times and it never came out right. This turned out fantastic - a couple pro (hahahah) tips: 1. You can buy lemongrass in a tube (just like cilantro or garlic) in your produce section. 2. I use fat-free coconut milk and haven't missed the fat/calories."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foody316"
},
"reviewBody": "Just add some Kafir Lime Leaves to the broth while simmering and it's perfect!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alia"
},
"reviewBody": "Insanely great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Terry Sparks"
},
"reviewBody": "delicious soup. really easy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jakes6969"
},
"reviewBody": "Love this soup ! Sometimes we use chicken instead of shrimp and also add baby bok choi and baby corn !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sherri codelle"
},
"reviewBody": "Way too much coconut milk cans next time I’ll order from the restaurant much cheaper and very disappointed. It was bland lacking flavor and again use 1 can of the coconut milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gigi"
},
"reviewBody": "Great soup, very tasty and wasn’t as spicy as I had thought it would be. I did change it up a little. I added cabbage and diced potatoes, reasoning being because I wanted more substance. I definitely recommend this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TinaW"
},
"reviewBody": "Simple &amp; easy to follow. Flavor is delicious! My husband just raved about this soup and he’s not a huge soup guy. I did two things different - I used shrimp broth instead of chicken broth (hello, I just pealed a pound of raw shrimp for the recipe...) I also added red bell pepper. I highly recommend trying this."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
"name": "Thai"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/1898/world-cuisine/asian/thai/soups-and-stews/",
"name": "Soups and Stews"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/",
"name": "The Best Thai Coconut Soup"
}
}
]
}
}
, "about": [
]
}
]