				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "The Original Donair From the East Coast of Canada"
,"datePublished": "2020-06-18T23:40:48.000-04:00"
,"dateModified": "2022-09-08T09:35:31.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Del"
,"url": "https://www.allrecipes.com/cook/4090629"
}
]
,"description": "Try this homemade donair recipe featuring thick slices of spicy beef topped with a creamy, sweet, and tangy sauce wrapped in pita bread."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/vl76kI_alZXDnmKCK50fvgjho9I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2242400-80ff19df42584cdbbe95498b5df9f179.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "The Original Donair From the East Coast of Canada"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "75"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "450 kcal"
,"carbohydrateContent": "57 g"
,"cholesterolContent": "64 mg"
,"fiberContent": "2 g"
,"proteinContent": "22 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "814 mg"
,"sugarContent": "24 g"
,"fatContent": "14 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 pound ground beef",
"2 teaspoons cayenne pepper",
"1 teaspoon ground black pepper",
"1 teaspoon onion powder",
"1 teaspoon garlic powder",
"1 teaspoon salt",
"1 teaspoon paprika",
"1 teaspoon dried oregano",
"1 (12 ounce) can evaporated milk",
"0.5 cup white sugar",
"0.25 cup white vinegar, or to taste",
"6 large pita bread rounds" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Make the meatloaf: Mix ground beef, cayenne pepper, black pepper, onion powder, garlic powder, salt, paprika, and oregano together in a large bowl until combined. Shape mixture into a loaf and place on a baking tray; cover with plastic wrap and let rest in the refrigerator overnight."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bake meatloaf in the preheated oven until no longer pink in the center, about 30 minutes, turning the loaf over halfway through cooking. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Allow the meatloaf to cool so it holds together for slicing."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, make the sauce: Stir evaporated milk and sugar together in a bowl until sugar is dissolved; add vinegar, 1 teaspoon at a time, to taste. Refrigerate sauce until ready to serve."
} ,{
"@type": "HowToStep"
,"text": "Slice meatloaf into 1/4-inch thick slices; brown each slice in a skillet over medium heat until browned and crisp, about 5 minutes per side."
} ,{
"@type": "HowToStep"
,"text": "Sprinkle pita bread rounds with a little water; warm briefly in a dry skillet over medium heat."
} ,{
"@type": "HowToStep"
,"text": "To serve: Place several slices of meatloaf into each warmed pita bread; spoon about 2 tablespoons of sauce on top and roll into a cone shape. Wrap each donair in aluminum foil to keep the sauce from dripping out; serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT585M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Manvel-Emerson"
},
"reviewBody": "The meat is awesome! I only used 1/4 tsp of cayenne though and I bought the tzatziki sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The seasoning to meat ratio is way too much. I even halved the cayenne and it was still too spicy. It was too salty even with the vegetables and sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DREGINEK"
},
"reviewBody": "This was great! Being from the Midwest, never heard of a Donair - and we loved them! Reduced cayenne to 1 tsp - which was perfect for me. Somehow, I misread step 2!??! Which turned into being a happy accident. Instead of simply putting the loaf on the baking sheet, I also rolled it out to 1/4” thickness - which was kinda a sticky process but worked! The result is that the meat both shrunk but also, crisped up nice so I could skip the pan fry in step 5. I baked for 35 min but if I did again - the same way - I would only cook for 25-30 min. Took the tips from others of adding some garlic powder (agreed!) to the sauce and a tsp at a time for vinegar. Simpático! Finally, sautéd some sliced red onion and red bell peppers to top the “Midwest-take-on-the-Donair” and make it complete. This was delicious and would absolutely make again! Thanks for sharing this great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Grammma"
},
"reviewBody": "This worked really good : Note, when you mix the meat roll in hands and slam the meat back in bowl pick it up and repeat, do this at least 20 times. This really compacts the meat and assures it does not crumble when cooked. Cut thinly after it has rested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Reardon"
},
"reviewBody": "I have used this recipe before but have found that the amount of cayenne pepper is to high so time I cut it in half. I also used 1 lb of lean ground beef and one lb of ground Lamb. My butcher is good and will grind them both together. The other thing that is missing from the recipe is the Tomatoes and Onion. Other than those things this is the best recipe outside of Halifax ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sue Morgan"
},
"reviewBody": "I think that there should be 1/2 tsp of cayenne not 2tsp.\nI lived in halifax for 9 years and there is no way that donairs were hot. a typo perhaps. couldnt eat them. I will try again with less heat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Reid Jurkowski"
},
"reviewBody": "Amazing. I haven’t had a donair since I lived on the east coast (20+ years). This was the real deal! My family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "G1zmos"
},
"reviewBody": "Added 1/2 tsp of garlic powder to the sauce, much better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reice Newson"
},
"reviewBody": "Amazing recipe. Easy and worked great. Made it late afternoon and then let it rest in the fridge until I cooked it for lunch the following day. Didn’t try the donair sauce. Only thing I will say is that it was a bit spicy. I will probably reduce the amount of cayenne pepper next time - maybe one or one and a half teaspoons instead of the full two, but it depends on your taste. Overall, incredible though. Very similar to, if not better than, the authentic thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sean"
},
"reviewBody": "Being from the East Coast, I enjoyed this recipe. If I had one critique, I would cut back on the cayenne pepper. 2 tsp for a pound of burger is a bit much. Other than that, it was fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elaine Miller"
},
"reviewBody": "Too much cayenne. 1/2 tsp is plenty. Prefer other recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruno Huard"
},
"reviewBody": "Made without any change. Very good! Did it twice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Learningtobake"
},
"reviewBody": "Finally, someone who knows how to properly make the sauce. NO garlic!\n\nFor those of you who think that donair sauce always had garlic in it, you are wrong. That is a late 90's thing.\n\nThe meat already has garlic in it. The sauce doesn't need it too. The sauce is supposed to be a sweet contrast to the spicy meat. Adding spice to the sauce ruins it.\n\nBy the way, garlic powder makes your breath smell terrible. Fresh garlic with the green or purple center stalk removed before eating or cooking leaves almost no smell. They don't remove that center stalk when they make garlic powder.\n\nExcellent recipe. Well done!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Pugh"
},
"reviewBody": "Excellent recipe! I doubled the recipe and didn’t cook it as long as indicated. Delicious! Very similar to our donairs in the Maritimes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kyra Ross"
},
"reviewBody": "Agree with Rex there, this recipe comes out way too hot if you follow to the T. I'd recommend using half the cayenne pepper in the recipe unless you like drowning your donair in the sauce to keep the heat down. I also second luvtocook's recommendation of throwing some garlic powder in the sauce, gives it a nice savoury touch and offsets some of the sweetness. Otherwise makes for really tasty donair meat. Cut ours thinner and used a little butter for the frying which gave it a nice crisp to the edges. Use an immersion blender if you have one for a thicker sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacie"
},
"reviewBody": "Too much cayenne pepper in meat mix, too much garlic in sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brew Master"
},
"reviewBody": "This recipe is awesome. I have made it a few times. I like the sauce better following another's review that suggested 1 tsp garlic powder with sugar. And I couldn't get my first one to thicken until I used my immersion blender on speed 1. Speed 2 painted everything around with sticky spots. Lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike T"
},
"reviewBody": "I’ve never been to Canada, so can’t say how authentic this recipe is. However, I thoroughly recommend it. Very, very nice indeed. It is in my favourites list and will be a regular on the menu in my kitchen. Big thanks for sharing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cbutyn"
},
"reviewBody": "I used medium beef which seemed to be good choice. It was easy to slice and it fried up nicely. i did not make the sauce, i had some premade that i wanted to use up. i will make it again, and look forward to trying the sauce next time. I used double the meat, and about 1 1/2 times the spice, but would up the spices to double also, if i were to double it again. i was careful with the hot pepper. Easy to make, and easy to prepare with people eating at different times. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SANDRA MACDOUGALL"
},
"reviewBody": "I tried to make these as written in the recipe, but I was making a much larger batch. I used 5 lbs of ground beef. I followed exactly except for the cayenne and slightly reduced it. Still way too much. We like spicy food, so I thought we'd have no problem, but there is way too much cayenne pepper in this one. If you make the sauce without the garlic, it helps to tone down the pepper in the meat. I definitely will make this again, but will be adjusting the pepper even more.\n\nI used sweetened condensed milk instead of condensed milk and sugar and gradually added vinegar until I got the right taste. It was what I had on hand."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas Markin"
},
"reviewBody": "My wife is from Nova Scotia and she calls this recipe her taste of home. We spent a number of years in Halifax and we love our Halifax Donairs. \nThis is as close to the King of Donairs as we will get without flying to Halifax.\nThank you for sharing this great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kevin"
},
"reviewBody": "I will make this again but cut the cayenne pepper to 1/2 tsp. It was so hot I had to throw it out. Look at all the other recipes and they have similar ingredients except the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jackie Pack"
},
"reviewBody": "I made the mistake for the 1st time ever, of not reading others reviews. I like spicy, but the cayenne overpowered the rest of the ingredients and I didn't even use the full amount. Definitely needs half the amount of cayenne. I would have given this 5 stars except for this major downfall."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chloé LeBlanc-Libotte"
},
"reviewBody": "Sauce was perfect. Maybe a bit sweet, will probably put less sugar next time. I added fresh garlic to the sauce and the vinegar one tablespoon at a time and the consistency was perfect. The meat was lovely, perfectly seasoned, I followed the advice of the other reviews and halved the cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taylor Marriott"
},
"reviewBody": "So easy, I actually read the recipe wrong and didn't leave it to sit in the fridge, just mixed it all up and baked it inside the loaf pan and it turned out perfect even then.\n\nI've made this five times now this way, it's much quicker. Such a simple recipe and everyone always loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Saira Hirji"
},
"reviewBody": "The meat was great, but I personally didn't prefer the sweet sauce. I think I'll try it with a yogurt based sauce next time. Overall, it was good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ethel Jordan"
},
"reviewBody": "Definitely will make it again. Used fresh onions and garlic, rather than powder, so added an egg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KraklinRose"
},
"reviewBody": "Being american, we've never had the pleasure of eating Donair's at a restaurant, but watching our favotire ytube channel, a certain 1puglife, we saw them eating and talking about donair's. Anywards, after researching what the dang thing was, found this recipe and made it! Holy smokes, these are awesome! I followed the reviews suggestions and added garlic powder to the sauce, it was a good decision. The sauce was a tad too sweet for us, I will cut back the sugar next time. I also followed suggestions on cutting back on the cayenne pepper...good call! \n\nThanks for this delicious recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "OK, I read the reviews, scrutinized the ingredients, and adjusted the recipe accordingly. We're sort of middle-of-the-road on spicy food (maybe 6 on a scale of 10), and I just knew that 2 tsp of cayenne for 1 lb of ground beef was going to be too much for us. I added only 1/2 tsp and, yes, you definitely still could taste the cayenne. We're not too much into super sweet things these days, so I also cut the sugar in half for the sauce which worked out perfectly (personal taste preference). I mixed the milk and the sugar with my battery-operated whisk, gradually added the vinegar, and ended up with a beautifully-textured sauce. I had concerns about the sauce, but the combination of the savory meat and the sweet sauce was perfectly balanced. This was my first Donair, but it won't be the last. This is a keeper and is going into my Favorites folder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "walkin_round_town"
},
"reviewBody": "Almost perfect. The spice level is fine with me if I was the only one eating it. Unfortunately, not always the case so I would start with half the cayenne and taste testing it by frying a mini meatball size, then adjusting to taste. Depending on how much sauce you use, it may be perfect as is. I add 1 tsp of garlic powder to the sauce, but that's just my preference. This also goes great with tzatziki sauce too and pretty closely mimics the taste of gyro meat without the spit and the ingredients are budget friendly, accessible and good for all levels of cooking skills. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bwoodland"
},
"reviewBody": "Turned out perfect with half the Cayenne pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brownellwm"
},
"reviewBody": "I've made this recipe a couple times. It's turned out every time. If you have problems with the sauce try adding the vinegar, stir once or twice and let sit for a bit. Kind of like making buttermilk. Or use sweet condensed milk for a really thick sauce. I add garlic to both. Have fun with it and try making your own pita breads:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drogum"
},
"reviewBody": "Good basic build recipe. The sauce needs garlic powder and white pepper though to be more in line with the real deal in Halifax."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "K Lee"
},
"reviewBody": "WAAAAAY too hot. It's so spicy that you can't even taste the meat. It was so uncomfortable to eat. I should have followed my instincts and cut the cayenne in half, but I stupidly followed the recipe to a T. I'd cut the cayenne waaaaay down. Won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shelby"
},
"reviewBody": "I made this for my friend tonight, who has had donairs across the planet. This rated a million stars by his account, and mine! I doubled the recipe and kept the cayenne to 2 tsp. -also, the sauce did not require the whole 1/4 C., the taste method was a great tip. Thank you so much, I will make many more Donairs in the future! Happy eating!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TERRIS911"
},
"reviewBody": "I added spinach leaves, diced tomatoes, and feta cheese to my Donair sandwich, may not be the original, but it's very, very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Taryn Reid"
},
"reviewBody": "Made this exactly as it recipe calls for the first time. It was great. Very spicy, and sauce was a little runny. Next time, cut back to 1/4 of the cayenne, and I used (out of necessity) condensed sweetened milk 2/3 c plus 1/4 c white vinegar and 1/2 tsp garlic powder. Sauce was thicker. Great either way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan De Marchi"
},
"reviewBody": "Simply delicious . Makes a fantastic quick meal .Might even replace my regular friday pizza...it will definately be added to my homemade pizza ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CSANGEL"
},
"reviewBody": "So Fabulous! Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AndreaW"
},
"reviewBody": "This was great! Definitely consider reducing the amount of cayenne though...I halved it and still found it overpowered the flavour. Next time I'll probably limit it to a half teaspoon and add a bit more garlic powder. Also, as others mentioned, adding some garlic powder to the sauce works well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Bignell"
},
"reviewBody": "Mmmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Christy"
},
"reviewBody": "Fantastic! As close to the donairs I remember from back home in the Maritimes that I have found! I didn't have any cayenne pepper so I ground my own red pepper flakes. I'm only giving a 4 star because though this sauce was good, I also made a version using sweetened condensed milk (2/3c) with 1/4C Vinegar and 1 tsp of garlic powder. Let it chill for an hour. I compared both and mine came out ahead. SUPER thick &amp; delicious!! Thanks for this recipe, it's keeper.\n\n** Edit ** Ok, so it's the next day and I tried the leftover, unused original sauce that is with this recipe and it thickened up really, very well and tastes *delicious!* I guess the trick is if you can make it a day ahead, go for it &amp; it won't be runny, just resist the urge to stir the next day. My version is still thicker, but both are great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheri S."
},
"reviewBody": "I enjoyed these donairs...I ran out of cayenne and only used one teaspoon and it was plenty spicy. I agree with others that the sauce is too runny (and I even left out a little of the milk) but it was still good. I added several sprinkles of garlic powder to the sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krisstah"
},
"reviewBody": "Tried this and Loved it!! Used less cyanne pepper because i didnt want it to be too spicy and i added garlic to the sauce, Will no longer be buying donairs from take out places =) Thanks so much!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lauren Linton"
},
"reviewBody": "i thought this was great. this sauce recipe looks better than dash's recipe on this site. \n\n i used this method---\n\nStir canned milk, sugar and garlic powder until sugar isdissolved. Add vinegar and continue mixing. The quicker you add thevinegar and the less you mix (I usually give the spoon 3 or 4 turnsaround the bowl), the thicker the sauce will be. Let sauce sit for atleast one hour in refrigerator before using. Eventually (hours to dayslater), the sauce may start to separate. DO NOT STIR IT. Simply skimthe thick sauce off the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "muslim mom"
},
"reviewBody": "I've never been to Halifax, but I have to say, this was mighty tasty. I was craving Turkish Doner...and used the meat recipe to satisfy that craving. Would use 1/2 the cayenne next time--but other than that, great. Didn't have any evap. milk--so made tzatziki sauce. So good and easy. A lot healthier too than typical doner, as I used 93% lean ground beef. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rex Hutcheson"
},
"reviewBody": "8-24-11: This turned out much too hot. Maybe I made a mistake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beetle"
},
"reviewBody": "This was amazing brought me back to navy days in Halifax. It is absolutely the east coast donair"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beeker"
},
"reviewBody": "Really good recipe, I add 1 tsp of cumin and an extra tsp of garlic powder to the meat and have a different recipe for the sauce which includes garlic. Make this frequently and usually make 5lbs of meat at a time because it freezes so well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lenore"
},
"reviewBody": "I made these donairs for supper the other night and my husband can't stop raving about them! I followed the recipe exactly and couldn't believe how easy they were to make! The meat sliced like it was roast beef and it was easy to get very thin pieces. For some reason though, the sauce seemed like the recipe called for too much milk. It was too runny. I did mince up some fresh garlic until it was a smooth paste and added it to the sauce. Though runny, the taste was awesome! I left it in the fridge until it was chilled.Next time I think I will use less milk.I can't wait until I make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tammy O'Toole"
},
"reviewBody": "My husband is from just outside of Halifax, and he thought 'we are on to something good'. That means the recipe is pretty darn close to the real thing. We prefer the sauce to be a bit more tart, so I added more vinegar than the recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Braveheart"
},
"reviewBody": "I have been using this very same recipe for years now, with the addition of 1 tsp of garlic. Just like that other Maritimer. I use the sauce for quite a few other dishes as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dayzee1965"
},
"reviewBody": "This was very good. I didn't have time to leave overnight so I don't know if that made a big difference in the spicy part but next time i'll use less cayenne pepper. Will definitely make again!!Thanks for sharing the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laurie"
},
"reviewBody": "great recipe ,we have loved east coast donairs for years hard to find a restaurant in our area so now we can enjoy them at home and they are 100%as good as any restaurant quality donair we have ever had"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicki"
},
"reviewBody": "Just like the ones at Big Red's in Chester NS. Thanks for taking me home for awhile! Everyone in my family liked it. An easy make ahead recipe. I did add the garlic powder like someone else suggested because that's the kind of sauce I'm used to. Here's a hint no one mentioned. The sauce is thicker right after it is made than if it sits in the fridge for any length of time. So I chilled it a bit and then used it right away. This is fantastic!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judith"
},
"reviewBody": "I thought this was pretty good although a bit hot for our taste. I was able to let the uncooked mixture sit for a few hours only rather than overnight as the recipe suggests. The sauce was a bit thinner than I had expected but perhaps was due to my method of mixing. I thought the taste, sweet/sour was a nice combination with the spicy meat slices. Thank you very much for taking the time to share your recipe with us. I will make this again but will decrease the cayenne a touch, and I might try it with ground pork."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "luvtocook"
},
"reviewBody": "I am a Maritimer and this is almost identical to my recipe but I mix in 1 tsp of garlic powder to the sugar when making the sauce. It is important to make sure you add the vinegar 1 Tbsp at a time and mix well so it will thicken. We had many a donair party while living in Western Canada and got many western friends addicted to our yummmy donairs!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/211191/the-original-donair-from-the-east-coast-of-canada/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
"name": "Sandwich Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16770/main-dish/sandwiches/gyros/",
"name": "Gyro Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/211191/the-original-donair-from-the-east-coast-of-canada/",
"name": "The Original Donair From the East Coast of Canada"
}
}
]
}
}
, "about": [
]
}
]