				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "The Ultimate Berry Crumble"
,"datePublished": "2020-06-19T00:28:23.000-04:00"
,"dateModified": "2022-06-12T19:55:12.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Chef John"
,"url": "https://www.allrecipes.com/cook/foodwisheswithchefjohn"
}
]
,"description": "This berry crumble recipe by Chef John delivers a summer dessert loaded with blackberries, raspberries, and blueberries topped with a buttery crumble."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JSqM_zBzlNGRKTAY0_ovTqAsrVU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5388328-the-ultimate-berry-crumble-Chef-John-1x1-1-afe0d6a6136542cf937b1f0b104ad0f5.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5782702491001",
"description": "",
"duration": "PT8M51S",
"name": "Ultimate Berry Crumble",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/61e8f1ad-1ebe-4265-9299-2c4a7bad7b6e/11a52e24-a0eb-4cbd-a227-df448e0c9a02/1280x720/match/image.jpg",
"uploadDate": "2021-07-14T17:41:51.417-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "The Ultimate Berry Crumble"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "127"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "416 kcal"
,"carbohydrateContent": "58 g"
,"cholesterolContent": "97 mg"
,"fiberContent": "3 g"
,"proteinContent": "5 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "124 mg"
,"sugarContent": "31 g"
,"fatContent": "19 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.75 cup white sugar",
"0.75 teaspoon baking powder",
"0.25 teaspoon fine salt",
"0.75 cup frozen unsalted butter",
"2 large egg yolks",
"1.5 teaspoons vanilla extract",
"1 teaspoon apple cider vinegar, or as needed",
"1 cup blueberries",
"1 cup raspberries",
"1 cup blackberries",
"0.33333334326744 cup white sugar",
"2 teaspoons cornstarch",
"2 teaspoons fresh lemon juice",
"1 teaspoon lemon zest",
"1 pinch cayenne pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Make crumble: Combine flour, sugar, baking powder, and salt in a large bowl. Whisk until thoroughly combined. Grate in frozen butter, stopping occasionally to toss butter into flour mixture until coated."
} ,{
"@type": "HowToStep"
,"text": "Stir in egg yolks and vanilla with a fork until egg is mostly absorbed. Add 1 teaspoon vinegar; mix briefly. Use your hands to finish mixing, squeezing until clumps form, but mixture remains mostly dry. Add more vinegar if needed. Set crumble aside."
} ,{
"@type": "HowToStep"
,"text": "Make filling: Combine blueberries, raspberries, and blackberries in another large bowl. Add sugar, cornstarch, lemon juice, lemon zest, and cayenne pepper. Mix until well combined and sugar and cornstarch are mostly dissolved."
} ,{
"@type": "HowToStep"
,"text": "Place about 1/2 of the crumble mixture into the bottom of a 2-quart baking dish. Press mixture down using a flat cup until well compacted. Spread berry filling on top. Sprinkle remaining crumble mixture over berries, squeezing some of the crumble into clumps."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/JSqM_zBzlNGRKTAY0_ovTqAsrVU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5388328-the-ultimate-berry-crumble-Chef-John-1x1-1-afe0d6a6136542cf937b1f0b104ad0f5.jpg"
}
]
,"text": "Bake in the preheated oven until top is beautifully browned and berry filling bubbles, 40 to 45 minutes. Let cool to room temperature before serving, about 30 minutes."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT85M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made it already 20 times, at least. A really nice recipe. Since I don't always have all three types of berries suggested by Chef John, sometimes I replace some two by plums or a grated apple. This works out fine, though I would not skip raspberries. Also, the short cut of using self-raising flour (without salt and baking powder) works well, unless you confuse it with the usual flour..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This just did not taste good. I followed recipe exactly. I'm a frequent baker as well. But the crumb was tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this last night as my husband has been reminding me that we need to use up the berries in the freezer. I followed the recipe exactly as is, without any changes, except that I cut it in half. I also topped it with homemade whipping cream. It was super delicious! I only have one thing to say to those people that omitted the pinch of cayenne pepper…DON’T! It’s very subtle but just what it needed to give it a little extra punch of flavor! I’ll definitely make it again! (My husband made sure I saved it!) ⭐️ ⭐️⭐️⭐️⭐️"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "What a terrific recipe! It is so easy and so good. A steady supply of berries of all sorts has had me looking for some good and easy recipes and this recipe is it. I sometime half the crumble recipe and it is still wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe, turned out delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Agopian"
},
"reviewBody": "This Berry Crumble is beyond ultimate. I followed the directions, except I left out the cayenne. I also followed the instructions that Chef John gave on the video. This recipe is a keeper, for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is a great base for the crumble (as I like a bottom to my crumble). It’s definitely does not have enough fruit though and I’m not a huge fan of tons of fruit in my crumbles. 3 cups seemed to skimpy compared to the amount of crumble when you mixed it up. I doubled the filling amount (6 cups, double lemon juice, double sugar etc). I also Replaced the white sugar with brown sugar in the crumble and added a dash of cinnamon. I Replaced brown butter in place of the regular butter (I use 1 cup brown butter as you tend to loose some butter when you brown it (brown then freeze, don’t use hot melted brown butter) . I also added oats to the second half of the crumble (maybe 1/4-1/2 cup. I also add enough vinegar to make it more wet). You can replace the 6 cups fruit with any variety you want. I’ve done peach blueberry strawberry. Apple raspberry and blueberry etc. it’s absolutely divine the way I’ve altered it! I highly recommend trying it my way as brown butter is life! Even if you don’t want brown butter as the comments suggested double the fruit amount. I’ve made it like 5 times now my way lol. I like my crumble crispy so I turned on the Broiler for a second too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Williams"
},
"reviewBody": "I added cinnamon rather than cayenne. One of the best desserts I've ever had. In fact, we are having it as our dinner tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Ok, I have to admit then when searching for a crumble recipe, the word \"ultimate\" grabbed me and so I made it after reading the reviews. It was easy and straight forward. I watched the video as I went along....I added 1/4 cup brown sugar to a half cup of white, added a bit more cornstarch as I had more than the required berries. I used a box cheese grater and had NO problem at all getting butter curls that looked just like Chef John's. I wish someone had mentioned in reviews about making it a day ahead as I'm not sure whether I should warm it up before serving, keep it in the fridge overnight, or just cross my fingers that when I serve it tomorrow with vanilla ice cream it will be the \"birthday cake\" my daughter dreamed of! I might add another review after the crumble has baked.....if my husband and I don't eat it tonight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is the BEST recipe for berry crumble! I’m making for the second time in two weeks and I’m using all blackberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "janice"
},
"reviewBody": "Doubled up for a 9x13 pan and I did a crisp topping. Great recipe filing and crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MMMICHELLE"
},
"reviewBody": "Absolutely perfect! Served it at my Book Club and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HealthRebootCoach"
},
"reviewBody": "I’ve made this a couple times with different kinds of berries. Last night with strawberries and blueberries and another time with cherries. Absolutely five star. I make extra crumble and then put it in a Ziploc bag and freeze it. This way I have enough for it next time without as much work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely the best easiest yummies recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zeline Crowley"
},
"reviewBody": "My 10 yo daughter and I have never baked berry crumble and this was simple enough to make together. It was everything a berry crumble should be…bursting with sweet berry goodness with crisp-tender cookie crumbles to top it off! We had it with French vanilla ice cream. My daughter loved it so much, she had a second helping!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vinidon2"
},
"reviewBody": "I've made this three times now and it's always the hit of the party. Served with homemade whipped cream is divine or a big scoop of vanilla ice cream. It's a wow kind of dessert. Everyone wants seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karole BertramCarroll"
},
"reviewBody": "My frozen butter did not grate like Chef John's...but that was because of the grater I used. No big deal...it looked perfectly imperfect and tasted wonderful! Great tips on scrunching the topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Lee"
},
"reviewBody": "After my 4th try looking for the perfect crumble for my summer fruit this season, I hit the jackpot with this one. It tastes like a vanilla cookie topping, delicately crisp, no raw sogginess below the top layer, and was very satisfying to squeeze the crumble together. I resisted adding extra moisture and stuck to the quantity in the recipe. Perfect! I have to admit, I was doubtful but this is Chef John after all. A few modifications - I used fresh peaches, macerated in lemon, sugar &amp; cornstarch for a couple hours and skipped the bottom layer so it was just topping. Yum. Going back for seconds now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby"
},
"reviewBody": "Our entire family loved this dessert. As suggested in other reviews, we used 1/2 cup brown sugar and 1/4 cup white sugar. Since we used frozen fruit, we added additional cornstarch. So tasty. Typically, when making crumble, we use oatmeal…since trying this recipe, we have changed our minds. So flavourful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabel"
},
"reviewBody": "Fantastic! Recommend using 4tsp of cornstarch when using frozen fruit and grating the frozen butter as per recommendations. No other changes needed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TBS"
},
"reviewBody": "I followed the directions and got an excellent dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "haf"
},
"reviewBody": "Chef John,\n\nMy late Aunt made apricot squares which were \"to die for\". So, in honesty, I made the amount of flour mixture into the amount she used then followed your directions subbing tapioca powder for cornstarch. Currently, these are in the oven; I shall amend the review upon completion (p.s. also added lavender extract with the vanilla extract as lavender lemon and blueberries are wonderful together). By the way, the only difference between your recipe for topping: Aunt Ruth used one egg and milk instead of apple cider vinegar.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "laura"
},
"reviewBody": "So good! So easy and tasted delish!!! Made 1.5 servings of the berry part for extra goodness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarkieG"
},
"reviewBody": "This dessert is incredibly easy to make. My guests actually thought I bought it at a bakery! Actually the dish I used should have given it, but then again my guests aren't the brightest light bulbs in the chandelier. Anyway, make this, you'll be the hit of the party"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fruitdog"
},
"reviewBody": "Followed the recipe and it was perfect. I was using frozen berries so I added extra cornstarch, worked out well. The crumb topping was the best, will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Rickert"
},
"reviewBody": "This is just as good as it sounds. No changes were made and we love the results! \nThe oven element fried just before I had a chance to bake this but since my husband is an electronics engineer, he found a way to swap out the oven element with the broiler element. Results: Perfect! Thanks for a fantastic triple berry recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Vitek"
},
"reviewBody": "I followed the recipe exactly. So delicious and very easy. I baked it in a deep dish 2 quart Corning container and it was perfect. Served it with lightly sweetened whipping cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "Perfect. I have used mixtures of frozen and fresh berries and apples and fresh or frozen berries. I also skip the lemon zest (personal preference). The ratio of fruit to crust is spot on and this is always a big hit. TY Chef John!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JodyN"
},
"reviewBody": "The crust is much too sweet. If I ever made it again, I would use a third to a half of the sugar, especially since it contained vanilla extract, which lends the illusion of additional sweetness. I also used a pastry blender instead of grating the butter into the batter. The addition of egg yolks was a nice touch, making it taste richer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Karamanian"
},
"reviewBody": "Delicious recipe! My picky 5 year old and my hubby loved it. We ate it up in one day"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marykatherine"
},
"reviewBody": "Ultimate is right! This is tasty beyond imagine. I’ve made it straight blackberries. Delicious I must say. And just now put in a batch of blueberry and blackberries. Can’t imagine anything but wonder coming out of my oven in about 30 minutes. The recipe says to cool for 20 minutes. I never wait that long!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Holley"
},
"reviewBody": "This is crazy GOOD. I will never use another cobbler recipe. Easy and fast to make. I didn't have enough fresh berries so I added a few frozen, thawed, drained berries. Still came out excellent. Thank you, Chef John."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Croucher"
},
"reviewBody": "So good! Highly recommend!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dusty Santos"
},
"reviewBody": "I love the idea of adding cayenne to this. It offered a slight spice to the back of the pallet that your guest won't even notice until it's half gone. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Clifton"
},
"reviewBody": "This really is Fantastic! I made it as directed and it's totally a keeper! I will be making this often."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nannypie"
},
"reviewBody": "Wonderful, Wonderful! If you love blueberries and want to please a crowd, this is by far the best berry dish I've had. I had the opportunity to make this twice within a week, once for company and the second time just for my husband and myself. The reason being, the small crowd of 6 completely cleaned the dish leaving No leftovers for the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clemmie King"
},
"reviewBody": "Outstanding! Made exactly as described and my husband and I both love it! The subtle impacts of the vanilla, vinegar, lemon and lemon zest are so divine! Appreciated Johns tips at the bottom of the recipe, and will experiment with a variety of fillings. THANK YOU JOHN for another KEEPER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy O"
},
"reviewBody": "I made this with just mulberries, &amp; in a metal loaf pan that fit inside my toaster oven, since I didn't want to heat up the house with the oven. I followed the recipe, except for the pecans I added to the topping. It was delightful! I think the next time I'll try using 1/2 brown sugar &amp; 1/2 white sugar just to see the difference. The bottom crust was a little mushy in the center, but the pan was deep so that was my bad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Martin Alexander"
},
"reviewBody": "Very good, especially with ice cream. I melted the butter and cut it in with a pastry cutter, rather than grating frozen butter and using a fork....much, much easier! Used brown sugar in the crumble, and added some cinnamon and a bit of grated nutmeg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CATH292"
},
"reviewBody": "This needs much more filling than the recipe calls for. As the recipe is now it’s just two layers of crust with a very small layer of blueberries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Happy Grandma"
},
"reviewBody": "Followed the recipe exactly after watching the video -- and it was indeed delicious!! Made sure to have a scoop of vanilla ice cream to go with it!! Wouldn't change a thing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Yvette V"
},
"reviewBody": "Absolutely love this! I am hooked and love it, love it, love it! Thank you for sharing this \"to die for: crumb delight! Soooo ymmmy!!\nYvette Vargas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Susan Becker"
},
"reviewBody": "Sorry Chef John, the Ultimate Berry Crumble, in our opinion, is not worth wasting the ingredients. I did follow the listed ingredients and instructions to a letter. We anxiously waited for the berries to cool so we could enjoy. We have enjoyed everything else of yours and this was a surprise. I have to be honest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mømø"
},
"reviewBody": "Lovely crunchy flavour with a semi sweet filling. Its a beautiful dessert and will do well at any gathering. Also very easy and fun to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scarlie"
},
"reviewBody": "This was delicious! I loved the texture.\nI didn't have a pastry cutter - I used a food processor and slowly pulsed the butter in. \nI didn't have the Chinese allspice (sounds interesting) so I used cinnamon/nutmeg. \nThank you Chef John"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "olivia"
},
"reviewBody": "Seriously wonderful! Not too sweet - just delicious. I would recommend serving it with ice cream or whipped cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandy"
},
"reviewBody": "This was fantastic. I will add more rasPberries and blackberries next time. This is a great dessert to have any time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOCTORDON"
},
"reviewBody": "Tasty but not overly sweet. Went great with vanilla ice cream or whipped cream. Would definitely make again.. I used all frozen blueberries that had been in the freezer for a while while I was cleaning out and cooking up all of the food in my house during the government mandated quarantine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa McGlinn"
},
"reviewBody": "so yummy. I swapped 1/2 cup of brown sugar for the white sugar in the crumble and it was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ron beard"
},
"reviewBody": "OMG, that CRUMBLE! used what fruit i had on hand. (apple, orange zest and juice, blueberries and cranberries). The filling does not matter! Follow the instructions exactly and what you get is a crisp crumbly masterpiece, full of tiny pockets of caramelized sugar and butter. the taste is warm but clean and the subtle, tactile changes between the edge and the middle are so so satisfying bite after bite! Five stars for real, John!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Haylee Fry"
},
"reviewBody": "It was a bit dry, but everyone enjoyed it with ice cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anthiad"
},
"reviewBody": "Very good. I added cinnamon to the crumble and subbed half the sugar with brown sugar in the crumb mix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanHW"
},
"reviewBody": "I made this for me and my husband for Valentine's Day. Loved it! It will be even better in the summer when I can get fresh local berries. I didn't put the cayenne in because I forgot to pick some up at the store. I'll be interested to see the difference next time. I was concerned because the crumble mixture was so dry, I thought it would fall apart, but it came together beautifully! I'm sure this will become a go-to dessert for many occasions!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sam O"
},
"reviewBody": "very delicious and easy. I did not change anything except I added approximately a half a cup of finely chopped walnuts and that made the crumble a little crunchier which I like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Scheffer"
},
"reviewBody": "I'm a new cook and really appreciate chef John's Relaxing voice and he makes cooking enjoyable and stress free. The dish was amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Gibson"
},
"reviewBody": "This is the BEST thing I've ever made. Delicious, easy, and pretty too! I doubled the blueberries and didn't add raspberries because I didn't have any. I used frozen fruit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diana Dee"
},
"reviewBody": "Amazing!!!! I get so many compliments. I Have swapped out the berries and it’s still great. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAA"
},
"reviewBody": "Easy and tasty!\n\nI added an extra 1/2 cup of blueberries. Next time will try subbing another berry for blackberries to avoid seeds. Appreciated the technique demonstrations in the video."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "travers328"
},
"reviewBody": "next time I would use more fruit"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark W"
},
"reviewBody": "I made this and it is indeed absolutely amazing. The extra crumble on the bottom makes all the difference"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shari"
},
"reviewBody": "I made this twice. The first time exactly like the recipe with the cornstarch. It was delicious but a bit thick. The next time I made it I left out the corn starch and added one cup more blueberries. It turned out perfect. I will make this again as my husband will make sure of this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daphne "
},
"reviewBody": "Delicious!! My family loved it. I added clove to bring in the fall, and it was yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda McDonald"
},
"reviewBody": "This recipe has become legendary among family and friends. Everyone loves it! Even worth grating the\n butter in a hot summer kitchen."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PatriciaFR"
},
"reviewBody": "Had to give recipe to two friends after I made it - delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cindyfromboise"
},
"reviewBody": "This is an excellent dessert to share with guests. We grow blackberries which makes it that much better. Chef John gives great tips - watch the video."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela martin"
},
"reviewBody": "This was delicious! I did not change a thing...I used fresh lemon and a sharp fork to get the lemon zest off the lemon... I definetely recommend doing this! This was the best berry crumble I have ever made! The dough was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Hamilton Ulmer"
},
"reviewBody": "Second time making this. I followed the recipe 100%. This is delicious exactly as it is written"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ian Stu"
},
"reviewBody": "We really liked this. But I don't eat eggs so used chia seeds as a replacement. This worked but too much water and as a result lost the 'crumble' - it was more like pastry. Next time I will used less water. The video was perfect and I highly recommend anyone to see it before making this desert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelly"
},
"reviewBody": "I absolutely loved it. Have made it several times now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan"
},
"reviewBody": "I've made this a few times. It really is the ultimate! I've made it with vatiations of all kinds of fruits: the berries, blueberries and peaches. I'd like to try peaches and cranberries next! Other than the fruit, I made no substitutions. Fantastic recipe! And I love grating the frozen butter. Genius!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aline Silberg-Delpierre"
},
"reviewBody": "just delicious!easy !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PAB"
},
"reviewBody": "My husband and amateur food critic son loved this ultimate berry crumble. I made the recipe exactly as written and served with a scoop of vanilla ice cream. For those who expressed frustration with grating the butter, you must freeze the butter first and use a grater, not a micro plane zester, which has very tiny holes. I would not change a thing. The flavor of the crumble reminded me of shortbread. It was not bland at all. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "surus"
},
"reviewBody": "I had three cups of strawberries and one cup of blueberries leftover from making another recipe so decided to give this a try. I followed the recipe except melted the butter instead of cutting it into the dry ingredients. Much easier. I never made a crumble with a bottom layer but it turned out great. I kept going back for one more spoonful until it was all gone. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Potpan"
},
"reviewBody": "Ultimate is right. The both tender and crisp shortbread crust and topping make this dessert A+."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maritime Ukrainian "
},
"reviewBody": "It was okay, the crust/base was bland. I would make it with brown sugar instead to add some depth of flavour and the caramel flavour would really enhance the berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chrissie Le Pere"
},
"reviewBody": "My family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen"
},
"reviewBody": "My company loved this! I sprinkled sliced almonds on the top before baking and served with a scoop of vanilla ice cream...will certainly make and serve again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jsmith"
},
"reviewBody": "Excellent ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy McKinney Johnson"
},
"reviewBody": "I made no changes. I will make it again. Loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Douglas "
},
"reviewBody": "Superb! My whole family ate this. My wife and I loved it.... will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "adriana mooney"
},
"reviewBody": "I’ve made it twice. This time I skipped the bottom crust and put more crumbles on top. No raspberries. They get too mushy. I used a combination of fresh and frozen and used lots more. I filled the pie plate almost to the top with berries and then put a heavy layer of crumbles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fay Abdalla"
},
"reviewBody": "My absolute favourite recipe ever! This crumble really lives up to its title. I’ve made it several times.. even with cold margarine on those days I have a craving but no butter on hand and it comes out just as good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendelika Cline"
},
"reviewBody": "This recipe is wonderful! I made it with fresh picked Gravenstein apples and added a touch of cinnamon and nutmeg to the fruit filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jill Dibbly"
},
"reviewBody": "As always, Chef John has gone above and beyond to create a dessert that is an explosion of flavours to tantalise your taste-buds. I have never tried putting cayenne in a desert before, but it gave it wonderful zing to the fresh fruit!\nMade to the exact recipe using strawberries, blueberries and raspberries purchased fresh at our local farmers market. It would have been peaches but our 4 boys devoured them to fast! :)\nThank you chef John, you are amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sheryl"
},
"reviewBody": "The crumble was good, but I think it would be better with more fruit. Followed the recipe exactly; the crumble is too thick and the fruit filling is too skimpy. I'd try again just because the crumble part was good, but would add at least 1 1/2 cups more fruit, possibly even double the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sltravis66"
},
"reviewBody": "Wow is this good stuff, I used frozen berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kirt"
},
"reviewBody": "I made this crumble after watching Chef John`s video. It turned out wonderful, My wife loved it, took some to a work ,to her friend, now we have another Chef John fan. \nWhat I found the most helpful was the way he shows you how the crumble should look and feel when its got the right amount of moisture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steven"
},
"reviewBody": "Made gluten free substituting almond flour and cassava flour for wheat. Unbelievably delicious. This is now a weekend standard."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aylisa Marion"
},
"reviewBody": "This was delicious! I followed the recipe exactly, but used 1 c strawberries, 1c blueberries, and 1c raspberries. It turned out a little too \"juicy\" for my liking (I like mine more on the \"crumble\" side\", so next time I will probably use more cornstarch to thicken. I am making it again this weekend! Definitely one of my favorite desserts of all time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "timyjl"
},
"reviewBody": "Cheries, blueberries and a mango. yum."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gloria"
},
"reviewBody": "This is the first time I have actually watched a video for a recipe. (I guess I think I got it all figured out by now!) But I did watch Chef John's video showing him enjoying grating butter for the crumb topping. I have never grated butter before as it shows how to do in this clip. So being the bold explorer I decide to try this as he says it is so much easier than using my pastry blender. Well \"News Flash\" it is not easier and well nigh impossible to do. I used a Microplane ribbon grater with the attached plastic food holder for the butter. The frozen butter just would not easily grate. A little fell through but it was such a hard slog. This was not fun and it was not easy. I finally just used a knife and cut the butter in little pieces. Chef John seemed to have such a good time doing this. I just don't get it. Anyway I made the recipe the same except I just used blue and black berries and it was good but really not \"ultimate\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "I used this crumble topping on a blueberry and it is absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krazyk4costarica"
},
"reviewBody": "Used both frozen and fresh berries."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sara"
},
"reviewBody": "I can't tell you how many crisps, crumbles and cobblers I've made over my 40+ years in the kitchen - but believe me when I tell you this one is the ultimate. So good I've committed the crumble mixture to memory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "marzie"
},
"reviewBody": "Turned out perfect! Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clovis2011"
},
"reviewBody": "I have made this twice and it is wonderful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "This is amazing! I don’t always take the time to watch recipe videos, but this one was helpful. I used all raspberries and forgot the cayenne, but kept everything else the same. So good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan-M"
},
"reviewBody": "Just found this recipe and gave it a try right away. It was a very tasty dessert that was really good while still warm. Packing the bottom of the baking pan was easier when it was put in the fridge, otherwise it kept sticking to my hands or the cup I used. Will definitely do this one again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Renate"
},
"reviewBody": "This is a keeper! Thank you!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/264590/the-ultimate-berry-crumble/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
"name": "Fruit Desserts"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
"name": "Raspberry Dessert Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/264590/the-ultimate-berry-crumble/",
"name": "The Ultimate Berry Crumble"
}
}
]
}
}
, "about": [
]
}
]