				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Three Cheese Manicotti II"
,"datePublished": "2019-04-02T02:47:35.000-04:00"
,"dateModified": "2021-01-25T16:50:29.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Sonrisa"
,"url": "https://www.allrecipes.com/cook/1269652"
}
]
,"description": "Manicotti shells are baked with ricotta, mozzarella, and Parmesan cheeses."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/tReS1xerZCUWzlkWn864JflFcSQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6947421-d3c0c5838ac74fab9ec051747014de76.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Three Cheese Manicotti II"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "529"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "612 kcal"
,"carbohydrateContent": "65 g"
,"cholesterolContent": "96 mg"
,"fiberContent": "8 g"
,"proteinContent": "34 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "1679 mg"
,"sugarContent": "24 g"
,"fatContent": "24 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (8 ounce) package manicotti shells",
"4 cups shredded mozzarella cheese, divided",
"2 cups ricotta cheese",
"1 cup grated Parmesan cheese, divided",
"1 tablespoon minced garlic",
"1 egg",
"2 tablespoons dried basil",
"2 (26 ounce) jars pasta sauce" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add manicotti and cook for 8 to 10 minutes or until al dente; drain."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "In a bowl, mix 3 cups mozzarella cheese, ricotta cheese, 1/2 cup Parmesan cheese, garlic, egg, and basil. Stuff cooked manicotti with the mixture."
} ,{
"@type": "HowToStep"
,"text": "Spread about 2 cups pasta sauce over the bottom of the prepared baking dish. Arrange stuffed manicotti in the dish, and cover with remaining sauce. Sprinkle with remaining mozzarella cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake 15 minutes in the preheated oven. Sprinkle with remaining Parmesan, and continue baking 10 minutes, until mozzarella is melted and bubbly."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jewl"
},
"reviewBody": "Fantastic my family loved it. Still raving about it today. I am sure all their friends and colleagues have heard about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lildebiesnkcak"
},
"reviewBody": "This recipe is definitely a keeper. My family loved it! I did use my own homemade marinara sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leo1355"
},
"reviewBody": "absolutely delicious we also had someone allergic to tomatoes so we made one with Alfredo and they said the same"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Willabetic"
},
"reviewBody": "Added garlic salt, just a pinch and it made it all the better"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris"
},
"reviewBody": "This was absolutely fantastic! My Italian neighbor (only in the U.S. for a year) whose Mom owns a restaurant in Italy loved it s d wanted this recipe. what a huge compliment! Because I have so many in my family, I had to almost double the recipe. Beyond adding oregano to the recipe, I didn't change a thing. This will be a special meal served only a few times a year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Dudley"
},
"reviewBody": "Ah-maze-ing!! Tasted like it was from a restaurant! My only manicotti recipe going forward!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Power"
},
"reviewBody": "Manicotti filling tip: use a piping bag! Super fast and much easier!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Abby Cluff"
},
"reviewBody": "It was okay, I was really disappointed that there wasn’t enough cheese in this recipe to stuff 8oz of shells. I had to pull cheese out of the ones I made to make the last five or six which tore them apart. It makes leaner manicotti than I thought it would. So just don’t stuff them too full I guess"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Skirts"
},
"reviewBody": "Simply delicious. I used one jar 21.2oz of Signature Reserve Pasta Sauce. Served w/ garlic bread! Thanks for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KWPR"
},
"reviewBody": "I know some people get upset when someone doctors a recipe and then rates it on their own version. But that's what I did and it came out wonderful. \nFirst of all, there are only two of us so I cut the recipe down to make 8 manicotti (4 to freeze for another time). \nWe had about a 1/2 cup of homemade pesto leftover so we used that instead of the basil, and I chopped some mushrooms and cooked them until they were really brown - when they were done I threw the garlic in for a quick time to take the edge off. Since we were only making 1/3 of the recipe I left the egg out (I find it hard to portion a raw egg). To keep things easy I used pre-shredded mozzarella and 1 jar of Classico Spicy Basil spaghetti sauce + 1 small can of San Marzano tomato paste. The sauce was thick and rich. This recipe was SO easy (OK - not counting the pesto, but that can be bought in the grocery store). It will be on our rotation for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E Smith-HerAngelsFyr"
},
"reviewBody": "I used parsley instead of basil, but outstanding! Stuffed pasta is always a hit in my home!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diannevdv"
},
"reviewBody": "Addendum to my review. Foolproof way To avoid overcooking manicotti: Add Manicotti to boiling water and then immediately remove from heat and let sit for 5 min. Drain. Pasta will then be easy to stuff. \nI also used 6 Tbs fresh chopped basil in cheese mixture as well as parsley.\n I used 1/2 c. Kraft grated parmesan in the mixture but fresh grated Parmesan on top. Top with small amount of Bertolli Tomato and Basil pasta sauce, then slices of fresh Mozzarella Ball or log (I used Galbani), Then some more sauce and top that with fresh Parmesan and a few chopped basil leaves."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy "
},
"reviewBody": "I added cottage cheese and topped with italian herb bread crumbs.....otherwise absolutely yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Cali"
},
"reviewBody": "i love all things cheese and pasta. a no brainer"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Martha Hartz Dickinson"
},
"reviewBody": "very flavorful, I think next time I'll add some veggies though ... overall very good and will make again.. I would recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Ann Lewis Beaton"
},
"reviewBody": "Great recipe that I adjusted a little. I only prepared 1/2 box manicooti (7) as it's just 2 of us. iI used 2 c mozzarella 1 c ricotta 1/4 parm 1 egg 1 T italian seasoning 1 1/2 minced garlic some dried chives &amp; onion powder for filling. Put filling into gallon ziploc as suggested &amp; cut tip &amp; filled uncooked shells right from the box. Took 24oz jar of Ragu &amp; spread about 1/3 or so on bottom of 8×8 pan laid manicotti on top &amp; put more parm on. Covered with foil &amp; baked at 350 for 30 to 35 mins then uncovered sprinkled mozzarella cheese on top &amp; put back in oven for 20 mins more. Oh my.....BF loved it! Thanks for sharing. PS...This was my 1st ever attempt at manicotti other than with string cheese"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wilfreda"
},
"reviewBody": "Second time I made it. Great meal. Straightforward recipe. Only issue is that, no matter how much I stuff the manicotti shells, I always have a sizeable amount left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rommel Nabayan"
},
"reviewBody": "The cheese filling is not enough for a full box of manicotti. I would say you need to add an additional cup of mozzarella and half cup of ricotta"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Gearhart"
},
"reviewBody": "I used shredded Parmesan instead of grated and served with a side of meatballs. My family loved it. It was a request after multiple viewings of an Olive Garden commercial.\nI will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tammy Morrow Mann"
},
"reviewBody": "This was pretty good. I did only needed 1 jar of sauce. I just put a very thin layer on the bottom and poured the rest on top. I added an extra egg because mine were small and I added salt and pepper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Carysta"
},
"reviewBody": "I like this base recipe! It is a great starting point :) I put more garlic in, and also some Mrs. Dash and some bruschetta seasoning instead of just the basil. I also used some black pepper and a tiny half-dash of cayenne pepper (would have gone a whole dash but making it for my grandma and she'll notice a whole dash lol). I used oven-ready cannelloni shells instead of the manicotti shells because I couldn't find manicotti ones at my grocery store today."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kayla Rivera"
},
"reviewBody": "Really good and simple to make dinner couldn't have gotten much easier. I added side salad and bread."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shell"
},
"reviewBody": "I thought it was great! I have never made manicotti before and it was super easy. I took the advice of a couple of the reviewers and didn't cook the shells first, just added a cup of water to my sauce in the bottom of the pan and the shells were a bit too under cooked for mine and my husbands liking, so next time I will try boiling the water, removing it from the heat and then putting in the shells and letting them sit for 5 minutes and then stuff them. Otherwise, it was a hit and tasted awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leondaf"
},
"reviewBody": "It turned out delicious! The whole family loved it. The only thing I changed was to add some fresh grated asiago cheese to the topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carlee Delaney"
},
"reviewBody": "Followed the recipe exactly. Made 14 manicotti and they were fabulous! highly recommend. Very tasty and VERY easy to make. To make filling the shells simple, only boil them 7 minutes then lay them single row flat to cool before handling. put the filling mixture in a zip lock bag, cut the corner off and pipe the filling into the shells. this makes it SO SIMPLE to fill the shells."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracey Ferrari Posner"
},
"reviewBody": "I added thawed spinach to this. Don't get mad, it was AWESOME, however, this recipe w/o spinach is also AWESOME. I just wanted to use spinach this time.\nThat being said, I did not boil or soak my manicotti shells AT ALL. It's simply not the best way to do this. They tear and make a mess and you're left with a dish that really isn't very pretty. PLUS, it's more difficult, so why put yourself through all that? The time you save gives you time to make an amazing salad to go with it :-) But I digress. I did what, I found out later, what other people did...I used uncooked pasta, added in a cup of water to make sure the pasta was cooked and the dish still had it's integrity, and increased the cooking time to an hour. The result was perfect! This is my go to manicotti recipe now.\nThank you Sonia for this recipe! My husband and friends LOVED IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Belinda London"
},
"reviewBody": "My family loved this. Have made it twice and will be making it again. Very good and easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hazel"
},
"reviewBody": "I use lasagna noodles, roll them up and put seam side down....so much easier than stuffing and great for kid's portions....can do them 4 at a time.....and I can get my 3 year old granddaughter involved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tamy "
},
"reviewBody": "I halved all the proportions, soaked the manicotti for 25 min in hot water instead of boiling, grated and grilled 1/3 of an eggplant to add to ricotta mixture, used fresh basil, used 1/4 cup cheddar mixed in with mozzarella, and baked for 15 minutes covered,15 min uncovered, added parmesan then cooked an additional 15-20 min to ensure tender shells. I basically doubled cooking times but it's important shells are covered in sauce during baking to ensure they can really cook in the sauce. Very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiara Pelouch"
},
"reviewBody": "I'm not a very experienced cook, however I found this very simple, and it came out tasting great. I didn't do the leave it in once boiling water for 15 minutes thing, but it wasn't that hard to stuff. Overall, very simple, and tasted great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "It was rather bland. The stuffing needs more seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josephine Roeper"
},
"reviewBody": "This was great! Used Sicilian Homemade Ricotta Cheese from AR. Easy recipe and I followed the advice of one reviewer. I boiled water, removed from heat, and put the manicotti for 15 minutes. I'll probably do 13 minutes next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kimbriella"
},
"reviewBody": "This recipe was delicious but I added a pound of lean ground beef and an 8oz package of cream cheese which then created enough of the mixture for another half box of manicotti so instead of three cheeses there were four...this made a great meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mirabella22"
},
"reviewBody": "It was great! i used it tonight and it was my biggest hit yet. I used less motzzarella cheese but it was stil delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nungirl"
},
"reviewBody": "This is my first time making and eating manicotti. This recipe was super easy to follow. I boiled the water, placed the manicotti in the pot, then turned off the burner. It basically cooked while I made the cheese mixture. I added finely diced onions to the cheese mixture (I love onions) and parsley &amp; basil. By the time I was done with the mixture the pasta was nice &amp; firm-not fully cooked-but very easy to stuff without the mess. I put the mix in a ziplock bag &amp; cut off a corner for easier stuffing. Super delicious. Its one of the best recipes I've tried on this site &amp; I will make it again &amp; again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachael Showmaker"
},
"reviewBody": "I'm cooking this now so will update. I added spinach as another vegetable. I cut the recipe in half cause it's just my boyfriend and myself, so we just needed 2 a piece for dinner and 2 for his lunch tomorrow. I have the ingredients, so it can be dinner one day next week also. I brought the water to a boil, turned the burner off, added 7 shells and waited 14 mins. Perfect Al dente. I only filled 6 shells, one split during cooking, and I had just enough filling for 6. I put a ball of filling in one end, used a small juice glass to stand the pasta tube up and filled it from the other end. My filling didn't really look all that soft to be squeezable, so that's how I filled it and it worked perfectly and easily. I might add a small amount of meat to the sauce next time. Since I split the recipe, I wish I had another small bag of mozzarella to sprinkle over it, at the same time, it already has a lot of cheese, it's more for presentation. Serving with a small romaine lettuce salad with tomatoes and croutons and a piece of garlic bread. I'll post a pic once plated. Txs for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Coralie Carraway"
},
"reviewBody": "I have made manicotti on several occasions, and I've learned that the suggestions by others of stuffing uncooked manicotti is MUCH easier than cooked. This recipe is basically good but not quite spicy enough for our taste. I add a little more garlic, some onion and Italian spices (your choice) to both cheese mixture (needs sea salt!) and sauce (I make my own, either with or without spicy Italian sausage; when entertaining, I offer both meatless and sausage-containing). I mix prepared sauce 1:1 with water to stuffed shells, cover shells in their baking dish and bake at 375 for 25-30 min. An interesting and more nutritious variant: Add chopped spinach to the cheese mixture before stuffing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "annabelle"
},
"reviewBody": "Excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "paulyshel"
},
"reviewBody": "Very tasty. We had to cook ours longer. It was our first time making manicotti and it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pam Terry Payne"
},
"reviewBody": "HELPFUL HINT: Mix cheese and refrigerate. When firm, roll cheese mixture into logs the length of the shells. Place logs in freezer. They don't have to freeze solid, but can be prepared and frozen for future use. This will make stuffing into warm shells a breeze!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcfrk01"
},
"reviewBody": "Delicious, delicious, delicious! I've made these several times and will be making them again this week. They are just so wonderful. I too cut the boiling time down for the shells so they would be easier to fill. Snipped a corner off a gallon bag, put my cheese filling in and pipped into the shells.. easy, breezy. I also went ahead and placed my cheese on top and covered with foil, then removed for the last 5 mins or so to brown slightly. Served with homemade french loaf and salad. Fantastic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BECKY300N"
},
"reviewBody": "Loved the recipe, but did anyone else have a whole lot of cheese stuffing leftover? I thought I had filled the noodles pretty generously, but had quite a bit left. I'm going to try and freeze it and see what happens."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jade W"
},
"reviewBody": "came out great! Didn't change a thing! Cooked pasta by boiling for 8 minutes so the pasta didn't fall apart and kept its shape. Then just molded the mixture with my hands and just put it into the pasta! super easy! The mixture shaped very well"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark Host"
},
"reviewBody": "I thought this was good. I did not boil or soak the noodles, just make sure noodles are covered in sauce and bake at 350 for one hour. I used the Ziploc bag trick and it works great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan Kern"
},
"reviewBody": "This was my first attempt at manicotti, my boyfriend and I loved this, will definetly make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bomnie"
},
"reviewBody": "That's a keeper! Rich and satisfying. Took everything the other members of the site said under advisement. It was super tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kris8444"
},
"reviewBody": "Loved this recipe! I've never made manicotti before and this turned out great. The only change I will make for next time is to bake it for about 10 more minutes than instructed, it was just warm enough and we ate it as soon as it came out of the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caitlyn R."
},
"reviewBody": "THIS WAS DELICIOUS! I made this in conjunction with a different meat manicotti recipe. That one was delicious, but this one was my favorite of the two! I followed it exactly and it turned out wonderful. Highly highly recommend! Was very easy to follow as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TrishDe"
},
"reviewBody": "This recipe is fantastic and I made it as it is written. My husband and I were both pleasantly surprised."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Eisinger"
},
"reviewBody": "This is very good and easy to make!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "meri"
},
"reviewBody": "It was really good, just too gooey for my taste. Loved the flavor though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "gvallin3"
},
"reviewBody": "Everyone in my family loved this. I made it exactly as directed except for the fact that I doubled the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Peas with Honey"
},
"reviewBody": "This was really tasty, and the whole family enjoyed it, but it didn't knock my socks off or anything. I tried just soaking my manicotti in just-boiled water like suggested, but most of them split anyways. I just ended up splitting the rest of them on purpose and spooning filling down the middle. With four boys, getting food to the table is the ticket. They don't care if it's pretty or not! This was definitely a five star for the guys in my house, but for me, it was a little too simple - needed meat, or spinach, or some other element to make it truly memorable."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sgaylor"
},
"reviewBody": "Easy and so good. Great comfort food. I took the advice of other reviewers and soaked the noodles in really hot water instead of boiling them. And used a plastic resealable bag with the corner cut off to pipe the filling into the noodles. I divided the manicotti into two 7 x 11 baking dishes, put one in the freezer, and the other fed two adults and two young kids....just the right amount. Added a salad and crusty bread. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frankie"
},
"reviewBody": "DH &amp; I really liked this recipe. But like other reviews, I just thought something was missing. I will definetely be making again with a few of the suggestions that I've read now. I'll update my review then. I generally spend time reading reviews before I make a recipe but this time I was in a hurry so thought I'd just go for it. Thanks for the great Manicotti!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Canya"
},
"reviewBody": "Followed recipe as written and loved it! Perfect blend of cheeses."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mittenjobs"
},
"reviewBody": "This recipe was great. So easy. We've just moved and my kitchen is a disaster, but this was no problem to throw together &amp; clean up afterword. I used 2 large glass jars of strained tomatoes instead of sauce &amp; tossed a handful of breadcrumbs into the filling (as I'd seen in a few other recipes) &amp; it turned out great. I find it much easier to stuff the shells if you leave them a little undercooked. All 14 manicottis wouldn't fit in my dish, so I threw some in an 8x8. This recipe's definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacycharles"
},
"reviewBody": "My husband is extremely critical on Manicotti recipes... his Mom's \"is the BEST\"! However, this one received glowing reviews from him and he ate seconds! I followed the recommendations provided on other reviews to not completely cook the shells before filling and found that it was a lot easier to fill. Added additional seasoning for more flavor as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi"
},
"reviewBody": "I make this all the time..my go to recipe and I always get SO many rave reviews! I always make it with the sauce from Worlds Best Lasgana and it is so good~"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "House of Aqua"
},
"reviewBody": "This was an easy recipe to make and it was my first time making manicotti! I added a lot of garlic, onion,and bell pepper spices into the cheese mixture and subbed garlic olive oil in place of the egg. I also chopped 1/2 of an onion and added that to the cheese mixture as well to bump up the flavor since some commented that the recipe as written is bland. I am looking forward to making this for dinner again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "p_ramirez"
},
"reviewBody": "sooooo easy and sooooo good... I used my own meat sauce instead of canned sauce.... really made it perfect!!! I will be making this agaian"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MAMALEIGH"
},
"reviewBody": "I'd been craving the manicotti from a local Italian eatery, but didn't feel like eating out after a long work week. So, I thought this homemade version might do the trick. Of course, I didn't expect it to taste nearly as good as the dish offered by my favorite restaurant. Much to my surprise, this dish was even better! I am thrilled to have found this recipe. Now I can enjoy the great taste that I love for a fraction of the cost. This was my first attempt at making manicotti, and it was much easier than I expected. I followed the suggestions to soak the noodles in hot water for 10-15 minutes rather than cooking them completely prior to stuffing them. To prepare the filling, I measured the ingredients into a gallon-sized plastic storage bag and squished it together to mix. I snipped off the corner of the bag and piped it into the partially cooked shells. I only had 2 cups of mozzarella, so I used 1-1/2 cups for the filling and 1/2 cup for the topping. I made Homemade Tomato Sauce II from this site for the sauce. I'm so glad that I gave this a try!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GREATGIG"
},
"reviewBody": "My daughter and I loved this recipe though I did cut back a little on the Mozzarella that was mixed in with the ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "OK, but don't know if I'll make again. I did cut back on the pasta sauce &amp; it ws still alot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "crowe4me"
},
"reviewBody": "It was ok, a bit bland. Missing a little something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gierach.j"
},
"reviewBody": "Very good, but messy and time consuming."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gia"
},
"reviewBody": "I am just rating the filling because I made a fresh tomato basil sauce and homemade manicotti shells. The filling was perfect with added fresh basil and spinach. 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy"
},
"reviewBody": "My husband who is not usually a manicotti fan loved this! I used the suggestion from some of putting the cheese mixture in a ziploc and cutting off the end to fill the shells. In addition, I added a bechamel sauce at the end which gave the dish a delicious creamy flavor. Highly recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hpolanski"
},
"reviewBody": "I made this for my very picky husband and he LOVED it! I gave it 4 stars only because I changed a few things. I added a few pinches of crushed red peppers to the cheese mixture and used alfredo sauce instead of tomato. When I cooked it I covered it in tinfoil and cooked covered for 30 minutes. I removed the foil and added remaining cheese and cooked uncovered for 20 min (until the cheese was nice and brown)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "footballgrl16"
},
"reviewBody": "This was my first attempt at manicotti and it was really good. I boiled the water, dropped the noodles in, and let set for 5 min. This worked out great! I also put the cheese mixture in a baggie and snipped off the end to stuff them. I found i needed to put my fingers on the end i wasn't stuffing so it didn't smoosch out the back. I also think that there was too much pasta sauce, unless you are just sauce crazy (i used 1 1/2 cans and could have probably done with 1)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kcrawford13"
},
"reviewBody": "My husband and I LOVE this recipe! It was my first time ever trying to make any version of manicotti at home and it was wonderful!. I've made it twice now and I plan on keeping the recipe on my menu. It was very simple to make. To make filling the manicotti easier I suggest (as a previous reviewer did) that you fill a plastic baggy with the stuffing and cut off the corner to push the filling into the pasta. Much easier. Also, be gentle with the noodles because they tend to rip pretty easily. You should definitely try this !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "This is a great classic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bri2315"
},
"reviewBody": "This was really good and I thought it was flavorful. I only used one jar of spaghetti sauce and just par-boiled the pasta before stuffing it. I also added broccoli that I finely diced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "twoboysandagirl"
},
"reviewBody": "My family loved it. I did add a little sauted onion and spinach to the cheese mixture. Anyone have any tips on how to keep the noodles from splitting after you boil them? Did I cook them too long?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terri Rice Cornell"
},
"reviewBody": "Made this as written the first time, it was good. Now I cut the mozzarella cheese down to 2 cups and add a pound of cooked Italian sausage. Also use 2 jars of Ragu's white cheese sauce instead of red, I like it much better this way. Took other reviewers advice and did not precook the shells but added a cup of water and baked at 350 for an hour, perfect every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Italian Mama"
},
"reviewBody": "I loved it!!! That was probably one of the best things I've ever made. I soaked the shells for minutes, but they still fell apart. I filled them anyway, pinching them shut and they managed to stay together and not come apart during the cooking process. My husband is already asking me to make this recipe for our Christmas dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "TCPOKIM"
},
"reviewBody": "very good! I was worried there wouldn't be enough stuffing, since I tend to be generous with the stuffing. But in the end, I still had enough left over to fill one more shell than I had. My family of 2 adults &amp; 2 kidss ate half this - the kids had seconds (which is rare!), leaving the rest for leftovers. I added some spicy sausage to some of the shells to please hubby. I give it only 4 stars, cause even though it was very good, and I will make it again, I feel it still needs something... I may try adding some cooked spinach to the cheese mixture next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcus Woods"
},
"reviewBody": "Have cooked this half a dozen times or more. Great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "polarpixie0"
},
"reviewBody": "A pretty good base recipe, but I found it very bland.\nThe second time over, I seasoned the cheese mixture with salt and pepper, as well as some parsley and a pinch of nutmeg.\nI cooked the garlic in a tad of butter, just to soften them up a bit before adding them to the mix. (The first time I made it we were bitting into almost raw pieces of minced garlic!)\nI also shredded the mozzarella by hand, with the finest grate setting, which helped it melt more evenly into the mix.\nIt takes a little longer in the oven then stated.\nBut again, like I said, a pretty good base recipe, just season it a bit and then make it yours with your choice of ingredients!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "webergh"
},
"reviewBody": "This has good flavor but it was WAY too rich for us! I used cottage cheese instead of ricotta because I couldnt find ricotta. It doesnt have enough pasta to balance the richness of the cheese and sauce. I would add other things like peppers, mushrooms, etc to cut the proportion of cheese. I would also find a different recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Ball"
},
"reviewBody": "This recipe is really good but it is very heavy. I halved the recipe because there are only 4 of us and there were still leftovers. Whoever said this was 6 servings must be feeding giants!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KONWAL"
},
"reviewBody": "Perfect cheese manicotti! I made as written except that I heated it covered with foil for 30 minutes and then uncovered, sprinkled with the rest of the mozzarella and baked for another 15 minutes. Absolutely perfect. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bananaface"
},
"reviewBody": "This dish was a hit for adults and children alike. I changed the amount of ricotta cheese to 1 cup (because I dont like the taste) and substituted a combination of sauteed garlic, 1T red onion, 1c. mushrooms and a handful of spinach. I also only used a jar and a half of pasta sauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOK"
},
"reviewBody": "Very easy to make and very yummy for your tummy :) Didn't have any ricotta so used cottage cheese instead. I used garlic basil sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gibneny Karen"
},
"reviewBody": "I didnt have parmesan so I used romano instead. The cheese filling was good. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Scott09"
},
"reviewBody": "Even the leftovers were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weeflower"
},
"reviewBody": "This was DELICIOUS! Made it with Best Marinara Sauce yet and changed the cook time a little (because my 9x13 pan was so full), but it came out perfectly and got rave reviews from my guests!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristi Baum"
},
"reviewBody": "Great recipe. I have a hard time squeezing it into the shells with a baggie so I just shove it in with my fingers :) I also like to add chopped spinach to the cheese mixture for some added nutrition. I like to make my own sauce with venison sausage to make this a real hearty meal! HUsband gets very excited when I say, \"Manicotti's for dinner!\""
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LeprosyRosy"
},
"reviewBody": "This was so yummy and so easy to make. So cheesy!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunni"
},
"reviewBody": "This was delicious. I was short 1 cup of mozzarella so I substituted with 1 cup of cheddar for the inside cheese mixture. I also skipped the egg since I was out of them as well, added 1 tbls of fresh minced parsley to the cheese mix, and upped the sauce qty by 1 cup since I wanted a meat sauce. Used 1 lb of ground beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Takes2long"
},
"reviewBody": "This was really good! I did change a few things. I didn't cook the manicotti first. Instead, I made sure that I added extra sauce and some water to the pan. I didn't measure. I used the time honored \"eyeball\" method :-) However, the pan had LOTS of sauce/liquid. I used garlic/basil pesto in place of the regular garlic. I covered it and baked at 350 for almost 75 minutes. Then I uncovered it until it was nice and bubbly and lightly brown, maybe 15 minutes. Let it sit for 15-20 minutes and dinner was served. The manicotti were done just right, the flavor of the filling was REALLY good. \n\nI made 1 1/2 of this recipe and it filled 2 packages of manicotti shells perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacy Tolliver"
},
"reviewBody": "Me and my husband absolutely LOVED this! I added a pound of ground beef to the cheese mix, cause we can't do without meat in a meal! : )"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "IndianBeauty"
},
"reviewBody": "Great recipe..a littel too cheesy.. will definitely add spinach next time.. overall what I expected"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tiffany Ferguson"
},
"reviewBody": "delicious! My entire family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miss Mortvedt"
},
"reviewBody": "Had a dinner party of a dozen people, and everybody loved it! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "funcook"
},
"reviewBody": "This us good and was good as leftovers too. Tastes like a frozen meal. Just wished it tasted more gourmet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Stanton"
},
"reviewBody": "Me and my mom make this and it turns out PERFECT each and everytime....its one of my favorite recipes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allitewski"
},
"reviewBody": "AMAZING! I only used one 26oz can of sauce and it was plenty! And I only boiled the noodles for 5 min instead of 7 like it said on the package and they didn't fall apart but were perfectly cooked after baking in the sauce :) Thanks for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lyle"
},
"reviewBody": "Turned out great!! I also put the manicotti in boiling water. Turned off the burner an let them in the water for 5 minutes. That worked fine."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/86446/three-cheese-manicotti-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/86446/three-cheese-manicotti-ii/",
"name": "Three Cheese Manicotti II"
}
}
]
}
}
, "about": [
]
}
]