				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tina&#39;s Shortbread Chocolate Chip Cookies"
,"datePublished": "1999-10-14T14:48:01.000-04:00"
,"dateModified": "2022-09-01T11:50:23.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tina Andre' Fox"
,"url": "https://www.allrecipes.com/cook/34998"
}
]
,"description": "These chocolate chip shortbread cookies are rich and tasty — perfect for gifting during the holidays! Make the dough early, freeze it, and bake when ready."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9gATcrKVgwEkB6xe0cjyNDXmXgs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/609368-d2cd3b86a39f41bfa3ee610f525aef5f.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5640993623001",
"description": "Rich, tasty, easy to make!",
"duration": "PT49S",
"name": "Tina's Shortbread Chocolate Chip Cookies",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/2b44450e-38a5-40e3-9094-720ff8fc7c17/d1eb1b54-9621-4446-a43e-29b03ddd1043/1280x720/match/image.jpg",
"uploadDate": "2021-07-09T18:59:42.652-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tina&#39;s Shortbread Chocolate Chip Cookies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "525"
}
,"cookTime": "PT15M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "317 kcal"
,"carbohydrateContent": "30 g"
,"cholesterolContent": "41 mg"
,"fiberContent": "1 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "73 mg"
,"sugarContent": "14 g"
,"fatContent": "22 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.75 cups all-purpose flour",
"0.5 teaspoon baking powder",
"0.25 teaspoon salt",
"1 cup unsalted butter",
"0.5 cup white sugar",
"0.75 cup semisweet chocolate chips",
"0.5 cup chopped walnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 300 degrees F (150 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Whisk flour, baking powder, and salt together in a bowl."
} ,{
"@type": "HowToStep"
,"text": "Beat butter and sugar with an electric mixer in a medium bowl until fluffy, 2 to 3 minutes. Stir in flour mixture in two batches, then stir in chocolate chips and walnuts."
} ,{
"@type": "HowToStep"
,"text": "Roll or scoop dough into walnut-sized balls and place 1 1/2 inches apart on ungreased cookie sheets. Press on each cookie slightly to flatten."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until light golden brown, 15 to 20 minutes."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/9gATcrKVgwEkB6xe0cjyNDXmXgs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/609368-d2cd3b86a39f41bfa3ee610f525aef5f.jpg"
}
]
,"text": "Remove from the oven and transfer to wire racks to cool."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Veronica Roby"
},
"reviewBody": "Easy, great recipe. Make sure they cool down for awhile before you eat them. I made cookie bars in a 13x9 glass cake pan. Semi sweet chocolate chips work great in this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DENISETEDESCO"
},
"reviewBody": "These are exceptionally delicious! I made these exactly as the recipe and ended up with three dozen. Will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We did not enjoy this cookie. This is not a true shortbread cookie. Much prefer shortbread with powdered over granulated sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trace"
},
"reviewBody": "Can't rave enough about this recipe. It's so refreshing to have a recipes measurements be absolutely correct. I took advice of another review to cream the heck out of the butter and sugar. Using my KitchenAid this was a breeze. Then threw the rest of ingredients in there and 10 minutes later I had the whole lot rolled and ready for oven. Cooked 15 mins. Perfect. I manged to get 28 cookies which did look walnut size to begin with so very happy! They tasted exactly as I would have expected - yummy! I'm throwing away my other shortbread recipes - this is my go to now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe exactly, and they were fabulous. I just wonder if I could have used salted butter instead of adding salt to the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Eckstein"
},
"reviewBody": "I have made these shortbread chocolate chip cookies countless times. They are not classic chocolate chip cookies and will not have the same texture. Classic chocolate chips have eggs in the batter. These cookies are light and melt in the mouth delicious. I take half of the batter and roll in wax paper. I do this with each half of the batter. Once rolled I store the logs in the refrigerator for a day or so when I’m ready to bake, just slice and bake. They also freeze beautifully. If you are looking for a standard chocolate chip cookie this is not for you. This is a delicious buttery chocolate cookie. Thanks Tina ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "aizausa13"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wow, so good! Followed the recipe with only two tweaks. I added vanilla and no nuts. Will keep this in my favorites. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beata Buczkowski"
},
"reviewBody": "These cookies are delicious! I made them for Christmas and they disappeared so fast! We were craving them again just a few weeks later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "eichihad"
},
"reviewBody": "OMG! This is the best. I wish I had known about this recipe long time ago. I have tried in the past but shortbread never worked ( maybe because I used margarine instead of butter?).Used butter this time ( salted, unsalted not avail so I omitted the salt) I used brown sugar ( had no white) and Nestle Morsels and More ( choc morsels, carmel bits and peanut halves). These cookies are so amazing. Thank you for the recipe. It's saved now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tyler Batchelor"
},
"reviewBody": "Bad recipe. I think the flour ratio is off? I tried making these twice and they just turned completely flat and didn't brown at all. Taking them out, they just fell apart completely. Even with a cookie lifter, impossible to get these off the sheet.\n\nChecked my oven temp, it's fine. Second time I added 10g more flour and chilled the dough for a half hour, still completely flat. \n\nEvery other cookie recipe I've made turns out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alisonsmommy2012"
},
"reviewBody": "Make these all the time! I don't add walnuts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Salvation Amosa"
},
"reviewBody": "Wonder if there is a typo on the flour amount? I followed the recipe and my cookies just came out with oiled butter everywhere. Quite disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara Collinson"
},
"reviewBody": "I would honestly add 1/2 cup instead of 3/4 cups. I found the chocolate was a little overpowering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynda Jim Pedersen"
},
"reviewBody": "I had the grandkids over and promised we would make chocolate chip cookies....then I discovered I was out of brown sugar. I quickly searched all recipes for a chocolate chip cookie without brown sugar and this came up. Wow what a great find!! So easy to make and everyone loved them! My family said they prefer this to regular chocolate chip cookies. Thanks for the great recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alicia Dodson"
},
"reviewBody": "Okay, I figured out why they came out all flat and gross. I used the convenient conversion thing that's above the recipe to double it cause I didn't want to calculate myself cause lazy. The conversion for the flour was WAY off! So, there's a technical error on the website for the conversions. Just do it yourself. I'll try these again another day to see if they're good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Lilia"
},
"reviewBody": "These were just okay. I thought they were dry, crumbling, and not very flavorful. Husband didn’t like either. They sort of remind me of Mexican wedding cookies but not as good. I have dough left over. I’m going to see if I can doctor it do as not to waste. I will not be making them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Snowcake"
},
"reviewBody": "This is a great recipe. Tried to look for something similar on other sites but so far haven't found any. Increased the serving size to 27 servings. Omitted chocolate chips and walnuts and instead added the same qty of chopped pecans. Added almond and vanilla extract. Shaped dough into a log and chopped into rounds, laid out on cookie sheet and baked at 300F as called for and rotated pans halfway. Cooled ~1 min on pan after baking then transferred with spatula onto wire rack to prevent crumbling. The log technique helped, but I wish I could find a still better way to keep the form of the cookies cylindrical. My mother calls it \"Sandies\" like the Keebler brand cookies and periodically asks for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "50sHousewifeWannabe"
},
"reviewBody": "Sooooooooo good! Soooooo easy! I don't think I'm going to share! I did need a longer cook time (25 min)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmandaBlack17"
},
"reviewBody": "Great recipe! Super easy and fail proof. I subbed out the nuts and instead of chocolate chips I used some chopped up Toblerone. These taste best if you wait until they are completely cooled to try :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy Currado"
},
"reviewBody": "Oh My Gosh! These are to die for. I ate it fresh out of the oven, I couldn't wait. I thought I was going to cry from the deliciousness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "doug"
},
"reviewBody": "These cookies are easy to make and deceptively delicious. They are light and crumbly, just like shortbread should be and addictive! I had a hard time walking away! The dough is good too and since it doesn't have any eggs, it is ok to have a bite (or two). For tasting purposes only, of course!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BettyJane Callmeyer Gibney"
},
"reviewBody": "Very good cookie! Followed recipe exactly, except using 1/2 cup of nuts, baked for 18 minutes until the bottom was just starting to get tan. Cooled on cookie sheet then transferred to wire rack. Buttery with the nutty crunch! These are perfect to have and give at the holidays! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joseph Manny Flores"
},
"reviewBody": "They are a hit..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dangershark"
},
"reviewBody": "I made it with mini M&amp;M's, but think mini choc chips will be better. Good cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jarrod"
},
"reviewBody": "I followed the directions with the exception of the butter/margarine and the chocolate chips as my kids have allergies. So, I used earth balance instead of butter or margarine and life’s good for the chips. My family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Anna Bogaevsky"
},
"reviewBody": "The cookies were delicious, but both times I made them they made me very sick"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cook4me"
},
"reviewBody": "The taste was good but too buttery for me. I will lessen the amount of butter and maybe sub with applesauce. Also, 300 degrees was taking longer than 30 minutes for baking, so I increased the temp to 350 degrees. They baked better and came out well after this change."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RLS"
},
"reviewBody": "These were a hit- totally tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ljayess"
},
"reviewBody": "The recipe: This was super easy to put together. It was a soft dough that was easy to roll into balls. I baked on baking stones, so I added an additional 3 minutes to the 20 suggested, and it was perfect. To the recipe, I added 1 tsp real vanilla and substituted brown sugar for half the white.\n\nThe cookie: The texture was a little too soft for a shortbread. I expected a bit more tender crumble in the bite and a bit more melt-in-your-mouth in the chew. The dough seemed to be a little too soft and moist. Usually, a shortbread dough is a bit more dry. The taste was good although somewhat bland and flat. Next time, I might play with ingredient ratios, use only white sugar, and add even more vanilla to the dough. I'd like to see if pecans, instead of walnuts, might impart more richness, and perhaps the addition of toffee bits might give more depth to the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Yary"
},
"reviewBody": "Not my favorite. Dry and not as sweet"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BarbaraLee"
},
"reviewBody": "If you flatten slightly they turn out crumbly, I used a scoop and did not flatten and they came out pretty good. Recipe only makes 3 dozen so will double next time. Husband likes them therefore 4 instead of 3 stars for the falling apart factor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lolita I. Velez"
},
"reviewBody": "Incredible flavor - chocolate chips &amp; walnuts are a great addition to this recipe. However, I was unable to form actual cookies/balls. For some reason they would not hols together so I just pressed them into a 9x9 pan and they came out fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen Pan Tabinga"
},
"reviewBody": "I baked this New Years eve , boy, was it the BEST shortbread recipe I have ever made, and sooooooo simple too.\n\nI didn't bake traditional cookie style, as indicated in the recipe. I placed the entire dough in a round spring pan, and voila! I did add pure almond extract, and because I baked it pie-like, the baking time was longer. But all worth it! Heat the finish product at 10-15 seconds, and add a scoope or 3 of vanilla ice cream.....HOLY MACKINAW....heaven in my mouth!\n\nSee picture attached. This will be my go-too shortbread recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gerrie Oathout"
},
"reviewBody": "Delicate, delicious, delightful cookies. We’re going to try these cookies with Heath Bar bits."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa Freshcorn Dever"
},
"reviewBody": "This is almost the exact 70 plus-year-old cookie recipe I have from my mother. We replaced the chocolate with as many nuts.\nI love chocolate but not with this cookie, try without. The only diff was 1 t. of vanilla and 1 t. of water. The water helps spread the cookie.\nMix butter and sugar for at least 15 minutes. If you make with just the nuts, roll in powdered sugar after cooling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marni"
},
"reviewBody": "So easy to make and use as a base for all kinds of cookies. I left out the choc chips and split the dough in half.\nPut choc chips in one half and rolled the other half into balls, placing both on a cookie sheet. \nUsing a glass with a buttered flat bottom, I dipped the glass in a plate full of red and green sugar sprinkles and flattened the plain cookies with that. Used regular sugar for flattening the choc chip ones.\nEveryone loved them! Gone in a half hour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Morton Eisele"
},
"reviewBody": "I followed the recipe exactly and they turned out perfect. Everyone loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenn Talbot"
},
"reviewBody": "Excellent. I followed the recipe to the letter the first time and they were beyond fantastic. The second time I substituted a scant half cup each halved maraschino cherries and halved macadamia nuts for the walnuts. I can't say which version I liked better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trudy"
},
"reviewBody": "The best cookies ever, can’t stop eating them"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ICOOK4FUN"
},
"reviewBody": "If you love shortbread cookies, you will LOVE the rich, buttery, sandy texture of this cookie! Melts in your mouth. I did half the batch with milk chocolate chips and half with Heath Milk Chocolate toffee bits and both were delicious. I added 1/2 tsp vanilla. I wanted them to be smaller tea cookies so I dropped them by the teaspoonful and this made 48 perfect little cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue50Olsen"
},
"reviewBody": "these were awesome. The only problem being they don't last long. Everyone else eats them before I can get back"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheMom"
},
"reviewBody": "The best I've ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AmyMTeets"
},
"reviewBody": "So this recipe is amazing as is. I’ve made it for years. Tonight I added 1/2 brown sugar and sea salt morsels and it’s aaaahhmmmaazing ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristy Rush-Robinson"
},
"reviewBody": "These cookies are delicious. I didn't have nuts or unsalted butter on hand so had to use salted butter and they still turned out great! Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beckie Hensley"
},
"reviewBody": "Melt in your mouth crunchy cookie"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara"
},
"reviewBody": "I’ve made this recipe many times (and I’m on the younger side). The cookies always come out delicious and are easy to make. They are also healthier than most shortbread cookies I’ve made, which is a complete win to those who are trying to be a tiny bit healthier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ashley Krystal"
},
"reviewBody": "I made these cookies today and loved them they are really good!!! I tweaked it just a little bit I used 1/4 baking soda instead of baking powder and added 1 TBS of vanilla extract and 3/4 white sugar instead of just half a cup and it came out really good my family loved them! Thank you for this awesome recipe =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassiopee Leduc"
},
"reviewBody": "Loved it! Used 1/2 cup peanut butter chips and 1/2 cup chocolate chips instead, also used salted butter and skipped adding the salt. No nuts either as didn't have any. Baked 20 mins and let sit 15 mins and they are so delicious!!! Making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carla Jewell"
},
"reviewBody": "delicious! made without nuts and the family loved them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "camprunfarm"
},
"reviewBody": "This is THE BEST shortbread cookie recipe I’ve ever used! First time made with chocolate chips, just made again without. This time I used the zest of 1 lemon in with the butter and sugar before adding flour mixture. Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FairPlayGramma"
},
"reviewBody": "The Best. I had no nuts so I just eliminated them. These taste like a trip to the bakery of your youth.....the butter cookies they mastered.....so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Lindsey Porter"
},
"reviewBody": "I wish I could leave 0 stars. These need something else. I’m not a good enough cook to know what exactly that is but these cookies turned out powdery and were absolutely disgusting. Please don’t trust the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mr. minetartflame"
},
"reviewBody": "It was really easy to make and we used stuff we had around the house"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BHS_SAUCE"
},
"reviewBody": "Yummmmmmmmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "i’ve made these cookies before and they’ve turned into my favorite cookie recipe ever! they were pretty crumbly, whenever i picked them up too hard they fell into pieces, but that may have been my fault since i’ve made them before and that’s never happened. that are so buttery and sweet, and there is the perfect amount of chocolate chips, i love these cookies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Danderson"
},
"reviewBody": "Shortbread cookies should not be made with chocolate chips. Made these and did not like at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Siti Zulaiha"
},
"reviewBody": "I have tried many other recipes but this one is perfect. My teen boys just can't get enough of the cookies. I love it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skylen"
},
"reviewBody": "Crumbly but holds together well. Buttery but not overly greasy. Wonderful shortbread chocolate chip cookie recipe!\nI made some slight adjustments to the recipe to fit what I had and what I know works for me. I doubled the recipe using salted butter instead of unsalted butter and salt (as that's what I had left in my fridge and I wanted to use it up). I softened the butter to room temperature before creaming it with the sugar. I used half white sugar and half brown sugar to give the cookies a richer taste. I also added in 1 tsp of vanilla extract.\n\nThese cookies do spread but not a whole lot, so I flattened them a bit before putting them into the oven. I baked them at 300C for 15 minutes but I could have probably gotten away with 10-12 especially if I wanted softer cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I would double the recipe next time. The dough was so small it was difficult for my mixer to get it all mixed up. Very tasty cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ashmwils"
},
"reviewBody": "I added some vanilla and they turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Defelice"
},
"reviewBody": "I followed the recipe exactly and it was the best chocolate chip cookie recipe I've ever tried. Amazing. One of my favorite cookie recipes of all tims!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bjsox"
},
"reviewBody": "These are very simple, very tasty little cookies. I may try making them next time with powdered sugar rather than granulated, as it makes a smoother shortbread, but otherwise I really liked this recipe.\nA thought to Karen.U -- was the problem too much salt? If you use salted butter these cookies WILL end up too salty! Stick with unsalted butter or change the amount of added salt accordingly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "isabel"
},
"reviewBody": "In oven 14 minutes is best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sugarbuns"
},
"reviewBody": "Followed recipe and really tasty cookie. Will be making again.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bmenefee720"
},
"reviewBody": "So good! I followed the recipe precisely and they turned out great. Husband and kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JanetC"
},
"reviewBody": "I have made these SO many times and still LOVE them! These have become my go-to, that's for sure. I can taste the difference between butter and margarine, but it doesn't seem to make a difference in the bake. I do notice more spread if I use a mixer all through the recipe, so I try to use a mixer only for the butter-sugar creaming and hand mix (this is where that wooden spoon you can't seem to get rid of comes in handy!) the rest. I also like to let the dough rest in the refrigerator for at least 1 hour before baking. It lets the butter set and prevents overspreading during baking--saving flake. If you're making a double batch, go ahead and measure out the 1 1/2 cups of choc instead of using the whole bag. This is another instance of 'less is more.'"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kellie"
},
"reviewBody": "Delicious. Flaky, buttery, easy to make! I Will definitely make these often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Price"
},
"reviewBody": "Loved... used salted butter and hafe of the nuts.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Deborah Weaver"
},
"reviewBody": "Not as good as regular chocolate chip cookies..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenni Sheets"
},
"reviewBody": "Made cookies to share with family and friends. I didn’t want to share, they were sooooo good. Followed recipe exactly. Coworkers raved about them. Neighbors didn’t get theirs because I ate them all, so making more tonight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen O'Hara"
},
"reviewBody": "I know these are supposed to be different from Toll House cookies, but the texture was extremely crumbly. Tasted OK but way too fragile to put out for guests. Maybe good ice cream topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne C"
},
"reviewBody": "Very good and so easy to make! For those who like shortbread cookies, this recipe is a keeper! If you use salted butter (I did), omit the 1/4 tsp of salt the recipe calls for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Made these exactly as the recipe states and they come out delicious every single time! Only downfall is that the recipe doesn't make very many cookies and they get eaten very quickly! I roll mine into small balls and flatten before baking. Turn out amazing!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrea Bentley-Cyr"
},
"reviewBody": "These cookies are delicious and easy to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "polly"
},
"reviewBody": "Easy! I think I would just put the chocolate chips on top next time. This will let people know these are not chocolate chip cookies. Room temp butter is the key to keep them from being too flat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah Stewart"
},
"reviewBody": "OMGosh !!!!! So good !!!!! I followed the recipe as written. Cooked for 20 minutes. They didn’t look done but that’s what other reviewers had mentioned as well.... SO GOOD!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dgper"
},
"reviewBody": "Just baked these. They are as amazing as most reviews say, very rich and delicate. I added a T of orange zest because I love chocolate and orange together. The only reason I gave them 4 stars instead of 5 is that I think the baking time is off. If you chill this dough (and you should as it is very soft and buttery), you need to bake at least 25 minutes @ 300. I'd even go 30 next time, as at 25 they still were very pale."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy Lauria"
},
"reviewBody": "These are delicious. I made them just like the recipe says."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Coco"
},
"reviewBody": "Great delicate shortbread cookie. Used half the sugar as we watch how much we take in. I added a little almond extract just because i love it. Put chocolate chips in only a few of them and some pistachios. Walnuts tasted great too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Conley"
},
"reviewBody": "If there were 50 stars, I would have given these cookies all 50 of them! I will always make these now. I split the cookies with original recipe, then with only the walnuts in them. ( only a personal taste.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Snoochee"
},
"reviewBody": "These are good but I think they'd be better with a little vanilla and more salt, or salted butter instead. They were just missing... Something..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenna"
},
"reviewBody": "I made these for a choir at my church bc my mom was the director. Thet are soooo good but I would recommend putting maybe Almond oil or any other oils to give it a bit more favor bc it tastes kinda plain. Just a tip to do if it taste too plain for ya"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LGA"
},
"reviewBody": "These were great and super easy to make! I used one stick of salted butter and one unsalted because that's what I had on hand, so I omitted the salt. I also added some of that good Mexican vanilla. Very tasty, I think they would even stand alone well as shortbread cookies. Next time I might try with some almond extract as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LB Purrfect"
},
"reviewBody": "Incredibly easy and delicious! Made per instructions first time with added 1/2 tsp of vanilla-wonderful! 2nd batch tried the 1/4 cup brown and white sugar with 1/2 tsp almond extract- also increased oven to 350—mind blowing! Love the recipe Tina!! This will become a staple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mary peterson"
},
"reviewBody": "This shortbread cookie is a staple on my Christmas baking list. Chocolate and shortbread are made for each other! It's always the first cookie everyone seems to reach for! Sometimes I finely add chopped walnuts or pecans to it as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Equestrian Baker"
},
"reviewBody": "Really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ilovearmor"
},
"reviewBody": "These were so yummy! They were so good I made them three times in one week. I didn't use walnuts and found that using mini chips worked best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KoKo"
},
"reviewBody": "I made no changes and will be making them again!! We loved them!! ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lovethecookies "
},
"reviewBody": "It was really, really delicious. To all of you out there who have noticed that it is really after you put on the dry ingredients, push the butter (or margarine) over the dry ingredients. It was super buttery. Loved it otherwise. I also substituted the butter for margarine. Still tasted delicious. Thank you, Tina!! Thank you so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sara Fogdall Miller"
},
"reviewBody": "Good flavor, but they were pretty oily after baking. Maybe I need to wait until they cool to test them :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis C. Stamm"
},
"reviewBody": "Wonderful! I added powdered sugar to the top to finish these cookies off.... will be making this recipe again and again!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KDBONN"
},
"reviewBody": "I made these cookies exactly as written and they turned out perfectly. They took about 14 minutes in my oven. I waited until I could see just a touch of golden brown around the edges. This is a delicious shortbread cookie with the great addition of chocolate chips. I think using the mini chips is a must! While you can chill the dough slightly, you can't chill it much because the high butter content would make the dough too hard to roll into balls. And using butter is also a must! I am guessing the reviews that say their dough spread or the cookie was greasy, may have used margarine. I found this recipe to be delicious. A keeper for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alex Pocklington"
},
"reviewBody": "Super tasty! Reminds me of store-bought shortbread. I used used chocolate chunks and salted butter and they still turned out really well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aprilskye21"
},
"reviewBody": "This cookie was just want I wanted, easy and so tasty - just the right amount of sweet and crunchy! I didn't want chocolate chips, so I substituted black walnuts and OMG! So delish! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Davidson"
},
"reviewBody": "No changes were made and YES! I'll make it again, and again, and again, and so on...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacki"
},
"reviewBody": "Amazing! I doubled the batch, split in in half and used mini chocolate chips and walnuts in one half and pecans in the other. The only variance from the recipe was to add 1 tsp vanilla (per batch)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "riri08"
},
"reviewBody": "These are seriously the best cookies I’ve ever had! I did take a reviewer’s suggestion and added a tsp of vanilla extract, but everything else I followed exactly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Karen Skotzke Macary"
},
"reviewBody": "Horrible cookie. Decent taste but came out flat. Waste of ingredients."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15300/tinas-shortbread-chocolate-chip-cookies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/839/desserts/cookies/chocolate-chip-cookies/",
"name": "Chocolate Chip Cookie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15300/tinas-shortbread-chocolate-chip-cookies/",
"name": "Tina&#39;s Shortbread Chocolate Chip Cookies"
}
}
]
}
}
, "about": [
]
}
]