				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tiramisu Cheesecake"
,"datePublished": "1998-06-14T12:47:23.000-04:00"
,"dateModified": "2023-01-31T10:27:34.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Marty Fries"
,"url": "https://www.allrecipes.com/cook/24326377"
}
]
,"description": "This tiramisu cheesecake has a ladyfinger crumb crust, a rich cream cheese, mascarpone, and espresso filling, and a light dusting of chocolate."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/C3aI3bzyEP1gTsFbQM8bsDaeKXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/514088-tiramisu-cheesecake-chibi-chef-1x1-1-457fe39663864f40963ce7d1d354b57d.jpg",
"height": 1500,
"width": 1500
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5468268485001",
"description": "Two classics in one dreamy dessert!",
"duration": "PT58S",
"name": "Tiramisu Cheesecake",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/8f3cb807-98fc-449f-9921-92b5a3bdeb94/d82f557f-339d-448c-b7c6-9c2094e86956/1280x720/match/image.jpg",
"uploadDate": "2021-07-22T00:04:11.541-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tiramisu Cheesecake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "400"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "528 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "188 mg"
,"fiberContent": "1 g"
,"proteinContent": "10 g"
,"saturatedFatContent": "21 g"
,"sodiumContent": "256 mg"
,"sugarContent": "20 g"
,"fatContent": "36 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 (12 ounce) package ladyfingers",
"0.25 cup unsalted butter, melted",
"2 tablespoons coffee-flavored liqueur",
"3 (8 ounce) packages cream cheese, softened",
"1 (8 ounce) container mascarpone cheese, softened",
"1 cup white sugar",
"2 tablespoons coffee-flavored liqueur",
"0.25 cup all-purpose flour",
"2 large eggs",
"1 teaspoon heavy cream, or more as needed",
"0.25 ounce semisweet chocolate" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Place a pan of water on the lowest oven rack."
} ,{
"@type": "HowToStep"
,"text": "Make the crust: Crush ladyfingers into fine crumbs. Place crumbs into a bowl with melted butter and coffee-flavored liqueur; stir until evenly combined. Press into the bottom of a 9-inch springform pan."
} ,{
"@type": "HowToStep"
,"text": "Make the filling: Beat cream cheese, mascarpone cheese, and sugar in a large bowl with an electric mixer until very smooth, 2 to 3 minutes. Scrape down the sides of the bowl and mix in coffee-flavored liqueur. Add flour and eggs; mix on low speed just until smooth. If batter seems too thick, mix in heavy cream. Pour batter over the crust."
} ,{
"@type": "HowToStep"
,"text": "Bake on the center rack of the preheated oven until just set, 40 to 45 minutes."
} ,{
"@type": "HowToStep"
,"text": "Open the oven door, turn off the heat, and leave cheesecake to cool on the center rack for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven, transfer to a wire rack to cool completely, about 30 more minutes."
} ,{
"@type": "HowToStep"
,"text": "Refrigerate for at least 3 hours, or overnight."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/C3aI3bzyEP1gTsFbQM8bsDaeKXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/514088-tiramisu-cheesecake-chibi-chef-1x1-1-457fe39663864f40963ce7d1d354b57d.jpg"
}
]
,"text": "Just before serving, grate semisweet chocolate over the top."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT295M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Loved this recipe. It was very easy to make this into a Keto Friendly Cheesecake by substituting almonds for the crust and by using powdered Erythritol instead of granulated sugar. If you’re going to non Keto, but Gluten Free the Almonds make a great substitute for the crust as well with following the rest of the recipe as and substituting Gluten Free Flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "I modified the recipe and it was delicious with the changes I made. For the crust I dissolved 1 1/2 tsps of espresso powder in the Kaluha before adding it to the ladyfingers, I also added a dash of salt since my butter was unsalted. For the cheesecake I dissolved 1 1/2 tsps of espresso powder in the Kahlua, added a dash of salt, omitted the flour and cream. I baked for 50 minutes, turned off the heat and let sit in the oven for another 50 minutes. Once cooled, I topped with a dark chocolate ganache (2 oz heated whipping cream and 4 oz dark chocolate chopped) instead of grated chocolate. Was enjoyed by all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tony"
},
"reviewBody": "Everyone loved this. Substituted Kahlua for coffee liqueur. Suggest using 1/3 cup to get a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lois Hopper"
},
"reviewBody": "I didn't think it had much a coffee taste so I added a teaspoon of espresso powder. My guests all asked for a second piece after a dinner with lot's of food eaten. My husband loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "3ofakind89"
},
"reviewBody": "This was ok as the recipe states. Needs more flavor to set it apart from just a basic cheesecake recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Slv"
},
"reviewBody": "If you don't want to use coffee liquer here's a great sub: in crust add 3 TBSP coffee + 1/2 tsp coffee extract, in the filling add 6 TBSP coffee + 1 tsp coffee extract. I also made whip cream and added 1/2 tsp coffee extract to it.\n\nDelicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sev"
},
"reviewBody": "Great cake, but I didn't like the ladyfingers crust. next time will try graham crackers as a base. otherwise, cut sugar in half, used 1 full cup strong coffee instead of coffee liqueur. Filling tastes great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MamaLitz"
},
"reviewBody": "As per usual, I made this cheesecake exactly as the recipe stated. It was good, but next time will increase the coffee liquer as suggested. Everyone enjoyed it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alteredartgirl"
},
"reviewBody": "Very good cheesecake! I made some additions and got rave reviews! I’d give 5 stars. I read a ton of reviews and averaged out the kahlua used to 5 tbsp in the crust and 8 tbsp in the cheese. Buttered the pan and used a true water bath. I also added 3 tbsp of brewed espresso coffee to the cheese. I had to bake mine for 55 min. and most of the cake except for the edges was very jiggly. I let it sit in the oven turned off for an hour then refrigerated. Also for us it was A MUST to use a espresso whipped cream! 2 cups heavy cream, 1/2 cup powdered sugar, and 3-4 tsp instant espresso granules. I piped little snowflakes all over the top with a Russian piping tip for a Christmas dessert, so cute and so easy. This would also be super cute decorated with chocolate covered coffee beans. For us the kahlua taste was not strong but perfect and the coffee flavor definitely came through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Lashley"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "smccll"
},
"reviewBody": "I've made it twice now and it is Genuinely delicious ! Both got devoured. It's great as written, but second time around I 1. left out the flour and 2. reserved about 1/4-1/3c of the ladyfinger/coffee mix and gently stirred it throughout the filling itself for some texture variation and it was Excellent; just baked a bit longer to make up for lack of flour and it turned out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynn"
},
"reviewBody": "Great recipe!! The cheesecake split as it was cooling but ended up looking fine with some stenciling + cocoa powder dusting. I did do 4 Tbsp in the crust, and 8 in the batter, which I personally found to be a tad too bitter for my taste but overall was great. So easy to make and beautiful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JCamp"
},
"reviewBody": "Soooooooooo good and easy to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Anabel"
},
"reviewBody": "It was good, but I was hoping for more flavour. Just make regular cheesecake adding a little liqueur and it probably would be less complicated. I decorated with whipped cream and strawberry...adding some fruit sauce makes it better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Stephens"
},
"reviewBody": "Everyone loves it! When I make it I followed others recommendations to increase the coffee liquor portion. That being said I didnt use coffee liquor. I always use espresso with a little bourbon in it. I double the amount called for on the crust and filling. Also for the crust I use Stella D'oro margherite combination cookies. The chocolate and vanilla cookies are an amazing flavor and sturdier of a crust than I imagine the lady fingers would be. Grating the semisweet chocolate on top is tedious but those melt in your mouth little slivers are perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lladams"
},
"reviewBody": "I rated it a three because of how many changes that were needed and because there were several things unclear in the recipe. The good news: Not a single crack! I did have to cook it longer than the recipe called for. It would have been nice if the recipe included the ganache recipe (or whatever is shown in the reference photo). The recipe should also specify that the cookies are hard ones. My husband bought some ladyfinger but found them in the produce section next to the strawberries (they were very spongy, soft and angel food like.) I knew those wouldn't work well for the crust, so I found some hard ladyfinger cookies at Sprouts. The amount specified seemed way too much for the base of crust and I had to add much more butter and liquor to be able to press it in the pan. (I even used a larger pan. I grated chocolate on top but it just looked a little gray, so I shook it off. I didn't have the ingredients to make a ganache (kind of regret that). So, I had this brilliant idea (we will see how brilliant it is when my game night group tries the cheesecake.) I used the soft ladyfingers drizzled with chocolate as a decorative element."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martiner"
},
"reviewBody": "Great recipe! Thank you all for the suggestions. I did add 2 additional tablespoons of coffee liqueur to the crust and also to the batter. I added a teaspoon of espresso powder to the batter as well. I baked in a water bath after I foiled the bottom of the springform pan. I topped it off with ghiardelli chocolate shavings and heavy whipping cream to which I added powdered sugar and a teaspoon of espresso powder to taste. Everyone loved it especially the birthday girl. I even had one person tell me it was their new favorite!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Brooks"
},
"reviewBody": "It tasted amazing! Huge hit with the family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Resa Matteoli"
},
"reviewBody": "YUM! The only deliberate changes I made were to add the extra coffee liqueur that most reviewers mentioned. Also, I happened to see Toll house espresso morsels in grocery store. I lieu of shaved chocolate, I crushed half a handful of semi-sweet morsels and the same amount of the espresso morsels. I combined those and sprinkled a wide band around perimeter of cake. Yummy! One accidental change I made - I forgot the flour. Just cooked it a bit longer and refrigerated for 24 hours. No problem. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trevor Metterhauser"
},
"reviewBody": "i used both coffee grounds and a triple espresso shot from starbucks. The triple espresso i added to batter slowly while mixing, and stopped when it got too liquid like. you can balance out with extra flour. Also baste crust in rum when cooled.\nalso use coffee liquor in batter, and when you are ready to serve reduce coffee liquor and powered sugar on stove top stirring non stop. remove from heat, let stand to begin thickening, and drizzle over pieces while cooling.\nAlso, enjoy the left over coffee liquor, rum, and milk together similar to a black Russian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jack Bostic"
},
"reviewBody": "This is one of our favorite special occasion cheesecakes. I do 1 1/2 with the coffee liquor; it adds just a little more tiramisu flavor to the dessert. Thanks for a great dessert"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy"
},
"reviewBody": "I made this to take to a work function. I have not tasted it yet. It turned out beautiful with no cracks. I made a coffee icing for the top then added the shaved chocolate. I will update this once everyone has tried it. It sure does look good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CookieMan"
},
"reviewBody": "I made this cheesecake on 2 different occasions for social gatherings, and it got raves from everyone. I used coffee liqueur in the crust and in the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shaimaa Hend"
},
"reviewBody": "I made it for dinner with friends and it is my first time to bKe cheesecake. I followed the recipe and the it came out a big hit, everyone loved it. Thank you for posting this amazing recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Josh Caldeira"
},
"reviewBody": "I turned out fantastic. The only thing I'll try to do different is soak the ladyfingers in the Kahlua before placing it in the spring form pan so it wouldn't be too hard at the bottom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sara Dacosta"
},
"reviewBody": "excellent I make the real Italian tiramisu and this we enjoyed cheers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Breiana Hill"
},
"reviewBody": "A ABSOLUTE HIT! My entire family loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlyn Watto"
},
"reviewBody": "Following many of the other reviewers suggestions, I put 3 T coffee liqueur in the crust and I dissolved 2 packets of espresso powder (like Starbucks Via) in the remaining coffee liqueur (I used 3 T there as well) in with the cream cheese mixture. Make sure that your cheesecake is completely cool before putting it in the fridge; mine took way longer than 30 minutes to cool. I made this recipe for my coworker's birthday. He said that this was his favorite of everything that I've ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fishinbug"
},
"reviewBody": "Decreased ingredients by 1/3 to make in instapot...fabulous. No problems with cracking when made in instapot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Decreased ingredients by 1/3 to make in instapot...fabulous. No problems with cracking when made in instapot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "seralet"
},
"reviewBody": "This is soooooo good. I used different cookies, because my store doesn’t have lady fingers, but it is still phenomenal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Food Junkie"
},
"reviewBody": "It was excellent. A few small changes. I thought there was way too much crust. cut it down to 9 oz of ladyfingers. I find that using melted butter doesn't work as well as putting soft butter in with the lady fingers and mixing it in with a pastry blender. It also mixes in the liqueur better and breaks up any additional pieces of the ladyfingers. I topped it with cream cheese chocolate icing and everyone loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "medstudentcook"
},
"reviewBody": "Added 4 Tbs Kahlua and 2 Tbs espresso and used a water bath instead, but unfortunately the cheesecake never set up despite baking it for extra time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicooksfor5"
},
"reviewBody": "I make several cheesecakes a year and this has won its way into the top of our rotation! Delicious as written, but better with more kahlua in the crust and filling, as suggested by many reviewers. Second time I could not find lady fingers, substituted vanilla wafers, very little difference. I also like to substitute 2 low-fat cream cheese and one regular to lighten the flavor and calories. The key to successful cheesecakes: Room temp ingredients, don't over-beat, let cool one hour in oven with oven door cracked open before cooling on counter. Must chill for 24 hours for best texture and flavors. Thanks for a winning recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monica Schweinfurth"
},
"reviewBody": "I did spring for the extra coffee, much better when you eat it the next day!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "djmjr"
},
"reviewBody": "Tastes good, substituted coffee liqueur with super strong espresso and as ladyfingers are sponge cake and soft, I toasted for 15 minutes at 350 and let cool to dry out before crushing in food processor. Also greased the pan too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Noreen Lemon"
},
"reviewBody": "Needs more coffee flavor but delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "The Dish"
},
"reviewBody": "Made this for Christmas Eve dessert and it went over very well! It was almost embarrassing that it received so much attention as I wasn't the host. Be warned, though... 12 oz package of Lady Fingers, crushed, would be way too much for the crust! I live near an Italian grocery store and they don't even carry 12oz packages, only 7 or 14 or 17oz. I bought the 14oz and intended to use most of it, but ended up only using half. I did increase the Kahlua, both in the crust and the batter, as per suggestions. Making it again for tomorrow night's New Year's Eve party."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "AliceDavis"
},
"reviewBody": "We were disappointed, frankly. Served to non-drinkers so substituted espresso for coffee flavored liqueur. Wound up tasting nothing like tiramisu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Todryk"
},
"reviewBody": "Our new favorite cheesecake. Very dense and yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Joan Sauger"
},
"reviewBody": "I made this exactly according to the recipe. It came out of the oven looking beautiful. However, when I cut into it, the middle was runny, and the crust was way to thick. I didn't have an 8 inch pan, so I used a 9 inch and baked it for 50 min. There was so much crust and batter it never would have fit into an 8 inch pan. I served it on Christmas day , and needless to say I was embarrassed in front of my company. This recipe needs to be re-calculated. ( It did taste good, though)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "colleenb"
},
"reviewBody": "This was a decent cheesecake. I couldn't find ladyfingers so I googled substitutions and I used a pound cake cut up and dried in a low-heat oven and then smashed to crumbs. I think it could use a bit more coffee liqueur as it just tasted like plain cheesecake to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashleigh Lutzkow"
},
"reviewBody": "This is so good! I followed others recommendations and used 5 Tbs in the crust and 10ish in the cheesecake. I only had a 10\" pan but it still was perfect. I did not use the water in the oven and had no cracks. Would make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Vonnette"
},
"reviewBody": "I made 1 change I used angel food cake for the sponge. The coffee liquor I used was Kahlua just not enough of the coffee flavor. This was honestly a great cheesecake tho."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carole D"
},
"reviewBody": "Great recipe, I used the mascarpone substitute and additional Kahlua, as mentioned by others, and shortbread cookies for the crust, when I realized my package of ladyfingers was only 4 oz, not 12! Sifted dark chocolate cocoa on top, garnished with whipped cream and ladyfingers around the side of the cake (to resemble traditional tiramisu in a bowl). Served at Christmas dinner, our 22 guests raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Bagley"
},
"reviewBody": "This was my first time making a cheesecake too and I was thrilled with the outcome! I read a lot of the reviews and made a lot of the suggested changed ie 4T of Kahlua in the crust and another 4T in the cream cheese mix. I placed the springform pan in a slow cooker bag and sat it in a pan of water. It turned out perfectly without a crack and everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anthonys1670"
},
"reviewBody": "I loved it and so did my guests. The only thing I added was the decorative swirls on top as pictured with a cream cheese decorative bag. This step wasn't in the directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michele Cabot"
},
"reviewBody": "Yes, and I suggest adding more Kahlua and also some Expresso to moisten the Lady Fingers. The crust was too dry. Otherwise, it was a good dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shrudy1"
},
"reviewBody": "I made this for Christmas, and it was by far one of the best desserts I have ever made. I even found tiramisu mascarpone in my local store and used that, and it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angela Chan"
},
"reviewBody": "3 stars for the original recipe; 4 stars with changes I made to the original; maaaaaybe 5 stars with yet more changes.\n\nPersonal preference at play a bit here. Definitely needed more rum AND dark coffee than original recipe suggests: I went closer to 5 tbs in the crust &amp; 10 tbs in the filling. Definitely gave it the tiramisu flavour. I wouldn't recommend going less. The filling was dense whereas a tiramisu is usually creamier; I'd try leaving out the flour next time. \n\nDo not need 12oz pkg of ladyfingers! I ended up with waaay too much crust and I used a 9\" pan! A 7oz pkg would have been enough. \n\nI found the sweetness of the ladyfinger crust didn't marry well with the rum/coffee/cream cheese flavours of the filling. I added milk chocolate curls and cocoa powder to the top to create some unity of flavours and this helped a bit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "do you take it out of the pan to cool in the refrigerator?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lisag2417"
},
"reviewBody": "do you take it out of the pan to cool in the refrigerator?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linds07"
},
"reviewBody": "This was super delicious. Tastes like cheesecake and tiramisu had a baby. I made it exactly as described. It made a bit extra so I think there would be enough to make it in a 9 inch round pan. I’ll definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tastygood"
},
"reviewBody": "I made it exactly what the recipe it was a hit my family love it, next time i will add more coffee liquor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "CaptNic"
},
"reviewBody": "Certainly did not have the taste of Tiramisu. At best, it was a cheesecake with a different tasting shell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Will Taggart"
},
"reviewBody": "I made this into bites and the crust separated from the cheesecake but it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Crockett"
},
"reviewBody": "I couldn’t find ladyfingers so used vanilla wafers I also doubled the amount of Kailua in the cheese mixture. It turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SugarViolet"
},
"reviewBody": "It was okay. Didn't really taste like a tiramisu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Daniela Astarita"
},
"reviewBody": "I used espresso preferably la vazza and added Grand mariner ... also I used the large lady fingers it’s hard to crush into crumbs but I did it with my hand and also with the help of a blender .whiiping cream was used as the topping just like real teramisu.. and sprinkled cocoa on top. It was a big hit at my party . My husband wants me to make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenn"
},
"reviewBody": "Like other reviewers suggested, I added additional coffee. When I make tiramisu, I use espresso powder packets and water for strong coffee and add dark rum, so that is what I had on hand. I made 3/4 cup and added 4 T to crust and 8 T to batter. I baked as directed, let cool out of oven for about 1.5 hours before putting it in fridge. I topped it with chocolate rum ganache. Company loved it, so did family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lance George"
},
"reviewBody": "Fantastic Dessert! #cheflgfeedstheworld"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Thelma Bell"
},
"reviewBody": "It turned out quite well. I will make it again. It was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "HOLY. CROW. I made this as my birthday cake and brought it into work. I work in an office of about 200, and everyone who has tried it LOVES it. The only changes I made were doubling the coffee liquor and adding a splash of rum to it. I used 1/4 cup on the crust (half mixed in and the other half drizzled over it once its pressed into the pan) and another 1/4 cup in the mix. I also used a local coffee liquor made by Koval distillery, so it's not a creamy coffee liquor. Definitely a winner and will be used often in the future. The cake is light and creamy but has a perfectly balanced flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Momma Jean"
},
"reviewBody": "I will make it again!!!! So outstanding!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurae"
},
"reviewBody": "This cheesecake is delicious! The packages of lady fingers at my grocery store are 3oz each. I feel like 12oz makes too thick of a crust. 3 pkgs seems just right. I added an extra Tbs of Kahlua to the crust and 2 extra to the cheesecake. Before serving, I piped whipped cream whipped with 3Tbs of powdered sugar, 2Tbs of kahlua and 1 Tbs of espresso powder, then shaved chocolate on the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Asra"
},
"reviewBody": "yummmy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Patricia B"
},
"reviewBody": "I made it exactly as written. Brought it to a dinner party. Was embarrassed when it turned out awful. The crust was way too thick, Looked just like to photo. The cheesecake part was delicious, but the crust was terrible. Will try it again with homemade sponge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kissyfur077"
},
"reviewBody": "Very creamy. Excellent recipe only change I made was adding more kahulha to both the base and the cheesecake batter. Will defiantly be making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mel Fontaine"
},
"reviewBody": "EXCELLENT. I added 4 tbsp Kaluha to the crust and nearly 8 tbsp in the cheesecake. It turned out amazing and definitely needed the extra Kaluha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana"
},
"reviewBody": "Omg! This cheesecake is AMAZING!!! I followed the recipe exactly except I added more coffee liqueur like it was suggested by others ( 5 to the crust and 10 to the batter). This definitely will be one of my top “impress the guests” desserts!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "vivara"
},
"reviewBody": "Really easy recipe for a cheesecake. I replaced the mascarpone with cream cheese and sugar mix as one of the reviews suggested, dunked the cake in liqueur and loved it. Will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zerodramamama"
},
"reviewBody": "I have made this 3 times, all to rave reviews! The only changes I make are to reduce cream cheese to TWO 8oz packages, add more Kahlua to both crust and batter (don't worry about batter being too runny, because with 2 eggs and reduced cream cheese, the finished product still is firm. Also, just a note-I use DeLallo's Savioardi Lady Fingers...they come in a 7 oz package, 24 total ladyfingers, wrapped in 2 separate 12ct pkgs. I use 13 crushed ladyfingers for the crust. I do this in my Ninja. The leftover 11, I cut in half and stand them up on the outside rim, creating a pretty scalloped border (sugared side OUT), once the crust is pressed into the bottom. This makes for a really pretty end result, and 22 half ladyfingers fit perfectly into my springform pan. This also makes certain that the 2 pkgs of cream chese and 1 8oz container of mascarpone (once I even found tiramisu flavored mascarpone!) fill the pan nicely! It also makes for 22 perfectly portioned small wedges, or 11 LARGE! I've topped with finely shaved chocolate (unless you can find the chocolate powder that you use to flavor coffee), and it hides any cracks and looks and tastes divine! Thanks for this recipe. It's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sally Harrod"
},
"reviewBody": "There was too much crust for my liking, and I only used 9 ounces of ladyfingers. The filling was smooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Chang"
},
"reviewBody": "Great receipt. I took other reviewer's suggestion and increased the Kahlua. And I wasn't tasting enough Kahlua. So, I put half of the fillings in, then layered a layer Kahlua soaked ladyfingers, and then, poured in the rest of the filling. It was amazing. Just the right amount of Kahlua taste. I also whipped cream with chocolate powder and more Kahlua."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mkelch"
},
"reviewBody": "Added a 1/2 cup of Kahlua to the cheesecake mixture and 1/4 of Kahlua + 2 TBSP of coffee to the crust mixture. I only had a 10\" inch springform pan and that worked well given it seems like a lot of crust for an 8\" pan. Cheesecake was great, lots of compliments. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Duplin"
},
"reviewBody": "This is 100% the best cheesecake I have ever had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "michelle"
},
"reviewBody": "This was probably the best dessert I ever made! It got rave reviews from all 5 people that I had over for dinner. Even my father in law who admitted he is not fond of cheesecake really liked this. Definite restaurant quality! I used vanilla wafers instead of the ladyfingers and used 2 Tbsp espresso ( I made an instant espresso cup) and 2 Tbsp coffee liquor in the crust. For the filling I used 4 Tbsp espresso and 4 Tbsp coffee liquor. I grated chocolate on top, but later thought I should have used dark chocolate or even dark chocolate coffee beans to grate on top. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Freakforreal"
},
"reviewBody": "Delicious cheesecake. I've found that topping it with caramel or chocolate sauce helps add to the flavor. Also just using plain coffee instead of coffee liquor works as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christy Cooks"
},
"reviewBody": "Everyone absolutely loves this! The filling was very good. I think the mascarpone is very important. It has a nutty-ness that cream cheese does not, also it does not have the tang that cream cheese and sour cream have (do not overbeat the mascarpone or it will become grainy, I always beat the cream cheese much longer before adding the mascarpone, and it is best to use it cold, because softened mascarpone may also turn grainy). I don't understand the reviewers who didn't think the mascarpone made any difference. In my opinion it completely made the dessert taste like tiramisu. Used only two tablespoons of flour-next time I'll try an extra egg, no flour, because I use a water bath and believe that makes flour unnecessary, because it is there to keep the eggs from curdling and the cake from cracking-which a water bath already does. I didn't care for the crust, though I like lady fingers in real tiramisu. So the next time I made it I used golden Oreos and I loved how they didn't compete with the flavor of the cheesecake. I put no coffee liquor in the crust, but I used 4 in the batter and did not find it too sweet like I thought it might be because of the bitterness of the coffee. I think the secret to getting the perfect tiramisu flavor is in the topping- we used plenty of shaved chocolate all over, just like in traditional tiramisu and it made all the difference. I can't imagine this with a heavy ganache. It was perfect, light, and delicate-thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dolores Davis"
},
"reviewBody": "This is a great recipe. I added my own punch. 1 1/2 cups heavy cream, 2 T of coffee liquor, 2 T chocolate powder and 1/2 cup powder sugar and made whipped cream and dolloped on top. Heaven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "V"
},
"reviewBody": "Made this for a friend's birthday. Used the suggestions for making the equivalent of mascarpone (sour cream plus whipping cream plus cream cheese). It was amazing! So good, light, creamy, decadent... I did up the Kahlua to 8 tablespoons as well. So incredibly good, definitely making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Peggy Hesse"
},
"reviewBody": "I made this cheesecake according to the recipe. It was pretty blah. If I were to make it again (which I doubt I will do), I would definitely add more coffee liqueur and/or instant espresso powder and maybe some cocoa."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vyoung"
},
"reviewBody": "Lots of changes, I used chocolate wafer crumbs +2 Tbsps of butter +2 Tbsp coffee lliqueur and 2 Tbsp of expresso, pressed it into an 8 inch pan and baked it for 10 minutes at 325. For the filling I used 6 Tbs of coffee liqueur and 2 Tbsp of expresso. I used the lady fingers I had already purchased by dipping them into coffee liqueur and lining buttered sides of the pan then pouring the batter into it. I covered the sides of the pan with aluminum foil, placed it into a water bath and baked it 20 minutes longer than it called for since it was so thick.\n\nFinishing it, I poured 1/2 recipe of ganache from this site, placing the leftover 4 lady fingers and dressing the edge with whipped cream. It was great and really did have the tiramisu flavor I was looking for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigsearock"
},
"reviewBody": "I made this twice. Each time I halved the amount of ladyfingers and butter in the crust. I used ricotta instead of the mascarpone because that is what I had. I whirled it around in the food processor before adding the other ingredients to make it creamy. And I increased the coffee liqueur in the cheese filling to about 1/4 cup. \n\nThe first time I added a ganache topping (made from 2oz semisweet chocolate in 1/4 cup of boiling cream with 1/2 tablespoon coffee liqueur added). \n\nThe other time I topped it with a mix of 230ml whipping cream beaten with 2 tablespoons cocoa and 2 tablespoons icing sugar and 1 tablespoon coffee liqueur. \n\nBoth times it was delicious. Maybe next time, I'll try adding some cinnamon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen Johnson"
},
"reviewBody": "Amazing! I changed a few things, I added Captain Morgan's spiced rum, and coffee (half and half). I took the suggestion of 10 tbs. for the cheesecake and it came out wonderfully. I also did not use chocolate, but made a homemade whipped cream to go on top. The cheesecake is very dense, flavorful and filling, chocolate is almost an overkill on this; and I love chocolate. I have been asked to make this as my teenage daughter's birthday cake, instead of a cake. A huge hit in the house!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sparks55"
},
"reviewBody": "I made it twice. The first time I was too impatient to wait overnight to eat it. The center was a little soft, but everyone loved it just the same. The second time I let it sit overnight in the frig and it turned out perfect. I followed the advice of the other reviewers and doubled the amount of coffee flavored liqueur in the cake and frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plainch3rry"
},
"reviewBody": "i was nervous at first but it came out so delicious! And it was simple to make. Follow the directions and it'll be great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "khadooj"
},
"reviewBody": "Super yummy....can i just know the recipe of the cream that is garniched on top of cheesecake"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kmarten1"
},
"reviewBody": "Good recipe but definitely needed more liqueur than what it originally called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "DAZZLING20"
},
"reviewBody": "Made recipe as written, too much crust with 12 oz ladyfingers and on cheesecake bland and on the dry side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kevin Benjamin Moussa"
},
"reviewBody": "I used almaond flavored liqueur instead and it was still good. But i want to know whats that cream on top!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colleen Love- Kielton"
},
"reviewBody": "I read the reviews and tasted the coffee liqueur first. Starbucks was the winner by a long shot. Most tasted like maple syrup in comparison. I double the amount of liqueur in the lady fingers and tripled it in the filling. The filling was so good I'm surprised there was enough left to put in the oven. &gt;&gt;&gt;Update: Since Starbucks? no longer makes coffee liqueur I made some espresso in a two serving Mocha Cafe maker, added at least 2 tablespoons to the crust and the rest to the cheesecake. I cut the crust way down too. I used one row of lady fingers this time instead of three. It turned out to be about a cup of crumbs which I used the food processor to crush. I bake the crust about 5 minutes to dry it out before adding the batter since I used so much more liquid. My family and my Italian 'in-laws' loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary Speer Callan"
},
"reviewBody": "Fantastic recipe!! I made with strong decaf coffee, (first setting on my Keurig), not using Kahlua at all. Made these changes; 5 tbsp coffee in crust, 8 tbsp coffee and 4 tbsp flour in filling. Baked almost full hour in water bath, wrapping pan in foil first. Checked at 45 min. too wiggly so I added 10 more minutes, barely a wiggle. Turned off oven and cracked door when done, left cake sit 1/2 hour. So delicious...def making again and again!! :-D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Per the reviews, i upped the Kahlua to 4 tbl in the crust, and 8 tbls in the filling, but still got only a very vague coffee taste. 12 oz of ladyfingers in the crust is WAY too much; I used 7 oz and still had a pretty thick crust; however, even with the added Kahlua, the crust was a little too dry. I found that the mascarpone added nothing, so given how expensive it is, I'd recommend subbing in regular cream cheese. I added an extra egg to compensate for the added Kahlua, and omitted 1 tbl of flour. The cheesecake was good, but tasted much like any ordinary cheesecake, as others have said.\n\nI made a chocolate ganache for the top, and piped some Bailey's-flavored buttercream swirls around the edge, adding a chocolate-covered coffee bean in the center of each. The cake LOOKED great, but was only average tasting. I might try again, with some modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenmacphee"
},
"reviewBody": "This was a fantastic cheesecake! I did double the Kahlua as others suggested. I also could not find ladyfingers anywhere(!?) So made a boxed pound cake and crumbled that. I also topped it, declaratively with homemade whipped cream and added Kahlua to that! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JulieKeen"
},
"reviewBody": "I doubled the Kahlua and it still just tasted like regular cheesecake, but was a good one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leamander"
},
"reviewBody": "This recipe is amazing!! Followed recipe exactly, made sure everything was room temp. Didn't even crack when it was all done. My husband won't buy one at the bakery anymore!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "weiwei5858"
},
"reviewBody": "I modified the recipe a little after 2 tries. I added 3 eggs instead of 2. Used 3 tbsp. of corn starch instead of flour. I gave it a water bath so it didn't brown the top as much. Also, it took another 30 minutes to cook completely. Overall, it's really good recipe. My husband brought it to his work and everyone loved it !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jan"
},
"reviewBody": "I haven't yet tried this, but I do love tiramisu. Are there any substitutes for the Kahlua, as we don't use alcohol. I'd love to try this! I give a 5* because it sounds wonderful!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/7757/tiramisu-cheesecake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
"name": "Cakes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
"name": "Cheesecake Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/7757/tiramisu-cheesecake/",
"name": "Tiramisu Cheesecake"
}
}
]
}
}
, "about": [
]
}
]