				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tofu Lasagna"
,"datePublished": "2019-04-02T02:43:07.000-04:00"
,"dateModified": "2022-07-14T17:26:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "MPERRY"
,"url": "https://www.allrecipes.com/cook/78045"
}
]
,"description": "Tofu is combined with eggs, spaghetti sauce, mozzarella cheese and spices. The mixture is layered with lasagna noodles and topped with more cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lN0yNyPXp-HD0yUbGVICxgTHUng=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/106924-36d35e3a14884e14a8873dc35a61ccbe.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tofu Lasagna"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "284"
}
,"cookTime": "PT35M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "324 kcal"
,"carbohydrateContent": "26 g"
,"cholesterolContent": "81 mg"
,"fiberContent": "3 g"
,"proteinContent": "24 g"
,"saturatedFatContent": "6 g"
,"sodiumContent": "569 mg"
,"sugarContent": "5 g"
,"fatContent": "15 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.5 (12 ounce) package uncooked lasagna noodles",
"1 (12 ounce) package firm tofu, crumbled",
"2 eggs",
"0.25 teaspoon salt",
"0.25 teaspoon black pepper",
"0.25 teaspoon ground nutmeg",
"2 tablespoons milk",
"1 cup spaghetti sauce",
"1 tablespoon dried parsley",
"2 cups shredded mozzarella cheese, divided",
"0.5 cup grated Parmesan cheese" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Add lasagna and cook for 8 to 10 minutes or until al dente; drain."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl combine tofu, eggs, salt, pepper, nutmeg, milk, spaghetti sauce, parsley and 1 cup of mozzarella cheese. Spread a layer in the bottom of a 9x13 inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Layer lasagna noodles with the sauce mixture, ending with sauce. Sprinkle with remaining mozzarella and Parmesan cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake in preheated oven for 25 to 35 minutes."
} ]
,"recipeYield": ["7"]
,"totalTime": "PT55M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Lee"
},
"reviewBody": "I made this two nights ago and it’s VERY yummy. You would never know there was tofu instead of ricotta cheese. I found it really yummy. I know some people said it was plain in the review section but personally I didn’t feel that way. I’m very happy with this recipe and will continue to make it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Preciado"
},
"reviewBody": "I added spinach, squash, ricotta cheese and italian spices. This was very flavorful and came out so good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori"
},
"reviewBody": "I thought this was very good. Just tweaked it to fit our needs. I sautéed a zucchini and a large handful of spinach and added it to the sauce mixture. Always trying to find ways to add additional veggies. I also doubled the sauce and added some garlic salt and Italian seasoning. My husband who doesn't like tofu, thought this was very good and went back for seconds!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "chibimomma"
},
"reviewBody": "Nice base recipe, however I’ve been making this as a no-boil lasagna for years. \n\nMy modifications are adding 1/4-1/2 tsp dried Italian herbs &amp; 1/2 tsp garlic powder to the tofu (soft tofu also works in this recipe). I also mix in one 8oz can of tomato sauce.\n\nUse a standard 24/26oz jar of spaghetti sauce. Pour 1/2 jar into bottom of greased pan. Layer dried noodles and tofu mixture. Pour remaining sauce over final dried noodle layer and top with cheeses . Cover tightly with foil and bake at 375 for 50-60 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "minniecucu"
},
"reviewBody": "Delicious! I made a modification to the recipe - sautéed 2 garlic cloves in 1 tbs of olive oil, then added the tofu mixture to let the flavors combine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John Van Beers"
},
"reviewBody": "Added grilled artichoke hearts and chopped spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "crunchymom28"
},
"reviewBody": "So third times the charm when trying to make a review with out getting kicked out off the page. I added onion spinach cottage cheese and basil. I used more than the one cup that was recommended. I also used ready to bake noodles and cooked for 40 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heidy"
},
"reviewBody": "I made this for the fam today, and we all loved it. Real comfort food. I did make a few changes as always. Per some of the comments, I drained the tofu, and added the one cup of spaghetti sauce and some sauteed onions and garlic along with oregano and basil and some of the parmesan. I used the rest of the jar of sauce and layered it, starting and ending with the jarred sauce. It was so good! My brother-in-law was thrilled and instantly packed away a big serving for lunch the next day. He said \"you can make that again\"!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Roberta Henson"
},
"reviewBody": "I will make this again. It was very good. I did add cottage cheese to it, about 15 ounces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adriana Betancur"
},
"reviewBody": "We want to eat more vegetables and less animal products, so I'm testing vegan and vegetarian dishes. My first time ever cooking or eating tofu. My family doesn't want to ever eat it! And the kids dont like vegetables, but what they don't know.... I took the advice of other reviewers. \nI drained and dried the tofu with paper towels. \nUsed Barilla gluten free oven-ready lasagne. \nSauteed 3 tbsp of minced garlic, half a red onion diced, half a tomato diced, handful of spinach and a handful of diced mushrooms in olive oil.\nMixed the tofu, 3 tbsp ricotta, eggs, sauteed veggies, substituted the milk with heavy cream; salt, blk pepper, thyme, parsley, basil -all eyeballed.\nLayered the baking dish: Muir Glen organic Fire Roasted Tomato pasta sauce, lasagne, tofu mixture, sauce, parmesan and mozzarella. Repeat 2x. Baked at 350 for 55 minutes (the pasta was still hard at 35 min). I made a small dish. My kids liked it. They don't know what tofu tastes like so they ate it. I froze half of it so my husband can try it when he gets back home. It was delicious!!! I will be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "I love this recipe. I do use a whole jar of sauce, as it is a bit lacking as written. Sometimes I add cooked ground meat, sometimes not. It is amazing both ways. I also like to add in a layer of veggies such as mushrooms and spinach. I don't drain/dry the tofu first, and have never noticed problems with too much moisture or \"tofu flavor\". This is my go-to lasagna recipe, and easy to jazz up with additional flavors as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nataliia Bhola"
},
"reviewBody": "It's the best lasagna ever! If you gave me this to taste and don't let me know it has tofu, I would think it cooked with meet. I just fell in love with this recipe. THANKS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cherie Craft"
},
"reviewBody": "Very tasty. I added the rest of the jar of sauce as I layered. Don't forget to drain the tofu. I seasoned with Italian seasoning, garlic and onion powder, seasoned salt and the rest of the listed seasonings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Dodd"
},
"reviewBody": "Like many had said, it was a very bland recipe. I had anticipated having to add spices etc. Added spinach and a mixture of spices. What really annoyed me was that even though I used a larger pan I had WAY too many noodles. No way you would ever use a box and a half for ANYTHING."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny"
},
"reviewBody": "Fantastic tofu lasagna! It was my first time working with tofu, and it turned out wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "LuvBug Ash"
},
"reviewBody": "ADDED more sauce, 2/3 tbs of Italian seasoning, and 2/3tbs of garlic powder. Didn't have too mozzarella on hand, so I added mexican cheese and fresh parmesan in the layers. Came out pretty darn good. Next time, I will add mushroom and spinach :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jamie"
},
"reviewBody": "I cut this recipe in half to fit in an 8x8 dish. Should not have also cut the sauce in half- there wasn't very much at all!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Georgina Westphal"
},
"reviewBody": "I added ricotta and it turned out ok, I would imagine it's delicious if you're used to tofu and not eating meat. I'm not sure I'll make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Mailloux Pompa"
},
"reviewBody": "My husband and I LOVE this dish. It tastes amazing and we love the fact that it doesn't have any meat. I doubled the sauce, added spinach, sautéed mushrooms and asparagus. I've made this dish 3 times and no matter how thin I spread the sauce I still end up with too many noodles. Next time I'm cooking half the amount in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hillary"
},
"reviewBody": "Loved this! Didn't change anything. Just think I may add a touch more marinara next time. Kids and husband devoured it! I liked another reviewer's idea to add some veggies in there so it is truly a complete meal. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "americab76"
},
"reviewBody": "Use twice as much cheese and twice as much sauce"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PiggyLizard"
},
"reviewBody": "I used firm tofu and did not drain it before combining. I also used no-boil noodles to make this a quick weeknight meal!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Richardson"
},
"reviewBody": "I loved this recipe, it was very tasty! I didn't change anything, but I used organic cheddar cheese, added some more spices to wake up the flavor. I will be making it again and I also I used Brown Rice lasagna noodles. My husband loved it, which was a plus!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Gisselle Ruiz"
},
"reviewBody": "This was a delicious recipe! I did make a few additions, however ,that I thought made it even tastier. I chopped onion, tomatoe, garlic, &amp; mushrooms and sautéed them; then I poured the sauce over that and brought it to a boil. After letting the sauce cool down a bit I added to the mixture. I also added a cottage cheese layer. It was cheesy goodness!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ob1kaleo"
},
"reviewBody": "Amazingly good! Kinda taste like there meat in it. Good texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Brandi"
},
"reviewBody": "I did not enjoy this recipe. I wasn't impressed with the tofu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "merlion"
},
"reviewBody": "I think it would be better if this was made in a smaller dish as there isn't very much sauce..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremy Grijalva"
},
"reviewBody": "Followed the recipe all the way my wife and I enjoyed this very much. It was easy to make and easy instructions. Will be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PiepsPack"
},
"reviewBody": "Tried this recipe not expecting a whole lot, but if it wasn't really really good! I will definitely be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jrucker361"
},
"reviewBody": "So yummy and the leftovers were good. Next time I'm going to add more sauce and throw in some black and green olives."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "portishead0503"
},
"reviewBody": "This was pretty good but I think it needed more of the sauce mixture. Next time I will double the sauce mixture for sure!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lena Hebert-Richards"
},
"reviewBody": "So, I have a household of 4 men who happen to be carnivores and they were floored that there was no meat in this lasagna! They and I loved it so much that there was absolutely no left overs. The only things I did differently is sauteed 6 cloves of garlic with fresh mushrooms and used a whole jar of spaghetti sauce. This is definitely a keeper and they requested I make this again and soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stade1cm"
},
"reviewBody": "I made no changes and was very happy with this Italian tofu dish. The only issue I had was that the breaking didn't stick well, but that could have been my fault."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DumbleDog"
},
"reviewBody": "This was awesome! My family hates tofu, but even they likes it. I used extra sauce, and added some cottage cheese and sautéed spinach and mushrooms. Perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Laurie Davis Cleveland"
},
"reviewBody": "Needs more spices, it is bland. I was desperate for something quick and easy for dinner, and I had a package of tofu, found this recipe. I didn't have any mozzarella (shocking) but had fresh Parmesan and 75% reduced fat cheddar. I shredded the cheddar and used the entire 2 cup pkg of Parmesan. All I had was a combination of WW and white noodles, so they were used. I did substitute garlic salt for regular and threw in the remains of a pkg. of sun dried tomatoes with peppers during the last minutes of cooking the noodles. I used a whole jar of sauce, layering the sauce on the bottom of the pan, layering noodles/tofu mixture. We had to sprinkle red pepper flakes on the finished product to jazz it up, but I'd make this again with sauted onions, garlic, peppers, etc."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Marobizios"
},
"reviewBody": "I am vegetarian and very familiar with tofu but this recipe was not good at all. I even tried adding sautéd mushrooms and zucchini and increased the cheese and salt and pepper. Dry and could taste the tofu too much even the next day. Not worth the trouble. Unless you are vegan, just use low fat ricotta cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lauren"
},
"reviewBody": "I used trader joes red pepper sauce with the tofu. It added a really nice flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "karkar"
},
"reviewBody": "Just made this recipe. It was actually the first time I've ever made lasagna! Fabulous!! I changed it a tiny bit, like everyone else. I omitted the milk(just because it seemed kinda out of place, and I wanted to avoid the cheese and sauce mixture from becoming to watery), added a cup of boiled spinach, a couple of seasonings, extra mozarella,and extra sauce for on top, since there wasn't enough for the final layer. Perfect for meatless lasagna with a lot of protein!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOULEKAT"
},
"reviewBody": "This was surprisingly very good. I expected it to be kinda gross as I'm not normally the biggest tofu fan! I followed the directions as is but next time I will add at least twice the sauce and try adding some fresh garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "newcook"
},
"reviewBody": "I had bought tofu and was wondering what to make with it. I came across this wonderful recipe and decided to give it a try. I also had a few vegetables left like 1 carrot, 1 capsicum, a couple of other peppers and half a broccoli. I heated olive oil in a pan, added 5 cloves of garlic. Added the veggies. Sauteed it till broccoli was cooked. I followed the rest of recipe but forgot the milk. Added basil, Italian seasoning salt, oregano, garlic salt, onion salt and red chilli flakes. \n\nThe lasagna held itself well. It tasted good, but some of the larger broccoli pieces tasted bitter. I would probably avoid broccoli next time and remember milk. Although i didnt miss it, i would like to see the difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hopeful Butterfly"
},
"reviewBody": "I rarely rate recipes 5 stars. This tofu lasagna recipe is my new favorite recipe. I too was able to fool a meat lover family member with this. The comments in the other reviews are dead on. What really made this recipe awesome---I added spinach, sauted mushrooms, onions and garlic. I also used Classico Fire Roasted Tomato and Garlic sauce which gave this dish a kick with the chunky tomatoes. I used Lucerne Italian Four Cheese Blend. Be sure to drain your tofu usimg paper towels. try to get all of the water out of the tofu. Someone actually recommended doung so fir 35 minutes prior to preparing this dish. This is a must or ur lasagna is sure to be runny. Overall, I Lovvvvvveeeee this recipe. Everyone must try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aejacobs"
},
"reviewBody": "I thought this recipe was great! I will make it again and I would probably add more sauce next time. But definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules Estrada"
},
"reviewBody": "This recipe was beyond amazing! It was my first time making anything with tofu and it was just divine and heavenly. No one knew it was tofu lasagna until it was all gone, it was that good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "elbowman"
},
"reviewBody": "The nutmeg completely threw off the entire dish for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Elle"
},
"reviewBody": "This is pretty good; I doubled the cheese and more than doubled the spaghetti sauce, based on other reviews. I used the pre-cooked Barilla lasagna noodles because I wanted the half-sized noodles to fit smaller casserole dishes. Next time I'll try this with the Hunts Chunky Vegetable spaghetti sauce and add a few more vegetables. Or just use my regular lasagna recipe and use the tofu in that recipe. Love the idea, but it was okay, but not great, for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sadieswain"
},
"reviewBody": "This is a great recipe! I made some adjustments as follows starting with the first time I made it based on my personal opinion and some reviews. I sauteed garlic, and mixed that with a couple cups of frozen spinach, the tofu, and some crushed red pepper. I mixed in one egg, some garlic salt and pepper, and 1/2 Cup grated Parmesan. I then mixed in a little bit of spaghetti sauce and a little mozzarella. I used the rest of the sauce and mozzarella to make separate layers in the lasagna - tofu mixture, sauce, cheese, noodles, etc. The tofu mixture i got from a different recipe for tofu lasagna rolls, which I have been making for a while! It was great this way, and probably great the original way as well!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Delish! I took others suggestions and jazzed it up a bit with additional spices including red chili pepper flakes. More sauce and more cheese are definitely needed. I did not tell my boys it had tofu in it and they both had second helpings. Leftovers were not great but I will absolutely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie D"
},
"reviewBody": "I made this for the family tonight and did not tell them what it was made from. \nThey all loved it, from husband to kids not a complaint in the bunch. \nI did what IslandGirl05 suggested and drained the tofu well as well as adding extra sauce. \nI didn't have spinach so I steamed a bag of frozen broccoli and a carrot I had and then processed them in the food processor. I had a few mushrooms in fridge and added them to the tofu mixture in the food processor as well. Only had one cup of mozzarella, so used a cup of cheddar as well. \nDelicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ardenia"
},
"reviewBody": "I really enjoyed this, however I can't give it five stars as I made too many of my own adjustments so I can't really say how the original recipe would have turned out. I made my own pasta sauce with about 4 garlic cloves and I used 3 cups of sauce. I used just a dash of the nutmeg on the tofu as I was not sure how I felt about it in the recipe. I made up for it by adding rosemary, oregano and basil to the mixture and instead of mozza I used cheddar as that was all I had on hand. I also sautéed some zucchini, onions and green pepper and added them to each layer as I though this recipe could use a few veggies. I would suggest making a tent with tin foil over the pan and bake for 15 - 20 minutes and then remove and bake for a remaining 10 minutes so that the top gets nice and brown. I will definitely make this again and again as it is a wonderful change from the same ol' tofu recipes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janine"
},
"reviewBody": "The recommended amount of noodles is confusing in this recipe. Once I figured that out, it turned out great. A regular pkg. of lasagna noodles is 16 oz. I used half, 8 oz., (as recommended on the box) for a 9 x 13 baking dish with three layers of noodles. I also used a lot more sauce than called for--about 32 oz. My 17 yr. old daughter loved it and had 3 servings. I never told her about the tofu. I will leave out the nutmeg the next time. It seemed like a strange ingredient for lasagna. I added a cup of fresh baby spinach to the center layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Thought this recipe was amazing!! Not a huge fan of tofu but when it's cooked you wouldn't even notice it. Took some suggestions and added garlic, onions and peppers to the mix. I also added a layer of lean ground beef.\nBoth my partner and I agreed it was delicious!! Definately will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Trevor Chapman"
},
"reviewBody": "Family loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MaLizGa"
},
"reviewBody": "Love sneaking tofu into dishes for the added protein and bulk! This is great. I followed the most helpful review by LJ in terms of spicing it up. Added sauteed onion, zucchini and a chunk of frozen spinach. I also used the no cook lasagna noodles. I'm guessing it'll be better tomorrow after the flavors have marinated overnight... looking forward to it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "milkshake"
},
"reviewBody": "I could easily double or triple this recipe and it still would just fill the pan. I made it for my family and it received rave reviews! I used 1.5 blocks of tofu, and water instead of milk. I used cheddar because I didn't have any mozza onhand, as well as I topped it off with salsa because I didn't have enough spaghetti sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amy B"
},
"reviewBody": "DELICIOUS - with some modifications. The modifications made it a 5 star meal. I used twice the mozzarella and an entire jar of spaghetti sauce. I added one jar of drained artichoke hearts, (roughly chopped), a couple cups of fresh baby spinach, and 5 cloves of garlic and 1/2 an onion, (chopped and sauteed in olive oil first.) \n\nDefinitely a good base, but I feel like the modifications, (some based on others suggestions), definitely added to the flavor and the look. \n\nEnjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashly Traxler-Cole"
},
"reviewBody": "NO ONE KNEW WHAT WAS IN THIS AND THEY LOVED IT. SHHHHH"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Culinary mom"
},
"reviewBody": "I used Ricotta cheese, added some spices, and used Francesco Rinaldi Spaghetti sauce with some added brown sugar. Will make again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nalvens"
},
"reviewBody": "I made this once and followed some of the reviewers suggestions -- turned out great. I would definitely add garlic, italian seasoning and basil as suggested. And the mushrooms and sauteed zucchini was a great idea."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jessica Wilson"
},
"reviewBody": "Band! It needs onion and a lot more veggies and more garlic. I would also add more sauce and seasoning. However, it is a great start to a tofu veggie lasagna. I would not serve this to guests as is though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jeff Stark"
},
"reviewBody": "I will make this one again, but there needs to be more sauce and a little more seasoning in that sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina Hartshorn"
},
"reviewBody": "Very good! I'm vegan so I used Daiya cheese in Place of mozzarella, and used nutritional yeast in place of Parmesan, and unsweetened soy in place of milk, and skipped the eggs. I also added a lot more spaghetti sauce, probably almost an entire jar. I brought it to work and shared it with my non vegan friends, and they couldn't get enough!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AmyR"
},
"reviewBody": "Good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I used 28 oz spaghetti sauce and added 4 oz tomato paste\nMy meat eating husband asked for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mermom46"
},
"reviewBody": "My carnivorous husband who won't touch tofu said it was delicious! good sauce is the key to all pasta so use your favorite. I used whole wheat lasagna noodles. I never pre-cook the noodles. I just rinse them in water and layer them on. Just make sure they are totally covered with sauce and will cook perfectly. I added 1 pkg of frozen spinach &amp; 2 C of ricotta to make filling. Be sure to squeeze all the water out of the spinach and the tofu as was suggested above. These measures prevent runniness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sharellie"
},
"reviewBody": "Thought this recipe was great, tasted just like a normal lasagna and reheats well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie Smalls"
},
"reviewBody": "I am going to give this a 5 stars. The lasagna is in the oven now. It was easy to throw together for sure. I forgot the nuymeg but I did add lots of garlic plus (hubbys must have) italian spices, onions, mushrooms spinach and salt and pepper. I also did not mix the tofu with anything but a little ricotta and spinach because I hoped to fool my husband into thinking it was ricotta. I used oven ready noodles. I made it early so the lasagna could \"sit\" in the flavors to be reheated in the microwave when everyone comes in at different times for supper. I hope this is a winner. I will let you know! UPDATE!!! After now eating this I can say I will make this again. It is so simple and it is tastely. Make at least 4 cups of sauce (possibly 6) and go to town on your favorite spices. The tofu tates likr cheese to me. I used mozza, riccotta and Parmesan liberally. In the end when we found it dry after doubling the sauce we reheated with V8 and added salt pepper and Franks red hot. It was very yummy with the dish taking on the flavors of the spices and seasonings that are your favorites. This was so easy and nutricious (I also use plenty of spinach) I will make again. You cant really taste the tofu unless you are just crazy picky (its all in your head) Every picky person in my house ate this and liked it. This works very nicely and I will definately whip this easy recipe up again due to the ease and nutricional value. One last tip. Use extra firm Tofu and you wont have to worry. A winner"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kfoster"
},
"reviewBody": "Slightly dry, needed more red sauce. I'm not a tofu fan, but this was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Faylinna"
},
"reviewBody": "Like many other reviewers I had to add extra ingredients to give it more zing, and it needed a LOT more sauce. Luckily I had more in the house! It had a strong tofu flavor but was still very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "What'sCookin?"
},
"reviewBody": "I made this WITHOUT the cheese. I also did not mix the sauce and tofu. Instead I layered the tofu mixture, noodles and the sauce. My 2 and 7 year old LOVED it! I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "luv2bake"
},
"reviewBody": "The inside tasted like ricotta cheese and the lasagna was even better than the store bought ones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "venetian_lunacy"
},
"reviewBody": "I am ranking this five stars due to the changes I made. Extra garlic, more spices, and additional salt."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "very good. everyone loved. I added some sauteed spinach and mushrooms but other than that kept the same. Only request from family was to use more sauce next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babybear"
},
"reviewBody": "very good. everyone loved. I added some sauteed spinach and mushrooms but other than that kept the same. Only request from family was to use more sauce next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "rebekah"
},
"reviewBody": "definitely needs some sprucing up, but a good start! i added zucchini which was good, but next time i'll add twice as many veggies and more sauce &amp; spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Dunson Mama"
},
"reviewBody": "So yummy! My kids said it was the best lasagna ever. We have never eaten tofu before. I did not fool around with the spices I just used a whole jar of spaghetti sauce. Next time I will double!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "imsomr"
},
"reviewBody": "I didn't even recognize the tofu, so good! I froze my tofu without the water overnight for texture. Then I defrosted in the microwave for about 3.5 mins. I then got all the water out with paper towels. Many reviewers were saying they missed some seasoning, onion, &amp; garlic...so I used roasted garlic &amp; onion spaghetti sauce. It was the perfect combination and I did not need to add anything else. I did add 1/4 cup of cottage cheese and it added the texture needed. I do recommend pouring your left over sauce in the bottom of the dish and stacking on top of that. The noodles on the top were hard, next time I'll try baking covered. You won't be dissapointed, my 4 year old even liked it. I will be making this again with my left over noodles."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bindigirl"
},
"reviewBody": "suprisingly good. I was given some tofu and had no idea what to do with it. I tried a few recipes and most ended up in the garbage. This one however was a keeper. Even my husband said you couln't tell it was in there. I did add lots of extra seasoning to try to cover the taste of the tofu and I guess it worked."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jey Noel"
},
"reviewBody": "Very easy to prepare this recipe. And its completely delicious too. Alterations: I added half a cup of fresh green vege.I don't think it was spinach but it tastes like spinach tho, added some fresh mushrooms, italian herbs, 4 cloves of garlic and one big onion which i chopped up.I didn't have any fancy cheese on hand so I used about 6 slices of kraft cheese. after each meat layer I would add that.WAs fantastic and not too caloric, best part, this made me not even miss meat lasagne. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jo_tangwh"
},
"reviewBody": "It's fantastic! I've cooked it for many of my friends and most of them couldn't tell that there's tofu in it! I usually add spinach, an onion, 3-4 cloves of garlic, shitake mushrooms to make it more favour. Thanks for the great recipe, Perry! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tish"
},
"reviewBody": "Delicious!! I took the advice of previous reviews and doubled the sauce and all that was mixed with it. Used a cup of lowfat ricotta to add with the tofu. Also added some mushrooms, spinach, couple cloves of minced garlic, basil and italian seasonings and some chopped onion. Also, very important as stated previously..make sure the tofu is DRY. This is a wonderful recipe and it will be used many times in the future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Momily"
},
"reviewBody": "Tip: Use oven ready noodles! It soaks up the liquid nicely. Let the lasagna sit for at least 15 minutes before serving. Alone, this lasagna lacks flavour. I added onion, garlic, fresh basil, mushrooms and ricotta cheese; I left out the milk. Any changes you make to this recipe, will make it a 5 star!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Junie"
},
"reviewBody": "Great tofu dish. I also made a few changes like the others suggested: drain tofu using paper-towels x 1 hour, add to the crumbled tofu egg, 2 dollops sour cream (substituted for the milk), 3 crushed garlic cloves, pinch of rosemary, 2 TBSP parsley, 1 tsp oregano, 1 tsp basil, 1/4 tsp blk pepper &amp; half of mozzarella (rest is used when layering). Also sautéed 1 onion and 8 oz mshrms in 2 tbsp olive oil and layered that in the first of the layers and used a whole jar of Newmans tomato and basil sauce (so about 3 cups)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Teresa-Renae Daly"
},
"reviewBody": "No one in my family likes tofu. I used the medium tofu recommended for lasagna and this recipe was given 5 stars by the family and they are willing to have this anytime I want to fix it. WOW!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "We added two cloves of crushed garlic and about two tablespoons of red onion, and it came out wonderfully! We never would have known we were eating tofu (not that we have anything against tofu anyway!). Thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Romina"
},
"reviewBody": "This was very bland. I did add more tomato sauce and of course I didn't saute the onion so I will next time. \nMy husband said it needed some ricotta cheese... He said something was missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Summer Rose"
},
"reviewBody": "This was great! You couldn't even tell there was tofu in it! I did add about a 1/4c of lowfat cottage cheese in with the tofu mix. I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica T"
},
"reviewBody": "I loved this recipe! I'm not a huge fan of Tofu, but it really soaked in the flavor of the sauce. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have read some recipes that advise to freeze tofu overnight to change the texture to more like feta or ricotta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "swifty&#39;s wifey"
},
"reviewBody": "passed with flying colors with my vegetarian sister. i would add more tofu and less layers of lasagna pasta to \"beef\" up the look of the lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "queenbuttercream"
},
"reviewBody": "This recipe is a keeper! I took the advice from other reviews &amp; added more sauce &amp; sauted veggies. This was only the second dish I have used tofu in &amp; I am so pleased. The whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "llalli"
},
"reviewBody": "Made a few modifications as well - diced and sauted 3 cloves of garlic, and one each of the following: zuccini, onion, red pepper or green pepper, mushrooms with some olive oil and salt &amp; pepper - then added it to the mixture of tofu, pasta sauce eggs and instead of milk i added light ricotta cheese. I baked this with whole wheat noodles and light mozza cheese - turned out fantastic, better than any beef or chicken lasagna! This has become a permanent recipe in my books!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mels77"
},
"reviewBody": "I have been making this for a couple years now, and I still love it! We use brown rice lasagna noodles and I also add a zucchini, mushrooms, spinach, peppers and onion to the sauce mixture. I have fed this to many meat eaters who say they didn't even miss the meat AND they didn't even realize it was tofu! I usually can make two dishes (the second a smaller size) and freeze one for later. It is best cooked the day before and re-heated for dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ckitt615"
},
"reviewBody": "So I decided to make changes in the way I eat, this was my first Tofu \"experiment\" and I was very surprised with the outcome. Needless to say it came out fantastic and quite similar to the photo. I used shredded Parmesan instead of grated but it made no difference. My roommates and all our unexpected company enjoyed it as well. Def a must make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sfirth"
},
"reviewBody": "This lasagna is delicious! I've made it twice now (in 2 weeks). The first time I ended up with too-little sauce so the 2nd time I doubled everything except the tofu, noodles, eggs &amp; milk. 2 cups of cheese seemed to be enough but you might want a touch more. I added spinach (4-5 cups chopped), one onion and 2 cloves of pressed garlic. It is seriously the most delicious thing I've ever made but I highly recommend adding more ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "constructiongal1"
},
"reviewBody": "So good that A frined who never takes seconds, took seconds!! Great way to introduce tofu to someone"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ATXcookin"
},
"reviewBody": "I added sauteed mushrooms, onions, zucchini and fresh spinach. I agree that it is essential to press the water out of the tofu before combining it with other ingredients. I loved the richness of this dish but had trouble getting it to be flavorful enough. I added thyme, oregano, salt and pepper, but it was still a little bland. All in all a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crex"
},
"reviewBody": "This was amazing! I took some recommendations below and added 1 tbsp dried basil, and also on my own advice 3/4 tbsp red pepper flakes and this was just absolutely perfect. Decadent and wonderful vegetarian food, for sure! 5 stars!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chantelle Kadlec"
},
"reviewBody": "I too added more cheese and doctored up marinara and this was a very good recipe! I would definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jackie and friend"
},
"reviewBody": "With a few extras, this was fantastic! I took several other reviewers' advice and was very glad I did: used a full jar of sauce, make sure the tofu is dried and doubled the cheese. We also added a few of our favorite veggies: mushrooms, cauliflower, onions, zucchini as well as some Italian seasoning and red peppers. I think you could use whatever you wanted. I added these raw to the mix and with a little extra cooking time, it came out great! Will definitely be making again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/25345/tofu-lasagna/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
"name": "Lasagna Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/25345/tofu-lasagna/",
"name": "Tofu Lasagna"
}
}
]
}
}
, "about": [
]
}
]