				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tofu Turkey I"
,"datePublished": "1999-10-16T17:21:55.000-04:00"
,"dateModified": "2022-07-14T18:05:12.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tali"
,"url": "https://www.allrecipes.com/cook/26842504"
}
]
,"description": "This is so darn clever and tasty, we know you&#39;ll want to give it a try. A shell of tofu is prepared and filled with an incredible stuffing and a layer of tofu on top. This amazing package is inverted - carefully - onto a baking sheet, and the edges sealed."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/m4G16pqLsYvZuZL7VKwX9_HdNNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/365677-007978a28ef847b1b8e9c5f399320f7f.jpg",
"height": 250,
"width": 250
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555495678001",
"description": "See how to make a vegetarian tofu turkey for Thanksgiving.",
"duration": "PT3M59S",
"name": "Tofu Turkey I",
"thumbnailUrl": "https://static.onecms.io/wp-content/uploads/sites/43/2020/09/08/5971858.jpg",
"uploadDate": "2021-07-21T00:59:04.442-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tofu Turkey I"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "66"
}
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "470 kcal"
,"carbohydrateContent": "22 g"
,"fiberContent": "3 g"
,"proteinContent": "27 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "1295 mg"
,"sugarContent": "5 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"recipeIngredient": [
"5 (16 ounce) packages extra-firm tofu",
"2 tablespoons sesame oil",
"1 red onion, finely diced",
"1.3333333730698 cups diced celery",
"1 cup chopped mushrooms",
"2 cloves garlic, minced",
"0.125 cup dried sage",
"2 teaspoons dried thyme",
"salt and pepper to taste",
"1.5 teaspoons dried rosemary",
"0.25 cup tamari",
"3 cups prepared herb stuffing",
"0.5 cup sesame oil",
"0.25 cup tamari",
"2 tablespoons miso paste",
"5 tablespoons orange juice",
"1 teaspoon honey mustard",
"0.5 teaspoon orange zest",
"3 sprigs fresh rosemary" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Line a medium sized, round colander with a cheese cloth or a clean dish towel. Place the crumbled tofu in the colander. Place another cheese cloth over the top of the tofu. Place the colander over the top of a bowl to catch the liquid. Place a heavy weight on top of tofu. Refrigerate the colander, tofu and weight for 2 to 3 hours."
} ,{
"@type": "HowToStep"
,"text": "Make the stuffing: In a large frying pan saute onion, celery and mushrooms in 2 tablespoons of the sesame oil until tender. Add the garlic, sage, thyme, salt and pepper, rosemary and 1/4 cup of the tamari. Stir well; cook for 5 minutes. Add prepared herb stuffing and mix well. Remove from heat."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C). Grease a cookie sheet."
} ,{
"@type": "HowToStep"
,"text": "Combine 1/2 cup sesame oil, 1/4 cup tamari, miso, orange juice, mustard and orange zest in a small bowl; mix well."
} ,{
"@type": "HowToStep"
,"text": "Remove the weight from the tofu. Hollow out the tofu so that there is one inch of tofu still lining the colander. Place the scooped out tofu in a separate bowl. Brush the tofu lining with a small amount of the miso seasoning. Scoop the stuffing into the center of the tofu shell. Place the leftover tofu on top of the stuffing and press down firmly. Turn the stuffed tofu onto the prepared cookie sheet. Putting the leftover tofu side of the &#34;turkey&#34; (the flat side) down. Gently press on the sides of the &#34;turkey&#34; to form a more oval shape. Brush the tofu turkey with 1/2 of the oil-tamari mixture. Place the sprigs of rosemary on top of the tofu. Cover the &#34;turkey&#34; with foil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/m4G16pqLsYvZuZL7VKwX9_HdNNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/365677-007978a28ef847b1b8e9c5f399320f7f.jpg"
}
]
,"text": "Bake for one hour. After one hour, remove &#34;turkey&#34; from the oven and remove the foil. Baste the &#34;turkey&#34; with the remaining tamari-oil sauce (reserving 4 tablespoons of sauce). Return &#34;turkey&#34; to oven and bake another hour or until the tofu turkey is golden brown. Place the tofu turkey on a serving platter, brush with the remaining tamari-oil mixture and serve hot."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT0M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jusawolt"
},
"reviewBody": "Am delighted about this recipe! Was easy enough and it actually worked and tasted yummy!! Even our non-veggie friends thought it was good. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Bodhi"
},
"reviewBody": "I tried making this for Thanksgiving and the result was pretty awful. Before starting I wondered what would bind the crumbled tofu together. After cooking it my suspicions were confirmed; it disintegrated rather than sliced. Also the flavor of the sesame oil was overpowering. I like sesame oil, but there was just far too much of it in the baste. At the moment I'm making a \"Gluten-Free 'Seitan' Roast\" from another recipe, also using crumbled tofu, and it seems far more promising."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eryl"
},
"reviewBody": "TOFU is an amazing food. It is really only suited for folks with A and AB Bloodtype. It's estrogen mimicking feature makes it a risk for other Blood Types. It is anti cancer medicine for Type A.\nIt is practically impossible to marinate flavours into Tofu. It only slightly penetrates the skin. But combining everything in a processor would be the best bet.\nThis is an amazing recipe, simple to construct; very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Nunn"
},
"reviewBody": "Worked really well, and I was surprised at how much flavour the tofu took on. Made this for our Christmas dinner the day before, and reheated on the day, saving much time and oven space. I cooked at a lower temperature for 45 mins each time (rather than an hour). Also added chopped chestnuts, a can of chickpeas and some dried cranberries to make the stuffing a bit more festive (also threw in some leftover grated Mozzarella ). Hugely successful. Also nice cold with some chutney."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Rosmarino"
},
"reviewBody": "I am excited to try this - but you need to modify it, as honey mustard is not a vegan ingredient."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabine Simple Bine Pruski"
},
"reviewBody": "Tasted delicious and everybody at the Thanksgiving party we attended was really amazed! I highly recommend blending the tofu in the food processor instead of crumbling by hand... and maybe add some spices to it! And also, dont add salt because the recipe itself is already really salty with the miso and tamari! I cooked 1 hr at 350 with foil and 1 hr at 375 without foil, coating the ''turkey'' with marinade every 30 minutes and it cooked wonderfully."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mady Herrmann"
},
"reviewBody": "loved the orange in it!! also worked great making it with only one package of tofu. easily split into 4 thanksgiving meals :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tami"
},
"reviewBody": "First I should say we live in Romania. So the things I can get are a lot different than in the states. I made this last week to \"practice for Thanksgiving\" . My son and daughter-in-law are here with us and they are vegetarian also. I really don't miss meat so I wasn't even going to try it. I'm so glad I did. It is wonderful. It was a little salty but everything here is very salty so I don't know why. Next time I will use tofu without added salt and not so much soy sauce. But our family loved it and it wasn't as complicated as I thought it might be. It is definitely a keeper and I will use it again. Thank you so much for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Cook"
},
"reviewBody": "I hosted thanksgiving this year, and most of the guests were vegetarian. I found, and also shopped for this dish on Thanksgiving morning with zero preparation, and it came out perfect. It looks like it might be difficult to pull off, but it's not. Very yummy. 5 Stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristin Eiler"
},
"reviewBody": "I love this recipe! I make it every year for Thanksgiving and sometimes Christmas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Can Can"
},
"reviewBody": "I was very impressed with the way this turned out. I served it for Thanksgiving to 9 meat eaters and EVERYONE said it tasted like turkey! I couldn't believe it. I have been vegetarian for 10 years, so tasting like turkey wasn't really the goal. I did make some changes: after reading the suggestions in this section, I first boiled the tofu in some vegetarian chicken flavored stock, then processed it in a blender, then pressed it with the weight overnight. I also substituted Bragg's Liquid Aminnos for Tamari and regular boxed stuffing mix for the stuffing; I also left out the rosemary as I didn't have any. I cooked the tofu turkey WITH the foil for about 3 hours, reappling the glaze every 30 minutes or so. I also cooked it on parchment paper instead of greasing the pan, so it didn't burn. It was really good: it looked and tasted like turkey! I also recommend the vegetarian gravy to serve with this (or mashed potatoes!)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "estelanavidad"
},
"reviewBody": "This recipe is terrific. Even my non-vegetarian family enjoyed it. One thing though, the instructions do not call for blending the tofu but I learned that is better if we blend the tofu rather than just crumbling it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "funiygirll"
},
"reviewBody": "I was a little disappointed with my results. I made this for thanksgiving and although my family liked it, i didnt. It didnt taste bad and the presentation was really good it actually looked liked turkey. I guess the positive reviews just made me really excited."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rose"
},
"reviewBody": "I followed this recipe for Christmas dinner. I did boil the tofu in vegatarian broth and run it through a food processor before placing it in the colander overnight. I did bake it slowly 300 degrees for 3 hours basting in every 30 minutes and keeping it covered with aluminum foil. It was slighty fluffy and so delicious. What a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael A. Dickman"
},
"reviewBody": "First time making tofu turkey. I was the only one out of the group of my friends who was vegetarian, but they all loved it. I made a little more sauce to put on top of the Tofu Turkey for flavor. I plan on making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Multislack"
},
"reviewBody": "I made this last week for Thanksgiving and it was a huge hit. My brother is actually pushing for me to make it again because he liked it so much. I followed some of CanCan's edits and rebasted more often. I think next time I am going to blanch the tofu first in broth to give it a stronger flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin Marie"
},
"reviewBody": "This was a good substitute for turkey on Thanksgiving. I halved the recipe (only two of us were willing to eat it). I added some soy/garlic/onion to the tofu before pressing. Also I pressed much longer than recommended (about 24 hours), then baked about about 350. Could not find any miso, so I left that out. Topping with gravy prior to serving helps the flavors a lot! I liked this a lot more than that the frozen tofurkey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have been making this every Thanksgiving since 1999. It is a huge hit with my family and friends, including the meat eaters. One thing I do differently, is I add some seasoning to the tofu (garlic salt, cumin, etc) before draining it in the colander. Also, I leave it overnight to drain as the texture is much firmer and holds up better when inverted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melaniesal"
},
"reviewBody": "I have been making this every Thanksgiving since 1999. It is a huge hit with my family and friends, including the meat eaters. One thing I do differently, is I add some seasoning to the tofu (garlic salt, cumin, etc) before draining it in the colander. Also, I leave it overnight to drain as the texture is much firmer and holds up better when inverted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Patricia Pascale"
},
"reviewBody": "Made this last week and I was very skeptical at how it would shape and taste. I began the process a couple of days prior to cooking the tofu. I let it drain with a weight for a full 24 hours. Occasionally I would pull it out of the fridge and press down on the weight to help drain more. I then followed the recipe and when it was stuffed I put it back in the fridge for a couple of hours more. When it was time to put it on a baking pan to cook I honestly thought it would just break apart and I'd be left with a big mess, however, it molded perfectly! I covered with foil and basted every 30mins or so in a 350 temp oven for a couple of hours. The taste was pretty good but tasted even better the following day. Next time I will pulse the tofu mixture so it is completely smooth prior to putting it in a colander as mine was lumpy and cracked a little. This was time consuming and probably more expensive than buying a tofurky from the store, but I was pleased to have tried the recipe and at least I knew what I was putting in my mouth. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CarrieHansen"
},
"reviewBody": "First saw a variation of this several years ago in Vegetarian Times magazine as a reader-submitted recipe. I've been making that version annually since. You might consider adding your favorite seasonings to the tofu as you crumble it; I suggest a bit of salt, white pepper, and garlic, but do whatever works for you. I love tofu but it is a bit bland and I think working in the seasonings as you mash up the tofu by hand really adds a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Wet_Coast"
},
"reviewBody": "I didn't have time to make the whole version of this so basically made a tofu/stuffing \"sandwich\", which I baked covered in foil. Then baked without the foil, basting with basting mixture until nicely browned. My newly vegetarian daughter thought this was excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookin' for cash"
},
"reviewBody": "I have made this recipe for years -got it from Peta magazine. I use only tamari and sesame oil for the basting sauce, and mix the herbs in with the tofu before allowing it to drain in fridge overnight. I am always asked to bring this to Thanksgiving- at first because we were the only vegetarians in the family and no one wanted to cook for us - now there are more vegetarians and a vegan in the family (I make mine vegan so anyone can eat it.)Baking it does make the house smokey, but is worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "natalie"
},
"reviewBody": "I'll be making this for Thanksgiving from now on! Even meat eaters liked this one. To give the tofu more flavor, I mixed in some soy sauce &amp; seasoning into the crumbled mix before pressing. I left the tofu in the colander overnight (at least 12 hours) and when I baked it, I used the temperature suggestions that DABDAB made. I didn't have miso paste &amp; tried some substitutes, but didn't like the flavor. I had to tweak quite a bit to make it taste right... I will make sure I find paste next time. Left-overs made nice sandwiches as well :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "v~"
},
"reviewBody": "I just mixed it altogether. The \"stuffing\" of it didn't work for me the first time so the 2nd time I mixed it altogether and liked it better. Easier, didn't change the taste which is good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Doniece Nelson"
},
"reviewBody": "I did not care for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MonicaG"
},
"reviewBody": "This was ok tasting, but did not resemble turkey. If you changed the seasonings it would work, but as is it tasted like Japanese food (not surprising with the tamari and miso)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debbie"
},
"reviewBody": "This was pretty good, very easy to make and a wonderful dish to make if you have a vegan/vegetarian coming for the holiday dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiely"
},
"reviewBody": "I loved this recipe and even some meat eaters liked it! I did tweak it a little bit only because I didn't have some ingredients (miso paste or orange zest and used soy sauce instead of tamari). I also pressed my tofu for 36 hours. One ingredient I added to the baste was a tsp of liquid smoke. I will make this every year, this was my first vegetarian thanksgiving! From reading the other reviews i cooked it for 1 hour at 350 with foil then 1.5hrs at 375 without foil. I was even able to mold it into a turkey with drumsticks on the side!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "I made a reduced-size recipe of this as a trial run before Thanksgiving for my vegetarian daughter. I absolutely loved it, and I didn't think it was terribly difficult. Because I only used 1.5 pkgs of tofu, I couldn't really shape it into a turkey, so instead I sprayed a sheet of foil with PAM and spread the drained tofu on top, then covered with stuffing and rolled up to encase the stuffing with tofu. I baked the roll in the foil with all of the sauce for the full time; I didn't brush it later. \n\nI think I'll wrap it in foil the next time, too, to keep it moist and to crisp the outside.\n\nOne thing I'll change - crumble the tofu finer, or even process some in the food processer to get a firmer more compressed \"turkey\" layer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LITTLECHILE"
},
"reviewBody": "WOW too cool and yummy!! My only problem that I had with the recipe is that since I made this for only my husband and myself I halved the recipe....now if you have a deep narrow collander for the tofu it would be fine but I had a difficult time \"stuffing\" \"the turkey\" since it was not deep enough... but my husband was pleasantly surprised by the taste as was I!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2HUNGRI"
},
"reviewBody": "From working with tofu over the years, be aware that different brands perform differently in cooking. You kind of need to get to know your tofu when it comes to texture, unless you don't mind soft and squishy as a possible outcome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "watts473"
},
"reviewBody": "This is an amazing recipe, and the presentation is beautiful. For the first time since becoming a vegetarian (approximately 4-5 years ago), it felt like we had true Thanksgiving dinner this year. The recipe is a keeper and will become the tradition in our family on Thanksgiving from now on. The search is over!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joia"
},
"reviewBody": "Fantastic.\n\nI followed the directions verbatim but pureed the tofu before pressing overnight under 20 lb. of weight. I omitted the miso (too expensive!), too.\n\nI'd cut the tamari next time - too salty!\n\nNevertheless, everyone, including the meat eaters, loved it and we happily ate it for leftovers after Thanksgiving, too!\n\nThank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raquel"
},
"reviewBody": "This is my 3rd year making this recipe. I am one that always takes receipes and makes them my own. I took a few things that I liked from this recipe and also the Tofu Turkey II and a few other additives.\n\nThis year I thought to do something different. I am all about flavor and your really have to over season tofu so that once it cooks it takes like something. Last year, I started to add Worthington's Turkey roll to the recipe. I grinded half of it up will the tofu and it came out having more flavor....I was pleased! But this year I am going a step further. I am going still add half of the turkey roll, but I am also going to take the other half and slice it very thin and after I hollow out the middle, I am going to line the inside with the sliced turkey. I also added some liquid smoke to the recipe. After turning the turkey over I am going to take the remaining sliced turkey and cover the whole top of the \"turkey\" with it. Then, I am going to take the reserved tofu/turkey blended mix and cover the sliced turkey to give it that smooth feel. And then of course I will baste it the same way.\n\nMy only concern is that every year I make it, the turkey kind of looses shape and conforms to the shape of the pan, so I have been trying to find the perfect sized oval pan to cook it in, but this year, I am going to cook it on low heat to see if that helps. \n\nI am also starting the turkey today (Tuesday) to give the seasonings time to soak in and also so that the tofu can get Really firm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jnoller"
},
"reviewBody": "The main thing here is- you need to have plenty of prep time. I personally have had fabulous results everytime I have made a Tofu Turkey for my daughter and myself. First off- I press the tofu overnight the night before Thanksgiving- usually for at least 12 hours so it really firms up. Then I hollow it out and add the stuffing (I use a really good natural stuffing that Whole Foods sells and add celery and other good stuff but do not ever add extra salt- there is plenty of that in the recipe as is. Once stuffed I then refrigerate it again for a few hours so it firms nicely and can be turned out into the cooking vessel. It's important to keep it covered with foil (hate using aluminum foil but what else can ya use?) and keep marinating it (I add apricot jam to the marinade and it really makes a lovely color and taste) often but COOK at low heat- I do it at 300 for about 2 hours so it won't burn. Serve with organic cranberry sauce and natural vegan gravy- mashed organic russett potatoes and organic yams...YUMMO!! I also make a vegan pumpkin pie made with silken tofu- recipe easy to find online. Happy Thanskgiving!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "kitchen witch"
},
"reviewBody": "After reading all these reviews it seems that everyone loved it or hated it. I'm doing Thanksgiving for the first time (Mom is the T-Day queen and no one else is allowed to cook that day. This year I'm six hours away!) I think I'm going to get brave and make this. \nI wonder if it would be helpful to freeze and drain the tofu to make the crumbly but better?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Bee"
},
"reviewBody": "My meat eater husband made this for me as a Thanksgiving Day Surprise. I thought it was an excellent vehicle for veggie gravy, and really isn't that what real turkey is for?\n\nHonestly though, I was really happy about how it turned out and ate it left overs for days-it's really good reheated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Raven"
},
"reviewBody": "I really loved this, but I had to tweak it quite a bit to get it how I liked it.\nI do not like Celery so I used extra garlic. I don't use miso, so I used sweet and sour sauce and teriayki sauce. I did not use orange juice or zest. I used Honey dijon. I used wine and red wine vinegar. It is delicious and much better than anything I have had as a vegetarian. My Dad loves it and he is 83 years old!\nI steeped the tofu in sesame and soy sauce then put it in the colander. You can't cook it as long as it says, it burns. So watch it carefully. It really is the best and you should try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CARENHEATHER"
},
"reviewBody": "very bland"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stealthflower"
},
"reviewBody": "Not bad - very tofu-ey, though! Next time I think I'll freeze the tofu and then mince it finely... and maybe do a few layers of the stuffing and the tofu. I'll be trying it again, but I wasn't hugely impressed with the way it turned out this time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JDILL7"
},
"reviewBody": "I couldn't believe I was eating tofu! Fabulous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DABDAB"
},
"reviewBody": "This is very good. The first time I made it the bottom cooked too much and couldn't be eaten. I lowered the temperature to 350 the first hour and 375 the second. I think 375 for both hours would be fine. It has very good flavor. It makes extra dressing which I circle around the \"bird\" and it makes a good presentation. Be sure to cover the \"bird\" with foil for the second hour too. It has great taste and isn't hard to put together. Add a little cranberry sauce and veges and you're set. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "*cherry*"
},
"reviewBody": "I did not care for this recipe. The tofu did not stick together after draining overnight and the end result didn't look good at all. However, the stuffing is excellent. Follow the recipe, put the stuffing in a pan and bake. Yum!! I made the stuffing for my family and everyone loved it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SarahRosenkrantz"
},
"reviewBody": "I believe I made this recipe correctly, because I followed the directions. I'm sorry, but it did not taste good at all. The tofu never got crispy (although I drained it overnight), and the flavors in the sauce did not go well together at all! The orange juice is the first thing to get rid of. I had to throw the whole thing away. Maybe I did it wrong, because some of the reviews raved about it, but I don't see how it can be good. I would try the other recipe on this site."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny Leckie"
},
"reviewBody": "I was really pleased with how this came out. I got a few eye-rolls when I told people that I was making a tofu turkey, but they were impressed with the taste. Winning people over to veggies one dish at a time! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very tasty. Time consuming, though, so make a day ahead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CHOPPNBROCCOLI"
},
"reviewBody": "I made this for Thanksgiving and although it was a lot of work, it tasted soooo good! I definitely recommend starting early crumbling the tofu AND pulsing it in the food processor, until really smooth, then draining it. Works much, much better! My whole family tried it and couldn't believe how good it was. Yes! This is a thanksgiving staple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "i write a mixed review, the dish takes a while but is easy (a tad bit expensive). I didn't use her stuffing recipe but did follow the tofu/body part. don't hollow the tofu out, create the interior cavity as the refrigerated tofu is being pressed by placing a round bottomed bowl in the tofu as a form. The tofu also needs a better marinade recipe it was pretty wimpy (and salty). I also tried to impregnate the tofu w/herbs &amp; soaked it for a long long time and that seemed to work better. good luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is AWESOME!Very easy, especially after the first time. The meat eaters at thanksgiving ALWAYS eat all our tofu turkey! I make two now. My children who are vegans love it too. And when it comes just out of the oven look out! :-) I have been making it now for three years and am always asked by the meat eaters if I'm bringing the tofu turkey. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I read the reviews of this recipe and thought, ok, this sounds good. I took the time to fix this for Thanksgiving and I don't plan on making it again. First of all, the amount of Tamari used in this recipe makes the stuffing too salty. I even reduced the amount and added water to cut it down a bit. Furthermore, the recipe calls for table salt? I had enough sense not to add any. Second, the cooking time is way too long. 2 hours at 400°F? Come on, get real. After only one hour, the sugars in the marinade (from the OJ) started to burn. Third, despite pressing the tofu with 35 lbs of weight overnight, the texture was still spongy. Finally, the tofu, naturally bland, never picked up any flavors from the stuffing and marinade. Bland AND spongy?!? \r\n\r\nMy plan is to give a shot at a $12 Tofurky (the real deal) and see if it is better. It would certainly be a whole lot cheaper and easier to fix. Tofurky's giblet gravy is good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "SHADOWGUEST"
},
"reviewBody": "We did not care for this recipe. But its all my fault for not testing it first. \r\nA free bit of advice: Never make an unknown, untested recipe for Thanksgiving or any other special Holiday for that matter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKB20"
},
"reviewBody": "This dish is terrific. This is the 3rd (or 4th) year that I have made this dish for my family. There are a few things that I have learned that have helped me out. 1) For time I use a prepared stuffing. Since this is usually salty, I try to minimize excess salt in other places. 2)I use a pizza pan, it looks like a big mound, but since I am usually cooking for 8-10 the shape doesn not matter. You have to take it easy on the marinade, one time it was a little to salty, taste first. My family loves this dish. My Grandmother MADE me bring her a piece and she had two \"real\" turkeys at her house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! My family loved it, even the non-vegetarians. My husband keeps asking when we are going to have the Tofu Turkey again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Although time consuming,most of the time is waiting for the tofu being pressed, or cooking. It was quite easy to make, and turned out much better than I expected. I left out the mushrooms (don't like them) and replaced them with previously pan fried potatoes, diced. This seemed to work out fine w/the recipe. I also was out of miso, so I substituted w/tahini, which I think worked great. The only thing I think I would do differently next time is go easy on the orange rind, or leave it out completely. I probably put too much in besides, but I could definately taste orange after all the cooking (its in the marinade.) The kids tried it, thought it was \"OK\", but my husband and I loved it! This dish is probably best for older kids,teens, and adults"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is INCREDIBLY good, although a bit time consuming, although it is incredibly worthwhile! Thanks, allrecipe.com!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/14113/tofu-turkey-i/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
"name": "Protein"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/270/everyday-cooking/vegetarian/protein/tofu/",
"name": "Tofu"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/14113/tofu-turkey-i/",
"name": "Tofu Turkey I"
}
}
]
}
}
, "about": [
]
}
]