				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Tortilla Española (Spanish Tortilla)"
,"datePublished": "2018-06-08T09:48:39.000-04:00"
,"dateModified": "2022-09-01T12:33:49.000-04:00"
,"author": [
{"@type": "Person"
,"name": "sjmoraes"
,"url": "https://www.allrecipes.com/cook/1834102"
}
]
,"description": "Tortilla española is a classic Spanish tapa. The omelet is typically made with potatoes and onion; this version adds red peppers and Serrano ham."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/nIC5746RdNvIgpbp7exzx_c-fVM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8066844-tortilla-espanola-spanish-tortilla-Sonya-4x3-1-bbb2ab2eee064f83a1ffe88afa09aeaf.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Tortilla Española (Spanish Tortilla)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "84"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "477 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "199 mg"
,"fiberContent": "4 g"
,"proteinContent": "13 g"
,"saturatedFatContent": "7 g"
,"sodiumContent": "449 mg"
,"sugarContent": "5 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT35M"
,"recipeIngredient": [
"0.5 cup olive oil",
"2 pounds baking potatoes, peeled and cut into 1/4-inch slices",
"salt and pepper to taste",
"2 tablespoons olive oil",
"2 onions, sliced into rings",
"6 large eggs",
"1 roasted red pepper, drained and cut into strips",
"3 ounces Spanish serrano ham, chopped",
"2 tablespoons chopped fresh Italian parsley" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat 1/2 cup olive oil in a large skillet over medium-low heat. Add 1/2 of the potato slices, and cook, stirring occasionally, until just tender, 15 to 20 minutes. Transfer potatoes to a large bowl, leaving oil in the skillet. Add remaining potatoes to the skillet; cook, stirring occasionally, until just tender, 15 to 20 minutes. Transfer potatoes to the bowl, reserving oil in the skillet. Season potatoes with salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "Meanwhile, heat 2 tablespoons olive oil in a separate skillet over medium heat. Stir in onion rings, and gently cook until soft and golden brown, about 15 minutes. Spoon onions onto a plate, and allow to cool."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs in a large bowl until smooth. Stir in cooled onions, roasted peppers, and serrano ham. Gently fold in cooked potatoes."
} ,{
"@type": "HowToStep"
,"text": "Heat the large skillet with reserved oil over low heat. Pour in egg mixture, and gently cook until the sides have started to set and the bottom has turned golden brown, 8 to 10 minutes. Loosen tortilla with a spatula if needed, then carefully slide onto a large plate. Turn the skillet upside down and place onto the uncooked side of tortilla. Turn the skillet right-side-up, and remove the plate. Return the skillet to the stove, and continue cooking until tortilla has set in the center, about 4 minutes."
} ,{
"@type": "HowToStep"
,"text": "Slide the tortilla onto a serving plate and allow to cool to room temperature. Cut into six wedges and sprinkle with parsley to serve."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT140M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Elaine-Marie Bohen"
},
"reviewBody": "Not the best recipe. Flavor-wise it was good, but the tortilla did not set well enough not turn over. I think the user who said he cooked one side in the stove top then continued in the oven may have the best idea here. I’ve made tortilla Española before and this recipe was the only one I’ve had issues with. Sorry All Recipes, I’m usually a huge fan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Smokey76"
},
"reviewBody": "I made it with chorizo and manchego cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "This was particularly good with the potatoes, onions, and sausage leftover from a crawfish boil."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Cahill"
},
"reviewBody": "We made this for my son's Spanish class. It turned out awesome and was huge. Made it in a large pan and flipped it using a plate. My son took it to school on a pizza pan. Came home with leftovers and the kids ate it for the next two days. We will make this again for the next family gathering."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anyès Pelaez Vedel"
},
"reviewBody": "I make my own tortilla.\n4 medium potatoes.\n3 onions.\n9 eggs.\nI cut the pieces of potatoes and onions really small.\nThen fry them slowly in wok for 40mn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Vaughn Phillips"
},
"reviewBody": "I felt like it either had too much potato, or not enough egg. Also, when it was cooled to room temperature, I found it to still be a little cold, and I also found it tasted better. The cook times are off as well, and the the heat was really high and burned the sides of the omelette, while not cooking the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kaylee"
},
"reviewBody": "You definitely won't need two onions, I only used one. Plus, I didn't cut the onions into rings. Also, I put a little more ham and eggs. It also didn't take near as long to make as it said it would. Other than that, I loved it!!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SunnyDaysNora"
},
"reviewBody": "This was ok. After reading all of the reviews about the \"extras\" not being traditional I left out the ham and roasted red peppers. I might have liked it more with them included, hard to tell honestly. It is enjoyable- what's not to like about potatoes and onions? But I think I was expecting more. Maybe more egg?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Missy"
},
"reviewBody": "It was a success for the dinner I was going to but it didn’t look like it does in the photo. Mine burned even after I tried it twice at a lower heat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Morgan Kelley"
},
"reviewBody": "Followed the recipe exactly and it didn’t look like the photo at all. It was still edible but did not look appetizing or prepared the way it is in the photo."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "plates4u"
},
"reviewBody": "This recipe is very good! I have made it several times. It is my go to recipe for breakfast in the colder months. Now, I must admit that for the first time I made it adding the ham, adding a pinch of paprika in lieu of the red peppers, and changed the procedure a bit. After adding the eggs I sprinkled it with cherry tomatoes. Then, I covered it with aluminum foil and put it in the oven for 5 minutes at 350F and broiled it for 2 minutes. In Spain, this month they have been celebrating the Spanish Tortilla Festival and I have had the chance to see some variations made by people and some chefs alike. Some add a bit of Spanish sausage to the tortilla. It is a nice interesting addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LiZa Sims"
},
"reviewBody": "I lived in Madrid for 2 years and this was a STAPLE!! Thank you for the terrific recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "psl2010"
},
"reviewBody": "Used chorizo sausage instead of serrano ham and it was delicious. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naty"
},
"reviewBody": "Loved this recipe!!! This was the first time I make Spanish Omelet and it came out delicious. My husband and I almost ate the whole omelet which was pretty big. I didn't have Serrano ham, so I used regular diced ham. I followed all the directions with the exception of an extra egg I added, I put the parsley together with all the ingredients instead of on the top at the end and I cut the potatoes really thin and cooked them in two different pans at the same time to speed up the cooking process I also baked the omelet in the oven at 350 for about 30-40 minutes instead of cooking it on the pan (the time depends on the container you use) I switched it to 400 the last 15 minutes . Delicious recipe!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Langenburg Dieguez"
},
"reviewBody": "I've been living in Spain for 15 years now and this is how my husband makes it. The only difference is he (and nobody I know here) doesn't use the ham and peppers. Also, he uses more oil, draining it to reuse later frying potatoes or another tortilla. :) He chops the onions and cooks them with the potatoes when he uses them. I don't like onions so usually he makes it without. The trick he says is to fry the potatoes slowly. My Spanish mother used to make them often with spinach, or chorizo, or corn or zucchini, etc. The possibilities are endless, but I like them plain the best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pat S"
},
"reviewBody": "Exactly as my Spanish Mom made it, except that Dad didn't like ham so it was vegetarian. Love it cold the next day. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cricket"
},
"reviewBody": "added a little chopped cilantro, excluded any meat, excellent"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amanda Luper"
},
"reviewBody": "Not the tortilla I came to depend on for sustenance in Spain, but an okay recipe. The ham and peppers seem to make it set funny, but I could have made it wrong. I also chopped the onions, didn't slice them into rings, since that's how it was prepared everywhere I had it. I'll probably just stick to potatoes and onions in my tortilla from now on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy Ecklund"
},
"reviewBody": "I'd never made this before, and have now made it twice this weekend, since we have lots of eggs and potatoes to use up. I was a little intimidated by the flipping, but I managed like a boss! I actually think my first attempt was the best. I didn't have any good ham, so i skipped that. I had seen another recipe that used sliced green olives, and those made a nice addition. 2nd attempt, husband wanted me to try sausage. It was good, but didn't really need the sausage, it was thicker, and the potatoes weren't as good as the first attempt. I will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "nothing special, but good -- pretty typical egg/potato/ham type of dish. I added a couple of extra eggs to hold everything together."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jefferson Coulter"
},
"reviewBody": "Replaced the ham with sundried tomato. Was an ok variant, but the Serrano ham would probably be better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cplatinum"
},
"reviewBody": "Okay recipe. In Spain this is made with chorizos not with ham Serrano or peppers.\nI make this almost every weekend since my family is from Spain. I've tried putting the mixture in the broiler instead of inverting it with a plate. I find it tends to dry out the tortilla so I prefer using the inverted method."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joys from CA"
},
"reviewBody": "This is a great recipe and one that can be enhanced or revised to fit your tastes and liking. I made it for a side dish for a Spanish dinner/wine tasting neighborhood party and everyone raved about it. I followed the recipe almost exactly, but if I made it again, I would add a little spice to pep it up a notch. I did just use regular ham and served marinated red peppers to top the serving if one desired and everyone used the peppers. Also I cooked the onions and potatoes together as one reviewer suggested. I will definitely make it again as my husband just loved it. Getting it turned out of the black iron skillet was tricky."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bobbie Sue Smith"
},
"reviewBody": "I replaced the Serrano with regular ham. It was not set up in the 10 minutes recipe called for."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carol"
},
"reviewBody": "My daughter, who just came from Spain, said that her tortillas didn't feature ham or peppers, so we left those out. The first time I tried this, the potato cubes were so brown and crispy that I just called them hash browns and made a regular omelet to serve along side. Tonight I tried adding a little water when they were partly done, and covered them much of the time to help them cook faster, and they still got quite brown before they were soft enough, but they seemed to work. I'm thinking of using a can of diced potatoes next time! The tortilla was fine to my kids...I could have used a bit of the ham and pepper myself. And I appreciate having a recipe that doesn't require an oven proof skillet, since I don't have one. So overall I'd have to say it's a 5 star recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a teaspoon of cayenne pepper for flavor and baked it in the oven in a 9 x 13 pan at 350 degrees for 30 minutes. It was a lot easier to cook it this way than to do it on the stove top and try to get it flipped over. Served it at a tapas themed lunch and loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjsn49"
},
"reviewBody": "I added a teaspoon of cayenne pepper for flavor and baked it in the oven in a 9 x 13 pan at 350 degrees for 30 minutes. It was a lot easier to cook it this way than to do it on the stove top and try to get it flipped over. Served it at a tapas themed lunch and loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Darrell Coomes"
},
"reviewBody": "Made it twice. Kids didn't care for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooking in Tanzania"
},
"reviewBody": "I've made this twice now. It's so filling that we only need one recipe to feed 4 of us with a little left over. Be sure to use a large enough skillet that you can easily stir the potatoes. That's the only challenging part. I added green pepper, cheese and ground beef the 2nd time around and we ate it warm. Yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHAVON"
},
"reviewBody": "I made this in about an hour and a half. The trick is to use plenty of oil, season everything and have a mandolin to slice the potatoes and onions; the slices should be no more than 3/8\". Put no more than 1 layer of potatoes in the skillet at a time to cook (not half of them at once!) The onions, however, can all go in at the same time. And the broiler trick does work; after letting the omelet set, shove it under the broiler for about 4-5 minutes. Voila!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "moROCKINchef"
},
"reviewBody": "Great recipe, didn't use ham or peppers (the more classic way) and it came out great! In the future I would love to put some fire roasted peppers in there and perhaps some spinach would be tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "opheliarevived2003"
},
"reviewBody": "Fairly simple and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChristyCookies"
},
"reviewBody": "I'm giving it a four because I followed the reviews with frying the potatoes first."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Ann-Marie Case"
},
"reviewBody": "Good, but a little too greasy for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SaritaW"
},
"reviewBody": "Absolutely perfect. Did the broiling as suggested and avoided the flipping mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JessV01"
},
"reviewBody": "Surprised my hunny with this for breakfast on fathers day since he loves Spanish food and he ate the whole thing himself! I was able to catch a bite ans it was amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Engstjl"
},
"reviewBody": "Ths recipe is a lot of work and it was not worth it. It did not have much flavor and it was difficult to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryanne Bush"
},
"reviewBody": "Not enough eggs. I used all the right amount of all ingredients but I needed more eggs. Other than that, good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "torrie"
},
"reviewBody": "i loved it, kids thought it was just ok. i saved the sieved oil in a mason jar and used it to cook other things, delicious oniony oil!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CaperWest"
},
"reviewBody": "I love this -- had made many times with a different recipe. I stuck w/ only potato and onion, followed others' suggestions and cooked the potato and onion together, and didn't flip. It took 20 min or so until the potatoes were soft but was the best yet. I sprinkle w/ grated cheese, paprika and green onion before broiling. We like serving ours with a bit of mayonnaise! I'd love to try it with a bit of goat cheese mixed in next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Valerie Weiler-Hinch"
},
"reviewBody": "So many years after living a year abroad in Spain, nothing stands out more in mind like the comfort of a well-made tortilla espanola. We enjoyed this for breakfast this morning, scaled back for just two people, with 4 eggs, two large potatoes, half an onion, and a dash of salt, pepper, and garlic powder. Keep it simple, use plenty of olive oil, and cross your fingers for good luck when turning it over and you can't go wrong!! Buen provecho!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SobeCook"
},
"reviewBody": "I lived in Barcelona for years and my S.O. is Catalan, so I make tortilla almost once a week to have on hand for snacks (Potatoes, onions, and cheese only).\n\nI thought I would offer some tips to make it easier. #1 = less oil. #2 = cook the potatoes and onion together. #3 = Time for the eggs: No need to mix with the others first; just pour the eggs into the pan once the potatoes and onions are cooked. I always grate some manchego or parmesan cheese into it at this point too. #4 = cook on low heat after you add the eggs. #5 = when it is ready to flip over simply place a big plate on top of the pan, hold it in place, flip the pan over, put the pan back on top of the burner, and then slide the tortilla back into the pan. Don't be scared, just do it with gusto! Trust me, you can do it!\n\nSides: It tastes great with a side of cut tomatoes with a drizzle of olive oil and a sprinkle of salt on them paired with a few slices of serrano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peach822"
},
"reviewBody": "I thought this was very good but it gets five stars because my husband really loved it. Omitted the ham. Wish it could taste this good with less oil, but I did not use a nonstick pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eliells"
},
"reviewBody": "My family loved this. The only change I would make is a little less oi and to be sure to buy small onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Esther"
},
"reviewBody": "I live in Spain and this recipe, although delicious, differs from the classic tortilla española in the fact that the classic one, the one you get in bars and restaurants does not have the serrano ham and the peppers. I have worked in many kitchens on the Mediterranean side of Spain, and learned there how to make a mean tortilla. There are two ways: with or without onions, and many restaurants offer both. You can cook the potatoes and onions together, in a deep pan, adding a little more oil and draining it when it's done. You know the potatoes are done when they are soft enough to be broken by the weight of the spatula. The tortilla will come out moist and tender if the potatoes are just a bit mushy, but don't mash them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LizT"
},
"reviewBody": "Excellent recipe. It came out perfect the first time. I used two pans to cook the ingredients to speed up the process. After I put it together and cooked it on one side, my pan was so full I couldn't fit it in the pan the other direction without breaking it apart. I ended up putting it in the oven on 350 for another 10 minutes and it set beautifully and looked great turned out onto a plate."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shep"
},
"reviewBody": "I lived in northern Spain (Galicia)and we used green peppers,(just cut up into small pieces, not roasted) onions, potatoes and eggs. It's actually easy to add all ingredients at once (less time consuming), but you need to use about a cup of oil. The ingredients don't need to be covered in the oil, just keep turning until they are all soft. Then drain them before adding them to the egg mixture. Let that mixture sit for about 10 minutes before placing in pan. Now you only need to add enough oil to coat the pan. don't forget to add oil again when you flip it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "citrus587"
},
"reviewBody": "I just got back from Spain and miss tortilla espanola!! I endeavored to try this recipe and it was delicious!! Definitely try it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kitkat Baldwin"
},
"reviewBody": "I made this for a spring brunch and I loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizardbits"
},
"reviewBody": "Very delicious. I also did not use as much olive oil. And I baked mine in a cake pan at 375 for around 40 minutes covered. I will definitely make this again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charly10"
},
"reviewBody": "Really yummy! I didn't think I could successfully flip it, but the 10 minute estimate was right on, the bottom was set and browned, so it easily stayed together. Great recipe, will be making again and again! Perfect for when large bags of potatoes are on sale for cheap!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ale"
},
"reviewBody": "Even with less eggs, it turned out great! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mollykathrynlewis"
},
"reviewBody": "Incrediblely tasty! Jut like the ones my senora made for me during my study abroad time in Spain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cameron"
},
"reviewBody": "My mixture required much more egg (80% more) to be as eggy as I remember it from Spain. I found most of the cooking directions under-heated on my standard GE electric stove. Use a non-stick pan for the flipping. I subbed bacon for the serrano."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Kelley"
},
"reviewBody": "Fabulous! Tastes just like I remember in Sanlucar de Barrameda. I definitely recommend broiling it as opposed to trying to flip it (especially with all that oil in the pan -- agreed, use a bit less oil, maybe only 1/3 cup). Broil for 10 minutes with the door closed (check earlier if your oven runs hot). Perfection! Omitting the ham and pepper did no harm (I remembered it completely plain, and that was how I wanted it!). Thanks for a great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dimitra"
},
"reviewBody": "Very tasty, but too much oil. My recommendation is to deep fry the potatoes in 3/4 cups olive oil (saving the olive oil for later french fry/potato frying purposes) and using the 2 tablespoons oil used for frying the onions as the olive oil reserved for finishing the tortilla. This is especially true if you plan on using a non-stick pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JP."
},
"reviewBody": "This is delicious as written. My only advice is to begin well ahead of time (1.5 to 2 hrs) as it takes awhile to cook the ingredients, let cool, and then assemble and cook the dish. It's not hard, but allow enough time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I ate this many times each week when I lived in Spain, and am so happy to have a reliable recipe to make it back in Seattle. Mix and match the \"extra\" ingredients to suit your tastes - I have never made this with any type of meat or cheese. I usually do as the Spanish do, and just stick with egg, potato and onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alimento"
},
"reviewBody": "Very good indeed. I have eaten this prepared by a Spanish connoisseur and this is the closest I have gotten to hers. I had to use canned potatoes but its quicker and I used cut ham and fried it a little with the onion if you want to use things you already have on hand like I did. Serrano ham is great but expensive and hard to find in Australia. When prepared in the oven (as I have made it before) it can come out a little dry but flipped it works out moist and savory just make sure you have a big enough plate first! Thanks for this authentic recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jen"
},
"reviewBody": "Always a favorite..breakfast, lunch, dinner..or with cocktails..it always works. One of my favorite dishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MEGMCD"
},
"reviewBody": "Great, easy recipe that always turns out well. Highly recommended!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "usshathaway"
},
"reviewBody": "This was a great, cheap dish that was really rather filling! A fantastic choice for brunch or maybe an early lunch with a light salad!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MRS_BOOKIES"
},
"reviewBody": "This was fabulous! I lived in spain for 1 1/2 years and ate these a lot. The onions and pepper add a lot of flavor as I don';t care for plain eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Don"
},
"reviewBody": "I make this but leave it in the skillet after cooking the first side and then broil the other side about 6 inches away from the broiler. It is much easier to handle this way and looks real good in a cast iron skillet.\n\nDELICIOUS!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/147109/tortilla-espanola-spanish-tortilla/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
"name": "Appetizers and Snacks"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17807/appetizers-and-snacks/tapas/",
"name": "Tapas"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/147109/tortilla-espanola-spanish-tortilla/",
"name": "Tortilla Española (Spanish Tortilla)"
}
}
]
}
}
, "about": [
]
}
]