				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Traditional Gyro Meat"
,"datePublished": "2019-04-02T02:50:57.000-04:00"
,"dateModified": "2023-01-26T12:48:23.000-05:00"
,"author": [
{"@type": "Person"
,"name": "The Dread Pirate Paramour"
,"url": "https://www.allrecipes.com/cook/3017629"
}
]
,"description": "This Greek/Lebanese-style gyro meat is delicious sliced and served with fresh pita bread, tzatziki, and tomatoes for a Mediterranean meal."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lVe6ipImFBNCdw6RcOsXKfbYZn4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4468566-0f04397e7bc84cfb940f93ba91cc458b.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1954444782001",
"description": "This classic beef and lamb combo is served on pita with all the fixings.",
"duration": "PT4M38S",
"name": "Traditional Gyro Meat",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/c0675623-804e-4cb7-83b1-5b0e1b046312/337763a5-1f6d-4755-ac27-4c39a930108c/1280x720/match/image.jpg",
"uploadDate": "2021-07-06T02:20:38.663-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Traditional Gyro Meat"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "384"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "179 kcal"
,"carbohydrateContent": "2 g"
,"cholesterolContent": "59 mg"
,"fiberContent": "1 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "97 mg"
,"sugarContent": "1 g"
,"fatContent": "12 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"0.5 onion, cut into chunks",
"1 pound ground lamb",
"1 pound ground beef",
"1 tablespoon minced garlic",
"1 teaspoon dried oregano",
"1 teaspoon ground cumin",
"1 teaspoon dried marjoram",
"1 teaspoon ground dried rosemary",
"1 teaspoon ground dried thyme",
"1 teaspoon ground black pepper",
"0.25 teaspoon sea salt" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Pulse onion in a food processor until finely chopped. Scoop onions onto the center of a towel, gather up the towel ends, and squeeze to remove liquid."
} ,{
"@type": "HowToStep"
,"text": "Combine onions, lamb, beef, garlic, oregano, cumin, marjoram, rosemary, thyme, pepper, and salt in a large bowl. Mix with your hands until well combined. Cover and refrigerate 1 to 2 hours to allow the flavors to blend."
} ,{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place the meat mixture into a food processor and pulse until finely chopped and the texture feels tacky, about 1 minute. Transfer to a 7x4-inch loaf pan, and pack down to make sure there are no air pockets."
} ,{
"@type": "HowToStep"
,"text": "Line a large roasting pan with a damp kitchen towel. Place the loaf pan in the center of the towel-lined roasting pan, and transfer it into the preheated oven. Carefully pour boiling water into the roasting pan until it comes halfway up the sides of the loaf pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until gyro meat is no longer pink in the center, about 45 minutes to 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/lVe6ipImFBNCdw6RcOsXKfbYZn4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4468566-0f04397e7bc84cfb940f93ba91cc458b.jpg"
}
]
,"text": "Pour off any accumulated fat, and allow to cool slightly before slicing thinly and serving."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "works2late"
},
"reviewBody": "Love the recipe. The only thing it misses is the rotisserie browning. Given the effort in making homemade Gyro meat, I'd recommend getting quality Pita bread. I like the techniques - removing the onion juice, and using a water bath, though I'm not sure what effect that has, other than even heat distribution and moisture (that sounds really dumb that I actually typed that). But, the result is firm meat, not overly moist or fatty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It's a great recipe, but a little light on the salt. It was a little bland the first time I made it. I used two teaspoons of Kosher salt the next time and it was so much better. I also added garlic and onion powder. I wrapped a brick in aluminum foil and put it in the oven while preheating, and place it on top of the mixture while cooking. It removed all the air pockets and made it very compressed and super easy to slice. I also placed the slices on a griddle for a few minutes to get a little char, which really makes a difference. With the price of things in restaurants, it's definitely a money saver if you love gyros!..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I’m a chef for over 30 years. A couple of other chef friends and I kitchen-test recipes. We selected this recipe for its simplicity to perform, availability of ingredients, and of accuracy of recipe to restaurant prepared dish. We gave this recipe 👍🏻 with a few tips: increase both salt &amp; pepper to 1 1/2 tsp. If you like garlic, use 3 tbsp. The 50/50 lamb/beef is best ratio. Biggest tip…grind all spices well and mix with meat the night before. It takes that long for spices to imbed their flavor. In restaurants, meats are prepped the day before."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It doesn’t taste much at all like gyro meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DaMárie"
},
"reviewBody": "This was my first time making gyros and it was fun. Turned out great and was a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Terry"
},
"reviewBody": "Love this recipe, I doubled the salt (Or a bit more than double) Process the meat until it is a gooey slurry (really helps the texture) and baked on parchment or non stick foil as small loafs about 2 inches thick max. Better than my local greek restaurant!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is just about perfect, and very satisfying. I do not have a food processor, so I mixed the meat + ingredients with a potato masher and it worked well. The meatloaf needed over an hour at 325 F degrees in my convection oven, and recipe can easily double the salt (increase to 1/2 tsp of salt) without peril. Recommend resting the loaf for 15 minutes before slicing. Then, suggest hitting the slices on a med-hot griddle/frying pan for 30 sec to a minute per side - it browns up just like at restaurants and food trucks. Have seen and eaten identical texture at gyro places in NY, so I'm happy with a slightly grainier texture. Definitely better and richer tasting the second day. Best served with pita, tomatoes, onion, and tzatziki - I eliminated the pita as I'm gluten allergic - also, great for breakfast!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dannyderaney"
},
"reviewBody": "Really liked this rub a lot. Instead of lamb (since we don't eat baby animals) we went strictly beef and it reminded me a lot of my mom's kufta. It sliced perfectly and will definitely add it to my spice rubs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fuzzcom"
},
"reviewBody": "I'm handicap so I'd buy pre-cut onions, in 1 cup tubs. I can't eat raw veggies, so I opted to use the whole cup rather than a 1/2 onion, so it'd all be cooked.. (Plus, I felt, 1/2 onion, not a proper measure, onion size??) Used 3/4 tsp pepper, pepper gets hot when cooking.. I'm glad I cut it down. Came out Perfect.! Will be perfect for my Greek Omelettes.. 😁"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "andrewmoore711"
},
"reviewBody": "I think this recipe is excellent and very flavorful. I doubled the spices to (2) teaspoons. I've been having gyros for lunch for the past two weeks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Eleanor Stegmeir"
},
"reviewBody": "I cooked it exactly as instructed, but even after an hour and a half the load was still completely raw below the waterline. It would have been better cooked like a normal meatloaf."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ferradinoanthony44"
},
"reviewBody": "Followed the recipe to the letter and it came out perfect. So good we may use it at work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "butlerdeals"
},
"reviewBody": "I love this recipe cuz I love Gyros &amp; Homemade. \nMade this recipe about 4 times, in either 6 or even 12 pound batches. Make a vacuum freeze! First time didn’t have all the ground spices, still good. Yes it needs way more salt, figure out your preference and still good. Two hacks. Save the juices that cook off for a beef/lamb great stock. And strain off that fat, save then slice loaf and fry in it for that irresistible straight from the broiler crispness. Homemade authentic gyros, life is great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": " Recipes Worth Keeping"
},
"reviewBody": "Just waiting have 45 minutes and the cooling time before slicing up a sandwich yum was easy to assemble"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Juliette"
},
"reviewBody": "Eh…. Kinda just tasted like meatloaf to me. Every one ate it. 100% edible but , We all agreed, it didn’t quite have the same spice/flavor of street gyros. I served it in chef John’s pitas which a lot easier than expected, but I could have put plain old meatloaf in there and not known or tasted a difference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marvels51"
},
"reviewBody": "I used only 1 pound of ground lamb and a 1/4 cup onion, but the full amount of spices. This was delicious, sliced thin, served with tzatziki sauce and chopped tomatoes, on a toasted hamburger bun."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Struggle Foodie"
},
"reviewBody": "Very solid base recipe. In addition to those who have mentioned adding salt/garlic to get that real \"hole-in-the-wall\" type flavor, try taking slices and sautéing in olive oil to get just a little bit of browning on the meat before piling high on your pita. Makes a huge difference!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "The Real Becky"
},
"reviewBody": "The recipe was easy to make but personally I think it lacked seasoning. Maybe adding extra would help. Also the texture isnt quite right. Overall it was pretty good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Nobody"
},
"reviewBody": "There is definitely something missing. I wish I knew what.\n\nIs it not enough spices or is there some spice that is missing?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Swim500"
},
"reviewBody": "I added a little extra salt. And I've used both turkey and pork in place of the lamb, and thought both worked well. Great recipe. Taste just like my local greek restaurant's gyro meat! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeremiah Valdez"
},
"reviewBody": "Recipe was killer! Added a little more salt and garlic though, and after slicing I seared it in a frying pan to give it a little bark."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LD Masson"
},
"reviewBody": "I had a craving for gyros, but could not find the meat at our local groceries. I turned to the internet for a recipe and, after many variations, settled on trying this version. And I am so glad I did! \nI read many of the reviews and adjusted my recipe based on the feedback - 2 tablespoons garlic, close to 2-1/2 tablespoons salt, and heaping teaspoons of all the others (with the exception of marjoram, which I did not have. I just added extra oregano.) I did not squeeze the juice out the processed onions and I added all the spices to the onions in the food processor for a good mix before working it into the meat. I used a more standard size bread loaf pan (9x6) and it took about 1-1/2 hours to cook. I did not find the recipe difficult or time consuming as some others have mentioned. I would simply suggest planning ahead if you want this for dinner - it does take awhile to sit in the refrigerator after mixing. Served on warm pita with tzatziki sauce, feta cheese, tomatoes, olives, and red onions. Plenty leftover to eat the next day, with some to freeze."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "George"
},
"reviewBody": "Instead of making the loaf, I just browned the beef and lamb in a large skillet with the onion finely chopped. Added all the rest of the ingredients with the onions about half way through the browning process. Served it taco style with tortillas, tzatziki sauce, chopped Romain, and Feta cheese. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tcurti"
},
"reviewBody": "I’ve made this a few times and it’s simply delicious. The whole family loves it and it makes wonderful leftovers. \nOne thing I do differently is cut thin slices and then before serving, give the slices a quick sear I’m a cast iron skillet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Casper"
},
"reviewBody": "I have made this recipe a few times and it is wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robin MacLeod Crowder"
},
"reviewBody": "Delicious with chicken breast. Cooked in microwave to return condensation created moisture back onto chicken\nAlso added 1tbsp ex.virg.oliveoil"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "angela"
},
"reviewBody": "I followed the recipe exactly and I was very disappointed in the result. The meat was dry and crumbly. I tried pan frying it in the fat drippings after slicing, but it didn’t help. The flavors were good, but I won’t make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LikesToEatWell"
},
"reviewBody": "Worked very well for us, made it today and will make it again shortly. [As with any recipe, we take a recipe's spice quantities as a starting point, and subsequently adjusted it to the way I thought we'd like it - worked well for us by roughly doubling the recipe's suggested amounts (put salt up to almost a full tsp). Used a 9x9\" pan because we prefer the meat mixture to be thinner, akin to what we feel we get when ordering Gyros. Used 50/50 sirloin / trimmed pork butt - ground the meats ourselves. After mixing in the spices, we immediately used the food processor - we broke the mixture into thirds and pulsed each for about 30 secs or so. Only needed to bake our thinner loaf for 40-45 min. Let the mixture cool, pored off juices to cool &amp; defatted them. Prior to serving, we sliced some of the loaf thinly, and cooked each side over medium heat with a bit of olive oil for about 2 minutes a side / until browned. Great recipe, thanks for posting it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Drew Butler"
},
"reviewBody": "I LOVE this recipe. Today is my 3rd or 4th batch. The first time I didn’t have all the spices like marjoram or ground rosemary but it was so delicious. Today I’m making 12 lbs. Ground a 6lbs boneless leg of lamb and even followed the directions! First time I’ve rested in the fridge and put mixture in food processor. These make the best gyros in or out of the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bonita Daniel"
},
"reviewBody": "Used impossible meat. Was great!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elizabeth"
},
"reviewBody": "Absolutely delicious ! I put a parchment paper in the loaf pan and let it sit in the fridge the day before baking to let the flavors blend then baked as directed and cooled before slicing and then frying in olive oil. The parchment can be folded over the top to help press the meat down completely.Loved this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "recording_fil"
},
"reviewBody": "Followed the recipe to a T and tasted like hamburger in my gyro. Bland bland bland! Not too bad to eat, but nothing I would ever consider making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've made this several times and we love it. I can never find ground lamb in my area so I use all beef.\nOther than that (and eyeballing rather than measuring) I follow the recipe which is rare for me. A keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Brandin"
},
"reviewBody": "Bland! Tastes like boiled meat with the faintest floral hint of spices. Needs significantly more salt. I know some people can be sensitive to garlic, but no one can be this sensitive to garlic. From what I've experienced, it doesn't need the water and roasting pan method. I'll try it again, but I'm definitely adding about 2 to 3 times the amount of garlic and maybe doubling up on all the other spices and possibly adding onion powder, white pepper, and a few other spices. Even if you do like the recipe as is, I would definitely recommend pan frying the slices of meat in some oil or butter to add a little bit of char and flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tstubbs"
},
"reviewBody": "I tripled the spice amounts. And after it cooked and cooled I cut it into thin slices and layered them between wax paper and froze them. Easy to pull out a single serving. Threw the frozen slices into a hot pan and by the time the defrosted and got hot they was also a beautiful moderate char. Made weeknight meals super easy especially cooking for one or two."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toni"
},
"reviewBody": "I really like this recipe! It's nice to be able to make something that's more traditional instead of ordering take out \nWhen I make this I put it on a cookie sheet so it's nice and thin and gets a bit more of a crust on it. SO YUMMY!!! my whole family loves it and loves the homemade cucumber sauce I make to go with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Bauer"
},
"reviewBody": "Per other reviews, I increased the garlic and salt. Tastes wonderful! I also pan fried slices before serving. Texture was spot on, I wrapped and weighted down the loaf overnight in the fridge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JRBIV"
},
"reviewBody": "Used Beyond meat. Came out excellent. Could use a little more salt and garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Royce Sweeney"
},
"reviewBody": "This recipe is fantastic! I did change the salt amount to 1 teaspoon and added a couple extra garlic cloves after reading the reviews and it turned out absolutely delicious. Unlike a lot of people who left reviews, I went out and bought majorem because I did not have any either (LOL) so I could follow the recipe exactly where the spices were concerned and the flavor was off the charts"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "brannan007"
},
"reviewBody": "I had a wonderful outcome making this dish even though I doubled the recipe. However, after the meat had cooled I cut a couple of slices and then pan fried them in a little oil so that the meat had a bit of a char. By going the extra mile it tasted even more like the Gyro meat that is sliced off the spit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kadactyl"
},
"reviewBody": "This was awesome! Everyone really enjoyed it. I don't have a food processor and I nearly broke my blender trying to turn the meat to paste. In the end I just chopped the heck out of the meat with a cleaver and the texture was nice. I'm excited to try this again and to tweak the spices."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jackinthewoods"
},
"reviewBody": "This recipe disappointed, was not as moist and flavorful as I had hoped. I did not have a roaster so used a dutch oven with a ceramic loaf pan and water inside. Otherwise I followed the recipe pretty much as written. Did not overcook - checked with a digital thermometer. I found it hard to do the food processor steps with a consumer grade Cuisinart food processor. The suggestions to up the garlic and grill the slices might have helped."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Love to cook"
},
"reviewBody": "Not sure what went wrong, but it was the driest meat I’ve ever cooked in my life. And there was not much flavor either."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Linda Kwicinski"
},
"reviewBody": "just added 1t salt like the other reviews said.... perfect ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raquel"
},
"reviewBody": "Delicious and healthy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Stephens"
},
"reviewBody": "Love gyros! Lived in Germany and our village had a great Turkish vendor who made the best gyros. This recipe was very reminiscent, however, had to add a little more salt/garlic to the seasoning to make it more flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chrissy Buckwalter"
},
"reviewBody": "Good but a little salty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "danibreitenwischer"
},
"reviewBody": "Great recipe! It is not exactly like eating at a Greek restaurant, but definitely comes close and is way better than \"gyros\" at a festival or event. I followed the recipe as stated except for marjoram, because I did not have it. Do not skip putting the meat in the food processor, it makes a difference. Served the meat with homade Naan and tzatziki also found on this site. Everyone was happy happy happy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Petunia"
},
"reviewBody": "I loves me some gyros, and while this won't replace the genuine article I have to admit this meatloaf definitely scratched an itch. Might have gone heavier on some of the herbs. Did NOT use a food processor, just worked it a bit longer. Sprinkled bread crumbs on top and sides prior to baking. Served with Cous Cous, Greek Green Beans (also from Allrecipes), pita bread, and fresh made Tzatziki Sauce. Drop the mic - dinner is served!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "juraspark"
},
"reviewBody": "Made this with the beef/pork combo.\nIt did turn out very well, but is a bit dry.\nI did 'brick' it overnight in the loaf pan after cooking and think it is worth the effort. You can buy a brick at home depot for under 50 cents if you need to. I recommend washin it prior to use as I did find some cold fat under the foil when I removed it and was happy I had washed the brick first.\nI used the tzatziki recipe from here as well.\nIt does need the extra salt added.\nI found it easier to slice it thin by turning it on it's side while cold and using a sharp carving knife to cut the slices.\nIt made quite a few slices and will make a several sandwiches.\nMy husband was rolling his eyes when I was prepping it as he thought I was wasting my time and his money.\nHe said it was 'okay'. He has taken it 2 days in a row for lunch and had it for dinner twice, the second night was he's suggestion! I guess he really does think it's 'okay'!!!\nI have tried it fried in different ways from butter to coconut oil, olive oil and kraft zesty italian salad dressing. I can't say which is a favourite as they were all good. We did prefer Naan over pita or tortilla for the wrap.\nI may try lamb next time as I checked the grocery store and they carry ground lamb, but I've never cooked with lamb before.\nTry it, I think you will like it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lori Fry"
},
"reviewBody": "Just as I expected and great with cucumber sauce. I will add more salt the next time I make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "damtrucker"
},
"reviewBody": "I've made this a couple of times, very tasty. This time I processed the meat with a paddle in the mixer and then ground it in the food processor, vacuum sealed the loaf and I will sous vide it after an overnight in fridge then torch it brown. I hope it cooks up a bit more dense this way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Susan Elliott"
},
"reviewBody": "Definitely needs more salt. I am disappointed that I did not read more reviews. Many people said so. I too found this a little bland. Smells incredible when cooking so I had high expectations. This is not as good as cafe NEO gyros. However i can not figure out what spice it is missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bryant Kelley"
},
"reviewBody": "I've used lamb and beef and then even just beef, couldn't tell much difference after all the spices are added. Anyway great recipe and easy to follow instructions! Will make again and again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NoProcess"
},
"reviewBody": "I liked it very much, but couldn't find my processors metal blade so I used the dough blade, and my onions weren't finally chopped enough and texture was all wrong. I think This would certainly be a 5 star if i used proper blade. Will make again with proper blade in future."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tommy"
},
"reviewBody": "Made it and followed recipe precisely. Very bland and disappointing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sessie Schomas-Carlson"
},
"reviewBody": "I minced fresh herbs from my garden and tripled the amount called for in exchange for the dried. The recipe took a bit longer to execute than I would normally plan for, but the work &amp; the wait was definitely worth the results! Delicious and more healthy than going out for gyros! Even works great as a Gyro Salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Niko Papadopoulos"
},
"reviewBody": "This is a delicious recipe.........for doner. This is not a traditional \"Greek\" gyro recipe, it is a Lebanese/Middle Eastern recipe for ground meat served in slices like a meatloaf, called doner. You can't call this gyro.\n\nSo if you like ground meat the way they do in the Middle East, then yes, use ground lamb and/or beef with these spices to make what is called a doner.\n\nIf you like the classic gyro you got to enjoy in Greece which is slabs of pork and/or lamb, then use a REAL gyro recipe, a Greek recipe.. \n\nSadly, not many in North America know the history of food when it comes to the difference between gyro and doner. The term \"gyro\" has been watered down to mean any type of Greek sandwich with meat. Nothing could be further from the truth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "excellent period"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cdp1122"
},
"reviewBody": "Recipe is good, we ate it 2 nights in a row and my husband never eats leftovers. I did set a loaf pan on top of the pan the meat was baking in with 2 bricks in it to help compress the meat some and it really helped keep it dense."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen B."
},
"reviewBody": "Great gyro meat. I made this ahead of time, sliced it, and froze the slices for an easy weeknight meal. I just reheated the slices in the microwave.\n\nThe only change I made was to use ground pork instead of the lamb since I could not find any locally."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Blue Buddha"
},
"reviewBody": "Mixing the the meat in a food processor seemed to make it a bit tough and chewy. Otherwise the flavors were good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "BusyMum"
},
"reviewBody": "Needs tweaking, but alright for a first go."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie DeSoto"
},
"reviewBody": "Make this ASAP! Only thing I do different is let the loaf cool, then slice and bake a tiny bit so every bite has a slight crunch (I suggest parchment for this). You do not need to take the extra step, I just like it that way, just like I twice cook my taco meat:) make this recipe and enjoy every wonderful bite!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allendbcc"
},
"reviewBody": "Great original taste! Meat texture was not the same, next time I make this I will slice the loaf and then put the m under the broiler to brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SilverFox"
},
"reviewBody": "Very good, tastes almost as I remember it should. Only 4 stars as I found it a hair bland for my tastes.......could be my spices were a bit stale. Will try again with fresh spices and re-rate"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alan_marks59"
},
"reviewBody": "Only one thing to say... yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "John P"
},
"reviewBody": "I made this recipe exactly as stated. Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cynthia Jenson"
},
"reviewBody": "I made it exactly per the recipe. Very good flavor... just like the flavor of the restaurant gyro meat but mine was VERY dry. I did use very lean grass-fed ground lamb and beef so I added some olive oil to the meat mixture so it wouldn't be dry. Maybe I should have added more. With the onions, tomatoes, lettuce, and tzatziki sauce it wasn't too bad. Very excellent flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Carl"
},
"reviewBody": "Bland to my tastes, and I Followed the recipe to the letter. (Odd for me). I think adding fresh ground coriander, doubling the garlic and rosemary will fix it. Deli Gyro is much richer and more savory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Eng"
},
"reviewBody": "Love love love this recipe!! Saves us $$ when we want to just make gyros at home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tara Reynolds Tourangeau"
},
"reviewBody": "I am so surprised how well this turned out and how close it is to restaurant-style. I used 4 cloves of garlic (4 tsps of minced garlic in the jar) and 2 tsps of all other spices. I followed the rest of the recipe exactly and used Alton Brown's tzatziki recipe. It is delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kimm"
},
"reviewBody": "Almost 5 stars! Based on reviewer suggestions, I doubled the seasoning and added extra salt. Used a brick during cooking to make sure meat remained compact. Not sure if it made a difference, but it didn't hurt. Perfect texture and got rave reviews on it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diedra Berryhill"
},
"reviewBody": "I originally found a recipe for Gyros on Pinterest bc I’m on a limited income and wanted to make them at home. I thought I’d check Allrecipes.. and glad I did! It had some of the same ingredients but this recipe added a lot more spices to the meat. It turned out AMAZING. I did add more salt, pepper, and garlic powder. I did not purée onions bc I’m lazy lol and I did not purée the meat in a food processor bc I don’t have one. I added dried minced onion and onion powder instead. It just came out of the oven and I can’t wait to make gyros! I’m on a limited income and wanted to try to make them myself. 5 stars! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess Crawford "
},
"reviewBody": "Absolutely delicious! I doubled all the spices except for oregano, cumin, and salt - for those I used four times the recommended amount or more! I let it marinate in the fridge for about 90 minutes and had to put it through the food processor in batches because I have a smaller, less powerful machine. Baked in two loaf pans in the manner described. After baking I sliced and seared in olive oil until crisp. Wonderful in gyros, in salads, or plain! Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "callalillie"
},
"reviewBody": "I made this recipe exactly as written, with one exception, I made a half batch. With all the positive reviews, I had a high expectations. Unfortunately, not a fan of this recipe at all, the flavor Was blah and the texture was like meatloaf, And yes I processed it in the food processor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "William Hamilton"
},
"reviewBody": "Followed the recipe exactly and the meat was very bland. I had to slice and pan fry in olive oil to brown a bit to get the texture I'm expecting. I eat at Coney/ Greek restruants at least twice a week....this taste nothing like the gyro meat I get there. It wasn't horrible, just tasteless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrolivi"
},
"reviewBody": "I made it as the recipe stated and it was pretty good. These adjustments I made afterward to suit our tastes: 1. After slicing meat -brown the slices in a pan with some oil. 2. The spices were too lite for our tastes. Next time 1/2 tsp for salt, pepper, and cumin and increase all the other spices to 1 TB."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Mary Ann Younk"
},
"reviewBody": "Very, very strong tasting! More so than gyro meat at a Greek restaurant. The texture of the meat is different too. I live in an area with no Greek restaurants. I will have to wait to visit a big city to enjoy gyros the way I love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sumo32"
},
"reviewBody": "If you make this recipe, make the Chef John’s tzatziki sauce to go with. Perfection!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Amber McNeece Yates"
},
"reviewBody": "This recipe is really good. I will definitely be making again. I agree with other reviewers about the salt. It definitely needs more! Hence the 4 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Hunter Jacky Davis"
},
"reviewBody": "Wow, this was great! It tasted just like gyro meat from our the greek restaurant we ate at when I was a kid. Delicious! Blending it up, like she says really gives it that gyro meat textures, unlike meatloaf. I made a couple changes which may or may not have improved the original recipe. \n1. I used 50/50 Lamb and Turkey\n2. I added an egg to the meat mixture, as a binder\n3. I sprinkled a Tablespoon of cornstarch into the meat mixture as a binder.\n4. I added a lot more salt as reviews had mentioned, probably 2 teaspoons, maybe more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "markyo"
},
"reviewBody": "This came out great. I followed the recipe and the only changes I made we're to the amount of salt and garlic. I tripled the amount of garlic and used 4 teaspoons of kosher salt. I used 1 lb of 90 / 10 ground sirloin and one pound of lamb meat.\nI also let the meat mixture sit in the fridge for 4 hours to let the seasonings meld. Instead of using a food processor, I used the tenderizing side of a meat mallet and pound it out the meat mixture for a couple minutes on one side then scooped it up, flips it over and pounded it out for a couple more minutes on the other side. I then put it into the loaf pan and cooked it as directed to 165 degrees Fahrenheit internal temperature. I saved the loaf pan juices and put it to the side. I then let the meat rest for 10 minutes before cutting it. I then sliced the meat about a quarter inch thin and pan-fried it in just a little bit of olive oil to slightly crisp up the edges. I then served it up on a lightly pan fried pita bread with homemade tzatziki sauce, tomato and onion. \nIt turned out to be very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sonya Taft"
},
"reviewBody": "seems over-herbed when you eat it by itself, but once on flatbread with tzaziki, excellent! i did use a suggestion from a diff recipe to slice some off after cooked and cook a few minutes more at high heat to crisp up the edges, and that made it even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelley McLeod"
},
"reviewBody": "My first time making gyro meat. I didn't have a deep roasting pan to do a water bath so I flattened the meat out onto a cookie sheet and baked it that way. It still turned out moist and very flavorful. Thank you for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Port Gal *63*"
},
"reviewBody": "Many reviewers mentioned that they doubled the spices and still didn't care for the gyro. I think the taste and texture of this recipe is based on the meat being put into a food processor to achieve the proper \"look!\".. I like to put small amount of cold meat at a time (about a tennis ball size) into the processor and make it into a PASTE, then follow the cooking directions. Let meat cool and refrigerate several hours. Slice into strips, using a thin knife blade.. That is the secret. The raw meat looks awful but, tastes delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chris Gamelcy Rodriguez"
},
"reviewBody": "We loved it, but made into patties and grilled them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kiki"
},
"reviewBody": "Very authentic Greek! Had to add a little salt however. And the tip to press out the extra cucumber juice was good. I used reg cucs not ENGLISH that would have been less juicy. Family loved it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "JKL0716"
},
"reviewBody": "This is a 5-star recipe with the essential modifications noted by other reviewers: SALT. I used nearly 1 tsp based on reviews and found it still needed a very light sprinkling after slicing. Will mix more into the meat next time. Also, saving the drippings from the loaf pan and using them to fry the slices prior to serving is what made the final result a real success. The loaf comes out compact and dry (as expected) which makes for easy slicing but not a texture that is lovely on the palate. Browning slices in the drippings is the finishing touch. Save drippings in the fridge to brown the leftovers also. Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HomeChef"
},
"reviewBody": "This was very good... Let me tell you what I did to make it great. First, and this is just a small thing, I added about triple the seasonings in the recipe so it had alot of flavor. Second, and this was great but everyone might not have the ability do do this: I only cooked it as described in the oven for 20 minutes then took it out and put it on my skewers for my indoor rotisserie (showtime) and cooked it for another hour. It turned out great and looked just like the gyro meat on the stick at the local Greek deli. The reason I cooked for 20 minutes in the oven was the keep the ground meat together for the skewers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Falter"
},
"reviewBody": "I love this spice mix. I used all lamb, found a deal on it. I miss the gryos we use to get in Wisconsin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stefanie C Brought"
},
"reviewBody": "This was my first time making gyro meat and i'm so glad I used this recipe! The only changes I made were the garlic (used 4 grated cloves) , added like 1/4tsp ground allspice and 2tsp salt. The method worked perfectly, I let it sit in the fridge overnight to really let the flavors marry. \n\nI made wheat pita, baked some fries. used a greek dressing from the site and made a tzatziki sauce to go with my platter. Everything was delicious! It would be enough to feed 4 hungry people but any more, if they like meat, make another loaf! Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica"
},
"reviewBody": "Fried slices - loved it. Used half beef and half pork b/c local store did not have lamb. After baking, refrigerated overnight with weight to compress, but not sure it actually compressed. However, it may have contributed to ease in slicing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheena Rachelle"
},
"reviewBody": "This is, by far, my husbands favorite thing in the entire universe to eat. He would eat this every day if he could. After MONTHS of using this recipe and perfecting for my family's needs, I have only made two minor modifications. The first is to use a teaspoon of onion powder instead of actual onion. Makes it a bit thicker because of less liquid, I find it gives it a better texture, and my husband never gets indigestion like he does with fresh onion. Second, as with most the other reviewers, is to up the amount of salt- generously. I've found 1 teaspoon to be a decent amount, but I've gone up to 1.5 teaspoons before and had it turn out well. Otherwise it's a perfect recipe. Thank you for keeping my husband (and surprisingly, my kids!) happy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jonny Goouda"
},
"reviewBody": "I made this again just the other day. Good Grief, you'll never want a gyro at a restaurant again. It takes about an hour to prepare. Make sure you have a LOT of onion! The cucumber sauce is easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alan Oliver"
},
"reviewBody": "This is such an Awesome recipe, we enjoy this once a month, either as a sandwich, lettuce wrap, in a salad, even as a breakfast roll cant believe how good this IS with just about everything. We enjoy slicing, then reheating on a grated pan with its juices mixed with sage infused olive oil. I too also increased the salt to a tbsp and 2 tsp each of cumin and oregano. Let it meld together overnight then process in the morning, once cooked let cool cover with foil and do use the brick, finally slice reheat and enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ocfishguy"
},
"reviewBody": "Hello!!! I used this recipe a number of times. I recently made a change. I place a fire brick wraped in heavy duty tin foil that fits my loaf pan on the meat. It gives the baked meat a denser texture. Thanks for being out there!! Semper Fi! Godspeed!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian Martin"
},
"reviewBody": "We end up with several pounds of ground venison this time of year, and it works great in this recipe. I use an egg, but maybe two would be even better, otherwise the lean venison doesn't bind together very well and it falls apart when you cut it. I've also used bison in this recipe and it's really good, too. The trick is definitely in the slamming the meat on the counter or in a large bowl. I use this recipe 3-4 times a year and my family loves it. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rachel Traff"
},
"reviewBody": "This was fantastic! I must say the meat turned out a little dry, but I think that was cooking error on my part. Combine this with homemade pitas, and everything else, it makes for a lovely meal."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/173420/traditional-gyro-meat/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/256/main-dish/meatloaf/",
"name": "Meatloaf Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/173420/traditional-gyro-meat/",
"name": "Traditional Gyro Meat"
}
}
]
}
}
, "about": [
]
}
]