				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Traditional Popovers"
,"datePublished": "2019-08-29T23:32:34.000-04:00"
,"dateModified": "2022-04-26T15:56:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "J Miller"
,"url": "https://www.allrecipes.com/cook/256354"
}
]
,"description": "This recipe is for traditional popovers. They can be served plain, but my family prefers them with raspberry butter."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/eS_vrloyefkY-ITDBsSBqFhkCGs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/traditional-popovers-2000-f0ede7358b384a308ede993e9e941156.jpeg",
"height": 1000,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Traditional Popovers"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "268"
}
,"cookTime": "PT40M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "183 kcal"
,"carbohydrateContent": "18 g"
,"cholesterolContent": "112 mg"
,"fiberContent": "1 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "5 g"
,"sodiumContent": "150 mg"
,"sugarContent": "2 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"1 cup all-purpose flour",
"0.25 teaspoon salt",
"3 eggs",
"1 cup milk",
"1 tablespoon unsalted butter, melted",
"2 tablespoons unsalted butter, chilled" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 425 degrees F (220 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Spray a popover pan with nonstick cooking spray. Place pan on center rack of oven and preheat for 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Blend flour, salt, eggs, milk, and melted butter until it looks like heavy cream, about 1 to 2 minutes."
} ,{
"@type": "HowToStep"
,"text": "Cut chilled butter into 6 even pieces. Place 1 piece of butter in each cup and place pan back in oven until butter is bubbly (about 1 minute)."
} ,{
"@type": "HowToStep"
,"text": "Fill each cup half full with batter and bake 20 minutes. Reduce heat to 325 degrees F (165 degrees C) and bake for another 15 to 20 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "coffeeismughugs"
},
"reviewBody": "Loved it .. so simple … nope no changes although I like mine with homey and hubby likes his with jelly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brianna Rice"
},
"reviewBody": "I put some powdered sugar in the raspberry butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added 2tbls sugar to make them sweeter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lutzflcat"
},
"reviewBody": "4.4.22 Followed this recipe to the letter, and they baked up beautifully! The first bake at the high temperature was exactly 20 minutes, then at 325ºF, I took out of the oven at 14 minutes because they were getting very brown…cooked perfectly. Honestly, I’ve only had popovers a couple times in my life, and this is only the second time I’ve made them at home (first was blueberry popovers). These were so easy to make it’s hard to believe. Next time we have folks over for dinner, I’m definitely putting them on the menu. I know this recipe has been around for awhile, and popovers are not as popular as they used to be, but that doesn’t matter to me, because I plan to make them again, and again, and again…………"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NY2OH98"
},
"reviewBody": "Simple, easy popovers. Popovers did not need the full 15 mins at 325. My oven may be at running at a high temp."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aurorasews"
},
"reviewBody": "Perfect!!!! Make sure your pan is hot! Add the butter and put it back in the oven for 2 minutes. I transfered my mix to a 2 cup glass measuring cup so I could easily pour. Watch the final.cooking time, mine took 5 minutes less. Worked out perfectly!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra Joy"
},
"reviewBody": "Followed the recipe as stated. My popovers came out perfect and we’re delicious??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SRQSunshine"
},
"reviewBody": "Very easy and delicious. Definitely recommend making the honey cinnamon butter that's on this website to go with it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Erica Pappalardo"
},
"reviewBody": "20 minutes into baking, my popovers had just begun to “pop”! Directly after turning the heat down, they started to cave in! They still came out delicious but ended up being “pop inwards”. I don’t know what I did wrong!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "helenhb314"
},
"reviewBody": "These are great. I love the flavor. I typically have to add at least an extra half cup of milk to make the batter thin enough to get them to fully “pop” but I will continue to use this recipe for a long, long time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MountainLovinGal"
},
"reviewBody": "My favorite popover recipe of all time! Only 3 eggs. Gorgeous color and crisp tops, airy in the middle. As others have done, I used muffin tins, and decreased the 325 degree baking time to 10 minutes and they came out perfectly! Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Timothy"
},
"reviewBody": "Best popovers. A few hints as I have made this at least a dozen times. Depending on your oven, these popovers can get too brown if you follow suggested times. Try using half the butter and make up the difference with Crisco and you will have buttery taste without over browning"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Ziegler"
},
"reviewBody": "I used cooking spray and dusted the popover pan with a bit of flour. Only pre-heated the pan enough to melt the butter. I tried to add a few blueberries but they just floated to the top and got “spat out”, might try to chop them up a bit and mix them in next time? Contrary to what one negative review says, it DOES say to only fill the cups halfway. The recipe volume did exactly that in my Nordicware popover pan and there was no excessive popping over and burning, and no leftover batter. Turned out pleasantly eggy, much less gummy and with a more crispy satisfying exterior than other recipes I’ve tried."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike Schelp"
},
"reviewBody": "Alrighty, then! I followed the recipe exactly and they came out PERFECT! I don’t have a popover pan, so I used a Wilton mini loaf pan. The pan is aluminum and has only four sections, so I modified the cold butter from 1 to 1.5 table spoons in each section. I also poured the batter into the pan IMMEDIATELY and quickly put it back in the oven. Very good recipe! Now I need a popover pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sphogge"
},
"reviewBody": "This is a great recipe and I’ve made a couple times. But you cannot make it ahead and then put back in the fridge. I did this in Thanksgiving in order to save some time but the popovers were very dense. They were still good but not what you’d expect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chris"
},
"reviewBody": "Fantastic recipe. Just follow the directions to the T."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zell"
},
"reviewBody": "These came out AMAZINGLY well! I followed the recipe exactly the first time I made them and they actually popped just like they're supposed to. I used a muffin tin, and there was just enough batter for eight popovers. I will definitely make them again, most likely multiple times."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sharon Barley"
},
"reviewBody": "Came out PERFECT and tasted just right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "knashbb"
},
"reviewBody": "I followed the recipe exactly as I believe you should before making any changes.\nThe recipe is buttery, light and very flavorful.Even at high altitude, which I was worried about. However, I think next time I will add a tablespoon of sugar as I feel this will not only enhance the flavor, but the texture as well.\nI will try Yorkshire pudding next"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kevin Durette"
},
"reviewBody": "Easy to put together. Buttery deliciousness!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peggy McKay"
},
"reviewBody": "THE BEST .. have made many times and everyone loves them with just butter or alone and some squirted in whip cream for a nice treat!!! delish.. thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "McLevinn"
},
"reviewBody": "I’ve used this recipe quite a few times and love it! I will say, I don’t think warming up the tin or adding butter to the bottom is necessary. I use vegetable spray and that does the trick. I tried to swap regular flour for gluten free flour today and it is NOT the same. They turned out almost muffin like without the gluten. Still love this recipe though, just not for when I need to accommodate allergies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Nachman"
},
"reviewBody": "Spectacular! I doubled the recipe and used 12 popover tins. Have all ingredients (except melted butter) at room temperature. I let the batter sit for an hour or so before I baked them. I also used avocado oil in the pans instead of butter since it has a higher flash point and the oven temperature is so high. The exteriors were perfectly browned and these were at least 4” high!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barefoot"
},
"reviewBody": "Love it!! We have to make it gluten-free so used the 1-1 rice flour mix and had to bake in a regular muffin tin due to rice flour density. Turned out beautifly. Thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AprilMae"
},
"reviewBody": "These turned out perfectly! Light, crispy and airy! Like other commenters, I used a muffin tin. It made 12 and they turned out great. It reduces the cooking time to 15 minutes at 425 and 10 minutes at 325. I make these often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angiek"
},
"reviewBody": "Excellence recipe! These were so delicious and turned out perfectly. I don't have a popover pan so I used a muffin tin which worked great and the recipe was the perfect amount for 12. I used salted butter because that's what I had on hand. Next time I will decrease the salt in the recipe by a smidge when using salted butter. We have eaten these with roast beef and gravy (similar to Yorkshire Pudding) and also for dessert with whipped cream like a cream puff. Wow!! What a special treat!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cook"
},
"reviewBody": "Incredible the best receipe ever ..\nPerfect popovers and so beautiful \nThank you?? If I could give you 10 stars I would"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Don McCormick"
},
"reviewBody": "While they rose like a popover should, they were a little bland to me"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Bernard Iulo"
},
"reviewBody": "Mine did not \"Pop\" very much and were a bit too dense. I followed the directions exactly. They were a bit too dense. Perhaps I filled the cups a bit too much so I will try that adjustment for the next time. Any other thoughts would be appreciated. I will retry till I get it right."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KelseyS"
},
"reviewBody": "Wonderful! Best popover recipe I've tried to date. Bringing the ingredients to room temp (or even warmer) is an absolute MUST to get that nice rise. Also don't open the oven door. I pierced the bottom of each once they were out so they didn't get soggy on the inside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa"
},
"reviewBody": "Very good, HOWEVER DOES NOT NEED FULL COOKING TIME. Just the time on high and then a few minutes on the lower temperature. Also does not need the chunks of butter, just the melted. Nice easy recipe that tastes wonderful with soup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon76"
},
"reviewBody": "Perfect! First time I mad them &amp; I’m impressed. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "YMN"
},
"reviewBody": "I reduced the recipe to make 2 popovers. They came out perfect. I used salted butter and Italian dipping spices. They were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marylou12"
},
"reviewBody": "This is the BEST popover recipe that I've tried. I used popover tins and they raised about 3 INCHES above the top of the cups. I made sure the eggs were room temp and the milk was JUST PAST room temp. I put the flour in last to mix., making sure all lumps were out. The oven was 425 for 15 min. and 325 for 10 min. They came out light and airy. The recipe made 6 good sized muffins. Excellent with Roast Beef/gravy!\nThis is definitely my \"go to\" recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "turtledonkey"
},
"reviewBody": "I’ve made these pretty much exactly as written, minus the dedicated popover pan, about a dozen times. Easy, tasty, will definitely keep making them. Only issue is sometimes they get too dark, but could be my oven. Usually just cook for less time than indicated. Last night, I made a change to the process. Instead of starting high and dropping the temperature midway, I heated the oven to 400 and baked for 30 minutes straight. Worked beautifully! Did fall a little easier, but that didn’t matter to me. Have made these in 12 cup muffin tins and 6 cup, as well as a rectangular brownie pan—key is to fill the well halfway no matter the size."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell Froemming"
},
"reviewBody": "We make these quite frequently. Room temp eggs and milk and the popover pan works great every time. I dont use butter in the pan, but rather spray the cups with pam spray and it works great. I forgot the pam once and they turned out weird on the bottom, but the tops were still perfectly good. Great breakfast treat wit a little honey butter!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michbax"
},
"reviewBody": "They came out ok. Never made them before but was asked to make them for a dinner party. Everyone liked them and they came out as expected. Not my favorite thing, kind of blah in my opinion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenshalom"
},
"reviewBody": "Best recipe Ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mollie Karner"
},
"reviewBody": "Mine didn’t rise. :( I have the hardest time with making popovers. Sometimes they work sometimes they don’t. This was a different recipe but still didn’t rise and I followed the recipe to the tea. I even let the milk and eggs get to room temp before mixing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elliott"
},
"reviewBody": "Added a spoon full of sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bette Janicki"
},
"reviewBody": "Best recipe but you have to follow the directions exactly"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marcie Robinson"
},
"reviewBody": "Whoops! I forgot to add the melted butter to my mix and it turned out just fine! So, if you want to cut a few calories or some fat, it will work out. Another hint - make sure everything is warm before you start mixing the ingredients - even the eggs. You can warm them by placing the egg in the shell in a bowl of warm water for 15 minutes before cracking them. This will give you great pop to your popovers every time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "I made no changes to this and they came out Fantastic, I doubled the recipe and the ones in the popover pan rose higher than the ones in the muffin pan. Both were still very .thank you"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Keeliah"
},
"reviewBody": "i have made yet they look good what do you put in them to make them that color"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Vicki"
},
"reviewBody": "425 was way too hot to start with. When I do it again, I will start at 400. Also used muffin tin and the results were good. Room temperature ingredients and heated pan are key."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rhering"
},
"reviewBody": "Made these and they turned out great. I made the mistake of doubling the batter. That was enough to make almost 2 dozing in a regular muffin pan. The 2nd batch definitely rose higher since the pan was hotter than the 1st and the better was able to come closer to room temperature. Also, if you use a non-stick pan, there is no reason to use cooking spray as mine just got black when I preheated the pan. There was also enough butter remaining in the pan for the 2nd batch that I did not have to butter it again.\nI will try a chicken pot pie with this recipe as the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blondedragon"
},
"reviewBody": "I love love love these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Zimmerman"
},
"reviewBody": "Popovers are a special holiday treat for our family. I tried this recipe for Easter and found them to be especially delightful. I was in a rush and misread the recipe. I put a pad of butter into the bottom of each cup and then poured the batter over it. The result was popovers with a sweet buttery flavor and a hint of salt. I can't wait to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UniverseGeek1304"
},
"reviewBody": "This Is the BEST popover recipe EVER. My grandma made AMAZING popovers when my Dad was a kid and he says that these are better than hers. It has become an annual thing in my house for me to make popovers every Saturday morning. The are light, fluffy, and DELICIOUS! Also for the people who say that they do not have any flavor, popovers are not supposed to have flavor. That is why you put butter and jam in them. duh. And for the people that said that they leaked all over your oven, well, YOU ARE SUPPOSED TO USE A POPOVER PAN!!!!! THERE IS A DIFFERENCE BETWEEN A POPOVER PAN AND A CUPCAKE PAN!!!!! SO IF YOU DO NOT HAVE A POPOVER PAN, OH WELL GET ONE!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Lockwood"
},
"reviewBody": "Bake at 425 for 15; 375 for 10 -20; add 1.5 tsp fresh rosemary ; usually large muffin tin"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Doctor567"
},
"reviewBody": "This turned out fantastic. The only thing I changed was omitting the step of lowering the oven temp, and putting it back in the oven after the first 20 minutes. Not sure what that's about, but the popovers were perfectly browned and appropriately crispy on the outside after the 20 minutes at 425 degrees F."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "madean"
},
"reviewBody": "Lovely popover recipe! I used only 2 large eggs and added a tablespoon of oil . The batter rested several hours in the fridge before baking. Very important to really heat the muffin tins before adding the cold batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carrieN"
},
"reviewBody": "Makes 12 popovers"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stcl85"
},
"reviewBody": "Great recipe. It was my first time making them and they turned out good. I have nothing to reference them by since I've never had popovers before, but they tasted great. I used a muffin pan and reduced the time slightly like another reviewer said."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "After trying several different recipes, combinations, oven temps, THIS is the recipe that has been successful. FINALLY high rising, crisp and perfect popovers! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nicky"
},
"reviewBody": "great recipe! so easy and tasty. I made some lemon curd to drizzle over it. fabulous and fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "schakfu"
},
"reviewBody": "I followed this recipe twice and they were delicious. I whipped some butter with honey and cinnamon and spread over the popovers straight out of the oven. If they are warmed up they are still good but not quite as well as fresh out the oven."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara Asbury"
},
"reviewBody": "These were great! I used a muffin tin (it was the way my grandmother and mother made them) and they turned out beautiful. Thank you for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carl"
},
"reviewBody": "really good just made some and put some strawberries in the batter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maria holm"
},
"reviewBody": "Super good. Had fun making my first time. Great with honey butter. I almost ate the whole batch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Silvermist"
},
"reviewBody": "I loved these! I was a little nervous at first, since everyone says how hard popovers are to get them right, but these were so easy and delicious. My family loved them, especially with some butter and cinnamon &amp; sugar on top. I will be making these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Perfect recipe. I tried others but this is it for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RAINKING58"
},
"reviewBody": "Excellent. Crispy crust, light and flaky inside. I spice it up a little by adding a pinch of cayenne pepper to the batter and sprinkling of parmesan cheese on top. I've made it several times with success. Let your eggs and milk come to room temperature for a guaranteed rise."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liz"
},
"reviewBody": "These were great used a different recipe for years didn't always come out puffy so I tried this new recipe amazing... will never go back. Liz M."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sugarkissesmom"
},
"reviewBody": "Yummy with cinnamon honey butter so good!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beverlee Lindberg Mountain"
},
"reviewBody": "I am a retired person over the age of 60 and this is the first time I've dared to make popovers. This recipe was perfect and these popovers were easy to make and sooo delicious. Will definitely use my popover pan again and again to make these wonderful additions to any meal. One thing though, it made 12 instead of 6 so if I had filled my tins any more they would have spilled over and would have made quite a mess."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowpuppy"
},
"reviewBody": "Came out perfect! Lovely high pop! Right amount of crisp and flake. I have been baking popovers for many years. I have mostly used the recipe that came with the Chicago Popover Pan. It’s a hit or miss how well they pop. Best batch I ever made with that recipe was when I forget to set the timer and overcooked them! Thus, I searched for tips and recipes. This one is very similar to the Chicago Popover recipe except the ingredient amounts varied slightly and it calls for higher oven temps. I have to substitute the milk for soy milk and the butter for vegan butter due to my son’s dairy allergy. I knew to use room temperature eggs and soy milk. I have found slightly warmer than room temp even better. I followed one reviewer's advice to mix in the flour last. That seems to be a good trick. And did not open the over door. The popovers rose very high and tasted great. Just like the restaurant “Popovers” on Manhattan’s UWS. They used to have lines around the block but unfortunately they have closed after 30 years."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HILLY29"
},
"reviewBody": "What a great recipe find! I followed the recipe as directed and they came out great. I will definitely add this one to my recipe database. When I made them the second time I made some changes, I added two tablespoons of sugar and a little bit of vanilla and they were awesome! It added that extra that some said was missing. Keep in mind, popovers are bland, the taste reminds me of french toast batter. It really is all about personal preference. The addition of the vanilla and sugar to the recipe made them so tasty on their own. The original recipe is just as great and I highly recommend the cinnamon honey butter to complement as was suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SJK"
},
"reviewBody": "Great popover recipe. Fill cups half full and DO NOT OPEN THE OVEN while they cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MPR"
},
"reviewBody": "Excellent. Reminds me of popovers I used to have on vacation on the Cape. One suggestion; bring the eggs and milk to room temperature first, otherwise follow recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Soultrance"
},
"reviewBody": "Great recipe. I've made these numerous times now using my popover pan and they always turn out delicious. Light, airy, and crispy. Just don't overwork the batter, it can get chewy if you do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Thomasen"
},
"reviewBody": "Awesome - I hadn't had popovers since I was a kid. Didn't realize how much I'd missed them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scrumdiddly"
},
"reviewBody": "My family is gluten-free. I used a combination of GF all purpose flour and sweet rice flour (the sweet rice flour gives a lightness to the popover) and I used half and half instead of milk. They came out amazing. A little dense (maybe more like a Yorkshire pudding?), but we fought over the last one (I won)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul Thornton"
},
"reviewBody": "Great this is the 1st popover recipe that I have used and came out right the other ones failed taste is very good and it is very easy thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Holly Sweany"
},
"reviewBody": "Even I can make these! Turned out perfect. I was a bit panicked as usual when cooking, but they were great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheryl Stiles"
},
"reviewBody": "Yes!!!! This is my mother's recipe that she made when I was a child over 40 years ago. You must use whole milk and real butter. I have tried this recipe with 2% milk and margarine and they did not rise properly because these products do not have the proper fat levels. You must use whole milk and real butter and these popovers will be humongous. My sister and I have searched for years to find the popover recipe that my mother used when we were children and this is it. A very important part of this recipe is putting the butter in your cups in the oven before you put the batter in the cups to cook. I can bake these in glass custard cups on top of a cookie sheet. I grease my custard cups with Pam cooking spray. However I remember Mom using Crisco and hers rose even higher than mine. Mine were over 5\" high."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "COOK471"
},
"reviewBody": "Great popover recipe! I added 1/4 tsp. of baking powder as this helped them to rise more. I used my mixer to do the batter, filled the popover pans 1/2 full and they raised beautifully. I made a double batch and we ate them ALL. I served these with cinnamon whipped butter. To die for!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather M"
},
"reviewBody": "I changed the recipe to 4 servings (using 2 eggs) and used small muffin pans and reduced the cooking time(it made 12 muffins). I followed other recomendations to warm the milk and put the eggs in warm water first. They turned out so fluffy! Great with honey butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cary Morton"
},
"reviewBody": "Tastes delicious, had to edit the recipe though. I made mine in a cupcake tin and found I had to reduce the bake time to about 18 minutes total in order to not burn them. (they were quite brown already and my oven runs a little hot). They turned out a little more like bowls than muffin-shaped, but still tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leslie Barnaby"
},
"reviewBody": "Doubled recipe, made it in regular muffin tins, and recipe made 16 popovers. Second batch came out better because i did not open door. Just great with butter and fruit preserve. This is a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Love2cook32"
},
"reviewBody": "First time to ever make Popeyes and they turned out great. I made warm sautéed peaches in butter and sugar with a scoop of vanilla ice cream to go with his... I would like to add some garlic powder and cheddar cheese and make savory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "laurensomagical"
},
"reviewBody": "I used a cupcake pan. It came out like German pancakes. They're still good, but I will buy a popover pan and try again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wpicone"
},
"reviewBody": "Excellent! 5 stars. Only change I made (third time around) was to bake at 350 to get higher \"Puff\" and a bit more chrunch. Another thing to consider is to allow all ingredients to come to room temperature before baking and keep that pan hot! \nTom"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "drury"
},
"reviewBody": "This was so easy and good. I was a little short on milk and ended up using some of my vanilla creamer. What a pleasent surprise it added a hint of sweet! I also used a muffin tin and it turned out just fine. My kids can't wait for me to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was so easy and good. I was a little short on milk and ended up using some of my vanilla creamer. What a pleasent surprise it added a hint of sweet! I also used a muffin tin and it turned out just fine. My kids can't wait for me to make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barbara Smith Gatlin"
},
"reviewBody": "These came out great and were delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Traytee"
},
"reviewBody": "I followed the recipe exactly! Not only did they not \"popover\"..they didn't rise AT ALL."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenelle Gullicksrud Haugan"
},
"reviewBody": "I've made this recipe multiple times and always turns out. I do reduce the butter that I melt in the popover pans just a bit so that it doesn't run over and smoke up the house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JKNIGHT720"
},
"reviewBody": "I have made these many times. I add a table spoon of vanilla and a dash of nutmeg. I did try using a muffin pan the first time and they did not \"pop\" well. but in a popover pan they are great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "barney14"
},
"reviewBody": "I just tried these for the first time. I took other reviewers advice and warmed the milk a little in the microwave and warmed the eggs in warm water for about 10 minutes. I also used salted butter. I used the Nordicware Grand popover pan I ordered on Amazon and they came out PERFECT!!!!!! The amount of batter was perfect for my 6 popover pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marianne"
},
"reviewBody": "I decided to use this recipe which is close to the one I've made over the years. I wanted to see how it was to add butter to the batter and to the popover cups, too. Well, they were a huge hit! They turned out perfectly. The one thing I did that is not written into these instructions is to let the batter sit at room temperature for about 1 1/2 to 2 hours. After turning down the heat, they didn't require the whole time of baking---only about ten minutes more. I would make these again! Thanks, J Miller!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AJ"
},
"reviewBody": "Great recipe! I was apprehensive to try it because it was different than the recipe on the back of my new popover pan-but these were so easy and delish! I took Amy T.'s advice and warmed the milk and eggs first, served them with honey cinnamon butter....Wow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Massey"
},
"reviewBody": "These popovers came out beautiful!!! I adjusted the recipe a little, I used 1 &amp; 1/4 teaspoon of salt, warm the milk &amp; run hot water over the eggs before cracking them. The results are amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melanie Deysenroth"
},
"reviewBody": "Just out of the oven and these are by far the best popovers I have ever made. I used my muffin pan and it made more than enough batter for 12 popovers. With the combination of non stick spay and butter, they did not stick as the always have in other recipes. They all popped and rose up beautifully. With other recipes I have used, it has been hit or miss."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pam taylor"
},
"reviewBody": "This recipe makes 12 using popover pans...not 6."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kiersten Kopp"
},
"reviewBody": "very good but a little doughy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "websherpa"
},
"reviewBody": "After 25 years of trying to make these, this recipe and the attached reviews finally made me get the PERFECT pop-overs. Usually we make Yorkshire Pudding (either in a pan or in a muffin tin) which is the same basic ingredients, but the English recipe we've been using specifies holding the batter in the fridge before using, and the result is a heavier doughy \"pudding\" - which is an entirely different beast (and not a bad one).\n\nThe secret for \"pop\" is to have the eggs and milk at room temperature or slightly above.Cold batter and you get \"pudding.\" Make sure to spray the pan and pre-heat to keep them from sticking. We used a combination of beef fat (from a roast) and butter as the cooking oil, filled 1/2 to 3/4 with batter and never opened the oven door (cooking near the top of the oven) at 425 for 15 minutes, 375 for another 20 and they were absolutely perfect, hollow and able to hold gravy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ginny Bowers"
},
"reviewBody": "Good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunshine"
},
"reviewBody": "This is my go to recipe for popovers. Thank you so much for submitting it. I follow all of your instructions and they come out beautiful every time!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/24581/traditional-popovers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
"name": "Quick Bread Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14912/bread/quick-bread/popovers-and-yorkshire-pudding/",
"name": "Popovers and Yorkshire Pudding Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/24581/traditional-popovers/",
"name": "Traditional Popovers"
}
}
]
}
}
, "about": [
]
}
]