				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Transformed Spinach Mushroom Quiche"
,"datePublished": "2019-04-02T02:57:01.000-04:00"
,"dateModified": "2022-06-13T02:13:18.000-04:00"
,"author": [
{"@type": "Person"
,"name": "EMBRYOCONCEPTS"
,"url": "https://www.allrecipes.com/cook/1426708"
}
]
,"description": "This spinach mushroom quiche is a flavorful, moist, vegetarian breakfast or brunch dish made with spinach, mushrooms, onion, feta, and Swiss cheese."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/VKzPgITQ8sadrKxaOJv8FalC31Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3402581-transformed-spinach-mushroom-quiche-Antonella-MacKenzie-4x3-1-154b1ee638fc4707b8c4ed56a53941fa.jpg",
"height": 720,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Transformed Spinach Mushroom Quiche"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.1",
"ratingCount": "175"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "334 kcal"
,"carbohydrateContent": "21 g"
,"cholesterolContent": "152 mg"
,"fiberContent": "2 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "9 g"
,"sodiumContent": "572 mg"
,"sugarContent": "4 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1 prepared 9-inch single pie crust",
"0.5 (10 ounce) bag fresh spinach",
"1 (8 ounce) package sliced fresh mushrooms",
"0.5 yellow onion, sliced",
"0.5 (4 ounce) container crumbled feta cheese",
"0.5 (8 ounce) package shredded Swiss cheese, divided",
"4 large eggs",
"0.75 cup milk",
"1 tablespoon chopped fresh parsley",
"1 teaspoon minced garlic",
"0.5 teaspoon salt",
"0.5 teaspoon ground black pepper",
"0.125 teaspoon ground nutmeg" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Fit pie crust into a 9-inch pie dish."
} ,{
"@type": "HowToStep"
,"text": "Gently combine spinach, mushrooms, onion, and feta cheese in a bowl. Spread mixture in the prepared pie dish; top with 1/2 of the Swiss cheese."
} ,{
"@type": "HowToStep"
,"text": "Whisk eggs, milk, parsley, garlic, salt, black pepper, and nutmeg in the bowl. Pour egg mixture evenly over filling, swirling egg mixture in bowl to evenly distribute seasonings. Top with remaining Swiss cheese, then place quiche on a baking sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until lightly puffed and browned, 45 to 50 minutes. A toothpick inserted into the center of the filling should come out clean. Cool for 30 minutes before serving."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Frederick Dallmeyer"
},
"reviewBody": "So, I am making this recipe now. It's in the oven (which runs hot, so I lowered the temp to 375. The only substitution I made was some fresh cilantro instead of the parsley, after measuring everything out, I was perplexed by putting the vegetables raw in the pie crust, it can't really contain all that spinach. \"No matter,\" I think, \"the spinach and mushrooms will wilt in the pie and, making the quiche moist, right?\" After CARFULLY pouring the egg mixture into the pie, I loaded it into the preheated oven. About 15 minutes in, I saw the edges of the pie crust were already brown: PANIC! O.K.... no problem, I quickly wrapped foil around the edges and popped back in. After the 50 minutes were up, I took the quiche out, and it looks okay. The Swiss cheese sprinkled on top became a hard crust, but everything in the middle seems done (I hope). So, in the end, everything turned out fine. The family liked it (my wife likes mushrooms, so that's always a win :) ). After cooling for the recommended time, the quiche held together and was not as watery as I feared. My substitution of cilantro did not negatively impact the flavor, which was good. I would make this again, but as I mentioned earlier, will definitely keep an eye on the crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Have made several times. Freezes well. Warm in toaster oven. Just made today and right after I added my milk to my eggs I realized I had used my hazelnut creamer. Omg! Its a little sweet but at least not ruined!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aizausa13"
},
"reviewBody": "HELLO CHEF ,HERE I am with a great good news for you about the khal.com a cooking land for cooking kings and queens like you.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pattisimkins72"
},
"reviewBody": "I added cooked ground Turkey breakfast sausage and I saute'd the mushrooms first. I also added 3 chopped green onions and used Cheddar cheese as that was all I had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "raquelmgibson"
},
"reviewBody": "Terrible recipe. You have to sauté the vegetables first. Too much vegetable for a 9’ pan, even if you cut veggies in have, the egg mixture is not even enough to cover. All wrong. Waste of time and ingredients. People give 4 and 5 stars but they completely changed the recipe. So it’s not a 4 star recipe if you change it. It’s zero star recipe that I bunch of people modified to make it work for them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie Wolfe Duvall"
},
"reviewBody": "This review is actually based on the adaptations I made. I used mozzarella instead of Swiss and left out the onions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Suzy White Lindblom"
},
"reviewBody": "The flavor is good but the instructions and result are not. Too wet, confusing directions. I almost put 10 oz spinach before I realized it was 1/2 10 oz package. Just say 5oz! Very disappointing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jessica Corley"
},
"reviewBody": "The amounts as listed will yield far too much filling for one pie crust. What a waste of time and ingredients!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kim J"
},
"reviewBody": "I made it this dish tonight just as it was listed. The only deviation was boiling a pkg of frozen spinach instead of using fresh. Since it was late by the time the quiche was done, I'm not going to actually eat it until tomorrow. \n\nIt looks delicious - just like the pic here on the site. The only problem I had with this recipe was that the liquid ingredients were much too much to be contained into the deep dish pie crust. I made an omelet out of what was left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Eaton-Fraser Richardson"
},
"reviewBody": "I love this recipe so much! I also cook the veggies before and mix with the feta. I double the egg mixture and then divide the mixture bc it is a LOT for one 9 in. pan. It always is a hit with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "Disastrous. I was so excited about finding a recipe with fresh ingredients and started combining everything then suddenly realized there is no way everything would fit in even a deep dish pie shell. Dropped the onion, scooped out half the mushrooms and cheese and a lot of the spinach. So I brought out a second pie shell to thaw thinking I'd make 2 but all the egg mixture went into one shell. Smh. Ok, nvm. I'll eat cheese, spinach and mushroom salad. Still baking in the oven. I'll eat it but I don't expect it to be good. I'll never make this again. Ingredient portions are way off or should be cooked before filling the shell/s."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Abby"
},
"reviewBody": "Please listen to the other reviews of overflowing fillings. It also needs to be noted if you used fresh spinach/mushrooms, you need to absolutely cook it down first. \n\nAs for proportions, if you’re keeping the ingredient amounts the same, you NEED a bigger pie dish. It will 100% overflow. \n\nOtherwise reduce your fillings by half"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "jen"
},
"reviewBody": "The vegetables were waaaay too much for 1 pie crust, so I doubled the egg recipe and made 2 quiches. The mushrooms and spinach cooked down so much it made this dish watery with a soggy crust. My husband ate it, but he doesn’t want me to cook this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "efrisch"
},
"reviewBody": "This is our go to quiche recipe. It has been the base for many years and dozens of quiches. We mix up the types of cheese and vegetables, but otherwise we use all the quantities on this recipe and it turns out perfectly every time. The only change needed is that, as others have noted, if you use leafy greens or vegetables with a high water content, you should saute them first so they will fit in the pie crust, and spoon them out leaving the excess water in the sautee pan. We also always saute the onions before adding them to the filling. Otherwise the recipe is perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "craffe"
},
"reviewBody": "The recipe was confusing. I had to figure out what the actual ingredient size should be - 1/2 (10 ounce bag) fresh spinach. I used 10 oz and that seemed enough. I think 5 oz would have been too little.\n\nAs others have done, I ended up sauteing the spinach, mushrooms and onions as the spinach would not have fit in a 9-inch pan without wilting. \n\nI always find it annoying in these reviews when someone states it is the best recipe 'ever' and then proceed to list the changes they made when they cooked it. In this instance, that is necessary as this recipe was not well written for easy use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jessica Efird"
},
"reviewBody": "I've made this several times but agree that you need either a larger pie dish or fewer ingredients: I actually do both and use a deep-dish pie plate with less of the spinach, which works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "heeterk"
},
"reviewBody": "Perfect EXACTLY as directed! I don’t know why people insist on cooking the spinach. I specifically wanted to use fresh spinach and this recipe is spot on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Audrey Noyb"
},
"reviewBody": "Doubled the filling and made two pies, one with an almond flour crust from Caroline Ketchum’s cookbook (for the diabetic in the family). Used 1/2 &amp; 1/2 heavy cream/unsweetened almond milk (same reason). Parbaked the crusts first for 10 minutes. Then followed the prior reviewers advice and cooked the mushrooms with chopped onions, garlic, and fresh parsley in some unsalted butter; then wilted the spinach. Blended the spices into the custard, folded in the cheeses (preshredded Swiss-Gruyere mix &amp; precrumbled feta), then layered it all in and baked. Dinner (with salad &amp; berries) was well-liked by all (1 adventurous eater, 1 diabetic, 2 picky adults with different “won’t eats”). The leftovers disappeared by next day lunch. This is a keeper,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joshua Rubin"
},
"reviewBody": "Definitely sautee the veggies (my wife was right!). I also used muenster cheese, since we were out of just about all other soft cheeses,and we weren't going shopping just for one item during the COVID quarantine. That worked pretty well, as it gave the quiche a nice tang."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BarbFlowers"
},
"reviewBody": "Used 2 store bought frozen pie crusts. I added one more large egg and just enough milk to bring the total liquid volume up to 2 cups. Then divided the spinach/mushroom mixture between the 2 pie crusts and poured on the egg mixture. Really good, plus since there are only 2 of us had a whole one to freeze and enjoy later."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacy"
},
"reviewBody": "I love this recipe. Made as is and it turns out wonderful.\nFull of flavor. This is my go to for quiche recipe. I read the other reviews and there is really no need to precook your veggies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah V."
},
"reviewBody": "The recipe lacks some info, but this quiche was phenomenal! Brown the mushroom slices in a hot pan first, add a little butter, add the onions. Wilt the spinach in a separate pan, drain it and cut it up a bit, add it to the other veg. I added an additional egg, and a sliced tomato on top, but that was it! I've already made this twice and both times it was gone in 24 hrs! For one I was out of feta and used shredded colby jack instead (I don't like swiss) and it was still phenomenal. Oh and bake it in a cast iron skillet if you have one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barbara"
},
"reviewBody": "Added cooked bacon. J&amp;A said it was \"awesome\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Alexander Idunate"
},
"reviewBody": "Need to update your recipe, several comments mention sauteeing the vegetables before adding them to the quiche. Too late for that for me, I already have it in the oven. I should have read the comments before, but shouldn't need to in order to prepare your recipe correctly. Hope it turns out ok, or I'll need to make something else or eat out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "David C. Peters"
},
"reviewBody": "Ridiculous. Recipe is for at least 12 inch pie crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eaglesfanintn"
},
"reviewBody": "Wish I had read other reviews first. I definitely would have wilted the spinach ahead. Other than that, it worked out great. I adjusted some of the custard ingredients to make two quiches. Next time, I'll add some more mushrooms and maybe a bit less spinach and should come out perfectly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lizette Betancourt"
},
"reviewBody": "yummy!\nused parmesan instead of Swiss, it was good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "La Bell Aaron"
},
"reviewBody": "Followed recipe, removed Swiss, added taco sauce drizzles, and parsley removed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Louisa"
},
"reviewBody": "400 degrees too hot. Crust burned quickly, spinach burned. Took much more than 50 minutes for eggs to set. Basically, a disaster! Will not make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Debalina Mitra Chanda"
},
"reviewBody": "Made a smaller sized quiche.\nI used 2 eggs and cream instead of the milk. To make it more flvourful, I added some crushed garlic and a handful of choppedbasil leaves to detract from the sometimes-overpowering spinachy smell."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Chevy"
},
"reviewBody": "I think half a bag of spinach is a little too much, but it was super delicious and the whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joan Keith"
},
"reviewBody": "Best quiche I've made! I think the Feta and Swiss made all the difference -- I usually use sharp cheddar in my quiches. I am planning to save this recipe for frequent use."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "weekend cook"
},
"reviewBody": "Flavor was pretty good; I would not have thought to combine feta and swiss cheeses. But too much moisture from all the veggies; I had to drain some water from the baked quiche . As others noted, if I make it again I will sauté the mushrooms and onions to release some of their water. I might also cook the spinach in the microwave and squeeze out some of the moisture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cyndy"
},
"reviewBody": "Agree with others...way too much spinach unless it’s chopped or wilted. Would 1/2 spinach and mushrooms and increase eggs/milk by half."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy"
},
"reviewBody": "My husband and I truly, enjoyed this recipe!\nI made my own pie crust ( which I have been previously, used for for fruit pies with excellent results )!\nI did only, partially, pre- bake the crust prior to including, remaining ingredients according, to recipe! This enabled the crust not to be over-baked during, baking of remaining ingredients !\nFound using fresh uncooked spinach and mushrooms made a Significant delightful fresh tasty meal without over cooking vegetables . \nI certainly, recommend anyone with a interest in cooking , try this recipe they won’t be disappointed ! \nI have made other similar vegetable Quiches However , this recipe was more creative and enjoyable"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Friedlander"
},
"reviewBody": "I made this quiche three times this week. It's perfect for a potluck meal, esp. if it's a vegetarian meal or dairy. It's very easy and always comes out great. Several friends have asked for the recipe. I use orinonoque frozen pie crust. It's the best. I also sometimes substitute either dill or cilantro when I don't have parsley. I also used mozzarella once because I didn't have feta and it came out even richer and tastier. I would recommend making two at once (the frozen crusts come 2 to a pack). And if you can't find grated swiss cheese, not a problem at all, just use the slices cut up; this works perfectly fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "James Na"
},
"reviewBody": "cooked according to recipe as best as I could, had a couple missing spices and didn't have an onion. spinach is not clear on abount 1/2 (10 oz) bag of fresh spinach?\n\nis that 1/2 of a 10oz bag, or 1/2 bag, which gives you 10oz?\n\nat any rate, i used 5oz of spinach, and less mushrooms that it called for because of volume, trying to fit in the 9\" (i used deep) pie crust. it resulted in a mound in the middle higher than the crust was deep, and finished like a quiche soup. ABSOLUTELY cook the watery vegetables first (spinach and mushrooms atleast. and I checked multiple times to see if I was supposed to cook them first, recipe says no. pie crust overflowed and made a horrible mess in my oven\n\nthe finished product is almost inedible. yay, quiche crumble soup!\n\nwon't make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Webber"
},
"reviewBody": "Made with half the spinach and five eggs. Also used a dash more of nutmag and 4xs the garlic. I sauted the veggies and wilted the spinach. Also added 2. extra oz of each cheese. Came out beautiful and tasted amazing. My first ever quiche and I nailed it! Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Vickery"
},
"reviewBody": "I used heavy cream instead of the milk. I had to leave out the feta and used additional swiss cheese. I made two, one for a very sick friend and one for my family. My friend and her family loved it. And of course, we devoured it! Yes, I will indeed make this again - and again - and again...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Savannah Rae"
},
"reviewBody": "Warning: as hinted to in the instructions, the amount of filling in this recipe is enough for two quiches.\n\nI've struggled to find a good quiche recipe in the past, but I really enjoyed this one. Used my own crust recipe that I use for pies :O and my housemate said this was the best quiche he's ever had!! I think I'll cut the filling mixture in half next time thought as I don't need two quiches ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luther"
},
"reviewBody": "I will make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "veggiegm"
},
"reviewBody": "This is my \"go to\" for vegetable quiche. Saute the veggies before adding. I don't use nutmeg and I use 5-6 large eggs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "beth"
},
"reviewBody": "delicious! after reading the comments, I pre-cooked the pie crust; fried the onion, and garlic and wilted the spinach. I built the quiche by layering 3/4 of the cheese onto the pre-baked crust and baking for 10 minutes, then scooped on the veggies, added a layer of cheese, then poured the egg mixture over top and sprinkled the last of the cheese. The pie turned out very yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "annebenjon"
},
"reviewBody": "Great recipe. My husband didn't like garlic in it, but we also changed the feta and the swiss to mozzarella. A little parmesan would have been good too. Garlic would have gone better with feta. Overall, came out great. Good consistency with the ratio of eggs to milk. That is most important. I thought the salt would be too much, so I cut it down. I regretted it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "L. C. Forrest"
},
"reviewBody": "I will make this again with Swiss cheese which is hard to find up here in Vermont. I used goat cheese instead of Feta and Cheddar. Cooked the spinach, onions and mushrooms together before putting in the shell. Crust got a little soggy near the outside."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Glenda"
},
"reviewBody": "It could have used 1 more egg and there was enough filling for 2! It was fantastic can't wait to use the extra filling to make another one!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bryn MacQueen"
},
"reviewBody": "Slightly adjusted quantities to better suit our tastes, will use more spices next time, didn’t have a whole lot of flavor but over all very good! Will definitely make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy B"
},
"reviewBody": "Cook the mushrooms and onions in some butter first, then add the spinach to wilt it. All veggies will fit into the pie shell this way. I didn't have any onions, so I used some onion powder to flavor it instead. Delicious recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MitziDee"
},
"reviewBody": "I turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jalyn23"
},
"reviewBody": "Terrible directions! Highly recommend cutting the spinach amount in half or wilting it, and probably saute the mushrooms. Way too much work and overflowed the 9\" deep dish pie crust. Had to grab the second pie crust I bought and add more eggs/milk to mix and divide into 2. Waiting for it to cool. Usually my quiches are practically hassle free!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Naini Singh"
},
"reviewBody": "Once I cut the veggies, it didn't seem it would fit into the pie shell. I proceeded to fry them without salt as I didn't want water to be released. I added two more eggs and a little more cheese and mushrooms and made 2 nine inch pies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keith"
},
"reviewBody": "I made it following the recipe except i only used about 5 oz of swiss cheese. The rest would not fit. The ingredients are too much for a 9\" pie shell. The heavy stuff stayed but the egg overflowed when filling and again when cooking. Maybe cut down on the spinach and use less cheese. Flavor wise it was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Peachcake"
},
"reviewBody": "we really enjoyed it! I didn't think my husband would like it but, there was one piece left. He ate that the next day for lunch,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "llbne57"
},
"reviewBody": "Excellent! I simmered the Veges a bit and drained well before placing them in the crust. Next time, I will cover with foil to bake and then uncover during the last few minutes to keep the top from getting too brown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "scott"
},
"reviewBody": "Had 2 x 9\" pie shells so doubled the recipe. There was enough filling for ~10 pie shells. I'm sure it's possible to modify but there are a bazillion recipes online. Pick a different one and avoid my mistake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wim"
},
"reviewBody": "I used s[inach and asparagus and it was wonderful. Will make more shortly when we have company."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "douchkan1973"
},
"reviewBody": "Terrible recipe. There were way too many raw veggies to fit into the pie crust. Not being an experiences cook, I followed it very closely. It didn't take long to realize that all the veggies wouldn't fit. They should have sautéed and extra water drained. I have a huge mess. It's the author of the recipe never tried it before posting it. It ruined my Easter brunch. It was going to be one of the dishes to serve. Never again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Terrible recipe. There were way too many raw veggies to fit into the pie crust. Not being an experiences cook, I followed it very closely. It didn't take long to realize that all the veggies wouldn't fit. They should have sautéed and extra water drained. I have a huge mess. It's the author of the recipe never tried it before posting it. It ruined my Easter brunch. It was going to be one of the dishes to serve. Never again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Healthy Mom"
},
"reviewBody": "Really bad recipe; didn't even try to bake it. No wonder people had watery results!!! Shrooms and spinach need to be cooked down to evaporate water in the vegetables before adding to eggs, etc. Also, recipe needs to include a deep dish pie crust"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen the Baker"
},
"reviewBody": "This is a great quiche recipe and I've made it several times. It is a good idea to lightly sautee spinach &amp; mushrooms to fit into 9\" pie pan. Highly recommend it!\n\nI've also added lightly blanched fresh asparagus to all the vegetables."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TLBMoen"
},
"reviewBody": "After reading reviews I decided to try this with some farm fresh eggs I had just received. I used two Pilsbury pie crusts and baked them as instructed on the box. I then put one layer of sliced swiss cheese on the bottom of the pie crust. I browned some sausage and then sautéed the fresh mushrooms with a bag of fresh baby spinach and some chopped garlic, added some frozen seasoning blend (onion, bell pepper and celery, what we call the \"trinity\" in Louisiana). I drained all the water and mixed in the sausage and then layered the mixture in my two pie shells with the cheese (I used Swiss and Garlic and Herb Feta). I also added a little sweet basil and skipped the other seasonings. I poured my egg mixture over and then layered some sliced Roma tomatoes and another layer of cheese. The best thing about this recipe is that you can pretty much change it up most any way and it will be good. The quiche baked perfectly and we thought it was delicious! I will definitely try it again with probably some different veggies and we like meat in ours as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary P."
},
"reviewBody": "This was simply delicious. I had a bit more filling that wouldn't fit in the crust so I poured it into a small souffle cup (I packed it in my daughters lunch the next day). You don't need to change a thing. Although I do add crisped bacon sometimes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Christenberry"
},
"reviewBody": "I made this for a brunch I hosted at my home today. Very yummy and easy to make. As suggested by another reviewer, I sautéed the onions, garlic , mushrooms and spinach before adding to pie shell. Good tip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "turbotammy"
},
"reviewBody": "Portions are way off. I tried to make this and ended up with incorrect portions which made this difficult to prepare in addition I had a big mess when I tried to cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bluedaizy"
},
"reviewBody": "i didn't have any feta cheese or parsley. i used 6 eggs, 1/2 cup of cream, 1/2 cup of milk, about 4 oz of mozzerella, about 8 oz of cheddar. i also precooked the onions, garlic, spinach and mushrooms and mixed with the eggs then poured into pie crust. was hoping to make two quiches, but it only made one. but it was quite delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "männlicheDamme"
},
"reviewBody": "Great recipe. I've made this several times -- my favorite rendition uses only 3 eggs and a mix of 12 oz. of shredded sharp cheddar, gruyere and swiss. The leftovers make an awesome breakfast in the toaster oven!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Krys Wallbank"
},
"reviewBody": "A very flavourful quiche!\n\n I omitted the parsley, and used puff pastry for the crust and used 1/2 a sweet onion to prevent the onion from overpowering the other flavours. I would even use less onion next time.\n\nI also layered the main ingredients (mushrooms, spinach, onion and cheeses) in 3 layers instead of mixing them together first and then poured the egg mix on top,"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paula"
},
"reviewBody": "This is a great recipe, and I make a lot of quiches. I did what another reviewer suggested, and sauteed the mushrooms a little and chopped and wilted the spinach. I used fresh onions though. It did seem a little dryer than other quiches I've made and I was concerned, but it did all work out in the end! I couldn't upload a picture, but it turned out beautifully! Highly recommend"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "John Cassil"
},
"reviewBody": "Terrible instructions.\n\nThe vegetable mix wouldn't fit, so I had to cook it down after mixing it with the feta. I was hoping for an easy recipe without stovetop cooking involved. I Would never recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruth Murphy"
},
"reviewBody": "Delicious! Two small changes. I doubled the egg/milk mixture to fill two pies. The veggies cooked nicely through the baking process but I would sauté the onions before adding them to the veggie mixture since the result was they were crunchy. Great recipe!! Very tasty without using butter!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "JeannieS"
},
"reviewBody": "The quiches haven’t even finished baking and I’m giving my review. I don’t care if they taste better than anything I’ve ever eaten, I’m not making this again! Even after reading other reviews and making adjustments I now have egg burning in my oven and a cookie sheet filled with half cooked egg. Why so much of each ingredient?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lora"
},
"reviewBody": "Simple to make, delicious and nutritious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggielynn"
},
"reviewBody": "I forgot to buy the mushrooms and just substituted with zucchini and red pepper. Covered the crust with a handful of mozzarella as suggested in another review. It was delicious Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cecil_kimberly"
},
"reviewBody": "This was a very good, hearty quiche. When I saw how much spinach it called for, I didn't think it would all fit in the crust but it did! I did add an extra egg and milk because it didn't saturate the ingredients as I thought it should. Overall, excellent recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathryn Eleanore"
},
"reviewBody": "I sautéed all vegetables first, including the garlic, and sprinkled with red pepper flakes while they cooked. Also used an entire bag of spinach and more mushrooms. Five stars for flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Katrina Austin"
},
"reviewBody": "It gives good ingredients but you definitely have to wilt the spinach or it doesn't fit. This recipe was crazy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AJ West"
},
"reviewBody": "I was w/o feta, so I subbed with some ricotta and parm, had no problems fitting it all in the pan and still had a good 1/2 of space left, and also used double the spinach! The only crust I could Imagine this not fitting in is those shallow ready frozen ones that in a pinch bought by accident and noticed after getting home they had shrunk like all other products! Those looking for an easier fix should try this, put all your veggies in a bowl, drizzle and mix with some good evoo, cover tightly with plastic wrap and microwave for 4-5 minutes, I tossed it up and added spinach halfway through. And if going through the motions of making it yourself, do yourself a favor and buy those rolled up refrigerated pie crust and a couple of (deep dish) glass pie plates. I got a two pack at aldi not long ago for $3.99, no prebake needed as long as it goes on the rack, pie crust really shouldn't be baked on a cookie sheet. If using these for a double layer, brush with egg or milk, and they can pass as homemade."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda hughey"
},
"reviewBody": "I searched much for a good quiche recipe . This worked well for me, simple, easy delicious. Followed recipe almost to the letter. Only difference was I used cheddar cheese instead of Swiss. I also make my own pie crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BobH"
},
"reviewBody": "Got loads of favorable reviews. No need to change anything!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Diana Land"
},
"reviewBody": "I made a deep dish 9\" pie. I used 6 eggs and extra milk but had too many veggies and too much cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Keepitsimple"
},
"reviewBody": "Taste is terrific and it is not your typical Quiche. I like great ingredients that aren't over cooked.. BUT... I now wilt the spinach and precook the mushrooms and onions a bit. If you don't it's a big mess trying to get everything into a 9\" pie pan. Or maybe use a Soufflé dish?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "southernsmoker"
},
"reviewBody": "Not sure how anyone was able to fit 5 oz of fresh spinach into a 9\" pie crust, much less the mushrooms, onions or feta. If you were able to, then I'd love to see it. But then, add in the need to add the egg mixture,. I'm not sure this recipe, with all the ingredients, wouldn't of been better served by using two pie crusts.. I will try that next time. I do like the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sandy M."
},
"reviewBody": "The vegetable to egg ratio was off. I added another egg and 1/4 c. milk and only used 6 oz. swiss cheese and eliminated the feta. With these changes, the recipe was a success and my family loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jean Mikkelsen"
},
"reviewBody": "The quiche was excellent. I Baked the shell for 10 minutes. Then sauteed the other ingredients.The adults in the house thought it was a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jerry Chappell"
},
"reviewBody": "Whoever wrote this recipe should be banned from the interwebs. You have to sautee everything first; that was obvious considering the amount of filling. However, even sauteeing the filling you still will have your egg mixture seeping over the top and filling your cookie sheet. It's like watching someone getting so hammered at a bar, and you know the eventual outcome, but you can't do anything to stop it.\n\nSo use a deep dish pie crust. If anything, doing this recipe made me do a little further research and learned what not to do, which is about 75% of this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jules"
},
"reviewBody": "This was really good! It was even better the next day...I followed the recipe but pre-cooked the pie crust like the reviews said and added extra garlic...this is a winner and super easy to do."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Stacey McCarthy"
},
"reviewBody": "I made this according to the recipe. Next time I will do a few things differently! I will next time mix all ingredients together before adding to crust! I didnt care for the Layered Effect I Got! Also I will add a few more Eggs! I felt like it could have used at least 6 to 8 Eggs!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ladyt"
},
"reviewBody": "As suggested, I cooked the onion, mushroom and spinach before adding it to the pie shell. I still had egg mixture spill out of the pie shell. Next time I'll use fewer mushrooms and spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Felicity"
},
"reviewBody": "I made this quiche for my Fitness ladies' lunch at my house &amp; they enjoyed but I had to make changes. The spinach had to be wilted to fit in the pastry case &amp; I pre-cooked the mushrooms a bit too otherwise the filling was still too high. The temperature was too high for the time suggested &amp; quiche was getting too brown after 20 mins so I reduced the oven to 180 deg. &amp; covered the quiche with foil. It was still moist after this time but I had checked by poking in a cocktail stick &amp; it was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erika Wrr"
},
"reviewBody": "I made some changes, add gruyere cheese to make it creamy and heavy cream. I made two one with bacon (which it was another addition for my husband taste who's a carnivore) and the other one was solely veggies. It was DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alana"
},
"reviewBody": "I made this recipe for my boyfriend and he loved it and said it was like walking through a vegetable garden. I followed the recipe exactly as written and the raw spinach was spilling out of the pie crust before I put it in the oven, but I was very surprised by how much it baked down! I agree with others that you could sauté the vegetable filling first. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Loretta"
},
"reviewBody": "I made the recipe with the uncooked spinach and mushrooms, but added two eggs and 1/2 cup of milk to the custard. It came out fabulous! I am delighted that I no longer have the fuss with making sure the cooked spinach is properly drained."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lea"
},
"reviewBody": "Didn't use onions but it still had plenty of flavor. Even my mushroom hating son had seconds. Easy to make, too - definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HP"
},
"reviewBody": "I made t his according to the recipe. It was easy to make and my family enjoyed it. The only change I would make, bake the pie crust before adding the other ingredients. The crust was a little soggy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Leslie Ruggles"
},
"reviewBody": "All the ingredients wouldn't fit in one pie crust. I put it in 2 and it turned out good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lmarshel"
},
"reviewBody": "Loved it with a puff pastry crust. I followed some other reviewers advice and cooked the spinach (&amp; drained) and mushrooms before. Very simple &amp; easy weeknight dish, perfect for meatless mondays!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "prof chris cooke"
},
"reviewBody": "I used a premade store-bought crust.\n\nI sauteed the mushrooms and onions then wilted 4 oz of fresh rough-chopped spinach on top. To avoid soggy crust, put a layer of swiss over the crust, then alternated mushrooms &amp; spinach &amp; onion with swiss; poured the milk &amp; eggs over all, NEEDED MORE.... so I whisked another egg with 1.5 oz milk, and this just fit. Sprinkled parmesan over top rather than including feta.\n\nBaked at 375F with convection... perfect at 40 minutes.\nWould add a touch more salt to filling next time, since I prefer to omit feta."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "reeree"
},
"reviewBody": "Great recipe, I switched feta cheese and used Kraft Mexican four cheeses &amp; instead of regular milk I used Silk unsweetened almond milk and red onions"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frenchie"
},
"reviewBody": "Made this quiche tonight and it's delicious. The only thing i did different was sauté the mushrooms and add some ham. I don't usually write reviews but I had to come here and add a review on this recipe. My 6 and 4 year olds are devouring it, too."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/221198/transformed-spinach-mushroom-quiche/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
"name": "Eggs"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
"name": "Quiche"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/221198/transformed-spinach-mushroom-quiche/",
"name": "Transformed Spinach Mushroom Quiche"
}
}
]
}
}
, "about": [
]
}
]