				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkey in a Smoker"
,"datePublished": "1999-10-23T15:05:42.000-04:00"
,"dateModified": "2023-01-30T12:27:40.000-05:00"
,"author": [
{"@type": "Person"
,"name": "DOUGKOJAK"
,"url": "https://www.allrecipes.com/cook/24323074"
}
]
,"description": "Learn how to smoke a turkey for the holidays in your smoker, resulting in moist, tender, hickory-flavored turkey that will be surely be met with rave reviews all around."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/OO-NAR3nHj-arnaUlOawMyagmG0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/16984-Turkey-In-A-Smoker-ddmfs-084-4x3-1-b1fc2e6b35484a2a9310d22874d6c41e.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkey in a Smoker"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.8",
"ratingCount": "274"
}
,"cookTime": "PT600M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "625 kcal"
,"carbohydrateContent": "10 g"
,"cholesterolContent": "225 mg"
,"fiberContent": "1 g"
,"proteinContent": "71 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "1185 mg"
,"sugarContent": "8 g"
,"fatContent": "32 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"1 (10 pound) whole turkey, neck and giblets removed",
"4 cloves garlic, crushed",
"2 tablespoons seasoned salt",
"0.5 cup butter",
"2 (12 fluid ounce) cans cola-flavored carbonated beverage",
"1 medium apple, quartered",
"1 medium onion, quartered",
"1 tablespoon garlic powder",
"1 tablespoon salt",
"1 tablespoon ground black pepper",
"2 cups hickory wood chips, or more as needed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat a smoker to 225 to 250 degrees F (110 to 120 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Rinse turkey under cold water, and pat dry."
} ,{
"@type": "HowToStep"
,"text": "Rub crushed garlic over the outside of the turkey, and sprinkle with seasoned salt. Transfer to a disposable roasting pan."
} ,{
"@type": "HowToStep"
,"text": "Fill the turkey cavity with butter, cola, apple, onion, garlic powder, salt, and pepper. Cover turkey loosely with foil."
} ,{
"@type": "HowToStep"
,"text": "Add wood chips to the smoker according to the manufacturer&#39;s directions. Place the roasting pan in the preheated smoker. Smoke the turkey, basting every 1 to 2 hours with juices from the bottom of the roasting pan, for 5 hours."
} ,{
"@type": "HowToStep"
,"text": "Add more wood chips if desired. Continue smoking and basting, until turkey is no longer pink at the bone and the juices run clear, about 5 more hours. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 180 degrees F (80 degrees C)."
} ]
,"recipeYield": ["13"]
,"totalTime": "PT620M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chef Dave"
},
"reviewBody": "This is not only the best Turkey I've ever made, it's the best I've ever tasted anywhere! The whole family was blown away."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "It was great I've done it this way for years"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "William Claspell"
},
"reviewBody": "The recipe is great and the flavor really comes out! The only issue is, you definitely do not want to cook your turkey in the smoker for ten hours at 225, unless you're planning to make turkey jerky. I've made this recipe three times now, all with turkeys over 15 pounds, and they are usually done in 4-5 hours. Dropping the temp to just the smoker setting will add an hour, or so, but the 10 hours is a definite stretch."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "crystaljones201515"
},
"reviewBody": "My husband decided this for Thanksgiving we would smoke our turkey was at 19lbs. He allowed for 20 hours of cooking time. We basically doubled the ingredients. We used a apple wood pellet and set smoker to 200 degree. After husband spent all night and every 2 hours basing it. At 16 hours our turkey was golden and holding internal temp of 184. I will say the meat was so tender it fell of the bone, the breast of the turkey was juicy and tender. This is amazing my whole family loved it. It takes time so plan ahead and don't rush it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicamacyl"
},
"reviewBody": "Best, most juiciest turkey I’ve ever had, let alone cooked in my life! I halved the recipe, brined the breast for 36 hours, and smoked a 4.5 pound turkey breast with applewood for about 3.5 hours at 225-250° to reach an internal temp of 160° and let it sit for 30 minutes. My goodness! My husband isn’t even a fan of smoked food and is very picky about turkey having that dry, stick to your teeth feeling, this had none of that and he freaking loved it! I can’t sing enough praises for this! I don’t even like turkey and would consider cooking this for a summer bbq just for fun! I will never consider roasting a turkey ever again!! Adding this to my handwritten recipe box!!! Do yourself a favor and just cook it! p.s., I used Pepsi!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joe A"
},
"reviewBody": "Yes, the meat needs to reach 165 degrees for one second (white meat), but its also safe when the meat maintains a 145 degree temp for 10 minutes or 150 degree temp for three minutes.\nWhen the white meat reaches 150 degrees let it cook for three more minutes and you'll be safe.\nI've been doing it this way for over 10 years without any problems at all.\nAnd you won't need to brine it since cooking it this way produces moIst white meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gozzy"
},
"reviewBody": "YUP this is a winner !\nI used \" Out of this world turkey brine \" for 24hrs. I used the Brine recipe and added one cup of apple cider vinegar and one orange into slices with rind. Now the turkey I used a Traeger fin and feather rub over the garlic, everything else exact as described. Cooking time I used the 30 minute per pound rule at 225. So the 15lb turkey was as 165 after 7.5 hours of smoking. But we like our turkey at 185, so I cooked it at 350 with foil cover off for an extra hour to get the temp and a dark brown color on the bird. Used a half apple and half mapple mix pellet in the hopper. After letting the bird set for 30 minutes it was carving time. The first slice had everyone amazed. Perfectly cooked but wow to the juices. Bottom line this recipe with out a doubt is a repeat. I think this will be a recipe that we make for a normal meal with out a special occasion. Highly recommended ??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Fisher"
},
"reviewBody": "Best turkey ever!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Zippy"
},
"reviewBody": "This was the winner in our house for Thanksgiving this year. It's a keeper and a new tradition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brenda"
},
"reviewBody": "This is by far the best smoked turkey recipe ever, thank you Doug! Used a 16-oz Coke, 14-lb turkey and cook at 240-degrees (was a little cold in MI) and it was done in 10-hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "becky"
},
"reviewBody": "my favorite turkey recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Dropulic"
},
"reviewBody": "This recipe was a hit with everyone!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bette Baker"
},
"reviewBody": "This was magnificent! I had a 19 lb. turkey and a request to put it in the smoker. I tried a different recipe last year and wasn't thrilled so I was not too excited about smoking one this year. But I came across this recipe and the reviews were great so I decided to try it. I put it in a brine the day before and in the smoker the next morning at 250° (thinking that would be right since it was a bit bigger). I used one can of cola instead of two. I covered it loosely with foil and filled the water pan in the smoker. I did not baste it. The smoker had steam coming out of the vent and condensation inside on the window. Also, I soaked apple and hickory chips and put them in when I put the turkey in and the smoky flavor, in my opinion, was perfect. The bird was done in about 8 hours, sooner than expected. Kept it covered and warm until ready to eat and it was perfect and a big hit! Thanks for this great recipe! (I don't typically write reviews but this was worth it.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kcsm1th"
},
"reviewBody": "I already rated this. I just wanted to note that I brined my turkey for 24 hours before cooking it. It was truly delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mich V"
},
"reviewBody": "Best turkey I’ve ever had!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ridenour Homestead"
},
"reviewBody": "I did make some changes to the ingredients. Instead of adding table salt I did pink hymilan salt. I did 1 tbsp &amp; 1 tsp of minced garlic versus the 4 cloves. I also largely diced up the apple &amp; I used red onion. I added 1 cutie orange to the mix. I did 24oz of venilla Cherry Coke. Added 1 tbsp of hot sauce &amp; my own rub just for some extra flavor. I think next time I will also try adding jalapeno to the mix. My turkey only took 5 hours on the smoker just because it was already thawed out, but it was seriously the first time I was ever interested in the white meat of the turkey because it was sooo tender."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tim Sheffield"
},
"reviewBody": "Made this for Quarantine Easter 2020, 6.5 hours at 230 for a 12.5 lbs fresh turkey. I will only smoke a turkey this way from now on, my kids didn’t like turkey before this, even though I’ve smoked a few over the years that I thought were pretty good! Delicious. I only put half an apple and half an onion to keep some room for airflow through the cavity, but otherwise just followed this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mindy Santema"
},
"reviewBody": "Wow super easy and the best turkey I’ve ever eaten!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ruby Kopenski"
},
"reviewBody": "This was the best turkey I have ever made. Super moist and great flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Senak"
},
"reviewBody": "This recipe was the best smoked turkey recipe we've had for thanksgiving. Bird was juicy and had a very good flavor. I think this will be my go to thanksgiving recipe from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Spohr"
},
"reviewBody": "I brined the 22 pound turkey for 48 hours, then followed the directions, except for the garlic. My brine had garlic, so I didn't use garlic here. Instead, I used olive oil and seasoning salt on the outside. Smoked for 13 hours at 230 degrees, electric smoker, using hickory. Everyone raved about how tender and juicy the white meat was. This is my new go to."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AElectron1"
},
"reviewBody": "First Turkey I ever smoked.\nUsed Apple Chips in my Electric smoker 10 lb. bird 10 Hrs. Everyone loved it! One of our guest was a friend of ours that is a chef. Their spouse commented I think we need to get a smoker!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andrew Westerberg"
},
"reviewBody": "Pretty solid recipe. I did a 24 hour brine and followed everything else to a T. I smoked a 13lb turkey and took it out when the leg internal temp was 165 degrees. Overall it was super moist but I also poured the drippings over the turkey after cutting it too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Young"
},
"reviewBody": "This turkey turned out beautifully! The flavor is delicious and the turkey is incredibly tender. I would definitely recommend it to a first time smoker, because it was my first smoked turkey and it’s flawless."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Billy Veselka"
},
"reviewBody": "11 hours on the smoker, moist and tender. Will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Did an 11 lb turkey, only change was I only used 11 oz of cola and removed turkey once inner thigh was at 165 degrees. Didn't put in a brine. I wouldn't eat anything but fried turkey the past 15 years, after I tried this recipe on Wednesday, we changed our plans for a fried turkey on Friday to smoked as well. It was enjoyed by everyone at both gatherings."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff Davidson"
},
"reviewBody": "Delicious! Only one change I will make next time. It needs to be broiled at the end of the cooking time. This will create a nice crispy skin. The skin without doing this is rubbery."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Nick K"
},
"reviewBody": "Cooked primarily around 225-250 degrees...\nTook 8 hours for a 11.5 lb bird\nUsed Apple chips\n\nOnion I used was too large, could only put 3/4s in. Only 1 can of soda fit.\n\nIt was well received by all guests. Next time I may cook it around 300 to speed up since I got up at 3am and was pretty exhausted by our meal start time of 4pm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NancyD"
},
"reviewBody": "I did it the day before Thanksgiving Day. I had 11.5 lb turkey in a charcoal weber smoker. Cooking time was 6 hours. I worked very hard. I had two charcoal chimneys going and apple chips processing from soaking to draining to throwing them into the hot coals. Also had hot chicken broth and melted butter for basting. I also had a probe thermometer which proved invaluable. The turkey was perfect the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "libra559"
},
"reviewBody": "I used a Big Green Egg, charcoal with hickory wood and a dry brined 15-lb turkey. Followed the recipe exactly, minus the basting. The bird hit 170-degress in 5 hours exactly. Let it rest for 20 minutes before carving. It was ready to eat in less than 6 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ptfamrey"
},
"reviewBody": "Best smoked turkey I've smoked, whole family loved it. we will be doing this again, and we won't wait for a holiday."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Allen"
},
"reviewBody": "Best turkey I've ever had!!! My wife and son think the same. It is so tender and delicious I cooked it exactly to the recipe I also put it in a brine for two days before hand and this is definitely going to be a tradition for my family. The bar I set today is high with this turkey. I don't think I could ever cook it any different. Sooo delicious!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TomDee55"
},
"reviewBody": "Turned out GREAT!! Very tasty and moist. I recommend using cherry and/or apple wood pellets if you have a pellet smoker"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sabrina Leigh Millward"
},
"reviewBody": "I absolutely love this recipe, it is always my family's favorite way of eating our Thanksgiving Turkey!! It always turns out so juicy with so much flavor!! I love to save the bones and make the best bone broth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clint Wilson"
},
"reviewBody": "I have made this the last 3 years and never have leftovers. I have already been asked if I'm doing another this year! I didn't change anything and I have used apple, cherry and hickory with great results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dtrackmom"
},
"reviewBody": "Took about 11 hours in the smoker. We were surprised it was so moist. Delicious and we will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bulletproof Tiger"
},
"reviewBody": "I've made this with a turkey and with whole chickens. My boys love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandon Vardy"
},
"reviewBody": "I'll never alter it. Perfection"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dehrty"
},
"reviewBody": "Was a hit at Christmas"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Raleigh"
},
"reviewBody": "Well worth the patience to cook this. This received rave reviews from everyone at Christmas dinner. Comments such as “game changer” and “the best turkey I’ve ever had. Will be using this recipe for now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julia S."
},
"reviewBody": "This was our families first time smoking a turkey. To say we were nervous is an understatement! We followed the recipe exactly, (but not the smoking time.). It was the best Thanksgiving turkey ever! Even my daughter who “didn’t like turkey” is now a fan! So incredibly moist and flavorful! We are doing it again for Christmas. We also used the recipe for Out of this World Brine on this site. ????????"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Popoff"
},
"reviewBody": "We made this for Thanksgiving. It was very tasty but we are trying again today. I felt the first one was a little on the dry side. I read someone's review saying it was better cooked to 165 instead of 180 so we are trying that this time. I will update my review after we taste it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cary Wolfe"
},
"reviewBody": "This was amazing, just brined before I cooked only took 7 hrs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "knittingfever"
},
"reviewBody": "Made this in my new electric smoker for Thanksgiving yesterday. I used dry brining method a day before (1 Tbsp kosher salt &amp; 2 Tbsp seasoning salt on the outside). Kept the bird in the fridge loosely covered with saran wrap. Uncovered it in the fridge in the morning. I rubbed the salt/pepper/garlic powder mixture inside the cavity and stuffed the bird with onion and apple. There was so much stuffing that I could barely fit everything inside the 12 lb bird. I used about 16 oz of Pepsi (poured until it overflow and ran outside of the cavity) then I tied the legs. I put the bird in the smoker set on 235'F and covered with foil loosely. Added half mesquit and half apple chips once every hour. I wanted to put the thermometer in the breast at 4 hours in and to baste the bird with the liquid in the pan. I found that the bird was very pale after 4 hours so I left the bird uncovered after basting. I have not basted the bird again after that because I don't want the smoker to lose heat every time I open the door. I saw that couple reviewers mentioned it took them 5.5 hours to cook a 14 lb turkey in electric smoker. I thought I would give it 6 hours since my bird was only 12 lbs. It was a mistake. I miscalculated and totally forgot that the bird was stuffed, fully! And that would take much longer to cook for a stuffed bird. I suspected that the reviewers cooked their turkeys in just a few hours did not stuff their turkeys. However, even though it took longer than I expected, the bird t"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shasta Langenbacher"
},
"reviewBody": "Turned out great. The skin was nice and crispy, the turkey very moist. Basting it is key. We'll be doing this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeff"
},
"reviewBody": "Incredible. Juiciest bird ever. Made in my MES smoker. 20lb bird at 225 for about 7 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StayHomeDad"
},
"reviewBody": "Ok...so every single year I am the smoke master, I smoke a dynamite bird without fell.......but this year, I decided to try something different so I chose a recipe, and I'm glad it was this one.\nOhhhhhhh myyyyyyyy Gooooooooooood.\nThis bird went over like gang-busters.\nThe only thing I did was increase the recipe to service a 15 lb. turkey instead of for 10 lbs. I stuck by the recipe 100%. My grandmother-in-law said it was the best turkey she had ever had in her 89 years alive.\nMy parents even asked if I would do this again for next year, heck...even my to toddlers that hardly eat meat kept wanting more. Even I as the cook was more then imprest with how juicy and flavorful it was.\n10 out of 10 I'll do it again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Kono"
},
"reviewBody": "Turned out great...thanks for posting..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anne gabel"
},
"reviewBody": "oh, man...this is the best! I am not fond of turkey, so I thought I would throw our 14 pounder in the smoker. Hands down the best turkey ever- plenty of sweet smoky flavor, will do this again. one can of soda is enough, and put apple cider vinegar in water pan, using applewood chips. great recipe, thank you!! we now have a new Thanksgiving tradition!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Tobin"
},
"reviewBody": "A turkey really has nothing (no fat or connective tissue) that benefits from low and slow cooking. Low and slow is very likely to lead to a dry bird. Cook at oven temp (325 -350) on your smoker and still use the hickory chips or chunks for smoking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Andy Bastyr"
},
"reviewBody": "I make this same recipe every year. It is most definitely a crowd pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michael Richardson"
},
"reviewBody": "Dam good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mrFREEDO"
},
"reviewBody": "Good starter recipe for smoking. Here is some helpful tips to make it even better and easier: brine the turkey overnight to up to 24 hours. Cook at 275-300 for crisper skin and to cut the time in half. Higher temperature will not dry it out with a brine at all and the brine makes it tastier and cook faster! If it gets a little dark put tin foil over top lightly. 10-12 lb. turkey will cook very evenly and be done in 3 hours. I do cherry and a little hickory for smoke. Disposable cajun injectors from the grocery stores are good too! Happy Turkey Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mac"
},
"reviewBody": "!st. Never choose a bird less than 13lbs as the waste/meat ratio is too high.\n2nd. Brine the bird overnight, up to 24 hrs.\n3rd. Salt the buttered outside and cavity liberally but nothing else as the smoke must have free access to generate the greatest effect. Only place the bird on the grate of the smoker and not in an aluminum tray that would hinder the smokes ability to surround it.\n4th. Once the bird is in the smoker, never open it to baste as the amount of time it takes the smoker to recover only adds to the cooking time and diminishes the point of smoking in the first place.\n5th. Some flavoring can be achieved by adding some to the drip pan below the grate the bird rests on or by using different woods such as apple wood.\nAnd lastly, if you have a very large bird, I've smoked a 22 lb bird, finish it off in your oven for an hour. this will not dry out the bird or undo the smokiness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael P Hnatiuk"
},
"reviewBody": "Used homemade applesauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joe"
},
"reviewBody": "Very moist, delicious flavor! I used double the garlic!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ryan Walsh"
},
"reviewBody": "Cook time in the recipe should be reviewed and possibly updated; dropped a star for that.\n\nWe have not cut it up yet but it smells wonderful! I have done some pretty large pieces of meat in the past but I have never done a bird on the smoker yet. I followed this thing to the T and the bird was done in less than 7 hours. Instructions call for a 10lb bird at 225 for 10 hours. My 13lb bird was done just under 7 hours and i did a pretty good job maintaining temp between 190 and 240.\n\nlessons learned! birds smoke quicker than pigs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Betty Thompson Thomas"
},
"reviewBody": "I wanted to try somethimg unique for a good Friday party. Everyone loved it! I followed the recipe exactly, except it took 8 hours in the smoker. Would definitely recommend and make again. Five stars all the way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul von Conrad"
},
"reviewBody": "This is the first Turkey I've ever cooked and I used my Traeger Electric Pellet smoker with Cherrywood pellets to do the job. I followed the exact recipe, however I altered the temperatures a bit and I also left it in a saltwater brine overnight. Everyone I talked to said it shouldn't take 10 hours to cook a 10lb Turkey. On Traeger's website, I found a recipe for Smoked Turkey and followed their instructions instead:\n\nLeave Grill on \"Smoke\" and pace Turkey on the grill and smoke for 2.5 - 3 hours.\nSwitch setting to 350 degrees F and cook for 3.5 to 4 hours, or until internal temp reaches approx 170 degrees F.\n\nEveryone loved the Turkey and said it was the best they've had. The Pink \"Smoke Ring\" Was perfectly visible on the outside of the meat, just under the skin.\nI took it out when the chicken breast read 170 degrees and the Thigh read 180 degrees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MISSHALYE"
},
"reviewBody": "It was absolutely delicious and a very big hit! Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paul"
},
"reviewBody": "This recipe came out great! However, likely due to my limitations, a 14-lb bird was done in just over 6 hours instead of the 10+ as expected. The heat of the smoker stayed in the proper range, but I neglected to place the water pan inside before putting the turkey in. Also, I had the turkey on the lower rack of the smoker instead of the upper, so this may have reduced the cooking time. Because I monitored it, I didn't end up with a dusty bird, and all who ate it provided positive comments. I did not add wood to the smoker, only charcoal, and slightly increased the amount of garlic I rubbed on the outside. The meat quite literally fell off the bone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gabriel Schmidt"
},
"reviewBody": "Boom! The completed was ate by our family. Leftover were scraps to make about 1 sandwich that evening. Based on the results we will be cooking our future with this recipe. #mmmm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LaMoyne and Judy"
},
"reviewBody": "OMG! This was our first official homemade smoked turkey and it was amazing. I used my new Weber Smokey Mountain Smoker and it made the cooking easy. I had planned for the full 10 hours but it ended up only needing 8. I used a combination of hickory and apple wood for the smoke. \n\nI have tried other recipes and have been disappointed. This is a keeper! This will become our family thanksgiving tradition along with our homemade pies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "James F"
},
"reviewBody": "The Recipe was easy to follow. I used a Kamado Joe Smoker and mixed Hickory and Apple wood. I also Brined the turkey for 18 hours prior to smoking it. It came out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TD Smyers"
},
"reviewBody": "I smoked three turkeys using this recipe. A 10 lb bird for my office pot-luck was my test subject, and it was so well received I used the same recipe on a 12 lb bird for my family on Thanksgiving, then a 16.5 lb bird later that weekend because my wife liked it so much!\n... when was the last time someone in your family wanted ANOTHER turkey after Thanksgiving? Exactly.\nThe recipe doesn't get specific about preparing the brine, it just tells you to add the ingredients to the cavity. I mixed the dry ingredients in a large bowl, then poured in the coke and stirred to combine. Then I melted the butter in the microwave and stirred it into the coke mix, which caused the butter to congeal into small pellets that would melt while smoking to moisten the bird. Finally, I added the onion and apple quarters to the mix and poured the whole thing into the seasoned turkey, making sure to pack in the onions and apples.\nI used pecan wood first, then pecan and cherry on the next two. That was pretty much the only thing I changed.\nI cooked the birds to a 165 breast temperature, then let them rest for 20 - 40 minutes before carving, and they all came out PERFECT. With my Cookshack electric smoker set to 230, the 10 lb bird took 7 1/2 hours to reach that temperature and the 12 lb bird took 9 hours. For the larger bird, I ramped the temp up to 250 which, surprisingly, dropped the cooking time all the way to 6 1/2 hours. I left the drumsticks untied and cut the skin between them and the body, allowi"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephen Epton"
},
"reviewBody": "Turned out amazing. This was my first smoked turkey, and only second time using a smoker. I used a dry rub that I have used on ribs and cooked it for close to 5 hours. Everyone loved it. This was supposed to be an experimental attempt, but after our main turkey that we had planned on roasting smelled like rotten eggs after opening it, this one turned into the main attraction. It was a huge hit!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "flyhyer"
},
"reviewBody": "This turkey turned out great. I had to explain 3 different times how I made it. One of my top 2 turkeys I’ve ever tasted."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "James Clay"
},
"reviewBody": "If you want sawdust for Thanksgiving then follow these directions. 10 hours!! 180 degrees internal!!! That’s nuts. I smoke mine at 300 to 325 to a temp of 158 in the breast. Take it off wrap it in foil and let it sit for 45 min. That smoke takes about 3 hours for a 13 pound bird. You can figure about 15 min per lb with my directions. I do it to 158 because the bird continues to cook when you take it off and wrap it. It does not benefit you to do a turkey low and slow."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Remko Brouerius"
},
"reviewBody": "One of the tastiest, moistest turkeys we've ever had."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kellymorse1"
},
"reviewBody": "Excellent recipe! Wet brine day before, and followed this recipe. I have Masterbuilt smoker, which couldn't be easier. \nCan't imagine cooking our heritage turkeys any other way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee"
},
"reviewBody": "Awesome recipe. Everyone said it was very good and juicy. Will make it again and again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JAKARTZ"
},
"reviewBody": "I tried this for the first time for Thanksgiving and didn't stray from the original recipe. I thoroughly enjoyed it and my guests couldn't stop raving about how juicy, tender, and flavorful it was. I'll definitely make this again next year!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joe Ruble"
},
"reviewBody": "I made this for Thanksgiving and everyone couldn't stop raving about it. The only thing I did differently was to brine the turkey the night before. The one downside was the drippings were quite salty due to the rub and we couldn't use them for gravy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sarahrose"
},
"reviewBody": "Great flavor and it keeps the skin beautiful. I wouldn't mind a little more seasoning on the outside... maybe some Natures Seasoning or a little of a base chicken rub."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Suellen"
},
"reviewBody": "Used a wild turkey as I do most years. I was expecting the turkey to be moister with the cola than other liquids I have tried, will go back to using premade turkey broth next year."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Devin Roberts"
},
"reviewBody": "17lb Turkey, followed the recipe to a tee. 11 hours at 225. Guests were pleased, I thought it was ok. Some parts were very juicy, others very dry. I think next time I may try injecting it before smoking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nelson"
},
"reviewBody": "I have to say that I was a bit skeptical about this method, mainly due to the ten hours of cooking. I’m from Ohio, so the ambient temperature outside was in the 30-40 F. We brined the turkey for 24 hours, but apart from that we followed the instructions to the letter and the family reviews couldn’t have been better. The meat was really tender, even in the thickest parts and the nice smoke taste was to die for. Since the recipe called for Cola, I imagined it was looking to add a slight hint of sweetness to the meat, so I used Cherry Wood for my smoke. Definitely the best all round Turkey I’ve ever made and tasted, a true winner and a keeper for every Thanksgiving dinner moving forward."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jolie"
},
"reviewBody": "I found this recipe online, as we became in charge of the Thanksgiving Turkey. I bought all the ingredients and went to work. He prepped the birds (1 for family and 1 for leftovers) and smoked it. We have a LP smoker and 2 - 12lbish birds. it took about 6-7 hours for the first bird and 8-9 for the second. It was done a lot sooner than we had anticipated. We devoured the wings of the first bird instantly, and ate the leg. I don't like poultry much, and this was AMAZING!. \nWe put the other bird in the oven to reheat it for the Thanksgiving, and everyone raved about how awesome it was! I really don't like Turkey, and Love Ham. This Turkey was better than my mom's awesome Ham. For me to eat Turkey over Ham is amazing. For me to eat more than a couple bites is amazing. The gravy made from the drippings was really really good. Amazing Amazing Amazing!!!! \n\nNever have to look at Turkey Recipes again!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tyler Murphy"
},
"reviewBody": "First time making a turkey and I aced it with this one. I only had to make a slight adaptation to suit my smoker. The smoker I used is a Char-Broil, \"The Big Easy\". Seeing as how you have to orientate the turkey neck up, I put a can of coke standing upright on the rack, lowered the turkey on top of it, stuffed the neck with apples and onions alternating between them, then dumped the spice on top with a funnel. After about 2hrs, I soaked up the drippings and poured them down the neck, repeated at about 3.5 hours, took it out at 4.5, then slow cooked for 1 more hour to finish it up. On this 13lb turkey, the wings and legs began to fall off under their own weight and the meat is smoked perfectly and very moist. Thank You for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie Palmer McCreary"
},
"reviewBody": "Was a perfect turkey! Here's how I made mine. I soaked mine for 2 days using the brine recipe by SUDEMERS:\n\nhttp://allrecipes.com/recipe/85839/out-of-this-world-turkey-brine made the recipe exactly as written. I smoked My 10lb turkey in an electric smoker on 250 and it reached internal temp of 165 breast/ 180 thigh within 6 hours, which was 4 hours sooner than our lunch party! So I turned temp down to 200 and continued to baste every hour. It was so delicious and juicy. Will definitely make it again. Only, next time, I will probably use 1 can of coke instead of 2. It was slightly too sweet for my taste. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "C.j. Tipps"
},
"reviewBody": "I am going to attempt this for Thanksgiving this year. My question is the can of soda do I put the whole can inside open or just pour it in?? Any help would be great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katie Davenport"
},
"reviewBody": "Our smoker did not stay hot enough, so after 8 hours, we finished it in the oven. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Frank"
},
"reviewBody": "Just smoked this 13lb. turkey. Was wonderful. The copper coloring alone was worthy of a photograph in a prized cookbook. Very juicy. Stopped smoking after 8 hrs. Very nice smokiness makes it better than oven baked. Used mesquite wood chips. Will do again! Drippings are so good you'll want to drink them up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty Mahannah"
},
"reviewBody": "This is the best Turkey we have ever had. I followed the recipe, making minor changes. We used one can of cola for a 13lb bird and I added garlic and rosemary under the skin of the breast. We made this for thanksgiving and chose it again for Christmas dinner. We are using an electric smoker with applewood chips and we injected enough spices and butter to make Paula Dean blush. Amazing dish all around."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "victor duffey"
},
"reviewBody": "Perfect! Now i have people wanting me to cook turkeys for them and even people saying i could sell them and make lots of money lol! The best thing that i couldve done was find this recipe, everything is perfect! !!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ditchrider"
},
"reviewBody": "GR8. Got a Traeger smoker / grill for my Birthday - Retirement in October and tried two times before Thanksgiving adjusting the recipe each time. The first was a 10 pound, too much bone and not a lot of meat. Tasted okay but a little too much Spice. The second was a 15 pound that was better but found a couple of things that I felt needing improvement. The Thanksgiving day bird was 23 pounds. Use a Dry Brine (Kosher salt, Rubbed Sage, dry thyme, and Rosemary). Clean and stuff the inside with Onion, Carrot, and Celery, put the dry brine in and sowed up. \nAfter starting the Traeger put the turkey on a rack in a roaster pan and place on the grate. Add about 3 cups stock and smoke for 1 to 4 hours depending on the size. Rotate and baste every hour. Tent when it's had enough smoke, turn the temp setting to 300 and use an internal thermometer placed in a thigh inside not touching bone. Continue to rotate 180 and baste every hour until the internal thermometer reads 160, check the internal thermometer of the other thigh and if not up to 160 leave on the grill until it reaches 160. \nWhen don carefully transfer to a cutting board and rest for 20 to 30 minutes before cutting.\nStarted the 23 pound at about 4 AM and it was on the table about 1 PM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "etcustom"
},
"reviewBody": "Family isn't big on turkey...But they ate all of it and want more for Christmas! Said its the best Turkey EVER!! Thanks for the great, easy recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brian"
},
"reviewBody": "Absolutely fabulous. Made a 13 pound turkey in electric smoker. Set at 225 and smoked for about 3 hours then closed up in foil. put back in for another 6. perfectly moist and just the right amount of smoke. Have already been requested for a repeat!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Lee Furgerson"
},
"reviewBody": "Best Turkey ever made hands down"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MELLESAN"
},
"reviewBody": "We got a smoker this year and I was determined to try to smoke a turkey for the first time this Thanksgiving. Not wanting to be responsible for potentially ruining dinner, I decided to make two turkeys. This was hands down the best turkey we've ever had. I used the brown sugar brine recipe (even with a butterball), and with a 14lb turkey it took about 6 hrs. I'm not even sure we'll wait until Christmas to try making this again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GRILLINWITHGAIL"
},
"reviewBody": "First time I smoked a turkey but I love my smoker...followed the directions as written and it turned out PERFECT!!! Best turkey I have ever made and one of the best I have ever eatin' ... I did brine the turkey the night before. Not sure how much of a difference that made, however it was very juicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigern2"
},
"reviewBody": "One of my best Thanksgiving Turkey used cherry wood in my smoker even my wife who fought me to make the turkey this year shut up and and ate it and said how great and moist it turned out, and the smoke was just right on it. Thank you for sharing this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "David Dragoo"
},
"reviewBody": "I used the brine from the Neely's based on another reviewer's recommendation. Otherwise, followed the recipe exactly. I had a 13 pound bird and cooked it on an electric smoker set to 240 degrees, took about 7 hours. Used apple wood chips for the smoke.\n\nThe turkey was quite juicy, as it usually is after smoking it. Most of the family really liked it but it was a bit too sweet for my taste. I think if I were planning to put BBQ sauce on it, then this recipe would be perfect. In fact, I do plan to try this tomorrow with some leftovers. But for eating with other traditional side dishes, I may like it better with apple juice or beer instead of cola."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DOC"
},
"reviewBody": "Great recipe. I first tried this year's ago with great success and everyone loved it. Over the years I've tweaked the recipe and also do a 48hr brine. Thanks to this recipe I'm now expected to make it every Thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Greg McDonald"
},
"reviewBody": "11/29/19 update. Smoked 20# bird for 2 hours at 180, then turned up heat to 250 and put in pan. Breast was 84. Reached 160 in 5 more hours (total of 7). Put brakes on the heat, let it coast for 3.5 hours more. Breast was very dry. Not sure why it cooked so fast...OAT was 40\n\nUsed Out of the World Turkey Brine for a day and a half. Smoked a 14# fresh bird in a Trager Pellet grill at 250 for 10 hours. Started basting after 2 hours and continued basting every hour until done.\n\nGreat smokey taste, juicy and flavorful. Used Applewood for smoking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eric Voyer"
},
"reviewBody": "Best Turkey ever. I brined the turkey overnight, and used the brine for basting up until about halfway through (didn't want the meat to be too salty). Then I switched to beer, continuing to baste every hour. I used a turkey stand, so the bird would cook upright. I smoked for about 8 hours usingn applewood, then for the last 2 hours, I put the turkey breast side down in a pan.\nI cooked it until it was 165 degrees in the breast, then let it rest for 15 minutes.\nMy only regret was that I did not tie the wings to the body, and the smoke passing over the wings made that mead slightly overdone. But still better than roasting. \nI was surprised that the skin was brown and crispy - my 13 year old raved about the white meat and we all went back for seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Korrine Potter"
},
"reviewBody": "This was our first time using our smoker for a turkey. The turkey was fantastic! We cooked for 2 thanksgivings and each time the bird was delicious, fell off the bone and had the smoke taste throughout."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "skallay"
},
"reviewBody": "Followed everything as noted in instructions. I used a 10lb turkey breast instead and it only needed 7 hours at 250 degrees. I ran out of apple wood chips and decided to use grape vines. This worked out perfectly!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Staci Griffin"
},
"reviewBody": "This recipe is awesome!!! Cant wait till tomorrow to share the finish product!!! I also used apple wood sooo tasty!!!!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/16984/turkey-in-a-smoker/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/975/holidays-and-events/thanksgiving/turkey/",
"name": "Turkey"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16408/holidays-and-events/thanksgiving/turkey/smoked/",
"name": "Smoked"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/16984/turkey-in-a-smoker/",
"name": "Turkey in a Smoker"
}
}
]
}
}
, "about": [
]
}
]