				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkey Tetrazzini a la Stouffer&#39;s"
,"datePublished": "2019-04-02T03:00:44.000-04:00"
,"dateModified": "2022-01-04T12:39:14.000-05:00"
,"author": [
{"@type": "Person"
,"name": "margieatk"
,"url": "https://www.allrecipes.com/cook/margieatk"
}
]
,"description": "Leftover cooked turkey never had it so good as when combined with angel hair pasta and mushrooms in a delicate cream sauce flavored with sherry and baked in a casserole."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/ePAyLnXpSZ_DBafzWNgZ41Q0SFg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1056677-d7197250534d46adb4df5b76b902b4b5.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkey Tetrazzini a la Stouffer&#39;s"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "91"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "457 kcal"
,"carbohydrateContent": "34 g"
,"cholesterolContent": "114 mg"
,"fiberContent": "2 g"
,"proteinContent": "21 g"
,"saturatedFatContent": "16 g"
,"sodiumContent": "678 mg"
,"sugarContent": "2 g"
,"fatContent": "27 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 teaspoons butter",
"0.25 cup butter, divided",
"1 cup chopped celery",
"1 (8 ounce) package sliced fresh mushrooms",
"0.5 cup all-purpose flour",
"2.6666669845581 cups chicken broth",
"1 cup heavy whipping cream",
"0.25 cup sherry wine",
"1 teaspoon salt",
"0.25 teaspoon white pepper",
"0.5 (12 ounce) package angel hair pasta",
"2 cups diced cooked turkey",
"0.5 cup panko bread crumbs" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Grease a casserole dish with 2 teaspoons of butter."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of lightly salted water to a boil. Cook angel hair in boiling water, occasionally stirring until cooked through but firm to the bite, 4 to 5 minutes. Drain."
} ,{
"@type": "HowToStep"
,"text": "Melt 2 tablespoons butter in a large pot over medium heat; cook and stir celery until it begins to soften, 1 minute. Stir mushrooms into celery; cook and stir until mushrooms are softened, 3 minutes more."
} ,{
"@type": "HowToStep"
,"text": "Remove vegetables from skillet; melt remaining 2 tablespoons butter and whisk flour into hot butter to make a paste. Slowly whisk chicken broth and bring to a simmer; reduce heat to low and cook, constantly whisking, until sauce is thickened. Mix in cream, sherry, salt, and white pepper."
} ,{
"@type": "HowToStep"
,"text": "Fold turkey, celery, and mushrooms into sauce; mix in angel hair pasta. Transfer mixture to the prepared casserole dish and sprinkle panko crumbs on top."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until sauce is bubbling and crumb topping has browned, about 30 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "damdifino"
},
"reviewBody": "I've been craving Stouffer's turkey tetrazinni ever since my store stopped carrying it a couple of years ago. I followed this recipe exactly (unusual for me) and it turned out perfect! I think the sherry is the key."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this recipe! I added half a chopped onion with the celery but otherwise followed the recipe and it turned out fantastic. The sherry is key the Stouffer's flavor so consider buying a bottle even if you don't normally keep it around. It's an under-appreciated flavor that's unfortunately fallen out of favor since mid-century times when it was a staple. Buy a good bottle and also enjoy as an aperitif. Good sherry will keep for quite a while."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Barb A."
},
"reviewBody": "This was a very tasty recipe and a good way to use up leftover turkey. After reading other reviews, I replaced the 1 cup celery with 1/2 cup green onion and also added 1 minced garlic clove. The rest of the recipe I more or less followed as indicated, with the exception of replacing the Angel Hair pasta with Spaghetti, and adding 1/2 cup of freshly grated parmesan to the top with the panco crumbs. I cooked the casserole at 350 F for 22 minutes (which helped to brown the top). This was popular and a definite make against with the adaptations."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "First I added some grated Peccorino Romano cheese to the top instead of the Panko. Much more flavor and it browns the top better. And from eating Stouffers Turkey Tetrazzini, I think they add a pinch of nutmeg to the sauce, so I did that also.\nCame out wonderful !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Bird"
},
"reviewBody": "Spot on! This particular frozen meal has been a favorite of mine for decades. I tried so many other recipes and this one is my go to now. *This makes a great soup as well! I used long grain rice instead of pasta, and a 4 cups of water with the chicken broth. Simmered 30 minutes, then added the cream and sherry. Simmered 15 more minutes and served. It freezes beautifully, too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kaymac27"
},
"reviewBody": "I changed this up a bit. I cut the recipe in half, since there's only two of us, but added a full cup of veggies. I added some diced carrots and onions to the mix - altogether about a cup. I also sauteed the veg with a mix of 1 tbsp butter and 1/2 tbsp of olive oil. I used 2% milk, and it worked out just fine. I'd use almond milk next time and less butter to make it even healthier. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pacemueller"
},
"reviewBody": "Thanks for sharing the recipe. Everyone liked it. I didn’t have cream or sherry so substituted with milk and some leftover Champaign and it came out perfect! I did add 2/3 cup powdered mozzarella and about a tablespoon of chopped onion to the sauce, a tablespoon of melted butter to the bread crumbs and sprinkled the top with mozzarella as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angie Lindsey"
},
"reviewBody": "This was AWESOME!! I took others suggestions and added onion and garlic to the celery when sautéing. I also added some kale from the garden. I used fat free evaporated milk instead of cream and added ground hot pepper to the sauce. Delish!! Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duck-Duck"
},
"reviewBody": "Turkey Tetrazzini a la Stouffers by Margieatk. Broth needs to be thicker before adding cream &amp; sherry. 2T cornstarch? Added pimiento."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BOOKMARKER"
},
"reviewBody": "8.8.20 ... https://www.allrecipes.com/recipe/232097/turkey-tetrazzini-a-la-stouffers/ ... I doubted this would feed six. Two ounces pasta per person? I one-&amp;-a-half'd it &amp; well, we now have a lot; but everyone liked it. Yes, everyone! I wouldn't mind some pimiento in there for color. The broth needs to be thicker before adding the cream &amp; sherry. I noticed it, but nooooo, this is the time I chose to follow the recipe. Sheesh, as SuzyQ1 would say. I slipped some parmesan in before the crumbs. Next time, I'll add 2T cornstarch &amp; go for linguine; maybe steamed broccoli around the edges. TURKEY TETRAZZINI A LA STOUFFERS by MargieatK"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lsalafia"
},
"reviewBody": "A wonderful way to use left over roast turkey or chicken. It's quick and easy with tons of flavor. Substitute your favorite wine for the cherry, it's a lovely dinner for the family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "carma"
},
"reviewBody": "I think it a great recipe. I added onion and fresh garlic to the celery and used half and half instead because I had it. Topped with parm and panko. \nDelish. Changes made for our personal tastes but the recipe is a terrific base."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ivin Mendiola"
},
"reviewBody": "i made it but I wish it was a little creamier. Also, my bread crumbs did not brown like I wanted them too even though I turned the broiler on after I started. Overall, it was delicious. I would make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "timml622"
},
"reviewBody": "I used a generous splash of lemon juice instead of sherry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LoriS"
},
"reviewBody": "Not ready enough for our taste, sauce didn’t stick to the noodles. Will use my old stand by recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ed Moscovitch"
},
"reviewBody": "To fit my low-carb diet, I used lentil pasta instead of wheat and I ground up some low-carb bread that I had made myself to replace the crumbs. My wife and I enjoyed it very mu h and I would definitely make it again (and consider it for chicken as well as turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Colorado Mommy of 2"
},
"reviewBody": "LOVE it, fresh mushrooms best. Seasoned panko bread crumbs are the best"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maralee"
},
"reviewBody": "I am glad I added onions or it wouldn't have had any flavor. It was much better the next day with parm and salt and pepper on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "Made this for a pot luck dinner and it was a big hit!\nI enjoyed the addition of the sherry. Gave it an added boost in flavor. \nI choose this particular recipe because I survived my senior year in college 45 years ago thanks to Stouffers Turkey tetrazzini!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MissYankee"
},
"reviewBody": "I have a slow cooker chicken tetrazzini recipe that is my absolute favorite recipe...but this one topped it. They are similar but I absolutely love the taste of this recipe, my boyfriend too! Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Liana"
},
"reviewBody": "This was very good, although I thought it could have used a little extra salt. Everyone loved it, though. I added about 1/2 sauteed onion and extra celery. I used Zinfandel instead of Sherry. I did end up putting it under the broiler for a few minutes to get it nice and brown. I will make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MB Robb"
},
"reviewBody": "This was a great recipe to have when looking for something to do with leftover holiday turkey. I admit I modified it a bit because I didn't have all the ingredients. I used pasta twirls instead of angel hair and onions instead of celery, cause that's what I had on hand. My only criticism is that the sauce came out a bit salty. Even using low sodium broth, I don't think salt needed to be added to it. I'd also recommend adding some parmesan to the sauce. Overall, it was quite good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mertz1827"
},
"reviewBody": "Next time I’d add more turkey and ib added more butter to the roux and it was a little soupy so I’ll stay closer to the recipe. Lastly I had leftover cornbread dressing so I topped with that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MarkW"
},
"reviewBody": "This turned out fantastic. The only change was I added a TBS of grated Reggiano Parmesan"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Henderson"
},
"reviewBody": "As a fan of Stouffers Turkey Tetrazzini I can say this is a very good copy. A very good recipe that we enjoyed. Will make again!\nWe did add some onion and a little Parmesan. All in all a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cheryl Brenner Hoffman"
},
"reviewBody": "Made this dish for my son &amp; family. The only thing I did different is add Italian bread crumbs, and additional mushrooms. Turned out perfect. Had enough for them to take for lunch the following day. Next time, I'll make it with chicken. I'll definitely made this again. it was a hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LVW"
},
"reviewBody": "This has always been my favorite Stouffer's dish to buy. I did not make any changes to the recipe and it is on point. It is delicious!! I was so pleased with how it came out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rosebudpetunia"
},
"reviewBody": "This was delicious, and exactly like the store brand..\nI doubled the recipe for I have a large Italian family..\nThey loved it.. Next time I will use chicken.. I'm not a fan of Turkey.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "redbeer625"
},
"reviewBody": "I added Italian herb &amp; cheese blend from Mccormick on the top. Used red wine instead of sherry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "irisheyes_14"
},
"reviewBody": "I made this last night using leftover Thanksgiving turkey and it turned out quite well! I did add onion and garlic when cooking the celery. But, other than that it was as written. Tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev"
},
"reviewBody": "This was delicious! My husband absolutely loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Anne Evans Morris"
},
"reviewBody": "Rich and filling. Easy to make. Family liked it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alanna523"
},
"reviewBody": "very rich and tasty. I did add minced garlic to sautéed celery and mushrooms, some onion powder to cream sauce and some grated parmesan to breadcrumb topping. did not butter the bread crumbs, seemed fine without. End of turkey leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chandra Costello"
},
"reviewBody": "I will definitely make this again! It came out great. I did add 1 cup of grated Parmesan cheese to the mixture in use garlic salt and place a regular salt. I also added a little garlic powder and onion powder, maybe a teaspoon or so each. I seasoned the plain Panko bread crumbs a little and sprinkled some Parmesan on top. Very minor changes as the recipe was so good on its own. I might try sautéing a little fresh onion in the beginning with the celery and mushroom mixture next time just to see how that compares but it did not seem to need it this time. I think your preference will just depend on your taste. However, I would not use very much onion as you do not want to overpower this with it. Just a little. Great recipe. Thank you!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DrSwenson"
},
"reviewBody": "I make according to the recipe every time and my entire family loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Iris Sims"
},
"reviewBody": "Very good just needed a little more flavor added thyme, poultry seasoning &amp; pinch of cayenne"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lana Beard Pier"
},
"reviewBody": "Like one other reviewer, the butter/flour ratio is off for me. My roux was too dry &amp; thick but I proceeded with adding the liquid. I ended up straining the sauce through a wire sieve to remove the lumps. Other than that one annoyance, it was DELICIOUS! I too substituted half/half for the heavy whipping cream only because I didn't want to pay that much for the half/half. Lol. But it's so yummy, I'm a straight up hog with this dish-"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mzmay"
},
"reviewBody": "I doubled this recipe to get a freezer meal. Maybe it's because I like a deeper casserole, but I got one 9x13 and one 8x8 pan. For sherry, I found an on-line substitution that called for mixing white wine and brown sugar. I think that sub was ok, but was a tad too much sherry for the dish. I would make this again with either less sherry, or all chicken stock, and maybe add peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ruby481"
},
"reviewBody": "I made as written except eyeballed the amount of pasta so it wouldn't be too dry, as others warned. I liked it and one son loved it, husband and other son thought it was too bland. I will make again but will try with more celery, add onion and maybe almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber in Seattle "
},
"reviewBody": "Yay!! Thank you for posting this! And thanks to other reviewers for pointing out it's HALF a box of pasta, as I nearly dumped a whole one in. I had serious doubts that so little angel hair would feed us portion-wise (2 adults &amp; a toddler), but it did AND there were leftovers. I'm the only one that had ever eaten the Stouffers version, but I can testify it is spot-on. Man &amp; child inhaled it happily (!), will make again for sure. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blazermom"
},
"reviewBody": "This was delicious! Followed recipe as stated but used a large can of mushrooms"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Marie"
},
"reviewBody": "I added onions because I love onions in everything. Also, I sprinkled Monterey Jack on top since, apparently, cheese addiction is a real thing. I'll make this again. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Randy Knight Shandle"
},
"reviewBody": "I made this just as recipe said , I thought it was very good but it was somewhat dry the next day so I added some chicken broth and it was fine. It does taste like Stouffers....next time I will add melted butter to panko for the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NEERONDOGS"
},
"reviewBody": "This is the same taste as the Stouffer's recipe. The only change I made was to add grated Parmesean cheese. No more turkey hanging around in the fridge after Thanksgiving anymore. The whole family loved it. Thanks for posting this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura"
},
"reviewBody": "Okay, what to do with leftover Thanksgiving turkey that my kids didn't even like the first time around. This is the recipe for that! Perfect in every way. I changed it only slightly and I'm sure it would have been just as good without my changes. I sautéed chopped onion with the celery and added a small can of peas to the whole thing. I didn't have panco breadcrumbs so used seasoned crumbs. Also instead of heavy cream I used \"regular\" cream. Excellent and everyone (picky teens and hubby) raved about it. That happens very seldom. Thanks for a great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Juleann"
},
"reviewBody": "Loved that basics of this recipe. To add a bit more flavor I added 1/2 of a diced onion to the celery/mushrooms while sautéing, substituted sour cream for the heavy cream and added about 1/2c Parmesan cheese when tossing all the ingredients together. The added flavors were wonderful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lacey Clark"
},
"reviewBody": "Tastes exactly like the Stouffer's version. I love the frozen one, but hate picking out all of the celery (I loathe celery), so this was perfect to make....especially using leftover Thanksgiving turkey! My husband, who turned his nose up at the thought of tetrazzini, asked for seconds! He NEVER eats seconds!!! I didn't have sherry wine, so I used moscado instead. Everything else was made exactly as written. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Roni J"
},
"reviewBody": "Based on others' reviews, I made a few changes so I cannot really rate the original recipe since I didn't make it as is. I had to substitute white wine for the Sherri as I didn't have any, and added some pamesan cheese and about a tablespoon of dry mustard to the mixture before pouring it into the casserole dish. Also, since I had some French fried onions leftover from Thanksgiving that I wanted to use up, I crushed some of those and mixed with a little Panko bread crumb topping to make the 1/2 cup called for in the recipe. These little changes gave it just enough to elevate the flavors and everyone seemed to like the change!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marissa Kaitlin O'Connor"
},
"reviewBody": "I use black pepper but other then that it's exactly like Stouffers!! And more delicious too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mousielove"
},
"reviewBody": "I used my Fasta Pasta gadget tonight for the first time and it helped with the making of this recipe. I had to substitute milk for cream and white meat chicken for turkey. Next time, I will follow the recipe as written. Be sure you have all your ingredients at the ready, as this is a quick recipe to put together. Next time I might also spray a little Pam or other cooking spray on top of the Panko crumbs to help with the browning. I will, in future, break the pasta into smaller pieces rather than in half. Otherwise, this was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "clamarca"
},
"reviewBody": "Sorry...hit the wrong button before I finished. For a good Roux, you must have equal parts flour to butter. This recipe calls for much less butter than flour. I also love the flavor a good dry Sherry adds to foods...I add about 1/4 cup more than what the recipe calls for - and find a teaspoon of onion powder or flakes adds just the right little extra."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mjosiebellamy"
},
"reviewBody": "It does taste lik Stouffers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susan Bryan"
},
"reviewBody": "This recipe taste exactly the way I remember as a kid. My mother would use chicken instead. Chicken was always on hand. The Sherry was PERFECT. Thank you for the wonderful memory."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SusanB"
},
"reviewBody": "Today I am going to make this for the second time. The first time I made it exactly as written, and it was fantastic. Tasted just like Stouffer's which I love. I did butter the panko bread crumbs and got the crunch on top I like. I am looking forward to having this many more times. Thanks for this wonderful recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gail Goodlein Harris"
},
"reviewBody": "Delicious!!!! I had been looking for a recipe for Stouffer's Turkey Tetrazzini and I finally found it! I love their product but there was never enough in 1 package. Finally I could make enough of my own to satisfy my craving and have leftovers for a later date."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cooking diva"
},
"reviewBody": "I added more seasoning salt, and poultry seasoning and thyme. Also 3/4 cup parmesan cheese. Love the spice in the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "This was a big hit with kids and adults alike! Due to a dairy allergy in our family, I had to change it up a bit and was pleasantly surprised that the recipe still worked well and tasted great with dairy-free ingredients! I used olive oil to saute the vegetables, used 2 Tbsp Earth Balance spread to make the roux, and subbed 1 cup almond milk for the cup of heavy cream. Next time, I think I would \"butter\" the bread crumbs as other reviewers have suggested to get them to brown, and I would also add maybe 1/2 tsp garlic salt and 1/2 tsp parsley flakes to the mix for a little extra flavor. Thanks for giving us something new to do with Thanksgiving leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SKIAEEH123"
},
"reviewBody": "Made it just as instructed (minus the mushrooms, which we don't care for) and LOVE IT. Grew up on the Stouffers version, and this is about as close as one can come :) Even better, I can customize it now instead of picking out the mushrooms haha"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Judy Botts"
},
"reviewBody": "Like many others, I added Parmesan. Also when my roux wasn't thickening up I quickly added some additional flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kristin"
},
"reviewBody": "I used onions instead of celery...personal preference. Half and half instead of cream. I liked this and feel you could add so many things to it to your liking. Great recipe to use some of that left over turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "harrisam70"
},
"reviewBody": "Made this with leftover turkey from thanksgiving dinner. It tastes just like the Stouffer's dinner I remember from my kid days. It was always one of my favorites. This recipe is easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NorskieRandi"
},
"reviewBody": "Hubs and I are both fans of Stouffer's Turkey Tet (as we call it), but we learned to love this dish when we were working and ate in the company dining room...they had some amazing cooks there. It took me some time to realize that what was 'missing' per our 'taste memory' was a bit of diced green pepper. (I see no one has commented on having green pepper, so that must have the chef's personal addition.) I add that to Turkey Tet when I make it, and oh, yes, MUST have parm cheese in the sauce. This recipe gives me permanent measurements to use, and that is a HUGE help. Will be having this tonight, thanks to yesterday's leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Hubs and I are both fans of Stouffer's Turkey Tet (as we call it), but we learned to love this dish when we were working and ate in the company dining room...they had some amazing cooks there. It took me some time to realize that what was 'missing' per our 'taste memory' was a bit of diced green pepper. (I see no one has commented on having green pepper, so that must have the chef's personal addition.) I add that to Turkey Tet when I make it, and oh, yes, MUST have parm cheese in the sauce. This recipe gives me permanent measurements to use, and that is a HUGE help. Will be having this tonight, thanks to yesterday's leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JulieMarie"
},
"reviewBody": "This tastes just like Stouffer's! I have made it twice now, it's delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "VicE"
},
"reviewBody": "I LOVE Stouffer's (Turkey) Tetrazzini and, folks, this recipe is dead on, except I think that the bread crumbs need to be buttered. I too always thought that there was parm in this dish so pulled out a box from the freezer and learned that Stouffer's doesn't have it listed as an ingredient! Guess it tastes so rich because of the butter, cream, &amp; wine/sherry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Judi"
},
"reviewBody": "I'm sorry to say I found this rather bland. Maybe Stouffer's is; I've never had it. My mother always put parmesan in her tetrazzini, so I added some and that helped... I think onion or a bit of garlic added to the sauteed veggies would help. I will say that the sauce was the right consistency and the pasta/sauce ratio was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Stitt"
},
"reviewBody": "This is my second time preparing the recipe. THis time, I forgot heavy cream, so I used 2% milk instead. *Still* fantastic! Great comfort food recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rockerchic4God"
},
"reviewBody": "This was delicious and DEAD ON the \"original\", which I have always loved. I subbed lowfat ingredients for butter and heavy cream, and was still almost exactly as I remember it. My husband went back for seconds, which he usually doesn't do!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nora Blansett"
},
"reviewBody": "I absolutely loved it. I didn't have sherry and used white wine and it was still perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "Being a fan of the Stouffer's tetrazzini, I was quite excited to ru n across this recipe! In my opinion, this dish is company-worthy, and a real crowd pleaser. I will definitely make this again. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sheryl"
},
"reviewBody": "very good. I used leftover gravy that I thinned out using heavy cream, sherry and chicken broth. This is a great way to used all the leftovers from thanksgiving."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyof2"
},
"reviewBody": "great recipe, tasted so yummy. I had no sherry so I sub. with a red wine I had, turned out great. Looking forward to using this recipe again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Party Chef"
},
"reviewBody": "While making this my husband said \"I'm not going to like that\" He's now on his third helping. This would be equally good made with chicken and make sure you only use the 6 oz of pasta or you will have a dry casserole. I broke pasta in half for a smaller bite. I used buttered bread crumbs per personal preference. I also used a dry sherry. This is a very good and easy anytime dish. I also want to mention this says it's 6 servings. I believe it is 3 maybe 4. Thank You for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mjk"
},
"reviewBody": "Normally I hate it when people rate a recipe but makes something totally different but in this case, the sauce is what this dish is about. There is only one word that comes to mind for the sauce:AMAZING. I am rating it 5 stars for the sauce and what it did to my casserole. I did not make the sauce from scratch but used my leftover gravy and added cream and sherry, as well as leftover turkey. From there my dish was completely different but it was this sauce that made it so tantalizingly delicious that my husband called his brother (who is a bachelor for a week while his wife is with their daughter during surgery) and said, \"are you hungry? My wife made the most amazing leftovers. You always love her cooking anyway, so come by for leftover-leftovers. He showed up about an hour after we ate and ate some then took half of the leftovers home for several meals. He insisted on getting the recipe so I told him how to use the leftovers but wrote down the sauce recipe. We all loved it so much that even though we did not eat the casserole the way it was made, the sauce is what sets it apart from other leftover casseroles. Margietk, this sauce really made the meal. Thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "I've never had Stouffer's tetrazzini, but this one was FANTASTIC! The only change (mistake) I made was to use a whole pound of angel hair pasta, as it seemed like too much sauce for just 6oz. of pasta, and that didn't work out so great, lol. The pasta ended up dry, but it was still delicious. I didn't mind it b/c I like my pasta a bit drier, but hubby and the little guy wanted more sauce, so next time I will follow the recipe as is. This was very easy to make and had wonderful flavor...This is a definite keeper~YUM! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mama Cass"
},
"reviewBody": "I made this recipe to use up leftovers, so mine contained chicken instead of turkey. I have never eaten Stouffer's Turkey Tetrazzini and thus had no way to compare, but I was very surprised to see a tetrazzini recipe without parmesan cheese. The flavor was OK, but the dry bread crumbs on top were a flop. I would recommend using buttered bread crumbs or - even better - parmesan cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debbie Pease"
},
"reviewBody": "WOW!! Made this last night hoping it tasted like the Stouffer's tetrazzini. If I hadn't made it myself I would have sworn I was eating Stouffer's. I didn't change a thing and it was perfect. My whole family loved it. This is definitely a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clare Fisher"
},
"reviewBody": "I had had Turkey tetrazzini in the states seveal years ago and loved it. Made this for lunch today. had all the ingreds., bar turkey. But I did had 1/2 a cooked chook (chicken to you lot in the states)Grabbed a bowl, walked down to the bottom paddock and picked mushrooms. How good is that for freshness? This turned out soooooo!!!!! yummy. Thanks for the recipe Margieatk I will make this over and over again."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/232097/turkey-tetrazzini-a-la-stouffers/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
"name": "Pasta"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16815/main-dish/pasta/tetrazzini/",
"name": "Tetrazzini Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/232097/turkey-tetrazzini-a-la-stouffers/",
"name": "Turkey Tetrazzini a la Stouffer&#39;s"
}
}
]
}
}
, "about": [
]
}
]