				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkey Cabbage Rolls"
,"datePublished": "2020-06-18T23:12:30.000-04:00"
,"dateModified": "2022-09-20T15:38:16.000-04:00"
,"author": [
{"@type": "Person"
,"name": "DHANO923"
,"url": "https://www.allrecipes.com/cook/806588"
}
]
,"description": "This is my version of cabbage rolls using ground turkey instead of ground beef. This dish freezes well, so you can have half for dinner and freeze the other half for another time. Mashed potatoes make a good side dish."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/49ReWu1CJA1a8b5zw0aLiv7rbew=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6341603-turkey-cabbage-rolls-tamara-4x3-1-002f0fcd3519472ab428876ca6a1ee4a.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkey Cabbage Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.3",
"ratingCount": "140"
}
,"cookTime": "PT80M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "245 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "68 mg"
,"fiberContent": "4 g"
,"proteinContent": "14 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "660 mg"
,"sugarContent": "13 g"
,"fatContent": "9 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT25M"
,"recipeIngredient": [
"1 cup water",
"0.5 cup uncooked long grain white rice",
"16 large cabbage leaves",
"2 tablespoons olive oil",
"1 pound ground turkey",
"0.33333334326744 cup chopped onion",
"1 egg, beaten",
"1 (8 ounce) can tomato sauce",
"0.5 teaspoon salt",
"0.5 teaspoon ground black pepper",
"1 (8 ounce) can tomato sauce",
"0.66666668653488 (6 ounce) can tomato paste",
"1 cup water",
"3 tablespoons brown sugar",
"2 teaspoons lemon juice",
"1 teaspoon Worcestershire sauce",
"2 cups baby carrots, sliced lengthwise" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a pot, bring 1 cup water and rice to a boil. Reduce heat to low, cover and simmer for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13 inch casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of water to boil. Reduce heat to low and place cabbage leaves in pot. Simmer 4 to 5 minutes, until tender. Drain leaves and set aside."
} ,{
"@type": "HowToStep"
,"text": "Heat oil in a skillet over medium heat and cook turkey and onion until turkey is brown and onion is tender. Transfer turkey and onion to a bowl, cool slightly, and mix in cooked rice, egg and 1 can tomato sauce. Season with salt and pepper."
} ,{
"@type": "HowToStep"
,"text": "In a separate bowl, mix 1 can tomato sauce, tomato paste, water, brown sugar, lemon juice and Worcestershire sauce."
} ,{
"@type": "HowToStep"
,"text": "Scatter carrot slices evenly over bottom of casserole dish. Spread cabbage leaves on a flat surface and place about 2 tablespoons turkey mixture in the center of each leaf. Fold edges of leaves over filling, then roll into logs. Place cabbage rolls seam side down in dish over carrots. Pour sauce evenly over rolls."
} ,{
"@type": "HowToStep"
,"text": "Cover and bake 1 hour in the preheated oven. Remove cover during last 10 minutes of cook time. Allow to sit 5 minutes before serving."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT105M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Instead of carrots on bottom of baking dish I used a little Sauerkraut."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kayaerwil95"
},
"reviewBody": "Yumm"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rochelle"
},
"reviewBody": "The only difference I made to the recipe was to add 2 chopped garlic cloves, garlic powder, garlic salt, about a tsp of italian herbs, and then I only used 1/2 cup of water. My husband loved it and I will be adding this to my meal planning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shulli Hulli"
},
"reviewBody": "followed recipe as written. I thought it was a little bland and needed more of something. If I made it again, I would eliminate half of the water and put in a can of .. i don't know... maybe seasoned diced tomatoes.. The sauce was too watery. If you make this, put in 3/4 cup of water instead of the full cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babydoll1316"
},
"reviewBody": "This was excellent! I did not have brown rice (it’s been hard to find during this pandemic), so I substituted bulgur wheat! Very yummy. I will make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "demophobe"
},
"reviewBody": "easy to follow recipe...i'd make it again but i'd season the meat with more than just salt and pepper next time...just a personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ck5679"
},
"reviewBody": "Tips: if your stove is anything like mine, boiling a large pot of water takes TONS of time (way mor than pre heating the oven). Do this step first. Also: BUY 2 CANS TOMATO SAUCE. I don’t know why the recipe lists it twice separately - To me, that makes it more likely to miss on the shopping list. thankfully had an extra can in my pantry. Great flavor. Will try adding garlic next time to the sautéed turkey and onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TONIA OWENS"
},
"reviewBody": "Great recipe. I did add mushrooms to the filling but that's because I had some I needed to use. One of the reasons I like this type of recipe. You can add so many different things. I may try to use my slow cooker next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Works Gibson"
},
"reviewBody": "I was the lucky recipient of my grandson’s Bonnie Plants 3rd Grade Giant Cabbage and decided to try this recipe with the huge outer leaves. I made 4X the recipe, 3 for the freezer and one for dinner. It was very successful and our 8&amp;9 year old grandsons ate cooked cabbage without a problem. For a new food, I’d say it was a success! I used homemade beef bone broth instead of water to cook the rice, brown rice instead of white, added garlic and used a VERY large can of tomato sauce instead of sauce, tomato paste and water. I did the first two pans as rolls but sort of lasagna-layered the last two because I ran out of time. Didn’t add any mozzarella but may add to the frozen ones when reheating. Cheese will make it even more popular with the grandsons"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristen"
},
"reviewBody": "I had to be out for the day, so I thought that I would make this into a cabbage roll casserole in my slow cooker. I really didn't change much except I chopped the cabbage instead of rolling the ingredients in the leaves. I fried the turkey first, and put the rice into the slow cooker raw. I added about twice the water because of the uncooked rice. I cooked it about 6 hours on low. It was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lin Lizarraga"
},
"reviewBody": "These were wonderful. I would make a bit more sauce next time. Totally enjoyed by all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nadrew57"
},
"reviewBody": "There are not words. I'm telling you, just try them. You will not be sorry. These are fabulous."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "liz43230"
},
"reviewBody": "1/3 of the rice - salsa/ground beef/onions - cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "workingmom"
},
"reviewBody": "I made this just the way the recipe says, to mixed reviews. One kid loved it the other was m'eh. I like them because they are tasty and healthier than made with beef."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer"
},
"reviewBody": "I was really happy at how you couldn't even tell it was turkey. I love cabbage rolls and a healthy version scared me. I even used brown rice instead of the white, the sauce was great and I make a huge batch so I can freeze some"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kendal Stone Jacobson"
},
"reviewBody": "We really liked this dish. I've never made cabbage rolls before, so I wish I had paid attention to the tips about simmering the whole head of cabbage to make it easier to peel off the leaves. I tore up most of the outer leaves before trying that and it worked like a charm. I also added a clove of garlic to the turkey and onions as recommended by other reviewers and I think that really added some great flavor to the meat mixture. I will make this again, I will probably follow some of the other recommendations to make the sauce a little more spicy, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Steve"
},
"reviewBody": "Great healthy recipe - tastes great. Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Margie Boris"
},
"reviewBody": "I would reduce the. brown sugar to 2 tbsp. and add a dash of hot sauce to meat mixture. Great fall dinner."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mamacooks"
},
"reviewBody": "I replaced the rice with cauliflower, because we are trying to be carb-free. I also did half turkey, half beef. It was delicious! Will definitely make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stan"
},
"reviewBody": "This tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heather Stjernstrom"
},
"reviewBody": "I made this tonight. Even tho it takes a little longer to make than I would like, they turned out perfect! Delicious recipe! I substituted here and there to make mine a bit more healthy but great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Julie Tanner Howard"
},
"reviewBody": "I'm hot and sweaty after completing all the steps. Ha! The rolls kind of look like a hot mess in my casserole dish. I just did that best I could rolling them. \nTwo major things: why the heck hasn't this recipe been updated to explain a little bit more about the cabbage process. I bought a ginormous head of cabbage but it still wasn't enough bc you really need to use the larger out layers of the cabbage as the smaller leaves rip. \nI agree that the sauce seemed watery but I think cabbage rolls don't need a thick sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "OMJayyy"
},
"reviewBody": "Great recipe and a healthy alternative! Like others, I spiced it up a bit: added garlic, Italian seasoning, and paprika to the turkey mixture. Omitted the water in the sauce because I like it thick and forgot to add tomato paste so I just used 1 large jar of tomato sauce for the entire recipe. These had a great flavor and were slightly sweet, just how I like the cabbage rolls my mom makes. I only wish I'd seen the tip from commenters to boil the head of cabbage first before peeling the leaves!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kelli King"
},
"reviewBody": "A little more prep time than noted but great results. My mother would make these when we were younger and I loved them then."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "S k"
},
"reviewBody": "Very tasty! This dish was straightforward to make based off the directions given. The cabbage leaves held up well and the sauce was tasty. I added some mushrooms too. Five stars from me!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rowdie"
},
"reviewBody": "I made the cabbage rolls for dinner last night and they were Delicious. I did take the advice of other reviewers and added 2 cloves of garlic to the ground turkey and onions. I also cut the recipe down to four servings since it's just my husband and me. Didn't want to have too much temptation to over eat since we are trying to cut back on our portions. I used one 8 ounce can of tomato sauce for the filling and another 8 ounce can for pouring over the cabbage rolls. (I omitted the tomato paste and the water) The sauce was a tiny bit runny but it was easy to pour over the cooked rolls and had great flavor due to the brown sugar and Worcestershire sauce. I also used brown rice and an egg substitute. Definitely a keeper with a few tweaks to meet our dietary restrictions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KTRIBOLET"
},
"reviewBody": "These were a hit. I added a little garlic powder to the meat mixture and added 1/4 cup of water instead of the full amount to the sauce. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Alyssasmom"
},
"reviewBody": "My family thought this was very good and sucked it down. I thought the sauce was a little too sweet. If I make this recipe again I will only use half the brown sugar it calls for. Also if you make this be prepared for a sink full of dirty dishes! I used SO many dishes to make this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristina1322"
},
"reviewBody": "This was amazing! I cooked mine in the crockpot since I prefer recipes like this in crockpots but still amazing! =) even the picky eaters in my house enjoyed it! =)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "dnerajen"
},
"reviewBody": "Made these for dinner tonight for my boyfriend and I and they were awesome! I've been doing a low calorie diet and these were a perfect mix up from the chicken and veggies I have been doing every night. I did make a few changes after reading reviews. I put 2 tablespoons of minced garlic in with the turkey mix. And used to cans of tomato sauce instead of the paste. I also used brown rice instead of the white. I did however didn't really like how my cabbage wasn't very soft. Next time I think I might need to boil it longer. Overall, very good and will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "headpeon"
},
"reviewBody": "Used wild rice, not white. Didn't have full cabbage leaves (had already used half the head in another recipe), so overlapped half leaves, and it worked ok, though I had to spit the rolls with toothpicks. Omitted water and tomato sauce. Used comparable amount of salsa instead, as suggested by previous member. Used 1 tbsp of agave, not brown sugar. Added grated carrots, fresh minced parsley, and abt a half pkg of well drained/dried/chopped frozen spinach for additional nutrition &amp; color. Since I was using Himalayan pink salt, which comes in large crystals, I cut the amt of salt in half. Added about a tsp of lemon zest, too. Didn't simmer cabbage leaves before making rolls; I like a little texture to the dish. Have large skillet with lid, that can withstand 350 degree heat. Used it to brown turkey, etc, used it to mix sauce, then used it to cook the rolls in the oven. Cut down on the clean up significantly. Result = awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sunshine"
},
"reviewBody": "I made this tonight. I haven't made these since my Mom showed me how to do them when I was a kid. I told my family it was an experiment night and it was welcomed very well by them! :) \nI had 3lbs. of ground turkey on hand, so I used what was left over from the above mixture to prep for a casserole in a few days. I may use Panko or Italian breadcrumbs and cheese. It will pair great with a nice salad. It's in the freezer and ready to go for the next meal! :) \nThanks for sharing this recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hoss98"
},
"reviewBody": "well people i tryed this recipe an added to it, I am a southern cook,I also added ramps that isalso great an smoked gouda cheese, an cajun seasoning. it was great the best cabbage rolls i ever eat paula dean would love this lol"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "larry"
},
"reviewBody": "WOW....Tried it today and I must say I was most impressed as were my 2 teenagers. I just added some finely chopped red peppers and garlic to the onions. MMMMM...Into my recipe box you go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "KissMorticia"
},
"reviewBody": "Well I did it. They were yummy but far too much work for this new mom. :/ The ones I froze are still coming in handy! I don't know what to do about the cabbage leaves being so small. I felt like I only had 4-6 leaves that were big enough to wrap so the rest fell apart. I'll try again in a few years when the kids are in school ;)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BJ ANDERSON"
},
"reviewBody": "I made this as written and thought it a little bland the first night but it was much tastier the next day. It used most of 2 heads of cabbage which made 14 rolls. Next time, I'll add minced garlic to the chopped onions, more seasonings to the meat mixture and substitute Ketchup for 1/2 of the tomato sauce for more flavor. I want to thank the person who suggested cutting the core out of the cabbage before boiling it. The leaves just floated off the head as they were ready to remove and I picked them out of the water with rubber tongs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "alix"
},
"reviewBody": "My family loved this recipe, it was pretty delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Bren0725"
},
"reviewBody": "easy to make family loved it.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bren0725"
},
"reviewBody": "love them!! easy to make.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suomy"
},
"reviewBody": "Superb recipe, consumed with great enthusiasm, thank you!\n\nIt even withstood my using what I had, i.e. leftover roast turkey (chopped into small cubes of"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PattySoCa"
},
"reviewBody": "A good, relatively healthy recipe. First, I steamed the head of cabbage for about five minutes and had no problems rolling the leaves. I made a few, minor modifications as follows: I added a bit more onion and some garlic to turkey mixture. I also substituted an additional can of tomato sauce for the paste/water, and added a can (15 oz.) of drained, diced tomatoes. The next time I make this recipe, I will probably reduce (or maybe eliminate) the brown sugar, as the sauce was a bit sweet for my tatse. It's a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cara"
},
"reviewBody": "This is excellent! I've made it twice and both times added more rice, I think about 1 cup uncooked rice in total; I like this ratio of rice:meat much better. Used the rest of the head of cabbage to make soup!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "3girls2parents1chef"
},
"reviewBody": "I did not care for this recipe. I will not make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "utley813"
},
"reviewBody": "The sacue and stuffing mixture are also delicious on stuffed green peppers! This recipe is very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "yogamom"
},
"reviewBody": "This just did not work for me. The cabbage was too braised and tough for my kids to eat (or to trick them into eating). The tatse was okay. I did substitute tomato soup, and that worked fine (all I had on hand). Like other reviewers, I added more flavor (italian seasonings). I think this would be better wrapped in a crunchy romaine (uncooked) leaf... but then I love sushi spring rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "inChrist"
},
"reviewBody": "yummy but somehow my cabbage was overcooked"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BABYJIMMIE"
},
"reviewBody": "These are AWESOME! I used brown rice. I omitted the water and used one larger can of tomato sauce. To the beef, I added in garlic, freshly cracked black pepper and 2 T italian seasonings. Just taste the beef mixture before you stuff the leaves and add a little more italian seasonings if it tastes really bland. The suace on top will flavor the rolls as well. I made these the night before and popped them in the oven the next night. VERY good. I doubled the recipe for my neighbor and she raved about them toO! My 12 year old and 6 year old son both ate 2 rolls and wanted MORE!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "iLove2cook"
},
"reviewBody": "I followed the recipe to the letter, as I always do the first time aroundThe mixture of the wet ingredients gives the cabbage roll a \"blah\" kind of taste in my opinion. I will definitely not make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "anwalewski"
},
"reviewBody": "Easy and very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katherine Muterspaugh"
},
"reviewBody": "Surprisingly tasty! I had never cooked with cabbage before and had a lot of fun putting together these rolls. This was a lot of food (left overs for the two of us for a week) so next time I might cut the recipe in half so we don't get sick of it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paty"
},
"reviewBody": "I didn't have 2 8oz. cans of tomato sauce so I used the one I had in the meat mixture. I used a 28 oz. can of stewed tomato, tomato paste, ect. for the sauce over rools. This recipe has a wonderful flavor and is definitely a keeper. mmmm,mmmmm. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tldemario"
},
"reviewBody": "these were the BEST cabbage rolls that i have EVER had, i made the whole pan and there are only 4 left!! even my two year old loved them &amp; he is pretty picky!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Familycook"
},
"reviewBody": "Tasty recipe. I sauteed the onion with some chopped garlic and cooked in the crock pot on high for 4 hrs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "merhope1011"
},
"reviewBody": "Followed MARNZ01's advice and sauteed three cloves of garlic with the onions and meat (we used ground buffalo). The one thing I did a little different was to stir the meat mixture, rice and tomato sauce together BEFORE adding the egg so that I could try it to adjust the seasoning without getting sick! I tasted the sauce before baking it and I was a little worried, but it kind of mellows once it's baked, and it was pretty good! Have to see how the other half that I froze holds up, but thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "This took a long time and resulted in a lot of dishes...and I thought the pay-off was just okay. Probably won't make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tara"
},
"reviewBody": "I love cabbage rolls, these were good but here are a few changes... dont cook the rice all the way through and add the onions and some seasonings (oregano/garlic) to the rice at the very end just to soften. Also, freeze a head of cabbage and when ready to use just soak in a sinkful of H20... way easier than boiling and exact results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley Schulte"
},
"reviewBody": "These were REALLY good. I used an egg white, cut out the brown sugar, and used extra lean ground turkey. Healthy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BTORGES"
},
"reviewBody": "Very good recipe. Liked it better with the addition of raisins though. Probably used about 1/2 cup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "ccahoon"
},
"reviewBody": "This was very bland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kittylover25"
},
"reviewBody": "Yummy Yummy Yummy. I follwed the recipe exactly as is. I thought it was filling, flavorful and an excellent healthy choice! Will make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "This is only the second ground turkey meat recipe that I have ever liked, and will make again. Not as good as mexican turkey lasagna but really good. I added a chicken bouillon cube to the turkey as I browned it. White turkey meat is better than the dark meat most stores carry. Added ketchup to the sauce to make a little more of it. I didn't like the sauce cold but it was good baked with the cabbage rolls. I also basted it with the sauce half way through cooking. Added cheese on top when it was done and covered with foil to melt the cheese. Its good to let it set for 20 to 30 minutes after baking. Very good, all gone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bparsell"
},
"reviewBody": "These have become a staple. The best way I have found to peel cabbage leaves off is to boil the whole head in water for 3-4 minutes. This should soften almost all of the leaves. If you run into difficult leaves toward the middle, boil again for 1-2 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JK"
},
"reviewBody": "I made these without adding the water (as other reviewers suggested) Next time I will add it, as the sauce was too strong and the cabbage didn't cook as well because there wasn't enough liquid in the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "bullrisk"
},
"reviewBody": "Not great but for something healthy it's not bad. I made the change to add the salsa and garlic like one user recommended but was still coming up a bit short on taste. I'd likely use less rice and switch to beef instead of turkey next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hglenn"
},
"reviewBody": "Thought these were really great - a healthier comfort food. I added garlic and red pepper to the onion and turkey. I liked the sauce but can see why people doubled it if you like it pretty saucy. My kids didn't love the cabbage but gobbled up the contents no problem. I also chopped the end of the cabbage and boiled for 5 minutes to soften and then cut out the course vein in the middle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Schulte Kubitski"
},
"reviewBody": "YUMMERS! This was just what I was looking for...great flavor. I did however prepare my rolls the night before, refrigerated them over night and cooked them in my crock pot on low for 7 hours while I was at work the next day. I only added enough tomato sauce/water combo to cover the rolls. I didn't mind the thin sauce once tasting how great the roll was with it! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "DAISYTAZZY"
},
"reviewBody": "This meal was very good. I seasoned the turkey with garlic powder, pepper, and seasoned salt. For the sauce, I used only 1/2 cup water with the tomato paste and it seemed to make it a nice, chunky sauce. I also used brown rice as well. It tastes good and is healthy! Next time I make this I will probably add some white wine to the turkey and a little tabasco sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SweetBasil"
},
"reviewBody": "I gave this 4 stars because it was a good starting point for using the lower fat ingredients. I added chopped garlic, bell pepper, jalapeno, and more seasonings to the filling after reading other reviews. You really have to rev up the spices and flavors with the ground poultry. I also added more seasoning to the sauce, mainly garlic &amp; onion powders, some cajun spice and, YES, a pinch of ground cloves, as this is how I make my regular cabbage rolls. I agree with more lemon juice so you get that sweet &amp; sour sauce for the finished dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krista"
},
"reviewBody": "My husband and I really enjoyed this recipe. I made a few changes. While browning the turkey, in addition to the onion, I added 3 cloves of garlic and a dash of cayenne pepper. I also used brown rice instead of long grain and added 1/3 cup pepper jack cheese to mix! I actually measured 2 tablespoons of mixture to each cabbage leaf and ended up with alot of extra filler that I just added to the sauce on top. Next time I will just add more mixture to each cabbage leaf! Great Recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sugarbean"
},
"reviewBody": "Not a bad recipe just not a meal my family enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lorrie Hayes"
},
"reviewBody": "With some modifications, we loved this dish! Other reviewers' tips were very helpful and led me to make these changes: I boiled the whole head of cabbage for 5-10 minutes to make leaf removal/rolling easier. For more veggies, I added 1 cup diced green pepper to the onion/garlic/turkey saute. To punch up flavor, I added 2 tsp of minced garlic, 2 tsp of sugar, and 1/4 tsp cayenne pepper to the filling mix. For a less watery sauce, I used whole (6 oz.) can of tomato paste with 1/2 cup water (plus tomato sauce called for). Will make again! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Fit&Healthy Mom"
},
"reviewBody": "Good recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Megan"
},
"reviewBody": "My parents loved these, but I thought that they were missing something."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Duckball"
},
"reviewBody": "The only changes I made was to use more like 2/3 cup uncooked rice and 1-1/3 cups water; I also added extra salt and pepper to the meat, and used 3 cups of tomato sauce instead of sauce, paste, and water. It was edible, even alright, but not great. It needed (according to my husband) a LOT more lemon juice. And he was right, we put extra lemon on while eating and it helped. There was something off-putting about the turkey-cabbage-tomato combo. Turkey does taste different from ground beef (or lamb, I would assume), and I'm used to ground beef cabbage rolls. I might try this recipe again with beef but not with turkey. I'm glad I tried it, anyhow! Thanks for sharing, Dhano923!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "allisonh"
},
"reviewBody": "Amazing! I did some adding and changing according to what I had in my kitchen and other reviewers ideas - I used a pink tomato vodka sauce, added toasted garlic, and used leftover chicken off the grill instead of the turkey. I also added a little grated sharp white cheddar cheese in the last few minutes of baking. We will be making this again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mandee Robbins Green"
},
"reviewBody": "Great recipe! Like some other reviewers, I did sub 3 cans of tomato sauce, instead of using paste. Also, sauteed 3 garlic cloves with the onion &amp; ground turkey. Kids &amp; husband all enjoyed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "monidyson"
},
"reviewBody": "I just made these rolls last night for dinner and they were DELICIOUS!!! I have been making cabbage rolls for a long time and these knocked my old recipe out of the park! Plus they were a lot healthier with the ground turkey and my family never knew the difference, which was quite obvious since we have no leftovers! Bravo!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "REBADOC"
},
"reviewBody": "Fabulous! I complimented the recipe with oregano, garlic and other italian spices to taste... used all tomato sauce and no paste and an absolute must to add mozzarella in the mix; not much but a touch will help the rolls say together after baking. I also blanched the cabbage to help leaves separate. Any mix of ground meats will work. A new favorite for the 3,7,10 and 45 yr old kids in my house! Superb!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Misty"
},
"reviewBody": "As others, I cut the bottom of the cabbage head off and boiled for 5 minutes before pulling off the leaves. Instead of canned tomatoes, I used fresh diced tomatoes. It still came out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Baum Mathiason"
},
"reviewBody": "After reading the other reviews, I decided to make a few changes and it turned out great! I used boil-in-bag brown rice, italian seasoned diced tomatoes instead of tomato sauce in with the meat, and also added a handful of shredded mozzarella. Also, adding additional seasonings- garlic, salt and pepper, and red pepper flakes gave it a litte more kick."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "AMI13"
},
"reviewBody": "Wow.. did NOT care for this. I made it exactly as noted. Guess it just isn't my thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AccidentalFoodie"
},
"reviewBody": "These are incredible. I second another reviewer's observation that soaking the cabbage head in hot water will help: After the first few leaves, peeling off the rest in one piece becomes nearly impossible. Also, there appears to be a typo in Step 5: there is no mention of additional water in the ingredient list that would correspond to using water here; the sauce is perfect without it. You may also find the filling could use an extra shake of salt or garlic salt, but that's a matter of taste, and much easier to add than subtract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MONNALIKI"
},
"reviewBody": "so delicious and easy to follow. you will love it. thanks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jana"
},
"reviewBody": "Delicious! As one reviewer recommended, I sautéed 3 garlic cloves as well with onion &amp; turkey, substituted 4 oz tomato sauce w/salsa to the meat mix, and cut off the end of the cabbage head to soften and peel off easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MARNZ01"
},
"reviewBody": "I'm giving 4 stars due to the amount of changes made. I sauted 3 cloves of garlic with the onion, turkey. Then I substituted 4 ounces of the tomato sauce with hot salsa to the meat mixture. Gave it some great flavour. No one had mentioned how to easily get the cabbage leaves off. I recomend cutting off the end of the cabbage head and blanching it in boiling water. The leaves will soften and can be peeled off and rolled much easier. This is also an important step if you want nice tender cabbage in the finished product."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AlexPDX"
},
"reviewBody": "This recipe yielded about 24 cabbage rolls. I found it helpful to soak the cabbage head in hot water for a few minutes to soften the leaves before trying to remove them, otherwise they ripped apart too easily. My only complaint is that I ended up with a very watery sauce after I removed the rolls from the oven--I think water comes out of the cabbage leaves during cooking. Next time I would omit water from the sauce and see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Fawn Jenkins"
},
"reviewBody": "I LOVED this recipe,the cabbage, the filling, the sauce - everything!!! I will make this again! My mother-in-law came over and I gave her a taste. She said she would eat half a roll, but ate the whole thing instead, and now she wants the recipe!! Complete success!! I thought this recipe was a wonderful way to use leftover rice that I had already cooked. I used 2 cups of cooked brown rice in the filling, along with the other ingredients as listed, adding some garlic and parsley as well. In the sauce, I took the advice of another reviewer and used all tomato sauce (because I didn't have tomato paste), instead of tomato paste and water mixed with tomato sauce. I was out of lemon juice, so I substituted raw apple cider vinegar for that and added a bit more brown sugar to help the flavor. \nMy whole family liked the filling and the sauce, but only part of them were excited about the cabbage \"wrap\". So, if you like cabbage, you will LOVE this recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dizziepixie"
},
"reviewBody": "I followed the recipe exactly and it was delicious. The kids loved it as well, and they didn't realize they were eating cabbage!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "organic"
},
"reviewBody": "Great texture! I did not have a problem with it not being saucey enough, but I ate it with a spinach salad instead of mashed potatos so I did not need to have \"gravy\" for that. The only reason this did not get 5 stars is because it is very bland if prepared exactly as the recipe states. You will definately need to spice your turkey meat to your liking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sharon Wong"
},
"reviewBody": "Now I remember why I haven't made this in 7 yrs\n-unless you're using Savoy cabbage leaves, you will be SOOOO frustrated (do you peel the leaves of cabbage off first, ripping them to pieces? or do you steam the whole head of cabbage, which actually takes an hour?!)\n-2 tbl filling/leaf will leave you with lots of leftover filling, try 3 tbl and you'll still need more than 16 leaves\n-the sauce is too sweet. Next time I'm going to see what it tastes like before adding the brown sugar.\nNow that I've typed this all out to share with you, I should remember for next time!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My first experience with cabbage rolls. This recipe was foolproof and my \"honey\" had seconds and ate leftovers...that says it all. This will be a regular in our home."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa C"
},
"reviewBody": "This was truly delicious. I did make my own changes, however. I used ground chicken instead of turkey and threw in a couple cloves of minced garlic with the onion. I also added 1/4 tsp. poultry seasoning to the chicken/onion/garlic mixture. When the meat mixture was cooling I added 1 cup shredded mozzarella to it. As far as the liquids, I used 3 8oz. cans tomato sauce (instead of 1, paste and water). This made alot of yummy sauce!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "That Guy"
},
"reviewBody": "Delicious, just like how my mom used to make them. Thank you for allowing me to share with my family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jody Campos Dowling"
},
"reviewBody": "I followed the recipe except I used two 15 ounce cans of tomato sauce instead of the tomato paste and water and I added a little Italian seasoning to the filling and sprinkled some Mrs. Dash tomato, basil, and garlic on the top of the sauce before baking, and some parmesan cheese after they were done, and these were the best cabbage rolls I've ever had! Much lighter and better tasting than using ground beef. I highly recommend this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RAPUNZELL"
},
"reviewBody": "This was pretty good, if I had any qualms it would be that it's a little bland but that can be tweaked to ones liking. Overall a very good base I will experiment with."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "wendy"
},
"reviewBody": "I really appreciated the specifics and well outlined details. I took others suggestions and used ground sirlon instead of turkey. Followed all the ingredients. Time to prepare was lengthy, but SO WORTH IT IN THE FINISHED PRODUCT. Was yummy and I will make again perhaps with the turkey next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lapeerite"
},
"reviewBody": "Very good and easy - I used ground beef and maybe double the sauce next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Dawn S"
},
"reviewBody": "These really didn't turn out as well as I'd hoped they would. The filling of the cabbage rolls was pretty tasty, but the sauce covering it turned out pretty badly for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mark arnold"
},
"reviewBody": "everybody is right, the time to prep is kinda long and a little messy; however, it is well worth the time. My wife and I agree that this is truely a keeper. When I make this again I will double the sauce to pour over the rolls. We like extra sauce to pour over the rolls and use as gravey for the mashed tators ;-)"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/88912/turkey-cabbage-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/88912/turkey-cabbage-rolls/",
"name": "Turkey Cabbage Rolls"
}
}
]
}
}
, "about": [
]
}
]