				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkey Carcass Soup"
,"datePublished": "2019-04-03T23:50:57.000-04:00"
,"dateModified": "2023-03-06T12:31:47.146-05:00"
,"author": [
{"@type": "Person"
,"name": "Please Close My Account"
,"url": "https://www.allrecipes.com/cook/4402336"
}
]
,"description": "This turkey carcass soup uses every last bit of your roasted turkey. Perfect on winter nights, this hearty soup is loaded with vegetables and barley."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aTOMShsqf5lIObgsem9uqO_-mHQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/218804-TurkeyCarcassSoup-mfs-2X3-1725-f0a3662bfd774106a28a893303b8f658.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkey Carcass Soup"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.7",
"ratingCount": "405"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "133 kcal"
,"carbohydrateContent": "28 g"
,"cholesterolContent": "2 mg"
,"fiberContent": "5 g"
,"proteinContent": "4 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "439 mg"
,"sugarContent": "5 g"
,"fatContent": "1 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT45M"
, "recipeCategory": ["Dinner"]
,"recipeCuisine": ["American"]
,"recipeIngredient": [
"1 turkey carcass",
"4 quarts water",
"1 (28 ounce) can whole peeled tomatoes, chopped",
"6 small potatoes, diced",
"4 large carrots, diced",
"1 large onion, diced",
"2 stalks celery, diced",
"1.5 cups shredded cabbage",
"0.5 cup uncooked barley",
"1 tablespoon Worcestershire sauce",
"1.5 teaspoons salt",
"1 teaspoon dried parsley",
"1 teaspoon dried basil",
"1 large bay leaf",
"0.25 teaspoon freshly cracked black pepper",
"0.25 teaspoon ground paprika",
"0.25 teaspoon poultry seasoning",
"1 pinch dried thyme" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zhp30gZtgYVU8ZDPJQxTwCH6TDY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/218804-TurkeyCarcassSoup-mfs-Step1-1628-ee50ed3d8d314b47bf4156cf4c40ae2d.jpg"
}
]
,"text": "Place turkey carcass into a large soup pot; pour in water and bring to a boil over medium heat. Reduce heat to a simmer, and cook until the remaining meat falls off the bones, about 1 hour."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/BpwexsFRIHLob3POojETbA5vJw0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/218804-TurkeyCarcassSoup-mfs-Step2-1687-ae8bd357e82848ef9fc7060b96ce50dc.jpg"
}
]
,"text": "Remove turkey carcass from the pot. Remove and chop any remaining turkey meat. Discard carcass."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/15efQ_zdPWSnBwg_6dTN1RU9lxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/218804-TurkeyCarcassSoup-mfs-Step3-1690-d114217067194d1ea47fe8a1e1627a48.jpg"
}
]
,"text": "Strain broth through a fine mesh strainer into a clean soup pot. Add chopped turkey to the strained broth and bring to a boil."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/F3sbw9VyxiEVJSMVGpenlidLgHo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/218804-TurkeyCarcassSoup-mfs-Step4-1700-e45917346651498ebc6fd5260b988da2.jpg"
}
]
,"text": "Reduce heat and stir in tomatoes, potatoes, carrots, onion, celery, cabbage, barley, Worcestershire sauce, salt, parsley, basil, bay leaf, pepper, paprika, poultry seasoning, and thyme. Simmer until vegetables are tender, about 1 more hour."
} ,{
"@type": "HowToStep"
,"text": "Remove bay leaf before serving."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT165M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Susanne Feindt Gray"
},
"reviewBody": "I decided to use this recipe as the picture looked the best and the reviews were impressive. Absolutely amazing flavor. The only thing I changed was adding turkey stock at the beginning when the bones are boiling, along with some pepper flakes and pepper, and I used rice instead of barley. I also added a dash or two more Worcestershire and some crushed garlic. Again, amazing recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made it at Christmas with most of carcass. Delicious! (no cabbage). Blended - thick and sumptuous. Making it again today (Feb) from frozen leftovers."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Hattie Lyons"
},
"reviewBody": "The soup line on the inside of the pot marks how much I made and shows how much has been eaten since 12/03/22. Delicious soup chock full of vegetables and herbs. I didn't use barley or a substitute for it. I used onion powder instead of onions but forgot to add garlic. I love cooked carrots so I used 8 carrots and 6 celery stalks. My adult child is a picky vegetable eater with a high metabolism so I made a big pot of this. Just right for cold weather and the sniffles. Great recipe and easy to follow directions."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sweetpklp"
},
"reviewBody": "Doesn't need the potatoes. This is the best!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennie McCluskey"
},
"reviewBody": "Makes a nice base, leaving room for adding in your favorite herbs, spices and even various veggies and starches. It's a nice basic recipe for what to do with that bird after the big meal is over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "yummy vegetarian"
},
"reviewBody": "This is now my new recipe for turkey soup. I let the carcass cook for about 2 hours. Makes a richer broth. Added the spices and then added more for more taste. Family loved it. Will make again with next turkey. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Friesen"
},
"reviewBody": "Good recipe but it seemed like it was a bit lacking in flavour. Not sure what to add to liven it up. Also wish that the nutritional information would tell you how big a serving size is. Recipe says 12 servings but how big is a serving? If it gave the calories per cup of soup it would be ideal for anyone tracking calories"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AMP"
},
"reviewBody": "Love this soup! I look forward making this every year after Thanksgiving! I did make a 2 small changes-less potatoes and more vegetables, and used quinoa instead of barley because my daughter can't eat gluten."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "juliette456553"
},
"reviewBody": "HII,BEING A FOOD LOVER REALLY ATTRACTED ME TOWARD YOUR RECIPE. I^LL SUGGEST YOU TO ADD YOUR RECIPES ON KHAL.COM ,IN FORM OF PHOTO RECIPES THE PEOPLES WILL DEFINIETLY LOVE IT."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Alosa"
},
"reviewBody": "I have made this soup twice now and I absolutely love it. I skip the cabbage. I love it with potatoes even though I can't freeze it when I use them. That hasn't been a problem so far because I love it so much that I'm willing to eat it every day until it's gone without freezing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillelizabethla"
},
"reviewBody": "While this is quite possibly the worst named recipe in the history of recipes, when I researched soup options to use leftover turkey after Thanksgiving this year, the reviews hooked me in. So I tried it. New.Favorite.Soup! Made only 2 alterations. Substituted chicken mix of chicken stock and chicken bone broth for water and quinoa for barley. Completely gobsmacked with the result! A super hearty and healthy recipe. 2nd time I made I browned chicken breast and threw in with the soup to cook for an hour and then shredded and added back. I am now on my 3rd batch in 5 weeks. Now part of my Sunday meal plan routine for healthy lunch each week. Try it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mcooks"
},
"reviewBody": "This is Great! Fresh basil, sage, thyme, &amp; 14 oz can diced tomatoes, no salt added), 1/4 c barley. That way I can add cooked pasta as needed. I also added Dr Axe (Ancient Nutrition) Tumeric Bone Broth, it adds so much flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "\"How to make your family love the Thanksgiving leftover carcass in one step.\"\n\nWe absolutely loved this recipe and will definitely be making it again. I may need to buy a whole turkey again just to have it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina Alosa"
},
"reviewBody": "Best turkey soup I ever made. Don't want to wait until I make another turkey to have it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maxibee"
},
"reviewBody": "This is the tastiest soup I have ever made. Shared some with the neighbor. He said the same thing. I used chicken broth for the water and added some cayenne and red pepper flakes, since we enjoy a little slice. I will definitely make it again. Maybe turkey again for Christmas. Thank you for sharing the recipe. Yummy ?? \nMaxine B, Corpus Christi, TX"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Darryl"
},
"reviewBody": "Excellent soup! First time making it. May have been a little more liberal with the spices and didn’t use any barley. I’d absolutely make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vicki Cowell"
},
"reviewBody": "I make mine exactly the same way it’s always turned out fabulous the only difference is that I don’t serve it to others until it is set overnight in the fridge to let the flavors meld together.??"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela Knight"
},
"reviewBody": "This is a delicious soup! Because I had such a big carcass (&gt;20lb bird), I doubled the water and simmered the carcass for 2 hours on low. I removed half of the broth before adding the remaining ingredients for soup, following the directions precisely. \n Next time I will add more barley, 1/2 c isn't enough. At least double, if not more. After trimming off all the meat for the soup, I placed the bones in another pot with the extra broth that I removed. I added a quartered large onion, large carrot chopped in big chunks, and 2 celery stalks halved with salt, pepper, and poultry seasoning (+ 1 Tbsp apple cider vinegar as noted in another post to pull the nutrients from the marrow) and let it simmer on low for another 3 hours. I then strained and pressure canned it for 25 min. The broth was wonderful too. This is a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michael Lynch"
},
"reviewBody": "Pretty good, and is a great way to use your leftover turkey. I feel like this can be tweaked a bit. It tastes a lot like a typical beef stew but with turkey."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kane Lewis"
},
"reviewBody": "This recipe was a great soup for my family"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "Absolutely love this recipe, have made numerous times. Have printed &amp; passed out recipe to friends to make and enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "June"
},
"reviewBody": "Very good! I had pulled turkey and turkey stock in the freezer, so my method was a bit different. I sauteed the onions, carrots, and celery; added the potatoes, cabbage, and barley; added stock to cover. When the potatoes were just tender, I added the remaining ingredients, except Worcestershire sauce, more stock, simmered for a bit, then added the turkey, and simmered a bit more. I don't like to add cooked chicken or turkey too early as both can break up into indistinguishable strings with so much simmering and stirring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bruinscup2011"
},
"reviewBody": "OMG.!!!! Don't change a thing. It was perfect, followed the recipe EXACTLY as written, didn't change it to make it my own, or substitute stuff that my neighbors daughters cousin suggested as others do on this site. I'm rating the recipe as written, as it was intended to be rated. Deelish. Most had 2 or 3 bowls of it till it was gone. Kudos, sooooooooo gooood.!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mbklement"
},
"reviewBody": "You need a massive crock pot to make this. I was able to fit all the liquid in that the recipe called for. It was ok. I probably won’t make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bitch'n kitchen"
},
"reviewBody": "Wow this made a load of soup. I boiled it for 3.5 hours and the broth was a little weak. Maybe more liquid should have evaporated. I dumped in the gravy I had leftover and that really boosted the flavour. I really did have a lot of broth so I used 1.5 times the spices called for. In the end this soup was excellent the only thing is there are only two of us to eat it lol."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reginald Marks"
},
"reviewBody": "Excellent....all 4 of my daughter's loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cathyw"
},
"reviewBody": "This made the best soup. So good. I had everything on hand except the cabbage, but will definitely be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bill Buzzie"
},
"reviewBody": "Made this as written, but left out the tomatoes and cabbage (picky eaters) and substituted egg noodles for the potatoes. Awesome taste!! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Celine"
},
"reviewBody": "I added everything except the potatoes. I used more barley to make up for the potatoes. Next time I will try with egg noodles instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Laviano"
},
"reviewBody": "Love this soup. Great flavors. The tomatoes add a nice depth (but don't forget to smash them up before adding them). I left out the potatos because i was freezing most of it. Didn't miss them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jess d"
},
"reviewBody": "What an incredible recipe!!!! I follow it for the most part aside from some additions including using my own stock recipe. I make it every year after thanksgiving with the bones from a smoked turkey so I followed that recipe (onion, carrot, celery, garlic- brown all of that for a couple minutes with olive oil to get caramelized flavors, cook with bones In water with bunch of parsley, 3 bay leaves, thyme, chives, and rosemary). I let my stock cook all day then strain with cheesecloth and cool overnight in fridge. \n\nFor this soup- I took 6 cups of that concentrated, glorious stock and mixed with about 5 cups of water and 2 spoonfuls of Roasted Chicken Better Than Bouillon. Boiled with the turkey meat I had saved (maybe 2 cups). From there I did it almost as written except for some additions cuz..why not? Put in sautéed baby portabella mushrooms, extra cabbage, 1/2 cup of jasmine rice, 2 garlic cubes from Trader Joe’s, and a tablespoon of Mushroom Umami seasoning (also from TJ’s). Also, the recipe is unclear but I did include all of the juices from my 28 oz can of peeled San Marzano tomatoes. I cooked for 2 hours and added another cup of water as it reduced. \n\nIt was so delicious. The barley was such an amazing addition to the soup texture-wise but I’m glad I also added rice. It just worked. Also, I’ve seen other reviews saying that the Worcestershire Sauce was overpowering but I completely disagree. It was so good in there! \n\nI served with homemade cheddar and garlic biscuits"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Rebecca Pizzitola"
},
"reviewBody": "This recipe is a good base, but unless you like things on the tamer side, you'll need to doctor it up with things like garlic, red pepper flakes, cayenne... (Keep in mind I like hot sauce on my eggs. NOW we are talkin'! I didn't want to eat the soup I made as written except not to waste it, but now that it has a kick and flavor, I look forward to it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy"
},
"reviewBody": "Good flavor. Left out the potato and doubled the barley. It's more like a stew. Will make again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cathy Callahan Bradlee"
},
"reviewBody": "Very good recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "BLP"
},
"reviewBody": "I found this recipe bland and a bit sour"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Fisher"
},
"reviewBody": "Amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Stanley"
},
"reviewBody": "This soup is easy to make and absolutely delicious. My husband raves about how good it is. We eat it for dinner and there is plenty leftover to freeze for lunches on a cold winter day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth Holly"
},
"reviewBody": "This is an excellent use of the carcass which surprisingly has a good deal of meat remaining. This recipe is very easy and quite hardy and flavorful. Perfect cold weather meal"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine A"
},
"reviewBody": "TURKEY CARCASS SOUP\nAmazing! I had made my turkey stock from our Thanksgiving turkey as I usally do, then... BAM! I happened to see this recipe! Great use of the remainder of our turkey. After eating it for three days with stuffing, potatoes, and gravy, we were ready for something different. (And definitely lighter!) Love all the veggies in it! I had a can of big diced organic tomatoes on hand - make sure you don't leave the tomatoes out! It kicks up the flavor of the delicious broth (plus, my son and I absolutely LOVE tomatoes!). I added mushrooms just because I happened to have some on hand and I saw another reviewer subbed them for tomatoes (again - do NOT leave the tomatoes out!). The only thing I will change is to not shred the cabbage next time: I will make it larger chunks like one of the pictures, as cabbage and tomatoes make a great soup. And I'll up the barley another 1/2 cup or so. I look forward to making this soup again, and maybe even with my Sunday dinner roasted chickens! **NOTE: to those who say their soup was bland, look at Susan Seals' review for making STOCK (not just a broth). Don't just put water over the carcass for one hour and expect magic to happen. Throw in the giblets from the turkey too. You'll have the best soup every time by letting it boil, covered &amp; vented, for at least 3-4 hours til the broth becomes opaque and it tastes yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Barb"
},
"reviewBody": "Delish!!’"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rosene2"
},
"reviewBody": "The only thing I did differently is that I made a real stock by putting the carcass and bones in water with onion, celery, carrots, peppercorns, and salt and simmered for 4 hours until the liquid was reduced by half, so that I had a real stock to use. Otherwise, I followed the recipe and it was DELICIOUS! In a pinch, I've substituted farro for the barley, when I couldn't find barley at Trader Joe's. The farro was fantastic too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jolene Shewchuk"
},
"reviewBody": "I made this soup exactly as recipe is written, and if I could give it no stars, I would. \nThe end result was so incredibly bland, I would never even think of serving this as is. \nAt that point I had to add in over 2 tbsp chicken bouillon, double at least the pepper, a tbsp garlic salt, and a tbsp onion powder....and it finally has a flavor other than turkey water. \nThe vegetables, being that the onions were never sauted have a flat flavor, and are disappointing. \nI'm sad to have wasted the afternoon on this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TheBaker"
},
"reviewBody": "My sister made this soup tonight and now I feel I must buy a turkey just to make it again it was so good. While I typically love the standard turkey noodle soup from a roasted turkey this soup had so much more flavor. It had so many dimensions I struggle to describe it adequately but do try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "datiekakes"
},
"reviewBody": "Delish. While boiling carcass i added celery, onion, and carrots for flavour. Discarded after. i didn't use cabbage as i am just not a fan. I did however add garlic, extra herbs, and found it needed a touch more salt and pepper. Served with homemade tea-biscuits. Will definitely make again and share recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Prine"
},
"reviewBody": "Made just as recipe called for. It’s really good. We really like that it included cabbage and tomatoes! Yum"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Papa2-3boys"
},
"reviewBody": "I've made this several time following the recipe. It is delicious.\nPut in a couple of big handfuls of coleslaw the last time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "muggins"
},
"reviewBody": "A nice change from recipes calling for noodles or rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BusyMama"
},
"reviewBody": "I have never made turkey soup before, so I looked for a good base recipe to start with and this one did the job! I made changes to it, but believe that if you are a standard soup lover, this one would be great. \n\nHowever, I prefer a very thick soup, so I made changes accordingly, and I did not add the tomatoes as that did not appeal to me.\nChanges I made:\n1. Cooked the carcass in the 4 quarts of water with 2 T apple cider vinegar in a crock pot on low for 8 hours first to get a bone broth. \n2. added bag of frozen kale and baby lima beans\n3. I omitted the potatoes\n4. Added extra carrots, celery, cabbage, and barley"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bigkampe"
},
"reviewBody": "OMG so good! if you wondered, like me, what to do with the carcass of a dead animal then search no longer. My only changes was to add a quarter teaspoon of red pepper because I couldn't find the paprika. Well, I eventually found the paprika and added it recklessly while also adding the red pepper at equal quantities. I never felt so alive! To tone it down, I added about 12 oz of egg noodles during the last 8 minutes of simmering. It was like chaos and order met for the first time eye to eye. Don't use potatoes. I didn't. They are not worth it. Double the red cabbage! Cabbage is life and love! The most important ingredient is to listen to Song For Zula. Take care my friends!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danielle"
},
"reviewBody": "I've made this a number of times and my weekend food critic husband raves about it every time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Matthew Ryan"
},
"reviewBody": "Easy soup to make. Added a pinch of sage and let it cook down for a few hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "johnny love"
},
"reviewBody": "Easy, already had necessary ingredients. Deliscious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mark Moriarty"
},
"reviewBody": "I misread the recipe. It called for just a 1/2 cup of barley but I added just over a cup PLUS another cup of Quinoa! I didn't use 4 quarts of water but just under 3 quarts of chicken broth. I didn't have a big enough pot so I used my big crockpot and everything BARELY fit in it! (I used more) veggies also. But OMG, it was DELICIOUS! Best soup I've ever made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elane"
},
"reviewBody": "I was a little doubtful about how it would turn out but I'm glad that I followed the recipe. The soup turned out great and is inspiring me to write about the experience of making it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom Morgan"
},
"reviewBody": "One of the best soups I've made recently. As recommended by others, added: Garlic, string beans, crushed red pepper,. Boiled and deboned the carcass the day before. Also used about 1/2 head of cabbage cut fine not shreaded."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "nrs"
},
"reviewBody": "I did not have cabbage and I used Gluten free spiral noodles and no tomatoes. It was still delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joy Bryson"
},
"reviewBody": "I’ve been making soup from turkey carcass for years just like my Mom did too. Pop it in the slow cooker &amp; simmer all night. But.... to make it even better, TRY ROASTING THE BONES in the oven first! I toss in the bones, skin, neck, tail, etc &amp; let it brown really good. Onions &amp; carrots can be tossed in to brown too. Once really brown, add water or broth &amp; scrape up all the bits in bottom of pan. Let the bones cook in the broth in the oven for a while. I them take a potato masher &amp; smash up the bones before straining through a sieve to get all that yummy broth. Discard all the solids &amp; put the broth in the fridge overnight. In the morning you can remove the solidified layer of fat on top &amp; use the gelatinous broth to continue making your soup or pop in the freezer to use at a later date."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Blake Austensen"
},
"reviewBody": "Excellent soup and so easy to make! I’m always amazed how much meat comes off the carcus!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pam Borgstede"
},
"reviewBody": "Personalized it a bit but overall love this recipe! We like our food highly seasoned so I’ll just tell you what I did different:\nIncreased Worcestershire sauce to 3 tbs, used 1/2 veg broth and 1/2 water, doubled paprika, replaced poultry seasoning, dried thyme and dried parsley with 2 tsps herbs de provence, replaced 1/2 of canned tomatoes with fresh, and added the turkey to the broth AFTER the vegetables had cooked so that the turkey would still have flavor. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Terri Hoornstra"
},
"reviewBody": "I will definitely make it again. Very much a \"comfort soup\", I couldn't use the barley because of a gluten-sensitive family member, and i should have substituted rice; so it was less satisfying than it would have been. But still delicious, and it always makes me feel good to have gotten the most out of my turkey!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "Love this recipe. My new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Brennan Camire"
},
"reviewBody": "I made this per all ingredients but I sautéed onion, carrots, celery and added some garlic together. I added all of the spices to the saute and then added to the soup with tomatoes and cabbage. It was the most delicious soup I have ever made. It was a lot of troule but well worth it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KIMWINICKI"
},
"reviewBody": "The best turkey soup that I have ever made!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rnidtowner"
},
"reviewBody": "Great recipe. I substituted the potatoes for a cup of beans and it was great. I probably added the cabbage too early and shredded it too finely because it basically dissolved after being stored in the fridge overnight."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karthini Mahendranathan"
},
"reviewBody": "Delicious- everyone loved it! Followed the recipe but added in a bulb of garlic too- as other commenters suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nancy"
},
"reviewBody": "I made this the day after and it was delicious! I had my neighbors come over and they wanted the recipe so they could make it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katrina Winkler"
},
"reviewBody": "Carcass soup is a Keeper!!\nAdmittedly I Only cooked a bone in Turkey Breast this year, but after carving the leftover breast meat, I put it in the crockpot. \nFor 2 days I cooked it with 1/4c apple cider vinegar, to pull the minerals out!! On the second day, I did what I do to my fryer chicken carcass when I make chicken broth, I mash it a bit with my bean masher. \nI strained it after 2 days, and it made 1/2 gallon of broth.\nI fried a sweet onion in oil and then added the broth, potatoes, carrots, and cabbage, I didn't feel like celery. I didn't have stewed tomatoes but did have a can of Organic 24oz can of tomato basil soup so, I omitted the extra Basil but added Everything else!!\nI used Organic sprouted rice, instead of Barley, since I don't usually keep Barley. I'm into varying my grains so, lll probably try it sometime with Organic Barley."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beejay"
},
"reviewBody": "I didn’t have cabbage on hand but added fresh green beans instead. I also did it in a slow cooker. It’s a wonderful recipe; the various spices and the barley make it a delicious and very hearty soup. This one’s a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mike"
},
"reviewBody": "I modified this quite a bit. I used the Turkey Stock to create a Turkey / Andouille sausage Gumbo. Left out the potatoes. Made a roux from bacon grease. Saueed the Holy Trinity - Bell Pepper, Onion, and Celery and flour. Pretty much a home run!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ellen Allen"
},
"reviewBody": "I love a thick stew. I left out the cabbage and tomato. I added mushrooms and red bell pepper and rice. I had sooo much broth that I probably doubled all the vegetable amounts and cubed leftover turkey. The spices really made the flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sherryberry"
},
"reviewBody": "Delicious soup!! I loved the idea of cooking the carcass in the crockpot overnight ! Strained it in the am and put in fridge all day. Came home and skimmed off the fat and then made the soup . I did leave our cabbage and tomatoes and the soup has incredible flavor profile and is almost more like a stoup. Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah Rowe"
},
"reviewBody": "I used only 2 Q water plus the broth from the turkey, added a grain medley I had on hand instead of barley. I had to add about 4 bouillion cubes for flavor but it was quite tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandra s"
},
"reviewBody": "The best turkey soup I’ve ever made. Everyone love it. I will be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniela Craig"
},
"reviewBody": "I was out of parsley and paprika, but it was still an amazing soup! I also omitted potato, cause I wanted a lower carb option. It will be a yearly tradition I think! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa G"
},
"reviewBody": "Great easy recipe for a first-time soup maker. After reading the reviews I made the following change:\n- I simmered the carcass overnight in a slow cooker with 3.5 quarts of turkey broth (couldn't fit any more in my crock pot) and 1 tablespoon of apple cider vinegar.\n- I omitted the canned tomatoes\n- I added minced garlic\n- I cooked the barley separately and added at the last minute to conserve the turkey broth.\nMade a ton of soup, we'll be eating this all winter. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mantatoo"
},
"reviewBody": "Great finish for the Thanksgiving turkey. Enough for the two of us to work on for 3 meals!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chuanjithill"
},
"reviewBody": "It was delicious! I added one sweet potatoes that left over in my refrigerator. It's didn't change the taste of my soup. Love it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ali Chenault"
},
"reviewBody": "delicious...I sometimes substitute when I don't have all the ingredients. I didn't use potatoes but doubled up on barley. I also used vegetable juice and tomato sauce in place of the tomatoes. It is delicious and I'll save the recipe to use with my turkey broth. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mark"
},
"reviewBody": "Did not strain, would have taken to much goodness out! I used 1 cup of barley (cooked separately and then added 45 min. into final simmer) and no potatoes. Pulled 4 cups of broth into clear glass container with a baster and then skimmed fat layer off and added broth back. Added two cloves of garlic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charles Borg"
},
"reviewBody": ".\nI am not a big fan of turkey soup, the only time I make it is during the holidays. I made this day after Thanksgiving and it was awesome. Right after it was done I had 3 huge bowls of it.\nIt was that tasty. I followed the recipe exactly as is with the exception of leaving out the barley since I used potatoes and the stock instead of water. I simmered the carcass in turkey stock for 4 hours, used mostly dark meat. After I pulled out the carcass and trimmed off all the meat I simmered it for 2 more hours. It was simply DELICIOUS."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis"
},
"reviewBody": "This is one of the BEST Soups EVER!!! I added some mushrooms, but otherwise make just as the recipe indicated. \nWill DEFINITELY make again and I have saved it to share"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dan Conway"
},
"reviewBody": "Easy, delicious. Amazing how mush meat remained on the carcass. I substituted green beans for the cabbage"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Audrey E. Urban"
},
"reviewBody": "My husband has gone back for seconds... and thirds and fourths."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cody LC"
},
"reviewBody": "I didn’t use the cabbage and substituted turnips for potatoes. It was amazing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kylie Moore"
},
"reviewBody": "One of my favorite soups. I make it every year with my Thanksgiving turkey carcass."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Duane"
},
"reviewBody": "We made some minor substitutions for the seasoning. The turkey carcass was cooked on a Traeger. I would add more barley next time and possibly other vegetables. Served to five adults, nothing but rave reviews. Thank you."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheri Schaffer"
},
"reviewBody": "The soup was amazing, my family and neighbor loved it. Will definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather"
},
"reviewBody": "Tasty and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Angie"
},
"reviewBody": "I subbed rice for the barley and the potatoes. I used smoked paprika and I added garlic and red pepper flakes. I liked the soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robert Simpson"
},
"reviewBody": "I made this soup with a few modifications of my own due to available ingredients. I followed the advice of previous reviewers and added apple cider vinegar to the water when boiling the bones to help extract the calcium from them. I let the broth simmer all day on the stove and then put the soup together at dinner time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jeff"
},
"reviewBody": "Very good. You’ll want seconds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Denyse Gagyi"
},
"reviewBody": "The best soup recipe in the world. Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweet_SueAnn"
},
"reviewBody": "Made it in 2018...so happy I saved the recipe here! Making it again later this week in 2019! Thank You &amp; \nHAPPY THANKSGIVING 2019"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bev"
},
"reviewBody": "I added 2 tsp of chicken base. I didn't have worchester sauce so I omitted it. The flavor was excellent! My husband had 3 servings. My neighbor said it was the best I'd ever made :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kelly Pearson-McEnaney"
},
"reviewBody": "Made it! Husband loves it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DA"
},
"reviewBody": "I used frozen turkey broth, already strained, and some frozen turkey chopped and added. As well I added 2 cups of chicken broth. Other than that I went strictly by the recipe and it was excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Kosa"
},
"reviewBody": "No changes it was awesome yes I will make it again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Radl"
},
"reviewBody": "Really good! Substituted baby spinach for the cabbage. Turned out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sheila cherry"
},
"reviewBody": "Your cite is dumb it gives no recipes there is no point"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/218804/turkey-carcass-soup/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
"name": "Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/692/soups-stews-and-chili/soup/turkey-soup/",
"name": "Turkey Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/218804/turkey-carcass-soup/",
"name": "Turkey Carcass Soup"
}
}
]
}
}
, "about": [
]
}
]