				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkey and Bacon Panini with Chipotle Mayonnaise"
,"datePublished": "2019-04-02T02:53:13.000-04:00"
,"dateModified": "2022-11-22T15:55:02.000-05:00"
,"author": [
{"@type": "Person"
,"name": "chefmommy"
,"url": "https://www.allrecipes.com/cook/chefmommy"
}
]
,"description": "Turkey and bacon join melted provolone and a spicy mayonnaise in this crispy grilled sandwich."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/dUVusRceNKs6V-JMu1DY5Rf8uak=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/651270-1cd56ef786584f939fe1724e37001e2c.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkey and Bacon Panini with Chipotle Mayonnaise"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "52"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "699 kcal"
,"carbohydrateContent": "65 g"
,"cholesterolContent": "81 mg"
,"fiberContent": "4 g"
,"proteinContent": "35 g"
,"saturatedFatContent": "12 g"
,"sodiumContent": "2276 mg"
,"sugarContent": "3 g"
,"fatContent": "33 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"8 slices bacon",
"1 tablespoon butter",
"0.5 medium red onion, thinly sliced",
"2 cloves garlic, minced",
"3 cups fresh spinach leaves",
"0.5 cup reduced-fat mayonnaise",
"2 chipotle peppers in adobo sauce, minced",
"1 teaspoon adobo sauce from chipotle peppers",
"8 (4 inch) pieces focaccia bread",
"4 slices provolone cheese",
"0.5 pound sliced deli turkey meat" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Cook bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain on a paper towel-lined plate."
} ,{
"@type": "HowToStep"
,"text": "While the bacon is cooking, melt butter in a large skillet over medium heat. Add onion and cook, stirring occasionally, until soft and translucent, 7 to 10 minutes, adding garlic for the last minute. Stir in spinach and cook until wilted, about 3 minutes. Remove from the heat."
} ,{
"@type": "HowToStep"
,"text": "Preheat a panini press according to the manufacturer&#39;s instructions."
} ,{
"@type": "HowToStep"
,"text": "Stir mayonnaise, chipotle peppers, and adobo sauce together in a small bowl. Spread mixture over 4 slices of focaccia bread, then top each slice with provolone, turkey, two slices bacon, spinach mixture, and remaining bread slices."
} ,{
"@type": "HowToStep"
,"text": "Cook sandwiches in the preheated panini press until crispy and golden brown, about 5 minutes each."
} ]
,"recipeYield": ["4"]
,"totalTime": "PT50M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Daniel Bixler"
},
"reviewBody": "family loved it!!\nUsed Ciabata breadrolls\nsmashed avocado into this mayo mix\nprocessed Swiss cheese (we had some)\nroasted red peppers\nalfalfa sprouts instead of spinach\nno onions (family dislikes)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christina"
},
"reviewBody": "Fantastic! I used a Buffalo-style turkey and garlic and herb focaccia. Hubby LOVED this sandwich...a keeper~YUM! Thanks for sharing. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cher"
},
"reviewBody": "I wasn't sure at all about the spinach part of this sandwich but decided to roll the dice and follow instructions exactly. What good instincts I have! This was incredible! It takes a little work for what is supposed to be our quick Tuesday sandwich night but certainly worth the effort. I did use pre-cooked bacon, the only change I made and both hubby and I loved these. Will be repeating often. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mickey Rozell"
},
"reviewBody": "I followed some of the suggestions and used less of the chipotle peppers and we all loved it. I even made a large batch of the chipotle mayo to use on other sandwiches. Have made this a half dozen times and it has become a family favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ajgran"
},
"reviewBody": "Loved it! The only change I made was using turkey bacon instead of normal bacon. My husband is obsessed with this sauce , but we did notice it tastes best hot (not on a cold sandwich). He also said I could sell this sandwich it was so good, but I can't take the credit. :) Will definitely make again, much to my husband's delight!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cjucoder"
},
"reviewBody": "Bought a panini grill today, and was looking for a recipe that used what I already had on hand. This fit the bill! I didn't want to dirty up two pans. Instead of cooking the bacon in one pan and the veg in another, I cooked the veg in the bacon grease (well, some of it) after the bacon was done. I didn't have chipotle in adobo, so I made the sauce with mayo, sambal oelek and chipotle powder. Pretty good substitute. Also, cutting the onions in slices makes it tough to eat, always pulling out strings when taking a bite. I'll dice the onion next time. Alas I didn't have focaccia, had to make due with plain old rye bread. All in all, this was a great combination of flavors and a nice way to break in the panini grill."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "FrackFamily5 CA—>CT"
},
"reviewBody": "This was very good. I just used plain mayo. We don't like chipotle. The garlic, spinach, onion mixture is a winner!! I didn't have focaccia, I used a wheat loaf and it was very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ki8deslr"
},
"reviewBody": "Thanks for this! Used Hampton Creek's Just Mayo Chipotle Mayo. Fab!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Isabella"
},
"reviewBody": "I have made these twice and have turned out great both times. The first time I forgot the red onion but added it the second time. I thought the red onion was a little too strong but my husband liked it. Also to make it easier and because my kids don't like spicy, I added some chipotle hot sauce to the mayo instead of the chipotle in adobo for my husband and I and the kids just got plain mayo. This saves me from buying a whole can of chipotle in adobo and only using a small portion of it. Just used regular bread that I had on hand too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tom"
},
"reviewBody": "Excellent panino recipe. Halving the adobo sauce and the chopped chipotle made this plenty spicy but capable of being eaten by a bigger group."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DGREENWOOD"
},
"reviewBody": "This sandwich was really tasty and we will make it often. Everything just seemed to go together and I followed the recipe exactly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vanessa Punnett Lucas"
},
"reviewBody": "omitted the garlic and onion. Just added the spinach before pressing too. Still pretty dang good! lol loved the mayo. little kids liked it as well. I think I used ciabatta bread b/c I couldn't get focaccia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Fegler"
},
"reviewBody": "Delicious! I had to use regular sourdough bread because I dropped the ball on making the foccacia. It was delicious! Quick and easy but I ended up with fabulous results!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maya"
},
"reviewBody": "excellent flavor ... a bit time consuming for a sandwich, but the end result was well worth it. I added sliced avocado (because I love turkey, bacon, w/ avocado) and used ciabatta rolls since the grocery store didn't have any focaccia bread. Other than that, followed the recipe as written -- delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristie Ann Tudor"
},
"reviewBody": "I've made these twice, now, and both times they were absolutely delicious. The first time, I used all of the ingredients exactly as listed in the recipe. My hubby and I both LOVED the sandwiches. But last night, I opened up the new package of turkey only to find that it was spoiled from being improperly sealed. So, hubby suggested using tomato slices instead. I built the sandwiches the same way, and added one extra slice of cheese before topping it with the bread, then grilled. They were fantastic, and just as tasty! Just goes to show how versatile these sandwiches can be. Thanks so much for sharing this!! P.S. I use the \"Fantastic Focacia Bread\" recipe on this site for the bread - you can't go wrong."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becca"
},
"reviewBody": "Awesome sandwich! Made as directed and loved the spinach and onion mixture! Will definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "I just made these for 12 people at work with only a Cuisinart Panini Grill/Griddle in about an hour. Very easy and DELICIOUS!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Muscle Jock Chef"
},
"reviewBody": "This was a great receipe.. my first time making a panni.. I don't have a panini press so i used my cast iron grill i put on my gas stove on low heat... I used a brick double covered in aluminum foil, got that from Rachel Ray... Since i was making this for 1 person.. myself.. so I cut the ingrediants.. Also since I am on a low fat diet I had to change some of the ingredients. I made my spread from lite mayo , spicy mustard , and mixed sundried tomatoes in with it..mmmmmmmmmmmm delicious.. I use jack cheese .. And since I had just loaf bread.. I used my whole wheat bread ... This sandwich was so good.. Much better than having a plain turkey sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cyndi Conway-Booth"
},
"reviewBody": "My family made this for dinner one night. The favors just weren't there for us."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sheila LaLonde"
},
"reviewBody": "Very good! Subbed sourdough for the focaccia and reduced chipotle peppers to 1. Thanks for sharing this quick and delicious recipe, chefmommy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PPK"
},
"reviewBody": "I really liked this, but hubby wasn't as keen so we compromised on the rating. I did use homemade Ciabatta bread though. I want to make again, but need to have hubby agree."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BudsGurls"
},
"reviewBody": "We make these (&amp; LOTS of other panini's) all the time on either our GF grill or cast iron skillet! We use a couple teaspoons of olive oil instead of the butter, onions depending upon our mood &amp; just 1 (or none) of the chipotles. Deli turkey, leftover rotisserie chicken, provolone or mozzarella...the ingredients can actually be determined by what you have on hand. It's pretty hard to mess this one up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mommyluvs2cook"
},
"reviewBody": "This was delicious! After I cooked the bacon I poured off some of the grease but left a little to cook my onion, spinach and garlic in. Saves you a dirty pan. The mayo was yummy! Once again...delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "billp"
},
"reviewBody": "I tried to do it on a grill, turned into a very large mess. maybe I just don't get it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "stayinthecastle"
},
"reviewBody": "These were delicious. We had them twice in one week! We will definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane Lloyd"
},
"reviewBody": "So good! I too used my Forman grill and used regular mayo. I will be making these often!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zippydog27"
},
"reviewBody": "Used George Foreman Grill instead of Panini press. Cooked for 3 to 4 min this way. Also used Flat Focaccia Bread. Used turkey bacon in replace of bacon to reduce fat. Very Delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DIZ&#9829;"
},
"reviewBody": "I don't have a panini press, so I used my indoor grill. Using a square baking pan, I gently pressed down on the sandwich as it was cooking. Flipped it over and repeated on the other side. You could easily do this on a BBQ grill, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Delisa Ramos"
},
"reviewBody": "I used freeze dried red onions, monterey jack cheese, and precooked bacon. I also had jalapeno cheese focaccia bread that I bought at HEB. I had to scale the ingredients in my head for just one sandwich. Everything else I prepared as the recipe called. I am in love with this sandwich. I honestly didn't think I was going to like it because of the spinach, but that was one of the best parts. I will definitely make again for the family. One more thing...I don't have a panini grill. I didn't even grill it. I know I made changes and I hate when people rate things based on their changes, but this sandwich could only be a hundred times better if it was grilled and made exactly as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa"
},
"reviewBody": "Outstanding, outstanding, outstanding! My husband &amp; oldest son are begging me to make these again 2 days later! I only used 1 chipotle, which was perfect heat for them. On mine, I used garlic mayo instead(not a chipotle fan). I used ciabatta bread &amp; just toasted it(no panini maker). I think this has moved to the #1 spot on our favs from AR!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "clark"
},
"reviewBody": "I made this for company last night and we loved it. The only change I made was to use 2 slices of cheese per sandwich instead of one. We love cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rae"
},
"reviewBody": "Made this for the Recipe Group. We really enjoyed this sandwich. Hubby took a bite and said \"Wow!\" always a good sign! I couldn't find any focaccia bread at my bakery so I made my own using Michael's Foccacia Bread (on this site) it was great. I did add more mayo to the chipotle mayo since it was a bit spicy for my tastes. Also I don't have a panini press so I heated up a non stick pan and a cast iron pan, put the sandwich in the non stick pan then placed the hot cast iron pan down on the top and pressed down slightly, using a hot pad. It worked really great. Thanks for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bibi"
},
"reviewBody": "Really liked this, except I used only one chipotle pepper in the mayonnaise. We found it spicy enough for us, that way. Other than that, I made the recipe as stated. If you don't have focaccia, I think any sliced, substantial bread would work. I'm happy to find another way to make panini! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bellepepper"
},
"reviewBody": "Made this for Recipe Group. This is an excellent sandwich! I didn’t have focaccia bread, so I used a sandwich Italian and I don’t have a panini press, so these were done on a griddle pan. I was cautious with the Chipotle peppers and just added them to taste and then opted to serve it on the side, rather than putting it on the sandwich. We both really enjoyed this one and would definitely make it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "wjayhawk"
},
"reviewBody": "If I would have been able to find a can of chipotle peppers that I liked I think that I would like the sandwich."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tsummers"
},
"reviewBody": "Fabulous sandwich! A must on homemade foccacia."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Fabulous sandwich! A must on homemade foccacia."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/214076/turkey-and-bacon-panini-with-chipotle-mayonnaise/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
"name": "Meat and Poultry"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
"name": "Pork"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/214076/turkey-and-bacon-panini-with-chipotle-mayonnaise/",
"name": "Turkey and Bacon Panini with Chipotle Mayonnaise"
}
}
]
}
}
, "about": [
]
}
]