				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Turkish Red Lentil Soup with Mint"
,"datePublished": "2019-04-02T02:56:01.000-04:00"
,"dateModified": "2023-03-15T07:23:12.670-04:00"
,"author": [
{"@type": "Person"
,"name": "Jenna"
,"url": "https://www.allrecipes.com/cook/6382784"
}
]
,"description": "This recipe for Turkish red lentil soup features earthy, sweet red lentils and nutty bulgur in a savory tomato-based broth with just a bit of mild heat."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/d9wnFJnEELGp0DFyd8LD8V-tL0U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7568925-turkish-red-lentil-soup-with-mint-trish-4x3-1-70c42b6fd2004443841f072db2fa4840.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Turkish Red Lentil Soup with Mint"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "89"
}
,"cookTime": "PT50M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "168 kcal"
,"carbohydrateContent": "24 g"
,"cholesterolContent": "1 mg"
,"fiberContent": "4 g"
,"proteinContent": "7 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "623 mg"
,"sugarContent": "3 g"
,"fatContent": "6 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
, "recipeCategory": ["Soup"]
,"recipeCuisine": ["Middle Eastern"]
,"recipeIngredient": [
"2 tablespoons olive oil",
"0.5 onion, diced",
"1 clove garlic, minced",
"0.25 cup diced tomatoes, drained",
"5 cups chicken stock",
"0.5 cup red lentils",
"0.25 cup fine bulgur",
"0.25 cup rice",
"2 tablespoons tomato paste",
"1 tablespoon dried mint",
"1 teaspoon paprika",
"0.5 teaspoon cayenne pepper",
"salt and ground black pepper to taste" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Heat oil in a large pot over high heat. Add onion and sauté until beginning to soften, about 2 minutes. Stir in garlic and cook for 2 minutes. Add diced tomatoes and cook for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Stir in chicken stock, lentils, bulgur, rice, tomato paste, mint, paprika, cayenne pepper, salt, and black pepper; bring to a boil. Reduce the heat to medium-low and simmer until lentils and rice are tender, about 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "Purée soup with an immersion blender until smooth."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Princess"
},
"reviewBody": "I substituted the paprika for chili powder. I had to lower the flame when I noticed the tomatoes getting burned. Very thick, not soupy but tasted good. I followed and this is how it came out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "treadpath"
},
"reviewBody": "Really tasty! I didn't have fine bulgur, so I used buckwheat groats instead (kasha). I also added a little smoked paprika at the end. I will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "nazliattaran"
},
"reviewBody": "Followed exactly. It was really spicy and not much flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "yemik2707"
},
"reviewBody": "So tasty loved it! Made minor replacements because I was out of some things. Used Basil instead of mint and 5 bouillon cubes Mixed in 5 cups of water (FYI-do not and any extra salt if you make this way) instead of chicken stock."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "web_lds"
},
"reviewBody": "Fantastic spicy soup, perfect for a winter day! I make whole wheat bread and serve with this. My family raves over it. Thank you for the recipe, it tastes just as good as the Turkish restaurant nearby."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angie"
},
"reviewBody": "I added cumin to this because my mom aways did. Came out delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Korpak Bechtel"
},
"reviewBody": "Mmmm….comfort food! Amazing flavor, texture and easy to make. I used fresh tomatoes and mint from our garden (peel and chop tomatoes and finely chop mint and double it’s quantity since it’s fresh.) Used extra mint for garnish. As another reviewer suggested, I used crushed red pepper flakes instead of cayenne and adjusted for heat. I doubled the recipe since we like leftovers and it tastes even better the next day. I didn’t have bulgur so I went with all rice, and look forward to using it as written in the future. The rice made it smooth and mild; I’d imagine it to be a little more hardy with bulgur. Soooooo good! Family loved it. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Adrienne Velthoven"
},
"reviewBody": "Made as is and LOVE IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joko"
},
"reviewBody": "This is fantastic, I served with garlic Naan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jeremy Dennis"
},
"reviewBody": "First of all do not trust any recipe for red lentil soup that doesn't contain cumin.\nSecondly, 14 minutes of high heat will absolutely cremate your onions. the quarter cup of diced tomatoes will not save them. It is just too hot and too long.\n\nWhat i made was basically a tomato soup. It was a pretty good tomato soup, but i ended up picking out a lot of burnt black onions from my teeth. Surprisingly they did not seem to ruin the flavoring. The soup was sweet, thick, the only heat coming through was the cayenne pepper. \n\nThere are better recipes out there for turkish red lentil. It was interesting to try this one to compare. What am I going to do with the rest of this fine bulgur? I don't want to make tabbouleh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Noelle Tym"
},
"reviewBody": "Very good soup. Mine did not turn out with this pretty orange color, maybe because I used a veggie stock that was brown colored? I added some sumac to it which is a spice often used in Middle Eastern cooking. Otherwise I followed the recipe exactly. I didn't have any trouble with the directions of the recipe. I just wished it had turned out a little more \"wow\" like. I probably won't make it again. But I will definitely ask to have it when I visit Turkey in 2022."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Anna Fiala"
},
"reviewBody": "I have been making this recipe for years. The only changes I make are to substitute Cayenne pepper with double amount Aleppo Chile Pepper that I bought in a Turkish store. I also usually add about a half a teaspoon of ground cumin."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "S Rana"
},
"reviewBody": "i’d recommend more liquid. i had to add another cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "This soup was very flavorful but not heavy. Would definitely make this again. A Turkish friend had given me some Turkish red pepper so I used that in place of the cayenne. We will add some leftover roasted chicken to the leftover soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "trish"
},
"reviewBody": "Loved this soup - I used vegetable instead of chicken stock as well as fresh mint. Divine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Pat"
},
"reviewBody": "I had to add more liquids. Its a great winter soup, tastes divine - I followed the recipe exactly - but even after blending it was way too thick for a soup. I added an additonal 1 cup pureed tomatoes and 2 cups water and that turned out good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carmen"
},
"reviewBody": "Yummy, easy, healthy and cheap! Love it with lemon wedges or lemon juice in a pinch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teri"
},
"reviewBody": "Used four cups of chicken broth and one cup water, and it was awesome."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "missmudd"
},
"reviewBody": "I did this in my stove top pressure cooker, it is awesome. cooked for 15min at high and then allowed natural release, needed more water as it kinda stuck to the bottom but otherwise YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bevjern"
},
"reviewBody": "This soup is delicious, I had it several years ago in Istanbul and found this recipe when I returned home. The recipe is perferct, though I use fresh mint. Also, we are meat eaters so after soup is finished cooking, I remove it from the dutch oven and pour in blender and blend, I leave it in the blender and sauté Hot Italian Sausage in the dutch oven and remove the grease. I then pour the soup back in the dutch oven over the Italian Sausage and it is amazing - I serve with some crusty French or Italian bread, I have served this to just family and for a dinner party and it is a hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mary D"
},
"reviewBody": "This is delicious. I doubled the amount of red lentils and used crushed Aleppo peppers instead of cayenne. Lemon juice and fresh mint make good garnishes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "arc"
},
"reviewBody": "Used 1 cup diced tomatoes because I had no tomato paste, and 1 cup vegetable broth + 2 cups water + 2 cups vegetable juice because I also didn’t have any chicken stock. I didn’t blend it, either, but I like it just fine unblended. A good, hearty, flavorful soup with a spicy kick!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "helanour"
},
"reviewBody": "One of the best lentil soups ever, kids loved it, will be part of our menu."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerri"
},
"reviewBody": "Making it again, only change I I’m tripling it! Sooo good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Halley Davis"
},
"reviewBody": "This is an amazing recipe! I didn't have any Bulgar, so I just ground up some quinoa in the coffee grinder, and wala! It was perfect!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mrs. Herb"
},
"reviewBody": "I added a can of Ro-tel tomatoes and reduced the broth to 4 cups. I think I'll follow the recipe as written next time. My changes were ok, but I'd like to try it again as written."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingwithlove"
},
"reviewBody": "Delicious! Just like the one at our local Turkish restaurant. I added cuscus because I didn't have bulgur and it worked just fine. I blended most of it and you couldn't tell if it was bulgur or anything else. I did not add salt and I used 1 cup of red lentils. I like it a bit thicker. I also sauteed the onion for 10min in coconut oil until translucent, added the garlic let sauté for 1 more min then followed the instructions. I do that with all the recipes that call for onions. Makes a difference. Thank you Jenna for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingwithlove"
},
"reviewBody": "Delicious! Just like the one at our local Turkish restaurant. I added cuscus because I didn't have bulgur and it worked just fine. I blended most of it and you couldn't tell if it was bulgur or anything else. I did not add salt and I used 1 cup of red lentils. I like it a bit thicker. I also sauteed the onion for 10min in coconut oil until translucent, added the garlic let sauté for 1 more min then followed the instructions. I do that with all the recipes that call for onions. Makes a difference. Thank you Jenna for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "blaugranamd"
},
"reviewBody": "Good flavor, but I have now made this twice exactly as described and each time it comes out with the consistency of hummus dip. Tastes great with some Naan or pita chips but hardly qualifies as a soup. Not sure what I'm doing wrong..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "aurea"
},
"reviewBody": "My husband is Turkish, and I need to say this soup is just amazing!!!! It is delicious and with all the turkish flavors!!! All my family (including 3 small kids) love it!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michele Brignoni"
},
"reviewBody": "Delicious! I never post reviews but this was THAT good! The yield was 4 cups. WW Smart Points 6 per 1 cup"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kkgotchall"
},
"reviewBody": "Aside from adding extra cayenne and garlic I pretty much follow the recipe on this one. It tastes great, is healthy, fast/easy and low cost. Excellent option when you have few fresh ingredients and need to raid the pantry. Best served with naan but flour tortillas work for us. Oh and I definitely agree with the others, a squeeze of lemon is recomended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Austin"
},
"reviewBody": "made a double batch of this with several minor changes. i used vegan chik'n broth and a little canola oil rather than butter. i was a bit generous with the lentils, doubled the garlic, reduced the cayenne to 1/4 of the stated proportion, added a small pinch of cumin, and substituted quinoa for the bulgur and rice. also, i increased the tomato paste because i did not want to open a can of diced tomatoes. the soup tastes EXCELLENT. very flavorful and distinctive. it was easy to make, too. i have had a lot of disappointments with new recipes i've tried lately, so this was like therapy. thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Nixon"
},
"reviewBody": "My husband and I go to a Turkish restaurant not too far away, and they serve a delicious red lentil soup that we try to replicate--and wow, I think this recipe hits the spot! It's very simple to make and the ingredients are relatively easy to find if you know where to look.\n\nWe follow the recipe except we had to make a few substitutions: we used the cubed chicken bouillon just because I hardly ever had the canned or boxed stock on hand. We couldn't find fine bulgar so we used red quinoa instead! Still delicious. The recipe doesn't specify what time of rice to use but we had basmati rice on hand, so that's what we used. I imagine if you used a shorter grained rice, the result would be a thicker soup which I'm sure you could thin out with more stock. We also used fresh mint instead of dried and nearly doubled the amount but I'm sure that can be adjusted to taste.\n\nMy husband and I gobbled this down! So glad to find this delicious soup! We will continue to make it again and again! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mariam Ahmed"
},
"reviewBody": "i replaced bulgar with quinoa,used fresh mint , 6 cups of broth and a pinch of cayenne since the recipe amount was too much and made it too spicy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MacFadden"
},
"reviewBody": "This was really good. After thorough pureeing, it was remarkably creamy. I used vegetable stock and jasmine rice because that was the only white rice I had, and put in an almost imperceptible pinch of cayenne, but otherwise followed the recipe. It turned out very tasty and I will make it again with the same slight adjustments. I was worried about the jasmine rice giving it an unintended flavor, but I liked the result. It was a very thick soup, so I think next time I will give it another cup of water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Aaron Milic"
},
"reviewBody": "I come here mostly for the soup recipes and this is hands down my least favourite. Basically spicy baby food. I'll admit I couldn't find any dried mint so maybe that was the secret weapon but without it, it's pretty meh."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Olga Rosario"
},
"reviewBody": "Yesss I've tried this recipe. Always loved the red lentil soup at my local turkish restaurant. Well i decided to try and make it. and I have to say it's very close if not the same as theirs. It's delicious and very easy to make. i bring leftover to work with a salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Russell Mitchuk"
},
"reviewBody": "Fabulous soup. Best soup I've had from this site. Made it exactly as shown."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "scarlett"
},
"reviewBody": "I make this once a month and freeze it . I warm up some pita bread n butter with it it's delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephane Bibeault"
},
"reviewBody": "Wonderful soup, I made the mistake of using whole wheat bulgur, which, even if there is only 1/4 cup of it in there, is a bit overpowering. Also, I don't think the lemon should only be mentionned as an optional garnish, it really makes the soup shine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SugarJ85"
},
"reviewBody": "This recipe is phenomenal - tastes just like at the Turkish restaurant I go to. I used 1/2 cup of quinoa in place of the bulgar and rice. I used 3/4 cup of red lentils. I needed to up the liquid to 55 oz of chicken broth. I 1.5'd all the spices (so 1.5 tsp paprika, 1 tsp cayenne, 1.5 tbs mint). Threw in a shake of onion powder and garlic powder. 3 cloves of garlic. Used 3 TBS of tomato paste and 1 plum tomato diced by hand instead of the diced tomatoes. SO DELICIOUS!\nUPDATE: This is now a weekly meal in my house. My boyfriend can't get enough of it - he literally pours it into a coffee mug and just drinks it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Chantellis"
},
"reviewBody": "We loved this soup so much that within days we made another batch to freeze!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Heidi"
},
"reviewBody": "I have been using allrecipes.com for years and have never bothered to write a review. However, this soup is so good, that I would be doing the public a disservice if I did not ever write one for this soup. I love, love, love this soup. I make it exactly as written, but I'm often out of mint; it tastes just as fine without it. I sometimes add a dollop of sour cream or some heavy cream if I need some more comfort with my meal. I have doubled and even tripled the recipe without a hitch. Tell your friends and family... this one's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krazkat1"
},
"reviewBody": "Not a fan of lentils, but love this soup!\n\nI made a few substitutions, based on what I had on hand. Used regular lentils (1 cup), no rice or bulgur. Fresh tomato, not canned. Chili powder to replace cayenne pepper. Pumpkin puree (yes, Libby's pumpkin) instead of tomato paste. You can't taste the pumpkin. Used as a thickener. Pureed the soup with my immersion blender. Great stuff!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Dilbeck"
},
"reviewBody": "Yummy!! I added lemon juice and used butter instead of olive oil. I omitted cayenne pepper. Served each bowl un puréed (I enjoy the textures!!) with a dollop of Greek yogurt. The mint &amp; lemon are a delicious combination."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kit Willihnganz"
},
"reviewBody": "Way too much spice! I'll try this again without the cayenne."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cowgirll"
},
"reviewBody": "Wow. Cayenne and mint are my new favorite power couple. The only change I made was to use fresh mint instead of dried (and adjusted the measurement accordingly) since I had some to use up. This soup and a loaf of bread with some soft cheese made a perfect dinner. YUM."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FlamingoFanatic"
},
"reviewBody": "I wasn't sure what the finished soup would taste like, but I had all the ingredients so I gave it a try, and it's absolutely delicious! Since I used some leftover RoTel diced tomatoes with \"hot\" green chiles, I cut the cayenne pepper down to a 1/4 tsp. Lastly, after pureeing it to not entirely smooth, I stirred in about 1.5 Tbsp. fresh lemon juice. That just put it over the top!! I'm sure I'll make this often, it's SO good...thanks, Jenna. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lookingbird"
},
"reviewBody": "We really enjoyed this one. I had no wheat, so I used double the rice (used brown), and cut the cayenne to a pinch. My toddler ate three bowls!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Gerace"
},
"reviewBody": "This soup is absolutely delicious! I first made it about 1-1/2 years ago and it instantly became a family favorite. My husband, who used to not like anything spicy hot, told me the first time he tried it that it needed to be hotter! (I used only 1/4 tsp cayenne the first time).\n\nWe use olive oil (although today I'm trying coconut oil) and a vegan chicken broth to make it a completely vegan recipe. I also use 3/4 - 1 whole cup of red lentils because I love them, and 1/2 cup bulgur wheat - omitting the rice, because it's just easier since we don't eat white rice, and I don't want to deal with brown rice cooking times.\n\nThanks for an AWESOME, healthy, scrumptious recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blueskyethunder"
},
"reviewBody": "Love, love!! Reminds me of delicious Turkish food!! Oh how I miss the food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Wendy Deveaux"
},
"reviewBody": "Made it exactly as per recipe and it was/is delicious!! I lived in Turkey for 4 years and this brought me back to all the delicious food! Perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SHOCK1970"
},
"reviewBody": "This was very good. Like another reviewer, I also doubled the amount of onion and garlic. I also substituted the bulgar wheat with quinoa to keep it gluten free. Thanks for sharing this!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "hj"
},
"reviewBody": "found it a little spicy with 1/2 tsp cayenne, will cut that back a bit in future batches. Excellent flavour though; enjoyed it a lot."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "roux222"
},
"reviewBody": "This soup is fantastic. Very easy to make, absolutely delicious, and very filling. I definitely ate too much. Can't wait to take leftovers to work tomorrow!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Helene"
},
"reviewBody": "Made this recipe for a friend that needed it to be Kosher, so I used vegetarian broth; at the same time I made it with chicken broth. Didn't have bulgar, but used brown rice and red lentils and everything else except cayenne. Had fresh mint so used that. Pureed the soup and it is wonderful. So happy to be able to provide my friend with a hearty bowl of soup. Thanks for posting this. Would enjoy making it again with the bulgar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MTRmenian"
},
"reviewBody": "Update: I make this recipe almost every week now. I love it and crave it! I use 1/2 cup of bulgur and no rice. I always add extra garlic. It also tastes great with green or brown lentils; it's just not as pretty without red lentils. I also skip the whole blending step simply because it's less to clean up. If it is too spicy for some people, add in a little sour cream to their bowl. Still delicious! Thanks for sharing the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARIANAATD"
},
"reviewBody": "We really loved this one! I used more lentils than bulgur/rice. Added more paprika/cayenne to the bowls for the grown ups. Made it look pretty and taste better. I did not have stock so used water instead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Smith"
},
"reviewBody": "This is ezogelin soup, a traditional Turkish soup that was supposedly invented by an unhappy bride (gelin). Here in Turkey, it can be thrown together with basic ingredients found in any kitchen. This version tastes exactly like the soup you'll get at a family dinner or a kebap shop. Ezo the bride probably peeled and chopped her own tomatoes, but in this recipe the canned version works just as well. For a more robust taste, try sauteeing the tomato paste with the vegetables for a couple minutes before adding the chicken stock. Watch it closely at the end as the grains might soak up too much liquid and start sticking to the bottom. Also, crushed red pepper flakes are more traditional than cayenne pepper. Sprinkle on top and add a sprig of mint and a lemon wedge on the side for restaurant-style service."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DZALAR"
},
"reviewBody": "This is amazing!! I doubled the onion and garlic; used double the stock and 1 lb of lentils. I didn't have rice so used 1/2 c bulgar. no diced tomatoes either so use about 1/3 c tomato paste. doubled cayenne and paprika - superb! I didn't even wait to blend it, just broke off some hearty chewy bread and dug in. This rivals the soup I discovered in a Turkish restaurant in Cleveland."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Meredith"
},
"reviewBody": "Absolutely delicious and bright. I added only 1/4 tsp cayenne which was perfect for my tastes, and I used two cloves of garlic. It looked so good unblended (and the photo in the recipe is unblended) that I tasted it blended and not blended. I don't see the need to blend this unless you prefer the texture, but it tasted better and had better texture to me unblended. I will make this again, so easy and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shalvie"
},
"reviewBody": "I loved this recipe, I had a cold and the cayenne pepper really cleared me up. I didn't have any tomato paste so i used some of the juice from the canned tomatoes and I used brown rice because I don't eat white rice. If you do use brown rice I would recommend using a bit more so it still resembles soup at the end of cooking. I have found that I need to add water to every reheat to give it a soup consistency again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jklozowski"
},
"reviewBody": "Heat: recipe starts with High heat and gives no clarification for the steps thereafter. Result: burned soup\r\n30 minute cooking: recipe gives no indication of covered or uncovered or partially covered. Result: unable to achieve required consistency.\r\nSpices: Use 1/4 or 1/2 tsp paprika to start with. Skip the cayenne. Spices are a supplement or an enhancer - not an overpowerer. If you've ever been to New Orleans, you'll know what I'm talking about as they (generally) know how to use the hot spices appropriately."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shelle"
},
"reviewBody": "I highly recommend this extremely healthy, hearty, and delicious soup. Make exactly as stated. If you are sensitive to spicy food watch the amount of Cayenne and Parika you use. We like the kick so no changes here! This filling soup is perfect to warm you on a cold day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sueb"
},
"reviewBody": "I eliminated the oil, used water instead of stock, and changed the bulgar to couscous. I added the couscous just 5 minutes before serving. This smelled delicious and tasted great! Thanks for a wonderful recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MommaJ9"
},
"reviewBody": "I am in Turkey right now, learning how to make Turkish dishes and found this one. It has been a hit so far in my family especially with my husband. Says it tastes like something you would find in a restaurant. I love it too because I always seems to have these ingredients on hand."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/219817/turkish-red-lentil-soup-with-mint/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
"name": "Beans and Peas"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/14726/soups-stews-and-chili/soup/beans-and-peas/lentil-soup/",
"name": "Lentil Soup Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/219817/turkish-red-lentil-soup-with-mint/",
"name": "Turkish Red Lentil Soup with Mint"
}
}
]
}
}
, "about": [
]
}
]