				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ube-Macapuno Cake"
,"datePublished": "2020-06-18T23:09:10.000-04:00"
,"dateModified": "2022-09-08T10:22:27.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Jackie"
,"url": "https://www.allrecipes.com/cook/24323891"
}
]
,"description": "Filipino ube cake is made with purple yams, filled with macapuno (coconut preserves), and frosted with sweet buttercream for a gorgeous 3-layer cake."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/zZqfdrtFY1jrSEf1RooRU_P16HM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8018-a18aeab732b04bc78a560ed47b6daeab.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ube-Macapuno Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "3.7",
"ratingCount": "49"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "714 kcal"
,"carbohydrateContent": "75 g"
,"cholesterolContent": "168 mg"
,"fiberContent": "1 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "13 g"
,"sodiumContent": "469 mg"
,"sugarContent": "36 g"
,"fatContent": "44 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"2.5 cups cake flour",
"3 teaspoons baking powder",
"1 teaspoon salt",
"1 cup ube (purple yam), cooked and finely grated",
"0.75 cup milk",
"1 teaspoon vanilla extract",
"7 egg yolks, lightly beaten",
"0.5 cup corn syrup",
"0.5 cup vegetable oil",
"7 egg whites",
"1 teaspoon cream of tartar",
"1 cup white sugar",
"6 drops red food color",
"6 drops blue food coloring",
"1 (12 ounce) jar macapuno (coconut preserves)",
"1 cup evaporated milk, chilled",
"0.75 cup white sugar",
"1 cup butter, softened",
"1 drop violet food coloring" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 325 degrees F (165 degrees C). Line the bottom of three 9-inch round pans with parchment paper, but do not grease."
} ,{
"@type": "HowToStep"
,"text": "Make the ube cake: Mix flour, baking powder, and salt together in a large bowl; set aside. Place grated ube in a large bowl. Combine 3/4 cup milk and 1 teaspoon vanilla; gradually blend into ube until smooth. Blend in egg yolks, corn syrup, and oil. Beat in flour mixture until smooth; set aside."
} ,{
"@type": "HowToStep"
,"text": "Combine egg whites and cream of tartar in a large bowl; beat with an electric mixer until foamy. Gradually add sugar, then red and blue food coloring, continuing to beat until stiff peaks form. Fold 1/3 of the whites into batter, then quickly fold in remaining whites until no streaks remain. Pour batter into prepared pans."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 to 35 minutes. Invert pans on a wire rack and let cool upside down. When cool, run a knife around the edges to loosen cake from the pans. Spread coconut preserves onto the cooled cake layers; stack layers on a cake stand or serving plate."
} ,{
"@type": "HowToStep"
,"text": "Make the buttercream: Combine evaporated milk and 3/4 cup sugar; set aside. Combine butter and sugar in a large bowl; beat with an electric mixer until smooth and creamy. Beat in food coloring, one drop at a time, until the desired tint is achieved. Frost top and sides of cake with buttercream."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT60M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cyber Netguy"
},
"reviewBody": "Not bad, made some modifications to recipe. Sub, milk with coconut milk. Added Philly cheese to frosting for creamy results."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pardillolaica"
},
"reviewBody": "If you like Ube this is a good recipe, you can also check best restaurant in Quezon City if you don't like to bake but want to eat sweets."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "macnsteel"
},
"reviewBody": "Cake. Well I substituted purple sweet potato for ube. It was great. \n\nIcing, would NOT work in this recipe. The butter would. Ream then the moment I added the cold milk/sugar mix, it would seize and not mix. In the end, the icing I did get was watery and far more milk than I ever used. I would probably recommend a more standard buttercream over this version."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kate o’ Withrow "
},
"reviewBody": "This recipe was greatly appreciated. Thank you so much for sharing. My results were more dense than they should have been. The addition of the egg whites lightened the color of the batter so much that I felt I needed to add more food color and I lost some volume at that point. The flavor was lovely though. I used liquid coconut oil for a boost in flavor. I’ll try this again but I think I’ll use ube halyala as some other recipes suggest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Cherry Dasmarinas Marcia"
},
"reviewBody": "Cake was good, but l added more ube halaya (ube in jar). Frosting didn't do well. Did my own butter frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Angel Cherry De Villa"
},
"reviewBody": "Too much waste on the icing... i should have made my own buttercream icing... waste of time..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "hanan"
},
"reviewBody": "I've always loved ube cake...and I'm so glad I found a good recipe that works! some of the reviews I read had me hesitating but I'm glad I followed through. I improvised and discarded an ingredient (corn syrup) since I didn't have one, i also beat the sugar with the egg yolks instead. I halved the recipe just to see if it would turn out well. I made a runny liquidy type of frosting (if you would call it that) that used whipped condensed milk with butter, something I learned from a nearby pinoy restaurant that does so. Definitely recommend to try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Craig Merchant"
},
"reviewBody": "Good tasting, nice dense cake structure. I couldn't find coconut preserves so I used a coconut cream that I made for in between layers. Also, I used half crisco and vegtable oil because in the past I found the all veg oil cakes to be dry. The flour mixture turns a little gray until you add the food coloring though I couldn't quite get the bright purple back. I left the frosting white for better presentaion contrast and added a cheddar cheese garnish (after doing some research). All in all, a nice cake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "stephanie"
},
"reviewBody": "I used preserved Ube for this recipe as purple yam isn't always available in-store. It was very sugary. The cake was moist but too grey. The icing was a total fail. Will not do this recipe again, it's very disappointing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Cath"
},
"reviewBody": "Warning: Icing ratios are wrong. Think about it--I cup of evaporated milk and 3/4 c of sugar is NOT going to work with a cup of butter. I salvaged by starting over with 1 cup butter, and gradually added the evaporated milk icing disaster mix alternately with icing sugar (which is not called for in the recipe). Additionally, the cake mix itself had incorrect amounts, and I ended up with way too much cake batter. This recipe is imperfect, needs adjustment, and was very disappointing. I also used every single bowl I owned--too much work for too little return."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "PILover"
},
"reviewBody": "The recipe does say to add until the right consistency but I added the whole1 cup. I got soup. Start with 1/2 cup (max), you can always add more milk."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jobie Queen"
},
"reviewBody": "Always a hit! Can be an acquired taste to some. I follow the exact recipe but made them as cupcakes!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bborrow"
},
"reviewBody": "This recipe is not good at all. Sorry. I followed this closely and the cake I find is tasteless, dry yet a dense cake. So sorry... will not be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sliceofheaven"
},
"reviewBody": "Best recipe I found in the internet I made them last night. Just rectify the buttercream icing I used my World's best Swiss Style Buttercream for the frosting and layered the Macapuno all over the cake layered. Cake doesn't turn out dry because it depends on how long you bake it and how did you mixed the ingredients.This cake is an oil based recipe so even if you keep them in the fridge it will stay moist. I am making this for a birthday cake on Sunday :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LSBUI"
},
"reviewBody": "After reading several other reviews and following my own gut I made couple changes on this recipe. For one, I added extra food coloring to get a vibrant color. I used about 3 tsp of each red and blue. I also mixed the ingredients slightly different, I added the salt into the egg whites to make them stiff and fluffy. I did not add anything else to the egg whites and added the rest to the batter. I also beat the batter as minimal as possible, just enough to get everything incorporated since this seemed to make the cake dry. I also decided to make cupcakes because I wanted small portions, this made 24 cupcakes exactly and took 20 minutes to cook. I topped with a coconut cream cheese frosting and shredded coconut. I took them to work and set them in the break room, they were gone by lunch and went over well:) People seemed to like the exotic food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "bellastorm"
},
"reviewBody": "Very disappointed with this recipe as I tried and tested it and it was too dry. It's a shame that when people put a search on this recipe on Google it is at the top of the search page and this recipe is NOT the true representation of what makes a really good and favorite Filipino dessert. I say the 2 1/2 cups of flour should have been 2 cups instead, then it wouldn't be so dry! What a shame...I hope people will try again after being disappointed with this recipe and look at alternative recipes online."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fay W."
},
"reviewBody": "I've had this cake before at a Fillipina's birthday but after following this recipe to the letter, and doubling the food colouring, it still didn't turn out as purple as the photo or the previous cake. Do you use paste colour like what's used for cake decorating? I also noticed that the cake was a little heavy - by chance do you use Extra Large Eggs. My favourite angel food cake calls for 1 1/4 cups of egg whites so it doesn't matter what size eggs are used, because you always have the same amount of whites at the beginning, making the results consistent. Do you chop up your coconut sport? Everyone in our household loved the taste, but I'd like to tweak some areas of the recipe before I bake it to take it. Thanks Jackie (It's very tasty)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jacqueline T"
},
"reviewBody": "this is a great cake! i made it for a friend's bday and everybody loved it. though i did make revisions as follows: 1. it says bake 30 to 35 minutes, but i only baked it for 25 minutes. The result is that it was moist and not dry as some of the other reviewers said. 2. I made my own coconut buttercream icing using 2 cups butter, 1 cup sugar, and about half a cup of pureed macapuno. I placed the buttercream on top of each layer then the macapuno. Then covered the whole cake. the buttercream keeps the moisture of the cake in. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "taray83"
},
"reviewBody": "I followed the recipe step by step. But to my surprise, mine turned out dense. It's probably cuz my oven is electric and is so old. For the buttercream frosting. I chilled the evaporated milk, and still, for the third time, all I got was curd. the milk and butter didnt blend at all. I'll give it another try this week though..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "christinawu"
},
"reviewBody": "It tastes pretty good. However, it turned out light purple. You will need to use more food color to have a deep/really purple Ube Cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Arlen"
},
"reviewBody": "Turned out very good!!!! Next time I'd skip the salt. I doubled the food color just as another user has suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "kryssstle"
},
"reviewBody": "I did not care for this recipe. I followed the steps carefully and the cake turned out too salty and lacking ube flavour, or flavour of any sort. As some people have said, it also took a lot of work. As for the \"butter icing,\" I had to make 2 batches, and it failed both times. All it does is curd. I do not suggest anyone to try this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "legof"
},
"reviewBody": "My cake turned out an 'grey' color.. I used standard food coloring available in the grocery store."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "joy"
},
"reviewBody": "This was my first sponge cake. I decided to use the batter to make a roll. It was light, moist and spongy. Perfect batter. I sifted flour first, then measured. I added shredded coconut on top and coconut extract to frosting. I used 1/2 the liquid in the frosting and had to add more sugar. I also used frozen taro puree that I picked up in my local Asian market to save time. My entire family loved this cake! The only thing that needed improvement was the frosting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "miamaya"
},
"reviewBody": "Fantastic recipe! followed all the instructions and my cake turned out perfect considering it was my first time to bake a cake. I changed my frosting though based on the previous reviews and use french buttercream icing instead and it was a success! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vil"
},
"reviewBody": "I made this yesterday for our family dinner every body loves it.The color is beautiful and the cake is moist and delicious.I couldn't find yam so i mashed some sweet potato added some yam paste and yam flavour which i also used as my filling because i couldn't find macapuno here(Malaysia).Thanks a lot for sharing this excellent recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arvee"
},
"reviewBody": "I made this into cup cakes. It was a hit. Don't chill the milk, it will curd the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "nolander"
},
"reviewBody": "Overall, I thought the cake lacked depth of flavor. I followed the recipe as written, processing the ube by scrubbing and boiling it before peeling and cubing it to put in my food mill. I certainly didn't get the deep purple color shown in the picture even with the food coloring. I didn't get the flavor that is typical of the ube cakes I've tasted at parties. However, I don't know if those cakes were enhanced with additional, perhaps artificial flavorings since none of them were homemade. Next time, I'll try roasting the ube before mashing it to see if that will enhance the flavor. The texture, however, was fine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lovesbaking"
},
"reviewBody": "I haven't tried baking this, but i've seen comment about icing doesn't work. I have been baking cakes with this icing recipe (but I used 1:1 ratio evap milk &amp; sugar) - make sure the sugar dissolved very well &amp; the container you're using is dry, not a drop of water. Also, make sure you add the milk/sugar mixture into the butter little by little. Try it. Everyone who tasted this butter icing says it good. For more ube flavor, add a teaspoon of ube flavoring."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lorio"
},
"reviewBody": "I used ube powder instead of grated ube and added 1/4 cup more milk to the mixture because of it. The cake turned out great and it tasted good too. I didn't use the frosting included with this recipe, though. Thanks for the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "cupcakegurl"
},
"reviewBody": "the cake was moist but gray and the icing did not work at all..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meggie448"
},
"reviewBody": "I am half Phillipino and so I guess thats why I liked this cake better than most."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "sweatybetty"
},
"reviewBody": "the cake was dry, i do a lot of baking, the recipe is just like a chiffon cake minus the corn syrup and ube. i'm sorry just was disappointed, esp. on the icing. i should have followed my instinct that the ing. should not be equal volumes. i ended doing another batch of butter icing the proper one."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "always_hungry"
},
"reviewBody": "Note: Ube (pronounced \"OOH-bee\") is also available in a jar, precooked and mashed. It can also be found in a packet in the frozen section. Many Asian stores sell either form of ube. Sometimes its labeled as \"ube\" or \"purple yam\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cooks4Happiness"
},
"reviewBody": "I love purple yams and was looking for a purple yam cake recipe after I tried it at a birthday party, and wow! I love this recipe! I made them into cupcakes and baked them for 13 minutes. So delicious, moist, and fluffy. I added the 1/2 cup of macapuno to the frosting (and used condensed milk instead of evaporated milk) and it was great (although very very sweet). I also didn't add color to the frosting because white was a nice contrast. I also had to double the food coloring in the cake batter because it wasn't purple enough (was grayish). This cake was a lot of work but well worth it, I LOVE it! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "garcia722"
},
"reviewBody": "This recipe was good, but still not the ube cake recipe I was looking for. I actually cut this recipe in half and did them in cupcake form, and reduced the baking time to 15 minutes. I took the advice of others and I didn't even bother with the butter icing recipe given. Instead I did my own buttercream icing and I added shredded coconut to it. It gave the icing a nice texture and great flavour to the cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "IAgardener"
},
"reviewBody": "NOTE: Use condensed milk instead of the evaporated and the icing will turn out. If you don't beat the batter too long the cake is not dry and doesn't crack. This was a work of love to make as is any from scratch recipe. Yes, I am a filipina."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "burn"
},
"reviewBody": "cake was a little dry. making the batter was ok.but the butter icing did not work at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bes"
},
"reviewBody": "I have to say one thing. Ube is one of those foreign dishes that is difficult to appreciate. You either have to be very open minded or have a native filipino tongue (assuming all native filipinos have eaten ube one time or other in their lifetime) to really enjoy this dish and appreciate ube for what it is. Thank you for providing this recipe to allrecipes.com!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried the recipe and followed it word for word. The cake was dry and it was too much work."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I made this cake for christmas eve dinner. I didn't make it a three layer cake. I used a spring form pan and just cooked it for 55min. the butter frosting for some reason just didn't work for me so i mad my own butter frosting. I served very small slices so as to not kill any one.lol(all the eggs and butter) But my family loved it. Would make it again if i was doing a philipino theme dinner again"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/51518/ube-macapuno-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
"name": "Asian"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
"name": "Filipino"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/51518/ube-macapuno-cake/",
"name": "Ube-Macapuno Cake"
}
}
]
}
}
, "about": [
]
}
]