				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ukrainian Cabbage Rolls"
,"datePublished": "2000-03-12T11:19:27.000-05:00"
,"dateModified": "2022-10-20T20:26:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "starbuck"
}
]
,"description": "Rice wrapped in steamed cabbage leaves, covered with tomato sauce, and baked."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/vLRPZYJwT1OeTM6-G_Wd9hTQg6o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4481394-b9691558f2de408194f580d85663687f.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ukrainian Cabbage Rolls"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "57"
}
,"cookTime": "PT120M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "207 kcal"
,"carbohydrateContent": "40 g"
,"cholesterolContent": "8 mg"
,"fiberContent": "3 g"
,"proteinContent": "6 g"
,"saturatedFatContent": "2 g"
,"sodiumContent": "521 mg"
,"sugarContent": "7 g"
,"fatContent": "4 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 medium head cabbage",
"1.5 cups uncooked white rice",
"2 tablespoons butter",
"1 onion, chopped",
"salt and pepper to taste",
"1 (46 fluid ounce) can tomato juice" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 325 degrees F (165 degrees C). Grease a 2 quart casserole dish."
} ,{
"@type": "HowToStep"
,"text": "Steam the whole head of cabbage until it is al dente. Meanwhile, in a saucepan bring 3 cups of water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Melt butter in a small skillet over medium heat. Saute onion until translucent; stir into cooked rice. Season with salt and pepper to taste."
} ,{
"@type": "HowToStep"
,"text": "Cut the leaves off of the cabbage and cut the larger leaves in half. Spoon 1 tablespoon of rice into a leaf and roll tightly. Place rolls in prepared casserole dish, stacking in layers. Pour tomato juice over the rolls, using enough just to cover."
} ,{
"@type": "HowToStep"
,"text": "Cover and bake in preheated oven for 2 hours."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT150M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a Christmas Eve dish for us. My uncle would make them with Kasha, onions, dried mushrooms, etc. While I made everything else. Today. I put in the oven. Made with Buckweat that I toasted, rice, onions, garlic, dried mushrooms and mushrooms, salt and pepper. Plain tomato sauce and small diced tomato over the top...... The filling. The balance and depth of flavor is awesome. Earthiness of the toasted Buckwheat and dried mushrooms, sweatness of onion with a back tone of garlic. Fresh ground black pepper that comes at the end..... Mmm, tasty"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karataronno"
},
"reviewBody": "I cooked my rice in the slow cooker, then added the sauteed onion and some Italian herbs. I also used homemade marinara sauce on the cabbage rolls."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa Gale"
},
"reviewBody": "Thanks for the basic, simple GOOD recipe!\nI used my home canned tomatoes, and added pork sausage. It was delicious!\nI noticed another review mention that she had spent time in Russia. I'd like to explain to her that Ukraine has its own culture and proud traditions. It is unlikely that she experienced any of it during her time in Russia.\nHere is an educational link for anyone interested in appreciating Ukrainian culture, food and history! :)\nhttp://www.foodbycountry.com/Spain-to-Zimbabwe-Cumulative-Index/Ukraine.html"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Dr Jynx"
},
"reviewBody": "My babas cabbage rolls had a lil bit of ground pork in them and were nowhere near as big as the ones pictured, they were 2 , maybe 3 bite rolls at the biggest."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Arianna"
},
"reviewBody": "I will make this recipe again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mamabeth"
},
"reviewBody": "Excellent recipe that is just like grandma’s. We add a little salted pork to this recipe. Sometimes I make the rice with a bit of tomato juice in the water."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TJK"
},
"reviewBody": "Red sauce over White any day. I make a huge batch and freeze the extra meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kyla Duffy"
},
"reviewBody": "Great recipe! I didn't bother frying the onions and I used chopped cabbage. Still amazing! I'll definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Emma Ledford"
},
"reviewBody": "I really enjoyed this recipe! I altered it slightly (adding ground beef to the filling) but was surprised at how much my family enjoyed it-- my two young boys took leftovers for school lunch. Giving it 4 stars b/c I altered it, but may make it straight sometime soon. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maggie Hillis"
},
"reviewBody": "Delicious, and the recipe is easily adjustable. I made a much smaller amount, and since most ingredients were previously cooked, I didn't have to cook it as long. I also cooked iton slightly higher heat. I also added a little diced chili pepper. I'm a vegetarian, and as someone who has sent time in Russia, it was nice to find a vegetarian recipe from that region."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Dowbusz"
},
"reviewBody": "You are missing one key ingredient! The mushrooms! You're supposed saute chopped mushrooms with the onion and that is part of the filling. Rice by itself is boring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fluffysugar"
},
"reviewBody": "This was very good for a family that can't have meat due to health issues. I used wild rice because we can't have white rice either. It was something I would make again. I followed suggestion to boil cabbage whole. The next time I make it I will use the suggestion about freezing the whole cabbage and taking the leaves off once it's defrosted. Will be interesting to see which way works better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "LYNNIEC"
},
"reviewBody": "I tweaked this recipe a bit because I prefer a more spicier dish. Overall it was a good base recipe for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Naomi Boyko"
},
"reviewBody": "Rating this 5 stars as this is THE good basic Holubchi/cabbage roll recipe that all the personal and family versions and variations start from or build upon. I have been making cabbage rolls most of my life as taught by my Baba and Aunties. Their recipes sometimes added the ground meat or smoked ham or bacon, to the rice, whatever was handy. Now that I am the Baba myself, over the years I have tweaked recipes to suit myself, the kids and my husbands family. Hubby likes this plainer filling version made with sour cabbage leaves, which you can buy at some grocery stores, usually in the fall and winter, or make yourself, and no tomato sauce, just melted butter and water. Most often I just make with the regular (sweet) Green Cabbage. I now always buy heads of cabbage when in season (cheaper and better) and double wrap in plastic and just throw into freezer. When I plan to make a batch of cabbage rolls, I take the heads out and let them thaw in a big bowl or tub for 24 hrs. , then place them in the fridge (keep in bowl or tub as they will leak juices) until ready to use. No need to boil them this way, softer easier to roll leaves, and they bake up more tender and quicker.\nMost often we add finely diced cooked bacon and onions to the rice with some butter and salt and white pepper to taste.\nThe one thing I learned from all the ukrainian and polish women in my family and friends circle is make sure you use the correct rice!! Use a plain short grain rice, unscented unflavored, an"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth George"
},
"reviewBody": "I used this recipe for my second attempt at making cabbage rolls. I prefer small rolls and primarily rice, although I did add a little bacon and some dill to this recipe. The method of cooking the cabbage rolls was brilliant! The weekend before a friend showed me how she made her cabbage rolls and she boiled the whole head in a big pot of water. The cabbage was soggy and too cooked. This method was so easy. I'd just peel off some leaves and carry on rolling while the next leaves were gently steaming. I learned that if you chill the rice it rolls much better, particularly if you have bacon in the mixture. This will be my go to recipe for cabbage rolls from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "biguke"
},
"reviewBody": "great recipe, try slicing the salt pork into larger pieces and after frying with onions pick out the pork and add the rest to the rice\nmix, this is the way my wife likes it all the taste and none of the pork. for a different take skip the pork, add garlic and well rinsed canned sliced mushrooms to the rice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karmoore"
},
"reviewBody": "This is a true Ukranian recipe, thank you. There should not be meat in a real cabbage roll."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karenm"
},
"reviewBody": "OMG these are awesome even my picky child ate them!\r\n\r\nAfter reading the other reviews I did make a few changes.\r\n\r\nFreeze the cabbage &amp; then thaw- wow this really works!!\r\n\r\nI added 1 pack of bacon cooked and cut into small pieces.\r\n\r\nI sauted the onion in the bacon fat.\r\n\r\nAdded all the above to my cooked rice (1 cup each of white and brown minute rice)\r\n\r\nSeasoned with basil and oregano.\r\n\r\nI also used 1 can condensed tomato soup plus 1/2 can of water to dilute and poured over the rolls, I also added a can of puree diluted with another can of water as there didn't seem to be enough liquids.\r\n\r\nI actually made this ahead of time and cooked later.\r\n\r\nIt cooked (covered) at 325 for approx 45 mins and was done perfectly when i removed it from the oven.\r\n\r\nI ended up with enough left overs for another couple of meals which I plan on freezing.\r\ndefinately a keeper - this is going into my recipe binder for sure"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kotopolo"
},
"reviewBody": "I ended up changing something out of necessity. Instead of rolling into cabbage rolls I layered the cabbage and rice mixture (onions in butter, an egg to bind). Then put pasta sauce on top. Following the recipe exactly would have been ideal and I would have loved it but my cabbage had been cut in half and I had to improvise. As others have stated the basics were perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Pollard"
},
"reviewBody": "Made them today.. tip for the cabbage... Cut around core and put 1 cup of water in a deep microwavable bowl.. put cabbage in core down, put plastic wrap on top and cook on high for \"three\" 10 min times... Let cool and use!!! I also put a tin of tomato soup on the top... I added bacon and garlic also..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Cassandera Shanell"
},
"reviewBody": "made this my thoughts were looks easy and was. i actually added a few things just to try out sauted the onions with celery and a clove of garlic didn't add salt yet mixed in ground pork and half cooked rice. added soyasauce some salt and pepper... i boiled the cabbage and topped it with pasta sauce mixed with water just because i didn't gave a tomato soup. i have a a 13 month old and she ate it all up. would definitely make this agian."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sport1girl"
},
"reviewBody": "Thank you for the recipe! I truly loved this dish and it was pretty easy to make. I had never steamed a whole head of cabbage and it worked out well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Petrosha"
},
"reviewBody": "This is not an easy recipe to follow for a beginner cook."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Val"
},
"reviewBody": "My parents came from Ukraine and my mother always made her cabbage rolls with meat. Now when I make them, which come out even better than my mother's, I use 3 types of meat: pork, beef and veal and I use Italian rice. I then cover the cabbage rolls with V8 juice. They come out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "PASTAAA!!!~"
},
"reviewBody": "this recipe was amazing! instead of tomato juice we used a half and half mixture of tomato and basil pasta sauce and tomato paste watered down just enough to be poured on top. we also cooked the onions a little longer so that they started to caramelize (they were a little gooey in the finished product though) we also cooked the rice with a bit of black pepper. instead of cooking for two hours we cooked for about 45 minutes vented and turned off the oven and let it sit in there for about an hour when we needed to go to the store. it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cactus Rose"
},
"reviewBody": "Very similar to how my Ukranian Baba made them. I did make a few changes, such as chop up bacon and fry the onions in bacon grease instead of butter. I used tomato soup, slightly diluted. Cover the holopchi with cabbage leaves and roast at least 2 hours."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ketuel"
},
"reviewBody": "Excellent!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "I have made this for yrs. This is a good basic recipe for those getting started. I add ground beef or ground sausage , cooked with diced onion. I have also used Zatarins Dirty Rice(prepared as directions say). It is very good. I have also found that V-8 juice poured over the top is a wonderful alternative to regular tomatoe juice. This is an excellent recipe to let your imagination run wild with. I've even filled them with jambalaya and it was awesome. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoKi9"
},
"reviewBody": "AWESOME!!!!!!!!!!!!!! My wife and I each took part in making this dish and we LOVED IT!!!! When it was all done we put a light layer of cheeze over it and each ate two! :D The left overs we had the next day and they tasted that much better because AWESOME flavor soaked through the whole dish!!!\n\nWhen I make it again, I will add a bit more tomato into the rice, but all in all it is a great dish! :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "CookFromAlberta"
},
"reviewBody": "These are good, but I do add bacon to the rice. Instead of tomato juice, I use tomato sauce. It is much better than juice - thicker too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "onboard"
},
"reviewBody": "This is exactly as my mother-in-law made hers. I have made mine with ground beef or bought them from the stores with beef, but my husband prefers this original. I do have a super topping...mix a can of Campbell's Tomato soup with a bit of sour cream (maybe 1/4 cup) and a TBSP. or two of brown sugar, spread on top before baking and layer 3 strips of bacon over all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Shelli Johnson"
},
"reviewBody": "This was good! Adjustments made: Used tomato paste on the top instead of juice. I added fresh basil, oregano, and parsley to the rice mix as well as some fresh chopped tomatoes. Also, I didn't cook for 3 hours, I was fine with covering it for 45 min, and uncovered for 20. Using a rice cooker helped to make the rice sticky- worked well in the recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SpellswithFood"
},
"reviewBody": "I used sour cabbage and cut in fours (no need for steaming, and the leaves come off very nicely) I added shredded fresh dill and cooked salted pork finely diced and omitted the onion, the cook time is perfect, I also add a can of campbells tomato soup to the tomato juice to make it more creamier, great base recipe :D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alicia"
},
"reviewBody": "This was super delicious. I did change the recipe a bit. I used a rice cooker for the rice instead of cooking it stovetop and just dumped it in with the onions after I was done with them. I also added rosemary to the filling. Instead of tomato sauce, I just chopped up 2 sweet hand picked tomatoes and threw it on top of the cabbage rolls. As well, I simmered it stovetop on the lowest setting instead of baking it. I will definitely be making this again though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Teresa"
},
"reviewBody": "This is a wonderful recipe and matches very closely to what my Ukranian Mother-in-law made except she added ground beef which is added raw to the cooked rice. The key is to keep the filling simple. Not too much ground beef - no more than 50/50 ratio meat to rice. The cabbage and tomatoe sauce (instead of tomotoe juice) provides plenty of flavor without going overboard with the filling. Then, of couse, you must serve with sour cream. YUMMMMM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "It's A New Day"
},
"reviewBody": "I parboiled the cabbage leaves prior to assembly and used brown rice. I sauted about 5 strips of bacon and crumbled them in the rice along with the onions that I softened in the bacon fat. I didn't have tomato juice so I pureed a can of petite diced tomatoes. Baked the whole thing about 30 minutes at 350. My husband loved this recipe, so I'm sure I'll be making it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "justicesamsin"
},
"reviewBody": "I really enjoyed these. I was looking for a recipe that could use some cabbage and ran across this. I only had 1/2 a head of cabbage. I added the bacon (great suggestion), rosemary, basil, didn't have can of tomato just added tomato sauce and topped with cheese. It was great. Will make again for sure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cat"
},
"reviewBody": "I tried this recipe yesterday but I added ground beef into the mix as that is how my grandma use to make it and I doubled the recipe so I could freeze the rest. It's a lot of work and not something I would make again during the week. Other than that the Cabbage rolls were good and I will make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mtnmacgrl"
},
"reviewBody": "My Urkanian aunts only made it with pork, so I did the same. It was a good simple recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sunshinenewday"
},
"reviewBody": "Pretty good, next time I'm going to add meat though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Oleander"
},
"reviewBody": "This is a really great starter recipe. When I make it, I add bacon, garlic, and plenty of herbs to the rice (whatever is your favorite--I use a lot of rosemary and basil) and it turns out great. I also use a previous reviewer's tip to serve these with sour cream, and it's a delicious combination."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Tina Pierson"
},
"reviewBody": "I didn't like this and ended up throwing most of it away. I boiled the cabbage to try and remove the leaves, but I used red cabbage and it ended up turning a blue color (sort of unappetizing and probably partly my fault for not doing proper research). This lacked flavor, and while I did add some things to try and fix this, it didn't do much to correct the problem. Sorry, I just don't think Eastern European food is my thing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "WALT1946"
},
"reviewBody": "Just like the old country holobchi ma used to makr"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JoyLee"
},
"reviewBody": "I made this last night. My daughter who swears she hates cabbage ate it all up. I topped it with sour cream it was an instant hit! Very simple to make, quick clean up. Will be a repeat dish in our home!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Great recipe. *Another way to remove cabbage from the head is to freeze it and then let it thaw completely.The leaves will then come off easily. (just a little family trick.)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "CSKB"
},
"reviewBody": "Good basic recipe but lacks seasoning."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/21732/ukrainian-cabbage-rolls/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
"name": "Stuffed"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
"name": "Stuffed Cabbage"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/21732/ukrainian-cabbage-rolls/",
"name": "Ukrainian Cabbage Rolls"
}
}
]
}
}
, "about": [
]
}
]