				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ukrainian Olha&#39;s Varenyky (Perogies)"
,"datePublished": "2019-04-03T23:29:09.000-04:00"
,"dateModified": "2022-07-14T16:14:30.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Olga D"
,"url": "https://www.allrecipes.com/cook/830684"
}
]
,"description": "Ukrainian Olha&#39;s Varenyky (perogies) These half moons of dough may be filled with a variety of fruits, vegetables, meats and cheeses, although for Christmas Eve potato and cabbage fillings are the favorite."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/1fqGwta_obobciMce9RyDu2HffI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7966773-89bedf3745284bbe9fc9a968923c225c.jpg",
"height": 1565,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ukrainian Olha&#39;s Varenyky (Perogies)"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "42"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "636 kcal"
,"carbohydrateContent": "82 g"
,"cholesterolContent": "76 mg"
,"fiberContent": "7 g"
,"proteinContent": "16 g"
,"saturatedFatContent": "17 g"
,"sodiumContent": "919 mg"
,"sugarContent": "8 g"
,"fatContent": "28 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"5 cups all-purpose flour",
"1 teaspoon salt",
"2 tablespoons butter, softened",
"1 cup evaporated milk",
"0.5 cup water",
"6 medium potatoes, cut into small cubes",
"2 large onions, finely chopped",
"0.5 cup butter",
"1 cup shredded Cheddar cheese",
"salt and pepper to taste",
"1 pound sauerkraut",
"2 large onions, finely chopped",
"0.5 cup butter",
"3 cups finely shredded green cabbage",
"1 cube chicken bouillon",
"2 teaspoons pepper" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "To make the dough, combine the flour and salt in a large bowl. Make a well in the center and add the soft butter and evaporated milk; stir gently until all the liquid is absorbed. Add water only as needed, kneading continuously until dough sticks together. Place dough into a greased bowl, turn to coat, and let rest for 30 minutes."
} ,{
"@type": "HowToStep"
,"text": "To make the potato filling, place potatoes into a saucepan with water to cover. Bring to a boil and cook until tender, about 10 minutes. Drain and set aside. Melt 1/2 cup butter in a medium skillet, over medium heat. Saute onions in butter until tender. Mix the onions into the potatoes along with the cheese and season with salt and pepper to taste."
} ,{
"@type": "HowToStep"
,"text": "To make the sauerkraut and cabbage filling, pour the drained sauerkraut into a large saucepan. In a medium skillet, saute 2 onions in 1/2 cup butter until tender, about 5 minutes. Stir the onions into the sauerkraut along with the cabbage and chicken bouillon cube. Cook over low heat until liquid evaporates. Season with pepper and remove from heat. Allow the mixture to cool, then run through a grinder or food processor."
} ,{
"@type": "HowToStep"
,"text": "Remove the dough from the bowl onto a lightly floured surface. Roll out to 1/8 inch in thickness. Cut into 3 inch circles. Place one tablespoon of filling onto one side of the circle. Fold the other half over and press the edges to seal. Place finished dumplings onto a floured tray and keep covered."
} ,{
"@type": "HowToStep"
,"text": "Bring a large pot of water to a boil. Drop 10 or so dumplings into the water at a time. Cook for 3 to 5 minutes, then remove to a colander to drain. Place finished dumplings onto a lightly oiled dish and turn them to coat with a thin layer. This will keep them from sticking together. Serve dumplings with fried onions and sour cream. Cooled dumplings also can be fried in oil and butter for a nice crispy surface."
} ]
,"recipeYield": ["10"]
,"totalTime": "PT120M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moonie"
},
"reviewBody": "Oh.my.God\n\n\nOkay,so I made these for extra credit for a history class project,where I talked about Ukraine. I found this recipe and thought, “hey,this should be good,it looks pretty good!”\n\nPretty good is an understatement.It was AMAZING\n\nI’ll DEFINITELY be making this again"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cristina Lopez-OKeeffe"
},
"reviewBody": "We loved this recipe! We are returned Oeace Corps volunteers from Ukraine (2003-05) and have eaten many delicious bowls of Varenyky!! We did make some changes. I mashed the potatoes. I also added some nonfat Greek yogurt and extra milk to the dough. I had no “smetana” in the house. The dough was wonderful and they turned out fantastically. Thank you! I wish I could post more pictures of my daughters and husband making it and the final product!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "zaykate"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christopher Udowenko"
},
"reviewBody": "As others have said is a very easy recipe. I also prefer the mashed potatoes. I found that you can stick just about anything inside them; cheese, jalapenos, sauerkraut, corn, sausage. I prefer them boiled but refrying them with butter just adds a different layer of flavor. I've eaten about 30 in the last few days because they are that good. I even made a dessert version. Leftover ricotta cheese for a lasagna, put some cherry pie filling, deep fry until golden brown, and you end up with a quite tasty semi sweet dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gwenn"
},
"reviewBody": "I made this directly as written. They were so yummy! Definitely will make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Janene Monaghan"
},
"reviewBody": "My daughter and I used this recipe to maker Perogies. We too mashed the potatoes, but also added sour cream to the dough mixture. It made the dough easy to work with and they turned out great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kay mcclean"
},
"reviewBody": "Great dough made these ahead frozen great"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "UkieOceanGirl54"
},
"reviewBody": "OMG I loved it!! I am Ukrainian and know what quality vareneky are. These were really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Felicia Wadsworth-Williams"
},
"reviewBody": "Great recipe! The dough was tender and easy to work with"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heidirs"
},
"reviewBody": "These turned out well. I'm excited to share them with my husband who has never had perogies. Like another reviewer, I too ended up with left over filling, about a third. I think part of the issue is this recipe (and every other perogie recipe I could find) does not give an actual measurement for the potatoes. Exactly what a \"large\" potato is varies from person to person. I used a pound of potatoes. And I think the 5lbs of flour would have been fine except that I had trouble rolling it thin. I used water instead of the sour cream someone suggested. I think next time I will try that. I just saved the left over filling as awesome mashed potatoes for another dish. As the filling goes, I thought it was a little bland and seasoned it to taste with garlic powder. It came out awesome! When boiling the perogies, follow the gnocchi rule - if it floats to the surface, it's done. I then pan fried the perogies and seasoned with garlic salt. I pan fried onions and peppers (a MUST when it comes to serving perogies) and also seasoned with garlic salt. And combined the two. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mitchellt_3"
},
"reviewBody": "Absolutely amazing recipe. I made these for a foods class in school a few years ago and they were a huge hit. Fairly simple to make and they tasted awesome. I made the recipe to the full serving size so I had a bunch to throw in the freezer. They still tasted great cooked from frozen. I made these a few more times after using extra cheese and adding bacon (to the potato variety) and they were also great. Would definitely recommend."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DockterWho"
},
"reviewBody": "This turned out really well! I have eaten authentic perogie before and this turned out just as good!\r\nThe dough was pretty tough to roll out, though. Next time I plan to add a bit more water and see if that helps.\r\nIt took me about 2.5 hrs to prepare everything and then to cook 20 of them to eat. So, you might want to add a bit more time if you are scheduling to cook this.\r\nI also had quite a bit of filling left over...not sure why, but that is ok. I'm just freezing it and will use it next time.\r\n\r\nUpdate: I made my second batch and used 1 1/2 cups of the evaporated milk (instead of just one), and then I added 1/2 cup water. This really helped the dough be much easier to work!\r\n\r\nTip: When rolling out the dough, flip the dough over quite often and roll out again (maybe 5-6 times) for each part you roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Fayc"
},
"reviewBody": "This was a good recipe. I used saurkraut and a can of corned beef and potatoes with some cheddar cheese for the filling. It was really tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Lovelady"
},
"reviewBody": "Some people might not know you have to peel the potato's before you cube and boil them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ohiorocks"
},
"reviewBody": "Love this recipe it makes the best perogies. The dough is tough to role out but I just cut into squares the run though a pasta machine on the thickest setting. with out the pasta maker it would be tough but not impossible. I also usually use more water than what it calls for it makes the dough easier to stick together when making the Perigees."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Dani412"
},
"reviewBody": "The dough turned out to be too tough and difficult to roll out."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DANCINGHORSE"
},
"reviewBody": "These were really amazing. I love the option to customize the filling. They were the best perogies ever. They did take a while to make, I boiled the potatoes and made the dough the day before, then to assemble it still took me 2 hours to make a half batch of the recipe. Since my husband likes everything hot &amp; spicy, after using half the filling/dough to make the regular recipe for the kids, I added a few healthy glugs of hot sauce to the filling for the remaining half of the batch. They were utterly amazing. Even the half batch meant I have a whole other meal in the freezer for another day. (that will be much less time consuming!) OH and yes I did fry them in butter/olive oil after boiling them. Serve w/sour cream. YUM!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisawiens"
},
"reviewBody": "yummy,,that's all I have to say."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "redsand.beach13"
},
"reviewBody": "My roommate my first year in college was from a polish family, and her mom made me the first perogies id ever had. This recipe is very good, though it takes a bit of finesse and practice to put the filing in the dumplings the way her mom told me it was supposed to be done. i used mashed potatoes, and i put half bacon fat half butter in the skillet when i sauted them for a bit of extra flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jparker11"
},
"reviewBody": "Excellent, I love this recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "u62philo"
},
"reviewBody": "I made these for an extra credit assignment for my Ukrainian Culture class. They were definitely unlike anything I've ever eaten before. Tasty little things with the alternate filling... dough was hard to work with. I would also recommend frying them up at the end as suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sonyapizza"
},
"reviewBody": "Almost, but not quite, the perfect Varenyky. I have made them for 3 years now, and would suggest the following filling changes: boil the potatoes in the skins and then peel them, mash the potatoes rather than dicing, and add a dash of nutmeg to the filling to enhance the cheese flavour. As for the dough, I found it a bit tougher when cooked than the varenyky I grew up with. Search for an online recipe with fewer eggs, sour cream and butter in the dough; the sour cream seems to make the dough much more workable and tender. Also, after boiling varenyky it seems to help to subsequently cook them even more, either re-heating them in a casserole dish in the oven, or frying them in a pan with a bit of butter an onion. This helps to make them even more tender. This is great logistically when you want to prepare the varenyky well before a meal but re-heat them to serve."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "DeNean"
},
"reviewBody": "I made this dough and had to add more water, even added an egg to try to make it stick together. I did use it, but not happy with the way it rolled out. The filling was wonderful. I had made this dough and another on this site made with sour cream. I used both, but liked the sour cream version much better for the dough. I used sharp grated cheese. Very happy with the cheese potato filling. Thank you for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "windelbo"
},
"reviewBody": "Very good recipe, although I halved the recipe, doubled the amount of cheese, and more than doubled the amount of salt recommended."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "KingAdam"
},
"reviewBody": "4 hours to make"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TL'sCookin!"
},
"reviewBody": "I used the dough recipe as I make my own family recipe for my filling..I think by adding the water at a very warm temperature could be making the difference, as for elasticity...It sure worked for me! Great reviews as for taste as well! So thanx!!! Mucho!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Irina"
},
"reviewBody": "Fantastic recipe - thank you for this one Olga. I spent the first half of my life in Ukraine second in US, but there's no one to teach me our authentic Ukrainian cuisine as my grandmother did all the cooking and she's passed away before I came of age. I only have wonderful memories of helping out in the kitchen as a child. One of the best meals were varenyky!! I treasure every bit of a clue I can find in terms of Ukrainian cooking- PLEASE KEEP 'EM COMING :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Great Cook"
},
"reviewBody": "Too doughy for my liking"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "elizabeth"
},
"reviewBody": "I used to make these with my Baba too, lol, what wonderful memories, thank you for the recipe, they are just as i remembered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "schmerna"
},
"reviewBody": "A very good recipe. I used 1 cup of whole wheat flour and omitted the onions from the filling. Next time I will use the onions and maybe some bacon to add a little more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jennifer McClanahan"
},
"reviewBody": "For those who haven't made these before, they taste so good if you boil them first, then remove with a slotted spoon to a skillet with onion browned in margarine and fry them until they're just getting brown on each side - they have a much better texture then. And if you think you don't like sauerkraut, try these anyway, you'll be surprised!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Krystal Thurman"
},
"reviewBody": "I made this for my Russian husband. He thought they were excellent; just like his mom makes. It was a little bit messy to prepare but the end result was great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Erimess"
},
"reviewBody": "Honestly surprised over the ratings on this, but looks like everyone else already knew what a perogy was and I've never made these before. Sounded good; extreme disappointment. To begin with, the dough was hard to handle as has been mentioned. I was stuck with the rolling pin, and I rolled and rolled and rolled, about killed myself getting these things thin enough to handle all that filling. And even rolling as thin as I could, there was twice as much filling as what was needed. (I also should've done the mashing idea.) It was also difficult to pinch them closed. And then, only to discover after all this work, cooking these in water I thought was disgusting -- like just wet raw dough &amp; not really like the dumplings I've had. Didn't want the fat of frying them so tried baking the next batch, which was better but still only just edible. (Yes, I did eat them all.) I used the potato filling and the one redeeming quality was that with all that leftover filling, I added a bit of mayo and it made a pretty good potato salad. :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kimberly Foster"
},
"reviewBody": "Very good. Only made 1/4 of the recipie which was good for one meal for me and my husband. We like to fry them and then dip them in marinara sauce (untraditional we know). Very time consuming to make so next time I will make some to freeze. Can't wait to try the alternate filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MARIKABAR"
},
"reviewBody": "This is just how my baba and I make them. They were wonderful! I did add more water. You just have to have a feel for the dough it has to be soft and sticky enough to roll out, then cut and roll again. Wonderful!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I am giving 4 stars, since I would give the fillings a 5 and the dough a 3! Both fillings were very tasty, although very fattening! I boiled my potatoes in the skins, then peeled and mashed them. This holds in the flavor, as well as preventing them from being watery,(less work too!). I would give the dough 3 stars, because mine turned out tough, and very difficult to roll out. That may have been my fault though,since for some reason, I had to add more water than called for because it was too dry with the half cup. Oh, a lttle warning...be sure you have the extra time to make these, as they are very time consuming! Overall, a good recipe though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "I made the potato filling without the onions because my boyfriend hates onions. I mashed the potatoes a little rather than leaving them in cubes, as another review suggested. While I was rolling out the first piece of dough I noticed its similarity to pasta dough - so I used my pasta maker to roll the dough out nice and thin. It was much easier than fighting with a rolling pin! I'll make these again for sure - everyone loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Angela"
},
"reviewBody": "These perogies were so good, just like the kind my mom always made. Absolutely delicious. A lot of work, but not difficult."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I've tried homemade perogies at a ukrainian friend's home a couple times before, and I had a craving for them so I decided to make them myself using this recipe... They were good, but not excellent. The filling was good but could have had a bit more flavour. The problem was the dough was so tough to roll out and it was hard to get it nice and thin. Then in the boiling process, it just didn't seem to come out nicely, so we fried them up, which improved it a lot. Everyone enjoyed these, but I have had better, and am still searching for the perfect recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "JOCELYNE27"
},
"reviewBody": "I've never made perogies from scratch before, but this was relatively easy and simple to follow. They do take a while to make, but perogies in general take a while to make. I would mash the potatoes rather than leaving them in cubes though. This makes it easier to handle. If you mash the potatoes 5 potatoes is sufficient. Mixing some bacon bits into the potatoes also helps to add flavour. Overall, great recipie. Worth trying~!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/31778/ukrainian-olhas-varenyky-perogies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/80/main-dish/",
"name": "Main Dishes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
"name": "Dumpling Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/31778/ukrainian-olhas-varenyky-perogies/",
"name": "Ukrainian Olha&#39;s Varenyky (Perogies)"
}
}
]
}
}
, "about": [
]
}
]