				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ultimate Maple Snickerdoodles"
,"datePublished": "1999-05-26T19:43:40.000-04:00"
,"dateModified": "2022-07-14T17:12:22.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Linda Carroll"
,"url": "https://www.allrecipes.com/cook/24325695"
}
]
,"description": "These have been voted the number 1 cookie that I bake (and I bake a lot!) and are loved by all who eat them. They are chewy mapley good!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4-DAmBvRbC_e76D-4hwpDCkZjuc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7058013-b40a165f25a84a799656ea954c3fc340.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ultimate Maple Snickerdoodles"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "382"
}
,"cookTime": "PT10M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "91 kcal"
,"carbohydrateContent": "16 g"
,"cholesterolContent": "5 mg"
,"fiberContent": "0 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "1 g"
,"sodiumContent": "61 mg"
,"sugarContent": "11 g"
,"fatContent": "3 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"1.5 teaspoons baking powder",
"0.25 teaspoon baking soda",
"1.5 teaspoons ground cinnamon",
"0.5 cup margarine, softened",
"1 cup white sugar",
"3 tablespoons real maple syrup",
"1 egg",
"0.5 cup white sugar",
"0.25 cup maple sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Stir together the flour, baking powder, baking soda, and cinnamon. Set aside."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, cream together the margarine and 1 cup of white sugar until light and fluffy. Beat in the egg and maple syrup. Gradually blend in the dry ingredients until just mixed. In a small dish, mix together the remaining 1/2 cup white sugar and the maple sugar. Roll dough into 1 inch balls, and roll the balls in the sugar mixture. Place cookies 2 inches apart on ungreased cookie sheets."
} ,{
"@type": "HowToStep"
,"text": "Bake 8 to 10 minutes in the preheated oven. Cookies will be crackly on top and look wet in the middle. Remove from cookie sheets to cool on wire racks."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Sarah Lee"
},
"reviewBody": "Not good, the texture was off. More like a spiced shortbread cookie. I was hoping for chewy inside with crunchy outside - disappointed. People say the love snickerdoodle, after these, hard pass."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Annie"
},
"reviewBody": "I doubled the recipe, added extra maple syrup and also some maple extract. I ended up with 3 dozen big and beautiful cookies. so good and mapley!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Margaret Lovelace"
},
"reviewBody": "A new family favorite for my mother in law who is a die hard original snickerdoodles and for my husband who loves anything maple!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rawhide Kid"
},
"reviewBody": "Absolutely fantastic. Might add some nuts of some type next time. But wow everyone liked it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bill"
},
"reviewBody": "Made the cookies as stated in recipe used my home made maple syrup. Came out very good nice and chewy if not over cooked . Mine took 10 min. Using good maple syrup is a must."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Donna Terry"
},
"reviewBody": "I like the maple syrup in the mix. Didn't have maple sugar, so I rolled in cinnamon and sugar. too much cinnamon being on the inside and out, that is my fault. But where is the cream of tarter, snicker doodles always have cream of tarter. I will add that next time, and less cinnamon on the inside, as I like them rolled in cinnamon and sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurahallie"
},
"reviewBody": "The experience of making these caused me to break down and buy an oven thermometer (I had different batch results with the same exact mix), but that's really between me and my oven. Overall, these cookies were great! They were soft and chewy. I do think that they could have a stronger maple flavor. I used a Grade A smokey maple syrup (note: Grade B doesn't exist anymore), but the flavor was hard to detect. I'd use at least another tbsp next time. \n\nThe cookie balls that I rolled out were about 1.5 in. I baked them for roughly 10 minutes.\n\nI made just a few changes: Used real butter, and for the mix I used 1/2 c maple sugar and 1/4 c white sugar because I ran out of white sugar. I'd say that you only need 1/4 c maple sugar and 1/4 c regular sugar, as I had a lot of sugar mix left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jfish"
},
"reviewBody": "Okay, so first, I never want to do a review if I had to alter the recipe, so this is for the recipe as is. Second, I was all set to give a lower score for these, but I found that they actually get better the next day. I gave it 4 stars because I used the maple sugar and it definitely helped but I was expecting more of a maple flavor. I think I will add a little maple extract to the dough next time. Be aware that you will probably not think these are cooked enough but do not over-bake. I waited until I saw the tops begin the crack. It took 10 mins but left the center chewy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deborah Smith"
},
"reviewBody": "I made them 2x , taking them out when they are still soft on top is important. 1st batch too hard. 2nd batch just right!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cassie"
},
"reviewBody": "Absolutely love it! If you're feeling exceptionally Canadian, try substituting the marg with equal parts bacon grease. Highly recommend trying half substitute to start, just to get a taste for it on the first batch, and go with your preference from there. Could add bacon bits for extra flavor and crunch as well.. sounds like a weird twist, even I was questioning my sanity, but it's actually pretty decent, bacon adds a little salty taste to even out the maple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Joey Vega"
},
"reviewBody": "Only negative thing was that the maple sugar mixture had way too much, tons left over."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judy Owens"
},
"reviewBody": "Like someone else, I used a couple drops of maple flavoring in regular sugar as it is hard to find maple sugar in the store. Great recipe. We like snickerdoodles anyway, but the maple is extra good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlie Olson"
},
"reviewBody": "no changes just want these asap"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Flower Analee"
},
"reviewBody": "Loved these! They came out perfectly. The texture is nice and gooey without tasting undone. Made them for my boyfriend as maple is one of his favorite flavors, and he ate 6 in a minute hahaha."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ready2spark"
},
"reviewBody": "I hesitated in writing this review because in the end I didn't follow the instructions (but not on purpose). I mistakenly put 1/2 of the sugar in the bowl that was to be reserved for the dusting. I added a 1/2 an extra egg and a touch more maple syrup to wet the dough and cooked them up. The result was a great tasting cookie, but it didn't spread as much as I would have liked. \n\nSo, for the next batch I put in the other 1/2 of the egg and about a tbsp more maple syrup. They spread beautifully and had an even better taste. \n\nI only write this in case someone makes the same mistake. Don't fret. This seems to be a no-fail recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ana Rey"
},
"reviewBody": "Have made these for many occasions and they are always a favorite! Thank you for this awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bonnie"
},
"reviewBody": "The cookies are delicious. I didn't have maple sugar so I rolled them in raw sugar. They didn't become flat cookies, though. they stayed very rounded, but tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "The cookies are delicious. I didn't have maple sugar so I rolled them in raw sugar. They didn't become flat cookies, though. they stayed very rounded, but tasted great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Michelle Syfor"
},
"reviewBody": "Love these cookies. Didn't have maple sugar. So I used sugar and brown sugar. Will definitely try cinnamon next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "it came out perfect! also used butter though. i dont think you can buy maple sugar in switzerland, so i drizzled some maple syrup (real one from quebec) mixed with confectioners sugar over them. delicous!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALLFROMSCRATCH"
},
"reviewBody": "Live in a small town and the best I could do for pure maple syrup was Log Cabin Natural. They were very good but I would go for an even stronger flavor. Intend to get some pure Grade B syrup off of Amazon next time. Very good though, turned out perfect looking cookies . I used 1/4 c. white sugar and 1 t. cinnamon to roll them in."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marija"
},
"reviewBody": "Excellent and easy to make. My kids are making them, and we adults enjoy to it them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "LindaH"
},
"reviewBody": "This may be to some people’s taste, but I found these to be relatively flavorless.I did make it following the recipe exactly, even going so far as to order online the very expensive maple sugar. I’m guessing that adding some cinnamon to the maple sugar and white sugar mixture used for rolling the dough balls would add what I’m missing. I may try them again, but doubtful, since I’m a huge fan of traditional snickerdoodles. What a disappointment."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Clementine"
},
"reviewBody": "Absolutely incredible! I made these for thanksgiving and it was a big hit. Everyone came coming back for more."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Ashley Hoffman"
},
"reviewBody": "This got incredibly difficult for me. I ended up with the stickiest batter EVER. It was so sticky that so much batter was wasted from being stuck to my hands and a spoon and anything else I was using. I had added an extra tablespoon of syrup, so maybe that was it, but even before then it seemed an abnormal texture. I gave this a 2 because the taste came out fine, even though the texture was more of a muffin top. I will try again, following the recipe exactly, to see if this can go any better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "vito"
},
"reviewBody": "The cookies are good, but not quite the snickerdoodles I expected. The recipe.does not have cream of tartar, maybe that is what is missing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rob Allgeier"
},
"reviewBody": "Easy and delicious! Followed the recipe exactly for baking, but rolled in brown sugar and cinnamon instead. Fantastic recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Chef- VaVaVoom_Pink"
},
"reviewBody": "Pretty good snickerdoodles. I just used butter instead of margarine &amp; didn't have maple sugar so used sugar+cinnamon instead. I baked mine for 11 mins. Texture was crisp on the outside &amp; very soft on the inside. Beautiful cookies but lacked a lil something for me. I think I'll add in vanilla extract next time or even maple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ashley"
},
"reviewBody": "It came out lovely, but the cookie didn't flatten in the oven, so I would suggest flattening them yourself. Also, I replaced the maple sugar with brown sugar, and the cookies tasted fine. Thank you so much for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annika VanNoord"
},
"reviewBody": "1 tbs redinsponge (perfect)1/8 tsp maple extract (try 1/4)1 egg and 1 egg white (perfect)Rolled in cinnamon and sugar"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "melrei"
},
"reviewBody": "My boyfriend and I are OBSESSED with these cookies. We could not stop eating them...despite the fact that the recipe uses too much flour, so our first sheet came out like rocks. We only baked one sheet at a time, so we were able to add some sugar to rescue the rest of the dough (they still came out slightly hard, but better than the first batch). Next time we'll be using less flour."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah O'Neill"
},
"reviewBody": "I used 2 tbsp of cinnamon and 1/4 less of flour, and butter instead of margarine, and brown sugar instead of maple sugar. I also changed the 1 cup white sugar to 3/4 cup white and 1/4 cup brown as another suggested. I cooked these for 10 mins exactly and left them rounded in the ball shape. Doing this and using butter causes them to not spread very much, so you're left with a crispy on the outside, but soft on the inside absolutely delicious maple snickerdoodle! :D will be making again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "survivor"
},
"reviewBody": "This recipe doesn't have a lot of maple taste, but it will be my go to recipe for snicker doodles..soft and chewy, absolutely delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn Stavert"
},
"reviewBody": "A very sweet simple cookie, however the maple flavour is too subtle."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SouthernMaster"
},
"reviewBody": "Very good. I followed BakinginCleveland's recommendations. Maple sugar is expensive, but well worth the price for a unique taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Purplepumpkin"
},
"reviewBody": "Wow, just, wow. I didn't expect them to be so delicious, soft and easy to make. My brother gobbled half in one sitting and I could hardly resist munching on them during the day. I lowered the amount of sugar as I do with every dessert recipe and I still found it a bit too sweet, but that's just my personal preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "greenthumb"
},
"reviewBody": "Very good, but I think they might be improved with the addition of an 1/8 teaspoon of salt to balance out the sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "E M"
},
"reviewBody": "Fantastic. I used butter instead of margarine. I found out after I'd made these that my husband had never had a homemade snickerdoodle. He's hooked. This was the best recipe for his first time. Outstanding."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "River7919"
},
"reviewBody": "Yummy! Easy, soft, and tasty. Used butter instead of margarine. Didn't have maple sugar (and misread the recipe) so I mixed maple syrup with sugar for the coating, which made a neat sort of glaze after baking. A bit extra sweet so next time I'll try reducing sugar in the batter a little."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Sandra Richard"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sharon"
},
"reviewBody": "Super yummy! Added cinnamon to the sugar topping."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaraB"
},
"reviewBody": "This is a fabulous spin on Snickerdoodles; I'll never make regular ones again. I always use butter instead of margarine and I put the dough in the frig for a while before rolling balls - I prefer my cookies chewie instead of crunchy. After rolling them in the sugar and putting them on the cookie sheet, I flatten them slightly with the bottom of a glass. I find the sugar mixture for rolling is way too much - I use a quarter (2 tblsp sugar, 1 tblsp maple sugar)and I still have a little leftover. I put it in my maple flavored coffee."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "NOK"
},
"reviewBody": "These cookies are yummy! I didn't have any margarine so used butter flavored shortning instead. Cookies didn't spread at all... I don't know how much difference it would have made if I used margarine... The maple flavor is very nice. I cooked maple syrup and cooled. Then grind it in a coffee grinder to make maple sugar since I didn't have store bought maple sugar. I made a half batch as cut out cookies and filled with some maple butter cream filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LISAMR"
},
"reviewBody": "Very basic and tasty. The maple was fine but I love maple and may add a bit more next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Susan Sanders Miller"
},
"reviewBody": "Easy to mix, did find that the wire rack didnt work for me as they were so soft they fell through on the ends! ha! Also was a bit concerned that it didnt call for cream of tartar. As a kid making the Betty Crocker recipe, it was included. Will do some research and quite possible adjust this recipe a bit. Thanks for sharing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "GOLDENONE39"
},
"reviewBody": "Good, soft cookie but if you live at high altitude, as I do, please add a tablespoon of water or the dough will be too dry. This recipe is MUST in my recipe box now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "whats4dinner"
},
"reviewBody": "Delicious, amazing, simple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "the4taals"
},
"reviewBody": "Really nice cookies! I made 1.5 batches and got 61 cookies with my 1 tbsp scoop, baked for 10 minutes on Silpat lined sheets, I only needed 2 tbsps each of white sugar and maple sugar for rolling, I did add 1 tsp vanilla to the batter and used lactose free margarine for my friend who is lactose intolerant."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Janet Patterson"
},
"reviewBody": "Just finished making a batch...made them exactly as posted and they are delicious! The only thing I would change next time is the amount of sugar called for to roll your cookies in....I was left with half the amount of sugar (so I'm making another batch). The maple sugar was too expensive to waste! Also, I got almost an extra dozen from my batch so I guess they were a little smaller than they should have been. I think 1/4 cup each of white and maple sugars would have been enough for the recipee!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laura Boyan"
},
"reviewBody": "I made these cookies last week and will be making them again soon!! Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "PlaceOfYes"
},
"reviewBody": "I only like snickerdoodles in the fall, so this being October I prolly rated these on the high side. That being said, the maple syrup brand I used was Roger's Golden Syrup. It's got more of a \"molasses-y\" flavor. As with all cookies I bake, I spread the batter in a 9 x 13 pan and bake, then cut into bars. Vastly easier for this busy mom than rolling into balls and baking pan by pan all afternoon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "rosealine"
},
"reviewBody": "this barely made a dozen. Its a very small batch. but very very very good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NMBROCK"
},
"reviewBody": "These were OK, but despite spending extra money on real maple syrup and maple sugar, I couldn't taste the maple at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tanya Mason Caporaletti"
},
"reviewBody": "Just made this recipe for the second day in a row-- It's easy and absolutely delicious. I used the natural, Spectrum brand shortening and used coconut sugar in place of Maple sugar because I did not have Maple sugar (which I'm sure is delicious). But even so, the cookies turned out beautifully! Having the dark and light sugar crystals on the outside of the cookie looked really nice. The bake time worked perfectly for mine-- they remained soft. My daughter took them to her youth group, and she said the kids went \"nuts\" over them :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cesson"
},
"reviewBody": "I have made this recipe many times and it is much loved by the kids. Great texture of crispy on the outside and soft and chewy in the middle but for me it is too sweet and the sugar kills the flavor of both the maple and cinnamon. I read all of the very helpful reviews posted here and made three batches today. Here are my changes: drop the sugar down to 3/4 cup, add a pinch of salt, up the baking soda to 1/2 tsp, weigh the flour making sure you only have only 9 oz and add it by hand, use butter and make it an extra large egg. I rolled the cookie in 5 oz of white sugar mixed with 1/2 tsp cinnamon (this could be reduced as I had a fair bit left over). Only cook for 8 minutes in a very well pre-heated oven. The cookies will not look done but will set nicely and if you turn them over they should be quite nicely browned on the bottom. They will puffed up when cooked but will sink as they cool. This recipe usually gets me around 30 - 32 cookies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Muffy"
},
"reviewBody": "These are heavenly... Next time I think I'll use all maple sugar for rolling the balls in, I'd like more of a maple flavor...The only change I made was using all butter as I never have margarine in the house... this is probably why mine turned out more crispy than chewy... overall great flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "draybelle"
},
"reviewBody": "I made these for a work \"food day\" and they were a hit. I did use real maple syrup but my closest grocer didn't stock maple sugar so I went with the sugar/cinnamon topping. They were still worth five stars, so I can't imagine how great they would be with maple sugar! The cookies were done after 8 minutes even though they looked a little doughy, so I suggest taking them out even if you feel unsure."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keebler6elf"
},
"reviewBody": "I was a little nervous these might be too sweet. Living in Vermont, we know a thing or two about the taste of maple syrup. However, it is very subtle but tasty, similarly to the taste of chocolate chip cookies without the chocolate. If you are looking for a strong maple flavor, be sure to add more syrup than the recipe specifies."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RWC4520"
},
"reviewBody": "Excellent! Like many others, I didn't have any maple sugar, and couldn't find it. So I used the cinnamon sugar to roll them in. They turned out delicious! I'm going to find some maple sugar for the next batch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "6MOUTHS"
},
"reviewBody": "Delicious! Instead of the sugar/maple sugar coating, I drizzled them with a maple glaze by melting 1 Tbsp unsalted butter and 2 Tbsps real maple syrup in a small saucepan then whisking in 1/2 c powdered sugar until smooth. I will definitely make these again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "anguye52"
},
"reviewBody": "Amazing! These cookies were the perfect combination of sweet and subtle, crunchy outside and chewy inside. I can't stop eating them. I couldn't find maple sugar, but brown sugar is fine as a substitute. Nor did I use actual maple syrup, but the regular (cheaper) syrup works just as well. Absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzanna"
},
"reviewBody": "SO GOOD! I followed the advice of the highest rated review and they came out amazing! Stayed soft for a week, too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BC"
},
"reviewBody": "excellent. I did not have maple sugar but did have maple flavoring so I made the maple sugar by mixing 1/2 cup raw sugar and 2 t. maple flavoring-used mixer. Other changes I made because I had the ingredients on hand were butter instead of margarine and raw sugar instead of white."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mandxxx"
},
"reviewBody": "Gorgeous! I wasn't really sure what to expect as i have never had a snickerdoodle before but they were delicious. The maple and cinnamon were there but not overpowering. I rolled them in vanilla sugar as I was not really sure what maple sugar is. I will definitely be saving this recipe and making again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jules47"
},
"reviewBody": "Ohhhh Yummmmm..... these are awesome.. i baked them a few min longer because i prefer a little harder to dip in milk. Dont be fooled if they look to puffy when you take them out-- they settle and harden as they sit! Sooo good. Thanks for the recipe!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Sweets"
},
"reviewBody": "I was not crazy about this recipe. It was way too maple-y, I couldn't taste the cinnamon at all, even after coating the cookies in cinnamon-sugar since I didn't have any maple sugar. They also did not spread at all and baked as balls that were set and crisp on the outside and raw in the middle. It was not the yummy chewy kind of softness that you want in the middle of a cookie, it was raw and gooey. Fortunately, this didn't make too many. Probably will not be making again. Sorry."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kenreanne Fookes Davis"
},
"reviewBody": "These were really great, and my family gobbled them up. I added 1 tsp. maple extract along w/ the maple syrup. (It made for a more pronounced flavor). For the maple sugar coating I added 1tsp. of maple extract to the 1/2 cup of white sugar. Placed it into my mini food processor to incorporate well. These cookies are warm and homey, and I will add to our family favorites. Thank you for such a lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chef24"
},
"reviewBody": "Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brandy"
},
"reviewBody": "Stumbled across this recipe while looking for something else. I had all the ingredients (with the exception of maple sugar, I used cinnamon/sugar instead) so I decided to give them a try. I was making cookies for our high school volleyball team, 25 girls, so I used them as guinea pigs. They loved them! These will definetly become regulars in our house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jillianefoley"
},
"reviewBody": "My roommate declared these literally the best cookies she's ever eaten. My coworkers devoured them. Rave reviews all around! Easy, quick, and SO good. \nPS: I used butter as well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Deezo"
},
"reviewBody": "Made these for work, using VT grade B maple syrup and maple sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "westwoodbarbie"
},
"reviewBody": "These were absolutely delicious, and incredibly easy to make. I highly recommend them to anyone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betty crocker wanna be"
},
"reviewBody": "I thought these were great. I think I cooked them a little long. I followed the directions, but they were a little crunchy. Next time I will shorten the bake time by a few minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SavedByGrace"
},
"reviewBody": "Used this recipe as well as another to come up with the perfect snickerdoodle. I used half butter and half shortening, cream of tartar, and added cinnamon to the dough. My dad loves snickerdoodles and anything maple flavored so I was excited to make these for him, and he loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Erin"
},
"reviewBody": "I mostly followed this recipe- just upping the cinnamon to about 2 1/2tsp and making a cinnamon-sugar mix in place of maple sugar since I did not have any on hand... very good! I brought them in to work and they got great reviews! It helps to chill the dough before rolling them in the sugar mixture for it to hold its shape."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jacqueline_vd"
},
"reviewBody": "For the coating, I could not find \"Maple Sugar\" at the local grocery store, so with substituted with 1/4 cup white sugar + 1/2 tsp Imitation Maple Extract and mixed it together until all the globs were broken up, and then added the extra 1/4 cup of white sugar (instead of the 1/2 cup suggested) &amp; it made plenty for the coating. Don't worry about the balls being too sticky, they're easy to work with once coated. Since I don't like getting my hands all sticky, I dipped a 1/2 TBSP measurement spoon into flour each time before scooping up that amount of dough, then tossed it in the sugar coat mix. I practically scraped the bowl, and to my surprise, yielded exactly 36. I baked for exactly 10 minutes, no more &amp; no less, and I let it cool on stone plates. They are very soft when you bring them out, but once cool, they're so soft on the inside! I &amp; the roomies loved them! I've baked only a handful of times &amp; these came out so wonderful! Thank you, thank you, thank you for the great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "apos159"
},
"reviewBody": "these were one of the best snickerdoodles I've ever had! The dough did seem a bit dry, and the cookies dried out in a day or two. These were good though so perhaps I can find a way to add a bit more liquid to the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "I used butter instead of margarine &amp; a teaspoon of cinnamon mixed in with the dry ingredients. YUM!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mary Louise Whitlow"
},
"reviewBody": "A very good cookie. I was a bit disappointed that the maple flavor was not more pronounced."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DelightfulDines"
},
"reviewBody": "These cookies are very delicious. They really need to be watched when baking them though because if you over bake them then they come out crispy, which I prefer my cookies chewy. I even underbaked them in hopes they would continue cooking on the pan, didnt work out so well. The trick is finding the perfect baking time for your oven, bake them until they look like you want to give them just 1 more minute, slightly set in the middle. Remove them from the pan right away and cool. These cookies only hold up for about 2-3 days. They taste best warm!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "blessedbylove"
},
"reviewBody": "I made exactly as written and they are amazing. We wanted to rename them, French Toast Cookies. We snuck a few when they were still warm...oh dear, they're addictive. This recipe went into our \"favorites\" file! Only thing different is they took a couple minutes longer to bake but I still kept them under-cooked just a bit. (that's the secret to a perfect cookie)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Maine Cook"
},
"reviewBody": "I am a pretty forgiving reviewer but I found these cookies just so so. I had to mash them down or they would not have flattened on their own. They were subtle. Like a shortbread cookie, not tremendously sweet. They needed a longer cooking time than listed. I'm at sea level. I made these for kids. I'd make them for adults for a tea cookie next time. I wonder if a bit of maple extract would impart more flavor. I'd try that."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crumbles"
},
"reviewBody": "Great recipe. It was delicious. It doesn't need as much sugar mixture to coat, I ended up having a lot left over. These were gone in less than 24 hours. I will make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie"
},
"reviewBody": "YUM! Like many other reviewers, I did not have maple sugar. So, to compensate, I use all white sugar with a tiny bit of maple syrup mixed in. If you add a small enough amount (about 1 tsp to a full cup of sugar) and mix it thoroughly, you can end up with a crumbly sugar mixture that has the maple taste, but is still powdery enough to roll the cookies into."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "stacym36"
},
"reviewBody": "These are great. I didn't even have real maple syrup so I just used the immitation kind and they still came out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lulu"
},
"reviewBody": "Great recipe. I never use margarine - trans fats are terrible, and butter tastes better = easy choice. :) Since they were maple cookies, I used maple syrup instead of the white sugar. It made the batter more rich, and the cookies were wonderful with perfect texture. You can make your own maple sugar by boiling down your pure maple syrup, pouring it out on parchment paper or a candymaking mat and letting it cool. It will make crunchy/breakable sugar pieces. But frankly, if you replace all of the sugar with pure maple syrup, it leaves a nice maple flavor already. I end up usually using cardamon sugar mix for the top (organic evaporated cane juice, cinnamon, cardamon). You want your batter to be too sticky to make a ball with your hand at first - this make for the chewy texture after baked. You use a few spoons to scoop out batter, and drop it into the sugar mix. You pinch a little sugar mix ontop of it, then you can roll it around in the sugar without half the mix ending up on your hand. Just keep dropping in the dollops and coating with sugar. If your dough is easy to roll balls before you coat with sugar, its probably too dry =/"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jlee28"
},
"reviewBody": "Definitely not as mapley as I thought it might be w/ the name being what it is. But that's a good thing for me. This recipe was simple and turned out great. I didn't use the maple sugar though. For the last step I just mixed about 1/4 cup of brown sugar, 1/2-3/4 cup of white sugar and some ground cinnamon (made 2 batches). Definitely not as mapley as I'm sure it would have been with the maple sugar, but still a good cookie."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Deb K"
},
"reviewBody": "Really sweet, didn't cook long enough, mushy in center, cook at least 10 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Kurth"
},
"reviewBody": "Ive made this twice now the first time with butter and using real maple sugar. Those were great! The second time with margarine and an addition of maple extract. I have to admit I like them better with real butter.. In the end either way I love them!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TAWNIE44"
},
"reviewBody": "I really wanted to like these...they sounded amazing. However I could not taste the maple AT ALL!! I used 6tbsp real maple syrup and the maple sugar combo, reduced the cinnamon hoping the maple would shine through...and couldn't taste maple. Really bummed. Otherwise the texture was good, I used the authors modified version of the recipe that she later posted. One other thing...real snickerdoodles have cream of tartar and it is missing from this recipe. These ended up being kind of bland for me. I might try again using maple extract."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Suzy"
},
"reviewBody": "To MAIREAD2: I used the eHow food (www.ehow.com/how_6530742_make-maple-sugar.html) directions for how to make the maple sugar, reducing the volume from the 2 gallons listed down to 1 cup in a 1qt pot. After cooking to 255 degrees and then stirring it 5 min to sort of a fudge consistency, like it said to, I pressed it flat onto a silicone mat to cool. After I chopped it up with a spatula, I had a little less than a 1-qt jar. This amount seemed reasonable for the home cook, and doesn't cost too much. Hope this helps!\r\nUPDATE: made these exactly as written and found the maple flavor too subtle (only had grade A, though), underdone at 10 minutes, and waay too sweet. Will try again, subbing some maple sugar for the white in the dough, reducing the white sugar in the dough too, cutting the cinnamon down a little, and maybe rolling only in maple sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karen"
},
"reviewBody": "Scrumptious cookies! I didn't have maple sugar so rolled them in brown and white sugar mixed together and they turned out delicious! Really quick and easy to make; a definite new favorite."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LisaP"
},
"reviewBody": "Maybe it was just me making the cookies too big, but I had to cook them several minutes longer since they were raw inside at 10 min. And much more fluffy than the picture. I did what was suggested...rolling them in sugar, brown sugar and Cinnamon..very tasty! I was surprised at the batter being very powdery...I had to spray Pam on my hands to keep it from sticking to my fingers...just a tip ;-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jkmarcoux"
},
"reviewBody": "I made these according to the original recipe, except using 1/2 brown &amp; 1/2 white sugar and 6 tbsp of good maple syrup. They are tasty and my husband likes them very much. I think I'd like them even better if they had a stronger maple flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "BakingInCleveland"
},
"reviewBody": "I am the owner of this recipe and have modified it even more for perfection every time:\n\n3/4 cup butter\n1/4 cup shortening\n1-1/2 cups white sugar\n6 Tbsp GRADE B maple syrup (it's worth it!)\n2 Large Eggs\n3 tsp Baking Powder\n1/2 tsp Baking Soda\n2 tsp Cinnamon\n3 cups Flour (less if too dry, more if too sticky)\n1/2 cup Maple Sugar (or cinnamon sugar or a combination of both, which is what I use)\n\nThis recipe doubles beautifully! Don't overbake!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "safia"
},
"reviewBody": "These are absolutely fabulous. The texture and subtle flavor is unbelievable and we were completely impressed. Well done Linda!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "J. Cates"
},
"reviewBody": "AMAZING!!! These are my go to cookies now. As suggested I used 3/4 white sugar, 1/4 brown and add an extra spoon of the maple."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Becky"
},
"reviewBody": "Enjoyed, will make again, but would like a stronger maple flavor. Will be looking for some grade b syrup to see if that helps."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "thunderwolf333"
},
"reviewBody": "these come out great. instead of margarine I used regular butter (salted) and it still comes out good. \r\nanother time I didn't have maple syrup and just skipped that and it still was a good snickerdoodle cookie recipe! \r\nthese are extremely sweet though I have to say. if you want them to be less sweet especially when you're using the maple syrup cut out some of the sugar but not too much."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/11466/ultimate-maple-snickerdoodles/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
"name": "Cookies"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/16420/desserts/cookies/snickerdoodles/",
"name": "Snickerdoodle Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/11466/ultimate-maple-snickerdoodles/",
"name": "Ultimate Maple Snickerdoodles"
}
}
]
}
}
, "about": [
]
}
]