				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Ultimate Banana Muffins"
,"datePublished": "2020-06-19T00:20:00.000-04:00"
,"dateModified": "2022-09-13T06:45:20.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Allrecipes Member"
,"url": "https://www.allrecipes.com/author/the-allrecipes-community/"
}
]
,"description": "This ultimate banana muffins recipe is the perfect way to use up overripe bananas. This is my go-to method for super moist and delicious muffins."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aMkYCpCXVPYGidG6VMCN8QspCcc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4479074-2c76713874dd47df9ba1726e9c39bc02.jpg",
"height": 960,
"width": 960
}
,"video": {
"@type": "VideoObject",
"embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6304653341001",
"description": "Try this go-to recipe to get rid of overripe bananas! The key to super moist muffins is to mix the batter until only just combined, and not to over bake.",
"duration": "PT1M17S",
"name": "How to Make Ultimate Banana Muffins",
"thumbnailUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/4677aeb1-c591-40d7-948b-ad3e1f757120/9d898631-e45f-46f9-bec3-d990f1d53692/1280x720/match/image.jpg",
"uploadDate": "2022-05-17T15:04:48.648-04:00"}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Ultimate Banana Muffins"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.9",
"ratingCount": "432"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "196 kcal"
,"carbohydrateContent": "31 g"
,"cholesterolContent": "29 mg"
,"fiberContent": "2 g"
,"proteinContent": "3 g"
,"saturatedFatContent": "4 g"
,"sodiumContent": "286 mg"
,"sugarContent": "15 g"
,"fatContent": "7 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT15M"
,"recipeIngredient": [
"1.5 cups all-purpose flour",
"1 teaspoon baking powder",
"1 teaspoon baking soda",
"1 teaspoon ground cinnamon",
"0.5 teaspoon salt",
"1 pinch ground nutmeg",
"3 bananas (ripe or very ripe work best)",
"0.5 cup white sugar",
"0.33333334326744 cup butter, melted",
"0.25 cup lightly packed brown sugar",
"1 large egg",
"1 teaspoon vanilla extract",
"0.25 cup chopped walnuts" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a muffin tin."
} ,{
"@type": "HowToStep"
,"text": "Sift flour, baking powder, baking soda, cinnamon, salt, and nutmeg together in a small bowl."
} ,{
"@type": "HowToStep"
,"text": "Mash bananas in a large bowl. Mix in white sugar, melted butter, brown sugar, egg, and vanilla extract. Fold in flour mixture until just combined. Fold walnuts into the batter."
} ,{
"@type": "HowToStep"
,"text": "Divide batter evenly among the prepared muffin cups."
} ,{
"@type": "HowToStep"
,"image": [
{
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/aMkYCpCXVPYGidG6VMCN8QspCcc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4479074-2c76713874dd47df9ba1726e9c39bc02.jpg"
}
]
,"text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes."
} ]
,"recipeYield": ["12"]
,"totalTime": "PT35M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a little honey (about a teaspoon) to the bananas since I had to use the oven method to ripen them and was afraid they might not be sweet enough. I also sprinkled some turbinado cane sugar on top for added sweetness."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DQISAQT"
},
"reviewBody": "Made this yesterday, only thing I changed was used pecan since that is what I had on hand. They were so good and moist! This will be my go to recipe for banana muffins from now on."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this recipe. It is so easy to remember and make I made multiple batches. As for taste, so delicious they were all gone in the same day. I made some exactly as the recipe says and added chocolate chips to some, amazing both ways."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "AngelaK"
},
"reviewBody": "Very good! Added a little sour cream to add moisture and a little additional cinnamon. Great flavor, whole family enjoyed these muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "What some cooks do not understand, but different parts of the country have different humidity levels thus affecting the product you are cooking. I am from the Midwest or Texas, Oklahoma, Kansas region. For this recipe to be moist here, I always have to add oil, not butter and a four ounce container of applesauce. Yogurt helps only a little. It is generally drier here than other states. So milk or applesauce or some fruit juice works best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "April Cook"
},
"reviewBody": "This will be my go-to for over-ripe bananas from now on. Just the right crispy top, tender crumb, moist and delicious. And quick and easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "brooke blake"
},
"reviewBody": "To the person who commented that the milk ingredient may have been forgotten. It was not. The muffins were super moist. Maybe you forgot to add something like the butter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "These were hands down the best banana muffins I've ever made or had. I halved the recipe because I only had one banana and was having an insane pregnancy craving for banana muffins, and they were amazing. So light and fluffy, the flavors were just perfect. Gonna save this one to make again and again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bake Girl"
},
"reviewBody": "Amazing, nothing off."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Katherine"
},
"reviewBody": "Made as directed. Great texture and very moist. Definitely don't overmix."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Did you forget the milk on this recipe? I couldn't even mix the dough it was so dry. Other recipes call for milk, I had to add some because otherwise I could not have mixed it to the right consistency."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "greg T"
},
"reviewBody": "I loved this recipe made them exactly like recipe, didn’t change a thing. They were very tasty and moist"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TW3LLS"
},
"reviewBody": "For me, these were more the texture of banana bread which is perfect for us. The flavor was great. I omitted the baking soda (not powder) as I didn't have any, perhaps that is why they were not as fluffy as a true muffin? I will continue to omit the baking soda :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "loddiecheftress"
},
"reviewBody": "Banana flavor thru and thru!! I used 3 bananas that were extremely ripe, but they were frozen. I thawed them out and then drained the juices that were on the plate. I smashed those 3 extremly ripe bananas, along with 2 very ripe bananas I had sitting on the counter. I didn't change anything else to the recipe. Cooked 12 regular sized muffins in exactly 20 minutes. Finally, my favorite banana muffin recipe!! I need to print this recipe and add my banana notes, as this is now the keeper recipe. I did shake a good amount of cinnamon sugar to the tops of the muffins during the last 5 minutes of baking (yum)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Crystal Yearous"
},
"reviewBody": "FANTASTIC flavor! I added cinnamon and sugar, along with toasted coconut and pecans, on the top. The crunch from that added topping with the moistness and flavor of the muffin was INCREDIBLE! My husband LOVED 🥰 them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Followed exactly and my family of 6 all loved them. Will make again exactly the same way but maybe bake 2 more minutes so the tops aren’t sticky after cooling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Made these muffins. Came out great. Used pol instead of butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emmz"
},
"reviewBody": "I didn't have brown sugar so I used maple syrup instead and the came out amazing"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I have tried many recipes over the years and this is my favorite. I like the addition of cinnamon, nutmeg, and walnuts, gives it a wonderful flavor. This was a huge hit in my house."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Very good recipe. Very delicious. I leave the muffins in the oven for up to half an hour though"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Kinder"
},
"reviewBody": "Loved these muffins! I wanted to use all 6 of the really ripe bananas I had so I doubled the recipe omitted the nuts and added 1 cup peanut butter &amp; 1 12 oz bag of semisweet chocolate chips. This made 24 regular size muffins &amp; 24 mini muffins. They turned out very moist and delicious. I Shared some with my son’s family &amp; froze some. Great for breakfast or a yummy snack!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I loved this! Super moist and soooo flavoursome. Added 100g of choc chips for some extra love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Phyllis Sheffield"
},
"reviewBody": "Easy to make, delightfully moist with great flavor. No modifications necessary and I will definitely save this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "teenymc"
},
"reviewBody": "I usually read some of the reviews and suggestions before trying. I used 1 c. flour and 1/2 c. whole wheat pastry flour (because I had it). I used canola oil like some did. I had 3 very ripe large bananas, and freshly p icked blueberries. I also added walnuts. The rest was the same. They turned out moist, light, and flavorful. I'll make them again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "South Point Hawaii"
},
"reviewBody": "EXCELLENT! Light, Fluffy, Moist! I added blueberries and sliced almonds. Then I made 6 Large muffins at 350 for 40 min. Came out perfect! This will be my new go to for banana muffins. :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SweetToothDDS"
},
"reviewBody": "I make several batches of these at once. I then wrap each muffin in cling wrap and put them in gallon freezer bags, pull them out when you want a fresh muffin... 30 sec in the microwave!!! PERFECT for kids lunches/snacks!! love the recipe and so does my son. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I tried this recipe because I like trying something new to see if it will impress my toddler. And while all banana muffin recipes seem the same, the slight variation in ingredients makes a big difference. She said these muffins were the “best of the best, she never knew she could have” and gave me multiples kisses and thank you’s for making them for her. I made smaller muffins to use them as a snack or to pair with some fresh fruit in the morning for breakfast. They are not overly sweet, very tasty, and moist. Thank you for this recipe, I will definitely be using it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe is at the top of my list for banana muffins. Our whole family loves them exactly as the recipe is. I do however always add some raisins just because we love raisins with these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "So fast and easy. I added wild cranberries and they are so tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Delicious! I made 6 muffins, 3 donuts, and one small castle cake with this recipe. The banana goods are soft, cakey, tender, fluffy, light, sweet, flavorful. I had some mushy brown bananas a few weeks ago and wasn’t ready to make banana bread so I froze the banana in a jar. I defrosted it before making the muffins. -I replaced the butter with sweet almond oil (we didn’t have any butter) and it wasn’t noticeably different than any other baked good I’ve made with butter. The sweet almond oil is pretty bland and the flavor it does have goes well in this. -I didn’t use nutmeg because we didn’t have any, but I think it would have been better with it… still amazing without. -I added about 1/4-1/2 cup maca powder because we had it on hand and I figured it would be a good addition. I believe the added maca root powder really kicked up these muffins. I’ve never felt such energy! Perfect for a breakfast muffin for sure! People say maca tastes like butterscotch, and I didn’t really taste anything so I think it’s a great addition, being an ancient superfood. -I replaced the egg with “Neat Egg” a vegan egg alternative made with garbanzo and flax (gives the batter a disgusting flavor, but once baked it is delicious!) -I coated the top of mine with some confectioners sugar we had on hand and that was a great choice. Very yummy. I will definitely make this recipe again for sure. Most likely with butter next time, but I will add maca powder again and I’d also like to add in chocolate chips and experiment with other add-ins and flavor combos. Oh and one more thing… before I added the baking soda and baking powder I blended the batter with a hand mixer to remove any chunks, as I have never cared for big clumps of banana in my breads. Thank you for the recipe. Highly recommended recipe for anyone who likes delicious food and does have some sort of baking skill. For the people who said they didn’t like it— maybe you should try tweaking the recipe a bit before throwing it in the oven. Make it your own and don’t forget: don’t overcook!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Judy Martin"
},
"reviewBody": "These rose nicely to a proper cap. A bit sweet for my taste. I added the walnuts- could have used more than ¼ cup IMO. I made as per instructions except substituted melted coconut oil for the butter. Cooking time was bang on. Next time I may try less sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "echolaners"
},
"reviewBody": "We omitted the nutmeg as a household we simply dont like nutmeg. Also after the first batch we cut the cinnamon from 1tsp to 1/2 tsp. As the cinnamon was overpowering. Overall a GREAT recipe and adjustments were simple and didnt mess with the quality of the Muffin!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I always follow recipes exactly the first time. Then the second time, I know what I would like to change. In this recipe, there is nothing to change. The muffins look perfect and taste just as you would expect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Becky Cleveland"
},
"reviewBody": "I made two batches. The first batch I followed the recipe. The bananas were really small so I used 4 (14.5 ounces). That was definitely too much banana. Also, my nutmeg was fresh and it overwhelmed the taste. So the next batch I used 11 ounces of banana, omitted the nutmeg and added extra nuts. Perfect muffins! Oh I also used 1/2 cup brown sugar and about an 1/8 cup white sugar."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Karen Sperry-Koons"
},
"reviewBody": "I thought this recipe was easy to make. I didnt change any of the ingredients. it made a little more than expected and they seem to to be puffing up nicely, better than in the video, so thats good. Havent tasted them yet but the batter I licked off the spoon was delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Huge hit with my B&amp;B guests!! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chrisgabe737"
},
"reviewBody": "no changes..delish :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Wonderful muffins. They were moist and delicious. I used extremely ripe bananas and doubled the recipe but only used 5 bananas. I didn't have walnuts , so I substituted fresh blueberries that I had on hand and added a couple spoons of mayonnaise. Turned out perfect and the family loves them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Super moist! Left out nuts as I was making banana bread muffins not banana nut… Remove from tin immediately. Yielded 12 Perfect uniform muffins."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Yummy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "angelique_redhead"
},
"reviewBody": "I did add a bit more spice and vanilla but we always do. I also used half whole wheat flour. All in all, a lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joym52"
},
"reviewBody": "The perfect banana muffin. I didn't alter the recipe at all."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexia Wheaton"
},
"reviewBody": "I omitted the nuts because I particularly don’t like them, and I thought the dough was too dense so I added 3 tablespoons of plain yogurt and I love the result 😃"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hull Hanna"
},
"reviewBody": "Only baked for 17 minutes. 😍"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marla Terrell"
},
"reviewBody": "Perfect as is!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fishinbuds2"
},
"reviewBody": "Good texture, moist and hearty. First batch had one substitute: banana flavoring. Second batch: added one more banana which we thought was even better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CindyMarie"
},
"reviewBody": "Oh yes, very scrumptious. I would add a tad bit more sugar for my sweet tooth."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kat"
},
"reviewBody": "I made six giant muffins. Doubled the cinnamon and a whole tsp of nutmeg. I also added some extra walnuts and cinnamon and sugar on top. Cooked for 33 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melissa Buelow"
},
"reviewBody": "Everyone loved them. Super moist and delicious. I added chocolate chips but didn't make any changes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caringwolf"
},
"reviewBody": "They were a huge hit and I was asked for more at my son's place of employment. Even offered to buy all the ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Christine"
},
"reviewBody": "Easy to make only needing basic equipment. I substituted Bread Flour for the All Purpose because I was out of AP."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "David Zollinger"
},
"reviewBody": "I used 3/8 cup vegetable oil instead of butter, and I zested 1 mandarin orange to add some citrus flavor in addition to the spiced banana.\nAdditionally, I only had 2 bananas, but they still turned out great! I will definitely be making these a few times this Christmas season."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "toohot2handle42"
},
"reviewBody": "First time making and will always make these!! I added chopped walnuts in and on top and also quarter cup of blueberries inside. So moist and delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "collette"
},
"reviewBody": "Good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "2hghypscsb"
},
"reviewBody": "These are delicious. I actually put some dark choc chips in mine and they are so good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cherryrogers2009"
},
"reviewBody": "I didn't have a muffin tin so I just used this recipe to make banana cake. It tasted amazing and the cinnamon and nutmeg really added a lot of flavours. The outside was crunchy and the inside is moist and full of flavour. I 100% recommend this recipe to banana lovers and bakers!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lynn"
},
"reviewBody": "Made them and they were so yummy! my only changes, and this is personal- I ommitted the cinnamon and nutmeg, added double the nuts and added a healthy portion of chocolate chips! WINNER!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "meandmy4w"
},
"reviewBody": "I really like this recipe! The banana muffins came out delicious! The only ingredient that I didn’t have on hand was the Nutmeg :( But the muffins still turned out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sierraeden"
},
"reviewBody": "These were phenomenal!!! I followed the recipe exactly (opted out of walnuts!) and they are delicious. Highly recommend these!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "William Mihalo"
},
"reviewBody": "These came out great. I doubled the recipe so I could use up 6 bananas. Also the bananas that I had were large and I should have added an additional half cup of flour.\nI will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I followed the recipe to the T. I used 3 large bananas and my tupperware silicone muffin moulds. I also cooked these @170°C for 20 minutes. \nThey came out brilliantly. Plenty of flavour. Nice and crispy top. If anything I would probably take it out a couple minutes early. But definitely make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Barron Rodriguez"
},
"reviewBody": "Really great versatile recipe. I used my loaf baker and it turned out great! Baking time was bumped up to 28 min. Convection. I also had 4 really large bananas, no issue! Thanks for this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "beck"
},
"reviewBody": "Great recipe! Personally, I like to swap the amounts of white and brown sugar; and to use canola oil instead of butter. I've got 4 roommates and these muffins don't last more than a couple of days in our place."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Alexis"
},
"reviewBody": "Best banana bread muffins I have had so far."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FrenchToast"
},
"reviewBody": "Great banana muffin recipe, very flavorful with ripe bananas, the vanilla, cinnamon, nutmeg, &amp; brown sugar. All added to the depth of flavor. Ingredient ratios were spot on, baked up moist but not overly dense. Will definitely make these again in the future, a saved recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dixie Van Dusen"
},
"reviewBody": "This was so easy, and fast. Live at high altitude, but just followed the recipe as is and they were excellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elizabeth Rhodabarger"
},
"reviewBody": "I had poor planning and only had 2 bananas, so I threw in an extra egg since the bananas I had were massive. I don't know how much of a difference it made but these were the best banana muffins I've ever made- they were more like a cupcake than a typical dryer muffin. I'm going to be making a triple batch next round because by the next morning there were only 4 left!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diannia"
},
"reviewBody": "Good recipe! I tweaked it to less bananas, added crushed strawberries and mini chocolate chips...very yummy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Neyland"
},
"reviewBody": "These muffins really are the ultimate. Stop right here, this is the recipe that you’re looking for. I did not make any substitutions but I did add 1/2 cup mini chocolate chips in addition to the walnuts. I love how the mini chips give just enough chocolate taste without overpowering the banana or the nuts. Plus my family loves them with the chips in them. I did go a bit heavy on the nuts as well, maybe almost to 3/4 cup. As a result, I had to bake my muffins for about 8 minutes longer than the recipe as written. The big challenge for me with bananas is always the size of the bananas. Sometimes I have small or large, but this time I used 5 medium sized bananas. I prefer a measurement baking rather than a number but it worked out well and my muffins released from the pan perfectly. They’re a little dark in color but not burned. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tina"
},
"reviewBody": "Oh my word!!!! Anyone looking for a banana nut muffin recipe need not go any further than this recipe! Everything about it is exceptional!! Followed directions exactly - no modifications.... I advise you do the same!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Whatley"
},
"reviewBody": "This turned out great! I did add and change a few things, I swapped 1 cup of flour for wholemeal, swapped butter for coconut oil as I needed dairy free, added 1/4 cup oats, and a handful of broken frozen raspberries pieces, so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Gross"
},
"reviewBody": "Excellent. Moist and delicious. My go-to recipe for used bananas. Also have added mini chocolate chips for those in my house who like that combination."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shirley E"
},
"reviewBody": "I used honey instead of white sugar. I used a little less honey. Very good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jim O'Brien"
},
"reviewBody": "Really, really ripe bananas are the key. Assemble the ingredients prior to embarking on this journey. You will be rewarded. Check them at 15 minutes, as ovens differ in heating properties."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Caroline Verleyen"
},
"reviewBody": "Delicious and easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "karennaj"
},
"reviewBody": "These muffins were so delicious and moist! I added some semi chocolate chips to a third of them to see how they'd turn out. Extra delicious with the chocolate chips!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Love these banana muffins! I hate to be \"that person\", but my son is allergic to eggs so I did sub in 1/4c applesauce in place of the egg. They turned out wonderfully, super moist with great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DEE"
},
"reviewBody": "I love this recipe! I make these for my Grandkids. I add mini chocolate chips and make them as mini muffins. I also put a little less white sugar and add a level teaspoon of honey. The kids go through these tasty little muffins faster than I can make them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kelly"
},
"reviewBody": "I baked mine for five minutes longer."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Donna"
},
"reviewBody": "I am not a banana fan. These muffins are great. The nutmeg and brown sugar really changes these up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Joshua Gene Skibba"
},
"reviewBody": "4 stars easy to make 12 good banana muffins"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ria De Gorter"
},
"reviewBody": "Great and simple recipe! I changed the butter for vegetable oil and added chocolate chips too. Nice change from regular banana bread. Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Elisa"
},
"reviewBody": "We give this recipe 10 stars! I didn’t have nutmeg and they are still delicious and so moist. They didn’t look as fluffy as other recipes but they taste amazing. I made this recipe with my 10 year old son and it is very easy to follow and make. We can’t wait to make again and this time we’ll add the nutmeg. I wouldn’t change or modify anything to this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane"
},
"reviewBody": "Delicious, great recipe! Will definitely use it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kim Radl"
},
"reviewBody": "Super simple with ingredients most people have in the house. Made no changes and they turn out perfect every time. I'm not a baker so I found it helpful the author said to mix only till combined."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brianna Rice"
},
"reviewBody": "Great taste!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha Moore"
},
"reviewBody": "These muffins were perfect - my husband ate 4 of them in 5 minutes! My picky 5 and 7 yr old loved them too. I put chocolate chips in instead of walnuts - YUM!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bddavemci"
},
"reviewBody": "This recipe is so easy to make and the muffins were delicious! Most and tasty. The only changes I made were that I used pecans because I was out of walnuts and I used paper muffin cups. Highly recommend making these."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natasha Multani"
},
"reviewBody": "my new favorite muffin recipe. Turned out light and fluffy"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Andrea Henson"
},
"reviewBody": "I had to add milk as the mixture was too dry"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dogmom"
},
"reviewBody": "Excellent! I only had 2 bananas so I added some applesauce and 1/3 cup of chocolate chips. I also baked them for 23 minutes instead of 20."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nicole Bruggman"
},
"reviewBody": "I followed the recipe exactly. These are delicious muffins. They are extra buttery and I like it. \nNext time I may try adding chocolate chip instead of walnuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kar"
},
"reviewBody": "If you are looking for a simple, classic banana muffin recipe this is for you. The flavors are well balanced and the moisture level is good. I did not add the nuts because of a nut allergy in our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ann Marie Townshend"
},
"reviewBody": "I used half whole wheat flour, and we love them."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLHoule"
},
"reviewBody": "cinnamon and nutmeg add a nice flavor. def not boring"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DebiW"
},
"reviewBody": "I followed the recipe as written. They came out great. They were light and moist. This will be my new go to when I have overripe bananas! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Linda Wood Martin"
},
"reviewBody": "These are great! I used 3/4 c brown sugar and 3.5 ripe bananas. Oh, also added another Tbsp of milk because the batter was thick. Very moist and good density."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sammy"
},
"reviewBody": "Great banana muffins."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/257206/ultimate-banana-muffins/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
"name": "Muffin Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2004/bread/quick-bread/muffins/banana-muffins/",
"name": "Banana Muffin Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/257206/ultimate-banana-muffins/",
"name": "Ultimate Banana Muffins"
}
}
]
}
}
, "about": [
]
}
]