				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Unbelievable Spinach Calzones"
,"datePublished": "2019-04-02T02:48:02.000-04:00"
,"dateModified": "2022-10-12T20:29:47.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Tosha Fields"
,"url": "https://www.allrecipes.com/cook/111226"
}
]
,"description": "Delicious, satisfying, and very easy to make. My kids will even eat spinach this way! We serve them with warmed spaghetti sauce to dip them in and a salad. Yum!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/viijYUcXTtumifpKYxXn4N4lMEA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6867167-unbelievable-spinach-calzones-ericatx-4x3-1-f25ff325c71242c3a3e00b0d79668ece.jpg",
"height": 1125,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Unbelievable Spinach Calzones"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.2",
"ratingCount": "307"
}
,"cookTime": "PT30M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "584 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "101 mg"
,"fiberContent": "6 g"
,"proteinContent": "36 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1200 mg"
,"sugarContent": "6 g"
,"fatContent": "21 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT60M"
,"recipeIngredient": [
"1 (15 ounce) container ricotta cheese",
"2 eggs",
"2 tablespoons dried Italian seasoning",
"3 cups shredded mozzarella cheese",
"1 cup freshly grated Parmesan cheese",
"1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
"salt and pepper to taste",
"1 (32 ounce) package frozen white bread dough, thawed" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 400 degrees F (200 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "In a large bowl, mix together the ricotta cheese, eggs, Italian seasoning, mozzarella cheese, Parmesan cheese and spinach. Set aside."
} ,{
"@type": "HowToStep"
,"text": "Divide the bread dough into 8 pieces and roll each piece out to about an 8 inch circle. Spoon about 1/2 cup of the ricotta filling onto each circle, fold over and seal the edges. Place onto a greased cookie sheet."
} ,{
"@type": "HowToStep"
,"text": "Bake for 30 minutes in the preheated oven, or until nicely browned on the tops and bottoms."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "C.J.H."
},
"reviewBody": "I made one without salt and pepper because I wasn't sure of the flavor profile, but it was great. I couldn't find frozen bread or pizza dough, so I used canned biscuits (one for the top and on for the bottom). It came out really well! \nI made one as the instructions state, and look forward to trying it with everyone's modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ThoHug"
},
"reviewBody": "Just remember that a calzone is similar to just taking a pizza and folding it in half to eat. Visualizing it that way, I modified this the second time I made it. First time was the exact recipe, but the second time I made these modifications:\n\n- added artichokes, onions, garlic, and mushrooms. \n- added asiago cheese to the mix.\n- used THIN pizza crust dough from the grocery instead of the frozen bread dough as recommended in the recipe. Made two large calzones instead of small serving sized versions.\n\nKeep the cheeses and if you want to use marinara sauce, do not put that in the calzone otherwise you risk the dough being too soaked coming out of the oven and it will easily fall apart. If you have leftover filling, this easily freezes in the freezer for use later on!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ericatx"
},
"reviewBody": "I added some roasted chicken to the spinach mix. Served with marinara and pesto. It was a huge dinner hit!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Bonang"
},
"reviewBody": "I omitted the ricotta cheese. I also added paprika &amp; onion powder."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Christie Leonard-Garcia"
},
"reviewBody": "It was just ok... i won't make it again I'll be trying new recipies. I followed it exactly as written. Very bland tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "frugalmomma"
},
"reviewBody": "Too much Italian seasoning for us. If I use this recipe again I will half the seasoning."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lauralynn24"
},
"reviewBody": "Easy to make. I melted butter and garlic to make a dipping sause. It was a lil dry. Maybe next time i will add an egg to the cheese ."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Serena Lynn Holt"
},
"reviewBody": "I followed the recipe and found the bread to be too much. I will defin9try these again with pizza dough like others have suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Le Aurore"
},
"reviewBody": "Im sorry, but this dish wasn't that good. Everyone in my family disliked this meal. It was took much trouble to make this dish, and then finding out it, that this dish wasn't even that good. I forced myself to eat this dish so that my mom didn't get up about wasting good. I was begging for dish to be finished already. My mom even tried putting ham in it and it still wasn't very tasty. I'm kinda of a vegetable lover and I do like spinach, but this meal was nasty and hard to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Momma Lisa"
},
"reviewBody": "This was a very good filling. The changes I made were to sauté Italian sausage, drain and cool. Next I mixed the ricotta, mozzarella and parmesan with a wooden spoon in a bowl, next added the eggs. I mixed this well and added half of a head of fresh spinach. I found the frozen to be too watery.\nOnce the sausage was cool I spread it to the bottom of the calzone then covered it with the cheese mixture. Next I sealed the calzone and proceeded with the cooking instructions, I covered it with Chef John's tomato sauce and it was delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Shell D 0013"
},
"reviewBody": "Overall pretty good. The amount of italian seasoning called for is a bit much. I added chopped chicken as someone suggested, which was a good addition. I also used 2 cans of pizza dough, which cuts down prep time. I only baked for 25 min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heatherfeather"
},
"reviewBody": "Really solid recipe for how quick and easy it is. I made it for dinner and had the leftovers the next day on a plane trip. They were still great room temp. This would be a successful lunch box item."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mrkang206"
},
"reviewBody": "So good I made it with home made pizza dough and an egg wash is highly suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Paula Berndt"
},
"reviewBody": "I made these with frozen bread dough, sauteed fresh spinach and added 4 cloves fresh garlic and a small onion sauteed. Tossed in some red pepper flakes and crumbled italian turkey sausage. Left out the ricotta cause I didn't have it handy, then wrapped each one with a few sliced roasted hot peppers. Yum gave it a four because I altered it so much."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jack"
},
"reviewBody": "Add broccoli, mushrooms and sausage. Made dough from Real Italian Calzones recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "STARDUST_331"
},
"reviewBody": "Quite good - also bought Pillsbury pizza crust (which was ok - a little like crescent rolls so might try another one next time). Forgot the parmesan and felt really stupid. This needs some dipping sauce - I had leftover spaghetti sauce and that really elevated this recipe from great to incredible."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickie"
},
"reviewBody": "Yum!! Prepared exactly as written. We topped them with Ragu Traditional Pizza sauce. May try adding different ingredients next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "NLadybug"
},
"reviewBody": "This recipe was great! And easy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen the Tea Queen"
},
"reviewBody": "Good! I added 8 oz sauteed mini bella mushrooms to this and used low fat cottage cheese in place of the ricotta. I also put some turkey pepperoni in some of the calzones. Before baking, brush with olive oil and sprinkle some fresh crushed garlic on top for a delicious garlic flavor!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "tigressmama3"
},
"reviewBody": "I loved these, however not all of my kids would eat them. These are better than the ones I used to buy at the deli. I will keep this recipe for a long time and make them from time to time, definitely a keep recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mericahanne"
},
"reviewBody": "i LOVE this recipe !!! i make it exact. all 5 of my kids and my husband actualy loved it too(wich never happens) my 5 yr old has even requests it for dinner. anything to get them eating their vegies gets an A+ in my book :) THANKS for the AWESOME recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Evie"
},
"reviewBody": "The filling makes a big batch, so you can use it for a party or freeze what you don't use. We've turned calzone night into a party, everybody rolls out their own dough, adds their own ingredients and we hang out while they're baking. Makes for fun conversation and personality-typing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Fegler"
},
"reviewBody": "We loved these versatile calzones. I added black olives and canadian bacon, but the options are endless. The filling oozed out of mine. Maybe I filled them too full, or didn't seal the edges enough. They were still fabulous. I used my favorite pizza dough recipe and we dipped them in pizza sauce."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KW"
},
"reviewBody": "I followed the recipe except that I added a cup of feta and used pizza dough instead of bread dough. This was good but a work in progress..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Erock"
},
"reviewBody": "This is a really good recipe! I added chicken to it. I only added about 1/2 of the ricotta cheese. I also separated the dough into smaller rectangles because when I have made calzones in the past with the dough just cut in half it seemed to be too much dough. This way turned out perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "ChrissyT"
},
"reviewBody": "These came out delicious. I followed the recipe exact, except for the dough. I made my own pizza dough but next time to save time I will buy the store bought dough. They were really tasty and I even ate the calzone cold for lunch and was really good. will make again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaninki"
},
"reviewBody": "I had a couple friends over for dinner and I decided to use this as a base recipe (with the exception of using pizza dough). I ended up adding some onion and garlic powder in with the mixture as well as chicken and bacon. I also brushed the tops with egg whites when it was close to being done and sprinkled garlic salt on top. And because I'm not the biggest fan of marinara sauce, I provided the choice of marinara or alfredo sauce to dip it in. It was AMAZING! My only complaint was after I added the bacon and chicken, there was far too much. My 2 friends and I each had a large calzone and then I ended up bringing the left overs to my sisters house for a dinner party the next night and we made mini calzones for appetizers. I would say we made at least 20 three inch calzones before running out of pizza dough and I still had quite a bit of filling left. I don't usually cook so I didn't realize how much 3 chicken breasts and some bacon would add to the total amount of filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Happy Cook"
},
"reviewBody": "Very good. I made a few exceptions. I only used one egg and added a lot of fresh basil. Instead of using frozen spinach, I used fresh, chopped spinach. Added 4 large cloves of garlic. To assemble, put a spoon of sauce on the dough, heaping pile of fresh spinach and two scoops of cheese mixture. Will definitely make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Tuesday"
},
"reviewBody": "I made 4 large calzones instead of 8. They turned out gigantic and yummy. Two things I would do differently next time is make sure I had some red sauce/marinara for dipping and I would definitely add mushrooms and onions to the mixture. I will also stick to the recipe about making 8 as no one could finish the jumbo versions. This recipe could easily be altered to anyones preference."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Narcissa"
},
"reviewBody": "My 9 year old son made this for a Mother's Day menu @ Daycare with the other kids. This dish was their Main Dish for the luncheon and it was a hit! Have to try this myself!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "These were delicious and so easy to make. Next time I will make a little less filling, though. Sauce on the side for dipping is a must!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jrhome"
},
"reviewBody": "Good, but filling not spectacular. Bread dough a nice and easy way to make calzones."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Diane H."
},
"reviewBody": "These were great and it's an easy recipe to follow. I did use a can of frozen pizza dough because I didn't have frozen bread dough and they were delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "lizgrace03"
},
"reviewBody": "Something needs to be done to improve the dough. The filling is excellent. These keep well."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "NARDOLINO"
},
"reviewBody": "eh, these were ok. I think it would be simpler without the ricotta and egg, but thanks for the idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cheryl"
},
"reviewBody": "thought these were just ok. I like ricotta but didnt think it went well in a calzone."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CDUB"
},
"reviewBody": "Delicious! I added a few pepperoni to a few. They were so good and I will totally make them again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lily Butler"
},
"reviewBody": "Scrumptious!!! 1 egg yolk (used the white for brushing) extra fresh spinach, sauteed with onion and garlic Homemade pizza dough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "My family and I love this recipe. The only change I made is using two pre-made pizza crusts instead of the bread dough. I have made this recipe several times and you can halve the recipe by halfing the cheeses. We top them with warm spaghetti sauce right before eating. They have tuened out great every time for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenny D."
},
"reviewBody": "My family and I love this recipe. The only change I made is using two pre-made pizza crusts instead of the bread dough. I have made this recipe several times and you can halve the recipe by halfing the cheeses. We top them with warm spaghetti sauce right before eating. They have tuened out great every time for me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "1biteb4yuck"
},
"reviewBody": "Nice basic recipe to get you started in the right direction. I used a can of pizza dough as another reviewer suggested. I also added cooked chicken, marinara sauce and sauteed mushrooms and onion. It was the additions to the recipe that made my family love it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melanie Tuning"
},
"reviewBody": "this recipe is very easy. I made homemade white bread dough instead of the refridgerated dough pkg. I think the filling could us a bit more...maybe artichoke hears, or chicken pieces."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amy Staritz"
},
"reviewBody": "Good, but a little too much ricotta cheese. Kids didn't like it at all because of the spinach."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "KLB811"
},
"reviewBody": "These calzones were pretty easy to make and tasted good. Mine needed less bake time (the tops got too hard and brown for my liking) and next time I'll add meat/other toppings to the filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jeanna"
},
"reviewBody": "Filling is a little bland but a good, flavorful dipping sauce helps. Next time I'll try adding some red pepper flakes to it. Also recommend brushing them with olive oil before baking for a nice brown crust."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bowhead"
},
"reviewBody": "Just made these for dinner tonight. YUMMY! Made exactly as the recipe stated except used sausage and pepperoni instead of spinach (didn't have any). Added a side of pizza sauce topped w/cheese on the side for dipping. My family loved every bit of it!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "collegechef08"
},
"reviewBody": "These are really easy and fast. I'm giving it a four only because I felt it needed more flavor and added more seasoning than the recipe called for, but thats a personal preference thing and I will definitely be making these again! Thanks :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "efranklin"
},
"reviewBody": "My kids ate them! I would have liked if they had a little more flavor. But, I will still make them again. I love how easy they are!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Toasty Mama"
},
"reviewBody": "So good! I didn't have any ricotta cheese on hand so I unfortunately had to omit it. I added a little crushed red pepper and some cooked mild italian sausage (for my meat eating men) and used fresh pizza dough the first time I made these. The second time I used Pillsbury pizza dough as suggested by a few other reviewers. It was easier, but I didn't like it as much. Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate Burke"
},
"reviewBody": "Except it was a pain dealing with the pizza crust I used - too stretchy. I had way too much filling also."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JMorgan"
},
"reviewBody": "Loved this! I went a little easy on the mozza and Parm cheeses to make it more healthy, but I'm sure it would be even better if I hadn't. I added 2 chopped roma tomatoes and a cup or so of chopped fresh mushrooms. I also used one egg instead of two and didn't miss anything. Needs just a pinch of salt. My hubby and toddler went to town on this! Thanks so much for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "BROWNGIRLY"
},
"reviewBody": "Yummy recipe! I made my own pizza dough and used fresh spinach sauteed in a little bit of olive oil with mushrooms, garlic and red onion. Added some pepperonis in a few of them. My family loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pitvet"
},
"reviewBody": "I made this with a pizza dough recipe. I added chopped red bell pepper and cooked chicken to the filling - I only made 1/2 the filling recipe and it made 5 calzones. Turned out very nice. Will definitely use this one again - very amenable to tweaking."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "luv2eatlegumes"
},
"reviewBody": "These were pretty good, but nothing spectacular. It was a great way to use up some spinach and get the flavor I was craving without going through all the time lasagna requires."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Michelle"
},
"reviewBody": "Okay. I made them with pizza dough and added crushed red pepper. They were satisfying and fairly no-hassle to prepare, so I'll probably make them again, but may try adding some more ingredients next time. Seems like a recipe kids would love."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "pickyeater"
},
"reviewBody": "These were really easy to make and tasted very good. I used my pizza dough recipe for my bread machine to make the dough. My husband thinks they would be even better with chicken - although we enjoyed them as they were!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chorusgirl3"
},
"reviewBody": "I made this for me and my bf, I ended up with a lot of extra filling so I baked it in a custard dish. I made my own pizza dough from scratch Mix 1 packet of yeast 1 teaspoon of sugar 1 cup of water (let sit for 10 min) 1 Tablespoon of olive oil 1 teaspoon of salt 3 cups of flour Let rise for 1 hour then follow the recipe as above. Turned out great. I also had a can of diced tomatoes simmer for the baking time and added some oregano and basil for dipping. I was out of canned marinara."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mommasita"
},
"reviewBody": "My kids had \"build your own calzone\" night. I too used pizza crust and brushed egg over the top. I also used fresh spinach which I sautéed in olive oil and garlic. I found some organic (chicken) Italian sausage and pan fried that to go in the calzones. I followed the recipe for the cheese filling and had my kids help mix it. This was a really fun and easy dinner to make!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really tasty! I used 2 tubes of ready made pizza dough and baked for 25 min. Next time I would use more spinach, less ricotta and only 1 egg. It was a little too quiche like for me. My guys loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "justducky"
},
"reviewBody": "Really tasty! I used 2 tubes of ready made pizza dough and baked for 25 min. Next time I would use more spinach, less ricotta and only 1 egg. It was a little too quiche like for me. My guys loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie Gebhart"
},
"reviewBody": "These were really tasty, but be sure to flip them 1/2 way through - otherwise you'll end up with 1 doughy side!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "greenis813"
},
"reviewBody": "I made these into bite-sized calzones. I had about half of the mixture leftover, so I would suggest doubling the amount of white bread dough to use all of it. I also baked it for half of the time. Add some marinara for dipping and you're good to go!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Whitney Deuel"
},
"reviewBody": "I used pre-made pizza dough, which made it super easy and they were yummy! I would probably coat the top with butter as another reviewer suggested since they do turn out a bit hard on top. Definitely didn't need 30 minutes cook time; as it was, the cheese was running out... So good though!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TILLIEMAC"
},
"reviewBody": "I didn't realize the recipe called for 2 lbs of dough; I had only bought 1 lb, but everything still came out fine. I made one long (log) calzone, and the top/middle was busting at the seams, but of course it didn't change the taste and just made it look that more appealing. I also added garlic powder to the filling but that would be optional to someone else."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mammaw"
},
"reviewBody": "Very good, very easy-my kind of cooking. ;o) Tried the pizza crust and it worked perfectly. The elasticity of the dough let it stretch easily without tearing. Thank you, Wheatfields, for the delicious filling. Thank you, reviewers, for the pizza crust suggestion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "SYNCHORSWIM"
},
"reviewBody": "I really waned to like these, but I found them nothing special. I made them using the whole wheat and honey pizza dough recipe from this site instead of the canned dough the recipe calls for, but I doubt it made that much difference. I don't think I'll make these again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pittsford Mom"
},
"reviewBody": "My kids (age 5,7) actually made these with a little help! We forgot the parmesan cheese and only had 1 TBS italian seasoning left and they still came fanstastic. I would probably stick with the 1 TBS seasoning as any more might have been too much. Great way to sneak little spinach in their diet! We added pepperoni to half of them and we sprayed the tops with a little butter spray about 10 min before they were done. Next time will try with sausage and mushrooms."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suzanne"
},
"reviewBody": "Made these using pizza crust made in the bread machine. Added one large clove garlic. They were delish!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "bonnie s."
},
"reviewBody": "this was an excellent recipe. i goes well with pasta sauce on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdockeney"
},
"reviewBody": "This is such an easy recipe! I agree it needed some extra spice: I used more Italian seasoning and some garlic salt. I saved one egg white and brushed it and extra garlic salt on the tops of the calzones before baking. Great recipe to share with my vegetarian roommate!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "acurtis"
},
"reviewBody": "Being a poor college student, I made some substitutions and they still turned out incredibly delicious! I put in one package of softened cream cheese instead of ricotta, which I know is no proper substitution, but it made the mix creamy like it needed to be, and it turned out yummy! Also, I used powdered parmesan, which works if you don't have the grate-able stuff on hand. And then I added the garlic salt and onion powder as well as cooked, cubed chicken. I brushed the outside with butter and sprinkled with parmesan, as someone else said. My husband told me we need to make these again really soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jenn"
},
"reviewBody": "Giving this four instead of five b/c I doctored up the filling a bit. I added sauteed garlic, onions, mushrooms, and pepperoni to the spinach and cheese mixture. Used Pillsbury's frozen pizza dough, per another reviewer's recommendation. Brushed an egg wash over the calzones before popping them in the oven for about 20 minutes. They looked and tasted great. Really easy, fun, tasty dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "sailshonan"
},
"reviewBody": "This makes a lot of filling--maybe too much. I added 1 T of Italian seasoning and 3 cloves of garlic to the filling. I brushed an olive oil, salt, Italian seasoning, onion powder, and garlic powder combo onto the tops of the calzones, and then sprinkled parmeasan cheese over it. Baked them on a pizza stone. 4.5 stars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Lisa"
},
"reviewBody": "Will add some sausage or bacon next time for my husband's preference. But we all enjoyed them very much"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "red8jellybean"
},
"reviewBody": "We loved it! Just added a little bacon to make it perfect"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I thought the Italian seasoning was overwhelming. I'd only use 1 T the next time I make these. My kids loved them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amelia"
},
"reviewBody": "I actually used Pillsberry crescents instead of white bread! It worked great! It only cooked for about 20 minutes! You should cook it until the tops are a deeper brown, that way the bottoms get done perfectly! We actually paired this with a homeade fettucini! Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "delicious! I did an egg wash on top and sprinkled with kosher salt and a little shredded parm. Ours were perfectly done after 26 minutes. For dipping, I made a sauce by pureeing 1 small sized can of plum tomatoes with a clove of garlic and some italian seasoning, then simmered while the calzones cooked. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "joy-of-jesus-smileymom"
},
"reviewBody": "I used homemade pizza dough (\"Pizza Dough II\"), and in this case, the less-browned ones were better than the well-browned ones. I think the freshness of people's Italian seasoning makes a difference-- I opened a fresh bottle and 1 and 1/2 tbsp. of seasoning was plenty to me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dana Pierro"
},
"reviewBody": "Unbelievably Good! I actually made a huge mistake, which thank goodness turned out great. I read the ingredients in the morning and decided to make this for dinner. I didn't see the word \"dough\" — duh! I thought it said \"bread\"! So, when it came time to make dinner, I forged ahead with my slices of whole wheat \"bread\". I rolled each piece out as thin as I could get it. I brushed the edges with an egg wash (added salt &amp; pepper) and filled as per the directions. I placed them on my cookie sheet and brushed each calzone with more egg wash. It turned out great!!! I will definitely make this again, but I will have to decide if I should make the same mistake twice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cinde Shepard"
},
"reviewBody": "my mother loved this recepie and so did my son, he does not like spinch"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion"
},
"reviewBody": "I have made these at least 30 times with a few additions to the filling. I add 10 button mushrooms and cook then dice 3 chicken breasts. I place all the ingredients into my food processor and pulse it for about a minute. It ends up being a double batch, but I make 2 batches of pizza dough from my bread machine and after baking it all, I toss the leftovers into the freezer for another meal. I control how big I want them to be. I once served them as an appetizer, making them really small (although somewhat tedious) but everyone raved. My hubby likes these served with pizza sauce, my kids prefer ranch dressing. REALLY YUMMY!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefK"
},
"reviewBody": "My huband and I loved this recipe, I made a nice italian red sauce for dipping, top notch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "STEPHANISAT"
},
"reviewBody": "My entire family, aged 18 months to 29+ loved this recipe. I used canned pizza dough and fresh spinach instead of frozen. This was easy and delicious. An earlier reviewer suggested brushing egg whites on top, and it did add a nice shiny glaze to the calzone. This one is a great master recipe for a calzone. I can't wait to make it again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "gina w"
},
"reviewBody": "This recipe was ok but it was nothing to rave about. Followed the recipe except for using pizza crust. Dipping them in spaghetti sauce made them better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Roxy Marcotte"
},
"reviewBody": "Definitely needs more bread, less filling, and more flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth"
},
"reviewBody": "Very yummy and easy! We used Pillsbury thin crust pizza dough (2 tubes) for the crust and had enough for 4 people to eat two meals."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "WalkingStomach"
},
"reviewBody": "Filling was delicious! Dough was very bland. Maybe next time I'll sprinkle salt and parmesan cheeese on top before baking it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dining Diva"
},
"reviewBody": "Fantastic - family loved it. I used whole wheat dough from the bakery at the supermarket (healthier). I substitued green peppers for spinach on my daughter's request. I would like to try to spinach next time. I served heated sauce on the side to dip cut up pieces in. Yum, yum :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MLC"
},
"reviewBody": "After reading other reviews, I made a few changes to this recipe and it turned out great (meaning my kids actually liked it) and it was pretty fast. First, I cut the recipe in half. Instead of buying different cheeses, I skipped the ricotta and just used a 2 cup package of shredded Italian cheeses. I also added some sauteed onions, garlic, and red pepper to the spinach mixture. I used way less of the Italian seasoning. Finally, I bought Pillsbury's thin crust pizza dough instead of bread dough. I realized that if I unrolled the dough and held it by the edges, it would stretch out on its own. Then I cut it into rectangles, filled half the rectangle, and folded over. My calzones weren't in the traditional form, but no one cared. I brushed the top with olive oil and added a bit of parmesan. Be careful with the baking time. My calzones only took about 15 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "siasia317"
},
"reviewBody": "This recipe is simply delicious. I did end up using pizza dough (the thick crust kind) thanks to the tips of other. Before serving I poured marinara sauce on top and it was so tasty. Next time I think that I will use less Italian seasoning because it was quite strong. The cooking time was only about 20 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "tracidarden"
},
"reviewBody": "spinach mixture was great. we even personalized a few for the kiddos (turkey pepperoni, sausage, feta - etc) - the issue is with the dough. very thick as it is a bread - so if you can't get it rolled thin enough - you end up wasting most of the finished product to get to the good stuff. would be best with home made dough - but all in all good concept - not an easy throw together weekday dinner. this one takes some prep and good amount of clean up (dough, flour, etc)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Annie C"
},
"reviewBody": "These were wonderful and very quick to mix up. I used pizza dough as some suggested. I've always added a pinch of nutmeg to ricotta mixtures, so did so in this case as well. Lovely. Will try some of the variations suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa Sarver Newman"
},
"reviewBody": "We tried this the other night. I used the breadmaker to make whole wheat pizza dough for the bread part. They were great! I was estimating the spinach and the ricotta because the containers I bought were larger than the recipe called for. It seemed it could've used a bit more spinach. Other than that it was great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Aimee"
},
"reviewBody": "Yummy.... used prego parmesean romano sauce to dip!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarnok"
},
"reviewBody": "I made my own pizza dough, but other than that, followed the recipe. My family LOVED them, and the kids even ate the spinach!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "christian1"
},
"reviewBody": "I gave it 2 stars because they were vey nice looking, but the taste was very bad. The cheeses were too bland and the overpowering flavor was the italian seasoning - way overpowering flavor. I used the freezer bread dough like the recipe called for and you really have to seal the edges good or they'll pop open while cooking. I would recommend doing an egg white wash on the tops before baking. The filling just wasn't good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Kirthana"
},
"reviewBody": "I make something pretty similar to this, but have a few additions that really make it pop. 1) Decrease the Italian seasoning or skip it completely. Instead, brush some pesto onto the inside of the dough before you roll it up (store bought Progresso works- cheap and easy). 2) Instead of frozen bread dough, you can buy fresh pizza dough in the cheese or deli section of most grocery stores. Tastes amazing. 3) Ricotta is optional. Just the spinach and mozzarella combo with the spinach works great as long as you serve it warm."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Foothillsnerd"
},
"reviewBody": "Makes too much filling. Egg once mixed with cheeses does not store well in a fridge for any length of time so if using the egg, mix it as a 2nd mixing stage once you know how much filling you're actually going to use.\n\nStock recipe sorta bland, this is one to really get creative on, but is a solid base point for making something that when cooked should look awfully similar to a calzone.\n\nIdeas: Dill? Salt? Gouda? Colby-Jack? Meats? buttered garlic? Add just about anything you wanna add into the mix to add an edge to it (The cheeses are mild aka bland) would be my recommendation for other people cooking it."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/93357/unbelievable-spinach-calzones/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
"name": "Italian"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/93357/unbelievable-spinach-calzones/",
"name": "Unbelievable Spinach Calzones"
}
}
]
}
}
, "about": [
]
}
]