				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vaselopita - Greek New Years Cake"
,"datePublished": "2000-01-04T16:18:13.000-05:00"
,"dateModified": "2022-07-14T17:25:19.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Paul Menikos"
,"url": "https://www.allrecipes.com/cook/24327347"
}
]
,"description": "Traditional Greek New Years Day bread. Served as a coffee cake for breakfast. Also the person who receives the quarter inside gets good luck for 1 year!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Qrxsywke9U-q79q50F0l_hVDvvQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6205979-a33320ecd86d451ab2e61ad1574ac771.jpg",
"height": 1500,
"width": 1500
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vaselopita - Greek New Years Cake"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "74"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "447 kcal"
,"carbohydrateContent": "61 g"
,"cholesterolContent": "135 mg"
,"fiberContent": "1 g"
,"proteinContent": "8 g"
,"saturatedFatContent": "11 g"
,"sodiumContent": "287 mg"
,"sugarContent": "37 g"
,"fatContent": "20 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT30M"
,"recipeIngredient": [
"1 cup butter",
"2 cups white sugar",
"3 cups all-purpose flour",
"6 eggs",
"2 teaspoons baking powder",
"1 cup warm milk (110 degrees F/45 degrees C)",
"0.5 teaspoon baking soda",
"1 tablespoon fresh lemon juice",
"0.25 cup blanched slivered almonds",
"2 tablespoons white sugar" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat oven to 350 degrees F (175 degrees C). Generously grease a 10 inch round cake pan."
} ,{
"@type": "HowToStep"
,"text": "In a medium bowl, cream the butter and sugar together until light. Stir in the flour and mix until the mixture is mealy. Add the eggs one at a time, mixing well after each addition. Combine the baking powder and milk, add to the egg mixture, mix well. Then combine the lemon juice and baking soda, stir into the batter. Pour into the prepared cake pan."
} ,{
"@type": "HowToStep"
,"text": "Bake for 20 minutes in the preheated oven. Remove and sprinkle the nuts and sugar over the cake, then return it to the oven for 20 to 30 additional minutes, until cake springs back to the touch. Gently cut a small hole in the cake and place a quarter in the hole. Try to cover the hole with sugar. Cool cake on a rack for 10 minutes before inverting onto a plate."
} ,{
"@type": "HowToStep"
,"text": "Serve cake warm. Each person in the family gets a slice starting with the youngest. The person who gets the quarter in their piece, gets good luck for the whole year!"
} ]
,"recipeYield": ["12"]
,"totalTime": "PT90M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added the zest of 2 lemons and 1 tsp of lemon extract. It was a hit at my New Year brunch!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely perfect! Super fluffy &amp; delish!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Velvetangel"
},
"reviewBody": "It was delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "jpdawson"
},
"reviewBody": "This is so annoying! I spent all this time and effort to end up with a soggy mess. I wanted a nice cake for my family for New Year's day, so I followed the directions to a tee and now it is a soggy buttery mess! All those ingredients wasted! And nothing to show for it. DON'T BOTHER WITH THIS MESS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Laurie Anna Swanson"
},
"reviewBody": "I had to host a New Years party at my sisters house. I had to come up with idea for the icing . Used carnal Apple topping on the cake. They boys were allergic to nuts. So I thought outside the bag. I took some Oreo cookies and grounded them up in the food blender. When they were done. I used them as a topping for this cake. They wanted a toy baby didn’t have one. So I used a Macintosh cherry and baked i it into the cake. It was extremely yummy and a big hit at the party. Whoever found the cherry won the cool prize."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Alvey Connelly"
},
"reviewBody": "It was really good! I made it in a Bundt pan. I did need to bake it longer, about 15 minutes. But I didn’t think it was dry, and it was plenty sweet."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "betty"
},
"reviewBody": "Delicious! A new tradition is born for my family! (I hid a whole almond instead of a coin)\nThank you for this lovely recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "nanabunch"
},
"reviewBody": "I made this in a large round stoneware baker which was a perfect size, but I needed to give it some extra baking time, which made it a tad dry. It makes quite a large cake, great for breakfast with jam and coffee. I agree with another reviewer that it was moister the second and third days. I would make it ahead."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kerri1503"
},
"reviewBody": "I made this to bring in the new year! I did make a substitute as I didn’t have lemon juice. I added 1 teaspoon of almond extract and topped with powdered sugar. Does need to be naked longer as suggested by others. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Debra Manitzas Trueman"
},
"reviewBody": "Eating a second piece of this cake as I type and WOW is it delicious! My Yaya used to make the New Year's cake for us, so I decided to give it a go. I remembered the cake as being kind of dry and tasteless, so I didn't expect much from this cake, but how wrong I was. This cake is like a pound cake - moist and soooo good. The only change I made was to exchange finely chopped pecans for the almonds because I didn't have almonds. This is a FABULOUS recipe - a keeper that will go into my little book of recipes that I love. Happy New Year 2019!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ferg"
},
"reviewBody": "This recipe is absolutely delicious! I made it as written except added a powdered sugar glaze for the sweet tooth in the family. I will make this a yearly tradition. Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dina Ni"
},
"reviewBody": "Moist dense and delicious. Added orange zest and vanilla. No nuts. Cooking time as directed. It's a keeper. Can't have only 1 slice. Thank you!I tried to add a photho but can't."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Lyons"
},
"reviewBody": "Its perfect! The only thing I did differently was that I switched the lemon juice with limoncello liqueur. And made a glaze with powdered sugar and the liqueur."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennifer Bellows"
},
"reviewBody": "Very nice! I was trying to make a traditional Spanish \"bizcocho\" and this recipe reminded me of my mother-in-laws. I like that it's light and not super sweet. Next time I will definitely try it with the slivered almonds. Perfect to enjoy with coffee and family! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Geri"
},
"reviewBody": "Made it for party at work. Everybody loved it. I did not sprinkle with sugar instead I used powder sugar over a snowflake paper cutout after it had cool down. Beutyful!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Emily Walker"
},
"reviewBody": "This was an impressively easy and delicious cake. I liked that it wasn’t u we sweet and that it baked up so nicely. I followed directions almost to the letter, using cashew milk instead of regular and crushing cinnamon toasted almonds instead of blanched and sliced. I also didn’t have a sanitized quarter and was worried about kids not paying attention so I used a few raisins instead. It was great! The whole family enjoyed this cake and only the sweetest of sweet tooth’s didn’t eat it all. I had to extend the baking time by 20minutes but should have done 15 as the edges were a bit drier than the rest. Delicious though and something I’ll continue making..very tasty and fun for the new year :)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "MCMARY"
},
"reviewBody": "I made this today for a \"good luck\" new years brunch. It was a hit- extremely moist and delicious! I baked it in a 9\" spring form pan- it needed some extra baking time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bestdayblogger "
},
"reviewBody": "Happy 2018!!! This was the best recipe! Everyone loved it!!!! xronia pola!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "I love this cake and it’s fun to make! I’ve made it three times and it turned out great every time. I did add 1/2 teaspoon almond extract even though I like it without also, used a springform pan as it rises that high, I put it on a cookie sheet as it did leak just a tad, baked it 65minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "mitsimac"
},
"reviewBody": "It didn't turn out like the picture...it's more yellow because it contains 6 eggs. There was WAY too much batter for one pan and it ended up spilling over into my oven. lol All in all though, nice tasting coffee cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Vickyb"
},
"reviewBody": "This was amazing! My Greek father said it was one of the best he'd ever eaten! I wrapped the coin in foil and it made for a fun game. I needed to cook it for a total of 60 minutes."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathleen"
},
"reviewBody": "I made this today for New Years dinner. Followed the recipe precisely (except I substituted a whole almond for the quarter). The cake was fabulous! A wonderful desert for the Greek Lamb Casserole with peppered feta!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CarriAnne Curtis"
},
"reviewBody": "Great recipe! I baked it in a cast iron skillet and topped it with about 1/2 cup sliced almonds and 3 tablespoons of sugar. So tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol"
},
"reviewBody": "I have been using this recipe for years! Excellent Vaselopita - moist and simple - my Greek husband loves it! I bake the coin right in - place it on the large flat pan and then pour in the batter."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Britshain"
},
"reviewBody": "I'm really glad I decided to make this before we had company. There are two chemical reaction mixtures that get added to the batter. My reactions got a little crazy and everything expanded in the oven, over filled the pan and caused a huge mess BUT the cake tastes very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweettooth"
},
"reviewBody": "Great recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karen Christopher Whittington"
},
"reviewBody": "A very yummy and fun addition to our New Years day. I made it without the almonds and it was still tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "alaskabaker"
},
"reviewBody": "I made this for New Year's Day and everyone loved it, both kids and adults. I put the almonds on half of the cake since some of the kids won't eat nuts. It baked through in 55 total minutes in a 10\" springform pan. I had slivered almonds and not sliced but otherwise I made no substitutions. I'd definitely make this again and I'd like to try adding fruit of some kind, maybe mixed berries over the finished cake. The ingredient assembly process was fun, I thought, and different from any other cake recipes I've made."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carrie Ann Cushman"
},
"reviewBody": "So good &amp; fun to make...I like the little baking soda/powder to milk/lemon juice reactions lol....this is definitely a tradition in my house &amp; this recipe is AHHHMAZZZING!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Moonkitty2"
},
"reviewBody": "My husband is from Greece and loved this cake. He asked me to make it again this year. I wish I could find the picture from last years cake it was very pretty. I just sprinkled sugar and pomegranate seeds on top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "RDB"
},
"reviewBody": "I made this for an after dinner desert after a fondue party.\nMost invitees thought it was good.\nIt is a very plain somewhat dense cake\nOne of my kids told me it was a \"hit\"!\nDo not use Pam to line the cake pan as the cake will stick, use regular butter or margarine."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Filipino_Chaz"
},
"reviewBody": "Great recipe, I modified it a bit by adding a teaspoon of almond extract to the batter,adding half a cup of evaporated milk and half a cup of heavy whipping cream instead of the cup of milk, and I made icing instead of using powdered sugar. I made the icing my using a can of sweetened milk, a quarter cup of heavy whipping cream, and a half cup of evaporated milk, then I added a teaspoon of almond extract. I boiled and stirred the ingredients until it became thick enough to glaze the cake, and I applied it as I would have applied the sugar then topped the cake with almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lynne"
},
"reviewBody": "A wonderful cake! I used a bunt pan and put a quarter wrapped in foil in the cake prior to the last 20 minutes of baking. Used bottled lemon juice instead of squeezing a lemon. Cooking time as listed worked well. The sugar and slivered almonds ended up on the bottom of the cake when removed from the bundt pan and looked great on the cake plate. I added a cake glaze with almond flavoring over the top and sprinkled it with sliced almonds. Everyone loved the cake and ate every last piece to find the good luck coin! Great fun for a group!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "synefaki"
},
"reviewBody": "Delicious!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "val"
},
"reviewBody": "I made this yesterday. Loved the texture and as others have said, not too sweet. I may have liked a bit of vanilla in it. I put a dime in the cake. My Mom used to put a dime in the cake for our birthday cakes when we were younger. And once in a while it was two nickle. SMiLE. I always thought it was a German thing, but maybe there was a Greek influence."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Maria Dusenbery"
},
"reviewBody": "a little dry, I added some almond paste to it, helped a bit, this recipe actually makes 2 round cake pans if you care to split it up, a little marzipan would help even more with added flavor"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sophie"
},
"reviewBody": "Delicious!!! Very easy and very tastey!!!!! I've made it twice....."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jcaird1"
},
"reviewBody": "I ended up making it in bundt cake version because my cake pan was too small, but it came out wonderfully! My kids love it, and I think we are starting a new New Year's Day tradition. I used a whole raw almond for the good luck charm, which has yet to be recovered, but my kids love trying to get it with each piece. An excellent, easy recipe I'm so grateful someone thought to share. Thank you, Paul!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci"
},
"reviewBody": "Sooooo good and so easy to make! All of the ingredients are ones that I typically have which makes it even more appealing to me. I did not have almonds so I chose to add a little almond extraxt to the cake and oh my word it is so yummy! The cake is somewhere between a pound cake and angel food cake. I know that sounds crazy but its true. It is dense but yet its still quite fluffy. Will definitely be making this again! Thank you so much for sharing this recipe :-)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Sue Lassman"
},
"reviewBody": "I made this the other night. Here is what I found. I had a 9 inch pan so I ended up making a 9 inch round cake and a loaf pan cake because I had way too much batter for just one cake. One I made pretty much as the recipe calls. Only difference I made, was that I had some vanilla sugar and I used that on top with the almonds. Second cake I had some chocolate sugar and I put that on top. It sort of looked like poppy seeds. People liked the cakes. i made signs so people would know there was a quarter in side. My step daughter 'managed' to find both of them. think she dug through the second cake. Tastes like a pound cake. Nothing fantastic, but my step daughter was thrilled to pieces. Worth making especially if you have kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "katerina"
},
"reviewBody": "I have been making vaselopitas for the last 32 years and nothing beats Menikos recipe! This is the best vaselopita recipe since I was in Greece! If you follow the recipe exactly you will have wonderful traditional New Year's cake! Thanks for sharing this cherished recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "divacook"
},
"reviewBody": "This recipe was a disappointment. My mother always made Greek New Year's bread so I thought a cake might be a new tradition. The cake tasted exactly like a pound cake, it was quite dry too. If I tried it again, I would add less flour and \"kick it up a notch\" with some lemon zest, almond extract ..."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "EACline"
},
"reviewBody": "This came out very well. We shared with some friends and they loved it! It is a very plain coffee cake and that is really what makes it so good. I left off the almonds."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Mrs. Garten"
},
"reviewBody": "I followed this recipe exactly and the cake was completely raw (meaning LIQUID) inside when I took it out of the oven. I cooked it another 30 minutes and the cake was still soft and a bit runny in the middle even though the top was starting to turn a bit too brown. The flavor of the cake is very good, though. The temp and cooking times just need adjusting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Mia"
},
"reviewBody": "I've been using the same Vaselopita recipe for years, passed down from my yiayias yiayia but this year I had to make one fast instead of the old fashion way. Your recipe by far came out so much better! My kids loved it and my guest asked where did I get the recipe. Delicious. Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Ten Jay"
},
"reviewBody": "I made this tonight, to be served tomorrow when the in laws come over. I will update this after I've tasted it. I will say that I had to bake it an extra 30 minutes before the middle was cooked. I wrapped my quarter up in tin foil and tossed it into the cake after 20 minutes when I sprinkled the sugar and nuts on the top. Hopefully it hasn't sunk to the bottom!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYDRAKE"
},
"reviewBody": "I can't rate it from personal experience because I made this for my daughter to take to school. She didn't get a slice either because everyone else scarfed it down. That must mean it's pretty good! I made it in a bundt cake pan and just shoved a whole almond into the cake instead of a quarter as someone suggested."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bigfamilymama"
},
"reviewBody": "Apparently, this is the real thing. The greek inlaws (from Crete) absolutely raved about it. So esay to make and really delicious. I recommend it to anybody - especially if you have greek relatives you want to please. It sure worked here."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy"
},
"reviewBody": "Not to sweet cake. Good taste. Putting the quarter inside and explaining to everyone what it meant then waiting for someone to find it was so much fun! Thanks!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "savantmi"
},
"reviewBody": "It was fantastic, although I did add almond extract to the batter for a more almond-y flavor. It was a big hit at the New Years party! I did substitute a whole almond for the coin due to excessive drinking on New Years :) I originally put it in a springform pan but it started to leak in my oven! In a pinch I put it in a bundt pan, which turned out just fine. Excellent cake, not too sweet, needs no icing but would be good with an almond flavored glaze. Happy baking, and eating! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "grkcook"
},
"reviewBody": "This is a very nice Vasilopita recipe. Being Greek, I've tried quite a few, this one is a keeper. Everyone really enjoyed it! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Amber"
},
"reviewBody": "I made this for a new years party and although it was good I didnt get any rave reviews for it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Mayirissa"
},
"reviewBody": "Very good! I usually wash the coin then seal it in foil and just stir it in the batter before I bake it. Next time I'll add orange juice and zest instead of the lemon."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "My brother and I made tihs together on New Years Day and it turned out very well! The cake is dense and moist, and delicious. Next time we agreed to try with some almond extract in the batter, or maybe orange zest to change it up a bit. In our oven, it needed to bake for a longer period of time, though, so keep checking it for doneness. Hronia Polla!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mimi"
},
"reviewBody": "This was very good. Being part Greek, it was fun to try it. Be sure to watch your pan size, thought my 9\" round pan was a 10\", and it ran over in the oven, otherwise it was good. I will do it again next year, using a different size pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaile's Momma"
},
"reviewBody": "I thought I would make this as a surprise for my husband, whose father is Greek. My husband hadn't heard of the tradition before but enjoyed the cake any way. I topped it with a powdered sugar glaze, which gave it a little more moisture around the edges. It is a very dense cake but we loved trying to figure out which slice had the quarter. It was a fun way to ring in the 2009 with a new family tradition for us!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TrekBebe"
},
"reviewBody": "Made this cake for New Year's gifts for neighbors and it was fantastic! I used two 6\" round pans and it looked just beautiful. Bake time was still about the same, although I did the sugar/almonds at about 18 minutes instead of 20 so they would stick better. Thought sliced almonds looked prettier than slivered as the recipe listed. Enjoy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MissysMom"
},
"reviewBody": "Made this potential family annual tradition in a springform pan which eliminated the tricky inversion process.\nAlso substituted a whole almond for the lucky quarter (which would have required pre-santitizing)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "okiekid"
},
"reviewBody": "This is definitely an old world recipe. The cake is a coarse texture and is not sweet like you expect a cake to be."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allie Jonas"
},
"reviewBody": "My teacher is Greek and brought this in to celebrate the new year. My friend got the quarter, but I still ate the cake! It was really good and apparently kid friendly. I might have to make this for my family!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rebecca Matichuk Huebner"
},
"reviewBody": "Not bad, a little dry. This is a heavy cake."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sofia-pola"
},
"reviewBody": "Fantastic recipe!I am greek,living in Athens,was looking for a new vassilopita recipe and tried this one...my husband said it is the best he ever had,my children loved it,it was consumed on the spot,even after a rich new year's dinner! I topped it with our favorite creem cheese frosting,and wrote on top of it 2007 as is the tradition,using mini m+m's.Should have taken a picture!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "RUBY2"
},
"reviewBody": "I served this for our New Year's brunch. It looked pretty and we all really enjoyed it. My 10 inch pans were on loan so I baked it in a tube pan for a total of 50 minutes. If you are expecting a sweet, fluffy dessert cake don't make this however if you appreciate a firm not-too-sweet European cake this recipe is for you. My Greek husband says you need to cut a piece for Saint Basil!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "An Excellent rich dense cake. This is great for a hostess gift. I topped mine with sugared pecans, and baked in a springform pan to enhance presentation. Also, I extended the baking time by 15 minutes. Got great reviews from all who tried it. Definitley a keeper."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This receipe was good. Infact it tastes better the second day. I had no problem with the baking time that the receipe called for. I didn't put the quarter in. Also, after I inverted the cake on the cake rack, I inverted again to a cake plate so the nut sugar mixture was showing on top. What a nice presentation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This recipe was really delicious. The only change I would make would be to bake it longer. When I followed the baking time in the recipe the center came out raw."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/15723/vaselopita-greek-new-years-cake/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
"name": "European"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
"name": "Greek"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/15723/vaselopita-greek-new-years-cake/",
"name": "Vaselopita - Greek New Years Cake"
}
}
]
}
}
, "about": [
]
}
]