				
[
{
"@context": "http://schema.org",
"@type": ["Recipe"]
,"headline": "Vegan Pumpkin Pie Blondies"
,"datePublished": "2020-06-18T23:57:01.000-04:00"
,"dateModified": "2022-07-15T12:00:13.000-04:00"
,"author": [
{"@type": "Person"
,"name": "Kelly S"
,"url": "https://www.allrecipes.com/cook/6970688"
}
]
,"description": "For an easy vegan pumpkin dessert, try these pumpkin pie blondies! Full of spices reminiscent of pumpkin pie, these vegan blondies always get rave reviews."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/rqxOBMiV6_e9eo5GW33as9E3v2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1065776-df7f9558071c42baa387517d70b86d3e.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegan Pumpkin Pie Blondies"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.5",
"ratingCount": "54"
}
,"cookTime": "PT20M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "61 kcal"
,"carbohydrateContent": "11 g"
,"fiberContent": "1 g"
,"proteinContent": "1 g"
,"saturatedFatContent": "0 g"
,"sodiumContent": "94 mg"
,"sugarContent": "5 g"
,"fatContent": "2 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"2 cups all-purpose flour",
"0.5 cup white sugar",
"0.25 cup brown sugar",
"1 teaspoon baking powder",
"1 teaspoon baking soda",
"0.5 teaspoon ground cinnamon",
"0.25 teaspoon ground cloves",
"0.25 teaspoon ground ginger",
"0.25 teaspoon ground nutmeg",
"0.25 teaspoon salt",
"1 (15 ounce) can pumpkin puree",
"3.5 tablespoons canola oil",
"1 tablespoon vanilla extract" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease a 9-inch square baking pan."
} ,{
"@type": "HowToStep"
,"text": "Sift flour, white sugar, brown sugar, baking powder, baking soda, cinnamon, cloves, ginger, nutmeg, and salt together in a bowl. Add pumpkin puree, canola oil, and vanilla extract to the flour mixture and stir until a thick batter forms. Pour batter into the prepared baking pan."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Remove from the oven and cool completely before cutting into 1 1/2-inch squares."
} ]
,"recipeYield": ["36"]
,"totalTime": "PT30M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ARBethany"
},
"reviewBody": "It was challenging to mix the pumpkin in, so I had a couple ingredient lumps left after baking. It's very thick and more dough than batter at the end, and I almost added the water as the tip about muffins mentions, even though I was using a baking pan. The taste is lighter on pumpkin, so even the usual pumpkin hater of my family enjoyed these. I was making \"Best Brownies\" at the same time and ended up baking this recipe at 350degF as a result, so they took a couple minutes more - about 23 minutes total."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Absolutely gorgeous, moist, warming,sweet and fluffy... the best vegan baking I've ever made. The spices all combined to create something amazing. I used 2/3 cup brown sugar and 1/4 cup maple syrup, no vanilla(did you know a lot of vanilla extracts are made wuth BEAVER ANAL GLANDS?!),cinnamon sugar on top and allspice instead of cloves. They were a bit undercooked so bake for a bit longer than 20 I'd say"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "montana"
},
"reviewBody": "I like eating a little treat for breakfast and these are wonderful. A bit bready as others said, but I feel that these are also a little closer to the healthy side. I did omit the brown sugar just to make them a little healthier for breakfast. I dont eat a lot of sweets, so the bread still tasted sweet enough to me with just the white sugar. Then I sprinkled some walnuts and chocolate chips on top for some exciting texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "mommydog"
},
"reviewBody": "Used homemade pumpkin butter"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dr Jerry"
},
"reviewBody": "Great recipe, and versatile too. I used fresh baked pumpkin flesh instead of canned, whole wheat flour, and sugar substitute — and the brownies were STILL great! Moist, just the right amount of sweet, and very satisfying. These will be in our regular dessert rotation."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ace08"
},
"reviewBody": "Great recipe! I added 2 tablespoons applesauce, added pecans in half, chocolate chips in the other half. Didnt have cinnamon, clover, and nutmeg so I substituted with pumpkin spice. Nice, moist, great flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "DRM1"
},
"reviewBody": "I am not vegan, but I was making these for a friend. I was a little leery about how they would turn out. I was pleasantly surprised at the great taste and texture. The pumpkin and spice levels were good...not too overpowering, yet strong enough to really enjoy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tricia"
},
"reviewBody": "These turned out moist and melt-in-your-mouth good! I used 2 cups of fresh pumpkin that I roasted and pureed, which is probably slightly more than you'd get in a 15-ounce can. I also subbed coconut sugar for the brown sugar, doubled the spices (except for the cloves), used whole wheat pastry flour, and added a tablespoon of ground flax seed to account for the extra amount of pumpkin puree. Vegans and non-vegans in my family loved them! Next time (and there will definitely be a next time) I'll add some chopped vegan white chocolate, dried cranberries, and walnuts...or maybe pumpkin seeds...or both! I'll also experiment with other sweeteners such as maple syrup. This is a great basic recipe that I'm sure will have lots of variations. And it's easy to make! This one's a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Cindy"
},
"reviewBody": "I made mine into cupcakes and put vegan cinnamon, butter cream frosting on them. This recipe is going in my most favorite file! Absolutely wonderful, moist, easy!!!! My family is crazy about them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lucy Zhang"
},
"reviewBody": "I halved the recipe to use up my pumpkin puree (I used 1 cup) and added the additional 1/4 of water to make muffins! I only used 1 tsp and 1/2 tsp nutmeg for a less of a \"fall\" flavor and topped them with oats, walnuts and some leftover granola for a crispy topping and it was so good, especially the second day, microwaved."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "keerthana"
},
"reviewBody": "I wanted moist cake brownie like consistency for these pumpkin bars and they turned out beautifully (not remotely dry).\n\nI had ~26 oz (796 mL) can of pumpkin and appropriately increased the ratio of all the ingredients, with an extra increase in spices and oil (substitute). I used vegan butter instead of oil, and used 1.5x the amount called for. I also 1.5x the amount of spices and doubled the amount of salt, and cooked for an extra 5 minutes at 400 degrees for the bigger pan. They mad for a tall cake brownie-like pumpkin bar, but incredibly delicious and a crowd-pleaser."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "fairymaker"
},
"reviewBody": "Absolutely delicious without being too sweet. Perfect fall dessert."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "la_rosebud"
},
"reviewBody": "Just made this today, it was a hit, did not add all the white sugar though, scaled back a little bit. It was still sweet and moist, I would call this a cake though due to the sponge like texture. I made my own whipped cream frosting and added some crushed walnuts. I will definitely make this again. It did take about 30 minutes, not 20 as stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Just made this today, it was a hit, did not add all the white sugar though, scaled back a little bit. It was still sweet and moist, I would call this a cake though due to the sponge like texture. I made my own whipped cream frosting and added some crushed walnuts. I will definitely make this again. It did take about 30 minutes, not 20 as stated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sybil"
},
"reviewBody": "Very moised I loved it but my husband expected it to taste more like my pumpkin pie. Our guests preferred my other cakes. I will say though that this is wonderful warm with the ice cream if you're not a fan of the normal super sweet blondies but if you are which I'm not but hubby is just make minor adjustments for sweetness. I will try this again using the spices measurements I use for my pumpkin pies and increase the brown sugar by a 1/4 cup and see if he likes that better. Like I said though if I was judging for me alone this would have another star. My Korean friend loved it but the young American military men weren't fans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mkbnutmeg"
},
"reviewBody": "perfect for everyone in the family vegan or not, delicious no need for frosting. I used self rising flour and a bit more oil and a banana, fluffy cake-like"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jenn Lewis"
},
"reviewBody": "Excellent! I followed the recipe exactly and it was such a hit with my family. Did it a second time and mixed up some rolled oats with turbinado sugar, melted vegan butter (Earth Balance), and some cinnamon and sprinkled it on top before baking. Everyone really loved that! I served it to my daycare children and not a crumb left! This is more like a dessert bread in texture rather than a brownie, but absolutely delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Hannah Marie"
},
"reviewBody": "I'll definitely be making these again! I used cinnamon and pumpkin spice instead of all of the separate spices, and as others have said, these blondies needed to bake for about 30 minutes. Everybody in the house loves these, and they're super easy to whip up."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Lisa Hansen"
},
"reviewBody": "Not sweet enough. Weird texture."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Martha Jane"
},
"reviewBody": "Excellent! Our vegan guest loved this, as did everyone else! wonderful dessert. We made it with fresh pumpkin, rather than the canned pumpkin. Will definitely make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Selam Gmichael"
},
"reviewBody": "I used coconut oil instead of canola. It came out moist, rich, and still bread-like. We all loved it. I did use Trader Joe’s pumpkin spice seasoning instead of the spice blend in the recipe and it tasted really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Kym"
},
"reviewBody": "Did not change recipe at all, except, it did take 10 minutes longer to bake. Next time will use pumpkin pie spice add a little more. They are moist, batter was more dough like than batter, but that is not a problem. Might add raisins or chocolate chips when baking for kids."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bmcc"
},
"reviewBody": "Used half all purpose flour and half buckwheat flour. Substituted coconut oil which gave a nice flavor.\nTopped with powdered sugar and pecans.\nExcellent!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lisa De La Cruz"
},
"reviewBody": "These are delightful! I have made these blondies multiple times. I initially wanted a tasty vegan dessert to accommodate my son's vegan lifestyle. He loves them! but so does everyone else. I have altered the recipe by using coconut oil instead of oil and have added bananas to the pumpkin. They are so moist and satisfying. I use a muffin pan to bake them. My husband and I are changing our lifestyle by becoming Weight Watcher members and these muffins are only 2 SmartPoints each!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Luz"
},
"reviewBody": "I didn't have any ground ginger, and I used olive oil instead of canola oil, but it came out great! It definitely comes out more like a thick cake, and the batter was extremely thick. I made this for my vegan friends and they loved it! My parents, who are both diabetic, loved that it wasn't too sweet so they could enjoy a little too."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "just_jam"
},
"reviewBody": "they're not exactly brownie (blondie) consistency.. more like a dense cake as others said.. but i am enjoying the flavor.. i ended up doubling all the spices and left out the cloves.. the blondies were on the less sweet side which i do like, but if i were making these to give away i'd up the sugar or add a frosting.. something with maple comes to mind.. ty for the recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah"
},
"reviewBody": "I used gluten free flour and a 8x8 pan. I had to cook it about 10 minutes longer but it was like a moist, dense cake. I topped mine with cream cheese frosting and it was addictively delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maureen"
},
"reviewBody": "I've made this so many times I don't have to read the recipe. lol I love this recipe over and over! Want to mix it up a bit? Try 3 ripen bananas instead of pumpkin puree, add a tablespoon of rum extract along with the vanilla extract, and omit the ginger. You've got vegan banana blondies! When I make the vegan pumpkin blondies, I add crushed pumpkin seeds on the top. When I make the banana, I add crushed walnuts on the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sara"
},
"reviewBody": "Amazing!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Bunny Lady"
},
"reviewBody": "I could taste the baking soda. I would cut that down next time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amye"
},
"reviewBody": "I made this great recipe tonight and my husband loved it! I used melted coconut oil in place of the canola and I used 2 cups of GLUTEN FREE FLOUR (Grandpa's Kitchen Blend, which contains xanthan gum). It turned out very nice and cake like. I also drizzled powdered sugar icing over the whole thing which added a nice flavor. Thanks for sharing this wonderful recipe and I will totally be making this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "VeganSheri"
},
"reviewBody": "30 minutes to bake this recipe. More like a quick bread than a brownie consistency; however it is very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Brandi Bryan"
},
"reviewBody": "I added some extra nutmeg and cinnamon because i wanted a rich Fall like flavor . I also finished them off with a cinnamon bourbon cream cheese icing.Just used store bought cream cheese icing and added one shot of cinnamon flavored bourbon and 1/2 tsp of cinnamon then mixed with hand mix mixer...AMAZING!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Floppylo"
},
"reviewBody": "My family loves this blondie. We are half Asian and love desserts that aren't too sweet. This is perfect. My hubby who loves the American sweetness (very sweet) learned to like this dessert and loves it now."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "jamie312"
},
"reviewBody": "After about 40 minutes and it was still a bit undercooked in the middle. It was very moist, but did not have much flavor to it. I even added extra spices after reading other reviews before making this."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "dani"
},
"reviewBody": "I made these a few days ago. I omitted the cloves but followed the rest of the recipe. The flavor was good but the texture wasn't nice. They were kind of spongy. I was disappointed."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MJR262"
},
"reviewBody": "I used a blend of coconut and oat flour for a GF option, added 1/3 cup of dried coconut, a pinch of cayenne for a bite, used pumpkin pie spice like others and topped with maple syrup. Very moist, cakey and for a GF vegan desert was great tasting."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sue Heneghan"
},
"reviewBody": "Versatile recipe that can be changed to your liking. It's very moist, like a cake or tea bread. Instead of the 2 c. of white flour, I used 1 3/4 c. of white,and 1/4 c. buckwheat flour. I may increase the buckwheat flour next time. Also, instead of 1/2 c. of white sugar, I used 1/4 c. of white sugar and 1/4 c. coconut sugar. I substituted olive oil for the canola. Next time I would definitely add some raisins or dried cranberries to the batter - perhaps even some chopped nuts."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lsdaisy"
},
"reviewBody": "Mine came out exactly like the picture. I love the fact that they're vegan. I used pumpkin pie spice instead of the separate ingredients. I also used Domino Light and brown sugar Splenda as well as natural applesauce instead of the oil to lighten it even more. I did throw in some cocoa powder plus Splenda into about 1/3 of the batter, dotted the top, and then swirled it into the batter with a knife before baking to give it some flair and chocolate taste. It is more cake-like but delicious all the same!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "HHBakes"
},
"reviewBody": "I made this and added 1 cup of fresh cranberries then topped it with a glaze of confectioners sugar, vanilla &amp; soy milk. It was really good."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "cookingwithcoco"
},
"reviewBody": "I followed the recipe exactly except for I used pumpkin pie spice instead of the other spices. The turned out amazing! The reason I gave this recipe only 4 stars is because I ended up having to cook the blondies for about 35 min in order to avoid the gummy texture that I got when I made these for the first time."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "cupcake204"
},
"reviewBody": "not moist enough"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amber Heizer"
},
"reviewBody": "i am going to try making them tonight and to make them more chewy i am going to add more oil and see if that works"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "raemwing"
},
"reviewBody": "I only use the cinnamon &amp; ginger, then forgot to add the oil, but these still came out delicious! I was so happy I didn't need to frost them!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "shanasunset"
},
"reviewBody": "Delicious, however it lacks the chewy consistency to be considered a brownie and is definitely more like a muffin. As suggested by MaddieB I increased spices by adding two teaspoons of pumpkin pie spice. I also added two tablespoons of molasses, a tablespoon of spiced rum, substituted zero calorie sweetener for the white sugar, and oat flour for one cup of the all purpose."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "MaddieB"
},
"reviewBody": "I tried this recipe, as is but thought next time I would put in more spices. Very moist, my grandson loved it. This was a good recipe for those who have peanut, dairy and egg allergies like he does."
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/235259/vegan-pumpkin-pie-blondies/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
"name": "Brownie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/2754/desserts/cookies/brownies/blondies/",
"name": "Blondie Recipes"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/235259/vegan-pumpkin-pie-blondies/",
"name": "Vegan Pumpkin Pie Blondies"
}
}
]
}
}
, "about": [
]
}
]