				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vegetarian Tater Tot Casserole"
,"datePublished": "2000-04-16T15:15:11.000-04:00"
,"dateModified": "2023-02-20T12:18:56.000-05:00"
,"author": [
{"@type": "Person"
,"name": "Karin Peters"
,"url": "https://www.allrecipes.com/cook/58916"
}
]
,"description": "This is a recipe for tater tot casserole without meat that everyone will love — vegetarian or not. Simply bake tots, cheese, and mushroom soup."
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/W7LHWpJCiOtNhuSoGr1htf9XQus=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4473931-f4db030c7068446f9301c0a339a2029b.jpg",
"height": 960,
"width": 960
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegetarian Tater Tot Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.4",
"ratingCount": "409"
}
,"cookTime": "PT60M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "718 kcal"
,"carbohydrateContent": "56 g"
,"cholesterolContent": "53 mg"
,"fiberContent": "4 g"
,"proteinContent": "12 g"
,"saturatedFatContent": "21 g"
,"sodiumContent": "1330 mg"
,"sugarContent": "2 g"
,"fatContent": "53 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT10M"
,"recipeIngredient": [
"cooking spray",
"1 (32 ounce) package frozen potato rounds",
"1 (16 ounce) container sour cream",
"1 cup shredded Cheddar cheese",
"1 (10.5 ounce) can condensed cream of mushroom soup",
"1 (6 ounce) can French-fried onions" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish."
} ,{
"@type": "HowToStep"
,"text": "Arrange tater tots in the prepared baking dish."
} ,{
"@type": "HowToStep"
,"text": "Combine sour cream, cheese, and condensed soup in a mixing bowl. Pour this mixture over tater tots. Sprinkle onions over the top of the casserole."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 45 to 60 minutes."
} ]
,"recipeYield": ["6"]
,"totalTime": "PT70M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jesse Farmer"
},
"reviewBody": "Quick and easy, mixed it up threw it in the oven gave the kiddo a bath and when she was done so was the casserole. Next time I make it I’m going to add chicken and peas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "andiB"
},
"reviewBody": "It was so easy, quick. It needed something for flavor…"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "We loved it!! No changes needed🙂"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "listwithmaury"
},
"reviewBody": "This was delightful. I love casseroles that hold together, and this one fits the bill! It was super-easy to assemble and remarkably hearty to eat. I used \"crispy\" tots and substituted cream of chicken soup. I topped it all with Funyuns. This version is quite bland, but could be easily amended with a few stalks of chopped celery, chopped olives, or even a can of green chilies!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marion Granger-Edwards"
},
"reviewBody": "Loved the recipe! Thanks"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Staci Hillhouse"
},
"reviewBody": "Delicious"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kerry G Westenbarger"
},
"reviewBody": "Awesome! But instead of all sour cream I did half sour cream and half cream cheese with cream of chicken soup instead!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Natalie Morris"
},
"reviewBody": "I did everything just like the recipe stated - exactly - but It was awful. First off, the tots were cold inside. Second, the gloopy “sauce” stayed gloopy. It did not thin out to run in between the potatoes and just stayed on top like a hat. The onions on top charred. Taste was also rather one sided - sour cream. You couldn’t taste the mushroom soup at all, nor any of the cheese, as it was overshadowed by the sour cream. If I were to ever try this again, I would make a mushroom sauce from scratch with a Béchamel base and make sure it coated all the tots. The onions would go on top towards the end of the baking, along with some extra cheese to give it a bit more flavor. Not a fan of this, though."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Reena Henderson"
},
"reviewBody": "I really enjoyed this dish and consumed it for both dinner and breakfast. I added sautéed onions to the mushroom soup mixture and less sour cream as I am not that crazy about sour cream. I love spices so I added a pinch of crushed red pepper flakes, a little garlic and onion powder. The dish was amazing. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Gina Bowens"
},
"reviewBody": "Very tasty! My family loved it. I did not make any changes to this recipe. I was expecting the mixture to be thinner than it was since the directions instructs to \"pour\" the mixture over the tots. The mixture, as is, can not be poured, it needs to be spread. Nevertheless, it was delicious and very flavorful."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "MTDSFP"
},
"reviewBody": "Next time I’ll add crumbled bacon and some more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Julie Dudzik"
},
"reviewBody": "My family loved it! They thought it was better than traditional hash brown casserole. This recipe is so easy too. I just had to sub mushroom soup for chicken. My husband absolutely hates anything with mushrooms. Delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Readstoomuch Susan"
},
"reviewBody": "I thought it was pretty good but it’s definitely not weight watchers approved. LOL! I did add 3/4’s of a package of Ranch dressing mix and 3/4’s of a cup of chopped raw onion."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "Jill Ottesen Kehne"
},
"reviewBody": "Sorry, but we didn't like this at all. There was to much sour cream and the sauce sat on top of the tator tots. The tator tots were not crispy as we like them. I won't be making this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Poop Mouth Jones"
},
"reviewBody": "My husband and my two toddlers absolutely loved this casserole. I believe my husband even had three helpings.\n\nI added extra cheese on top before the fried onions because we love cheese. I also added in frozen broccoli for some veggies. This was so good with ketchup (in my house we love ketchup too). \n\nIt is extremely rich and heavy but so good. I would pair it with a salad or steamed veggies or even some grilled chicken.\n\nWhen I make it again, which I will, instead of just pouring the mixture on top, I will mix it into the tater tots because some of the bottom ones weren’t smothered."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stephanie Weber"
},
"reviewBody": "love this recipe! I went from never having it before to eating it 2x in the last month. we add a 1 lb cooked ground beef to throw in some protein since it's the main dish. and we aren't big sour cream people, so I substitute it for milk and it works great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lisa powell"
},
"reviewBody": "Added fried hamburger and onion, halfed the sour cream and added more cheese. AWESOME!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Suzzyq"
},
"reviewBody": "Loved it and so did others! Just added another cup of cheese, and half of the French onions with about 1/4 water to the mixture. Then sprinkled the remaining onion an ontop and a little more cheese. Super fast and easy! Great comfort food!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Genna"
},
"reviewBody": "Made it! However, I added chili with no beans and chopped up white onion to the mixture and added chopped up chives to the top. Another time I cooked this dish, I used broccoli and cheese tater tots (check out your local health food store) and cream of broccoli instead of mushroom."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jspice"
},
"reviewBody": "I made this exactly as directed in the recipe. While it is good, it does seem to need something extra. I think that this could be a 5 star recipe just by adding an ingredient of personal preference as many other reviewers have done. I’ll try adding beans and or cheese next time. I also will wait to sprinkle the onion on top until the last 15 minutes of cooking to prevent over browning. I will make this again with a few modifications. Thank you for sharing your recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Heather Jackson"
},
"reviewBody": "I only made one change... I substituted plain Greek yogurt for about half of the sour cream. Their consistency is so similar and the yogurt adds protein. It was fantastic! And so easy to put together! Next time I plan to bake at 400 instead of 350. I thought it cooled down very quickly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lydia"
},
"reviewBody": "I halfed the sour cream, and it turned out perfect!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Niels Unke"
},
"reviewBody": "This was stellar. The only reason it did not get 5 stars is that there was some modifications required. First off: Brown a pound of burger with some onions. I used a third of a red onion and that was enough. Double the cheese in the mix in the bowl. I used probably 2/3 of the recommended amount of sour cream. Use more or less. Either way will be fine.\n\nDrop the burger in the bowl and stir. Add 1/2 the french fried onions when done mixing the burger in the bowl. Spoon and spread the mix in the pan and cover the tots. Spread the remaining FF onions over the top. Sixty minutes plus 10 was required at 350. Make this. You will not regret it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Babs Zurcher"
},
"reviewBody": "Tasty, unfortunately I only had cream of tomato soup to use on hand but my 7 year old grandson and the rest of the family loved it. A definite have again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Rabithabit"
},
"reviewBody": "Changes I made were sauteing fresh mushrooms in a combination of olive oil and butter, adding about 2 TBS of flour to the mixture once the mushrooms were brown and adding milk until thick. As for the rest of the recipe I followed to the letter, The whole family loved it eve my picky eater."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Traci Wilson"
},
"reviewBody": "my family loved this twist on a old favorite. The only things I did different was I browned a pound of hamburger with a little chopped onion before mixing in the soup,sour cream and cheese. After putting the mixture on top of the tater tots, I sprinkled more cheese on top and then the French fried onions. I will definitely be making this recipe again. This recipe has replaced my old tater tot casserole recipe for sure ! loved it !"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mama t cook"
},
"reviewBody": "Very tasty. 10 stars out of 10 eaters age 3-37."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookinnbakin4fam"
},
"reviewBody": "We added boca burger to this dish. We also substituted plain Greek yogurt for sour cream. We did not have fried onions either but it tastes great with sautéed yellow cooking onions. Will make this again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Marie Cutaia"
},
"reviewBody": "It was delicious!! I substituted French Onion dip for the sour cream and used cream of chicken soup!!! Everyone loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Jim3611"
},
"reviewBody": "I liked this as a base and added more cheese than it suggested just because we like lots of cheese. I do think I would look to add some other things to it in the future, maybe mushrooms or peppers, maybe some additional spices. It was easy and we enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Robyn"
},
"reviewBody": "I will definitely make this again! I followed the original directions, except I added a pound of deer burger. I cooked it at 350 for 50 minutes and it turned out great. My husband had 2 bowls for dinner and he's kinda picky :-D"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Melissa Lawson"
},
"reviewBody": "This was great! I added an 8oz package of diced ham the 2nd time I made it, and loved it even more! Quick, easy, thumbs up!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Judith Bonnett"
},
"reviewBody": "super good the FF Onions really made it so good"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kristina Allen Grussing"
},
"reviewBody": "Absolutely delicious! Best meal I've ever had. The kids ate it right up and so did I."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LYNNESTWINS"
},
"reviewBody": "This is a keeper! Thank you for sharing this recipe. Made tonight. My teens loved it! The only change I made was adding an extra cup of cheese. Yes, we are cheese heads. l think this will be a wonderful casserole to take to family functions. Again, thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joanne"
},
"reviewBody": "This recipe was a good idea to start with since I was looking for a recipe to use my homemade hashbrowns which I had alot of. I'm usually not one to make alot of substitutions because then it becomes another recipe? But I did, and it turned out great! The only ingredient I didn't change because I had on hand was the cheddar cheese. My subs were, Greek yogurt for the sour cream, cream of chicken for the mushroom, homemade caramelized onions for the French fried onions, and French's crispy jalapeños just because.\nIt was delicious and I intend to make the original next time! Thanks for the idea!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mgtodd1"
},
"reviewBody": "This was super easy and quick to prepare. It smells wonderful and tastes fantastic. The whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was super easy and quick to prepare. It smells wonderful and tastes fantastic. The whole family loved it!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "AnnieM"
},
"reviewBody": "I found this to be bland and flavorless. It was gloppy and tots were mushy. It was horrible. I followed the directions but added a dash of garlic powder. Nothing could help this dish. Cannot understand the great reviews."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marilyn R. Kay"
},
"reviewBody": "I made the recipe as written. It was very good and similar to a recipe that I make with hash browns so I thought I would be good. I would make it again. I made it on National Tator Tot Day!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenR04"
},
"reviewBody": "This is a family favorite! I add 1lb. browned, seasoned hamburger for a hearty winter meal. My kids love it so much, my 19 year old asked for it as his birthday dinner!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Justin Metz"
},
"reviewBody": "This is one of my favorite “I don’t wanna cook” recipes to make. It’s so easy to make it takes about two minutes to prep. After some attempts I swapped out the cream of mushroom for a good, buttermilk-based ranch (Ocharleys or litehouse) and added a layer of American Cheese over the top (before adding the onions). I feel like there is a lot you could do to this (bacon, broccoli, shredded chicken or beef) but it’s perfectly great as is. This doubles as a good family comfort meal or the office/church potluck hit."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JessicaM"
},
"reviewBody": "I have made this many times since discovering the recipe. It is great as is but usually I add or substitute a few things. I use onion flavored tater tots for a little extra oomph to the dish. For the cream of mushroom soup I have used cream of chicken, celery or onion on occasion. They all tasted fantastic! I also add a can of french sliced green beans (drained) to the sauce mix. It lets me imagine that its a little bit healthier and the flavors go well together! I also add a tiny bit of milk to thin the sauce out just a bit so it can get inbetween all the tater tots and not sit on top of them. Overall an awesome recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sherry Ralph-Lyle"
},
"reviewBody": "I swapped regular onions for crunchy onions. So when it cooked, it was extra delicious and the onions soften also and have tons of flavor."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kaitlin Walters"
},
"reviewBody": "Love it! So good, make it ALL the time! Hard not to eat it all ;) You gotta try it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Pete"
},
"reviewBody": "Loved it. I didn't thin we would like it as much as we did. Used it as a side for vegetarian sloppy joes. There was a lot left over but it didn't last long. Followed the recipe to the T except added a little more cheese."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sandycooks"
},
"reviewBody": "So easy and delicious. I have made it several times for pot luck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rachel"
},
"reviewBody": "Easy and surprisingly good.Entire family of 4 did not complain."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "CC"
},
"reviewBody": "Great flavor. If making for kids leave off the onions...they think it's a suspicious smell. Just toss some cheese on top. But the adults loved it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Paulissa Edana Kipp Cpsws"
},
"reviewBody": "This is my basic tater tot casserole recipe. I switch it up by adding ground turkey, ground beef or today, ground hot pork sausage. I replace the sour cream and soup with French onion dip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica Freeman"
},
"reviewBody": "This is so easy and SO delicious! The kids and the husband love it. This has become my go-to meal at the end of a hectic day. You just throw it together and throw it in the oven. Try it! You won't be disappointed!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "sheryl"
},
"reviewBody": "It was good, but not satisfying. Personally, I think it needed salt, pepper and garlic powder. my son liked it a lot. I also think the sauce to potato ratio is a bit large, so maybe cut down on the sour cream and calories at the same time. I think I would make it again if I had the ingredients, but probably would have to improvise a little"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "craftygal"
},
"reviewBody": "This is one of my most favorite recipes! Especially perfect for those freezing cold nights like tonight but anytime is a good time for it. I do add a pound of browned ground beef and that turns it into a meal. Also, I double the soup needed but leave everything else the same. It's so easy and delicious."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "racheld"
},
"reviewBody": "Super easy and good! Added hamburger."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LibertyBelle78"
},
"reviewBody": "How my husband made it through a 1970s childhood without trying this dish is beyond me! I just made him his first Tater Tot Casserole yesterday, using this recipe. I lined the dish with parchment paper, then warmed half the tater tots and smashed them in the bottom of the casserole dish to make a solid potato layer. I added a pound of already browned meat and onions, then a cup of cheese, a sprinkling of the French Fried onions, then the cream sauce. I topped the cream sauce with the remaining tots, the rest of the shredded cheese, and some more French Fried onions. He LOVED it. Thanks for the great improvements on what was always a childhood favorite of mine!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Stanko"
},
"reviewBody": "I made this last night. Used cream of celery though. Put kielbasa chunks in and mixed veggies. Like others I put twice the cheese. My picky eater gobbled this up, veggies and all. Would actually double by putting another layer of food,tater tots,veggies ,kielbasa, seasonings,sour cream/soup mixture next time. My husband wanted leftovers of this.:) This seems like a great dish to take to a potluck."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Community"
},
"reviewBody": "Cream of chicken solves all the problems with taste. It is easy and a good comfort type food. High fat and calories! Yum when you need it!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kcollins2"
},
"reviewBody": "This is probably the stupidest question...I'm a new cook ;) Do we cook the tots FIRST before placing them in the dish? Or do you place them in the dish just thawed and uncooked?"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sweetness"
},
"reviewBody": "If you read a previous review under my \"name\"? That wasn't me. I have no idea how that got there. Anyway, I did really like this dish. Although, I'm not a fan of sour cream. So, next time I will use less. I did use a double batch of \"Mexican\" mix shredded cheese. I don't think it would make all that much of a difference in the taste. Many reviews have said to/and have used double the amount;but I would go as far as using triple amount with the last \"cup\" spread over the top."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "308guy82"
},
"reviewBody": "No."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Danny"
},
"reviewBody": "I followed the other reviews and added an extra cup of cheese and ground beef to make it a meal. I mixed the browned and spiced up ground beef with the soup, cheese and sour cream and topped it with a little extra cheese before putting the French fried onions on. It was a big hit. Everyone licked their plates clean. Thanks for this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Joannie Holzwarth"
},
"reviewBody": "But I made a few changes too. I used campbell cheddercheese soup and added hamburger to the recipe.Its already a house favorite. kids asked for it 3x/2weeks."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carolyn Coleman"
},
"reviewBody": "this is easy and very tasty my family loves it, I make it with ground turkey meat"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "I added a packet of dried ranch dressing to the sour cream mixture"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "linda"
},
"reviewBody": "YUM. Easy to make.Loved it.Thanks for sharing."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Claire"
},
"reviewBody": "It was YUM! I added ground beef cooked with onion, garlic, salt and pepper, and put the tater tots on top. It was goood!! Best Tater tot casserole I have had!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jenjen"
},
"reviewBody": "Yummy! Took to a potluck and it was a huge hit! I replaced the mushroom soup with cream of chicken and the cheddar with Colby/Monterey Jack. Next time I am going to top it with bacon pieces:) Thanks for sharing this recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Very hearty, filling comfort food. I used low-fat sour cream and added a bag of frozen mixed veggies and it turned out good. Next time I'll use half the sour cream, or just cut sour cream altogether and use two cans of soup and a splash of milk. I'll also mix in half the fried onions with the soup and veg."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jennie2879"
},
"reviewBody": "First time I made this recipe,with the addition of minced onions, garlic powder and ground beef....my kids loved it! Second time I made it I was out of cream of mushroom soup so I substituted it for cream of chicken instead....kids loved it even more!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "AiliDeSpain"
},
"reviewBody": "Tasted really great, it was a bit greasy though and the tater tots fall apart, aside from that very tasty."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "e3gerlin"
},
"reviewBody": "This is so good! I reduced the sour cream to 12 oz, increased the cheese to 1 1/2 cups (colby jack that I chopped up), added a can of corn, and sprinkled garlic powder on top. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "1"
},
"author": {
"@type": "Person",
"name": "clayzzle"
},
"reviewBody": "Not good. Bland. Tater tots would've been better served alone. :("
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "jwilke"
},
"reviewBody": "Pretty delicious, although I prefer this type of casserole with hash browns."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jlm"
},
"reviewBody": "This is a fast &amp; delicious recipe that we really enjoyed. Only change would be to add the french fried onions at the end, about 15 minutes before finished, as mine started to burn &amp; I had to cover the dish with foil. I added a pound of sauteed hamburger &amp; a chopped onion to make this a main dish. I will definitely make this again. It would be great to double or triple the amount for a large party. So good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dani6477"
},
"reviewBody": "Best thing ever! I was worried that this wouldn't turn out that great but it was delicious! I added some corn, doubled the cheese and added a little garlic powder. So good. So yummy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pattiearnold"
},
"reviewBody": "Everyone loved this, especially the crunchy bits around the edge."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lothloriel"
},
"reviewBody": "I added cooked ground turkey sausage to the recipe and towards the end of cooking I topped it with the french fried onions and covered the top with shredded cheddar cheese. This one of my most favorite recipes! It's so delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarah L Simmons"
},
"reviewBody": "love love this one"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Michelle Rosenthal"
},
"reviewBody": "My kids loved it, my husband didn't. It was easy to make."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kathy Sarber"
},
"reviewBody": "Took this to a taigate and there wasn't a tot left."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shannon"
},
"reviewBody": "The ultimate in comfort food! This dish brings me back to my childhood...even my college sorority cook made this. This version is definitely better. After finding this recipe and making this many, many times now, I make the following changes: brown a pound of 93/7 hamburger, seasoned with garlic powder, pepper, and half an onion; no grease to drain! I brown an entire bag of crispy crowns instead of regular tots. I layer the hamburger meat over the crispy crowns, then spread the soup mixture, which incorporates the top reviewer's suggestion to add more sharp cheddar than called for, some French fried onions, and I also season the mixture with additional spices to my liking (garlic &amp; onion powders, a little paprika and pepper). I also use the Roasted Garlic Cream of Mushroom soup and the entire 16 oz container of sour cream. It's thick and creamy and using the back of a spoon, it spreads easier than you think. So what if the hamburger is mixed in? Top that with some additional cheese and bake 35-40 minutes at 350. 1-2 minutes before it's done, I sprinkle a few more French fried onions on the top and turn the oven to broil. After taking it out, let it sit for 10 minutes. Perfection! Now, if only my husband would let me add some green beans to the mix...."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "TaraAnne"
},
"reviewBody": "I had my 12 year old put this meal together and put it in the oven before we got home. The outcome was delicious, however not the healthiest meal in the world! Next time (and there will be a next time) I'll add 1/4C of milk to the soup/sour cream (to start) because the soup/sour cream mixture was quite thick and, once it started cooling down on the table, it started to congeal. My husband LOVED this which is weird b/c he doesn't \"love\" any food and in particular he's not much of a sour cream fan (he had no idea there was sour cream in this dish). I served w/a fried swiss chard &amp; spinach mixture and I'm glad I did because all the richness needed a counterpoint. A salad would be good to serve with this also... this would also be a good side (except it makes a LOT) to a (healthy) meal. Very good!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "APRILFRAZIER"
},
"reviewBody": "I made this for my sister's baby shower (\"Tot\" casserole!) and it was a hit! It was all gone between only 7 people. I baked it in a stoneware dish for the full hour and it was just right. Next time I'm going to try adding ground beef or chilli and having it as a meal through the week...Not the healthiest, but it is really good!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "red head .5 Italian .5 Irish"
},
"reviewBody": "This was amazing my husband is sooo picky and hates everything including sour cream. HE LOVED IT!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Matthew Ryan Brooksher"
},
"reviewBody": "My family and I LOVED it, esp my kids! I used sharp cheddar instead and doubled it (doubling it is necessary). I also mixed in half the FF Onions with the mix before spreading it on top, then poured the rest on top of the whole mix (along with some garlic powder) to top it off. Last but not least, I diced up some onion and mixed it in as well. AMAZING! The leftovers are even better :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Blaireli"
},
"reviewBody": "This was a great base casserole recipe! My husband was wanting a tater tot casserole that his mom used to make and this seemed to be close. The only thing that I added a pound of ground beef, browned and drained. Then I mixed everything together and put it into the casserole, rather than putting the tater tots in first and everything on top of it. I would definitely make this again. Thanks for sharing your recipe! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "lizzy730"
},
"reviewBody": "With a little bit of ground beef, this dish is great. My boyfriend and best friend devoured it! The best part is that it is extremely filling so one serving goes a long way. Will use again- such a different, yummy recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Melynda Downing"
},
"reviewBody": "wow wow! what a great recipe, I've made it exactly how the recipe called but did add a handful of potato chips to the top along with the fried onions, 1 of the best dishes I have ever made and it was a hit with everybody including a picky teenager. I will definitely be keeping this recipe in my recipe box and making it again. definitely a 5 star recipe"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "kimgar"
},
"reviewBody": "This was a great side at our cookout. I didn't have the French-fried onions, so I didn't mix the cheese in with the other ingredients but used it as a topping. I also didn't use the whole 16 oz of sour cream...probably more like 8 oz. Everyone loved it! I will definitely make this again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "mello"
},
"reviewBody": "Like alot of other reviewers on here, I added a layer of hamburger meat. To give some added flavor, I added an envelope of Lipton's Onion Soup Mix to my hamburger meat as it was cooking and it turned out delicious!!!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "squirreley"
},
"reviewBody": "I usually don't like potatoes that are made this way, but there is something about this recipe that I really liked. It will be my recipe to use when I make this type of potato again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Tracy Pierce"
},
"reviewBody": "This was SO GOOD. Kids weren't too thrilled when they heard what we were having for dinner, but they did a complete 180 once they tried it. I followed the recipe, but wanted to turn it into more of a meal, so I added a pound of ground beef (browned it and sprinkled it on top) and mixed in a can of green beans with the soup, sour cream, and cheese. Came out fantastic, I think my kids will be asking for this one regularly."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Rachel"
},
"reviewBody": "Easy recipe. Lacking in flavor. Tastes very pocessed due to the canned soup."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Shawna"
},
"reviewBody": "The best recipe ever! I've made it for several occasions and bbq's. Everyone loves this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Rebecca"
},
"reviewBody": "We love this recipe here!! I followed suggestions of some of the PPs and added a lb of ground beef and a dash of garlic powder. I also added a dash of pepper and used about 1.5 cups of cheese. Excellent!! Will definitely be one of our new regulars."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "inkmelilly"
},
"reviewBody": "The only thing I did diffrent is add the French-fried onions on at the end, maybe 10 minutes before it was done.\nI also added some frozen veggies, peas, green beans."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kristin84"
},
"reviewBody": "Excellent!!! i followed what some others did and used half the sour cream and doubled the cheese..also added sausage and onion...kids gobbled it right up!!!! will make again!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "bunnyslippers"
},
"reviewBody": "Yum! This was easy and delicious! I followed the recipe exactly. Next time, I think I will sprinkle some bacon bits on top. It reminded me of a loaded baked potato. I served it with a salad and nobody missed meat."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Follett"
},
"reviewBody": "This turned out great. I too added a few things to the mix. I cooked up a pound of hamburger with a little bit of diced onion. I also upped the cheese to 2 cups and added some frozen peas to the sace mixture. I was going to use cheese flavored French-fried onions, but the store that I go to only carrys them during the holidays. Will try them the next time. My husband loved it. It is definetely a keeper recipe. Thanks so much for sharing!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/17437/tater-tot-casserole-ii/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
"name": "Vegetable"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/17661/main-dish/casseroles/vegetable/tater-tots/",
"name": "Tater Tots&uml;"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/17437/tater-tot-casserole-ii/",
"name": "Vegetarian Tater Tot Casserole"
}
}
]
}
}
, "about": [
]
}
]