				
[
{
"@context": "http://schema.org",
"@type": ["Recipe","NewsArticle"]
,"headline": "Vegetarian Burrito Casserole"
,"datePublished": "2020-02-26T00:50:33.000-05:00"
,"dateModified": "2020-02-26T00:50:33.000-05:00"
,"author": [
{"@type": "Person"
,"name": "BONF"
,"url": "https://www.allrecipes.com/cook/594225"
}
]
,"description": "Soy burger-style crumbles, tomatoes, rice, vegetarian refried beans, cheese, and taco seasonings all layered on top of flour tortillas and baked. A tasty vegetarian treat that will send even the meat lovers running back for more!"
,"image": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/4m9lUBufg-b2-KvYfDrqW5eCG7Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/328187-c8bec36840aa4ee1baa85e7d8e743ae9.jpg",
"height": 250,
"width": 250
}
,"publisher": {
"@type": "Organization",
"name": "Allrecipes",
"url": "https://www.allrecipes.com",
"logo": {
"@type": "ImageObject",
"url": "https://www.allrecipes.com/thmb/Z9lwz1y0B5aX-cemPiTgpn5YB0k=/112x112/filters:no_upscale():max_bytes(150000):strip_icc()/allrecipes_logo_schema-867c69d2999b439a9eba923a445ccfe3.png",
"width": 112,
"height": 112
},
"brand": "Allrecipes"
, "publishingPrinciples": "https://www.allrecipes.com/about-us-6648102#toc-editorial-guidelines"
, "sameAs" : [
"https://www.facebook.com/allrecipes",
"https://www.instagram.com/allrecipes/",
"https://www.pinterest.com/allrecipes/",
"https://www.tiktok.com/@allrecipes",
"https://www.youtube.com/user/allrecipes/videos",
"https://twitter.com/Allrecipes",
"https://flipboard.com/@Allrecipes",
"https://en.wikipedia.org/wiki/Allrecipes.com",
"https://apps.apple.com/us/app/allrecipes-dinner-spinner/id299515267",
"https://play.google.com/store/apps/details?id=com.allrecipes.spinner.free&hl=en_US&gl=US",
"https://www.youtube.com/c/foodwishes",
"https://www.linkedin.com/company/19312/admin/"
]
}
,"name": "Vegetarian Burrito Casserole"
,"aggregateRating": {
"@type": "AggregateRating",
"ratingValue": "4.6",
"ratingCount": "140"
}
,"cookTime": "PT45M"
,"nutrition": {
"@type": "NutritionInformation"
,"calories": "487 kcal"
,"carbohydrateContent": "36 g"
,"cholesterolContent": "45 mg"
,"fiberContent": "8 g"
,"proteinContent": "51 g"
,"saturatedFatContent": "10 g"
,"sodiumContent": "1807 mg"
,"sugarContent": "6 g"
,"fatContent": "18 g"
,"unsaturatedFatContent": "0 g"
}
,"prepTime": "PT20M"
,"recipeIngredient": [
"0.75 cup white rice",
"1.5 cups water",
"1 (12 ounce) package frozen soy burger-style crumbles",
"1 (28 ounce) can whole tomatoes, drained, 1/4 cup juice reserved",
"2.5 teaspoons chili powder",
"1 teaspoon cumin",
"1 (1.25 ounce) package taco seasoning mix",
"2 (10 inch) burrito-size flour tortillas",
"1 (14.25 ounce) can vegetarian refried beans, divided",
"2 fresh jalapeno peppers - seeded, sliced, and divided",
"1.5 cups salsa, divided",
"2.5 cups shredded Cheddar cheese, divided" ]
,"recipeInstructions": [
{
"@type": "HowToStep"
,"text": "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover, and simmer for 20 minutes."
} ,{
"@type": "HowToStep"
,"text": "Preheat oven to 375 degrees F (190 degrees C)."
} ,{
"@type": "HowToStep"
,"text": "Place soy crumbles, tomatoes, reserved tomato juice, chili powder, cumin, and taco seasoning in a medium frying pan over medium high heat. Cook and stir, breaking up tomatoes, for 10 minutes."
} ,{
"@type": "HowToStep"
,"text": "Lay 1 flour tortilla in a lightly greased 8x8 inch baking dish. Layer with one half of the beans, jalapeno slices, rice, salsa, soy mixture, and 1 cup Cheddar cheese. Repeat layers with remaining ingredients, beginning with the flour tortilla, and top with remaining 1 1/2 cups Cheddar cheese."
} ,{
"@type": "HowToStep"
,"text": "Bake in the preheated oven for 15 minutes, or until heated through and cheese is melted. Serve immediately."
} ]
,"recipeYield": ["8"]
,"totalTime": "PT65M"
,"review": [
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "An immediate hit - incredibly tasty. Nice and cheesy! Next time, I might add corn and green peppers, spinach or broccoli for contrast and extra nutrition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dexbarks"
},
"reviewBody": "Yum! Thanks for this tasty recipe. Perfect with a salad on the side."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Carol Michael"
},
"reviewBody": "Instead of rice I added squash just to add vegetables rather than starch. Loved it"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Beth_4"
},
"reviewBody": "I wanted more veggies, so I sauteed a med onion, garlic, one zucchini and one yellow squash and added it to the step wtih the crumbles and it was really great. I will definitely make this again. Definitely 9x13 pan-- filled it to the top. I also baked it 30-45min."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Kate"
},
"reviewBody": "I liked this as will definitely become one of our regulars! I will echo others though and recommend that you make this your own. I used what was in the house, a can of black beans instead of the vegetarian crumbles and caved jalapeno instead of fresh, and added what we like, sauteed garlic, a can of corn, and fresh onions, peppers, and olives. and for layering do whatever seems easiest to you, just be sure to use a 9x13 pan!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "starryj13"
},
"reviewBody": "I added spinach &amp; mixed everything in one skillet, including the cooked rice. It filled a 9x13 dish &amp; made 3 meals for two of us. Delicious!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "babzter"
},
"reviewBody": "This is so easy and so tasty. I froze half and it tasted just as good when reheated!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "chefdoc1995"
},
"reviewBody": "This is an excellent weeknight vegetarian recipe. Even my meat eaters loved the flavor. I made the recipe as stated and my family really enjoyed it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Desmond_d"
},
"reviewBody": "Added green peas and corn...and less tomato.."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "climbingjones"
},
"reviewBody": "I love it when vegetarians try to make not meat taste like meat. Nice."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lbdawson"
},
"reviewBody": "DELICIOUS!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Miekel McLaren Henderson"
},
"reviewBody": "It was delicious! I followed another poster's advice and didn't use tomatoes and salsa. I used only salsa. I substituted green chilis for jalepenos only bc they would've been too spicy for the kids. I think jalepenos would be delicious though. I also realized that with the salsa, the chilis weren't necessary. Will definitely make again."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "eadesmom"
},
"reviewBody": "We all enjoyed this! We made the recipe almost as written, except used 'mexican soy ground' and next time, if using the mexican ground, I would use only 1/2 a pkg of taco seasoning (or reduce the chili powder) as it was very, very spicy! (Very spicy in a delicious way - but a tad too much in my opinion! ) We also added a few more flour tortillas so that there was a complete layer of tortilla on the bottom and in the middle that covered the 9 x 13\" pan. Yum! Thanks!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amd1953"
},
"reviewBody": "This was absolutely delicious!!! Only thing I'll change is add the entire juice from the tomatoes, it definitely needed more moisture to the \"meat\"."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Stephanie Gregerson"
},
"reviewBody": "I halved the recipe and then put it in the 8x8 pan. It fit very well. I also did not put the salsa IN the recipe I used it as a topping with the sour cream (non fat plain Greek Yogurt). It turned out very well. 4 servings is plenty with just me."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen Iacovelli"
},
"reviewBody": "Loved this recipe! I made mine layered, like a lasagna, with whole wheat flour tortillas, added black beans and cayenne pepper as well as extra jalapenos to spice it up a bit. I also completely ignored the measurements for the cumin and chili poweder and just loaded it in since we like our food spicy. It was a huge success and made a TON of food! Can't wait to have the leftovers!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Bruce Jost"
},
"reviewBody": "I'm giving this recipe a \"5\" even though I followed it exactly. These are the changes I would make the next time I make it:\n\n1) I used veggie burgers made by a company that is synonymous with AM. I found them tasty, but rubbery. Next time I'll use Costco's black bean burgers. They' very good.\n2) I will use Mexican tomatoes.\n3) I forgot to add the salsa and realized it just as I popped it into the oven, so I just poured it all over the top and spread it out so that it covered the cheese.\n\nAll in all, a keeper. This is what I'll eat on this coming week."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "leanna"
},
"reviewBody": "Hooray for vegetarian casseroles that turn out so yummy! I work nights and am always looking for things i can make in the day for my husband to just heat up at night and this worked great. So its a tasty casserole that can easily be made ahead. And anything my daughter can drown in sour cream she will eat and this goes good with sour cream."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Glen Allen Harber"
},
"reviewBody": "Awesome!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Eddy Bikales"
},
"reviewBody": "Raves all around! Fed seven hungry people easily, with about two portions of leftovers. Substituted Trader Joes Chorizo Sausage (vegetarian) for the soy burger crumbles and used only half the taco seasoning, since the chorizo is already very spicy. Gave it a hot tangyness that people loved. Cut the jalapenos also. Have sour cream on hand for those who can't handle the hot spice. Also chopped up about three carrots and microwaved them for two minutes then tossed them in. I made mine ahead so it had been in the fridge, so I increased the oven time to about 35 minutes. Served it with Pumpkin Casserole from allrecipes and they complemented each other well! Have a glass of red wine with the whole thing. Yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "lcv inVermont"
},
"reviewBody": "This was very good and tasty. I made it exactly as written and was a little concerned that it would be over spiced for my taste but the rice cut the abundance of spices well and it came out great. I served it with sour cream and guacamole on the side with a green salad."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ann"
},
"reviewBody": "Tasty and filling."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leah Mackrell"
},
"reviewBody": "This dish is delicious!!! I went according to recipe except I added all salsa instead of salsa and tomatoes. It came out soooo good. I used a 13x9 pan and everything fit just fine. I will definitely make this recipe again and will be sure to share it with my family and friends."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Monte"
},
"reviewBody": "Fantastic recipe. My husband raved about it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JodiJean"
},
"reviewBody": "Delicious! I added meat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "jessicamoore088"
},
"reviewBody": "SO GOOD"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SHREY"
},
"reviewBody": "So I made one modification and instead of salsa used enchilada sauce. I also added onion to the soy crumble mixture. It tasted good. Next time though, I think I will eliminate the tomatoes and add enchilada sauce and onions to the soy crumble, i think that should perfect it for my taste."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Ma Harden"
},
"reviewBody": "Oh my goodness!! The hubby said this is \"restauranty\" lol It is just delicious! Great recipe, easy to make and yummo!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "StacyB1012"
},
"reviewBody": "Delicious! I used corn tortillas and added onion and zucchini to the crumble mixture. But really you can't go wrong with this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "suziecooksalot"
},
"reviewBody": "Everyone in our house loves this even the die hard non-vegetarians!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Caroline"
},
"reviewBody": "This was pretty tasty. I altered the recipe a bit by subbing ground beef for the soy burger crumbles. I made it the night before by putting everything except the toritillas in a casserole dish. I heated it up for dinner the next day and spooned it into tortialls with cheese and sour cream. Worked out great!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandi"
},
"reviewBody": "Really excellent meal, filling and satisfying. I used homemade corn tortillas instead of bought but otherwise same reciepe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Dantastic"
},
"reviewBody": "This was a MAJOR hit with the friends, will definitely be making it again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "idknittynurse"
},
"reviewBody": "Very tasty!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Foxy"
},
"reviewBody": "Wolfed down by vegetarians and carnivores alike. Used canned diced tomatoes, drained, and kept an extra 1/2 cup of juice. Used corn tortillas and L/F mexican blend cheese. I think next time I will warm up the beans so they spread easier."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Maralina"
},
"reviewBody": "My apologies but I turned this into NOT a vegetarian recipe. I used ground turkey but flavored it as listed in the recipe. The turkey was super delicious and making it into a casserole was a great twist. It's really more like a flat burrito but the flavor was wonderful. Instead of whole tomatoes in the can, I used crushed tomatoes and hot salsa along with some diced habanero. Definitely a keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "deirdrejayne"
},
"reviewBody": "Sounds good but leave the rice out of it, use more beans or soy crumbles instead and use corn tortillas instead of flour.-if you must use rice use something other than white rice. Thanks for an other wise healthier mexican favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jamie Justice Yost"
},
"reviewBody": "I'll be the first to admit (obviously from my photo) that I didn't make a casserole with this because I was in a hurry and just made regular ole burritos instead of the pie! I did use the veggie crumbles, however, and it was awesome! My jalapeno was, um, kind of gross (coulda sworn it was still good. I was WRONG) so those unfortunately got left out, but the good news is that my husband reacted quite favorably to the veggie crumbles and the meal in general, so this will be making a repeat appearance, hopefully in pie form next time :) Thanks for helping our household wean ourselves off meat!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "dorian227"
},
"reviewBody": "Love it, love it, love it! The modifications I made were using brown rice and wheat tortillas. I also used rotfl Mexican tomatoes. Delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "pomplemousse"
},
"reviewBody": "I really liked this, but I didn't actually make it as directed, so I can't really rate it accurately. However, most of my changes were simply out of necessity and I don't think would have changed the final taste much. I didn't use rice because I didn't feel like making it and don't usually like it in dishes like this anyway. I used four frozen veggie burgers and chopped them in my food processor. I had leftover bean dip and used that instead of refried beans, and did not have jalapenos, but I did have salsa verde salsa, so I used that as a substitute for both jalapenos and the salsa. Worked well, and my veggie meat hating bf couldn't even tell that was the \"meat\" in the casserole. I'll make it again, but I would put the salsa in with the pan with the tomatoes because it was hard for me to mix it in during the layering stage."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Elizabeth"
},
"reviewBody": "Good! I simplified mine a bit, though. I mixed the prepared TVP with salsa and spices instead of adding tomatoes and sauteeing, etc. Then I layered everything in a 10 inch springform pan. It definitely needs to bake longer than 20 minutes, though, to heat everything through."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Marlys Maybonne"
},
"reviewBody": "Following the advice of others, I used a 9x13 casserole dish. I have a feeling that whomever originally wrote this recipe just made an error when typing the size of the dish. There's NO WAY this would fit in an 8x8 pan. I made a few minor changes...used brown instead of white rice, used 4 tortillas instead of two, used Mexican seasoned veggie crumbles so I omitted the taco seasoning (too much MSG in that stuff anyway), black refried beans with jalapeno (thus no fresh jalapeno). I cooked it for 25 minutes. It was outstanding...my first meal using soy products. I seriously could not tell there was no meat in this dish. Next time I make it, and I will, I'll probably add some corn and black olives. I'll also use a little sour cream when serving with some chopped avocado. I'm a meat lover, and I loved this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Alissa S"
},
"reviewBody": "Made it a meat lovers casserole and it was good. Great for leftover burrito ingredients."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "me"
},
"reviewBody": "This is so so good! Everyone loved it! Only changes I made, and it was due to personal tastes was, used whole beans, canned chopped chilies, and ground turkey. I did use a 13 X 9 pan, can't see how it would work in the smaller 8 x 8. \n\nI will make this often. It's great for leftovers! i suggest having some lite sour cream on the side with this too. \nTHANK YOU for a great recipe!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SandraD"
},
"reviewBody": "I made this recipe as written except I used refried beans with green chilis instead of jalapenos. My family loved it and found it very filling. Thanks for posting this delicious recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Lee Wright"
},
"reviewBody": "this one i like very well, and its so easy!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tperry1234"
},
"reviewBody": "This was very good. Though, we are not vegetarian, so it was just easier for me to use ground turkey instead (1 pound). One reviewer wrote that canned tomatoes, plus salsa was overkill, so in place of the huge can of whole tomatoes, I used a 15 ounce can of diced tomatoes which I just dumped in, not bothering to save the 1/4 cup for later. This worked out to be the perfect amount of liquid for my 1 lb. of meat. Also used a larger casserole, which it filled, so do not even attempt the 8x8. Mixed diced jalapeños right in with meat instead of layering. I think sliced black olives on the top layer would have been a nice addition."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "HOLLYBELL"
},
"reviewBody": "Oh my gosh people, this is a keeper! Make a 9x13 pan of it and just cut slabs off of it for days! Each day in the fridge, it tastes better and better. Absolutely delicious and different. Kind of like a Mexican lasagna. Only changes I made was chopped green chiles instead of jalapenos and I made in a 9X13, just laying the tortillas in the pan and tearing them as I needed to fit the shape of the pan."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "interdesignmsu"
},
"reviewBody": "OMG THIS WAS AMAZING! I EVEN GOT MY MOM TO EAT IT AND SAID SHE LOVED IT! (I DIDN'T TELL HER IT WAS SOY CRUMBLES)."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kim"
},
"reviewBody": "I made this last week for my mother and my tv night. It turned out great! I added some mushrooms and some roasted peppers. Comfort food at it's best."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cheri"
},
"reviewBody": "This was WONDERFUL! I didn't have any soy burger crumbles, so I added backbeans, onions, and mushrooms. I mixed the tomatoes, beans, mushrooms and onions in a large pot to add the seasoning and spices and then did the layers with rice, bean-mix, and cheese. Also added a can of ( hot)enchilada sauce just because we had it laying around. Amazing! Less messy than regular tacos or burritos, and way way better! This will be a new favorite!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Natalie"
},
"reviewBody": "Delicious! Was in a hurry so I'm sure I messed some things up but it still ended up perfect."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "rippy_14"
},
"reviewBody": "I really enjoyed this recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Leigh Ann Lough"
},
"reviewBody": "I've made this before with veggie crumbles, but last night i substituted beans in place of crumbles to save some money. I used a can of red kidney beans and a can of chickpeas (both drained and rinsed beforehand, of course), but you could probably use whatever kind you wanted. The bean version was just as good, maybe even a little better!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "LADYBUG011"
},
"reviewBody": "We love this recipe. I found it is very easy to just throw everything except the refried beans, cheese, and tortillas in a rice cooker. I let it all cook, then layer. Very easy and very fast."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "2"
},
"author": {
"@type": "Person",
"name": "Jennafir"
},
"reviewBody": "Didn't enjoy this recipe as much as others did; thought the flavors to be a bit boring, but might be good w substitutions. Makes a TON of food, so use a 9x13 if you try it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kippieco"
},
"reviewBody": "This was great. Everyone really liked it, even the kids were asking for left overs."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "FlyGrl81"
},
"reviewBody": "Delicious! I omitted the tomatoes and 1 jalepeno could be enough, but it's a keeper! Awesome leftovers! I also used corn tortillas--very good! Thank you!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jane"
},
"reviewBody": "Made this with Mexican protein veggie crumbles and it was delicious! My husband, who is not a vegetarian, didn't complain about the lack of meat. He had two helpings then leftovers the next night. A keeper!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brianna Woody"
},
"reviewBody": "This is a great recipe for adapting - we've made it many times. It's entirely too much for an 8x8 though, that wastes ingredients. We make it in a 13x9 like this: First lay down 2 tortillas, side by side. Cover in refried beans. We use a small can of green chiles instead of jalapenos out of personal preference. Layer the rest of the ingredients in any order: peppers, rice, all of the TVP mixture, salsa, &amp; cheese. Top with 2 more tortillas, remaining refried beans, some salsa, we add diced onion here, &amp; the remaining cheese. We serve with Mexicorn on the side, would be great in the dish as well, maybe with some black beans as well. Top with sour cream, corn on the side. It's really impossible to mess this dish up, so change it up to what suits your needs &amp; it will most likely still be great."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "amandak23k"
},
"reviewBody": "Yummy Yummy Yummy! I really enjoyed this for dinner. I changed things to match what I had on hand. I used about a cup of instant brown rice. I left out the soy burger-style crumbles just because I have no interest in trying them. I cooked the veg. refried beans in a saucepan with a 14.5 oz can of diced tomatoes with jalapenos with none of the juices drained out. I added in my own taco seasoning instead of a packet. I used 4 fresh jalapenos and 1/4 of an onion that I threw in the pan with the beans and tomatoes. I also threw the salsa in the with the beans and the rice once it was cooked, so I wouldn't have to do so much layering. I did a whole wheat tortilla then bean mixture and cheese, another tortilla bean mixture and cheese, then another tortilla and topped that with the rest of the cheese. I think this cooked 40 minutes altogether and I only let it rest 5 before I cut it ( I was too hungry to wait anymore! ) Will make again, thanks for the great recipe."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sandra S."
},
"reviewBody": "Excellent recipe! I make it all the time. You can prepare ahead, but the cook time is 45 minutes. I usually make this one and one with ground beef for my hubby. I divide the recipe in half and use fajita size tortillas instead. I also add corn."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Karla Spindler"
},
"reviewBody": "LOVED it! After tasting the soy mixture while cooking, I was worried that we wouldn't like this casserole but once it's all put together and cooked through, it has a flavor that my whole family loved! I did not have any jalapeno on hand so I left them out and I used six 6\" corn tortillas instead of the two 10\" flour tortillas."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jeanne"
},
"reviewBody": "I used the Boca Grilled meatless burgers and crumbled them myself and I think it really MADE it. I keep getting requests for the recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Sarahsue"
},
"reviewBody": "This is one of my favorites! I love cooking this up and eating off of it for a week! My non-veggie friends love this as well--most of them couldn't even tell that it was soy crumbles. I've also added a little sour cream and black olives for extra zip."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "cookingin613"
},
"reviewBody": "I don't even know how appropriate it is for me to review this since I changed so much...I used tofu instead of soy crumbles, brown rice instead of white, added green onions and peppers since I had them around I dropped the salsa and jalapenos altogether. But it is a really great idea and very very yummy. I will definitely make this again! Also, I served it with sour cream, which was a great complement for this dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ALZ"
},
"reviewBody": "I thought this recipe was excellent. A simple idea with lots of flavor. As others suggested, I used both tomatoes and salsa (chunky salsa so it wouldn't be runny), and omitted the 1/4 tomato juice reserve. I also was able to make two of these with the amount of ingredients listed - both in small round casserole dishes using smaller 6-inch tortillas. Will definitely make again soon!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JonnyUtah"
},
"reviewBody": "My family and I definetly dug this one! Great tast great texture.It seems easily twikable to personal preferance which I like. The meat lovers didn't know they wern't eating meat either. I think next time ill add a some corn and a little diced purple onion. I also think sour cream and cottage cheese would be a delicious addition to make it more of a mexican lasagna."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Stacey Greenberg"
},
"reviewBody": "I made this in the 8 X 8 pan and cut into eighths like a pizza, so they were served as triangles which presents nicely. I love this recipe, it's easy and delish and reheats wonderfully. My only complaint is that the sodium level is quite high."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Charlene"
},
"reviewBody": "Fantastic."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "SnyderFamily"
},
"reviewBody": "This was great, but we did make a couple changes. We left out the salsa, and substituted GrapeNuts cereal for the burger crumbles (sounds weird, but it's great!!) It's a family favorite now!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "GRETCHEN"
},
"reviewBody": "I made this exactly as stated in the recipe and it turned out great. Very tasty and filling. You can eat this comfort food and feel full and satisfied."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "ella1mom"
},
"reviewBody": "This was very tasty. My husband and my two year old daughter both enjoyed it. I did omit the soy burger crumbles and used brown rice instead of white, but it was delicious regardless. It was quite easy to make, I followed the instructions as stated and it turned out wonderful! Thanks for the recipe, we will definetely be making this one again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JenInTheKitchen"
},
"reviewBody": "Delicious! As others have said, it will NEVER fit in an 8x8 pan. Go with a bigger dish."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Brie Fox"
},
"reviewBody": "I tried this recipe over the weekend and it was DELICIOUS! My only suggestion is that when adding the chili pepper, which can be spicy, really SPRINKLE it over the 'meat mixture.' Otherwise, it won't mix well and you'll have spicier bites of the casserole than others. In general, this was easy (my toddlers helped me make it!), fun to make, and really, really delicious!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Katie"
},
"reviewBody": "Got rave reviews at my house. Here is what I did differently, though I'm sure the original is great as well. I used 3/4 a bag of soy crumble (not the full bag - used 1/4 to go in some dip). To make the recipe healthier, I used black beans that I drained, microwaved, and mashed instead of re-fried beans. I used brown rice instead of white rice. I also added 1/2 cup of bell peper and 1/4 cup of onion to the soy crumble mixture. Used diced canned tomatoes instead of whole canned tomatoes b/c that's what I had at the house. I also used more 1/2 cup more salsa than indicated."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "tauxier"
},
"reviewBody": "Excellent! We topped it with sour cream and fresh cilantro. I used brown rice instead of white rice and whole wheat tortillas. Big hit even with the \"meat eaters\" in our family."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JADE1977"
},
"reviewBody": "This was great. Will make again and again, but boyfriend requested that we make this a fall/winter/cold weather day recipe. Used the vegetarian re-fried beans recipe from this site. Both came out excellent."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Jessica S."
},
"reviewBody": "This was a great recipe. I did make a few changes though. I used two layers of corn tortillas instead of flour, I used a large jar of southwest salsa and no additional tomatoes, I also used flavored mexican rice instead of plain. Everyone loved it and it was soooo easy!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "JENNIFER"
},
"reviewBody": "This is a recipe I will modify and make again and again. A couple of notes. First, either tomatoes OR salsa is sufficient (I used \"mexican\" seasoned stewed tomatoes - way cheaper than salsa and just as flavorful). Second, next time I will add extra veggies (corn, zucchini, carrots, etc) to the mix. Third, I had a hard time layering! Next time I will mix everything together except the cheese and tortillas - it's a casserole after all :) Finally, I had to use a 9x12 or so baking dish! There's no way that volume of food would fit in an 8x8. Oh, and I used corn tortillas - still unrefined (as is whole wheat) but more flavor and texture. Thanks for a new go-to recipe - this will be a great one for a week's worth of dinners!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "maffy"
},
"reviewBody": "I LOVE this! I have made it about 5 times in the last few weeks. I added more beans, because I love beans, especially refried black bean. I also have done different variations with yellow summer squash, onions, green and red peppers, okra and zucchinni. Its been a huge hit at potlucks and when I have had guests over. I use brown rice and omit the salsa, because I think it might be a little runny with the salsa. I will make this again and again! yum!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "TARIYORK"
},
"reviewBody": "This was just o.k. It was very filling and it makes a ton. I don't think I will be making this again as I didn't like the flavor that the \"meat\" gave it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "coralee"
},
"reviewBody": "Of all the complex, gourmet or exotic recipes I have tried from this site, this is the one that my husband likes. It's easy, quick and so good. I kept it pretty much the same. I too put the patty;s in the food processor. Next time I will just crumble them, they were a bit too mushy."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jill Darminio"
},
"reviewBody": "This recipe was super easy to make and absolutely delicious! Even my husband loved it and he is definitely a meat eater!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "3"
},
"author": {
"@type": "Person",
"name": "Veggie"
},
"reviewBody": "This was okay. I omitted some of the tomatoes because of the tomatoes and salsa, and I used cubed zucchini and some canned corn instead of the soy crumbles. I didn't have any jalapeños, so I didn't add them either. I think this would be better with just salsa (no tomatoes) and some kidney beans. I may try this again with these modifications."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nikki Manogue Maramonte"
},
"reviewBody": "this was excellent and pretty fast to prepare...I didn't have any canned tomatoes, so I used 2 fresh, cut in big chunks and then just added chunky salsa to the meat mix(i used frozen turkey sausage) and left out the salsa while layering...served topped with sour cream, black olives and hot sauce...my husband begged for the leftovers for his lunch the next day."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Amanda Lunberg"
},
"reviewBody": "This has become my husbands absolute favorite meal! He asks for it again and again. I think the recipe is perfect as is. It's quick, easy and delicious. It's a wonderful taste of home for me, living in the UK, from California. Thank you for sharing it."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "kdmorgan77"
},
"reviewBody": "Tried this tonight for the first time, and it was really good! I think the beauty of this recipe is that you can use whatever ingredients you have on hand, adjusting it to what your preferences are. This has great flexibility that way."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "SequoiaSkye"
},
"reviewBody": "Very Good, but required some alterations. I don't think that the salsa was necessary. The tomatoes took care of that. We also omitted the faux meat and added corn in its place. Used Ancho chili powder and reduced it by half a teaspoon and it was still plenty spicy, but not hot. I also didn't use all the cheese. The casserole was plenty rich enough without it and it made it healthier. Will definately do again!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "sbradfield"
},
"reviewBody": "This was so delicious! I varied my just a little bit to make it healthier. I substituted couscous for the rice and used whole wheat flour tortillas. I made it with the refried beans, but also tried whole black beans, and it still tasted delicious. My husband gobbled it up - it's all that matters! :)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Jen van Buren"
},
"reviewBody": "Used what was on hand.. Brown rice, wheat burrito style tortillas, spicy black bean salsa (nixed the peppers). Loved it and the leftovers are great too!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Nzingha"
},
"reviewBody": "This was delicious, I can't believe my husband actually liked it. He normally doesn't like anything without REAL meat!! Terrific recipe!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "somaluna"
},
"reviewBody": "this was really good and filling. i added a small can or corn too. the leftovers were even better."
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "5"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "Really good recipe..absolutely delicious. We didn't stick strictly to the flavourings on the list but it still worked ok. We used salsa and curry powder in varying amounts the times we made it...depending on who was eating it and whether they were into spicy foods or not. also worked with pieces of pepper mixed in with the mince substitute/burger crumbles. Quite a bit time consuming, but filling and tasty so defo worth it! A++"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "raesquared"
},
"reviewBody": "Very tasty dish. Makes a great \"make ahead\" dish - bake when ready to eat. I used a few variations - delicious either way!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This was a very easy recipe to make. I used brown rice instead of white rice. It tastes great!!!"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "heather w."
},
"reviewBody": "easy to make and really good! i didn't use the \"meat\" crumbles because of my husband so i just reduced the amount of taco seasoning i added to the tomatoes and it worked wonderfully--although i know the crumbles would have added a nice texture. --and it reheated well too:)"
}
,
{
"@type": "Review",
"reviewRating": {
"@type": "Rating",
"ratingValue": "4"
},
"author": {
"@type": "Person",
"name": "Allrecipes Member"
},
"reviewBody": "This is a great casserole. Our friends, veggies and carnivores, both like this one. I made a couple of changes of my own to it. I added more veggies, such as corn, peppers, and onions. I also used corn tortillas instead of flour out of personal preference. Delicious, thank you!"
}
]
,"mainEntityOfPage": {
"@type": ["WebPage"]
,"@id": "https://www.allrecipes.com/recipe/76429/vegetarian-burrito-casserole/"
,"breadcrumb": {
"@type": "BreadcrumbList",
"itemListElement": [
{
"@type": "ListItem",
"position": 1,
"item": {
"@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
"name": "Latin American"
}
}
,
{
"@type": "ListItem",
"position": 2,
"item": {
"@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
"name": "Mexican"
}
}
,
{
"@type": "ListItem",
"position": 3,
"item": {
"@id": "https://www.allrecipes.com/recipe/76429/vegetarian-burrito-casserole/",
"name": "Vegetarian Burrito Casserole"
}
}
]
}
}
, "about": [
]
}
]